{
    "Wife of Supreme Court Justice Texted Trump's Chief of Staff to Overturn Election\n": [
        {
            "id": "i2av75n",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.54974616"
        },
        {
            "id": "i2bg5gg",
            "score": -1,
            "text": "Is there anything new in this article? Because it’s the same story we’ve been reading all week",
            "title_similarity": "0.30904275"
        },
        {
            "id": "i2bcrz2",
            "score": 6,
            "text": "This mf needs to be removed ASAP. It sucks he’s a black man, this is not the type of shot we need.",
            "title_similarity": "0.35326046"
        },
        {
            "id": "i2aytpq",
            "score": -59,
            "text": "All Americans care about is whether or not they can fill the hole inside by buying and consuming. They only care when that cycle is disrupted. See their rage over gasoline and not 1/6",
            "title_similarity": "0.53551906"
        },
        {
            "id": "i2bf0p4",
            "score": 8,
            "text": "I’m guessing there’s no crime there, at least a crime that could be prosecuted, but it doesn’t give comfort to the average citizen knowing that one of the Supreme Court Justices, who should rule based on constitutional validity without political bias, is married to a right wing conspiracy nut case who is willing to toss the constitution out the window to keep Trump in office.  Disgusting.",
            "title_similarity": "0.632252"
        },
        {
            "id": "i2befhx",
            "score": 9,
            "text": "And nothing will be done about it. \n\nJust another day in America.",
            "title_similarity": "0.33687884"
        },
        {
            "id": "i2bgtjw",
            "score": 1,
            "text": "And I bet you nothing will come of it because they're corrupt. Just like everyone else. We live under this illusion of freedom and capitalism. \n\nIt's all a lie.",
            "title_similarity": "0.3987047"
        },
        {
            "id": "i2bttm0",
            "score": 0,
            "text": "USA likes to talk about countries being corrupt.",
            "title_similarity": "0.40465063"
        },
        {
            "id": "i2bdcnz",
            "score": 5,
            "text": "Not saying this is cool, but what I am saying is that you've gotta understand that he could have sent those texts himself and STILL absolutely nothing would happen. Nothing ever happens.",
            "title_similarity": "0.32607868"
        },
        {
            "id": "i2bgf6d",
            "score": 9,
            "text": "Another Russian Asset that is immune.",
            "title_similarity": "0.15657553"
        },
        {
            "id": "i2bg79d",
            "score": 8,
            "text": "Im an independent, but this looks pretty bad. I would expect him to be brought up with impeachment as he’s going against the same principles to which he was elected. It probably won’t pass, but to me, this is a pretty big deal.",
            "title_similarity": "0.5475368"
        },
        {
            "id": "i2busit",
            "score": 4,
            "text": "We all know. Now put them all in prison.",
            "title_similarity": "0.28428164"
        },
        {
            "id": "i2be4vj",
            "score": 0,
            "text": "Just about time to fill another position. More supreme court changes in the last few years than in my entire life before that. Remember Alito? He \"conveniently\" died. Soon it'll be all new puppets. Gotta roll shit back 20-30 years or the peasants may get smart.",
            "title_similarity": "0.5104574"
        },
        {
            "id": "i2bt1y9",
            "score": 0,
            "text": "And nothing will come of it.",
            "title_similarity": "0.068433024"
        },
        {
            "id": "i2cge7s",
            "score": 0,
            "text": "I love how all it takes is political convenience and suddenly everyone's onboard with wives being their husbands property and responsibility again.",
            "title_similarity": "0.4574108"
        },
        {
            "id": "i2bfqsi",
            "score": 2,
            "text": "Don’t worry not a big deal they never discuss each other’s business so no way this would have influenced any of his decisions. 🤡",
            "title_similarity": "0.2820573"
        },
        {
            "id": "i2cbxoi",
            "score": 3,
            "text": "and not surprisingly, crickets from the hunter biden's laptop folks.",
            "title_similarity": "0.25327763"
        },
        {
            "id": "i2bno0e",
            "score": 6,
            "text": "But Obama had a Tan suit...just sayin...",
            "title_similarity": "0.14401902"
        },
        {
            "id": "i2bf1b0",
            "score": -3,
            "text": "Hate to say it but, birds of a feather.\n\nGet these two clowns out of here. No one, regardless of race or religion or political party, should be able to act like this and retain public office. \n\nLots of normal people have paid steep prices for their SO's actions. This should be no different.\n\nIf anything, this should be under a microscope and scrutinized at the highest level. I mean shit watch ted cruzs dumbass try and grill the new pick for supreme court over sentencing (which was fucking absurd) and then heading basically nothing on this? Wtf?\n\nThis is not only a public office, but a public servant at the *highest* level we have deciding things like abortion and gun laws, let alone election laws/rulings amongst other things that affect every single American. *Every single one of us*.\n\nAnd I find it hard to believe someone would marry a person, spend their life with them, and not bebok with their train of thought, their actions, etc.\n\nIf anything, they would support them more than anyone else.\n\nAnd given that, and the fact there's a ton of stuff we will never know or hear that has happened, backroom deals and convos etc ,that could have or has potentially affected each and every american, then how is his resignation not being called for, immediately.\n\nNo one in that position of power, with the duties the position is responsible for, should be able to retain said position after what we've learned.\n\nAnd imagine if we never learned this not other things and he had or has helped steer those issues towards his and his wife's and their friends, bosses, presidents,  corrupt or otherwise, towards outcomes that are goals for those people and their agenda. Imagine if he helped rule the election was wrong somehow and helped overturn it.\n\nHe needs to be told.go resign immediately or whatever course of action is needed should be taken via president or Congress etc to remove him from power and position immediately, like yesterday, and then appoint a new candidate.\n\nOr as soon as the current candidate is verified and goes on to her job, then Thomas replacement is immediately next.\n\nUntil then he should not be able to conduct any duties he's is responsible for and s substitute or backup which I'm sure they have should fill in until then.\n\nIt's rediculous and illegal and immoral at the highest levels. A supreme court judge. Honestly. \n\nI hope that after everything in this jan 6 committee is over they find enough on trump and his team and cabinet and people that they can seem punishment but also, he shouldn't be even allowed to run again.\n\nThe string ends they are pulling continue to unravel the huge wool over the American public's eye revealing the biggest corruption and illegal political actions and events we have ever witnessed in our generation(s).\n\nMore should be done. Punishment and sentences need to be handled out and examples made for future generations. I've seen people do far less and get crazy consequences and so far from this I think the punishment hasn't even begun to for the crime and people involved at all levels are still in office.\n\nLike Ted cruzs dumbass and the shining twins of the GOP (Greene and boebert) whatever their names are and so on. \n\nBlows me away that this is America and these people have been voted into position and power and just.. wow. \n\nJust...wow.",
            "title_similarity": "0.58021367"
        },
        {
            "id": "i2bnd8g",
            "score": 2,
            "text": "American Conservatives are Domestic Terrorists and should be treated as such.",
            "title_similarity": "0.5620341"
        },
        {
            "id": "i2byjoe",
            "score": 0,
            "text": "Kind of convenient he got sick when he did.\n\nAlmost like something was...uh..getting released.",
            "title_similarity": "0.2727692"
        },
        {
            "id": "i2c86sy",
            "score": 0,
            "text": "How do we know it was actually her and not him using her phone?",
            "title_similarity": "0.35418797"
        },
        {
            "id": "i2ciqy2",
            "score": 0,
            "text": "Trump's lawsuit for the 2016 russian collusion hoax should be juicy if it moves forward. Just the discovery alone would be amazing to see what actually went on during that time by the Clinton campaign.",
            "title_similarity": "0.61117476"
        },
        {
            "id": "i2d6gu1",
            "score": 0,
            "text": "Can we impeach a federal judge?",
            "title_similarity": "0.5580139"
        },
        {
            "id": "i2bijuy",
            "score": -5,
            "text": "Ever head or a wife of a military officer? Karen's using their husband's rank to get what they want. Almost never happens with others in the know. Same deal here. She can yell whine cry and all that about it but it wasn't going to happen. Nothing burger in this case.",
            "title_similarity": "0.5827943"
        },
        {
            "id": "i2bixeh",
            "score": 4,
            "text": "And nothing will come of this. Nothing. Which is a clear sign that our democracy is already dead. If you didn't think it was dead after the January 6th insurrection, then this should clear things up for you. \n\nNixon, impeached, resigned, pardoned, then the GOP torched Jimmy Carter, kept hostages in Iran so Reagan would win, and the slow death of America began. Gut public schools and social programs, massive military buildup, illegal wars, Oliver North trading cocaine for guns for right wing juntas....it's just....I have no words. Democracy in the US is dead. The last step is to bury it.",
            "title_similarity": "0.65082276"
        },
        {
            "id": "i2bqyu1",
            "score": -6,
            "text": "According to the texts this is when attorney Sidney Powell claimed that he had proof of election fraud. That's why she though the results were illegitimate. \n\nThis is a non-issue unless she had made those statements to undermine the election with the understanding that they would be breaking the law. \n\nWe are all guilty of the same thing. When we see headlines like \"The Russians Hacked Our Election\" your first thought is that we need to make sure the Russians don't get their way. \n\nI don't like that a Supreme Court Justice has family members getting so involved. I prefer the Supreme Court stay insulated from controversy. That's why this headline is so disturbing. \n\nJustice Thomas has to recuse himself from any case involving January 6th. Even if he's innocent of any involvement you must insist on  removing yourself from the case *even if there's the illusion of bias* so all parties accept judicial decisions. This maintains the integrity of the court.",
            "title_similarity": "0.6701777"
        },
        {
            "id": "i2b66py",
            "score": -39,
            "text": "How many times is this going to be posted?",
            "title_similarity": "0.1864876"
        },
        {
            "id": "i2bfbr2",
            "score": -1,
            "text": "Ginni don’t fit in the bottle. They want what is playing In Ukraine. That’s exactly what they want, and they’ll justify with: saving the country from communists.",
            "title_similarity": "0.55458534"
        },
        {
            "id": "i2bhmvs",
            "score": -29,
            "text": "This story is really getting a lot of play over the last week... But with no new information. Seems like it's being forced down our throats. I usually think that, with stories like these that are meant to incite outrage, that they're being used to distract us from something way worse.",
            "title_similarity": "0.45496345"
        },
        {
            "id": "i2b5vv7",
            "score": 21,
            "text": "This is a huge deal and needs more attention.",
            "title_similarity": "0.13152535"
        },
        {
            "id": "i2crdjh",
            "score": -4,
            "text": "Why are people talking about trump it’s been way over a year since he’s been in office !",
            "title_similarity": "0.49829286"
        },
        {
            "id": "i2avnss",
            "score": 9,
            "text": "Hmmmm not too much of a conflict of interest...",
            "title_similarity": "-0.018296346"
        },
        {
            "id": "i2bgnfy",
            "score": -69,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2b06ot",
            "score": -28,
            "text": "It’s been over a year and nothings happened…",
            "title_similarity": "0.11867167"
        },
        {
            "id": "i2bcgzz",
            "score": 1,
            "text": "FYI:\n\nThe only Justice to be impeached was Associate Justice Samuel Chase in 1805. The House of Representatives passed Articles of Impeachment against him; however, he was acquitted by the Senate.  [source](https://www.supremecourt.gov/about/faq_general.aspx)\n\n&nbsp;\n\n\n[Impeachment Trial of Justice Samuel Chase, 1804-05](https://www.senate.gov/about/powers-procedures/impeachment/impeachment-chase.htm)",
            "title_similarity": "0.5416842"
        },
        {
            "id": "i2az9f8",
            "score": 21,
            "text": "We can go all the way back to Reagan undoing The New Deal. We're at the end of the idea of America. We are now proceeding to Ameristan and nobody on either side stopped it.",
            "title_similarity": "0.5429121"
        },
        {
            "id": "i2bokms",
            "score": -25,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2bi07u",
            "score": 9,
            "text": "AND THAT SUPREME COURT JUSTICE DIDNT RECUSE HIMSELF WHEN THE JAN 6 HOUSE COMMITTEE SUBPOENAED THE NATION ARCHIVES WHICH HAD HER TEXTS.\n\nThe news needs to stop focusing on her. She didn’t do anything illegal or ethically wrong. Is she insane for backing 60-court-cases-unproven conspiracy theories? Yes. But Justice Thomas acted completely unethical for voting against handing over those records that had his wife’s texts.\n\nGet him to resign or impeach him.",
            "title_similarity": "0.6959867"
        },
        {
            "id": "i2biqpq",
            "score": -15,
            "text": "[deleted]",
            "title_similarity": "0.10913682"
        },
        {
            "id": "i2bp7ne",
            "score": -36,
            "text": "[deleted]",
            "title_similarity": "0.10913682"
        },
        {
            "id": "i2chjfh",
            "score": -5,
            "text": "Wait why isn’t Reddit screaming “RAAACCCIISSSSTTT!!”   O ya that’s right it only works one way.",
            "title_similarity": "0.2952813"
        },
        {
            "id": "i2chzej",
            "score": -5,
            "text": "He’s a black justice though. You guys should be happy. Diversity has been achieved.",
            "title_similarity": "0.22048347"
        },
        {
            "id": "i2bixau",
            "score": -29,
            "text": "LEFT OR RIGHT THEY ARE BOTH CORRUPT! \n\nWe need fresh new young thinkers to be able to navigate us through the tough times ahead.\nI don't feel well comfortable having 75+ year old senators making decisions for our country. \n\nJB administration had shown us nothing but cost us everything. Stop eating up the lies as both sides of aisles get more wealthy.  \n\nBasically wake the fk up!",
            "title_similarity": "0.6085918"
        },
        {
            "id": "i2b6ckf",
            "score": 10,
            "text": "I hope this gets repeated everyday until he acknowledges it or something happens. Don’t stop reminding people.",
            "title_similarity": "0.31766355"
        },
        {
            "id": "i2bsrnq",
            "score": 3,
            "text": "The Dems could just drop some false news that Clarence texted to BLM leadership. The Republicans would paint his house for the new tenants, before he’s even kicked off the bench.",
            "title_similarity": "0.6409122"
        },
        {
            "id": "i2bv44m",
            "score": -2,
            "text": "nothing to see here",
            "title_similarity": "0.02206643"
        },
        {
            "id": "i2bvt10",
            "score": 2,
            "text": "I hear Ginny is having a ninety pound mole taken off her ass. -Ralph Cifaretto",
            "title_similarity": "0.47448796"
        },
        {
            "id": "i2ccz5i",
            "score": -1,
            "text": "Ok...he's a POS, and she's loony tunes. How do her actions translate to him being asked to resign? I have yet to see anything that would tie him to her activities, so I'm confused. Surely, we are not making the mistake of assuming quilt by association.",
            "title_similarity": "0.5405556"
        },
        {
            "id": "i2d2xmu",
            "score": -2,
            "text": "Somehow democrats have become even more ridiculous than Republicans so I can't even committ to believing anything any of them says. Let's just hope the meteor is getting close.",
            "title_similarity": "0.48926273"
        },
        {
            "id": "i2b4wrt",
            "score": -47,
            "text": "So?",
            "title_similarity": "-0.05904596"
        },
        {
            "id": "i2bi0fz",
            "score": -18,
            "text": "But she doesn’t work for the government right libs?",
            "title_similarity": "0.4830672"
        },
        {
            "id": "i2bv6yz",
            "score": -7,
            "text": "\"And what are you going to do about it?\"  \n\n\n\\*Reddit crickets\\*",
            "title_similarity": "0.31114656"
        },
        {
            "id": "i2d67xo",
            "score": -6,
            "text": "Why are liberals so obsessed with punishing people who disagree with their opinions?",
            "title_similarity": "0.47929215"
        },
        {
            "id": "i2bf4bj",
            "score": 5,
            "text": "More than anything else... How is it that the wife of a Supreme Court Justice be down the Q rabbit hole?\n\nShe clearly believes this. She believed in Powell and the Kraken and all thst garbage.\n\nIf I was married to that I would seek to end my marriage.  Is Clarence Thomas also on thst train?  Holy fuck.",
            "title_similarity": "0.7382093"
        },
        {
            "id": "i2bg3cj",
            "score": 2,
            "text": "All these folks need to go to prison for treason.",
            "title_similarity": "0.4559016"
        },
        {
            "id": "i2bgpcp",
            "score": 2,
            "text": "This is the shit that anyone outside the US reads about and says, “ WTF, the US keeps telling us we’re corrupt and wants to maintain democracy so they’ve stationed troops in 120 countries around the world to “help” us, yet this is going on right under their noses?” \nZero credibility! Putin must be reminding his people about shit like this every day. CLEAN THIS SHIT UP!",
            "title_similarity": "0.6604476"
        },
        {
            "id": "i2ctz21",
            "score": -3,
            "text": "Jan 6th is the left’s Benghazi. When nothing of consequence happens they’re going to look so fucking stupid. The desperation now is tiresome.",
            "title_similarity": "0.38792163"
        },
        {
            "id": "i2c2clk",
            "score": -6,
            "text": "Can you imagine? A regular American woman not believing that Biden got 81M votes like they said on TV?? That would be like believing there's something dubious on Hunter Biden's laptop that stretches all the way to Ukraine, or believing that Obama spied on Trump, or believing something incriminating will come out of the Mueller Report, or not believing that Covid-19 came naturally from bats, or that there are good Nazis in Ukraine.  Biden absolutely definitely got 81M vote. They said it on TV.",
            "title_similarity": "0.66011053"
        },
        {
            "id": "i2b153d",
            "score": 49,
            "text": "And? \n\nHe won't be impeached by the Republicans. \n\nShe will face no consequences. \n\nCertain people will continue voting for the party of treason.",
            "title_similarity": "0.6084472"
        },
        {
            "id": "i2bft5b",
            "score": -21,
            "text": "why is the husband to blame if the wife is a fucking moronic POS??\n\n why is it urban meyers fault if his assistant coaches wife stays with her husband who beats her??? \n\nthis person should lose everything bc their spouse cant be \"controlled\", i thought we wanted strong independent women who didnt go along w whatever their spouses wanted. guess not...",
            "title_similarity": "0.6926458"
        },
        {
            "id": "i2bg4fu",
            "score": -42,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2bgb91",
            "score": 0,
            "text": "Prison",
            "title_similarity": "0.062364973"
        },
        {
            "id": "i2bgejk",
            "score": 6,
            "text": "It’s going to be difficult to continue pretending this is a democracy when nothing comes of this. \n\nRepublicans wanted to execute elected officials, over the accusations that they acted on.",
            "title_similarity": "0.6123028"
        },
        {
            "id": "i2bgos9",
            "score": 0,
            "text": "Lock her up!",
            "title_similarity": "0.30714786"
        },
        {
            "id": "i2bklnc",
            "score": 0,
            "text": "France. 1793.",
            "title_similarity": "0.15020004"
        },
        {
            "id": "i2bl4xb",
            "score": 4,
            "text": "Nothing, and I repeat NOTHING will come of this.  The new normal in this country is that the fuckheads on the right will do whatever they want with no consequences.  The Dems, despite holding whatever power we perceive them to have will continue to be the biggest pussies on the planet for letting shitmarks like Mitch, McCarthy, Rafael and Marjorie Taylor “The Hammer” Valentine do whatever they fucking please.  1/3 of this country will continue to be completely OK with all of it.  Not a fucking thing will happen to the evil orange POS who got us into this entire situation and there’s a frighteningly good chance that he will be returned to power.  That’s about it.  Have a great fucking day!",
            "title_similarity": "0.46917868"
        },
        {
            "id": "i2blmh4",
            "score": 3,
            "text": "LOOKING FOR BLATANT CORRUPTION?! \n\nLook no further than every day in The Republican party.",
            "title_similarity": "0.58527696"
        },
        {
            "id": "i2btd2n",
            "score": -4,
            "text": "Pretend I posted a compilation of celebrities and politicians publicly asking electors to ignore their constituents and vote clinton in.",
            "title_similarity": "0.7548127"
        },
        {
            "id": "i2c6ndy",
            "score": 0,
            "text": "Are they partners in crime? Or does one dominate the other I wonder? Not unprecedented that someone like her would be in control of someone like him, or even the other way around.",
            "title_similarity": "0.3523031"
        },
        {
            "id": "i2cm9ii",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2cw9i9",
            "score": 0,
            "text": "Context please….also too late.  Biden IS the president.  There is NO way around that period.  I’ve moved on it’s time the rest of the population do the same unlike the other side when Hillary lost in 2016.  ….",
            "title_similarity": "0.66380763"
        },
        {
            "id": "i2d978f",
            "score": 0,
            "text": "Why are we silently watching the aggression #russia. For me there are no more uninvolved in the genocide of #Ukraine nation. The passive uninvolved observer is as cruel, as culpable, as the active murderer. #HelpUkraineNow #UKANFORUKRAINE #UKAN  #BUYUKAN #CloseTheSkyUkraine",
            "title_similarity": "0.51648927"
        },
        {
            "id": "i2djxln",
            "score": 0,
            "text": "Does anyone find it strange the Democrats have basically said nothing about this?",
            "title_similarity": "0.30604494"
        },
        {
            "id": "i2dr1es",
            "score": 0,
            "text": "How she carries those watermelons",
            "title_similarity": "0.18708223"
        },
        {
            "id": "i2drelv",
            "score": 0,
            "text": "I agree he has a conflict of interest, but the article's writing is intentionally misleading.  If she legitimately believed the election was stolen there is no issue with her encouraging people to find fault with the results.",
            "title_similarity": "0.5444722"
        },
        {
            "id": "i2dtoq6",
            "score": 0,
            "text": "Didn’t Hillary do the same thing in 2016?",
            "title_similarity": "0.41505194"
        },
        {
            "id": "i2du0wr",
            "score": 0,
            "text": "X. We Z",
            "title_similarity": "0.086397186"
        },
        {
            "id": "i2e0qut",
            "score": 0,
            "text": "*This lady has been in the Republicans backyard for years. Judge Thomas has just been a moth peace for her vues. Must be looked into big time. Way to many lives have been disrupted by her.*",
            "title_similarity": "0.54103214"
        },
        {
            "id": "i2e2lpt",
            "score": 0,
            "text": "None of your business what she does.",
            "title_similarity": "0.19778275"
        },
        {
            "id": "i2ebeil",
            "score": 0,
            "text": "RBG husband’s law firm argued cases before the Supreme Court. Stop with the candy ass snowflake whiner stuff",
            "title_similarity": "0.59785736"
        },
        {
            "id": "i2eiykh",
            "score": 0,
            "text": "I cannot see how she is required to report to her husband what she does and is not entitled to an opinion. What is this 1770 and Justice Thomas is required to have control of his wife?",
            "title_similarity": "0.57427424"
        },
        {
            "id": "i2enj0s",
            "score": 0,
            "text": "So she’s part of the every increasing majority of Americans that see what everyone else who is engrained in reality saw, that it was stolen and should’ve been overturned and never allowed to stand.",
            "title_similarity": "0.51750743"
        },
        {
            "id": "i2f9en3",
            "score": 0,
            "text": "The writer is not reporting honest news, they are reporting their opinion of what the actual text said. No knew the results of the investigations into the fraudulent claims of the election at the time of the text. There are still some doubts in people’s minds that the investigation results are accurate And that the election wasn’t rigged.",
            "title_similarity": "0.46591413"
        },
        {
            "id": "i2fgk9h",
            "score": 0,
            "text": "She is a smart woman. I am sure her opinions and proof in this election are heard by ALL Americans especially after what we are watching before our eyes now.",
            "title_similarity": "0.46393055"
        },
        {
            "id": "i2fk283",
            "score": 0,
            "text": "What seems to be the problem? It should be overturned!",
            "title_similarity": "0.3178068"
        },
        {
            "id": "i2fwiak",
            "score": 0,
            "text": "Was the effort to \" . . . to overturn election\" or more specifically to \"refuse to accept or count tainted/questionable ballots, until they could be examined in court\"? For example, aren't PA and AZ in the process of decertifying their previous electoral votes right now, this month?",
            "title_similarity": "0.66692454"
        },
        {
            "id": "i2fxd8l",
            "score": 0,
            "text": "When do we get to see Nancy Pelosi's text messages?",
            "title_similarity": "0.47225773"
        },
        {
            "id": "i2b3cub",
            "score": 8,
            "text": "No consequence. At best it’ll be mentioned in some future historical content.",
            "title_similarity": "0.18895681"
        },
        {
            "id": "i2c2tp8",
            "score": -9,
            "text": "Until everyone understands that the left and the right are both the wings of the same bird, nothing will change. The fact that we only have two strong political parties, prove this divide and conquer strategy. Now keep labeling people liberal and conservative and fight among each other for stupid and made up problems that will never be fully resolved, like gun rights, taxes and abortion.\n\nRight now, the one common enemy we have are the Globalists that are using every trick in the book to further divide the American people.",
            "title_similarity": "0.6549461"
        },
        {
            "id": "i2bojnq",
            "score": -5,
            "text": "Interesting that this issue has become *an issue* when the possibility of TWO African American justices could be on the bench. 🤔\n\nThomas aint (bleep) but I just find this story to be too convenient.",
            "title_similarity": "0.30325785"
        },
        {
            "id": "i2brgil",
            "score": -6,
            "text": "I understand the implications of a lady in her position trying to pull strings, but at the end of the day did anyone listen to her? Would the chief of staff even be able to go through with it?",
            "title_similarity": "0.59469587"
        },
        {
            "id": "i2bhilc",
            "score": -19,
            "text": "Hero",
            "title_similarity": "0.029761555"
        },
        {
            "id": "i2bncjh",
            "score": -17,
            "text": "ok, now let's release ALL the contents of Hunter's laptop",
            "title_similarity": "0.31315416"
        },
        {
            "id": "i2bnkgp",
            "score": -17,
            "text": "Hunter Biden laptop is confirmed to be riddled with corruption \n\nTHE LEFT AND RIGHT ARE BOTH CORRUPT.",
            "title_similarity": "0.37197542"
        },
        {
            "id": "i2brn59",
            "score": -17,
            "text": "Joe Biden and the democrats covered up the actions of his disgusting son Hunter. When you compare the two, these texts from Clarence Thomas’s are really just a moot point.",
            "title_similarity": "0.495026"
        },
        {
            "id": "i2bc2js",
            "score": -28,
            "text": "Based on her belief that the election was indeed stolen as detailed in the body of her texts her texts and actions were reasonable.",
            "title_similarity": "0.4674768"
        },
        {
            "id": "i2boc3h",
            "score": -6,
            "text": "I texted my boss for a raise.  Didn’t happen",
            "title_similarity": "0.552284"
        },
        {
            "id": "i2bt7r0",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2bur0f",
            "score": -6,
            "text": "Has there been new developments or is this just a circlejerk? Because this seems like the same story that’s been posted over and over again the last few days. What further awareness is being made?",
            "title_similarity": "0.2735059"
        },
        {
            "id": "i2c1kop",
            "score": -7,
            "text": "*“Sounds like Sidney and her team are getting inundated with evidence of fraud,” Thomas texted Meadows in November. “Make a plan. Release the Kraken and save us from the left taking America down.”* \n\nSo Thomas was concerned about evidence of fraud. Like many people.   \n\nThis is a big morning-burger.",
            "title_similarity": "0.6518334"
        },
        {
            "id": "i2d6ilf",
            "score": -5,
            "text": "Good for her. If you say that election wasn't stolen, you're lying, and you know it! Besides, what's the big deal? She has a right to free speech. Only Nazis would find this inappropriate somehow. And you know better- spouses often disagree.",
            "title_similarity": "0.60272866"
        },
        {
            "id": "i2c797v",
            "score": -1,
            "text": "Doubt it!",
            "title_similarity": "0.050218284"
        },
        {
            "id": "i2cr7aw",
            "score": -1,
            "text": "Drain the swamp",
            "title_similarity": "0.07664656"
        },
        {
            "id": "i2csann",
            "score": -1,
            "text": "Hey she’s one of us visually speaking .. whatever she does is superior and morally licensible.",
            "title_similarity": "0.26196963"
        },
        {
            "id": "i2d6o8c",
            "score": 1,
            "text": "What in the literal fuck. How is this shit happening right now?",
            "title_similarity": "0.21145019"
        },
        {
            "id": "i2d8nm6",
            "score": 1,
            "text": "Will this white Christian nationalist be held accountable?  Of course not. Smh.",
            "title_similarity": "0.38064903"
        },
        {
            "id": "i2dbvog",
            "score": -1,
            "text": "Who cares let’s move on from this",
            "title_similarity": "0.19402272"
        },
        {
            "id": "i2dds5r",
            "score": 1,
            "text": "#\"REDDIT IS NOT A FREE-SPEECH PLATFORM\"\n\nSo unfortunately I cannot say how I feel about this.  It involves the GOP being the party of treason, known members openly flouting our laws, enemies of the state claiming to be \"patriots\", and potential legal sentences up to and including the death-penalty.",
            "title_similarity": "0.5839514"
        },
        {
            "id": "i2diqi5",
            "score": -1,
            "text": "YEAH! Keep your woman under control dude! You are the man, control her!",
            "title_similarity": "0.35098466"
        },
        {
            "id": "i2dmvmp",
            "score": -1,
            "text": "Per lede: “Wife of Supreme Court Justice Texted Trump’s Chief of Staff to overturn election.”\n\nPer TFA “Conservative activist Ginni Thomas sent at least 29 text messages to Mark Meadows, Trump’s former chief of staff, between Election Day 2020 and January 2021, encouraging him to disregard the election results and to continue pushing false claims of fraud in order to keep Trump in office”\n\nTwo different things.  They were demanding an investigation into corrupt practices and electro on fraud, which recent history had confirmed to large extend.  Oh and Hunter’s laptop? Even the dingy harlot admitted it was real.",
            "title_similarity": "0.8498291"
        },
        {
            "id": "i2dw9yh",
            "score": -1,
            "text": "No worries, the Republicans have the midterms and 2024 in the bag since the Democrats have proven “problematic” these last 2 years.  \nAs for the people who HATE Trump with a passion, look on the bright side; at least he can only become the President ONE more time before passing the torch onto a younger Generation.  \nWe need some “new blood” as the saying goes since the last few presidents leading America.  \nAlso, Fun-Fact: Barack Obama was not only the first African American to become the President, but he was also the first (and most likely only) American that wasn’t TECHNICALLY born IN America to become the president of the United States of America.  \nHe was born in Honolulu, an island that’s part of Hawaii, but “legally” speaking DESPITE BEING NOWHERE NEAR WITHIN IT, Hawaii officially became America’s 50th “State” in 1959.  \n61 years after it was basically colonized and stolen becoming a US Territory in 1898.",
            "title_similarity": "0.62092495"
        },
        {
            "id": "i2e3n7s",
            "score": -1,
            "text": "Well do you blame her. I still have a hard time believing America elected someone who can’t even but a sentence together.",
            "title_similarity": "0.50012773"
        },
        {
            "id": "i2eea2h",
            "score": -1,
            "text": "Stop spreading false news unless you have absolute proof this happened",
            "title_similarity": "0.36031348"
        },
        {
            "id": "i2et3oy",
            "score": -1,
            "text": "Awesome you mean no more 6 dollar a gallon gas. No more having a president that has criminals in his family.",
            "title_similarity": "0.5191252"
        },
        {
            "id": "i2bfo5m",
            "score": -43,
            "text": "It was the right thing to do.  The election was stolen.\n\nI can't believe a majority of Americans would vote for a corrupt lifelong politician suffering from dementia with a woman who used to sleep with men twice her age to gain political power.",
            "title_similarity": "0.67142546"
        },
        {
            "id": "i2btzla",
            "score": -7,
            "text": "Fortunately the President’s Chief of Staff is one the most powerful individuals in the country and doesn’t give a shit what random people say.",
            "title_similarity": "0.44665885"
        },
        {
            "id": "i2c162m",
            "score": -8,
            "text": "Can we all just move on from Trump already? Even Biden is a crypto critic. We need a new and young president for 2024. These old cronies really irk me.",
            "title_similarity": "0.6936923"
        },
        {
            "id": "i2bjt9f",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2bh25v",
            "score": -27,
            "text": "I don't see why anyone should care about what anybody's wife wants or is doing, including Trump's chief of staff.",
            "title_similarity": "0.6036947"
        },
        {
            "id": "i2b3mkz",
            "score": 16,
            "text": "They don't have a lot of places to go from here except to Vladimir Putin's apartment bombing strategy.  When that happens all of you need to drop a dime on the first people you see gloating about it.  They have already proven that the entire party operates as a criminal conspiracy, so it will be fair to treat them all as criminals when they move on to low-level terrorism.",
            "title_similarity": "0.5890666"
        },
        {
            "id": "i2bjfmx",
            "score": -19,
            "text": "Didn’t happen. And it was stolen. Now we watch the train wreck.",
            "title_similarity": "0.35705236"
        },
        {
            "id": "i2bmbae",
            "score": -16,
            "text": "Meh. She is a private citizen and can text what ever she wants to whomever she wants. Every message of outage here is just liberal masturbation.",
            "title_similarity": "0.44596636"
        },
        {
            "id": "i2caf0j",
            "score": -2,
            "text": "Who gives a fuck",
            "title_similarity": "0.074623935"
        },
        {
            "id": "i2cbvb4",
            "score": -2,
            "text": "good thing she is not a justice, am i right?",
            "title_similarity": "0.3090263"
        },
        {
            "id": "i2czeij",
            "score": -2,
            "text": "Not even close of a recusal.  Now Ginsburg and her Husband's law firm might have been something.",
            "title_similarity": "0.5259467"
        },
        {
            "id": "i2df09q",
            "score": 2,
            "text": "Time to impeach him and remove him",
            "title_similarity": "0.42292345"
        },
        {
            "id": "i2bks5u",
            "score": -10,
            "text": "Thank goodness it didn’t happen.  We wouldn’t have enjoyed the border crisis, massive inflation, and crime surges by “whites supremacists” LOL.",
            "title_similarity": "0.5049295"
        },
        {
            "id": "i2bvxrg",
            "score": -10,
            "text": "wish they did. FJB",
            "title_similarity": "0.17970693"
        },
        {
            "id": "i2bx6up",
            "score": -10,
            "text": "So what did she text that's so incriminating? I'm sure the Dems will have her show up in Congress's floor and have gto answer questions, and nothing will be doine b/c there isn't anything there. Texting about it and actually doing it are different things. Per one article I found, the post was referencing something thqt was \"heard\" but not confirmed.  So if I was the Dems on this, I would make sure there is proof before saying something.  \n\nI mean, if not she'll sue like Trump is suing Hillary for allegations taht he was was impeached on twice is now showing that it was all made up. More to come on that once Durham puts more out, if he does.",
            "title_similarity": "0.75247234"
        },
        {
            "id": "i2bzuxh",
            "score": -10,
            "text": "Well, all I can comment about that is to look at the shape of things now. Trump would have never let it get that way. Putin would have been made gone. Over and out but instead  now we have outrageous gas prices, groceries are way too high, we look at the Ukraine and seriously we need to take care of this nation and if it comes to war that wouldn’t happen because there would be no vicarious bullshit.",
            "title_similarity": "0.5948387"
        },
        {
            "id": "i2c2pvg",
            "score": -10,
            "text": "Joe Biden's son smokes crack and has sex with underage girls. Also, questionable business ties in foreign countries, why all the outrage over the wife of a Justice?",
            "title_similarity": "0.52377796"
        },
        {
            "id": "i2bjeib",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2b1tjw",
            "score": 294,
            "text": "Not only does she speak at the Stop the steal rally but she’s also pushing for insurrection to keep their god-king in the White House Justice Thomas has no credibility remaining with these latest messages from his wife and his decisions on the court.",
            "title_similarity": "0.7413858"
        },
        {
            "id": "i2bczm5",
            "score": -32,
            "text": "Hunter Biden was paying the \"big guy\" 10% of ALL his transactions with China and Ukraine amongst other countries who paid to play.",
            "title_similarity": "0.37315595"
        },
        {
            "id": "i2avf7z",
            "score": 97,
            "text": "These people are enemies of the American people and that includes 6 of the current SCOTUS.",
            "title_similarity": "0.43377918"
        },
        {
            "id": "i2cc5fs",
            "score": -3,
            "text": "Convenient? That's funny .I'm  just wondering why this is this a big deal now and wasn't an issue over a year ago.",
            "title_similarity": "0.3531627"
        },
        {
            "id": "i2cmodq",
            "score": 4,
            "text": "She should be in Guananamo with all the other Traitors and terrorists...\n\nShe is an entitled Terrorist",
            "title_similarity": "0.5364767"
        },
        {
            "id": "i2czcco",
            "score": -2,
            "text": "Liberal vaginas are swole all over this country.",
            "title_similarity": "0.37643215"
        },
        {
            "id": "i2daisu",
            "score": -4,
            "text": "It never went to the Supreme Court, so politics as usual, even if it did, 1st amendment?",
            "title_similarity": "0.4470171"
        },
        {
            "id": "i2bs5bl",
            "score": -13,
            "text": "Fake news. Clarence is a boss.",
            "title_similarity": "0.38465995"
        },
        {
            "id": "i2c3tgw",
            "score": -4,
            "text": "I think that with how many people are in this thread talking about democrats vs republicans are kinda representative of the politicians \"divide and conquer\" tactics. Both sides are stealing your money through taxes that businesses and the wealthy elite pass on to the lower class, wake up ya stupid sheeple",
            "title_similarity": "0.604768"
        },
        {
            "id": "i2c9pqb",
            "score": -3,
            "text": "This is pretty damning and insane.\n\nHow do people feel given that she isn’t actually a member of politics but an extension of someone who is? I’ve seen people say the Hunter Biden laptop news is irrelevant as he’s not in politics - does that same logic not apply here?",
            "title_similarity": "0.50514245"
        },
        {
            "id": "i2c9s77",
            "score": -4,
            "text": "Fake news!",
            "title_similarity": "0.19762608"
        },
        {
            "id": "i2cb3aq",
            "score": -4,
            "text": "Lol if it’s not one thing then it’s another. They won’t have their own kids so they want to genetically modify yours.\n\nYup, you’re all going to virtual hell.",
            "title_similarity": "0.530022"
        },
        {
            "id": "i2ckfdm",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2dces3",
            "score": 4,
            "text": "“Well this isn’t very important. We really need to focus on Hillary’s emails and Hunter Biden.” - what every conservative is thinking.",
            "title_similarity": "0.5504508"
        },
        {
            "id": "i2dlq6g",
            "score": -4,
            "text": "She was right",
            "title_similarity": "0.005183788"
        },
        {
            "id": "i2dlukd",
            "score": -5,
            "text": "hero",
            "title_similarity": "0.029761555"
        },
        {
            "id": "i2do02t",
            "score": -4,
            "text": "The election was sham..what's wrong to reinstate the true candidate",
            "title_similarity": "0.46622878"
        },
        {
            "id": "i2cruri",
            "score": -5,
            "text": "https://emeralddb3.substack.com/p/exclusive-how-democrats-cheated-in\n\nLove the down votes. Never might evidence showing ES&S/Dominion voting machines were tampered with. Votes changed.\n\n\nIn Georgia:\n\n* VoterGA reports demonstrated that 74 counties in Georgia cannot produce ballot drop-box transfer forms and two counties have over 300,000 missing ballot images each. A more recent report puts an end to any remaining questions of the severity of corruption within the Georgia Governer’s and Secretary of State’s offices.\n\n* Which may give some color to the fact that on December 17, 2020, Georgia State Senator William Ligon (Chairman of Georgia Senate Judiciary Committee’s Subcommittee on Election Law) issued a detailed report discussing a myriad of voting irregularities and fraud in the Georgia 2020 general election (from the Executive Summary: “the November 3, 2020 General Election was chaotic and any reported results must be viewed as untrustworthy”).\n\n\nIn Michigan:\n\n* A decision of the Michigan Court of Claims of March 9 2021 “invalidates absentee/mail-in ballot rule as improperly established” (a ballot rule that just five months earlier, in November 2020, affected 3.2 million votes). They found also that “actions of the Secretary of State Benson’s guidance regarding mail-in ballots and signatures were also “unlawful”.\n\"Benson’s guidance, issued on October 6, 2020, directed local clerks to treat signatures as valid if there are “any redeeming qualities in the application or return envelope signature as compared to the signature on file.” “Redeeming qualities” are described as including, but not being limited to, “similar distinctive flourishes” and “more matching features than non-matching features.” Allegan County Clerk Robert Genetski and the Republican Party of Michigan filed suit against Benson, alleging that her guidance violated the state’s election laws and the Administrative Procedures Act. The plaintiffs asked that the court strike down the guidance as unlawful and enjoin its enforcement in future elections.\nMurray sided with the plaintiffs, finding that Benson’s guidance was in fact a rule “that should have been promulgated in accordance with the APA. And absent compliance with the APA, the ‘rule’ is invalid.”\n\n* The original Antrim County Michigan Report from ASOG, the official response to it by Michigan, and the flaws in that official response including:\n\n* It never addressed the central finding of the ASOG report: that Antrim deleted their Security Logs at 11:03 PM, November 4, 2020 (thus in the end nothing we know about their machine can be known with certainty, because they could have done anything and then just deleted the Security Log);\n\n* Explanation for the lack of any Adjudication Files (though the files for 2016 and 2018 were present on the machine).\n\n\nIn Wisconsin:\n\n* A Wisconsin Supreme Court decision of December 2020 that the actions of the Wisconsin Election Commission regarding “indefinitely confined” voters were unlawful.\n\n* Retired Wisconsin Supreme Court justice and now Senate Office of Special Counsel Michael Gableman  has put forth one report that says the election officials are engaged in a cover-up, and a more recent report that says\n\n\nIn Arizona:\n\n* As is ably discussed in a report put together by Senator Wendy Rogers:\nthe Maricopa Audit, actually found that of Maricopa’s 2.1 million ballots, there are serious discrepancies (i.e., missing ballots and/or images) for 367,584 ballots (in a race won by 10k votes). A full 740k do not have a proper chain of title. But only if you count them all does Biden win by 10,000 (which our dutiful “independent” press reported as “Maricopa Audit shows Biden still won by 10,000!”).\n\n* The Maricopa Canvassing report that shows about 300,000 illegal votes.\n\n* A Pima County, Arizona canvass that shows so many laughable irregularities (e.g., 35% of households have “discrepancies” such as a fraternity generating 27 votes from men of average age 45 whose names are not recognized by those who live there) that it has been mathematically proven that Pima County (Tucson) Arizona is a stellar example of election fraud.\n\n\nIn Colorado:\n\n* In Colorado, a Mesa County, Colorado forensic analysis of its election equipment reveals that the November 2020 election has been 100% wiped out so that there is no way to audit it, as well as proof that before it was wiped, the equipment showed that the November 2020 election had been compromised, with multiple election databases and an injection of 29,000 ballots.\n\n* For final measure, the Halderman Expert Rebuttal Declaration (which, while not the full report, is devastating in its own right) has also been proved to Pro Publica.\n\n\n\nSeth Kezhels 10 points on Election Fraud. \n\nhttps://skeshel.substack.com/p/the-ten-points-to-true-election-integrity?s=r",
            "title_similarity": "0.5756658"
        },
        {
            "id": "i2ddke3",
            "score": -6,
            "text": "Why should we believe that this is true? Not saying it isn’t. But I can show you a text from anyone saying anything. I can make it look real. Why should i believe this?",
            "title_similarity": "0.3685972"
        },
        {
            "id": "i2do7d0",
            "score": -5,
            "text": "So what your saying is a woman can’t have her own opinion’s. ???? Is that what this is all about ? You’re saying a woman can only have an opinion based on what her husband does for a living ?? Wow- some people really do believe in Biden’s build Backass backwards plan !!!",
            "title_similarity": "0.616873"
        },
        {
            "id": "i2bhm68",
            "score": -16,
            "text": "This is how the media spreads misinformation. She didn't tell him to overturn the election, she texted him not to concede, when did that become a treasonable?",
            "title_similarity": "0.66094303"
        },
        {
            "id": "i2c4nwc",
            "score": -6,
            "text": "Funny how this just comes out right before a new Supreme Court Judge is going to be confirmed. What's next? Replace Judge Thomas? You can't say you don't see this happening.",
            "title_similarity": "0.5919917"
        },
        {
            "id": "i2cjeue",
            "score": -7,
            "text": "Good. Any president would be better than Sloppy Joe",
            "title_similarity": "0.3799511"
        },
        {
            "id": "i2dfyf4",
            "score": -6,
            "text": "She texted someone? OMG. I DEMAND that her dog groomer no longer be allowed to cut Hunter Biden's dog's hair.",
            "title_similarity": "0.6441097"
        },
        {
            "id": "i2bbyud",
            "score": -26,
            "text": "Left or right, who cares. Stop with this nonsense. Its about the great divide and most people only praise and worship one side. It’s simple, as American people. Be a patriot, live by the original constitution and stop enabling the federal government to control you. If the last 2 years hasn’t open your eyes big government will continue to steam roll you. If this offends you, you prove my point. No big words or agenda here. A simple truth that most can’t handle.",
            "title_similarity": "0.57912225"
        },
        {
            "id": "i2blnzi",
            "score": -23,
            "text": "Where is she wrong. The 2020 election was a sham. Ballots sent to people who didn’t request, 7-day post election counting, Ballot harvesting/stuffing, suppression polls, etc. \n\nImagine if Trump stretched the rules to harvest enough ballots to get millions of more votes then Obama and won 3 days post Election Day..lol! You think the right reacted bad?? The left would have been 10x",
            "title_similarity": "0.6380368"
        },
        {
            "id": "i2bnbhm",
            "score": -8,
            "text": "Why bother with any of this like anyone will be punished for it??",
            "title_similarity": "0.36391327"
        },
        {
            "id": "i2c89a0",
            "score": -7,
            "text": "Oh so she recognized it as fraudulent too.",
            "title_similarity": "0.26754767"
        },
        {
            "id": "i2cymyf",
            "score": -8,
            "text": "For the idiot that wrote this caption, you’re wrong, she didn’t ask to overturn the election, proper quoting is important clown",
            "title_similarity": "0.59281754"
        },
        {
            "id": "i2bcti5",
            "score": 7,
            "text": "Affordable health care,  college tuition,  good wages, protecting the environment, etc - the right calls these things the left's agenda that will destroy America.  And their poorly educated supporters eat it up and think they're stopping Communism.",
            "title_similarity": "0.65695596"
        },
        {
            "id": "i2bnly6",
            "score": -8,
            "text": "\"You 👀👈 are the leader, 😎👑 with him, 👨 who 🤷 is standing 🚹 for 💯🏽 America’s 🌎 constitutional 📜 governance at the precipice. The majority 📈 knows ☝️🧠 Biden 👴🏼 and the Left 😅😅 is attempting 🙋 the greatest Heist of our ✂️✂️ History. 😡‼️ This is a fight 👊 of good ✅ versus 🆚 evil. 👿\n\n- Sent from my iPhone\"\n\nEdit: lmao don't hate on me cause I emojified her texts",
            "title_similarity": "0.6777928"
        },
        {
            "id": "i2bsnsw",
            "score": -8,
            "text": "Nah don't care",
            "title_similarity": "0.0041442625"
        },
        {
            "id": "i2c20jz",
            "score": -8,
            "text": "Sounds like Russian disinformation to me.",
            "title_similarity": "0.31418496"
        },
        {
            "id": "i2ccyo2",
            "score": -8,
            "text": "Lol. Who cares. Wife's opinions don't mean shit lmfao. The amount of brainwashed outrage is getting ridiculous",
            "title_similarity": "0.54895085"
        },
        {
            "id": "i2b83qk",
            "score": 28,
            "text": "If this were a democrat… there would be hell to pay. Thankfully, the republicans can do this stuff in plain sight",
            "title_similarity": "0.40830442"
        },
        {
            "id": "i2bb8pj",
            "score": 31,
            "text": "Serious question: why isn't she being charged with fomenting a seditious conspiracy against the United States right now?",
            "title_similarity": "0.60945153"
        },
        {
            "id": "i2bh3tg",
            "score": -27,
            "text": "[deleted]",
            "title_similarity": "0.10913682"
        },
        {
            "id": "i2bi7x6",
            "score": -31,
            "text": "It was a fraudulent election. The Biden administration is a farce. China controls the weakling Biden",
            "title_similarity": "0.4908269"
        },
        {
            "id": "i2ccc85",
            "score": -10,
            "text": "Why do I get the feeling that this isn't true?",
            "title_similarity": "0.087301314"
        },
        {
            "id": "i2cr84u",
            "score": -9,
            "text": "If anyone actually believes that  Biden won the election I have a bridge for sale over the pacific ocean",
            "title_similarity": "0.51412255"
        },
        {
            "id": "i2blqqz",
            "score": 9,
            "text": "> Notably, Clarence Thomas was the lone dissenter in a Supreme Court case earlier this year, voting against all eight other justices in a matter regarding documents from the Trump administration that the January 6 committee sought to investigate.\n\nThat seems downright impeachable (also criminal). He straight up used his position to try to cover up the crimes of his wife.",
            "title_similarity": "0.6662673"
        },
        {
            "id": "i2btd42",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2cngnm",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2b2tk4",
            "score": 55,
            "text": "God im so depressed",
            "title_similarity": "0.13338067"
        },
        {
            "id": "i2bntgp",
            "score": -11,
            "text": "And Hilary, had an email account....just sayin",
            "title_similarity": "0.3078252"
        },
        {
            "id": "i2c0u85",
            "score": -12,
            "text": "Hell yeah she’s awesome",
            "title_similarity": "0.098018296"
        },
        {
            "id": "i2c1si1",
            "score": -12,
            "text": "Keep this shit out of my notifications reddit.",
            "title_similarity": "0.43417156"
        },
        {
            "id": "i2c5jre",
            "score": -12,
            "text": "If Clarence Thomas should be in trouble over what his wife texted, then I want to ask people here, should Biden be in trouble for what's on his son's laptop?",
            "title_similarity": "0.6219654"
        },
        {
            "id": "i2cbjc3",
            "score": -11,
            "text": "This is an absolute nothing burger. Nothing illegal was done here. If anything this “outrage” means some of you don’t believe in women’s rights and are insinuating that a woman cannot do things without her husbands approval.\n\nEveryone here needs to grow up.",
            "title_similarity": "0.5357121"
        },
        {
            "id": "i2bjx8f",
            "score": -14,
            "text": "Anyone here who said “hunter biden isn’t president” isn’t allowed to comment on this.",
            "title_similarity": "0.403153"
        },
        {
            "id": "i2bs9gs",
            "score": -12,
            "text": "Let me guess you love watching the news everyday? So I'm the one gulping propaganda? 😄",
            "title_similarity": "0.3692311"
        },
        {
            "id": "i2bvxfl",
            "score": -14,
            "text": "still better than mandates",
            "title_similarity": "0.05403437"
        },
        {
            "id": "i2aw7b7",
            "score": 191,
            "text": "[deleted]",
            "title_similarity": "0.10913682"
        },
        {
            "id": "i2bofot",
            "score": -14,
            "text": "More & more secrets exposed.  We ALL know Biden’s election was a conspiracy against Trump.",
            "title_similarity": "0.6707119"
        },
        {
            "id": "i2bfsa6",
            "score": 69,
            "text": "[deleted]",
            "title_similarity": "0.10913682"
        },
        {
            "id": "i2bn7c8",
            "score": -15,
            "text": "And Hunter Biden violated laws pertaining to foreign lobbying and money laundering all while Daddy was VP…weird though, no Reddit post on this…",
            "title_similarity": "0.54260385"
        },
        {
            "id": "i2c2yno",
            "score": -16,
            "text": "Love seeing all these indoctrinated college liberals blame trump and Republicans for everything.",
            "title_similarity": "0.59482455"
        },
        {
            "id": "i2bmn4f",
            "score": -16,
            "text": "No one texts like that.  Fake news.",
            "title_similarity": "0.26517785"
        },
        {
            "id": "i2bpl8m",
            "score": -19,
            "text": "If Brandon son goes viral, should we go after Brandon? It is ridiculous",
            "title_similarity": "0.46508527"
        },
        {
            "id": "i2awh7m",
            "score": 50,
            "text": "Corruption begets corruption.",
            "title_similarity": "0.21216574"
        },
        {
            "id": "i2bhjaa",
            "score": -19,
            "text": "Crazy or not…I’d do her!!!🤗💦",
            "title_similarity": "0.37396652"
        },
        {
            "id": "i2c3axv",
            "score": -19,
            "text": "“to overturn the legitimate outcome of the 2020 presidential election.” You mean overturn the blatant fraud that gets more provable every day!",
            "title_similarity": "0.6706982"
        },
        {
            "id": "i2b8s2p",
            "score": 20,
            "text": "Pretty sad that he won’t be impeached for this. This country is broken.",
            "title_similarity": "0.40379953"
        },
        {
            "id": "i2bmwcz",
            "score": -18,
            "text": "Why hasn’t this sub mentioned anything about Hunter Biden’s laptop?",
            "title_similarity": "0.29591435"
        },
        {
            "id": "i2box43",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2bk46y",
            "score": -21,
            "text": "Okay now let’s talk about Hunter Biden’s laptop.",
            "title_similarity": "0.2332077"
        },
        {
            "id": "i2bke4m",
            "score": -21,
            "text": "They shoukd have because lection was rigged. There was no way for Biden to get 80m vites, no way for counties to get more vites than registered voters, no way for votes for biden to suddenly spike.",
            "title_similarity": "0.49643776"
        },
        {
            "id": "i2bfy1m",
            "score": -30,
            "text": "Fake news!",
            "title_similarity": "0.19762608"
        },
        {
            "id": "i2ay5sm",
            "score": 777,
            "text": "Let me guess, there will be no consequences for this as well?",
            "title_similarity": "0.1048267"
        },
        {
            "id": "i2awp9y",
            "score": 757,
            "text": "why has the republican party itself not been tried for organized treason?\n\nthey fucking organized all of this",
            "title_similarity": "0.5200929"
        },
        {
            "id": "i2b1c98",
            "score": 413,
            "text": "She's a vile piece of shit",
            "title_similarity": "0.20248327"
        },
        {
            "id": "i2bgqkk",
            "score": 82,
            "text": "So Republicans scream over Hunter Biden's laptop, but will try their best to make sure this does not get anyone in jail",
            "title_similarity": "0.61257505"
        },
        {
            "id": "i2b0119",
            "score": 4606,
            "text": "This prick put us through the Anita Hill thing. They couldn’t nail him on it, but it was obvious that he was a complete pig.\n\nNow it’s years later and we have to reconcile with the fact that he’s married to a lunatic, who is tied to insurrectionists. \n\nI’m kind of sick of him.  He’s never really amounted to much. He’s been a lot of trouble. And he’s a prick.  Keep in mind that this is the justice that went like more than a decade without asking a single question in court.",
            "title_similarity": "0.5220183"
        },
        {
            "id": "i2b31sg",
            "score": 893,
            "text": "This story should be a way bigger scandal than it is.",
            "title_similarity": "0.31578326"
        },
        {
            "id": "i2b97bn",
            "score": 4255,
            "text": "The Republican Party is ACTIVELY trying to overthrow and destroy the US Government.  Am I wrong?",
            "title_similarity": "0.620932"
        },
        {
            "id": "i2bapiv",
            "score": 273,
            "text": "Imagine if texts from one of the liberal judge's spouses were uncovered that showed them telling Hillary's top aides to illegally contest the 2016 election....Imagine it for a second....Imagine what Trump would have done....\n\nBut because it's the other way the right will just deflect and or minimize and the left won't actually pursue anything on some illusion of playing by the rules or something.....\n\nQuite unfortunate",
            "title_similarity": "0.80657506"
        },
        {
            "id": "i2b0xhi",
            "score": 830,
            "text": "This article title, while as nefarious as it sounds, does not begin to indicate the batshit craziness contained in said texts. The fact that a Supreme Court Justice has pledged wedding vows to the source of this batshitiness is very concerning, IMO",
            "title_similarity": "0.47175318"
        },
        {
            "id": "i2bb4av",
            "score": 3121,
            "text": "My biggest takeaway is how cringey these people sound with the religious wording they constantly use.\n\nSomething like…. ‘Fear not the shepherd’s trumpet for the frankincense of heaven is upon thyself! They are trying to destroy our country!’\n\nNOBODY TALKS LIKE THAT AND YOU SOUND LIKE A  FUCKING LUNATIC.",
            "title_similarity": "0.5122435"
        },
        {
            "id": "i2b3wgj",
            "score": 11849,
            "text": "Then he voted to keep the texts private.",
            "title_similarity": "0.20318642"
        },
        {
            "id": "i2b68k2",
            "score": 1,
            "text": "With blackjack and hookers?",
            "title_similarity": "0.32517722"
        },
        {
            "id": "i2b800s",
            "score": 7,
            "text": "Get rid of them both.",
            "title_similarity": "0.2424026"
        },
        {
            "id": "i2b8no5",
            "score": 2,
            "text": "Yeah we know, we spent all last week talking about it. Also, nothing will ever come of this so why are we still talking about it?",
            "title_similarity": "0.3875194"
        },
        {
            "id": "i2b8v5t",
            "score": 3,
            "text": "We know. What is going to be done about it?",
            "title_similarity": "0.14456758"
        },
        {
            "id": "i2b8xso",
            "score": 2,
            "text": "I came here to read the article, but his cheap suit is distracting me.",
            "title_similarity": "0.29832363"
        },
        {
            "id": "i2b90aq",
            "score": 5,
            "text": "Anita Hill warned this country 30 years ago",
            "title_similarity": "0.38307694"
        },
        {
            "id": "i2b9du5",
            "score": 6,
            "text": "This man is compromised nothing he says in the future should be heard again.  His opinions are that of a you fill in the blank",
            "title_similarity": "0.3665033"
        },
        {
            "id": "i2b9uyv",
            "score": 78,
            "text": "The bigger issue isn't the content of the texts as Republicans will just brush that aside by saying something like, \"I thought we wanted strong, independent women who have their own thoughts. That doesn't affect her husband...blah...blah\". The bigger problem is there was a Supreme Court decision on whether to release information to the Jan 6th Congressional investigation and Thomas was the ONLY one to say no. Even all three of Trump's own nominees voted in favor! He KNEW the investigation would reveal her involvement and so he tried to block it. That is more than enough reason for him to lose his seat.",
            "title_similarity": "0.7001917"
        },
        {
            "id": "i2ba45c",
            "score": 1,
            "text": "Well looks aren’t deceiving",
            "title_similarity": "-0.002393541"
        },
        {
            "id": "i2ba86t",
            "score": 3,
            "text": "Shes a pig 🐷",
            "title_similarity": "0.22666076"
        },
        {
            "id": "i2baf9v",
            "score": 25,
            "text": "Calm down guys, it's OK.  Mitch McConnell assures us that there is no reason to doubt Thomas's impartiality in the SCOTUS.  We're totally fine.\n\n&#x200B;\n\n[https://www.businessinsider.in/politics/world/news/mitch-mcconnell-says-he-has-total-confidence-in-justice-thomas-impartiality-after-it-was-revealed-that-his-wife-texted-about-overturning-the-2020-election-with-trumps-chief-of-staff/articleshow/90452698.cms](https://www.businessinsider.in/politics/world/news/mitch-mcconnell-says-he-has-total-confidence-in-justice-thomas-impartiality-after-it-was-revealed-that-his-wife-texted-about-overturning-the-2020-election-with-trumps-chief-of-staff/articleshow/90452698.cms)",
            "title_similarity": "0.6880904"
        },
        {
            "id": "i2bajg0",
            "score": 21,
            "text": "Upvote for awareness. Fuck these brazen criminals.",
            "title_similarity": "0.34741288"
        },
        {
            "id": "i2baos4",
            "score": 2,
            "text": "It's days old news by now, but the headline is still terrifying.",
            "title_similarity": "0.30905804"
        },
        {
            "id": "i2basw1",
            "score": 3,
            "text": "He must be removed.",
            "title_similarity": "0.2156765"
        },
        {
            "id": "i2bb8vm",
            "score": 1,
            "text": "Handmaidens tale intensifies",
            "title_similarity": "0.20247704"
        },
        {
            "id": "i2bbe5v",
            "score": 1,
            "text": "This is the America we live in today.  Sad.  \n\nI predict nothing will be done.  Thomas will remain on the bench unless his recent illness causes him to leave.",
            "title_similarity": "0.44182873"
        },
        {
            "id": "i2bbtib",
            "score": 1,
            "text": "Is there any established law related to judges recusing themselves from a case because of a spouse or significant other’s beliefs?  Ginni Thomas is clearly a wackadoodle but do her beliefs require Judge Thomas recuse himself from any case related to January 6th? \n\nThe appearance of conflict is pretty awful when he is the only dissenting Justice regarding the release of records but is the decision to recuse himself from a case entirely his decision?",
            "title_similarity": "0.6131657"
        },
        {
            "id": "i2bc2kj",
            "score": 2,
            "text": "So what’s the DOJ gonna do about it probably not a goddamn thing.",
            "title_similarity": "0.24049875"
        },
        {
            "id": "i2bc3qb",
            "score": 1,
            "text": "she also looks exactly like louis anderson's character from Baskets. this isn't a slight, just an observation",
            "title_similarity": "0.1981174"
        },
        {
            "id": "i2bcj6q",
            "score": 1,
            "text": "How do we know he was not using her phone.",
            "title_similarity": "0.2869591"
        },
        {
            "id": "i2bcjjx",
            "score": 3,
            "text": "And just imagine the state of affairs if that traitorous man was still president today. I hear the most inane things like “if trump was president putin never would have invaded Ukraine.” Lol. These people live in a fantasy land where left is right, and upside is down. If trump said “The sky is red.” They would all be saying “The sky is red!”",
            "title_similarity": "0.621397"
        },
        {
            "id": "i2bd05p",
            "score": 1,
            "text": "I wish we dad a Burrito Supreme Court, to keep our regular Supreme Court in check.",
            "title_similarity": "0.5134937"
        },
        {
            "id": "i2bd8ki",
            "score": 2,
            "text": "You know how in school they teach you these people are supposed to be neutral? Already knew it was never true but its just blatantly obvious now",
            "title_similarity": "0.38574857"
        },
        {
            "id": "i2bdg2d",
            "score": 1,
            "text": "I blame the Teletubbies",
            "title_similarity": "0.3623652"
        },
        {
            "id": "i2bdnwl",
            "score": 1,
            "text": "Lock her up & impeach her traitor husband! USA! USA! USA!",
            "title_similarity": "0.5970168"
        },
        {
            "id": "i2bdqrz",
            "score": 1,
            "text": "And…..? Just like every other scandal from these loons, it will blow over in a few days and they’ll have zero consequences.",
            "title_similarity": "0.40596718"
        },
        {
            "id": "i2bdtgo",
            "score": 2,
            "text": "Yeah? Add it to the pile.\n\n\n\n\n…the “Nothing Will Come of This” pile. It’s sickening.",
            "title_similarity": "0.26592964"
        },
        {
            "id": "i2bdxvk",
            "score": 5,
            "text": "Trump is in many ways the perfect embodiment of everything the GOP stands for. He is the Frankenstinian amalgamation of greed, selfishness, racism and willful ignorance.",
            "title_similarity": "0.4198226"
        },
        {
            "id": "i2be16r",
            "score": 22,
            "text": "The thing that blows my mind is that a woman married to a Supreme Court Justice thinks that the president's chief of staff has the power to overturn an election.",
            "title_similarity": "0.82840425"
        },
        {
            "id": "i2be81c",
            "score": 17,
            "text": "It's also fucked that in a 3 branch government,  the wife of a Supreme Court Justice has the phone number of the white house chief of staff.",
            "title_similarity": "0.6907133"
        },
        {
            "id": "i2be8d8",
            "score": 1,
            "text": "Treason deserves the death penality. Don't fuck with our freedom.",
            "title_similarity": "0.46182418"
        },
        {
            "id": "i2beenx",
            "score": 1,
            "text": "Justice Ginni’s Cuck - what a sad man",
            "title_similarity": "0.2267736"
        },
        {
            "id": "i2ben57",
            "score": 1,
            "text": "Must recuse himself. Full stop.",
            "title_similarity": "0.22600606"
        },
        {
            "id": "i2beph2",
            "score": 1,
            "text": "Lock them up!!",
            "title_similarity": "0.18848446"
        },
        {
            "id": "i2bes0f",
            "score": 1,
            "text": "Get rid of them both",
            "title_similarity": "0.22647406"
        },
        {
            "id": "i2betnh",
            "score": 1,
            "text": "She looks like Queen Karen level 5000",
            "title_similarity": "0.35654947"
        },
        {
            "id": "i2bev9q",
            "score": 1,
            "text": "I’d like to speak to the election’s manager",
            "title_similarity": "0.5477059"
        },
        {
            "id": "i2bf7f7",
            "score": 1,
            "text": "Legitimate outcome my ass.",
            "title_similarity": "0.07770856"
        },
        {
            "id": "i2bg7ud",
            "score": 2,
            "text": "Remove that scumbag from the bench.",
            "title_similarity": "0.3031742"
        },
        {
            "id": "i2bgcx7",
            "score": 3,
            "text": "“Drain the swamp” right?",
            "title_similarity": "0.13572091"
        },
        {
            "id": "i2bhavc",
            "score": 22,
            "text": "The most important aspects of the Supreme Court are:\n\n1.\tIt’s credibility \n2.\tthe appearance of its credibility\n\n\nBased on 2 above, Thomas needs to resign. Even if he is truly independent of his wife in his decision making, the vast majority will not believe it, which erodes our faith in the Supreme Court. He has to go for the sake of the institution. Roberts needs to push for this. Unfortunately with how political the court has become, it will be stalled until they can replace him with a conservative legal mind.",
            "title_similarity": "0.64313"
        },
        {
            "id": "i2bhd87",
            "score": 11,
            "text": "And all the while they are grilling Judge Jackson over a book that they think will turn kids gay.",
            "title_similarity": "0.5713906"
        },
        {
            "id": "i2bhg80",
            "score": 1,
            "text": "This is so fucked up...",
            "title_similarity": "0.04496674"
        },
        {
            "id": "i2bhq6x",
            "score": 1,
            "text": "Judicial oversight is a necessity.\n\nI'm ashamed there's nothing of the sort in Canada",
            "title_similarity": "0.31896242"
        },
        {
            "id": "i2bhsau",
            "score": 2,
            "text": "Can you imagine what Republicans would do if the Justice were appointed by a Democrat?  Another Jan 6. \n\nWake up.",
            "title_similarity": "0.55654675"
        },
        {
            "id": "i2bhus2",
            "score": 1,
            "text": "Too much of this. Nothing is going happen to the both of them. No more accountability. Congress has become powerless since trump spit in their faces. The attorney general? Fools a coward, he is afraid of prosecuting anyone in the previous administration.",
            "title_similarity": "0.5737301"
        },
        {
            "id": "i2bhx8n",
            "score": 1,
            "text": "So it's treason..... ‐Darth Sideous.",
            "title_similarity": "0.32237646"
        },
        {
            "id": "i2bi2kw",
            "score": 1,
            "text": "A former president would have manufactured another crisis to divert Americas attention by now.\n\nI think America will have a “squirrel” moment without the need to manufacture a distraction.",
            "title_similarity": "0.62148845"
        },
        {
            "id": "i2bi9nh",
            "score": 4,
            "text": "She has the right to her opinions, but the undue influence on her Supreme Court Justice husband is impactful.  Clarence Thomas needs to recuse himself in some cases with this coming to light. His legacy is definitely in jeopardy.",
            "title_similarity": "0.59210026"
        },
        {
            "id": "i2bicmo",
            "score": 3,
            "text": "i don't understand why these animals haven't been sent to gitmo yet. They purposely tried to end democracy and install a dictator. Trying to steal an election like that warrants the death penalty in my opinion. Also when you don't punish this type of behaviour you are just teaching dogs like this that it's okay and they can try again.",
            "title_similarity": "0.57724863"
        },
        {
            "id": "i2bid5k",
            "score": 15,
            "text": "I enjoy how she rails about the “elites”. Her being the wife of a supreme court Justice and him the Chief of Staff of the President of the United States. Fuck these people.",
            "title_similarity": "0.74202013"
        },
        {
            "id": "i2bie19",
            "score": 1,
            "text": "They’re both hedonistic fatties, only one of them is the koolaid man, however.",
            "title_similarity": "0.14033481"
        },
        {
            "id": "i2bihao",
            "score": 2,
            "text": "I mean surely something will come from this right?",
            "title_similarity": "0.051795058"
        },
        {
            "id": "i2biiv5",
            "score": 1,
            "text": "That exactly the reason for Supreme court's justices should only serve limited terms agreed by Congress and approved by Senate.",
            "title_similarity": "0.39950302"
        },
        {
            "id": "i2bimx9",
            "score": 2,
            "text": "And nothing will happen",
            "title_similarity": "0.051871672"
        },
        {
            "id": "i2biqag",
            "score": 1,
            "text": "So, the Supreme Court isn’t politicized?",
            "title_similarity": "0.22430703"
        },
        {
            "id": "i2biqg2",
            "score": 1,
            "text": "What a shithole country",
            "title_similarity": "0.11896235"
        },
        {
            "id": "i2bj25j",
            "score": 1,
            "text": "Impeach",
            "title_similarity": "0.25885224"
        },
        {
            "id": "i2bj2gl",
            "score": 1,
            "text": "Time for Clarence to step down!",
            "title_similarity": "0.23819903"
        },
        {
            "id": "i2bj2s6",
            "score": 1,
            "text": "discipline her",
            "title_similarity": "0.18529525"
        },
        {
            "id": "i2bj762",
            "score": 1,
            "text": "So Thomas shouldn't be an SCJ then. The conflict of interests is obvious, present, and severe.",
            "title_similarity": "0.36792457"
        },
        {
            "id": "i2bj8ol",
            "score": 13,
            "text": "Just for once, I’d love to see the Democrats lose their shit and stop using velvet gloves when interacting with regressive criminals.",
            "title_similarity": "0.5477833"
        },
        {
            "id": "i2bjbso",
            "score": 1,
            "text": "And the only consequences will be ours to bear.",
            "title_similarity": "0.20234713"
        },
        {
            "id": "i2bjd27",
            "score": 2,
            "text": "Why is he even allowed to be on the bench?",
            "title_similarity": "0.05543967"
        },
        {
            "id": "i2bjda3",
            "score": 1,
            "text": "He needs to be removed",
            "title_similarity": "0.20319073"
        },
        {
            "id": "i2bjg5f",
            "score": 7,
            "text": "And he voted to not look into it...",
            "title_similarity": "0.23630083"
        },
        {
            "id": "i2bjlog",
            "score": 1,
            "text": "This is all good for the GOP and their base. The more you report it, the more it helps them. “Re-elect Trump, and he’ll appoint MORE justices who are fighting to stop the steal.”",
            "title_similarity": "0.6029782"
        },
        {
            "id": "i2bjm8u",
            "score": 2,
            "text": "Shady 🤔",
            "title_similarity": "-0.061934255"
        },
        {
            "id": "i2bjq7x",
            "score": 1,
            "text": "If you don’t think that is fucked up, and a conflict of interest.. you’re high.. on salvia and bath salts",
            "title_similarity": "0.3060496"
        },
        {
            "id": "i2bjvp1",
            "score": 2,
            "text": "Is it just me or has Reddit been about 2-3 days behind the news lately? This story came out days ago. Or have I finally completely lost my shit?\n\nSame with some Ukraine stories. This is becoming like Facebook.",
            "title_similarity": "0.48986983"
        },
        {
            "id": "i2bjw5w",
            "score": 2,
            "text": "Can we throw these two fuckers into Gitmo or Azkeban please? So over their bullshit. Especially Judge Thomas. Eat a Dementors dick.",
            "title_similarity": "0.46176928"
        },
        {
            "id": "i2bjwp9",
            "score": 2,
            "text": " We ask the members of the Academy and Hollywood to let Vladimir Zelensky address you and the whole world tonight during the 94th Oscar ceremony.  Let Ukraine speak to the world!",
            "title_similarity": "0.54078686"
        },
        {
            "id": "i2bjx5f",
            "score": 1,
            "text": "Just how in the hell did she get Mark Meadows phone number? Only one answer to that.",
            "title_similarity": "0.2882236"
        },
        {
            "id": "i2bjxir",
            "score": 1,
            "text": "It’s a sad state of affairs when people are so inured to corruption that a story like this doesn’t generate more outrage, investigations, etc. \n\nAs above, so below.",
            "title_similarity": "0.37665227"
        },
        {
            "id": "i2bk1jg",
            "score": 1,
            "text": "https://youtu.be/YwhvRJzwqWk",
            "title_similarity": "0.12160285"
        },
        {
            "id": "i2bk2yn",
            "score": 1,
            "text": "There are no consequences for anything anymore so nothing will come of this. Shrug.",
            "title_similarity": "0.14778033"
        },
        {
            "id": "i2bk8da",
            "score": 1,
            "text": "Sounds kinda treasonous, dunno.",
            "title_similarity": "0.116866186"
        },
        {
            "id": "i2bkdu4",
            "score": 1,
            "text": "Wish we could see don the cons texts to putin",
            "title_similarity": "0.5164041"
        },
        {
            "id": "i2bkeuo",
            "score": 1,
            "text": "Dirty rich and corrupt",
            "title_similarity": "0.2438461"
        },
        {
            "id": "i2bkjrv",
            "score": 1,
            "text": "Don’t worry. Nothing will happen.",
            "title_similarity": "0.044144522"
        },
        {
            "id": "i2bknvj",
            "score": 2,
            "text": " He needs to be kicked out. This is insane",
            "title_similarity": "0.3080136"
        },
        {
            "id": "i2bkrd1",
            "score": 1,
            "text": "Bias",
            "title_similarity": "0.052438572"
        },
        {
            "id": "i2bktvd",
            "score": 2,
            "text": "And it wont change a thing. You still wont vote them out.",
            "title_similarity": "0.2476264"
        },
        {
            "id": "i2bkzhv",
            "score": 1,
            "text": "Didn’t she and Charlie Kirk arrange to have something like 80 buses of “patriots” brought to DC for Jan 6?  I’d like to know what those two texted.",
            "title_similarity": "0.53878987"
        },
        {
            "id": "i2bl0nx",
            "score": 3,
            "text": "He should resign.",
            "title_similarity": "0.30058253"
        },
        {
            "id": "i2bl12r",
            "score": 2,
            "text": "“The texts also reveal that Thomas encouraged the Trump White House to “release the Kraken” — a reference to comments at the time from Trump-aligned lawyer Sidney Powell”\n\nRelease the Karens..?",
            "title_similarity": "0.6789925"
        },
        {
            "id": "i2bl3it",
            "score": 1,
            "text": "The fact that they are using texts here amazes me. Wouldn't keeping a conversation like this private and in person be obvious? lol.",
            "title_similarity": "0.29643923"
        },
        {
            "id": "i2bl46s",
            "score": 2,
            "text": "The implication of course is that IF they had successfully stopped the count, the Supreme Court would have backed them up. \n\nJesusfuckingchrist! They actually were trying to overthrow a legally elected government.\n\nIt would have been 2000 all mover again.",
            "title_similarity": "0.6844283"
        },
        {
            "id": "i2bl4k4",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10913682"
        },
        {
            "id": "i2bl674",
            "score": 2,
            "text": "Mercifully, Thomas has had very little impact on American life. His more be batshit ideals are generally kept to dissenting opinions. \n\nBut look at how he's voted and what he's written and imagine that all of his decisions did in fact win out. What kind of a theocratic oligarchic nightmare would that be?",
            "title_similarity": "0.39155805"
        },
        {
            "id": "i2blbyk",
            "score": 1,
            "text": "I read about this 2 days ago. What’s new about the story?",
            "title_similarity": "0.34735966"
        },
        {
            "id": "i2blbyt",
            "score": 4,
            "text": "Get ready for the republican gaslighting to come",
            "title_similarity": "0.42150438"
        },
        {
            "id": "i2blkym",
            "score": 2,
            "text": "Is this the Deep State?",
            "title_similarity": "-0.019650642"
        },
        {
            "id": "i2bloyg",
            "score": 1,
            "text": "This is hilarious… he must have been referring to his wife https://amp.theguardian.com/us-news/2022/mar/12/clarence-thomas-supreme-court-conservative-politics",
            "title_similarity": "0.69436467"
        },
        {
            "id": "i2blpy1",
            "score": 2,
            "text": "Are we still seeing NO ONE in prison or even fired for this bullshit yet?! Really?!",
            "title_similarity": "0.3133903"
        },
        {
            "id": "i2bm005",
            "score": 1,
            "text": "This has been the same headline for 72 hours",
            "title_similarity": "0.09043998"
        },
        {
            "id": "i2bm2yt",
            "score": 2,
            "text": "And nothing of substance will happen. We live in a garbage world.",
            "title_similarity": "0.13050067"
        },
        {
            "id": "i2bm7b6",
            "score": 2,
            "text": "Aaaand nothing will be done about any of this bullshit.\n\nAnd The Collapse™️ continues…",
            "title_similarity": "0.27871674"
        },
        {
            "id": "i2bma9a",
            "score": 1,
            "text": "“Checks and Balances” my ass.",
            "title_similarity": "0.23285568"
        },
        {
            "id": "i2bmac7",
            "score": 1,
            "text": "Or Chief Justice using wife’s phone?",
            "title_similarity": "0.61944854"
        },
        {
            "id": "i2bmcjp",
            "score": 2,
            "text": "People need to start going to jail or this shit will always happen.",
            "title_similarity": "0.42997473"
        },
        {
            "id": "i2bmd8f",
            "score": 1,
            "text": "Who remembers Amiri Baraka’s “Tom Ass Clarence”",
            "title_similarity": "0.20474043"
        },
        {
            "id": "i2bmftk",
            "score": 7,
            "text": "If we didn't have such a cowardice legislature I'd expect someone to draft articles of impeachment on this guy. Yes that is something you can do to SC justices.",
            "title_similarity": "0.5755984"
        },
        {
            "id": "i2bmhvw",
            "score": 1,
            "text": "None of this matters! There are no repercussions for anything! \n\n*tear",
            "title_similarity": "0.15678982"
        },
        {
            "id": "i2bmjw3",
            "score": 1,
            "text": "The one time in 25 years since I quit watching Face The Nation and asshole Illinois congressman Adam Kinzinger just deflects, projects and lies and nobody pushed back.  That show is an enabler.",
            "title_similarity": "0.4523729"
        },
        {
            "id": "i2bms28",
            "score": 1,
            "text": "Jesus christ, if that headline popped up in the opening scroll of some post apocalyptic America has fallen type movie it would be too cringe. But here we are.",
            "title_similarity": "0.53393376"
        },
        {
            "id": "i2bmsg8",
            "score": 2,
            "text": "Republicans are shit stains on US democracy.",
            "title_similarity": "0.49316645"
        },
        {
            "id": "i2bmx3i",
            "score": 1,
            "text": "Cool. And nothing is going to happen to any of them? Cool…awesome…GREAT! Must be nice to be republican and immune to basic laws.",
            "title_similarity": "0.3683936"
        },
        {
            "id": "i2bn0yk",
            "score": 2,
            "text": "Clarence Thomas needs to be put under house arrest and barred from performing his responsibilities while under investigation.\n\nAnd if the feds won’t do that, the people should.",
            "title_similarity": "0.5440521"
        },
        {
            "id": "i2bn20i",
            "score": 2,
            "text": "Clarence is too busy picking his wife’s pubic hairs off his can of coke to understand the magnitude of what she did.",
            "title_similarity": "0.49467054"
        },
        {
            "id": "i2bn8pw",
            "score": 1,
            "text": "Mothing will happen to her, nothing will happen to him. He will sit on the court until he dies. None of these matters in the end. We now live in a country where the Theocrats are now making the laws and get to decide who is punished in the end, guess what it isn't Republicans or Conservatives.",
            "title_similarity": "0.5720037"
        },
        {
            "id": "i2bn9b9",
            "score": 3,
            "text": "For me, the biggest mystery remains the lack of GOP members who refuse to be affiliated with criminals or morally corrupt individuals. But then again, the fact that the party didn’t fall apart after Trump’s reign, kind of proves that they probably can’t be reformed.",
            "title_similarity": "0.46680441"
        },
        {
            "id": "i2bnn80",
            "score": 2,
            "text": "But her emails!!!",
            "title_similarity": "0.3443429"
        },
        {
            "id": "i2bntrz",
            "score": 1,
            "text": "We already knew this",
            "title_similarity": "0.06919257"
        },
        {
            "id": "i2bntth",
            "score": 2,
            "text": "Go to jail. Do not pass go. Do not collect 200 million dollars.",
            "title_similarity": "0.45024404"
        },
        {
            "id": "i2bnyxp",
            "score": 3,
            "text": "The problem is Thomas won't resign. The Cons refuse to do so these days. Al Franken resigned over a photograph, yet Gaetz et AL won't budge over much more serious accusations.",
            "title_similarity": "0.47821105"
        },
        {
            "id": "i2bo002",
            "score": 2,
            "text": "And there shall be no repercussions whatsoever",
            "title_similarity": "0.08517918"
        },
        {
            "id": "i2bo1e6",
            "score": 2,
            "text": "Why is he even allowed to be on the bench?",
            "title_similarity": "0.05543967"
        },
        {
            "id": "i2bo1jo",
            "score": 2,
            "text": "Why do wife of politicians (yes, he is one) think they can do anything other than their own career.",
            "title_similarity": "0.6981173"
        },
        {
            "id": "i2bo5al",
            "score": 1,
            "text": "Elected public servants remember that you are in fact selected to do public service for the public. Public serve, not self serve.",
            "title_similarity": "0.378299"
        },
        {
            "id": "i2bo6yc",
            "score": 3,
            "text": "So the judicial branch is in a rough sense trying to overthrow the executive branch. Why is the chief justice not policing his members in order to preserve the integy of the court? This is the approach to Democrats need to be taking. Force Roberts hand.",
            "title_similarity": "0.6358991"
        },
        {
            "id": "i2boecf",
            "score": 1,
            "text": "I fucking hate dumb ass Republicans. They literally think they can do anything with no repercussions",
            "title_similarity": "0.42571867"
        },
        {
            "id": "i2bok27",
            "score": 1,
            "text": "She looks just like trump",
            "title_similarity": "0.35041925"
        },
        {
            "id": "i2bomep",
            "score": 3,
            "text": "Married to an actual traitor and insurrectionist and used his position to cover her tracks. Resign or impeach. Our democracy balances on a knife edge.",
            "title_similarity": "0.68521035"
        },
        {
            "id": "i2booj7",
            "score": 3,
            "text": "Lock her up.  She’s clearly an enemy of democracy and actively participated in an attempted coup.",
            "title_similarity": "0.5843564"
        },
        {
            "id": "i2boqid",
            "score": 1,
            "text": "LMAO years from now we are going to say \"Why didn't we act before it was too late\"",
            "title_similarity": "0.4786183"
        },
        {
            "id": "i2boqyd",
            "score": 1,
            "text": "\n\nHang the traitors!",
            "title_similarity": "0.35821325"
        },
        {
            "id": "i2botbd",
            "score": 3,
            "text": "“The fight continues. I have staked my career on it,” Meadows said. “Well at least my time in DC on it.”\n\nAnd that's the problem right there. No real consequences or fear of prison time for trying to overturn an election. Just a failed career in politics.",
            "title_similarity": "0.6151922"
        },
        {
            "id": "i2bowsf",
            "score": 1,
            "text": "Lock her up",
            "title_similarity": "0.2857595"
        },
        {
            "id": "i2boxyc",
            "score": 5,
            "text": "Imagine being a QAnon supporter while being married to 1/9 Supreme Court justices appointed for life. Like who does she think is controlling the govt if not her fucking husband?",
            "title_similarity": "0.7401965"
        },
        {
            "id": "i2bp82g",
            "score": 1,
            "text": "Why is he still a supreme court justice?",
            "title_similarity": "0.318229"
        },
        {
            "id": "i2bp8m2",
            "score": 2,
            "text": "No one really cares anymore because nobody will do anything about it. Case in point, 2 Trump impeachments no consequences, Madison Cawthorn no consequences, MTG no consequences, Ted Cruz no consequences, Brian Kemph no consequences, L Boebert no consequences, Josh Hawley no consequences, Russian collusion, fraud, election tampering, theft, dark money, rape, etc etc etc. THERE IS NO JUSTICE OR CONSEQUENCE FOR THE RICH AND POWERFUL IN AMERICA. PERIOD. So why should I, a voter, citizen, give a damn anymore?  Rules for thee not for me is our government motto now.",
            "title_similarity": "0.5628973"
        },
        {
            "id": "i2bpexk",
            "score": 1,
            "text": "Lmao you would think they would meet privately to discuss this in person instead of leaving a paper trail online",
            "title_similarity": "0.33443683"
        },
        {
            "id": "i2bpk2y",
            "score": 1,
            "text": " Clarence Thompson is just an empty suit. He doesn't bring anything to the table at all and he's only really known for his being a sexual deviant and having a batshit crazy spouse.",
            "title_similarity": "0.3571204"
        },
        {
            "id": "i2bpqqw",
            "score": 1,
            "text": "So how come we can't lock her up?",
            "title_similarity": "0.34108138"
        },
        {
            "id": "i2bpqvb",
            "score": 1,
            "text": "The fact that tRUMP and his cronies won’t face any prison time for the January 6 insurrection is infuriating.",
            "title_similarity": "0.56285596"
        },
        {
            "id": "i2bpval",
            "score": 1,
            "text": "Our government is a fucking joke.",
            "title_similarity": "0.3534004"
        },
        {
            "id": "i2bpwk3",
            "score": 1,
            "text": "Don't forget, the world also owes Thomas a debt of gratitude for the Citizens United verdict.  \n\nhttps://en.wikipedia.org/wiki/Citizens_United_v._FEC#Case_summary",
            "title_similarity": "0.43438476"
        },
        {
            "id": "i2bq3c1",
            "score": 1,
            "text": "I can’t wait to see all the nothing that comes from this!",
            "title_similarity": "0.19947548"
        },
        {
            "id": "i2bq3i4",
            "score": 1,
            "text": "Sounds like treason, put her in jail.",
            "title_similarity": "0.4295853"
        },
        {
            "id": "i2bq5k9",
            "score": 1,
            "text": "The REAL \"deep-state\" is slowly revealing itself.",
            "title_similarity": "-0.0010712612"
        },
        {
            "id": "i2bq8d0",
            "score": 1,
            "text": "https://share.socialdm.co/ChaseGeek",
            "title_similarity": "0.21736565"
        },
        {
            "id": "i2bq8g9",
            "score": 1,
            "text": "Two peas in a pod.",
            "title_similarity": "0.0026526526"
        },
        {
            "id": "i2bqfsj",
            "score": 1,
            "text": "Nothing will come of this. \n\nIn America, there are no consequences whatsoever for the rich, powerful and well-connected. I also doubt there is anywhere else.",
            "title_similarity": "0.34980983"
        },
        {
            "id": "i2bqgyg",
            "score": 2,
            "text": "So do something about it. \n\nTelling us how bad it is doesn't help. We know it's bad, but like 99% of all people on social media, we're not in a position of authority to do anything about it.",
            "title_similarity": "0.45223022"
        },
        {
            "id": "i2bqisz",
            "score": 3,
            "text": "You know, the US is really in a fragile place. There is something like 20-30% of people that are just gone. They moved to Trumpistan years ago and are completely lost in the big lie, Qannon, Anti Vax, Pro Russian conspiracies.  It’s so important to the US and the world not lose any more people to this shit. The consequences are too great. It’s high time leaders on the right start to speak up and do the right thing. Thomas needs to step down for the good of everyone.",
            "title_similarity": "0.61479783"
        },
        {
            "id": "i2bqqtb",
            "score": 3,
            "text": "\"She was just kidding!\"\n\n-- Conservatives",
            "title_similarity": "0.39725125"
        },
        {
            "id": "i2bqwfc",
            "score": 3,
            "text": "When will these people be put in jail. Fucking traitors to democracy...",
            "title_similarity": "0.46920854"
        },
        {
            "id": "i2br0f8",
            "score": 3,
            "text": "The fucking scary thing is they are one good public speaker who's a fucking loon way from ending the world. At this point the main gop party is a cult and, the og gop is now a sub-sect that is consist of less then 5 members.\n\nThe time to worry was decades ago. The time for action is now and the doj needs to prosecute every single person regardless of how high or how much power they have for their roles in the Jan 6th insurrection and any other crimes. It's they don't need to have a great record against them they just need to start charging them. The ceo's of companies can not withstand federal charges against them and potentially their company.",
            "title_similarity": "0.60748553"
        },
        {
            "id": "i2brbez",
            "score": 1,
            "text": "Probably with blessings from hubby",
            "title_similarity": "0.08384886"
        },
        {
            "id": "i2brldy",
            "score": 1,
            "text": "I am no expert on this matter and also not from US but if this is not reason enough for a Supreme Court Justice to resign I really don’t know what is. A Supreme Court cannot leave the impression to be corrupt. Absolute no-go.",
            "title_similarity": "0.44615585"
        },
        {
            "id": "i2broqk",
            "score": 1,
            "text": "The only dissenting vote to keep texts private too. I wonder why? But hey, republicans say it’s no big deal and he can be trusted to impartially judge.",
            "title_similarity": "0.48156226"
        },
        {
            "id": "i2brp3k",
            "score": 3,
            "text": "She's like a secret level Super Boss of a game where you fight Dependapotamuses.",
            "title_similarity": "0.47838643"
        },
        {
            "id": "i2bs5y6",
            "score": 1,
            "text": "And nothing will happen",
            "title_similarity": "0.051871672"
        },
        {
            "id": "i2bs9mn",
            "score": 3,
            "text": "Remember when Bill Clinton was in the same state as then AG Loretta Lynch and the GOP took that as clear and obvious proof that the justice department was helping Hillary avoid prosecution…. And now we’re gonna hear all about how this is another leftist conspiracy… I’ll never in my life understand what the standards are…",
            "title_similarity": "0.69780684"
        },
        {
            "id": "i2bsa17",
            "score": 1,
            "text": "So what? What are they going to do, fire her from being his wife?",
            "title_similarity": "0.67752576"
        },
        {
            "id": "i2bsbty",
            "score": 1,
            "text": "Why has he not been impeached? Why is she not being indicted for this? This country is broken. We need to make a change.",
            "title_similarity": "0.58790135"
        },
        {
            "id": "i2bsi52",
            "score": 1,
            "text": "A charge of sedition for her and impeachment for him are in or.",
            "title_similarity": "0.4756768"
        },
        {
            "id": "i2bsioc",
            "score": 1,
            "text": "And most right winger think exactly this way.",
            "title_similarity": "0.14301029"
        },
        {
            "id": "i2bslsk",
            "score": 2,
            "text": "What gets me is when I was in Public Accountinf auditing F500 public companies I needed to be ‘independent’ which was extended to be indpedpent IN FACT (objective where we didn’t own stock of the company, have immediate family in position of financial oversight at the company, etc.) and IN FORM (subjective where we didn’t even want the perception that we were to-close to the client, lacked appropriate skeptism, etc.).  You can argue that auditor independence is a ruse but at least there’s a framework that seems robust.\n\nFor politicians and judges it’s been proven lately that many are neither independent in fact nor in form; but it’s okay because they do scouts-honor that they don’t anything cloud their judgement… Complete BS.",
            "title_similarity": "0.55181164"
        },
        {
            "id": "i2bsvz9",
            "score": 5,
            "text": "Just more proof that conservatives hate the institutions of America, let alone hate America. The idea that all men are created equal really grinds some gears.",
            "title_similarity": "0.5086449"
        },
        {
            "id": "i2bsz1q",
            "score": 2,
            "text": "Best headline on this yet",
            "title_similarity": "0.17967305"
        },
        {
            "id": "i2bte71",
            "score": 3,
            "text": "No mention on r/Conservative.",
            "title_similarity": "0.19321592"
        },
        {
            "id": "i2btgbg",
            "score": 1,
            "text": ">“The fight continues. I have staked my career on it,” Meadows said. “Well at least my time in DC on it.”\n\n\\>career is meaningless\n\n\\>has months or even days on DC",
            "title_similarity": "0.52721894"
        },
        {
            "id": "i2bthty",
            "score": 2,
            "text": "Finally, headlines with straight facts. No names, no party, just the fact of the matter. And it’s kinda fucked up",
            "title_similarity": "0.31033015"
        },
        {
            "id": "i2btpa4",
            "score": 3,
            "text": "If this is not a a direct evidence of sedition/treason, then idk what is needed..",
            "title_similarity": "0.28384078"
        },
        {
            "id": "i2btpqp",
            "score": 3,
            "text": "She should be arrested and he should be removed from the Supreme Court.",
            "title_similarity": "0.5591633"
        },
        {
            "id": "i2bu308",
            "score": 6,
            "text": "From the article:\n\n\nIn another text, Thomas fretted over allowing Biden to be certified as the legitimate winner of the 2020 presidential election. “We just cave to people wanting Biden to be anointed? Many of us can’t continue the GOP charade,” she said.\n\n\n\nWhat charade is she referring to??? Charade of sanity? Charade of pretending to care? Wtf?",
            "title_similarity": "0.6974803"
        },
        {
            "id": "i2buunm",
            "score": 3,
            "text": "Time for term limits",
            "title_similarity": "0.16992289"
        },
        {
            "id": "i2bv1ju",
            "score": 2,
            "text": "She should be in jail and Thomas impeached, but neither will happen.  There’s no law and order applied to people like this.  The DOJ is a paper tiger… 🤬",
            "title_similarity": "0.50430405"
        },
        {
            "id": "i2bwc6x",
            "score": 2,
            "text": "Resign.",
            "title_similarity": "0.23314127"
        },
        {
            "id": "i2bwfsf",
            "score": 1,
            "text": "What a complete lack of decorum!",
            "title_similarity": "0.053548303"
        },
        {
            "id": "i2bwm31",
            "score": 3,
            "text": "It seems like she was one of the key agents incentivizing and providing momentum to the coup attempt. In no small part because by her association to a scotus vote it would give hope to the coup cohort that the scotus would affirm overturning the election. Nearly happened folks. And you aren’t through it yet, 2024 is a real possibility",
            "title_similarity": "0.72078264"
        },
        {
            "id": "i2bwx3j",
            "score": 3,
            "text": "And he’s the one saying it’s getting “too political”",
            "title_similarity": "0.3547672"
        },
        {
            "id": "i2bx2lv",
            "score": 3,
            "text": "Anita Hill wasn’t lying",
            "title_similarity": "0.05777847"
        },
        {
            "id": "i2bx371",
            "score": 1,
            "text": "The impotent democrats and the toothless DOJ....",
            "title_similarity": "0.29990608"
        },
        {
            "id": "i2bxeh1",
            "score": 1,
            "text": "Lock her up",
            "title_similarity": "0.2857595"
        },
        {
            "id": "i2bxipo",
            "score": 1,
            "text": "Something separation of powers, something degrees of separation",
            "title_similarity": "0.068221934"
        },
        {
            "id": "i2bxnuf",
            "score": 2,
            "text": "I think this is a very good case for removal from the supreme court. Before the current \"modern\" era, justices were removed for things as little as swearing. I think trying to alter written law and American democracy, even if it was \"just the wife\" is definitely a grounds for it, no matter what side you're on.",
            "title_similarity": "0.6653582"
        },
        {
            "id": "i2bxzjg",
            "score": 1,
            "text": "It's a rich people club LARPING a government. I knew that even as a child observer, just didn't know the vocabulary. When the teachers said anybody could be president, I thought yeah no.",
            "title_similarity": "0.59704936"
        },
        {
            "id": "i2by0hf",
            "score": 3,
            "text": "Wait until you hear about Bush v. Gore. And his opinions re: child labor laws, all governmental regulation, and civil protection.",
            "title_similarity": "0.5267585"
        },
        {
            "id": "i2c02us",
            "score": 1,
            "text": "I hope people just keep spamming this.  Normally i hate it but this deserves to be repeated.",
            "title_similarity": "0.38599497"
        },
        {
            "id": "i2c0934",
            "score": 3,
            "text": "You think this would be a huge conflict of interest and he should resign, Now!",
            "title_similarity": "0.49621576"
        },
        {
            "id": "i2c0dqv",
            "score": 3,
            "text": "The DOJ must act to hold the treasonous conspirators accountable. Garland’s inaction only emboldens more treason.",
            "title_similarity": "0.4993207"
        },
        {
            "id": "i2c0gjq",
            "score": 3,
            "text": "Holy shit if this was a democrat appointed judge the country would be on fire.",
            "title_similarity": "0.51085544"
        },
        {
            "id": "i2c0jys",
            "score": 1,
            "text": "And there will be no consequences for him or his wife.",
            "title_similarity": "0.24641183"
        },
        {
            "id": "i2c0kvt",
            "score": 1,
            "text": "I still can’t believe all this happened smh. This is wild. I thought this was America :(",
            "title_similarity": "0.3647557"
        },
        {
            "id": "i2c0tp9",
            "score": 1,
            "text": "Yet a good portion of the American voter base wont bother with this story and still vote the gop criminal organization in power.\n\nGood luck down south your going to need it.",
            "title_similarity": "0.5167519"
        },
        {
            "id": "i2c0xwl",
            "score": 2,
            "text": "Time to impeach. Get that unbiased asshole out of there.",
            "title_similarity": "0.42546996"
        },
        {
            "id": "i2c0zlg",
            "score": 2,
            "text": "Two pathetic worthless assholes. Thomas is literally a fat white planation owner in a black man’s body!",
            "title_similarity": "0.30069926"
        },
        {
            "id": "i2c111r",
            "score": 1,
            "text": "I'm sure the Hunter Biden Laptop people are very upset about this.  /s",
            "title_similarity": "0.394377"
        },
        {
            "id": "i2c15z1",
            "score": 1,
            "text": "Scrolled and scrolled and scrolled.  Not one mention of this is on r conservative.",
            "title_similarity": "0.2401662"
        },
        {
            "id": "i2c1eek",
            "score": 3,
            "text": "If someone has to get a security clearance from the government and something like this is brought up you can be damn sure they won’t get it. The same standard should apply for the Supreme Court",
            "title_similarity": "0.5390043"
        },
        {
            "id": "i2c1hex",
            "score": 2,
            "text": "Arrests have to be made. Biden's Justice Departments inaction and lack of teeth may just cost Americans their democracy",
            "title_similarity": "0.60618484"
        },
        {
            "id": "i2c1iei",
            "score": 2,
            "text": "Time to go Clarence.",
            "title_similarity": "0.17260325"
        },
        {
            "id": "i2c1lgb",
            "score": 2,
            "text": "Fuck us govt. \naside from all the wrong they do and drama they create, it’s embarrassing and pathetic. We don’t stand for anything anymore. This country has turned into a giant pussy. Constitution should be rewritten every 30 years like it was intended.",
            "title_similarity": "0.5634675"
        },
        {
            "id": "i2c1lvc",
            "score": 2,
            "text": "What's it going to take before we do something.....",
            "title_similarity": "0.15724391"
        },
        {
            "id": "i2c1ntd",
            "score": 1,
            "text": "Clarence Thomas doesn’t have a wife, he has a master.",
            "title_similarity": "0.19964087"
        },
        {
            "id": "i2c2efg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08839365"
        },
        {
            "id": "i2c2ji8",
            "score": 1,
            "text": "This is bananas!\nHe's out the hospital so let's get on w the DRAG of Ginni!\n\nLet's Go 🔥🔥",
            "title_similarity": "0.47456926"
        },
        {
            "id": "i2c2o1c",
            "score": 1,
            "text": "Thanks Joe Biden!",
            "title_similarity": "0.10737408"
        },
        {
            "id": "i2c2r8n",
            "score": 7,
            "text": "If we lived in a sane country, he would be an ex-Supreme Court Justice now",
            "title_similarity": "0.47315845"
        },
        {
            "id": "i2c3bp0",
            "score": 3,
            "text": "Both these people are less than honorable. Typical republicans.",
            "title_similarity": "0.22013783"
        },
        {
            "id": "i2c3xbo",
            "score": 3,
            "text": "Conservatives really are full mask off at this point.",
            "title_similarity": "0.39624375"
        },
        {
            "id": "i2c3xeq",
            "score": 3,
            "text": "The GOP (felon) swamp gets larger everyday.",
            "title_similarity": "0.12294944"
        },
        {
            "id": "i2c4140",
            "score": 3,
            "text": "It's funny that the side that says there was voter fraud, were the ones actually committing voter fraud.\nIs there going to be any repercussions for this bullshit?",
            "title_similarity": "0.4923432"
        },
        {
            "id": "i2c4ddw",
            "score": 3,
            "text": "Shouldn’t need a vote .Resignation would be the proper thing,  but he is not about that as we know. Even the appearance of  impropriety is how the bar is set, but ignored.",
            "title_similarity": "0.36633343"
        },
        {
            "id": "i2c4g5b",
            "score": 3,
            "text": "obvious outrage aside, can we talk about how DUMB boomers are? like everybody knows that text messages might as well be public information with how easy it is for authorities to obtain them, deleted or not.",
            "title_similarity": "0.46621728"
        },
        {
            "id": "i2c4m87",
            "score": 3,
            "text": "How about they be investigated and tried? What is with america just not wanting to prosecute rich powerful people.",
            "title_similarity": "0.54259133"
        },
        {
            "id": "i2c51kb",
            "score": 3,
            "text": "The parallels between our current situation in the US and the lead up to the Nazi take over of Germany are starting to get pretty crazy. \n\nAnd before anyone shoots this down with some bullshit like I’m being hyperbolic or dramatic, think about wether or not plenty of Germans were watching the lead up to Adolf’s rise to power trying to sooth themselves with the same rhetoric.",
            "title_similarity": "0.57468325"
        },
        {
            "id": "i2c5new",
            "score": 2,
            "text": "Me here holding the idea that trump can technically reach the speaker of the house, impeach Biden, finish out his term and run again in 2024. All of this riding on if he runs for Florida senator because he has residence in that state.",
            "title_similarity": "0.6649381"
        },
        {
            "id": "i2c5prl",
            "score": 1,
            "text": "Thanks Joe Biden for doing such a bang up job with this guy’s confirmation hearing with Anita Hill. 🙄",
            "title_similarity": "0.44860297"
        },
        {
            "id": "i2c5sux",
            "score": 2,
            "text": "It's really disturbing that nothing at all is going to come of this. It feels like some line has been crossed, I guess, like we're almost acknowledging now that we're just pretending to do this democracy thing.",
            "title_similarity": "0.36798528"
        },
        {
            "id": "i2c5t35",
            "score": 2,
            "text": "He needs to resign, or be removed. He’s a traitor.",
            "title_similarity": "0.43918878"
        },
        {
            "id": "i2c5y03",
            "score": 1,
            "text": "Republicans rationalizing this in their heads: \n\nJan. 6th 2021…\n\nCT: hey hun who’s blowing you up? \nVT: oh it’s just some girlfriends from the ol sorority talking about the reunion \nCT: oh okay well tell them I said hi. \nVT: will do… hey turn the news on, I heard something is happening at the capital. \nCT: sure thing… I’m going to the basement to read the constitution again if you need me\nVT: nope I’m good, praise Jesus. \nCT: Praise Jesus \n\nEnd scene",
            "title_similarity": "0.72846985"
        },
        {
            "id": "i2c5yyl",
            "score": 1,
            "text": "This is who Republicans are.",
            "title_similarity": "0.24295035"
        },
        {
            "id": "i2c63u4",
            "score": 2,
            "text": "Needs to resign *now*",
            "title_similarity": "0.3812223"
        },
        {
            "id": "i2c6d3f",
            "score": 1,
            "text": "Republican meme template. Flustered guy needs to push one of two buttons. One, the deep state is a bunch of committed career bureaucrats. The other, the deep state is a Supreme Court justice's wife's social circle and activities.",
            "title_similarity": "0.6769258"
        },
        {
            "id": "i2c6igi",
            "score": 1,
            "text": "Why aren’t these people up before a judge and headed to prison?",
            "title_similarity": "0.43932143"
        },
        {
            "id": "i2c6p11",
            "score": 1,
            "text": "We all know how impeachment will go, so unfortunately nothing we can do, he’s not going anywhere.  I don’t even know why I’m typing this, we all know it.  It’s just so wrong, sigh.",
            "title_similarity": "0.45412272"
        },
        {
            "id": "i2c70mu",
            "score": 1,
            "text": "… and nothing is done about it.",
            "title_similarity": "0.0738893"
        },
        {
            "id": "i2c73qu",
            "score": 2,
            "text": "So like, legally he was supposed to recuse himself right???",
            "title_similarity": "0.26965654"
        },
        {
            "id": "i2c75s9",
            "score": 2,
            "text": "Thomas has to go already…. He’s compromised and always has been…..",
            "title_similarity": "0.28930935"
        },
        {
            "id": "i2c7gvm",
            "score": 1,
            "text": "Keeping a crazy wife ain't a crime... He has his reasons lmao",
            "title_similarity": "0.40222907"
        },
        {
            "id": "i2c7rfo",
            "score": 1,
            "text": "And it wasn't the first time! She did the same for Bush",
            "title_similarity": "0.19163576"
        },
        {
            "id": "i2c8b9b",
            "score": 1,
            "text": "My only question is, will anything happen to them for their treason? \n\nI'm a cynic and I think nothing will happen.",
            "title_similarity": "0.3982975"
        },
        {
            "id": "i2c9560",
            "score": 1,
            "text": "Is this not treason ? Why is nothing happening to these people ? Are their positions so powerful they’re immune ? Or does this kind of thing take years ?",
            "title_similarity": "0.4252591"
        },
        {
            "id": "i2c9ak4",
            "score": 2,
            "text": "republican voters: I dont understand whats so bad about this?",
            "title_similarity": "0.48326886"
        },
        {
            "id": "i2c9xap",
            "score": 1,
            "text": "I bet Ukraine wishes they had listened.",
            "title_similarity": "0.3437658"
        },
        {
            "id": "i2cacro",
            "score": 2,
            "text": "Why is the GOP so worried about the Left taking “America down” when America has already been taken down by capitalism and white supremacy? \n\nJust shut up and start caring for your communities as you care for yourself.",
            "title_similarity": "0.57969636"
        },
        {
            "id": "i2calad",
            "score": 1,
            "text": "Is that legal or not. Please help me out any lawyers out there",
            "title_similarity": "0.38284627"
        },
        {
            "id": "i2caqa6",
            "score": 9,
            "text": "Please remember that Republicans are not conservatives. \n\nTrue conservatives don't vote for those who cheat on their pregnant wife. \n\nTrue conservatives don't vote for those who refuse to prepare for a crisis. \n\nTRUE AMERICANS don't commit insurrection or lie about election results. \n\nRepublicans are not conservatives. \n\nRepublicans are anti-Americans.",
            "title_similarity": "0.5782236"
        },
        {
            "id": "i2cb6ee",
            "score": 2,
            "text": "This is so wrong. Clarance T needs to do the honorable thing and resign. The Supreme Court has lost so much credibility. Any association with this present group of people creating this climate of un trust and believing fake things needs to be be stopped immediately",
            "title_similarity": "0.5781347"
        },
        {
            "id": "i2cbbs8",
            "score": 1,
            "text": "So, this impeachment is going to happen any day now...right?",
            "title_similarity": "0.48499414"
        },
        {
            "id": "i2cbeee",
            "score": 1,
            "text": "I'm curious how many days will it be before Justice Thomas will resign.   I'm also curious if his hospital admittance was related to this?   Maybe he was trying to deflect any news?   He needs to go, but it will be too hard to remove him, however, if they do and succeed in removing him, then Brett Kavanaugh will most likely be next.",
            "title_similarity": "0.5836913"
        },
        {
            "id": "i2cbfeg",
            "score": 3,
            "text": "Whose with me in not believing that Clarence Thomas was not sick and not in the hospital?\n\nMy guess is that they said he was in the hospital because both he and Ginni knew this was coming down the pipes and decided it was best to avoid his colleagues and let the storm ride out while keeping out of sight.   \n\nHe was a pig decades ago when he assaulted Anita Hill and he's a lying pig now, along with his absolute vile wife.  Both of them using his job to overturn the gov't...unbelievable.",
            "title_similarity": "0.57001555"
        },
        {
            "id": "i2cbipv",
            "score": 1,
            "text": "Maybe she can call Putin and get him to stop the war…lmfao.",
            "title_similarity": "0.7172698"
        },
        {
            "id": "i2cbk1v",
            "score": 1,
            "text": "I thought Louie Anderson died?",
            "title_similarity": "0.2730684"
        },
        {
            "id": "i2cbwod",
            "score": 3,
            "text": "Ginni committed a serious offense, using her husband’s position as leverage for her own dealings. Citizens United didn’t help citizens, it helped corporations become people entities but not be held criminally responsible or accountable for business fraud, Ponzi Scheme, illegal pyramid schemes, insider trading, and major conflicts of interest, both within political spheres and in the global markets. That is absolutely unacceptable!!! r/HouseofRepresentatives r/Democrats r/Republicans r/Congress r/ExecutiveBranch r/LegislativeBranch r/Senate r/JudiciaryCommittee r/FinanceComittee r/BudgetNeedsFixing r/TrumpLies r/PutinCries r/ZelenskyyWins r/UkraineWon r/RussiaDisavowsPutin r/PutinPoisons r/PutinJeopardizesRussianCitizens r/RussiansHatePutin",
            "title_similarity": "0.6231578"
        },
        {
            "id": "i2cc2ep",
            "score": 1,
            "text": "Full sweep.",
            "title_similarity": "0.06640625"
        },
        {
            "id": "i2ccdis",
            "score": 1,
            "text": "First time hearing about this.",
            "title_similarity": "0.059310574"
        },
        {
            "id": "i2ccomh",
            "score": 1,
            "text": "There are two options for the Thomases. \n\n1) He denounce his wife’s stated views. \n\n2) He steps down from the Court to protect the integrity of the court.",
            "title_similarity": "0.5856736"
        },
        {
            "id": "i2cd4do",
            "score": 1,
            "text": "She's American right?",
            "title_similarity": "0.2899394"
        },
        {
            "id": "i2cda6k",
            "score": 1,
            "text": "There must be consequences. I cannot take all this fucking treason anymore!!!",
            "title_similarity": "0.40356064"
        },
        {
            "id": "i2cddqq",
            "score": 1,
            "text": "And nothing will be done about it.",
            "title_similarity": "0.11082298"
        },
        {
            "id": "i2cdj2r",
            "score": 1,
            "text": "ruzzpublicans have infiltrated every branch of the american government.",
            "title_similarity": "0.45069906"
        },
        {
            "id": "i2cdo50",
            "score": 1,
            "text": "Subpoena her ass to the committee and impeach his ass",
            "title_similarity": "0.6140472"
        },
        {
            "id": "i2ceauz",
            "score": 2,
            "text": "And nothing will happen, because an (R) did it, and politics are a zero sum binary game to these people.",
            "title_similarity": "0.37031204"
        },
        {
            "id": "i2cedpv",
            "score": 1,
            "text": "That’s… completely unacceptable",
            "title_similarity": "0.08777194"
        },
        {
            "id": "i2ceyqa",
            "score": 1,
            "text": "Really surprised at u Clarence",
            "title_similarity": "0.074451804"
        },
        {
            "id": "i2cfgga",
            "score": 2,
            "text": "....and the Supreme Court Justice was the lone vote not to let Congress have documents related to Jan-6. Using your position to protect your wife sounds like bad behavior to me, the one exception to their lifetime tenure.",
            "title_similarity": "0.6532009"
        },
        {
            "id": "i2cg0jn",
            "score": 1,
            "text": "Good for her",
            "title_similarity": "0.05674809"
        },
        {
            "id": "i2cg9jn",
            "score": 1,
            "text": "I'm certain that this presents absolutely no issues to the members of the GOP.\n\nIn fact, this probably makes Ginni a *Real American Patriot* !!",
            "title_similarity": "0.46628532"
        },
        {
            "id": "i2cgacl",
            "score": 1,
            "text": "Oh hey, known sex offender and general shit bag Clarence Thomas. Not surprising. Nothing will be done.",
            "title_similarity": "0.3449741"
        },
        {
            "id": "i2cgan2",
            "score": 1,
            "text": "Would really love to see an attorney arguing a case before the supreme court actively object to his presence and question his legitimacy to be sitting on the bench.",
            "title_similarity": "0.5412982"
        },
        {
            "id": "i2cgbwe",
            "score": 1,
            "text": "Keeps getting worse.",
            "title_similarity": "0.057629064"
        },
        {
            "id": "i2cghe5",
            "score": 1,
            "text": "He’s resigned right? Right?!?",
            "title_similarity": "0.20744656"
        },
        {
            "id": "i2ch0zb",
            "score": 1,
            "text": "The corruption deepens.  Guess I want to know when those elected to represent are supposed to start representing us.  Too many gullible folks that believe the misinformation without researching or challenging.",
            "title_similarity": "0.4873587"
        },
        {
            "id": "i2ch9xg",
            "score": 2,
            "text": "Republicans and conservatives don’t give a shit not do they respect rules. \nNothing will happen to politicians and their significant others involved in Jan 6th. That’s the US. Poor people on the other hand get raped over a stolen pack of gum. \n\nRepublicans and conservatives would shit on the American flag and wipe with the constitution and they would still get voted into office.",
            "title_similarity": "0.6568417"
        },
        {
            "id": "i2chcfw",
            "score": 2,
            "text": "You know what would be nice? If everyone got arrested for crimes instead of just the non-rich",
            "title_similarity": "0.4009549"
        },
        {
            "id": "i2chu75",
            "score": 2,
            "text": "Funny how the article just seems to assume it knows all the electoral issues",
            "title_similarity": "0.46333945"
        },
        {
            "id": "i2chw05",
            "score": 1,
            "text": "I'm wondering if this would have happened with any other republican from 2016.  Like would these characters be desperately trying to steal the election if say, Jeb Bush was president?  It just boggles my mind how far these characters go for a guy who just wanted to tweet, golf, and make some money and notoriety off the presidency.",
            "title_similarity": "0.6747154"
        },
        {
            "id": "i2ci0np",
            "score": 1,
            "text": "They can all go swallow an avocado seed for all I care.",
            "title_similarity": "0.33517206"
        },
        {
            "id": "i2cibmp",
            "score": 2,
            "text": "Thomas should resign!",
            "title_similarity": "0.36342913"
        },
        {
            "id": "i2cipma",
            "score": 1,
            "text": "She trailer park",
            "title_similarity": "0.2683041"
        },
        {
            "id": "i2ciz8z",
            "score": 1,
            "text": "Hey, are those pubes or treason on that Coke can?",
            "title_similarity": "0.28219616"
        },
        {
            "id": "i2cj06z",
            "score": 1,
            "text": "Probably part of Trump's initiative to keep going.",
            "title_similarity": "0.3927749"
        },
        {
            "id": "i2ck5e7",
            "score": 1,
            "text": "One plus about corrupt old people is at least they don’t understand technology.",
            "title_similarity": "0.35873482"
        },
        {
            "id": "i2ck5ic",
            "score": 1,
            "text": "Scotus judge: \\*Rules on legal case that directly implicates his wife (she wasn't screaming to her parents that Trump won), presenting clear conflict of interest.\\*\n\nConsequences:",
            "title_similarity": "0.7634641"
        },
        {
            "id": "i2ck95x",
            "score": 1,
            "text": "There is no way he didnt know what she was up to....unless they are divorced/separated",
            "title_similarity": "0.35030574"
        },
        {
            "id": "i2ck9ee",
            "score": 2,
            "text": "Above the law.",
            "title_similarity": "0.06290422"
        },
        {
            "id": "i2ckv5v",
            "score": 1,
            "text": "We assume his wife sent that text, he might have done it for all we know.",
            "title_similarity": "0.577157"
        },
        {
            "id": "i2cl16x",
            "score": 1,
            "text": "Yep. Geez I wonder why he voted to keep them private..😒",
            "title_similarity": "0.26689315"
        },
        {
            "id": "i2cl1rd",
            "score": 3,
            "text": "Why is it that the evidence for trump and co instigating an illegal election overturning is at this point in PLAIN VIEW and yet Republicans genuinely believe that trump is a saint who did nothing wrong and the (clear) insurrection was nothing more than peaceful protest. How could you possibly believe that?",
            "title_similarity": "0.5864182"
        },
        {
            "id": "i2clp9c",
            "score": 2,
            "text": "Both working each side of the street. He should resign and she should go to jail. Oh wait, they are republicans so they will get a payoff.",
            "title_similarity": "0.69476926"
        },
        {
            "id": "i2clrmq",
            "score": 2,
            "text": "Treason",
            "title_similarity": "0.19390716"
        },
        {
            "id": "i2cmc03",
            "score": 2,
            "text": "probably texted on clarence's insistence. fucking pos",
            "title_similarity": "0.35527635"
        },
        {
            "id": "i2cmn78",
            "score": 4,
            "text": "Add these two to the list of people who actively participated in overthrowing our government but wont face any consequences",
            "title_similarity": "0.5682628"
        },
        {
            "id": "i2cmqcr",
            "score": 3,
            "text": "I'm starting to think he was in the hospital because he's a victim of domestic violence... She seems like a hubby-beater.",
            "title_similarity": "0.5377741"
        },
        {
            "id": "i2cmqfa",
            "score": 2,
            "text": "\"trump wins in 2024 after all the new republican voting restrictions\"\n\nrepublicans: see he won fair and square",
            "title_similarity": "0.60122204"
        },
        {
            "id": "i2cnbsx",
            "score": 1,
            "text": "But he's TOTALLY not biased",
            "title_similarity": "-0.0656413"
        },
        {
            "id": "i2cngsg",
            "score": 1,
            "text": "Where is the DOJ and their charges? \nReco act might also come into play",
            "title_similarity": "0.2952721"
        },
        {
            "id": "i2cnxzl",
            "score": 2,
            "text": "Justice Thomas needs to be impeached.",
            "title_similarity": "0.4364696"
        },
        {
            "id": "i2co6ha",
            "score": 2,
            "text": "Liberals do not exist on the Supreme Court. Thomas is the most right wing and racist. The moderates are mostly Republicans when it comes to criminal justice, except the death penalty. They do not believe in substantive due process and are all conservatives.",
            "title_similarity": "0.51279324"
        },
        {
            "id": "i2com5s",
            "score": 4,
            "text": "…and the same Justice was the only dissenting vote against the discovery of Trump’s records associated with the election.",
            "title_similarity": "0.5742402"
        },
        {
            "id": "i2coy9n",
            "score": 3,
            "text": "…and nothing will happen whatsoever Bc Republicans.",
            "title_similarity": "0.30971768"
        },
        {
            "id": "i2cpw1b",
            "score": 1,
            "text": "No conflict of  interests there",
            "title_similarity": "-0.005991894"
        },
        {
            "id": "i2cq4tv",
            "score": 4,
            "text": "I believed Anita Hill back then and still believe her.  He should NEVER have been seated to begin with.",
            "title_similarity": "0.40629092"
        },
        {
            "id": "i2cq6pq",
            "score": 2,
            "text": "Head over to Conservative sub and read the shit they are saying about this. It’s fucking crazy lol.",
            "title_similarity": "0.4691702"
        },
        {
            "id": "i2cqbbt",
            "score": 7,
            "text": "Isn’t this the deep state we keep hearing about?",
            "title_similarity": "0.06482241"
        },
        {
            "id": "i2cqrnr",
            "score": 1,
            "text": "Post it 5 more times",
            "title_similarity": "0.08843893"
        },
        {
            "id": "i2cqrps",
            "score": 1,
            "text": "I’m glad the Supreme Court is a non-partisan part of government.",
            "title_similarity": "0.33272508"
        },
        {
            "id": "i2cr3sq",
            "score": 2,
            "text": "Far right extremist are declaring war on fellow Americans, this is Treason!",
            "title_similarity": "0.5421878"
        },
        {
            "id": "i2crk5y",
            "score": 1,
            "text": "Just thinking out loud here but what would the fuck bag Cruz do or Hawley if this was a more liberal justice…",
            "title_similarity": "0.4266056"
        },
        {
            "id": "i2crmnv",
            "score": 1,
            "text": "Seems like a super impartial ethical moral judge.  I am being sarcastic.  This court is a partisan joke.",
            "title_similarity": "0.44268826"
        },
        {
            "id": "i2crn52",
            "score": 2,
            "text": "Clarence Thomas just gets worse and worse. Imagine the pillow talk between him and his wife? Just awful... He should resign.",
            "title_similarity": "0.49630004"
        },
        {
            "id": "i2crz6q",
            "score": 1,
            "text": "The Ghost of Goebbels is proud her, although her husband would have been put in a death camp within minutes.",
            "title_similarity": "0.5699606"
        },
        {
            "id": "i2csdx3",
            "score": 3,
            "text": "And we’ll do absolutely nothing about it just like every other seditious lie and act by republikkkans and we’ll continue to let Thomas and Barrett and Kavanaugh stay on the court despite being unfit, uneducated, and or a mouthpiece for fringe right wing and religious extremists.",
            "title_similarity": "0.49320024"
        },
        {
            "id": "i2csj39",
            "score": 1,
            "text": "Clarence likes those big ole boobies",
            "title_similarity": "0.12082479"
        },
        {
            "id": "i2ct1he",
            "score": 6,
            "text": "And then, he voted to keep Trump’s “secrets” secret. He should be removed from the court and disbarred. Period!",
            "title_similarity": "0.622759"
        },
        {
            "id": "i2ctii8",
            "score": 3,
            "text": "Her disdain for Democrats is very apparent. We need them to balance out the Republicans over zeal for corporations and disdain for all who aren't super wealthy. She has no apparent ability to tell fact from fiction. God help us if her husband is that deficient and biased.",
            "title_similarity": "0.64251864"
        },
        {
            "id": "i2ctkrn",
            "score": 1,
            "text": "She’s a KANT!",
            "title_similarity": "0.24022663"
        },
        {
            "id": "i2ctky9",
            "score": 3,
            "text": "This is Outright treason especially coming from the wife of a Supreme Court judge that sits on the highest court in the land how the fuck does she have instant access to such a high ranking official in the trump administration im not a rightwinger by any means also I might not agree with alot of democrats Biden’s policies but I will not say he did not win the election, don’t like the direction this country is heading, this is how the early things in history can be used as benchmarks to mark the beginning of let’s say a civil war or some other huge turning point in USA government history,little things like this eventually add up to bigger things, this is nuts there was an attempted coup de tat on a duly elected president,no wonder putin thought he could just March into Ukraine he is seeing the USA government in major disarray infighting attempted overthrow by the Republican Party",
            "title_similarity": "0.7618551"
        },
        {
            "id": "i2ctnbb",
            "score": 3,
            "text": "All Republicans in government are complicit.  They all deserve to be removed, forcefully, from their offices, and treated as the traitors they are.  No mercy, no forgiveness.  \n\nWant to heal the nation?  Remove the rot!",
            "title_similarity": "0.59805197"
        },
        {
            "id": "i2cu8rj",
            "score": 1,
            "text": "Time to get some payback for the Garland nomination",
            "title_similarity": "0.3558084"
        },
        {
            "id": "i2cuak6",
            "score": 1,
            "text": "You know whose the power in her house HER.",
            "title_similarity": "0.33780497"
        },
        {
            "id": "i2cuc03",
            "score": 1,
            "text": "> there's a lot of judicial wives and husbands out there causing trouble. I'm just one of many.\n  \n-Ginni Thomas",
            "title_similarity": "0.48518693"
        },
        {
            "id": "i2cuk0k",
            "score": 2,
            "text": "The Supreme Court is more of an obstacle against democracy than the legislative and executive branches combined",
            "title_similarity": "0.39809775"
        },
        {
            "id": "i2cuotf",
            "score": 2,
            "text": "yeah but....BIDEN'S LAPTOP! HILLARY'S EMAILS! omfg. nothing will be done, and Thomas will go on without recusing himself from anything.",
            "title_similarity": "0.42430598"
        },
        {
            "id": "i2cv0ld",
            "score": 1,
            "text": "Lock them both up!!",
            "title_similarity": "0.2185063"
        },
        {
            "id": "i2cv24k",
            "score": 1,
            "text": "I’m thinking that maybe it was his hair on that coke",
            "title_similarity": "0.1929937"
        },
        {
            "id": "i2cv915",
            "score": 3,
            "text": "This is like the 10th time I've seen this headline, and I'm sitting here wondering if anything will be done at all. All some people are asking for is that he recuse himself from cases involving Trump, and I doubt even that will happen. Republicans have zero accountability at this point, because their voters don't hold them accountable for the corrupt shit they do. They only care that their politicians are out there making a fuss about transgender athletes and other totally meaningless shit.",
            "title_similarity": "0.6120268"
        },
        {
            "id": "i2cvadn",
            "score": 1,
            "text": "Sorry bro but and your treasonist ho€ has got to go!!!!",
            "title_similarity": "0.4039683"
        },
        {
            "id": "i2cvalb",
            "score": 1,
            "text": "He should recuse himself from the Supreme Court \nHe can never be impartial",
            "title_similarity": "0.46775663"
        },
        {
            "id": "i2cvrd2",
            "score": 1,
            "text": "It pisses me people like that can look so genuinely happy and be so dump.",
            "title_similarity": "0.2343445"
        },
        {
            "id": "i2cvu8p",
            "score": 1,
            "text": "To think that a Karen started the election fruad haha",
            "title_similarity": "0.48430973"
        },
        {
            "id": "i2cw8dn",
            "score": 1,
            "text": "Wasn’t he the supreme court justice with a pubic hair in his can of coke?",
            "title_similarity": "0.32825682"
        },
        {
            "id": "i2cws88",
            "score": 1,
            "text": "Now Renée Zellweger needs to get suited back up and do, “The Thing About Ginni.”",
            "title_similarity": "0.46602952"
        },
        {
            "id": "i2cwu8p",
            "score": 1,
            "text": "nothing is gonna happen to them. America sucks.",
            "title_similarity": "0.32089806"
        },
        {
            "id": "i2cwzf6",
            "score": 1,
            "text": "Isn’t this attempted tampering of an election? Sounds like a crime has been committed…..",
            "title_similarity": "0.4620977"
        },
        {
            "id": "i2cx227",
            "score": 2,
            "text": "Looks like Biden might get to make another Supreme Court nomination soon. The other Justices are certainly not excited to have this happening in the top court. If it comes out that Thomas knew his wife's texts were included in the ruling on Trump vs Thompson, I'm not sure he could survive remaining on the court. He certainly cannot rule on any future cases related to Jan 6th without stating the obvious conflict of interest, if it involves his wife now that we know.",
            "title_similarity": "0.6484957"
        },
        {
            "id": "i2cx3op",
            "score": 1,
            "text": "I feel like the US Government it’s gaslighting me",
            "title_similarity": "0.4974339"
        },
        {
            "id": "i2cx4u2",
            "score": 1,
            "text": "So does *this* mean that there will be consequences?",
            "title_similarity": "0.13810956"
        },
        {
            "id": "i2cxg2m",
            "score": 1,
            "text": "How in the actual FUCK does this shit continue? Can't they see how insane this is? How it looks?",
            "title_similarity": "0.2858907"
        },
        {
            "id": "i2cxy8g",
            "score": 1,
            "text": "I swear Netflix has to make a TV series about all this insanity. Would make for some great TV.",
            "title_similarity": "0.4853779"
        },
        {
            "id": "i2cxzxu",
            "score": 1,
            "text": "Yet, nothing will be done about this. \nThis is the exact track the gop is heading for with the next elections. Full control of the house, senate, Supreme Court, and the presidential office. \nOnce they are in full control of these branches, they will never relinquish them. They will change the laws to ensure that democratic candidates will not be able to win elections ever again.",
            "title_similarity": "0.6313312"
        },
        {
            "id": "i2cy4ax",
            "score": 1,
            "text": "Reality is the GOP would consider Lincoln a liberal not a Republican. The current GOP party has taken the Republican Party Lincoln and others crafted and dismantled it to be a party against the very fabric of what this country try is about. Sure you have a minority who actually want to do the right thing but the system is literally set up like a House of Cards show minus the murders. If you go against the party you will lose your committee chair if you have one and they will place a candidate to go against you in the primary. Just look at the rhetoric and you see that Integrity and commitment to country is absent. Their commitment is to their twisted ideologies and their donors who just want the status quo stay the same no matter how much it hurts the actual Republican voter. Because the tax cuts they pass never seem to help their base except for their rich friends but eh. That’s the American system and like Rome it will be the potential break down of the system. All the while China sits backs and waits for America to break itself apart.",
            "title_similarity": "0.6770599"
        },
        {
            "id": "i2cycic",
            "score": 1,
            "text": "Yes and? Nothing is going to continue to happen.",
            "title_similarity": "0.08754747"
        },
        {
            "id": "i2cyfg1",
            "score": 1,
            "text": "Is this yet another example of why the American political system is fucked? At what point does it become obvious the framers of the Constitution got it wrong? By this I mean the ridiculously high threshold needed to make the required changes to make the Constitution fit the current state of play in America. It seems every fucked up situation in America related to political appointments, laws, bills, etc. at either a federal or state level are literally enabled by the Constitution and at the same time unable to be fixed because of the Constitution. It seems that if you have the cheat code for the Constitution code you can do what the fuck you want. It also looks like Republicans got that fucker years ago. Clearly I am not an American and not a Constitutional scholar but by god this document seems to be holding you guys back.",
            "title_similarity": "0.5850279"
        },
        {
            "id": "i2cyl5m",
            "score": 1,
            "text": "Someone might want to do something about that.",
            "title_similarity": "0.046548642"
        },
        {
            "id": "i2czss1",
            "score": 1,
            "text": "And yet she is walking free. Meanwhile if a poor person just fits the profile of a robbery/assault/etc suspect they can be killed or detained....",
            "title_similarity": "0.46932167"
        },
        {
            "id": "i2d05qz",
            "score": 2,
            "text": "Government is a joke,  especially with Putins administration I mean Trumps administration.",
            "title_similarity": "0.53072053"
        },
        {
            "id": "i2d0hkb",
            "score": 2,
            "text": "Corruption at the highest level",
            "title_similarity": "0.21593639"
        },
        {
            "id": "i2d0z01",
            "score": 6,
            "text": "Man your country is fucked up",
            "title_similarity": "0.22234023"
        },
        {
            "id": "i2d2h7s",
            "score": 2,
            "text": "The movie Get Out was based on this couple",
            "title_similarity": "0.3407542"
        },
        {
            "id": "i2d3hjm",
            "score": 1,
            "text": "Strong Handmaid’s Tale vibes going on here",
            "title_similarity": "0.21326151"
        },
        {
            "id": "i2d3ofx",
            "score": 1,
            "text": "The thing I find really puzzling about US politics (as someone who doesn’t live there and is supportive of democrat positions generally) is that the Democrats control both houses of congress and the presidency, have positions on most issues that get majority support and have a much easier time with the news media than in a lot of countries (in the UK for example our newspapers are almost entirely right wing partisan), yet seem utterly incapable of getting it together and sorting out this massively obvious open corruption. I know there are elections this year which will probably swing at least one of those back to Republican but what the hell have you all been doing for 2 years?",
            "title_similarity": "0.53614205"
        },
        {
            "id": "i2d56so",
            "score": 1,
            "text": "No meaningful justice will ever be visited upon people in power America.",
            "title_similarity": "0.42850244"
        },
        {
            "id": "i2d56xp",
            "score": 1,
            "text": "The deep state turned out to be Q nuts. Not on my bingo card. I knew she financed busses, but believing Biden would be on a prisoner barge. What the actual fuck is that!?!",
            "title_similarity": "0.5424875"
        },
        {
            "id": "i2d5ccx",
            "score": 1,
            "text": "Cause…that is a professional thing to do.  Not.",
            "title_similarity": "0.14401808"
        },
        {
            "id": "i2d5qh4",
            "score": 1,
            "text": "Nah they were just kibitzing and comisserating, right Wall Street Journal?\n\n(WSJ published an opinion, from the entire editorial board, that used those two words exactly, and sought to dismiss the whole situation as a ‘political sideswipe’)",
            "title_similarity": "0.6115217"
        },
        {
            "id": "i2d5ud7",
            "score": 2,
            "text": "Conflict of interest. Impeach now.",
            "title_similarity": "0.34659865"
        },
        {
            "id": "i2d5zef",
            "score": 3,
            "text": "I knew she was extremely conservative I had no Idea she was batshit crazy and flat earth stupid.  Half those texts make her sound like she’s on a mission from god. We need to shame these quacks",
            "title_similarity": "0.5764675"
        },
        {
            "id": "i2d64ec",
            "score": 1,
            "text": "The 2 of them are shameful and have brought embarrassment to his position on the court.\n\nIMO they are also ignorant and outright stupid.\n\nHe needs to resign and she needs to think about what truth really is.",
            "title_similarity": "0.4647259"
        },
        {
            "id": "i2d6b6x",
            "score": 1,
            "text": "Nothing will happen",
            "title_similarity": "0.05562079"
        },
        {
            "id": "i2d6hs0",
            "score": 1,
            "text": "Of course she did",
            "title_similarity": "0.05353921"
        },
        {
            "id": "i2d8d6z",
            "score": 1,
            "text": "Any negative comments will be deemed racist.",
            "title_similarity": "0.2844453"
        },
        {
            "id": "i2d91xt",
            "score": 5,
            "text": "Unfortunately, there are too many that agree with her way of thinking.",
            "title_similarity": "0.17785576"
        },
        {
            "id": "i2d9plc",
            "score": 1,
            "text": "go straight to hell bruh\n\ndon’t pass GO, don’t collect $200",
            "title_similarity": "0.4071012"
        },
        {
            "id": "i2da6b8",
            "score": 1,
            "text": "Who wants to bet Thomas divorces her to stay on the court?",
            "title_similarity": "0.62583816"
        },
        {
            "id": "i2da9j4",
            "score": 1,
            "text": "Merica F’ya!",
            "title_similarity": "0.15012464"
        },
        {
            "id": "i2db3jv",
            "score": 1,
            "text": "See how characterless is this guy having not resigned yet",
            "title_similarity": "0.057793304"
        },
        {
            "id": "i2dbzbn",
            "score": 1,
            "text": "Willing to bet you wish he had at this point",
            "title_similarity": "0.20989765"
        },
        {
            "id": "i2dcg3v",
            "score": 1,
            "text": "And there's nothing we can do about it and those with the power definitely wont",
            "title_similarity": "0.2838307"
        },
        {
            "id": "i2dcv3h",
            "score": 2,
            "text": "Watch as only Democrats object to this kind of behavior.",
            "title_similarity": "0.370542"
        },
        {
            "id": "i2ddowr",
            "score": 1,
            "text": "Why are we surprised? \n\nThis brilliant legal mind forgot to disclose wife's income of almost $700,000.\n\nEleven years later he's still on the bench.",
            "title_similarity": "0.5020359"
        },
        {
            "id": "i2dek0d",
            "score": 3,
            "text": "where are all those “ban interracial marriage” conservatives again?",
            "title_similarity": "0.62246877"
        },
        {
            "id": "i2dfbft",
            "score": 1,
            "text": "Where is Sinclair Broadcasting when you need them... \"This is extremely dangerous to our democracy.\"",
            "title_similarity": "0.46215904"
        },
        {
            "id": "i2dfhxz",
            "score": 2,
            "text": "Honestly sick of hearing about this kind of crap until someone actually happens as a consequence of it.",
            "title_similarity": "0.3395942"
        },
        {
            "id": "i2dg3jo",
            "score": 2,
            "text": "Impeach Thomas! Worthless Justice, rules the way his wife tells him.",
            "title_similarity": "0.6168812"
        },
        {
            "id": "i2dggnh",
            "score": 3,
            "text": "Get these fuckers out of positions of power. Y'all need to quit playing fair with conservatives, they're fucking crazy.",
            "title_similarity": "0.56762254"
        },
        {
            "id": "i2dguzo",
            "score": 1,
            "text": "The system is broken, and has been for awhile. We must find a balance between discussion and action.",
            "title_similarity": "0.31995362"
        },
        {
            "id": "i2dhmnp",
            "score": 1,
            "text": "Like anything is going to happen.",
            "title_similarity": "0.09370842"
        },
        {
            "id": "i2di2oo",
            "score": 1,
            "text": "Just really means a SCJ of the US oA is a cuck...",
            "title_similarity": "0.3195389"
        },
        {
            "id": "i2dnhip",
            "score": 2,
            "text": "Nothing to see here. I don't talk to my wife so there is no way she would have influenced me in any way. I value the privacy of my wives text messages. \n\nSo much so that I will vote to keep them suppressed on a national level!",
            "title_similarity": "0.5263111"
        },
        {
            "id": "i2do5ni",
            "score": 1,
            "text": "He should resign immediately",
            "title_similarity": "0.3884565"
        },
        {
            "id": "i2dpvp7",
            "score": 2,
            "text": "I'm so fucking tired of hearing about all these criminal actions brought to light, yet nothing happens.",
            "title_similarity": "0.3476708"
        },
        {
            "id": "i2drlom",
            "score": 1,
            "text": "I would expect nothing less from her.  She does absolutely whatever she wants and doesn’t take her husbands image or responsibility into consideration.  I hope it grinds his gears each time she makes the news.",
            "title_similarity": "0.5665285"
        },
        {
            "id": "i2druc0",
            "score": 1,
            "text": "You’ll get him this time\n\n*shakes fist in anger",
            "title_similarity": "0.4082361"
        },
        {
            "id": "i2ds0ql",
            "score": 1,
            "text": "Honestly she sounds like she’s stupid as fuck.",
            "title_similarity": "0.24558114"
        },
        {
            "id": "i2dsduu",
            "score": 1,
            "text": "Source: Trust me Bro!",
            "title_similarity": "0.119031794"
        },
        {
            "id": "i2dsijp",
            "score": 1,
            "text": "Lock her up !",
            "title_similarity": "0.30714786"
        },
        {
            "id": "i2dte1y",
            "score": 1,
            "text": "Quoting He Who Must Not Be Named: Lock her up.\n\nAnd her husband too. At least have Thomas resign. This is beyond criminal.",
            "title_similarity": "0.6027119"
        },
        {
            "id": "i2dv00r",
            "score": 2,
            "text": "Yeah but yeah but yeah but, some imaginary bullshit that might be on a laptop that might belong to Hunter Biden! Didn’t you see the latest video from the YouTuber FreedomTruthBibleBaldEagleGunsTruth1776?!?!?!",
            "title_similarity": "0.437609"
        },
        {
            "id": "i2dvzs8",
            "score": 1,
            "text": "This is old news and it's going nowhere.",
            "title_similarity": "0.20756754"
        },
        {
            "id": "i2dwolp",
            "score": 3,
            "text": "Don't matter. No one ever suffers consequences.",
            "title_similarity": "0.06303124"
        },
        {
            "id": "i2dwtt2",
            "score": 1,
            "text": "This is why every single person needs to vote and vote Democrat.   Then we can get more justices on the SC bench that will uphold the rule of law and get this a hole off the bench and behind bars.",
            "title_similarity": "0.53999186"
        },
        {
            "id": "i2dx7s7",
            "score": 1,
            "text": "Wow. Was she trying to sabotage her husbands career? How stupid do you have to be pulling something off like that.",
            "title_similarity": "0.57172817"
        },
        {
            "id": "i2dywvu",
            "score": 2,
            "text": "The text messages were just another revelation of the corrupt conservatives plan to over rule the will of the voters and overturn the election thereby returning that idiot to the presidency. Thomas was their secret weapon, exposed when he was the line dissent against the release of the messages, emails etc during the idiot’s disastrous administration and confirmed by Thomas’ controlling wife Ginni’s text messages. It will not be easy removing Thomas from office unless he gets ill or die. Either way, he has shown that he’s not impartial and henpecked.",
            "title_similarity": "0.70991063"
        },
        {
            "id": "i2e0zhu",
            "score": 1,
            "text": "To impeach him takes a simple majority in the house but takes 2/3rds majority in the Senate which would be a long shot. So much corruption.",
            "title_similarity": "0.5551765"
        },
        {
            "id": "i2e236f",
            "score": 1,
            "text": "Kick him out! He is unclean.",
            "title_similarity": "0.31200576"
        },
        {
            "id": "i2e3m7y",
            "score": 1,
            "text": "And nobody's going to do a goddamned thing about it. We are fully in the era of moral rot in America. The necessity of law is directly relative to the level of power one holds. It's all about will and power now. The rules are for those who have neither.",
            "title_similarity": "0.497531"
        },
        {
            "id": "i2e5vo1",
            "score": 1,
            "text": "Shh. They’re saying the quite post out loud.",
            "title_similarity": "0.24856779"
        },
        {
            "id": "i2e7blr",
            "score": 1,
            "text": "Pay attention to the outcome of this shit show. If nothing happens and it's down played that's a reason to be very concerned.\nTraitors shouldn't be applauded. They should have no part in our government and they are a threat to our republic. The poor excuse of not getting involved with your wife's decisions and actions to maintain a happy home is a BS excuse. It's pretend. A fairy tale through and through.\n\nHe has just as much culpability as she does. He should no longer be a supreme court justice.\n\nThis is my opinion at least.",
            "title_similarity": "0.62670434"
        },
        {
            "id": "i2ecmzx",
            "score": 1,
            "text": "Neo-Nazi",
            "title_similarity": "0.2503295"
        },
        {
            "id": "i2edvg9",
            "score": 1,
            "text": "Blatant crime with no consequences",
            "title_similarity": "0.08036919"
        },
        {
            "id": "i2egb0q",
            "score": 1,
            "text": "Wth",
            "title_similarity": "-0.013995361"
        },
        {
            "id": "i2eihia",
            "score": 1,
            "text": "Is there a new development or is this the same story from last week?",
            "title_similarity": "0.29546586"
        },
        {
            "id": "i2ejc8u",
            "score": 1,
            "text": "Supreme Court Justice in hiding until this blows over.\n\nFilm at 11.",
            "title_similarity": "0.47687158"
        },
        {
            "id": "i2ejchk",
            "score": 1,
            "text": "Nothing will happen to them. We have all learned there is no rule of law.",
            "title_similarity": "0.2241726"
        },
        {
            "id": "i2ejmf7",
            "score": 1,
            "text": "This is my favorite part about old people using technology",
            "title_similarity": "0.26416034"
        },
        {
            "id": "i2ev53a",
            "score": 1,
            "text": "How is this legal?\n\nWhy are none of these people facing charges?\n\nHow can it be that Thomas is not forced to resign.\n\nA judge must be BEYOND REPROACH. It's a lifetime appointment! Somehow it's come about that the judges are like kings--their very power makes people deferential rather than the position causing them to defer to the status of it.\n\nIt was thought that few would be dishonest in such a position since it is governed by such powerful norms.\n\nObviously, this was a mistake.",
            "title_similarity": "0.51425874"
        },
        {
            "id": "i2ewlk9",
            "score": 1,
            "text": "All I keep seeing is how Supreme Court justice wife did this & that like as if anything is going to be done about!!!",
            "title_similarity": "0.5909265"
        },
        {
            "id": "i2exsqx",
            "score": 1,
            "text": "Treason",
            "title_similarity": "0.19390716"
        },
        {
            "id": "i2f8e7v",
            "score": 1,
            "text": "Unbelievable that’s all this world is , bunch of Lunatics",
            "title_similarity": "0.2384863"
        },
        {
            "id": "i2f8xk9",
            "score": 1,
            "text": "Sending love and prayers to Putin's lil allies that they get the adequate punishment for their crimes in court 🤗",
            "title_similarity": "0.51219445"
        },
        {
            "id": "i2fbqv4",
            "score": 1,
            "text": "Both of them is what is wrong in this country! We also need term limits in the Supreme Court!",
            "title_similarity": "0.52817535"
        },
        {
            "id": "i2fflzz",
            "score": 1,
            "text": "The statement was reflective of hypocrisy. I stand by it",
            "title_similarity": "0.26016748"
        },
        {
            "id": "i2fk84x",
            "score": 1,
            "text": "Okay, I've been on this rant for a few years now. How many of you realize that the SCOTUS has had a Republican appointed majority for the past 47 consecutive years? Since 1975 Republicans have had the upper hand on the Court! In fact, when Bill Clinton was inaugurated out of 9 Justices on the Court that day, all nine were Republican appointees, true story.Here's another tidbit about the SCOTUS, the last Democrat appointed Supreme Court Chief Justice was Fred Vinson, appointed by Truman, who served until 1953 when the Republican Eisenhower appointed Earl Warren. So the Chief Justice has been a Republican flunky since 1953, 69 years.\n\n&#x200B;\n\nNow, let's examine what this means for a moment. The SCOTUS is the be all, do all and end all for the interpretation of laws of the USA under the Constitution. If SCOTUS says it is or is not constitutional that's it, there is no appeal, that is the law, learn to love it. That fact alone makes the SCOTUS the most powerful branch of the Federal government, not the POTUS and certainly not an emasculated but still effective (especially in Mitch McConnell's grubby little hands) Congress. Congress can pass and and the POTUS can sign all the bills they want but if the SCOTUS says, \"Uh, no\" then it isn't a valid law, tough luck. And now the Justices make decision based, not on the constitution but, on their own ideology. In effect we have been hijacked by the SCOTUS and have been living in a right wing dystopia since 1975 although I use 12:00 Noon, Jan 20, 1981 as the beginning of the USA's slide into a radicalized, extreme, right wing autocracy which has only accelerated exponentially as the years have gone by. The course the USA has taken, especially since the stolen election of 2000, makes me wish I had tried harder to get into scout sniper school.",
            "title_similarity": "0.53603226"
        },
        {
            "id": "i2ft16z",
            "score": 1,
            "text": "He needs to go, but we saw what happened with Spanky's two impeachments.",
            "title_similarity": "0.49736893"
        },
        {
            "id": "i2g6ulp",
            "score": 1,
            "text": "So wrong, so many levels. Civility and morals are dead.",
            "title_similarity": "0.24636272"
        },
        {
            "id": "i2hd5va",
            "score": 1,
            "text": "How could anyone vote for a Democrat? They literally are wanting to destroy freedom, they want all the public to own nothing and keep voting Democrat. Democrats are pro big government (socialism/communism). Democrats legitimately can’t even tell you what separates a woman from a man. A democrat will tell you Biden is the most popular president in US history with a straight face. A democrat will have your 4 year old child questioning their own sexual orientation. A democrat will use/manipulate race to cause a divide and gain more control. A democrat is a war monger, they make a lot of money off of wars. There are plenty of RINOs like the Bush family and Cheney family, even Lindsey Graham. They all profit off of war with investments in defense contracting etc… this isn’t about rep vs dem. It’s good vs evil. Common sense vs no sense. Facts vs feelings. Democrats want to abolish the police force, while simultaneously having police escort them around. Democrats want pedophilia to be legal. Democrats would rather give you free syringes for your addiction rather than get you rehabilitation. Democrats still have Americans stranded in Afghanistan after one of the largest extraction failures I have ever seen in my life. Democrats nominate biological males as women of the year time and time again. I think a lot of ppl in this chat are either children, or mad at the world about something, bc most of you seem like you live your entire life through a screen and have ZERO sense of reality. And if Biden really was the most popular president in US history, then it really shows how naive and gullible the democratic voter is to vote in a known Dixiecrat dem, a known pedophile (read Biden’s daughters diary, absolutely astonishing what he did to her), and above all the democratic voter voted for a DEMENTIA patient. They voted for a guy who literally can’t even read a teleprompter that his communist handlers write for him. Hell if you loved communism and being governed hard, why not just move to North Korea or China or Russia? Why stay in America and vote to ruin my freedoms?",
            "title_similarity": "0.6485179"
        },
        {
            "id": "i2hs5iq",
            "score": 1,
            "text": "I’m torn. If the man is guilty of nothing more than having a crazy wife he shouldn’t be punished.  But if she was a proxy for him selling his vote to the fascists trying to end democracy in America because they can’t accept losing then he needs to be removed immediately.\n\nAny proof of which one of the above options is true?",
            "title_similarity": "0.6709289"
        },
        {
            "id": "i2lq0iy",
            "score": 1,
            "text": "Trump also said...\n\nThe capital will be wild and referred to it as Armageddon.\n\nGoing down with 2 Tweets?\n\n[https://www.nytimes.com/2022/03/29/us/politics/trump-tweet-jan-6.html?00&auth=login-facebook](https://www.nytimes.com/2022/03/29/us/politics/trump-tweet-jan-6.html?00&auth=login-facebook)",
            "title_similarity": "0.6803378"
        },
        {
            "id": "i2o3tiu",
            "score": 1,
            "text": "Never have “the right” been so wrong. Thomas has been a public nuisance since the Anita Hill testimony. Now his wife joins him in becoming traitors to America.",
            "title_similarity": "0.60345113"
        },
        {
            "id": "i2qxctk",
            "score": 1,
            "text": "It was the wife, not him. If we’re gonna play the spouse game now then there is a lot of stuff out there that needs attention to.",
            "title_similarity": "0.49334943"
        },
        {
            "id": "i2vofk2",
            "score": 1,
            "text": "Clarence Thomas needs to be removed due to incompetence as well being influenced by a criminal and psychologically disturbed people: his wife and her friends.",
            "title_similarity": "0.48954198"
        },
        {
            "id": "i39a9an",
            "score": 1,
            "text": " Republicans :Tax cuts this is what happens when Reagan Started the trickle down economic. 1% are so rich ,citizens United Supreme Court decision making legal buy politicians. CLARENCE THOMMAS SHOULD STEP DOWN IMMEDIATELY",
            "title_similarity": "0.64907527"
        },
        {
            "id": "i3zicp9",
            "score": 1,
            "text": "I hate to say it, but I'm glad not everybody mindlessly does what the party says.  That's actually part of why the Dems are better, they're not zealots.\n\nThat said if the Dems don't take it in the midterms we're screwed.",
            "title_similarity": "0.47955188"
        }
    ]
}