{
    "ELI5: How does the body decide where to add or take away fat when gaining/losing weight?\n": [
        {
            "id": "gv3pt5q",
            "score": 0,
            "text": "It doesn't.  You simply burn fat for use as energy. Your body simply grabs it from anywhere.   \nLets say your body seems to use arm fat first, once it's gone, then you might notice the fat on the back of your legs getting smaller. Then your belly, then your kidney area.",
            "title_similarity": "0.6508862"
        },
        {
            "id": "gv58a1t",
            "score": 0,
            "text": "It’s an evolutionary advantage for Males to store fat on the front of their abdomen, shielding their vital organs in a fight situation. \n\nFor Females, it would also seem logical in terms of evolutionary advantage for them to store fat in locations that made them more attractive to Males as these genes would then be more likely to be passed on through reproduction. \n\nMost things in evolutionary biology seem sexist in modern society, (Males fight, Females have babies). But humans didn’t evolve in a modern society.",
            "title_similarity": "0.5361837"
        },
        {
            "id": "gv42cfo",
            "score": -2,
            "text": "Insulin response, when you eat, you store as energy. The longer you go without eating the more time your body has been in energy spending mode instead of energy storing mode. Jason Fung/ Ben Bikman on youtube explain more in depth the effect of insulin on weight loss and overall health.",
            "title_similarity": "0.71635866"
        },
        {
            "id": "gv3t1fv",
            "score": 1,
            "text": "In short:\n\nWe do not truly know. We can notice trends, but whomever could crack the secret of selective fat depletion will NEVER have to work another day in their life again.",
            "title_similarity": "0.49334309"
        },
        {
            "id": "gv34qgw",
            "score": 103,
            "text": "Something that is not already discussed, the body temperature raises and burns both fat AND muscle. Different types of diets and exercise also burn calories differently.\n\nFor instance, High Intensity Interval Training works the heart extremely well, and more fat is burned than muscle. Extreme long distance cardio, by the end, can burn near equal amounts of muscle and fat. Any exercise (and I do mean any, as long as it's not a smartass response) is good for visceral fat control, which is the biggest indicator for long term health issues, when it comes to fat that is. The problem is, it requires tests (blood draws) to determine where an individual is.\n\nDiets, well those are very tricky. The field of study is fraught with profit engineering, name recognition, and questionable statistical conclusions. Almost every study is countered with another, and all have the potential of being correct or incorrect. In the end, regularly see your doctor about your health.\n\nEdit: correction from subcutaneous to visceral. I mixed them up.",
            "title_similarity": "0.56108916"
        },
        {
            "id": "gv3w0rb",
            "score": -3,
            "text": "You simply identify as someone with fat where you want it. The rules of biology take no part in it.",
            "title_similarity": "0.3898181"
        },
        {
            "id": "gv3fqnp",
            "score": 5,
            "text": "I'm learning it's about how your hormones/glands tell your body what and where to store \"fat' or excess (i.e. leftover material) from cellular processes. Not all extra weight or bulges can be considered fat - some is water or muscle (even though it doesn't feel like it). Food energy that is not considered by the stomach as waste and sent to bowels asks body what to do with that cellular level energy. Most food instructional processing begins with the liver and from there depending on the organ in need, or the gland that is triggered, it produces hormonal responce with instructions on what to do with broken down food at cellular level. Think of fat as the body's way of protecting vital organs or unhealthy organs - they need a layer of fat around them for self preservation. The body is INCREDIBLE at self preservation, and automatically does what it can to survive. So if organs are signaling the body they have signs of damage or need (this can be a false need created by what we eat) - then the brain tells hormone producing glands to send instructions too food processing organs/glands on how to process that food energy and take what it needs from it, where it needs it and then (depending on the hormone/gland) where to store the reserve for accessing later. \n\nYou may think I don't have organs in my hips or butt. Your right! Their are several body shape types and each is caused by a different hormonal(s) issue. Hormonal imbalance, pituitary, adrenal, thyroid, ect have sent bad info to the glands, pancreas, gallbladder, liver, ect and they act on it deciding to store fat in predetermined places for later use. I'm not a doctor (but I play one on TV)... this is just a high level overview of how the body handles processed food. I've been reading several books on the topic lately because having survived covid I want to get myself in better shape. All diets and workouts in past have failed so I'm learning how my body WORKS and understanding how it processes food. Right now I'm on my fourth medical book, currently reading 'The 7 Principles of Fat Burning' by Dr. Eric Berg. IMO if I don't find the root cause of why my body is doing what it does with the food I eat then anything else is a temporary fix for a symptom which is creating and storing fat.\n\nI've learned step one is to repair the liver and bring it back up to best operating efficiency first, doing this thru specific diet and other methods. Second is bringing my hormones back into balance so they don't incorrectly instruct me to create to much adrenaline, or too little growth hormone, or bad instructions about creating insulin, ect.  If part of body is not healthy FIRST messing around with what I'm eating isn't solving anything. Hope this helps someone.",
            "title_similarity": "0.6828073"
        },
        {
            "id": "gv6b5wc",
            "score": 0,
            "text": "\"Shove it there, be reet!\"\n\n\"There it is lads, get it!\"\n\nThat's pretty much close enough. There will be better answers here, but really, that's what it amounts to. Spot reduction is a myth, if that's what you're asking.",
            "title_similarity": "0.3875579"
        },
        {
            "id": "gv3dl3e",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20336355"
        },
        {
            "id": "gv3enyn",
            "score": 1,
            "text": "Look up the Ted talk by Amy Cuddy. \n\nExplains a bit about it in that, and it's a very interesting talk!",
            "title_similarity": "0.2966655"
        },
        {
            "id": "gv3i9rk",
            "score": 1,
            "text": "Interesting.  I used to be gain and lose in my breasts and hips first. Now I'm older and I've been yoyoing like a mofo these past few months, I've found the weight came off my hips to I dunno where, I just know it's there.",
            "title_similarity": "0.5832975"
        },
        {
            "id": "gv49wmz",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20336355"
        },
        {
            "id": "gv4bkum",
            "score": 1,
            "text": "Physics. The best place to put the fat is the center of gravity as it takes the least amount of energy to move the body if the fat is put there. So, that is the center of your body. If the body put fat at the ends, every leg lift would be a massive waste of energy.",
            "title_similarity": "0.49282414"
        },
        {
            "id": "gv5nbc8",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.20336355"
        },
        {
            "id": "gv38a0x",
            "score": -15,
            "text": "It doesn't. Some areas are harder to exercise than others, so they tend to be the spots where stubborn collections of fat accumulate. Thats always been my understanding. I find it really \"easy\" to make my waist shrink from front to back, but the sides are a pain in the arse to shift fat out of. Why? Because its easier to get your front gut muscles activated than it is to get your obliques going.",
            "title_similarity": "0.53628343"
        },
        {
            "id": "gv33i2i",
            "score": 45,
            "text": "You have a set number of fat cells in your body. Depending on your genetics there may be more or less of them in certain parts of your body. If you gain more body fat, you're not gaining cells, they're just getting bigger. The same with losing body fat, those cells get smaller. They more or less all grow and shrink at the same rate.",
            "title_similarity": "0.6925411"
        },
        {
            "id": "gv3fquf",
            "score": -18,
            "text": "God decides where the fat is taken from ultimately. If you want to change things around some you can try praying to god and watching plenty of fox news. if that doesn’t work try making a donation to trump or storming the capital building. that should make god happy enough to make the fat just fly off :)",
            "title_similarity": "0.42609435"
        },
        {
            "id": "gv35vne",
            "score": 93,
            "text": "Your hormones, estrogen and testosterone levels will dictate where your body decides to store and therefore burn fat first. Which is why food quality is important not just macro nutrients. Poor quality foods and lack of sleep tend to have a negative effect on hormone balance. Among other environmental factors.",
            "title_similarity": "0.6022595"
        },
        {
            "id": "gv3bq1h",
            "score": -2,
            "text": "We evolved as hunters and gatherers. Our main tool for defense is flight. In order to have flight we must have legs that are in healthy condition.\n\nTherefore our body is naturally evolved to store fat towards our center of gravity. It is like a fanny pack of energy that we carry. The body knows it would be stupid to carry the fat too high or too low on the body.",
            "title_similarity": "0.49623758"
        },
        {
            "id": "gv46ice",
            "score": 2,
            "text": "You have different concentrations of certain receptors in different parts of your body. When a particular receptor turns on, it can pull fat out of the fat cell and when the blood flows through that area, it takes the fat along with it. \n\nThis is why you may lose fat quicker in your face than in your midsection. This is also why different people carry fat in different places in their body -- different concentrations of receptors and a difference in blood flow.\n\nhere's a study that touches on these principles\n\nhttps://www.nature.com/articles/0803499",
            "title_similarity": "0.70172197"
        },
        {
            "id": "gv3a2ae",
            "score": 36,
            "text": "It's like letting air out of a balloon. But, not every balloon has the same shape. Some parts deflate faster than others and it depends on the particular balloons shape.",
            "title_similarity": "0.35534036"
        },
        {
            "id": "gv39hph",
            "score": 14,
            "text": "Which places depends on physiology and genetics. You don't have much control over that. How much depends on exercise. Basically proportional to muscle mass and endurance capacity. For synergistic results, you need to do both: strength training + cardio.\n\nMarathoners will have very low body fat because they've trained their bodies to use fat efficiently as a source of nutrition during exercise. Vigorous exercise can also stimulate body to deposit excess energy in muscle glycogen as opposed to fat. This is why if you're in great shape, it's easier to stay in shape; you've already altered your metabolic profile to something kind of favorable. You can usually reshape your metabolism, if it is out of whack, but this requires *work*. A mile run a few times a week or arm curls aren't going to cut it. Unless you're basically 20.\n\nYou don't have to run marathons or kill yourself at the gym to have low body fat (reshape your metabolism). Combining strength and cardio training about 1 hour every other day will lead to substantial fat burning. Make sure to target all large muscle groups for the most benefits. If you want the benefits but don't want to spend much time, you can do high-intensity interval training instead. Those workouts tend to be 30 minutes or less. However, they are much more challenging and more people would probably prefer the longer workouts, I think.\n\nEDIT: Since most people in this thread don't seem to know much about exercise, and since it is getting to be that time of year again, I just want to throw out there -- if you're out of shape and looking to start getting in shape -- especially with the warmer weather -- I highly recommend you DO NOT start by running. Running has probably one of the highest injury rates in sports -- about 33 to 75% of people are injured annually. If you're large (fat or tall) your risk is higher. If you have history of running or you are small in size -- by all means go ahead. It's just I see a lot of people try to get started by throwing on old jogging shoes and sweat pants and plodding through the neighborhood. God bless em for trying. But honestly, even though it's popular I think it's a pretty poor place to start if you're not already kind of light and used to the impact.",
            "title_similarity": "0.654744"
        },
        {
            "id": "gv35hiw",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "0.20336355"
        },
        {
            "id": "gv3xtsx",
            "score": 5,
            "text": "It's a complicated question with a complicated answer that varies as much as your genes do. The simple answer is hormones! Hormones are chemicals in your body that tell your body what to do. There are lots and lots of hormones that all have different functions that interact with each other, you can learn more at yourhormones.info\n\n \nThat said, while hormones tell your body what to do, they don't really decide where anything goes. Your genes sorta do? Your genes kinda write the code that your hormones function on, and sometimes that code gets a little twisted up. There can be mutations and disorders that make your hormones behave in odd ways, some of which might be really subtle, so subtle that no one notices unless they get their genes sequenced.\n\nGenerally speaking, you can't pick and choose where your body stores fat, you can't work out your mid section to burn belly fat, for example. You can't get a six pack from doing a lot of abdomenal exercises. Without surgery you can't have a six pack while also maintaining the fat in your ass. It's a lot like ocean water levels, like it rises together everywhere, not just in specific places. It just seems like you flood in certain places only because some places are lower-lying than others. Some areas of your body are meant to have more fat in it than other places, and this can also be genetic thing\n\nCis women and in general people with higher estrogen levels have a higher body fat percentage that is about double the norm for cis men. Subcutaneous body fat plays an important roll in hormone regulation, especially estrogen. \n\nThere are a number of conditions that affect how your body places and metabolizes excess fat, often these involve hormones and have a genetic component. Lipedema is a condition that a lot of people don't know about but it's actually pretty common, it mainly affects women. Fat stores in the lower half of your body and you literally can't lose it, and it can be quite painful and get worse with time.",
            "title_similarity": "0.47952923"
        },
        {
            "id": "gv2zqiw",
            "score": 479,
            "text": "It is mostly genetic and changes with body types. You can't burn fat from spesific places either. You can't burn only tummy fat for example. You can however add some muscle mass for a neater look.",
            "title_similarity": "0.53305626"
        },
        {
            "id": "gv5lmn8",
            "score": 10,
            "text": "The ELI5 answer is - it doesn't. It's like trying to empty a lake with a bucket. You don't leave a bucket shaped hole in the water; the surrounding water is redistributed to fill in the space made by removing the water.",
            "title_similarity": "0.39821577"
        },
        {
            "id": "gv38dqr",
            "score": 116,
            "text": "While most of the responses itt are accurate as far as our current medical understanding is concerned, [biochemists are making a lot of progress in understanding the signaling pathways that regulate lipolysis,](https://www.sciencedirect.com/science/article/pii/S0898656805002299?casa_token=ZqRp4CXYg60AAAAA:2R9YWODZL8kRdRokKCLsaO4PxojQBIeiANKMVaVXp05pcLOOcmDDw9HDtEidaeFrGc1IxMYnf3bV) and several proteins have been identified that are associated with fat burning. [There was an investigational peptide that appeared in a paper a few years ago](https://en.wikipedia.org/wiki/Prohibitin-targeting_peptide_1) but very little follow-up was done and the project was abandoned. You can find fraudulent knockoffs of the drug on sketchy dieting aid sites.",
            "title_similarity": "0.35425913"
        },
        {
            "id": "gv2ntw6",
            "score": 8903,
            "text": "It doesn't 'decide' per-se. Fat is distributed in a rough order that varies with your sex. Males for example are more likely to store fat in their upper-body and abdomen (hence the Beer Belly phenomenon) whereas Females are more prone to store it around their hips and thighs. This is what largely contributes to the 'pear' shape we associate with women.\n\nMales are also more likely to store 'visceral' (around the organs) fat which is what results in the skinny-fat phenomenon where people can be overweight, but not look it. Females are more likely to store fat subcutaneously (under the skin) where it's more noticeable. This combined with our bodies preference for storing fat in certain places is what contributes to the difference of appearance as a result of our weight.\n\nPlaces like your face, neck and arms are lower down the list. Which is why when someone gains/loses a lot of weight this is where you notice it. It's one of the last places for fat to get stored, but when you start losing weight that means it's one of the first places to go.\n\nWhen you lose weight, it comes off in the reverse order that it went on. So if you've noticed that you've recently started accumulating mass in a certain place, then with improved diet and exercise that is the exact place it'll start coming off first.\n\nEdit: The order I've given is more of a broad trend rather than something you can usefully apply to individuals, various generic and environmental factors will affect the order from person-to-person. Your personal order may be different, but regardless of the order it's a last-on/first-off system.\n\nEdit2: There's some back and forth in medical journals about whether there is *any* consistency to the order or if it's purely an individual/genetic thing. I'm not qualified to really judge that and deep dive into them so please take that particular claim with a few pinches of salt. But while the notion of a consistent order seems contentious, there is nevertheless an order for you.\n\nTL;DR - Fat goes on in a particular order on different parts of your body that varies between people, and it comes off in the reverse order that it went on. Areas like our belly/hips are often the first place it goes on (but not for everyone!), so it's the last place it comes off and you have to do everything else first.",
            "title_similarity": "0.5750028"
        },
        {
            "id": "gv3dm7y",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20336355"
        },
        {
            "id": "gv3fq2f",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.20336355"
        },
        {
            "id": "gv45hjx",
            "score": 1,
            "text": "It doesn't decide but if this info helps (there are very few non ultraprocessed foods that are genuinely bad for you in regards of losing weight rather the diet you should maintain is in large determined by the life style you live if your a desk jockey a diet of high fat and veggies is recommended if your a body builder you probably wanna focus on eating stuff that's high in carbs",
            "title_similarity": "0.61700046"
        },
        {
            "id": "gv49gnh",
            "score": 1,
            "text": "when i lose weight most of the weight is lost from my upper body. i don't really know if this is a good sign but it gives me abs",
            "title_similarity": "0.6891014"
        },
        {
            "id": "gv4w2kl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20336355"
        },
        {
            "id": "gv4x4dn",
            "score": 1,
            "text": "The short answer is hormones. Different hormones have different roles in the body, fat protects parts of the body that your pituitary gland deems necessary. So if you have a lot of estrogen, your body is more suited for child bearing, you store fat on your beasts and abdomen. Of you have more progesterone, you are more suited for post natal care, you carry fat on your hips, if you have more testosterone you carry fat around your upper body to protect in fights.\n\nWe are really just monkeys with iPhones.",
            "title_similarity": "0.6049599"
        },
        {
            "id": "gv50k5a",
            "score": 2,
            "text": "It doesn't. There's no such thing as spot-reduction despite the fact that it's been implied to exist ever since advertising ways to do it became a thing about 80 years ago.",
            "title_similarity": "0.2854399"
        },
        {
            "id": "gv54oxd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20336355"
        },
        {
            "id": "gv5jr3m",
            "score": 2,
            "text": "To my understanding, in a broad term, when you try to go on a diet/gaining weight, you change your calorine intake level. The excess calorines turn into fat as a way to \"store energy\". This kind of energy is not really efficient because it can store for a really long time but can't burn that fast, that's why it's easier to gain weight than to lose it. Beside this, it's vary between people to people, something like metabolism also affect.",
            "title_similarity": "0.7374949"
        },
        {
            "id": "gv6g5t7",
            "score": 2,
            "text": "Side note: if you have your subcutaneous fat liposuctioned out, gaining weight afterwards becomes potentially very dangerous (depending on how much you had taken away) as it goes on your visceral fat stores around your organs, and can lead to heart failure and diabetes.",
            "title_similarity": "0.6909441"
        },
        {
            "id": "gv6yf1u",
            "score": 1,
            "text": "Also, WHEN does it decide to store fat? I've got some noggin I'm tryinna convince it's not alright to keep me at 50kg at 1.73m...",
            "title_similarity": "0.64882445"
        },
        {
            "id": "gvathw7",
            "score": 1,
            "text": "Think of your body like wringing a towel. When you start exercising, the exterminates - Hands and legs are where you will start losing weight first. It is also the last place where you will put on weight. As you continue to exercise, you will start moving towards the centre of your body - thighs, hips, waist, belly.\n\nIf you are seeking to lose weight start by strengthening your hands and legs, you would not be able to work the core unless your hands and legs are strong.",
            "title_similarity": "0.6748548"
        }
    ]
}