{
    "ELI5: Why is the loudest sound ever reported is considered to be the Krakatoa volcanic eruption, at 180 dB and could be directly heard 5,000km away but rocket launches regularly hits 200+ dB but are only heard within the vicinity of the ignition?\n": [
        {
            "id": "gws5m1k",
            "score": -9,
            "text": "Krakatoa is estimated to be over 300 db.\n\nA barometric recorder in Jakarta about 100 miles away recorded a decibel level of 172, so I suspect the author of whatever article you read got confused about what was recorded vs how loud it was at its source.",
            "title_similarity": "0.73561245"
        },
        {
            "id": "gwufnkj",
            "score": 0,
            "text": "I live near an AFB on the CA West coast that regularly launches rockets and missiles. We can't hear them during the day, but can at night. We hear and feel a deep bass rumble that shakes the house/earth.\n\nHave never known why this phenomenon happens.",
            "title_similarity": "0.72782236"
        },
        {
            "id": "gwusble",
            "score": 0,
            "text": "Up in the sky no gravity TF sound heavy it float if in way up volcano gurgle internal muffle not gone travel far TF",
            "title_similarity": "0.59652555"
        },
        {
            "id": "gwutz2b",
            "score": 1,
            "text": "It’s wasn’t a Rusko show?",
            "title_similarity": "0.08702694"
        },
        {
            "id": "gwtrm26",
            "score": 22,
            "text": "According to Wikipedia:\n\nThe loudness of the blast heard 160 km (100 mi) from the volcano has been calculated to have been 180 dB. \n\nThe pressure wave generated by the colossal third explosion radiated out from Krakatoa at 1,086 km/h (675 mph). The eruption is estimated to have reached 310 dB, loud enough to be heard 5,000 kilometers (3,100 mi) away.\n\nSo that pretty much explains it. The 180 dB figure refers to a measurement 160 km (100 miles) away, but up close at it's peak, it'll have been 310 dB.",
            "title_similarity": "0.86372757"
        },
        {
            "id": "gwtw8fw",
            "score": 9,
            "text": "What about the under water bloop?",
            "title_similarity": "0.11948128"
        },
        {
            "id": "gwu17u4",
            "score": 0,
            "text": "Sound (really just vibrations) produced directly in the ground will travel more readily through the ground than sounds produced outside the ground. Outside sounds have to transfer between the other material and the ground, and there will be reflected energy there. Make sound with a waterproof watch or whatever, while it and your head are both underwater. Now make the same sound with your head in the water and the noisemaker outside, or vice versa. Either of the last two will be much harder to hear than both head and noise in the same material.",
            "title_similarity": "0.4201014"
        },
        {
            "id": "gwtzl6f",
            "score": 6,
            "text": "rockets go up to 170db but notnreally more iirc.Remember that décibel are logarithmic, so even a few db difference can be hundres or thousands more \"powerful\"",
            "title_similarity": "0.75948787"
        },
        {
            "id": "gwu2bje",
            "score": 6,
            "text": "Decibels are logarithmic, meaning every 10 db increase translates into roughly ten times more intensity, and sounds approximately twice as loud to the human ear, which also perceives sound logarithmically.",
            "title_similarity": "0.5860269"
        },
        {
            "id": "gwui8dy",
            "score": 4,
            "text": "Rocket launch platforms spray huge amounts of water just before and during the blast to absorb the sound, otherwise the shock waves of sound generated would destroy the engines.",
            "title_similarity": "0.6654558"
        },
        {
            "id": "gwuib1y",
            "score": 18,
            "text": "Decibels are a measure of sound at a specific distance. A so bd measured an inch or two from the source will have a much higher dB than the same thing measured a longer distance away. \n\nThe pressure and frequency of a sound can cause it to travel farther and lose less volume over a distance. So some sounds can travel really far and some sounds can be very loud but not necessarily travel that far. \n\nKrakatoa had a lot of force behind it, so it was able to travel very far. At its source, it would have been much louder than those engines.",
            "title_similarity": "0.5966882"
        },
        {
            "id": "gwucvmo",
            "score": 8,
            "text": "Imagine a fire cracker in your hand. You light it.  What happens?  You burn your hand. Now light that same fire cracker and close your fist.  What happens?  Your wife will be opening all your ketchup bottles after. \n\nThe rocket is on the surface.  The volcanic eruption is coming from inside the earth.",
            "title_similarity": "0.5821268"
        },
        {
            "id": "gwudeh3",
            "score": 7,
            "text": "Sperm whales can produce 230db, except this sound amplitude  can't exist in air, still pretty damp loud, they think they catch their prey by using auditory shock, a gunshot signal",
            "title_similarity": "0.6690253"
        },
        {
            "id": "gwuwadz",
            "score": 8,
            "text": "The crack of a whip is pretty loud and fast enough to break the sound barrier but the overall energy is pretty tiny. Compare that to something the size of an exploding mountain and you can get a sense why a loud-as-shit rocket is still comparatively puny.",
            "title_similarity": "0.6666801"
        },
        {
            "id": "gwu440a",
            "score": 63,
            "text": "[removed]",
            "title_similarity": "-0.022680994"
        },
        {
            "id": "gws5hwm",
            "score": 299,
            "text": "It does not make sense to measure sound like this. That is why you get these strange numbers. The atmosphere is not able to support sounds of over about 180 dB because at that point you start creating complete vacuum. This is why lound noises like rocket launches sounds like they are recorded on a broken microphone, it is not the microphone that is broken but the air itself. So these numbers you are quoting can not possibly be recorded accuratly or even calucated after the fact because they just did not happen like that. So when comparing lound noises like volcano eruptions and rocket launches you have to take into account how large of a volume they can create that sound in. So you calculate a total energy output instead of a dB number. And the bigger the explosion, the more energy in it, the louder the sound will be at a fixed distance where the sound can actually be measured and make sense.",
            "title_similarity": "0.6539871"
        },
        {
            "id": "gwubvgi",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "-0.022680994"
        },
        {
            "id": "gwuqxuj",
            "score": 34,
            "text": "All of the top level answers I scrolled through here are missing the mark, even the ones pointing out that your rocket launch number is probably too large. \n\nLet's say that you're playing sound from a 1W speaker, that is, 1W of power is being transferred into some amount of air, from which it spreads out as it travels.  But now lets imagine that we want to use 2W.  There are two ways to do it!  We can either vibrate the same amount of air twice as much, _or_ we can vibrate twice as much air the same amount!\n\nThe power output of a volcano is _vastly_ larger than the power output of a rocket... kinda like a rocket is vastly more power than hopping up a curb.  The trick is, the volcano is also much larger (many square kilometers of surface, as opposed to a couple of square meters of engine nozzle surface), so its enormous power is spread out enough (and the logrithmic nature of deciBels is counterintuitive enough) that the number doesn't really capture what's going on.  \n\nWhen you take a reading of sound pressure levels, you only take the reading at a single point, and that tells you nothing about what the total output power was.",
            "title_similarity": "0.7190798"
        },
        {
            "id": "gws46vo",
            "score": 907,
            "text": "Where did you get the 200dB? Google says they are 150dB when you're near. (And 200dB 100,000 times louder than 150dB)",
            "title_similarity": "0.6223132"
        },
        {
            "id": "gws4o17",
            "score": 23220,
            "text": "200+ db doesn't really exist. At 194 db, the sound is so loud that it's creating vacuums between the sound waves. Any louder, and it isn't really a sound wave anymore, just a shock wave. Rocket launches can reach 165 db, but that's still fifteen decibels lower than Krakatoa.\n\nAs to why Krakatoa was heard so far away, volcanoes are geological activity: the earth itself was producing the sound and helping it travel. Think of it like a phone on vibrate. If it vibrates in your hand, you can only hear it a few feet away. However, if you place the same phone on a table, you can clearly hear it from across the room. In the same way, a rocket engine suspended above the ground will not be heard from as far away as a volcano erupting within the earth.\n\nEdit: [Better explanation](https://www.reddit.com/r/askscience/comments/2huwbq/why_is_the_loudest_sound_possible_194_db/?utm_medium=android_app&utm_source=share)",
            "title_similarity": "0.81230557"
        },
        {
            "id": "gwtz718",
            "score": 162,
            "text": "[removed]",
            "title_similarity": "-0.022680994"
        },
        {
            "id": "gwuf70g",
            "score": 7,
            "text": "nobody seems to have mentioned that the rocket launch facilities actually have sound reduction systems built in the facilities to reduce the shock waves generated by the launch\n\nhttps://en.wikipedia.org/wiki/Sound_suppression_system",
            "title_similarity": "0.58631337"
        },
        {
            "id": "gwui7lv",
            "score": 7,
            "text": "Familiar with Newton's cradle? Those balls on strings hitting each other back and forth? Think of sound as kinetic energy. A molecule moves and hits another one, that then moves and hits another one etc...until one arrives in your ear and transfers that energy to your eardrum. The more distance there is between these molecules, the more energy is lost between each point in the chain. This bleeds away energy and reduce sound as it travels. No molecules, as in space? Sound can't travel. Air on the ground, sound can travel but energy is lost pretty fast due to air being thin and molecules spaced further apart. Under water, much closer together so less energy is lost and it can travel further. Same applies to the rock that the Earth itself largely consists of and that's why earthquakes can be picked up by seismometers far away. \nThey're really just listening devices detecting those vibrations of molecules hitting the next one in the chain.",
            "title_similarity": "0.56898856"
        },
        {
            "id": "gwujdsk",
            "score": 2,
            "text": "Were people actually monitoring its db output in 1883?  Or is 180db just a best guesstimate?",
            "title_similarity": "0.42274547"
        },
        {
            "id": "gwuky47",
            "score": 15,
            "text": "In addition to intensity there is frequency of noise.  The tone or pitch, if you will.  Very low pitched sounds travel much farther than high pitched sounds, regardless of decibel level.  A rumbling caldera probably had some very low pitched sounds that travelled some extreme distances.  I also find it dubious that the volcano was ONLY 180 db.  Sound follows the inverse square law, so I’m curious what the sound at the source of eruption would have been.",
            "title_similarity": "0.7172754"
        },
        {
            "id": "gwv97mo",
            "score": 2,
            "text": "ELI7 (here is how I would explain it to my daughter):  Decibel is a measure of how loud something can be.  In order to make something really loud you have to you need lots of energy.  Like if you clap your hands together is it going to be louder if you clap it hard or soft? Fast or slow? A rocket ship can’t possibly be louder than a volcano exploding because the volcano is bigger and “clapping” much harder.",
            "title_similarity": "0.70787954"
        },
        {
            "id": "gwvn4s7",
            "score": 1,
            "text": "I believe it partly has to do with the fact that, in the example of Krakatoa, a lot of the sound was travelling through the ground, which is (more or less) solid. Soundwaves (which are just vibrations) travel much farther through a solid than through a gas (like air), since the particles in solids are closer together. It's the same principle at work when you, for example, tap the pad of your finger on a table; although you normally can't hear it, if you put your ear to the table, you can hear the vibrations travel through it rather loudly.",
            "title_similarity": "0.5156132"
        },
        {
            "id": "gwvnm3h",
            "score": 1,
            "text": "pretty sure alot of it has to do with the pitch. Higher sound dont travel as far. thats also why female voices are used for shit like siri and stuff.",
            "title_similarity": "0.3849612"
        },
        {
            "id": "gwvo5rm",
            "score": 1,
            "text": "Am not scientist, but maybe Krakatoa was 180 db 5000km away and rocket launches are 200db 1 km away relates to the amount of energy released.  Check out this video of the sonic blast from a volcano in that region: [https://www.youtube.com/watch?v=BUREX8aFbMs](https://www.youtube.com/watch?v=BUREX8aFbMs)  i think ive seen a better one... but thats so much energy",
            "title_similarity": "0.84080046"
        },
        {
            "id": "gwvp0yz",
            "score": 1,
            "text": "I can't explain why Krakatoa was heard so well.  But the explosion of Krakatoa also rang the planet's core like a bell.",
            "title_similarity": "0.7194301"
        },
        {
            "id": "gwvpkg4",
            "score": 1,
            "text": "Think of the volcano as your upstairs neighbour (who's footsteps resonate mostly through the skeleton of the house) and the rocket launch as her voice screaming (who' voice mostly travels through air). Contact sound travels farther when they are low frequencies.",
            "title_similarity": "0.618563"
        },
        {
            "id": "gwvrsx4",
            "score": 1,
            "text": "Also keep in mind...that 10 dB difference doesnt sound much...but its TEN TIMES louder...so 180 is ten times as loud as 170...and 170 is insanely loud...everything over 120 is harmful for your ears...so think about that...",
            "title_similarity": "0.5676853"
        },
        {
            "id": "gwvv2mu",
            "score": 2,
            "text": "Low frequency sound travels farther.  Also, the source of the sound was 100,000 times larger.\n\nAnalogy: A single speaker can output 100 dB.  100,000 speakers can also output 100 dB, each.\n\nIf you were a mile away from the speakers, which could you hear better?",
            "title_similarity": "0.6314922"
        },
        {
            "id": "gwvvgkw",
            "score": 3,
            "text": "Why is it that people do not read other posts in a thread before adding their almost identical one?",
            "title_similarity": "0.22614403"
        },
        {
            "id": "gwvw1nv",
            "score": 1,
            "text": "TIL that Krakatoa is a real volcano, and not just a quirky catchphrase of Captain Magma in the International Justice League of Super Acquaintances.",
            "title_similarity": "0.6548604"
        },
        {
            "id": "gwvwta6",
            "score": 1,
            "text": "What about the size of the thing making and propagating the sound? Several square miles of pure explosion to 750 (or whatever) square feet from a rocket. 2 vastly different speaker systems.",
            "title_similarity": "0.74478984"
        },
        {
            "id": "gwvxhb7",
            "score": 2,
            "text": "Important thing when talking about decibels is that a change of 10 decibels means the sound is TWICE as loud. 20db is twice as loud as 10, but also 190 is twice as loud as 180. So if the rockets were 180db then volcano with the theoretical 200db would be 4 times as loud and not 10/9 (200/180=20/18=10/9) as loud!",
            "title_similarity": "0.8180646"
        },
        {
            "id": "gww452g",
            "score": 2,
            "text": "Because of energy. The rocket outputs only a small amount of energy compared to the volcano so its energy wave will travel a shorter distance. \n\nThe volcano outputs an enourmous amount of energy so its energy wave can  travel around the globe many times.The volcano is producing 180 decibels of sound at a specific point but the energy wave making that sound has an enormous reach.",
            "title_similarity": "0.7419297"
        },
        {
            "id": "gww9wh4",
            "score": 1,
            "text": "Is it true that the sound killed the people nearby?",
            "title_similarity": "0.32060373"
        },
        {
            "id": "gwwbeiv",
            "score": 1,
            "text": "What about the pistol shrimp? Does that count?",
            "title_similarity": "0.325766"
        },
        {
            "id": "gwyoq7k",
            "score": 1,
            "text": "Theres a lot of confusion in the answers and none really answer your question. In short, the number you list for Krakatoa is not correct, and it was far, far louder than you can imagine. This is more of an ELI15 so bear with me for a minute.\n\nSound waves are compression waves, they propagate by compressing and expanding the medium (material) they move through. In air, each wave has a zone of high and low pressure. Decibels measure the amplitude of a sound wave, that is the pressure difference between the high and low pressure zones. At 194 dB, the amplitude of the sound wave is roughly equal to atmospheric pressure (~101kPa). This means the low pressure zone creates a vacuum where absolute pressure is ~0 kPa. This changes the behavior of the sound wave, and it becomes a shockwave.\n\n*Sound waves* do not exist above 194 dB because their behavior changes. *Shockwaves* exist above 194 dB and create a sound that can be heard (similar to a sonic boom), but are not sound waves. Decibels are a measure of how strong a sound/shock wave is by measuring the change in pressure of the wave.\n\nAll of the loudest sounds in history are estimated to be well over the 194 dB threshold, so we want to look at the strength of the shockwaves to determine the loudest.\n\nThe measurement from Krakatoa of 180 dB was taken about 100 miles away from the volcano, it was calculated from an observed pressure change recorded on multiple barometers. You are trying to compare it to the sound of a rocket launch at ~210 dB measured at the source. To have a good comparison, we need to know how loud Krakatoa was at the site of the eruption. The best we can do is estimate how loud the shockwave needed to be in order to cause the effects reported at the distances they occurred at.\n\nBased on the known effects of Krakatoa, the shockwave is estimated to have been around 310 dB at the site of the eruption. Compared to our 210 dB rocket launch shockwave, the Krakatoa eruption shockwave was a staggering 10,000,000,000x more powerful (yes, ten billion times) and produced a sound 1,024x louder than the rocket launch. This estimate of a 310 dB shockwave is why Krakatoa is considered one of the loudest sounds in history. Rocket launches are seriously loud, but they dont even begin to approach Krakatoa levels of loud. (For reference, a shockwave is considered lethal around 200 dB).\n\nTo get an idea of how powerful the shockwave from the eruption was compared to the rocket launch, let's relate them to more tangible values. To understand how strong the shockwaves are, let's use distance. If we say the shockwave from a rocket launch is equal to a length of one inch (2.54 cm), the power of the shockwave from the Krakatoa eruption would be 2/3 the distance from Earth to the Moon. In terms of sound volume, if we set the rocket launch to be as loud as a whisper (~40 dB), the Krakatoa eruption would be as loud as a gunshot (~140 dB). The vocabulary honestly doesnt exist to describe how much bigger Krakatoa was. It would literally take 10 billion simultaneous rocket launches from a single location to replicate the Krakatoa shockwave.\n\nIf you have any doubts, take a look at reports of what happened during the Krakatoa eruption and compare them to any launch/explosion that has ever occurred. Anyone within 10 miles of the eruption wouldve been permanently deafened. The shockwave ruptured eardrums of sailors 40 miles away, eardrums rupture around 150 dB. The sound was clearly heard over 3,000 miles away, greater than the distance from Los Angeles to Ney York City. The eruption was so powerful that an entire mountain and the vast majority of the island it was on literally exploded and chunks of rock were launched miles into the air (70% of the island was destroyed). The amount of energy released in the explosion is estimated at 200 megatons of TNT, roughly 4x the yield of the Tsar Bomba (largest bomb ever detonated). The shockwave was measured by barometers 7 times after the eruption, meaning the shockwave traveled around the globe 3.5 times before dissipating. Compared to a rocket launch, the Krakatoa eruption is in a totally different league. Very, very few things have even come close to being that loud.\n\nThere is one caveat in this whole story. Launchpads for rockets are often located on a coast. Some of the sound is directed out over the open water and some directed over land. The sound that travels over land runs into all sorts of obstacles, like trees, buildings, hills, etc. that all inhibit the sound propagation. Over the ocean, there is nothing in the way of the sound so it can travel much farther. A rocket launch can be heard from farther away on sea than on land. The Krakatoa eruption occurred on an island in Indonesia. The sounds from the eruption were able to travel over the ocean for hundreds or even thousands of miles without hitting a single obstacle. This contributed to the large (3000+ mile) distances that the sound could be clearly heard across. Had the eruption occurred somewhere inland, the sound would not have been able to travel as far.\n\nTL;DR - The Krakatoa eruption was calculated to be around 180 dB 100 miles away from the eruption. The rocket launch is ~210 dB at the site of the launch. In order for Krakatoa to produce a 180 dB sound 100 miles away, the shockwave at the site of the eruption is estimated to have been around 310 dB. The sound made by Krakatoa is indeed among the loudest in all of history, and is estimated to be about ~1,024x louder and had a shockwave ~10 billion times more powerful than a rocket launch.\n\nHere is a video that captures the moment of the explosive 2014 eruption of Mt Tavurvur in Papua New Guinea. The sound made by Krakatoa wouldve been similar, but thousands upon thousands of times louder. https://youtu.be/BUREX8aFbMs",
            "title_similarity": "0.6628893"
        },
        {
            "id": "gwztwf5",
            "score": 1,
            "text": "What about sperm whales with 230~ish decibel?\n\nhttp://www.bbc.com/earth/story/20160331-the-worlds-loudest-animal-might-surprise-you",
            "title_similarity": "0.6826832"
        }
    ]
}