{
    "ELI5: Why is spoiled food dangerous if our stomach acid can basically dissolve almost anything organic\nPretty much the title.\n\nIf the stomach acid is strong enough to dissolve food, why can't it kill dangerous germs that cause all sorts of different diseases?": [
        {
            "id": "gwxni27",
            "score": 4,
            "text": "It affects the good bacteria in the stomach meaning that you’re susceptible to many different intestinal problems. Leading some to have a decal transplant to revive the healthy stomach bacteria.",
            "title_similarity": "0.70392203"
        },
        {
            "id": "gwxy3k6",
            "score": 14,
            "text": "Every bacterium has a wall/membrane called a Capsule. Some strains of bacteria have a Capsule that is resistant to strong acids evolved from when the earth was still very hostile. The capsule protects the bacterium until it reaches the small intestine, where it produces toxins leading to food poisoning. Some bacterium produce gasses that lead to wet burps which burn your esophagus.\n\nP.S. there are colonies of bacteria living in your intestine already, but they're tame and cause no harm if left untouched.",
            "title_similarity": "0.7681385"
        },
        {
            "id": "gwyii33",
            "score": 0,
            "text": "I have a follow up question: if someone were in a dire situation, almost starving, and they ate small amounts of contaminated food, would they be safe by virtue of having almost nothing in their stomach, so the bacteria is killed by their stomach acid?  I heard about people escaping from genocide living off raw meat from animals they caught, but we don't hear about the people who might have gotten sick and died from this.",
            "title_similarity": "0.785511"
        },
        {
            "id": "gwyiuh8",
            "score": 0,
            "text": "You have more bacteria living in your gut than you have cells in your body  _ not only that they are a large number of which you would die without having",
            "title_similarity": "0.53000724"
        },
        {
            "id": "gwzpr5s",
            "score": 0,
            "text": "Fungus. Plus the spoiled food has lost its chemical potential for harvesting energy as it loses its electrons to oxygen, that is why it tastes stale often",
            "title_similarity": "0.7595899"
        },
        {
            "id": "gwzuhuq",
            "score": 0,
            "text": "Bruh this is common sense !! everything you eat  is abosorbed by your blood stream and that blood is pumped to all the parts of your body by your heart.",
            "title_similarity": "0.3903178"
        },
        {
            "id": "gwzziyj",
            "score": 0,
            "text": "The badness is deeeeep inside the food like an army in a submarine.  (Or do you remember those guys in the wooden horse I told you about?) After the food leaves the stomach the warriors can come out and fight!",
            "title_similarity": "0.638511"
        },
        {
            "id": "gx0kgz9",
            "score": 0,
            "text": "Germs are usually the same thing as bacteria. Your stomach is full of bacteria, mostly good ones, since many bacteria are fine with stomach acid. If you eat bad ones on tainted food, some will be able to multiply and make you sick.",
            "title_similarity": "0.74504495"
        },
        {
            "id": "gx255xm",
            "score": 0,
            "text": " Use Google,  Use Google, Use Google, Use Google,  Use Google, Use Google, Use Google,  Use Google, Use Google, Use Google,  Use Google, Use Google, Use Google,  Use Google, Use Google, Use Google,  Use Google, Use Google, Use Google,  Use Google, Use Google, Use Google,  Use Google, Use Google.",
            "title_similarity": "0.28042924"
        },
        {
            "id": "gwy3y9i",
            "score": -1,
            "text": "Bacteria. Some of it has evolved to poison us when we break it down. And some of it has evolved to survive our stomach, or even inside our immune system after our immune cells have 'eaten' it.   \n\n\nSpoiled food in a vacuum probably wouldn't be harmful to us, it might taste awful though.",
            "title_similarity": "0.7849709"
        },
        {
            "id": "gwy4u67",
            "score": 2,
            "text": "Mostly because bacteria (and especially fungi) can produce very nasty poisons, which will enter your blood stream and get you that bit closer to dead.",
            "title_similarity": "0.7442303"
        },
        {
            "id": "gwyfzck",
            "score": 2,
            "text": "Pretty much what everyone has said - bacteria. Even if the bacteria was not alive, just having the parts of it in your stomach is enough to make you feel sick and feverish.  Your body sees those bacterial parts and acts up.",
            "title_similarity": "0.6960496"
        },
        {
            "id": "gwyg3nu",
            "score": 2,
            "text": "Imagine the trail of food (bits and tiny pieces) that gets left behind as everything has to work its way down your throat, through the intestines, and finally to your stomach. The average intestines when stretched is nearly 20 feet long. That's a long drag for food to get caught up and left behind. \n\nSo naturally you're leaving a microscopic trail of disease and bacteria infected food behind.\n\n*Edit:* ~~your~~ **you're**",
            "title_similarity": "0.6468526"
        },
        {
            "id": "gwzm9vt",
            "score": 2,
            "text": "Did you watch Breaking Bad? An acid that can eat through some really tough things might have no effect on others. The molecular key just doesn't match the molecular lock. That's why we can store even the strongest acids (and bases).",
            "title_similarity": "0.7661491"
        },
        {
            "id": "gwzsi2d",
            "score": 2,
            "text": "Some comments do not mention something else.\nTOXINS. They are not biological, but produced by the bacteria. So not killed by the acid, and ends up poisoning you.",
            "title_similarity": "0.7239985"
        },
        {
            "id": "gwyk9w4",
            "score": 4,
            "text": "Many bacteria that cause food poisoning produce endotoxins that are heat and acid resistant. The bacteria can be killed either through cooking or in the digestion process but the toxin is what makes you sick.",
            "title_similarity": "0.8419827"
        },
        {
            "id": "gwxxwlg",
            "score": 5,
            "text": "The key in your question is \"almost\". There are still plenty of things that aren't dissolved (e.g. your stomach itself), and some of these things can harm you. Some pathogens will resist, sometimes it's some more resistant forms of them (spores, eggs). And as many commenters pointed out, the toxins produced by pathogens might resist as well.",
            "title_similarity": "0.6656089"
        },
        {
            "id": "gwy8q2x",
            "score": 9,
            "text": "The same way we claim a dogs mouth is cleaner than a humans. The bacteria in a dog's mouth isn't as harmful to us as some of the bacteria that grows in our own...especially the ones that rot our teeth and inflame our gums. As food is consumed by bacteria in the fridge or counter, it's releasing toxins that affect us when we eat them. Those bacterial growths and their toxins are what make us sick, not the food itself.",
            "title_similarity": "0.7376923"
        },
        {
            "id": "gwxw3qp",
            "score": 70,
            "text": "Still early in the thread to tell that not the bacteria/germs are the biggest problem but the substances (toxins) they are producing... you can't wash them away or destroy them with high temperature.\n\nIt is called food POISONING for a reason.",
            "title_similarity": "0.7635944"
        },
        {
            "id": "gwy91uw",
            "score": 31,
            "text": "A lot to unpack here but here it goes:\n\nFirst, there are two main ways that bacteria cause foodborne illness: intoxications and infections\n\n1. Intoxications: Bacteria grow in the food and make toxins, and then you eat the food with the toxin and get sick. The toxins are acid resistant enough that the stomach acid doesn't do anything to them. \n\n2. Infection: Stomach acid can and will kill some of the germs, but enough survive to get into your intestines and cause an infection.\n\nEdit: spelling, grammar",
            "title_similarity": "0.8438684"
        },
        {
            "id": "gwy7e8t",
            "score": 127,
            "text": "One thing I haven't seen mentioned is that most food based illness in the developed world isn't due to bacteria, but norovirus. Norovirus will quite happily move through your stomach to your small intestine where it sets up replicating and irritating your gi tract. Then when it's done enough damage it exits (in both directions) and gets spread onto every surface in your bathroom when you flush the toilet. Anyone who touches those surfaces can then infect themselves by putting their fingers or something they touch in their mouth, or infect others by failing to wash their hands (with bleach; norovirus largely ignores soap) and then serving/cooking their food.",
            "title_similarity": "0.77228713"
        },
        {
            "id": "gwzt1hu",
            "score": 20,
            "text": "Hang on for a minute:\n\n>...if our stomach acid can basically dissolve almost anything organic\n\nThis is not true. There are a lot of organic things that a human stomach can't \"dissolve\" very efficiently. That includes grass, wood, bone, etc. Some animals can handle those things, but humans cannot.",
            "title_similarity": "0.74457484"
        },
        {
            "id": "gwyrds7",
            "score": 26,
            "text": "For one thing, stomach acid isn’t actually super strong. It’s a form of Hydrochloric Acid, but it is dilute.  If you’ve ever had to clean up vomit, you’ll know that it doesn’t just burn through everything it touches. \n\nAs others have pointed out too, it’s not just the living parts that are dangerous.",
            "title_similarity": "0.7396928"
        },
        {
            "id": "gwypfs1",
            "score": 117,
            "text": "Ever looked at your poop after eating corn? Some stuff our stomachs can't deal with conpletely",
            "title_similarity": "0.5824283"
        },
        {
            "id": "gwyb5c7",
            "score": 252,
            "text": "People have touched on almost everything, but it effectively boils down to a few factors; \n\n- the bacteria type \n- does the bacteria produce a toxin that *isn't* broken down by stomach acid? \n- how *much* bacteria are you getting in the bolus of food? One of the things I hadn't seen addressed here is that you can get sick if the number of colony forming units (CFUs) outnumber the amount of acid that gets them. If you wanted to raid a castle that had a moat around it, and you had an unlimited number of soldiers, and you were a psychopath...well, just continue throwing soldiers at the castle until the moat fills up with dead people, and then climb over it. Sure, lots of bacteria will die in that acid bath...but some might make it through the gates on the dissolving bodies of their comrades and make a nice home in your guts.",
            "title_similarity": "0.8265753"
        },
        {
            "id": "gwxodpa",
            "score": 1398,
            "text": "Well first, stomach acid can kill many germs but not all of them. Second, in some cases of food-borne illness, it's not the germs themselves that make you sick but toxins created by the germs, and stomach acid doesn't do anything to those toxins. This is why can't eat spoiled food even if it's cooked. Yes, cooking may kill the germs, but it still leaves the toxins that make you sick.",
            "title_similarity": "0.8230317"
        },
        {
            "id": "gwxo4sl",
            "score": 13490,
            "text": "Not all bacteria go down to the stomach, some stay in your mouth.\n\nBacteria can also produce toxins on the food while it spoils, even if the stomach acid kills the bacteria, the toxins can still poison you.\n\nAlso some bacteria are just acid resistant.",
            "title_similarity": "0.78586054"
        },
        {
            "id": "gwyd0o4",
            "score": 1,
            "text": "Then why can my dog eat some 3 month old crumb that fell under my stove and not get sick?",
            "title_similarity": "0.61182016"
        },
        {
            "id": "gwyegkh",
            "score": 1,
            "text": "I might be wrong but, bacteria can form endospores which can withstand extreme environments. It is the dormant stage of bacteria reproduction that can be activated in favourable conditions.",
            "title_similarity": "0.5405607"
        },
        {
            "id": "gwyfsyz",
            "score": 1,
            "text": "most germs do get killed by the acid. I guess some slip, just like that, or if you dilute your stomach acid with fluids etc. Also, some bacteria can create some sort of mucus and live on the wall of you  stomach: e.g. helicobacter pylori is a common cause of bacterial gastritis.",
            "title_similarity": "0.7521608"
        },
        {
            "id": "gwyg33l",
            "score": 1,
            "text": "Been watching Hi Meat vids too, eh?",
            "title_similarity": "0.43949217"
        },
        {
            "id": "gwygbsk",
            "score": 1,
            "text": "There are acid resistant bacteria, for example *Helicobacter pylorii*, that neutralize hydrochloric acid by secreting urease.\n*Lactobacillus acidophilus* is another bacteria that is acid resistant and is part of your gastrointestinal flora.",
            "title_similarity": "0.68753767"
        },
        {
            "id": "gwygnsq",
            "score": 1,
            "text": "The mouth is a sponge. Lots of stuff gets directly absorbed into the bloodstream. That's why, for example, Salmonella is a big deal. It's pretty simple science tbh",
            "title_similarity": "0.5930946"
        },
        {
            "id": "gwygyqz",
            "score": 1,
            "text": "because our stomach acid is not strong enough. it's stronger than herbivores, but much weaker than certain other carrion-eating species like vultures, eagles, hyenas etc.\n\n\nvultures for example have stomach acid that is 100 times stronger than ours\n\nhttps://www.redding.com/story/life/2017/07/26/vultures-have-ph-public-health/504630001/\n\nalso, the acidity of our stomach varies with age, with babies and older people having much higher ph levels than healthy young adults, which makes them more susceptible to food bacteria.",
            "title_similarity": "0.72682625"
        },
        {
            "id": "gwyijth",
            "score": 1,
            "text": "What about drinking water from certain other countries for bacterial reasons? What does boiling the water do that your stomach can’t? Not including things like lead.",
            "title_similarity": "0.74475014"
        },
        {
            "id": "gwyil8q",
            "score": 1,
            "text": "I think other people explained it in more detail, but I want to take a stab at an actual 5 year old answer.\n\nYour body isn't melting everything the way a furnace might totally burn things down, its breaking the food down to be digested.  The goal is for your body to use the broken down food as building blocks and ship it to build muscles or fuel your brain.  If you eat a marinated chicken breast on it, your body receives protein and salt and sugars to ship to where protein and sugar and salt are needed.  If you eat the same marinated chicken breast with mold on it, you receive all the building blocks of that mold too.  And that mold or bacteria or virus can make us sick too.",
            "title_similarity": "0.6959779"
        },
        {
            "id": "gwyobbk",
            "score": 2,
            "text": "When bacteria eat, they often poop out substances that are very dangerous. Take botulism--caused by a waste product called botulinum from the Clostridium Botulinum bacteria. This used to be common in canned and jarred food, which is why people would boil their food until it was mush up until the mid-20th century.",
            "title_similarity": "0.79141116"
        },
        {
            "id": "gwyrldp",
            "score": 1,
            "text": "That’s the reason why sometimes you don’t get sick after eating something that went “bad” recently.",
            "title_similarity": "0.5417161"
        },
        {
            "id": "gwysyq3",
            "score": 2,
            "text": "It can't even break down cellulose. It really just turns your food into more mush so your digestive tract can absorb the nutrients.",
            "title_similarity": "0.66171855"
        },
        {
            "id": "gwyvg6e",
            "score": 1,
            "text": "fuckin hell i saw the word bacteria and germs and the first thought that flew into my head was how i took a blind bite of a slice of lemon pound cake NOT SEEING THE BIG OL PATCH OF MOLD ON THE BOTTOM OF IT (i save the icing for last teehee) \n\nand so i chomped and BWAMO the most bitter and revolting taste explodes into my mouth. i am as to be expected, surprised, confused, and disgusted. i grab my phone and turn on the flashlight to see what the heck was making my beloved lemon loaf taste so icky and thats when i spot it... THE NASTIEST GREENEST PATCH OF MOLD IVE EVER ENCOUTERED! i almost puked i swear to god..",
            "title_similarity": "0.66011935"
        },
        {
            "id": "gwyxm3t",
            "score": 1,
            "text": "Just because it's acid doesn't mean there are bad things making it through. What would happen if you ate a lot of tuna? You would get mercury poisoning.\n\nSame with Apple seeds. Eat too many and you get arsenic poisoning",
            "title_similarity": "0.7867985"
        },
        {
            "id": "gwyxyrd",
            "score": 1,
            "text": "Keep in mind that dissolved doesn't mean it no longer exists. It's broken down but harmful things are still there and still harmful. If you dissolve mercury in water and drink the water it will still kill you.",
            "title_similarity": "0.76718616"
        },
        {
            "id": "gwyyca9",
            "score": 1,
            "text": "I have a similar question if anyone can answer. I've heard you're not supposed to defrost food in the sink. What difference does it make if you're going to cook it and kill the bacteria anyway",
            "title_similarity": "0.7457084"
        },
        {
            "id": "gwyyd4b",
            "score": 1,
            "text": "Bacteria like E. coli can shrink the amount of genes they express in an extreme or stressful environment (like stomach acid) to allow them to make it through the stomach and release toxins and infect the small intestines.",
            "title_similarity": "0.7680827"
        },
        {
            "id": "gwyyzet",
            "score": 1,
            "text": "Other people have already given good answers, but let me add my own. (I studied biotechnology and I'm currently sudying a master's degree in agricultural and food science)\n\nFood spoils when microorganisms start growing on it, and the risk in eating spoiled food is mostly due to the presence of toxins produced by those microorganisms.\n\nThese microorganisms can be either bacteria (like Clostridium) or fungi (mostly molds, like Fusarium).\n\nThese toxins are varied. They can be peptides/proteins, like the botulinum toxin (produced by Clostridium botulinum) or the diphteria toxin (produced by Corinebacterium), or they can be smaller molecules, like mycotoxins. Mycotoxins are toxins produced by fungi, like aflatoxins produced by Aspergillus, or rubratoxins produced by Penicillium.\n\nAnd there are two main ways these spoiled foods can cause food poisoning: either by ingesting food that already has those toxins on them (which can resist the stomach acids), or by ingesting those microorganisms on the food, and them producing the toxins inside your body. And this last thing can happen because microorganisms (especially bacteria, it's not as common with fungi) can also resist the stomach acids. They have a cell wall that already gives them some protection, many also have an external capsule that makes them more resistant, and some can even make spores (and these spores can be extremely hard to destroy).\n\nIf a bacteria survives the stomach acids and reaches the intestines, and there are enough of them to start colonizing (instead of being controlled by the normal bacteria already present in the gut), they can produce the toxins right there. And these toxins are what cause the damage.\n\nTo sum up: spoiled food is dangerous because the same microorganisms that spoil it produce toxins, and both the microorganisms and the toxins can get past the stomach and cause harm in the intestines.",
            "title_similarity": "0.7720345"
        },
        {
            "id": "gwyznz2",
            "score": 1,
            "text": "In a similar vein your saliva neutralizes acid but not flossing and brushing before bed means you stop salivating and are prone to getting rekt. \n\nDon’t drink OJ. Eat it. Mainlining sugar = juice",
            "title_similarity": "0.63922405"
        },
        {
            "id": "gwz144l",
            "score": 1,
            "text": "Is it though? I see a whole community of people who eat aged meats and what a common person would called spoiled food and swear by it! As long as it spoils safely it seems it’s really not that unsafe. Not for me, but plenty of people do it. Raw “spoiled” meat and chicken and eggs and all kinds of animal products. Shits gross but these people seem fine.",
            "title_similarity": "0.649716"
        },
        {
            "id": "gwz16bw",
            "score": 1,
            "text": "Id like to think it cause the germs spread but also cause the food is bad and your absorbing in? Not sure this is above my pay grade",
            "title_similarity": "0.73237026"
        },
        {
            "id": "gwz26pp",
            "score": 1,
            "text": "Stomach acid doesn't dissolve several bacteria or viruses. Certain bacteria like E coli, Salmonella, and H pylori can survive even in very low (acidic) pH. Some viruses are also stable at acidic conditions and can survive exposure to stomach acid. These pathogens can stay in the stomach to cause stomach ulcers (H pylori), or can continue down the intestinal tract to cause diarrhea/food poisoning. Basically several pathogens have adapted and gained the ability to survive highly acidic environments including the stomach. This is not all bad though, since this ability to survive stomach acid also allows the \"good\" bacteria (eg probiotics) to survive such that they can colonize your colon.\n\nAdditionally, some cases of food poisoning are not due to actual pathogens, but rather the toxic compounds that they have produced and which are now in your food. In these cases the bacteria may indeed be destroyed by the stomach acid, but the toxin is not, and will still cause you sudden symptoms such as fever/vomiting/diarrhea after eating the toxins.",
            "title_similarity": "0.688844"
        },
        {
            "id": "gwz2a8e",
            "score": 1,
            "text": "I feel like this question is one of those examples of something that sounds so stupidly simple, but the more you look into it the more complex it gets. +1 for making me research for a few minutes OP",
            "title_similarity": "0.46792528"
        },
        {
            "id": "gwz2bt7",
            "score": 1,
            "text": "So wtf type of acid is in Vultures stomachs were they’re able to eat just anoht anything?",
            "title_similarity": "0.7220664"
        },
        {
            "id": "gwz4mpu",
            "score": 1,
            "text": "It's not the bacteria, it's the chemical toxins that the bacteria produce.  C. botulinum produces the deadly botulinum toxin, for example, and many toxins aren't broken down by cooking-level heat, much less the acid in your stomach.  So the toxin passes through your stomach unscathed, right into your blood, and off it goes to fuck you up royally.",
            "title_similarity": "0.8265377"
        },
        {
            "id": "gwz5iy6",
            "score": 1,
            "text": "Stomach acid doesn't really dissolve your food. Your food is broken down by enzymes (like little microscopic robots), which are only active in an acidic environment, like the stomach.",
            "title_similarity": "0.67278445"
        },
        {
            "id": "gwz5xep",
            "score": 1,
            "text": "There's a reason you don't eat dirt without getting ill.\n\nYour stomach in itself isn't capable of killing everything.\n\nYou have your mouth and throat between that. Plenty enough to get unwell from eating the wrong thing.\n\nPlus your stomach isn't the strongest acid, otherwise it would dissolve itself.",
            "title_similarity": "0.7480967"
        },
        {
            "id": "gwz6dee",
            "score": 5,
            "text": "Because our stomachs aren't actually that acidic! We are omnivore so we have a medium acidity and we cook our food and chew it well, unlike cats and dogs who don't cook or chew. Their stomachs are wayyyy more acidic than ours and thus kill much more bacteria.",
            "title_similarity": "0.7546527"
        },
        {
            "id": "gwzc78l",
            "score": 1,
            "text": "I remember an episode of Survivorman and Les hunkered down for a bit at a hunters \"shed\" in Alaska Northern Canada or something and he said there was leftover meat or something there, it was spoiled, but the human body can handle, but you know only do it when necessary. Any thoughts on that?",
            "title_similarity": "0.5663309"
        },
        {
            "id": "gwzcj36",
            "score": 1,
            "text": "Because you aren't just dissolving the food to are absorbing it on a cellular level and bacteria lives at a cellular level.\nDead or alive at some point you are gonna absorb that bacteria and it will make you ill.",
            "title_similarity": "0.7614802"
        },
        {
            "id": "gwzdkn9",
            "score": 1,
            "text": "For species that have evolved to eat spoiled food, their stomach acids are significantly more intense.  you are very much on the right track, most species don't need the boost since they don't eat carrion.",
            "title_similarity": "0.69401443"
        },
        {
            "id": "gwzdrwh",
            "score": 13,
            "text": "ELI5 by species:\n\nE. Coli produce certain anti-acids so they can survive the stomach. They have like 3 so if one fails the others kick in. Now that's gangster! So make sure you wash your hands after you poop. There is a super version(triple OG E. Coli(entiritis) that kills instead of just making you sick. \n\nThe most common kind of food poisoning bacteria Campylobacter is so devious it hijacks a ride through a protozoa(which moves away from acid) to make you run to the bathroom every 15 minutes after you're infected. \n\nDeadly C. Botulinum form spores which are like invincible eggs that hatch when they are good and ready to go(safe from heat and acid). They can die but their poop(the botulism toxin) is deadly and used by doctors to remove wrinkles by paralyzing face muscles. Not good if it's paralyzing your diaphragm or heart after too much gets in your system.\n\nCholera mostly die but just a little make it thru to your intestines then they bounce back to screw you over. You ever see how bacteria reproduce? It's exponential so once a few get thru you're screwed until your immune system kicks in. \n\nThere is an algae that is poisonous and fish are left with it's toxins. You eat that don't worry about an organism the toxins will kill you. Yeah, if you haven't caught on by now microorganisms can poison you with their poop. Don't swim in the red tide either. Just don't. \n\nListeria gives zero farts(ELI5 word hehe) about stomach acid, kind of like E. Coli but they need a certain ingredient to do it. So if you eat a food high in glutamate(cheese, nuts, processed meats) they will be happy you are helping them resist the acid. \n\nStaph will give you a boil but just die when you cook it. What doesn't die? The poop it released into your food before you cooked it which is toxic. They're a huge fan of cookouts. The human side of things it's hard to throw out those grilled burgers. I for one have taken many many chances. \n\nSalmonella doesn't play games, it lowers it's own acidity to feel right at home. Kind of like a bullshark switches from salt to fresh water to just generally be a bully that can survive anywhere. \n\nThe bottom line? Practice safe food handling techniques. Keep food refrigerated and throw it out when it's expired. Refrigerate cooked food within 3 hours or keep it at a temperature bacteria won't grow(yeah, it will dry out and start to suck at that point, so better to just refrigerate after a certain time). Reheat food thoroughly. \n\nI have an iron stomach, I can eat a pizza that has been sitting in the oven from last night. But if one of those clever bacteria survived, it's FML(fart my life).",
            "title_similarity": "0.80977786"
        },
        {
            "id": "gwzf0lx",
            "score": 2,
            "text": "Lots of reasons and it's all because there are lots of different bacteria.\nOne reason is it's not the bacteria itself that is making you sick but the toxins released from the bacteria or released when the bacteria is broken down. \nDid you know bacteria live nearly everywhere on earth? Hot, cold, acidic, alkaline, dry, wet, you name a condition there is some bacteria that live there. These are called extremophiles. What this means is that there are some that can live very happily in the stomach.\nAlso relating to everywhere not all food gets completely broken down in the stomach, it starts the job but the intestines are involved, so there could be some that is hiding in an unbroken down part (I'm looking at you corn). Also related is that acid (like disinfectant) doesn't kill everything instantly, it takes time, which give the bad bacteria a chance to get through.\nAlso some bacteria have created ways to make that time longer. The may have thicker cell walls which acts kind of like armour. Armour won't last forever if it keeps getting hit but it does protect you for longer than without it. Also some bacteria when in harsh environments create what is called a spore. If we continue with the armour example a spore is like a tank. They are extremely tough. Once conditions are better for the bacteria it changes out of the spore back to its bacteria self and continues to grow and grow and grow making you sick.",
            "title_similarity": "0.7258602"
        },
        {
            "id": "gwzhumx",
            "score": 1,
            "text": "people give way too much credit to stomach acid.\n\nenzymes are the true beasts that do most of the work.",
            "title_similarity": "0.6079184"
        },
        {
            "id": "gwzlc2m",
            "score": 3,
            "text": "Everyone has had good answers so this is well covered.  \n\nBut you know the advertisements showing how much salmonella is found on countertops etc?  It's found everywhere.  It's on your food too.  Your body does a damned good job of killing it though, but high loads get through.",
            "title_similarity": "0.63218546"
        },
        {
            "id": "gwzpms3",
            "score": 3,
            "text": "Stomach acid doesn’t dissolve anything - I swear this is the most widely misunderstood part of digestion. Acid is pretty good at killing bacteria and so yes you can probably eat some “spoiled” food without dying or even getting sick. But acid by itself has very little digestive power. It does nothing to starch, protein or fat, cellulose, hair, nails, most metals. Come to think of it about the only thing stomach acid alone would dissolve is limestone lol.",
            "title_similarity": "0.7518028"
        },
        {
            "id": "gwzrzzq",
            "score": 1,
            "text": "The bacteria poo in your food over time. Poo dissolved is just liquid poo. Eating poo makes you sick.",
            "title_similarity": "0.7748493"
        },
        {
            "id": "gwzvr13",
            "score": 1,
            "text": "Your stomach acid isn't at a high enough concentration to dissolve everything organic. It does dissolve some material but its mainly there to maintain the right acidity for your stomach enzymes to do the heavy lifting.",
            "title_similarity": "0.77403307"
        },
        {
            "id": "gwzyb4a",
            "score": 1,
            "text": "If stomach acid disolved anything organic then you wouldn’t get those amino acids. So no, it doesn’t dissolve everything.",
            "title_similarity": "0.67546904"
        },
        {
            "id": "gx0034i",
            "score": 2,
            "text": "In some cases it’s not about the live bacteria you are swallowing, but the toxins they have already released on the food itself. Such toxins are often resistant to stomach acids and/or boiling.",
            "title_similarity": "0.7582756"
        },
        {
            "id": "gx00s9y",
            "score": 1,
            "text": "Your premise is flawed. Stomach acid and bile are most effective on proteins. And pathogens have the ability to counteract or resist acidic conditions. H. Pylori colonizes the stomach and it’s not even acidophilic.",
            "title_similarity": "0.7558205"
        },
        {
            "id": "gx01f3l",
            "score": 1,
            "text": "The human body, especially the digestive tract actually wants bacteria to flourish because many of them are beneficial. Bacteria, fungi, viruses, and other things that make us sick can be found in everyone but they are kept in check. While the digestive acid can destroy microbes, its main purpose is to digest not disinfect. The immune system and beneficial microbes are the in place to protect the body from invaders that make us sick.\n\nThere are actually a lot of foods we eat that go through a controlled type of spoilage called fermentation. We discovered that the microbes in these foods and drinks are perfectly safe to consume and taste amazing .",
            "title_similarity": "0.7091067"
        },
        {
            "id": "gx03rta",
            "score": 1,
            "text": "There are two main types of pathogenic molecules that bacteria use. These are endo/exo toxins. Exotoxins are a type that are secreted by living bacteria and can have pathogenic effects. While endotoxin's are structural elements of bacteria for example: pieces of their cell walls. While bacteria need to be alive to actively secrete exotoxins, endotoxins can still be pathogenic even after the bacterium has died and been broken down. Unfortunately the structure of some endotoxins are quite robust, and not easily destroyed even in a highly acidic environment like your stomach.",
            "title_similarity": "0.67866874"
        },
        {
            "id": "gx043xs",
            "score": 1,
            "text": "Your stomach doesn’t do all the digestion of the food you consume. It starts with mastication and enzymes in your saliva, then ultimately it goes through your small and large colon after your esophagus and stomach.",
            "title_similarity": "0.6538832"
        },
        {
            "id": "gx05tie",
            "score": 1,
            "text": "Stomach acid also doesn't dissolve everything. It is quite acidic but its not like the movies where everything disintegrates. Some chemicals can make it through that, out of the stomach and go on to cause problems later.",
            "title_similarity": "0.7178738"
        },
        {
            "id": "gx066y5",
            "score": 1,
            "text": "Also, whilst some spoiled food CAN make you ill (usually mild, sometimes worse), most people in the West are pretty paranoid these days. People used to (have to) eat a lot of quite sketchy food by today's standards (some still do). A lot of food we now consider \\`spoiled\\` (because it's not at it's best) is almost certainly not going to make you sick if you eat it. It doesn't instantly become poison the moment a date on a label expires.",
            "title_similarity": "0.7003837"
        },
        {
            "id": "gx07e6c",
            "score": 1,
            "text": "Toxins don’t get destroyed even if the bacteria is and some bacteria specially evolve to survive in gastric conditions. You are screwed if you eat spoils food not because of the bacteria but the waste by products of the food getting spoiled.",
            "title_similarity": "0.7311497"
        },
        {
            "id": "gx081e9",
            "score": 1,
            "text": "Toxins created by bacteria are generally what poison you, and they can’t be broken down by stomach acid. Also, heaps of bacteria live in your stomach just fine without being digested.",
            "title_similarity": "0.67823255"
        },
        {
            "id": "gx08r7b",
            "score": 1,
            "text": "Some bacterias have a capsule which is acid-resistant and prone to dissolve in basic pH. Our duodenum has a basic environment. They can be only destroyed by denaturating its protein structure by heating. That is why we cook the meat and chicken xd. Uncooked chicken may be a perfect resource for an serious salmonella or camplobacter infection.",
            "title_similarity": "0.7742027"
        },
        {
            "id": "gx09er8",
            "score": 2,
            "text": "If you think about it, our acid doesn’t *dissolve* everything, otherwise what would our poo be? It breaks things down to assist with digestion and many things aren’t dissolved and remain in our system. Like sweet corn! Just think of some bacteria and toxins as tiny bits of sweet corn.",
            "title_similarity": "0.74069667"
        },
        {
            "id": "gx0awnh",
            "score": 1,
            "text": "Posion isn't neccessarily organic; and some specific foods when spoiled whilst yes undergo organic process these are also chemical process - and they can leave nasty toxic/poisonous chemicals behind as their 'poop' on the food as it were which your body does not like.\n\n(btw not ALL spoiled foods will do this and I think it depends what grows on and decays it but essentially we take a 'better safe than sorry' sort of approach)",
            "title_similarity": "0.787369"
        },
        {
            "id": "gx0fx35",
            "score": 1,
            "text": "Most food poisonings aren't cause by the actual bacteria, but by the toxins the bacteria produced while in the food, before they got killed by your stomach acid. These toxins can survive both your stomach acid and the cooking process easily.\n\nAn example of this would be botulism.\n\nAnd example of the bacteria actually surviving your stomach acid (and then go on to start multiplying in your body) would be salmonella",
            "title_similarity": "0.80657417"
        },
        {
            "id": "gx0l0ca",
            "score": 2,
            "text": "Stomach acid doesn't really dissolve food; the acid is not concentrated enough and the food isn't in your stomach long enough. \n\nThe acid is there to protect us from some bad \"bugs\" (bacteria, parasites and viruses) that are sensitive to acid - bugs like *Salmonella enteritidis, Giardia lamblia* and *Yersinia enterocolitica*. Other bad bugs, like *Shigella sonnei*, *Escherichia coli O157* are resistant to the acid itself, but the acid in combination with certain chemicals secreted by the salivary glands (nitrates) they are killed too. Some bad bugs like *Vibrio cholerae* are knocked back  but not entirely killed by stomach acid, so if you don't have enough stomach acid for whatever reason (smoking, chronic illness, medicines) you tend to get more sick from these bugs. Some bad bugs like *Helicobacter pylori* find places in your stomach that are not as acidic to live, and bugs like *Salmonella typhimurium* can develop defenses against the acid and avoid being killed by it. \n\nThere are many more things that affect how effective your stomach acid is in protecting you - things like what kind of foods you've eaten, whether it's solid or liquid in the stomach, and how much food you've eaten are important; the acid is only one part of that. \n\nReference: [The Role of Gastric Acid in Preventing Foodborne Disease and How Bacteria Overcome Acid Conditions. JAMES L. SMITH, J Food Prot (2003) 66 (7): 1292–1303.](https://watermark.silverchair.com/0362-028x-66_7_1292.pdf?token=AQECAHi208BE49Ooan9kkhW_Ercy7Dm3ZL_9Cf3qfKAc485ysgAAArkwggK1BgkqhkiG9w0BBwagggKmMIICogIBADCCApsGCSqGSIb3DQEHATAeBglghkgBZQMEAS4wEQQMI0LPM0T5raB3Pd97AgEQgIICbFZfnSeFomtw-m2wg1YZrxWwGR0J_qfRC90_Dsm4zHwjrdO14V9atln_FZ5x6K6a4--1lHb_2UTsy4Z_gJ7gQQPqLQXxfW4RIRk4ZXWdoJJgScF6cdtXTaNkoio_cCGNwAP7nS8E54xqMVQ78iWNrhWI5arCjXQII5KA0wjV6O_QJVSQp0UKGoSEyPve7GmGr-VYiiXD-ULt0fn7NP9Z6yC6OkBW5iJJcJ44fORI6-PB5s1HNRwt0RARerqvN-XxcxRxveTDFevr29I2yF2ip6ZtfBVVSilQF2DE0WiUIyPDAsOxMBeAVUVIX9MaCGy6tgW78oURSjb5Ly7ljMauDVv6Tv-afXsNMZN0KfoXtjXIGSJLTxKIH-lyJlGlfYFxEx8vsicqIZqEc6xUIK-KEsPNDgRxBKJwO6lSoYOt8V08A7vI2yB8mhZpZymI64J-hIZoinwJ1nLC2s7UtnKe_RTkqSFCb-eZfa7i1krN4YXsLS2LDdMKyiXyLlGX7Ewac0tFuO0VcjpkAbRkTtZ0oOkBKi5bCvrC0eeuw6iAE4xy483eirGuIuHL2a8glqcCUW5lAwqzarkLToFB8upIr5_6118mvXlSWOewCLlROoVA5CjrnF0EmZPADYtoRvSesXGMA-zTboUVYVJKchNYH1OvfRLvcpE4cObYjiza7tfPY2kqdXgHpPaB5aLybx1ZcrWob8i22akNc9x5zkAHZvbs5B3z-hoPEe_1XbaC1c4sMnp8DtR2qzQyGLI6VrhWt1SgK7IlIBZ6xdY2_MhF1zbRQ8SvvaH_5TGcIreDTiMSXRLHzRh3pl7KnSFF)",
            "title_similarity": "0.7443043"
        },
        {
            "id": "gx0mguj",
            "score": 1,
            "text": "stomach acid is a chemical reaction. \n\nimagine a box of toys. mostly teddy bears, and some red legos glued to the side of the box. \n\nyour stomach is the toy box. you put blue legos and marbles into the toy box. some of the blue legos connect with the red legos... and they dont poke the teddy bears... but sometimes you can run out of red lego and the blue poke the bears. then you have marbles(toxins) that can't connect to anything; they poke the bears no matter what. \n\n\nwhen you poke the bear, the toy box get's angry.",
            "title_similarity": "0.60058165"
        },
        {
            "id": "gx0miqv",
            "score": 1,
            "text": "Pre formed toxins from dead bacteria can make you violently ill or even kill you (think botulism). Moreover most gastrointestinal pathogens infect you through contaminated food, water or hands, and are usually highly resistant to acid... As few as 10 bacilli of Shigella dysenteriae can give you a bad case of bacillary dysentery. Not to mention parasites...",
            "title_similarity": "0.8335514"
        },
        {
            "id": "gx0old4",
            "score": 1,
            "text": "Germ poop is what makes spoiled food inedible even if you cook it. You can kill the germs but the poop is poison. You can’t kill that.\n\nThere is the possibility that there are so many germs on and in the food that cooking it might kill most of them, but you could ingest enough to make you sick too.",
            "title_similarity": "0.8726448"
        },
        {
            "id": "gx0oxph",
            "score": 1,
            "text": "Because dead microbes and their original products are called pyrogens which can be poisonous.",
            "title_similarity": "0.73528135"
        },
        {
            "id": "gx0smao",
            "score": 1,
            "text": ">If the stomach acid is strong enough to dissolve food...\n\nI used to think it worked this way, but it doesn't. The protein-digesting enzymes in your stomach need an acidic environment to do their thing; that's the main function of [stomach acid](https://en.wikipedia.org/wiki/Gastric_acid).\n\nIt's possible to get the impression that digestion is \"food + acid = nutrition\" from really basic science education stuff, but it's actually really complicated.",
            "title_similarity": "0.834778"
        },
        {
            "id": "gx0sxti",
            "score": 1,
            "text": "Your gut is full of bacteria that does fine in the environment.  Some consumed ecoli is so similar to your normal ecoli that you body accepts it as ‘normal’ but it grows uncontrolled in your body and ends up causing serious a condition -flesh eating disease.",
            "title_similarity": "0.74209833"
        },
        {
            "id": "gx0tv31",
            "score": 2,
            "text": "I think alot of spoiled food is relatively safe. Spoiled milk in most cases is fine to ingest, it just tastes awful. Also it just comes down to how it is spoiled. Fungi and mold can grow which will ofc make you sick, but only when the taste is off or the way it is spoiled is dangerous do we consider it spoiled. \n\nAlso if you live in the US the FDA doesn't mandate the expiration date so the company can slap any date on there. people throw away tons of perfectly good food just because the expiration date says it's bad.",
            "title_similarity": "0.80531853"
        },
        {
            "id": "gx0uc8x",
            "score": 1,
            "text": "A lot of pathogenic bacteria that are ingested are what we call enterotoxic, which basically means that they release a toxin when they get digested which causes infection or disease instead of the microbe itself",
            "title_similarity": "0.78896177"
        },
        {
            "id": "gx0v8z5",
            "score": 2,
            "text": "For the same reason your stomach are not dissolved by his own acid, adapted bacteria can survive those ph ranges.\n\nFor example. *Helicobacter pylori (HP)*\n\nYour stomach produces bicarbonated mucus to protect itself against acid. HP does almost the same. HP makes a little machine (urease enzyme) that takes Urea and transforms into Ammonia and CO2. That Ammonia is alcaline and counters the acid.\n\nTo sum up, HP makes a self protective layer against HCl",
            "title_similarity": "0.7212104"
        },
        {
            "id": "gx0xd6a",
            "score": 2,
            "text": "It’s not just bacterial, it’s fungal and viral that can also cause upset. Also if the food changes the osmotic composition in your gut, that can lead to upset as well. Or if you have allergies.",
            "title_similarity": "0.7362983"
        },
        {
            "id": "gx0yy8o",
            "score": 1,
            "text": "If I remember correctly, gram negative bacteria have something called Lipid A that is secreted when they die, Lipid A is toxic to humans\n\nIm not sure if stomach acid affects Lipid A tbh",
            "title_similarity": "0.80811864"
        },
        {
            "id": "gx0zizy",
            "score": 1,
            "text": "The simply exposition comes down to bacterial load. Spoiled food has more bacteria so the stomach acid doesn’t kill it all. \n\nOf course, more virulent bacteria (like shigella) only require a small bacterial load to cause infection.",
            "title_similarity": "0.7199195"
        },
        {
            "id": "gx10s8b",
            "score": 2,
            "text": "Stomach acid isnt as strong as they say.  It is low pH, but not as violently acidic as sulphuric or nitric and be grateful for that because vomiting would kill you.\n\nAs for pathogens, your stomach does do a good job of killing most.  Trouble is, before you eat them, they may have produced a toxin which wont be neutralized by the stomach acid and that will make you sick.\n\nSporeformers are another trouble, where they can be killed by your acid but they if they had time to produce spores in the food before you ate them, the spores enter the system too.  Spores are notoriously hard to kill and often require a multistage process (12D) of heat, acidity, pressure, chemicals, UV, you name it.  The idea is that they may be able to cope with one of those but dealing with all of them back to back while weaken them to the point of an easy kill.\n\nThen you have the extremophiles that can survive just fine in your stomach.  Helicobacter pylori is a noteworthy one, as it is responsible for stomach ulcers, rather than spicy foods and stress which only exacerbate the existing ulcers.  Extremophiles are rare in food systems but they do pop up here and there.",
            "title_similarity": "0.84596926"
        },
        {
            "id": "gx11r7n",
            "score": 1,
            "text": "There are bacterial structural and defense mechanisms such as being encapsulated and producing endospores. These examples greatly increase the resilience of certain bacteria in unfavorable environments, ie your stomach during acid release.",
            "title_similarity": "0.5559763"
        },
        {
            "id": "gx13h38",
            "score": 1,
            "text": "stomach acid kills germs\n\nlet's imagine it kills 99% of germs\n\nand you need 100,000 germs to get sick\n\nif you eat spoiled food, it has a high chance of having at least 10,000,000 germs\n\nso even if your stomach kills 99% of them\n\n100,000 germs will survive\n\nand you will still get sick",
            "title_similarity": "0.75179386"
        },
        {
            "id": "gx16iwq",
            "score": 1,
            "text": "Spoilage organisms are different from pathogens. You can see and often smell spoilage organisms, such as molds or yeasts, but you cannot see pathogens. Pathogens have ways of circumventing the stomach acid such as producing acid-stable toxins as well as forming spores that are acid tolerant.",
            "title_similarity": "0.724626"
        },
        {
            "id": "gx1fciz",
            "score": 1,
            "text": "Take this with a grain of salt, but I recall that a scientist guest on Fresh Air was asked if eating moldy bread and spoiled food is really dangerous. He answered that most of the time it's not dangerous to eat spoiled food, it's just unappetizing.\n\nIf you were starving, ie in a war type situation, and the only available food was moldy or spoiled, if you ate it you'd probably not suffer too much for it.",
            "title_similarity": "0.7625334"
        },
        {
            "id": "gx1h25v",
            "score": 2,
            "text": "Vultures have an extremely acidic stomach- ph level 1 - that allows them to eat just about anything without getting sick. Like 100x the acidity of a human stomach",
            "title_similarity": "0.72432095"
        },
        {
            "id": "gx1lk69",
            "score": 2,
            "text": "You would be surprised what the human stomach can tolerate. But most food issues are because the foreign matter is just that, foreign to us. We have a balanced biome that adjusts based on our diet. We build a tolerance for the bacteria we eat. Like the saying when in Mexico, don't drink the water? They drink it every day without issue but it is new to us. Many foods you eat are spoiled on purpose like cheese, sour cream, any fermented vegetables, summer sausage etc. Dry aged rib eye is basically just a controlled rot. \n\nSo if you want to tolerate more foods, eat some of them!",
            "title_similarity": "0.7247884"
        },
        {
            "id": "gx1vfp5",
            "score": 1,
            "text": "I'll nitpick about an error in your question rather than answer it, sorry. Most organic compounds are actually not dissolved in stomach acid. Think plastics, wood, natural textiles, paper and so on. Also many small organic molecules are not water (and acid) soluble.\n\n Foodstuff is actually special in that it is digestible.",
            "title_similarity": "0.6307596"
        }
    ]
}