{
    "ELI5: Do birds fly for days while over the ocean? How do they sleep?\n": [
        {
            "id": "gxizac4",
            "score": -1,
            "text": "Birds are more highly evolved than humans and only need to take short naps with only half their brains at a time all day and don’t need to sleep like us weak pathetic humans do, honey.",
            "title_similarity": "0.5119556"
        },
        {
            "id": "gxik6oa",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.0039450154"
        },
        {
            "id": "gxiuycm",
            "score": 1,
            "text": "The Swift (Apus Apus) does everything on the wing aside from nest building (obviously)......\n\nUsed to have them nest right outside my bedroom window, they are incredible.",
            "title_similarity": "0.47113937"
        },
        {
            "id": "gxic4vn",
            "score": 190,
            "text": "Swifts can stay in the air for [nearly a] year~~s~~ at a time. To sleep, they find updrafts and fly to great heights, then nap as they slowly fall back to earth.  \n\nEdited for accuracy.",
            "title_similarity": "0.7031791"
        },
        {
            "id": "gxkf92h",
            "score": 6,
            "text": "Great Frigatebirds can stay in the air for up to two months.  The Alpine Swift for more than six months.  The current-known record belongs to the Common Swift at just over ten months.\n\nStudies have shown they sleep in ten to twenty second bursts of sleep while gliding, and in calm weather may even sleep longer, as these swifts have been known to ascend to nearly 10,000 feet and take a lazy circular glide down lasting for quite a while.  \n\n\nAs for how they sleep, well, studies indicate that a great many bird species are excellent at simply ***not*** sleeping for very long periods of time.    \n\n\nFor these record-holders, as well as some other long-distance migrants like Arctic Terns, Wandering Albatross, Sooty Shearwater, and even the Barn Swallow, seem to utilize alternating unihemispheric sleep episodes, but just as often take the gliding power-naps I mentioned above.",
            "title_similarity": "0.67751765"
        },
        {
            "id": "gxircj4",
            "score": 47,
            "text": "Scientists have found that migrating birds can fly for 200 days straight, eating and sleeping while soaring through the sky.\n\nThe species the researchers studied is the Alpine swift, a swallow-like bird found in Europe, Africa, and Asia. Some of the swifts breed in Switzerland, then wing their way across the Sahara to Western Africa for the winters.\n\nBased on radar data, scientists “have claimed that some swifts may stay on the wing for almost their whole lifetime except for breeding,” the study authors write in Nature Communications. But, they add, “no data are available at the individual level confirming such long-lasting flights so far.” Long flights aren’t unheard of among birds: Sea birds, for example, may fly for days at a time while searching for food.\n\nTo find out the swifts’ endurance limits, the team caught six Alpine swifts in Switzerland and tagged them with data loggers. The devices recorded information about light levels (which helped the researchers determine the birds’ locations) and acceleration (which provided information on activity levels). After the birds migrated to Africa and back, the researchers caught three of them and tried to reconstruct the birds’ flight patterns.\n\nThe team found that the birds tended to flap their wings more at dawn and dusk during the winters. But the most impressive finding was that the swifts appeared to fly nonstop when they weren’t breeding. According to the study, this is the first time that scientists have shown such sustained activity in a non-marine animal.\n\nThe swifts eat bugs in mid-air, so that explains why they don’t starve. But the results “raise the question of how or whether these birds sleep,” the authors write. The swifts’ activity appeared to rise and fall during flight, and the researchers speculate that the birds might still be able to control their flying while sleeping. The team concludes that “swifts do at least to some extent sleep while airborne.” — Roberta Kwok | 11 October 2013",
            "title_similarity": "0.6940304"
        },
        {
            "id": "gxikob3",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.0039450154"
        },
        {
            "id": "gxjdezr",
            "score": 10,
            "text": "Hope I'm not too late for this one. Sailor here, we've had birds try and land on our ship for rest. But we don't carry food for them, so eventually we'll just have a few bird carcasses we have to push/wash overboard. Or if they try to rest near a radar or communication system to stay away from humans, they just get cooked due to the radiation. Nothing we can really do about it.",
            "title_similarity": "0.5408145"
        },
        {
            "id": "gxik2by",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "-0.0039450154"
        },
        {
            "id": "gxi6b19",
            "score": 107,
            "text": "It really depends on the particular bird species and their migration route. But many have the same ability dolphins do, to “partially” sleep allowing them to rest and continue navigating. If the migration route is not over the ocean for several day the species may flip its sleep cycle to take naps during the day. \nTLDR: species specific \nEdit: Additional info",
            "title_similarity": "0.6422839"
        },
        {
            "id": "gxia37k",
            "score": 646,
            "text": "Frigates stay aloft for like 60 days without landing. There's other migratory birds that spent like 1 day out of 4 months on land, and the rest of the time they are aloft.",
            "title_similarity": "0.71764904"
        },
        {
            "id": "gxibp4j",
            "score": 3534,
            "text": "[removed]",
            "title_similarity": "-0.0039450154"
        },
        {
            "id": "gxirwpn",
            "score": 6193,
            "text": "I can actually answer this because of a podcast my 3yo son loves.\n\nTwo methods: Some birds will fly for weeks at a time non-stop, and they sleep in burst of only a couple seconds, and usually glide while doing so. They do this a few times a minute, so it builds up.\n\nOthers essentially sleep half their brain at a time, like some whales do. Like, they literally keep flying on autopilot while the left half or right half of the brain sleeps, then they switch sleeping to the other side.\n\nScience-wise, we have NFI how animals do either of these things, but that's because we have NFI about the sleep mechanism in general.\n\nEdit: NFI = \"No fucking idea\". I wrote this on my phone when I woke up at 2:30am, so got lazy towards the end. Apologies for any confusion. Where I live, I think it's a normal acronym/phrase. My bad.\n\nEdit 2: The podcast is \"Imagine This\" which is done by ABC Kids here in Australia. The ABC Kids Listen app has a few really good ones for young kids, from educational to fun to go-the-fuck-to-sleep. The ABC Kids Listen live streaming is geoblocked outside Australai, bit you can still download the app and listen to most podcasts anywhere in the world (according to their FAQ's). Also they have transcripts of almost all their podcasts for the deaf and hard of hearing.",
            "title_similarity": "0.68659425"
        },
        {
            "id": "gximkor",
            "score": 385,
            "text": "Some birds have the ability to sleep uni-hemispherically. Meaning one half of their brain goes to sleep while the other half takes the wheel, and vice versa. This is how a lot of fish sleep too so they can keep swimming. In birds that don’t have that ability, I’m fairly sure I saw a David Attenborough documentary where some butterflies did an endurance flight across an ocean. Those who weren’t strong enough drowned, and those who were made it to land. I’m guessing this applies to the birds too?\n\nEdit - for those asking for links etc, the book: Why We Sleep by Dr Matthew Walker is one of the most fascinating things I’ve ever read, and my source. Thanks for all the upvotes guys.",
            "title_similarity": "0.6883447"
        },
        {
            "id": "gxjjfij",
            "score": 542,
            "text": "A bar-tailed godwit (Limosa lapponica) just flew for 11 days straight from Alaska to New Zealand, traversing a distance of 7,500 miles (12,000 kilometers) without stopping, breaking the longest nonstop flight among birds known to scientists,",
            "title_similarity": "0.67064023"
        },
        {
            "id": "gxi5pa4",
            "score": 12520,
            "text": "[removed]",
            "title_similarity": "-0.0039450154"
        },
        {
            "id": "gxipjv1",
            "score": 1,
            "text": "I remember reading that birds dont properly sleep, well not like humans do- they sleep with one eye open so only half their brain sleeps apparently so that would be how they sleep whilst flying.",
            "title_similarity": "0.6031647"
        },
        {
            "id": "gxissb5",
            "score": 4,
            "text": "Your question seems to have been answered, but I just wanted to provide my favourite example of trans-oceanic flight: the Blackpoll Warbler! http://www.sci-news.com/biology/blackpoll-warbler-migration-07008.html",
            "title_similarity": "0.44457233"
        },
        {
            "id": "gxiulsg",
            "score": 2,
            "text": "How does the fish sleeps?",
            "title_similarity": "0.47345716"
        },
        {
            "id": "gxix64z",
            "score": 1,
            "text": "Wow this is really an excellent question, i’m sure the knowledge that knowing they will drown to death or be eaten if they land in the water keeps them in the air for way longer than they thought they could be.also how long does it take them to fly over the entire ocean?",
            "title_similarity": "0.53355825"
        },
        {
            "id": "gxj5uoi",
            "score": 3,
            "text": "Turkey vultures on the west coast of North America migrate up and down the coast but are terrible fliers (but great gliders).  On their way south, they park over southern Vancouver island (city of Victoria) and circle, riding “thermals” higher and higher.  Once they are high enough, they glide southwards toward Seattle.  Only about 80% make it.",
            "title_similarity": "0.63531435"
        },
        {
            "id": "gxj9twc",
            "score": 1,
            "text": "Seafarer here. Seagulls and boobies often stick with passing ships for a week or so. During the day the flock usually floats on the air torrents above the ship's forecastle making dives for fish from time to time or even going out for a mile or two away and then returning. At sunset seabirds perch somewhere - that's on a foremast most of the times, but they will readily take off if the weather deteriorates. Looks like not many people know this, but seagulls and boobies unlike most other birds have a pretty good night vision, which is at least on par with human's eye or even better - at least good enough to succesfully get fish with ambient electric lighting present and even flying on moonless lights and not bump into masts or cranes. Sometimes birds cross oceans together with ships, sometimes they loose the ship after several days and apparently attach to another one going in the opposite direction.\n\nThe bonus is the ravaged paintwork in the fore part of the ship due to constant bombardment with birdshit. You see, seabirds take their after-digestive routines very seriously and can easily cover up to 70% of the bulk surface of deck and hatch cover with white foul-smelling stains which will often not come off unless washed with a power washing mashine on a short notice. Or another layer of paint it is.",
            "title_similarity": "0.70717305"
        },
        {
            "id": "gxjepce",
            "score": 1,
            "text": "A Bar-tailed Godwit was once recorded migrating 7000 miles from Alaska to New Zealand NON STOP.  That’s nine days of flying and is simply an amazing feat.",
            "title_similarity": "0.60825163"
        },
        {
            "id": "gxjfp65",
            "score": 1,
            "text": "Frigatebirds, which spend a majority of their life in flight on the ocean, [sleep in multiple split-second intervals mid-flight.](https://www.youtube.com/watch?v=w6j8xTZufUc) Basically megaspeed power naps. Like other seafaring birds, they are also capable of resting one hemisphere (one half of their brain) at a time while riding currents of rising warm air.",
            "title_similarity": "0.73689044"
        },
        {
            "id": "gxjhf0b",
            "score": 1,
            "text": "\"While migrating, birds may undergo unihemispheric slow-wave sleep in order to simultaneously sleep and visually navigate flight. Certain species may thus avoid a need to make frequent stops along the way. Certain bird species are more likely to utilize USWS during soaring flight, but it is possible for birds to undergo USWS in flapping flight as well. Much is still unknown about the usage of unihemispheric slow-wave sleep, since the inter-hemispheric EEG asymmetry that is viewed in idle birds may not be equivalent to that of birds that are flying\"",
            "title_similarity": "0.5899066"
        },
        {
            "id": "gxji0yn",
            "score": 3,
            "text": "I heard they don't! (bird research expert told me)\nThe Bar-tailed godwit migrates from New-Zealand to Korea. It stuffs itself completely and, after barely being able to take of from its huge weight, flies for about 9 days non-stop. Really non-stop. First thing it does when it arrives isn't eating but sleeping because it hasn't slept for 9 days!",
            "title_similarity": "0.68817997"
        },
        {
            "id": "gxjrh67",
            "score": 1,
            "text": "Blackpool Warblers are 13g songbirds that load up on fatty insects and fly for 4 days straight over the Atlantic Ocean from the eastern coast of the US to the Amazon.  From what I understand they sleep half their brain at a time and just keep flying.",
            "title_similarity": "0.7317295"
        },
        {
            "id": "gxjrmec",
            "score": 2,
            "text": "A lot of migratory birds can shut off half of their brains to rest that side in sleep and then switch when needed. The Common Swift can do this, and they’ve been known to spend up to ten months in the air because they typically only land when they’re nesting when they come back up north.\n\nMy neighborhood is a nesting ground for Swift’s and Swallows, so, when they head back down south for the winter, they most likely will not land until they return next spring.",
            "title_similarity": "0.6380989"
        },
        {
            "id": "gxjsg1s",
            "score": 1,
            "text": "Some birds land in the water and float to sleep. Hence why you see some birds get snatched out of the ocean at ungodly speeds by sharks.",
            "title_similarity": "0.6305857"
        },
        {
            "id": "gxjum3q",
            "score": 1,
            "text": "This specific question, and most or all related that show up in the comments (I didn’t read ALL the comments), are included in the very interesting book, “Why We Sleep”.   \n\nI’m only about 30% through the book but the author has addressed migratory birds.    I believe they sleep very briefly (a few seconds).   Cetaceans, someone mentioned them, have their own interesting behavior.   For example, orca babies, I think it was, don’t appear to enter REM sleep for the first part of their lives as they need to prioritize getting back to the pod/safety.",
            "title_similarity": "0.6500138"
        },
        {
            "id": "gxjywx1",
            "score": 2,
            "text": "Some birds just fatten up! Unlike humans, some birds are really efficient at burning fat. They’ll fatten up before the winter, and then instead of hibernating; they’ll burn all of that while flying somewhere warmer. By the time they get there they burned it all off!",
            "title_similarity": "0.40272793"
        },
        {
            "id": "gxjzn7d",
            "score": 2,
            "text": "Haven't you ever been driving on a trip and not remember the last few miles? You are not asleep but part of your brain you don't need shuts down. You still make turns and change lanes but don't remember",
            "title_similarity": "0.46109292"
        },
        {
            "id": "gxk1xbs",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.0039450154"
        },
        {
            "id": "gxk2gpe",
            "score": 1,
            "text": "Swifts can stay in the air for _months_ at a time and have one of the longest migrations of any bird.  Researchers say they do sleep.  \n\nhttps://www.sciencedaily.com/releases/2019/03/190306110651.htm",
            "title_similarity": "0.6546936"
        },
        {
            "id": "gxk3c8c",
            "score": 1,
            "text": "Can most birds not float on the surface like we’ve all seen before?",
            "title_similarity": "0.6103706"
        },
        {
            "id": "gxk4d7c",
            "score": 3,
            "text": "The thing about the ocean is realizing just how amazingly big it is.  I did 6 days on a carrier from Honolulu to San Diego and the only thing we saw was OCEAN.  That's at carrier speed, which is a bit higher than most vessels.  \n\nThe fact anything at all can manage to end up somewhere with land is amazing.",
            "title_similarity": "0.579522"
        },
        {
            "id": "gxkb46q",
            "score": 1,
            "text": "Somewhat relates.  There is snake island where the snakes got trapped in the island and evolved super deadly quick venom to kill birds that land there to rest",
            "title_similarity": "0.3872462"
        },
        {
            "id": "gxkcqsn",
            "score": 1,
            "text": "Only the birds with strong wings & stamina I believe that fly nonstop for their annual continental migration.",
            "title_similarity": "0.61819345"
        },
        {
            "id": "gxkjqo6",
            "score": 5,
            "text": "some birds turn off half their brain while keeping on the other so that they can fly AND sleep!",
            "title_similarity": "0.6130196"
        },
        {
            "id": "gxkqngv",
            "score": 1,
            "text": "Don't some bird just float on top of the water? Can't that be a rest period for them",
            "title_similarity": "0.65522957"
        },
        {
            "id": "gxkrcj1",
            "score": 1,
            "text": "No, they float. In a trip to bar harbor, saw puffins who only come to land to mate, otherwise floating along or flying.",
            "title_similarity": "0.70622003"
        },
        {
            "id": "gxktv5l",
            "score": 1,
            "text": "If I ain't wrong some birds fly with half brain while the other half brain is flying, and viveversa",
            "title_similarity": "0.5905422"
        },
        {
            "id": "gxkvvfg",
            "score": 2,
            "text": "Why wouldn't they just land on the water and rest? They do float, or so I'm told.",
            "title_similarity": "0.38596714"
        },
        {
            "id": "gxkw89a",
            "score": 2,
            "text": "Most birds don't have the ability to cross oceans. Birds were actually the first indication that land was nearby when ships crossed the oceans in the early sailing days. They would break out whatever remaining booze the sailors had and celebrate when they saw the first bird fly by because they knew land was close.",
            "title_similarity": "0.6055782"
        },
        {
            "id": "gxkz01u",
            "score": 1,
            "text": "Pretty sure a good amount of them don't actually fly over the ocean, they just coast or get stuck in some wind. That would explain how islands far out in the ocean like Hawaii even have any birds.",
            "title_similarity": "0.6010763"
        },
        {
            "id": "gxl1ueb",
            "score": 1,
            "text": "I think the ride warm air currents that are constant therefore they never have flap expending less energy. It’s the same way 600kg flying dinosaurs would migrate from N . America to Spain",
            "title_similarity": "0.45510596"
        },
        {
            "id": "gxl79ev",
            "score": 1,
            "text": "Albatross sleep on auto pilot. Half their brain is essentially awake still and they can lock their wings out to avoid fatigue.",
            "title_similarity": "0.57589364"
        },
        {
            "id": "gxl8s87",
            "score": 1,
            "text": "And do they stop for gas? ⛽️",
            "title_similarity": "0.11787208"
        },
        {
            "id": "gxlbcsh",
            "score": 1,
            "text": "Birds that fly in a formation, sleep half brain at time. Birds in the right side of formation have their right side of brain sleeping and vice versa . Then they switch sides.",
            "title_similarity": "0.6486821"
        },
        {
            "id": "gxlchn0",
            "score": 1,
            "text": "Pretty sure birds can sleep for seconds at a time while they coast. They´re not like us where they need hours of sleep at a time.",
            "title_similarity": "0.62746793"
        },
        {
            "id": "gxliaiy",
            "score": 1,
            "text": "Audubon Society.\n“... researchers found that while frigatebirds do sleep while flying, they sleep very little—about 45 minutes each day in short ten-second bursts, usually after dark. By contrast, on land, the birds sleep one minute at a time throughout the day and night for a total of roughly 12 hours each day.  \n\nWhile sleeping mid-flight, frigatebirds don’t go completely on autopilot; the birds often sleep with only one side of their brain, leaving the other side awake.”  \n  \nhttps://www.audubon.org/news/scientists-finally-have-evidence-frigatebirds-sleep-while-flying",
            "title_similarity": "0.7186469"
        },
        {
            "id": "gxlj86s",
            "score": 1,
            "text": "I know with humans.  Parts of the brain can shut down and sleep.  While the other parts are awake.\n\nNot exactly healthy tho.",
            "title_similarity": "0.25775206"
        },
        {
            "id": "gxljl6r",
            "score": 1,
            "text": "I don’t take biology or study animals in any way but, my guess is that they fly for days and days till they arrive to their destination, and I believe that if they find any land they just sleep there and continue flying after they woke up. I also don’t believe they give up in their journey during migration so if they fail I think they’ll be like “oh f**k well I’m late but why the hell should I not just go there it was my goal.”",
            "title_similarity": "0.62748516"
        },
        {
            "id": "gxlm9vb",
            "score": 1,
            "text": "No sure if they sleep, but most ocean birds that travel long distances have long wings so they can glide long distances",
            "title_similarity": "0.578645"
        },
        {
            "id": "gxltxnm",
            "score": 1,
            "text": "I read through this thread and noticed his hasn’t been mentioned - Albatrosses can lock their shoulder joints in place while gliding to keep their wings open, much like how land animals like horses and giraffes lock their knee joints to prevent themselves from falling over while sleeping. They are also evolved to be very efficient fliers both physiologically and physically. Combine that with their ability to sleep intermittently and you have a bird that can fly on and on without stopping !\n\nCheck out other birds like arctic terns too! They fly from the north to the South Pole and back every year.",
            "title_similarity": "0.5970003"
        },
        {
            "id": "gxm29yb",
            "score": 1,
            "text": "Can I piggy back your question to ask if birds actually fly internationally or cross hemispheres?\nHow far do they actually fly?\nDo birds (the ones that fly over oceans) stay locally to their continent or do they actually fly Mr worldwide style?\nIf they stay locally, why is that? Why not fly to other countries?",
            "title_similarity": "0.7163801"
        },
        {
            "id": "gxnlhw0",
            "score": 1,
            "text": "Mel Brooks?  I just flew in from Cleveland, boy are my arms tired!",
            "title_similarity": "0.46839613"
        },
        {
            "id": "gxoe2si",
            "score": 1,
            "text": "The [Wandering Albatross ](https://www.smithsonianmag.com/science-nature/the-amazing-albatrosses-162515529/) and the other albatrosses are the true badasses in this category. After fledging they spend the first 6 years of their life on the wing at sea.",
            "title_similarity": "0.6546649"
        },
        {
            "id": "gxs4mjg",
            "score": 1,
            "text": "When offshore in a boat in the fog I've seen them land on the boat many times.  They usually hang out until there's a break in the fog or we get close to land or an island.  My guess is they try to stay close enough to land so they can rest when they're tired or sea faring birds will sit together in the ocean as one huge group or \"raft\" as I've always heard them referred as.  I've seen a seagull eat a tired chickadee that fell into the water after finding refuge on our boat for 10 minutes or so. He didn't quite have the energy and got a little too close.  It only took 10 seconds for a gull to swallow it whole.",
            "title_similarity": "0.6668197"
        },
        {
            "id": "gy2psg6",
            "score": 1,
            "text": "Imagine your captain trying to sleep with 1 half of his brain while piloting your Boeing flight.",
            "title_similarity": "0.61479485"
        },
        {
            "id": "h09j1tx",
            "score": 1,
            "text": "From what I’ve read part of our brains sleep while we’re awake too. It apparently often happens when driving. That’s why you sometimes have no idea how you got from point A to point B without crashing when you were off “day dreaming”.",
            "title_similarity": "0.44487363"
        }
    ]
}