{
    "ELI5: I’m told skin-to-skin contact leads to healthier babies, stronger romantic relationshipd, etc. but how does our skin know it’s touching someone else’s skin (as opposed to, say, leather)?\n": [
        {
            "id": "gz8awjt",
            "score": 1,
            "text": "Hi everyone, \r  \n\n\nUnfortunately, due to the large influx of rule-breaking comments on this post, the post will now be locked. These rule-breaking comments include violations of Rules 3 and 4, with a majority being jokes or low-effort replies. \r  \n\n\nNobody likes a locked post, especially one so popular. To those who engaged in good faith and respected the rules, we appreciate you. If you came to this post from r/all, please take the time to read the sub rules before posting or commenting, as it helps the community maintain the high standard of excellent content we are known for.",
            "title_similarity": "0.43291867"
        },
        {
            "id": "gz5u95g",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz5v8g5",
            "score": 3,
            "text": "It is my understanding that babies that are still very young (neonates being less than a month old, infants being less than a year) will sleep better and develop stronger because skin-to-skin contact will mimic the womb, which is the environment the baby has known throughout development as a fetus. I am not a doctor, or a medical professional, so please don't take what I say to heart as this is only something I've been told.\n\n&#x200B;\n\nFor the mother, skin-to-skin will help release hormones that will aid in a \"let down\", which is where the milk will flow easier and quicker from the breast.  It's also generally just a bonding experience and so a baby that feels free of stress will be doing better in  just about every aspect. My wife told me this just know: while I write this she's feeding our 4 month old girl. My baby is large for her age, has a full head of hair, and has incredible muscle tone. Yeah, that's a flex, but I attribute her great health to the love we give her. I make sure my child smiles and I hold her constantly.",
            "title_similarity": "0.7262186"
        },
        {
            "id": "gz5uezt",
            "score": 137,
            "text": "Any time a creature is within close proximity to another living being it will produce oxytocin, more so with same species. Also reduces cortisol levels in humans.\n\nSo our bodies reward being next to life. Leather or a dead body won't generate the same response because the signs of life aren't there. Warmth, movement of breath, heartbeat, etc. \n\nOur skin can pick up a lot of signals our conscious minds don't read. our bodies absorb all sorts of data filtered by the brain. It knows if its live skin versus leather.\n\nEdit: changed increases to reduces. bit of a typo there. Also, first paragraph is easily found data that was already assumed in the question. The rest is my personal analysis of data, drawing from acquired knowledge and experience.",
            "title_similarity": "0.7154552"
        },
        {
            "id": "gz5x483",
            "score": 0,
            "text": "Your body isn't a bunch of independant structures just working together. Your nerves sense things and your brain interprets the data. You can pretty easily tell the difference between skin and leather just by touching it, but even a more realistic analog wouldn't trick you as you can probably tell it isn't a part of a live human through sight or smell. It's probably possible to trick your brain into thinking you're touching skin when you aren't and that would very likely grant similar benefits. I don't think that's been invented yet, though. It wouldn't be enough to replicate the feeling of skin. You'd need to completely convince someone that they are touching a real person.",
            "title_similarity": "0.61159766"
        },
        {
            "id": "gz6dxxm",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz6oqvi",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz6u47x",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz72zlf",
            "score": 0,
            "text": "I was married for 19 years to a man who wasn’t particularly affectionate at the start and by the end, barely touched me at all. It was horrible to go without being touched; depressing, lonely, anxiety-producing, and a horrible, starved feeling. I get the science and I lived it - my marriage died and he was actually surprised when I told him it was over. And yes, I tried to talk to him about it many times. At the end, he had the nerve to ask me if I thought I was gay once AND he even asked for NSA sex before he moved out. I have no idea how I was dumb enough to marry him.",
            "title_similarity": "0.31115744"
        },
        {
            "id": "gz5vzl3",
            "score": 15,
            "text": "Your SKIN doesn't know anything. It's a sensory device. \n\nIt sends various sensory input to your brain, and your brain knows you're touching another human, and that's where the magic begins.\n\nAnd how does your brain know? Cuz it's a brain and it's smart.",
            "title_similarity": "0.48182654"
        },
        {
            "id": "gz5xaph",
            "score": 1,
            "text": "I learned long ago in some class and also in therapy that there is some kind of hormone that gets released when your partner touches you or snuggles with you. Same thing with when women breastfeed babies, hormones are released, and I’ve heard from some mother’s who breastfed that it helps with bonding with the baby and reduce post-partum depression. I could 100% be wrong and misheard or remembering the info wrong.",
            "title_similarity": "0.66063863"
        },
        {
            "id": "gz5xrt7",
            "score": -1,
            "text": "For babies in particular - the baby's saliva and the woman's nipple during breast feeding interact in such a way that allows the nutritional contents of the milk to change depending on the needs of the baby. In that sense, skin to skin contact does result in healthier babies.",
            "title_similarity": "0.816767"
        },
        {
            "id": "gz6s1ju",
            "score": -1,
            "text": "And have her skin tinted to look like?",
            "title_similarity": "0.48036963"
        },
        {
            "id": "gz5rmaj",
            "score": 122,
            "text": "It helps keep the baby warm and in a regulated temperature, to normalize breath, to soothes the baby, encourages milk production, leads to lower rates of hypoglycemia and stabilizes the baby´s vital signs this is caused by the release of oxytocin also known as the \"love hormone\" which make the mom warm and cozy providing the benefits mentioned above. Theres also other benefits for both the mom and baby that I didnt mention.",
            "title_similarity": "0.79939574"
        },
        {
            "id": "gz5vkwo",
            "score": 2,
            "text": "I think an important element is your consciousness.  Your mind can synthesize a lot of stimuli together, so the feel and warmth of the skin, the visual and audio cues of a loved one nearby, so the link is drawn and we know that's the skin of a loved one.  These stimuli are not processed in a vaccumn.  But to be clear this just an assumption, don't have any evidence to back it.",
            "title_similarity": "0.59758043"
        },
        {
            "id": "gz5wvcu",
            "score": -2,
            "text": "I have 2 daughters, our first daughter I did skin to skin quite often, my husband did not (dont blame him its not expected of new dads like it is moms) and as my daughter got older we realized that my husband could never comfort her but I had no issue with it. \n\nWith our second daughter my husband did a shit ton of skin to skin from the moment she was born. And now she is 6 months old and feels just as secure we dad as she does me. \n\nSkin to skin is legit and needs to happen with both parents. It creates a bond between parent and child.",
            "title_similarity": "0.5215856"
        },
        {
            "id": "gz5x2ng",
            "score": 2,
            "text": "I did skin-to-skin contact with my son when he was born. He's not much of a big cuddler now, but it was probably the best time at that moment, and shit we got connected. I don't know if he felt it, but I did. \n\nBasically it's not just skin, but breathing in the same motion, your temperature soothes the kid, and your heartbeat can be felt too.",
            "title_similarity": "0.7299223"
        },
        {
            "id": "gz5y1ub",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz5yjz3",
            "score": 2,
            "text": "A lot of people here focus on the babies contact, however children and adults as well react to the feel of human skin. \n\nI mean who here doesn’t love the feel of the skin of your lover? Does the joy of that feeling not still give you warmth and make life a bit nicer? \n\nThe need for skin-to-skin touch is lifelong",
            "title_similarity": "0.77071977"
        },
        {
            "id": "gz5ytls",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz6h1ix",
            "score": 2,
            "text": "In addition to what some others have said - there's a big difference between active touch and passive contact. \n\nThis if for instance why you can't tickle yourself - your brain is anticipating the sensory stimulation and it's no longer surprising.",
            "title_similarity": "0.6694712"
        },
        {
            "id": "gz6pyg0",
            "score": -2,
            "text": "It’s ok to say “skin to skin contact with my baby creates a special bond” but it’s not ok to say “I like touching babies” jk lol",
            "title_similarity": "0.7877786"
        },
        {
            "id": "gz70c6i",
            "score": -2,
            "text": "Is not skin. Is the passion trigger by affection while having sex or making love with the person you are attractive to. Is more that just the sex is the touching, kissing even the way you look At each other which sometimes leave you wanting more. Also the scent has a lot to do with it. On the religious side of it god has not punished any couple for having sex or the touching of their skin. Is the intentions that goes behind having sex. So go try, and put passion in it, you may want to try to go down the more passion you put In it the better the baby will come.",
            "title_similarity": "0.70521784"
        },
        {
            "id": "gz60x52",
            "score": 3,
            "text": "Our bodies are completely unaware that it's 2021 and there are no predators lurking around. \nBabies are essentially still prehistoric, let me explain.\nRight after birth, skin to skin contact helps babies regulate temperature and breathing rhythm by copying mom. We exchange good bacteria through skin to skin, cuddles and kisses and since the first bond we experience is parent-child, we replicate these behaviors in our other relationships down the line because when we did as babies we felt safe and loved. Those evolutionary reflexes also could explain why babies tend to sleep more during the day, to allow mom to gather food without drawing attention to themselves. Babies will require more night feedings, as mom and baby had likely found shelter at night. Their little bodies are hardwired to feel safe while there is movement because as long as they're being carried by mom, they are safe (it also explains why we deposit babies in cribs like they're made of nitroglycerin).",
            "title_similarity": "0.66060305"
        },
        {
            "id": "gz69je8",
            "score": -3,
            "text": "Add on to that, that we can sense energy. A couch doesn't give energy. Loved ones, pets etc do. I'm sure y'all have felt uneasy around someone, or in a room, or situation. Just as you've had an instant bond with someone, be it sexually or just an instant friend feeling. I feel that this goes a long way towards this.",
            "title_similarity": "0.44151938"
        },
        {
            "id": "gz5tu0d",
            "score": 469,
            "text": "We don't know. But many things like smell, temperature, and sounds of your heart appease the baby. Does it have a long term effect ? Surely, but to what proportion ? We don't know.\n\nIMO the data is biased because people who do skin-to-skin contact are people who care about their babies more than people who don't do it. People who care more about their kids lead to healthier development for those kids, statistically. So I think those kids have a healthier life because their parents care more about them, not because they had skin-to-skin contact when they where born.",
            "title_similarity": "0.8411573"
        },
        {
            "id": "gz5t822",
            "score": 42,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz6lxrx",
            "score": 3,
            "text": "There was a study in the past with caged monkey.  There was a wire money that can be triggered to give food and a  soft furry monkey that didn't provide food. The monkeys would quickly get food from the wire monkey and hang out and cuddle with the furry monkey most of the time. This shows the importance of touch and nurture for humans some animals.",
            "title_similarity": "0.40619722"
        },
        {
            "id": "gz5vecp",
            "score": 731,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz7fzpv",
            "score": 7,
            "text": "There's this interesting irony that we think of a \"holistic\" \"mind affects body, body affects mind\" attitude as the woo woo spiritualistic point of view, when really, the notion of the body as a dumb machine and the mind as something completely separate sounds a lot more supernatural to me.\n\nOur central nervous systems assemble multi-sensory summaries below the level of conscious awareness or control. Have you ever seen those clips of a person speaking with one audio track, and then another, and their lips seem to almost miraculously sync up with either track? This is because we're never conscious of our raw sensory input, it's 90% interpretation by the time it reaches the conscious level. Reasoning mostly informs how we *interpret* these blobs of information, not so much how they're assembled.\n\nSo yes, we don't have an explicit \"other person's skin\" sensor, but even as babies we instinctually assemble impressions from scent, sight, hearing, and touch that makes us deeply aware of the presence of another person. It's not infallible, but there are a lot of things that even a baby's brain uses to tell they're being held by a person instead of lying on a warm leather coat.\n\nIf you're interested in a book that touches on these kinds of subjects, on a level in between ELI5 and Ask-Science, I really liked How Emotions Are Made by Dr Lisa Feldman Barrett.",
            "title_similarity": "0.5527209"
        },
        {
            "id": "gz690rw",
            "score": 9,
            "text": "It's not what your skin knows, it's what _you_ know.  Even an infant human has quite a lot of brain, and you don't actually have to be that intelligent to be able to instinctively distinguish being held by another person skin to skin from being placed on a leather surface.  It's not merely about texture or whatever, it's about sound, smell, and especially all the little behavioral cues that get passed between a baby and someone holding it.",
            "title_similarity": "0.54108274"
        },
        {
            "id": "gz7hq2v",
            "score": 119,
            "text": "I witnessed this first hand.\n\nMy daughter was born 8 weeks premature, she lived in an incubator for the first 3 weeks of her life\n\nWife was really struggling to express breast milk manually or with a pump, we had to feed baby through a pipe up her nose. we couldn't touch her for the first few days it was awful. Seeing wife being hard on herself a d feeling like she was a failure because she couldn't express milk.\n\nAt the end of the first week the docs said we could hold her for a few moments and they suggested mum does skin on skin contact with her. They placed baby on my wife's chest, baby was all but naked (except for diaper) wife was bra-less. I'm telling you hand on heart it was the most magical thing I've ever seen. Baby immediately started \"nuzzling\" looking for boob/nipple. Mum gave it to her, she tried, wasn't very successful but still it helped.\n\nFast forward to next day, my wife's boobs were literally leaking milk, like her tops and bras were soiled with breast milk. Expressing was now effortless and baby was now getting enough milk to satisfy her and she made fantastic progress.\n\nThe docs said skin on skin triggered a hormone in mum and caused her to produce milk in larger quantities.\n\nSo yes, I 100% believe it's a thing.",
            "title_similarity": "0.34668177"
        },
        {
            "id": "gz5ttpp",
            "score": 1558,
            "text": "Just echo here what others have said about the benefits, but also:\n\nSkin and leather are very different. The skin of another person is often warmer than leather (if your couch is warmer than your SO, you may have a problem), has a much higher moisture content, and has an elasticity, softness, and shape not typically found in leather goods.",
            "title_similarity": "0.72057164"
        },
        {
            "id": "gz7f45h",
            "score": 38,
            "text": "I've read the top comments and seems this is unproven but plausible... I'm a dad and when my two sons were born I did skin to skin with them. It felt kind of stupid, there are people coming in and out of the room all the time, I had no idea if it was doing anything...  But if we have another kid and there's a 0.0000001% chance me doing skin to skin will have some benefit I'll stop wearing any clothing on my upper body right now if I have to. \n\nThere's no downside. At worst I look like a bit of an idiot. I'll take that.",
            "title_similarity": "0.5124465"
        },
        {
            "id": "gz5ws6g",
            "score": 4104,
            "text": "Taken from a psychology standpoint, it could have nothing to do with the fact that it is just \"skin\", but more to the point that close physical contact with people you care about nourishes a more accepting and mentally healthy environment. Albert Einstein was quoted as saying \"The single most important decision any of us will ever make is whether or not to believe the universe is friendly.\" This one small distinction made early on plays a major role in how we take in and interpret information from the world around us. What chemicals are released in the brain during close physical contact with loved ones. Just physiologically, hugging someone and other forms of nonsexual touching cause your brain to release oxytocin, known as the \"bonding hormone\". This stimulates the release of other feel-good hormones, such as dopamine and serotonin, while reducing stress hormones, such as cortisol and norepinephrine. All that being said, this may explain why it does feel so good to sit on a leather couch. Subconsciously triggering chemicals related to those mentioned above.",
            "title_similarity": "0.65337366"
        },
        {
            "id": "gz60j04",
            "score": 64,
            "text": "I find this thread fascinating. I was adopted as a baby, and was premature so spent the first 3 months of my life in an incubator with basically zero human contact (the tech for preemies was pretty rudimentary back then, and they didn’t have baby hugging volunteers like they have now). I have an extremely hard time with touch/romantic relationships (I’m in a long term relationship but have never been touchy-feely at all, which others find weird for a woman…). So I’d love to see some peer-reviewed studies that may explain if there’s any connection here or if it’s pure coincidence.",
            "title_similarity": "0.4575919"
        },
        {
            "id": "gz5z2kb",
            "score": 5763,
            "text": "Others in this thread have mentioned how difficult it is to prove the healthier babies/ stronger relationship aspect of the question. \n\nBut -  your skin **can** tell if it's touching someone else's skin. There are an entire class of sensory receptors in the skin that respond best to soft pressure, **skin temperature**, slow movement touch - essentially being stroked (called Low Threshold Mechanoreceptors) \n\nTo be a bit un-ELI5 this is called affective touch and neuroscientists are only recently discovering its receptors and pathways in the nervous system. The theory goes that if the body can discriminate human contact using these receptors, it can then release the chemical oxytocin to re-enforce that personal relationship. e.g. between a new-born child and the mother holding it.  \n\nhttps://www.sciencedirect.com/science/article/pii/S0896627314003870",
            "title_similarity": "0.7923354"
        },
        {
            "id": "gz5y2ql",
            "score": 1,
            "text": "Also bodies secrete chemicals and pheromones that will transfer on touch. We subconsciously pick these up and they can have a calming effect if we smell familiar chems. \n\nThere's a theory that the handshake was a biological response to exchange these pheromones, and there's proof that people will subconsciously smell where they have been touched by others.\n\nEdit: if you're interrested to learn more, I think the most recent Nouch Thing as A Fish has a guest anthropologist who talks about it.",
            "title_similarity": "0.63703024"
        },
        {
            "id": "gz5yf33",
            "score": 1,
            "text": "I learned about the Harlow experiments at college and it touches on exactly the question you ask. It’s interesting how scientists can ask questions like this, come up with ideas, and then experimentally test those ideas. It’s most interesting to the question you asked regarding mothers and skin contact and you nay have heard reference to his famous experiments. His experiments I’m sure are a great starting point for further and current science on the question you asked regarding mothers and skin contact and it’s just an overall interesting read https://en.m.wikipedia.org/wiki/Harry_Harlow\n\nhttps://en.m.wikipedia.org/wiki/Harry_Harlow",
            "title_similarity": "0.57701707"
        },
        {
            "id": "gz5yx9c",
            "score": 1,
            "text": "There are probably so many cool reasons why contact with others is an important part of our early development, the social stuff, the micro biomes etc. As to how our skin \"knows\" its touching leather, my guess is that apart from texture, theres an actual electric charge our hearts create, so maybe its a conductivity thing? \n\nI like the idea that we all could create some sort of magnetic field, and that we potentially benefit each other with a literal physical presence.",
            "title_similarity": "0.68875635"
        },
        {
            "id": "gz5zumk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz5zxwm",
            "score": 1,
            "text": "There are many sensory cues involved here: touch, warmth, smell, vision, plus probably some we do not fully understand like the microbiome — all this interacts with our brain and endocrine system. The most famous hormone involved is oxytocin — it especially gets released from nipple suckling and facilitates infraspecific bonding aka love!",
            "title_similarity": "0.6836835"
        },
        {
            "id": "gz60hmo",
            "score": 1,
            "text": "In addition to all the excellent answers here, don't forget it isn't just your skin that \"knows\" it's touching someone else's skin, you also know -as in your conscious self - knows your skin is touching someone else's skin.",
            "title_similarity": "0.6176293"
        },
        {
            "id": "gz60lg2",
            "score": 2,
            "text": "Boobs-soft and warm and the original source of life...are comforting to my basic instincts. Aereolas are the first colored object a baby recognizes. A day old baby will instinctually wiggle up a mama’s belly and find the dark spot...Instinct that there is food there. \n\nLeather, a dead cow, not so much. \n\nI think we are much more primarily motivated than we think. Outdoors are proven to improve depression, lower blood pressure. It is where we came from. A fish tank in your living room is also shown to improve mental health and health indicators.",
            "title_similarity": "0.6979358"
        },
        {
            "id": "gz61mqe",
            "score": 3,
            "text": "I’ve been sleeping in our other bed cause the dogs take up too much space for me honestly. But I went and slept in the same bed as my gf about month after and literally felt a bonding chemical being released it was weird, and woke up happy and feeling good. From 1 night of cuddling and sleeping, crazy. Fucking dogs haha",
            "title_similarity": "0.41468078"
        },
        {
            "id": "gz62enh",
            "score": 1,
            "text": "I think the “knowing” is more subtle than actual touch; rather, it is energy exchange that creates the benefits. Quantum Physics has revealed that there is no difference between matter and energy, so we know that energy is really all there is! Touch is an physical sensation that helps us organize how to get the benefits, but it isn’t actually the touch that create the benefits - it is human energy exchange. This explains why touching a piece of leather won’t have the same benefits - it lacks the same energies that a human emits. \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6396053/",
            "title_similarity": "0.58170724"
        },
        {
            "id": "gz62fi2",
            "score": 1,
            "text": "I know that the mortality rate of babies goes way down without actual nurturing, the species doesn't matter either. There have been cases where babies that are basically on the verge of death make dramatic recoveries once something warm and caring is there on a regular basis even if everything else is essentially the same. I'm not sure why it is exactly, but it could be a form of anxiety that is soothed by the touch of another person. This effect happens cross species as well, like an abandoned kitten sitting in a kennel sick can start doing tremendously better once some motherly tenderness is given other than a robo feeding arm.",
            "title_similarity": "0.65545094"
        },
        {
            "id": "gz65s96",
            "score": 1,
            "text": "Eh, the conclusions you’re mentioning are way beyond the scope of any study that has been done to say that there is a causal relationship. \n\nGenerally, skin to skin early on when the baby is just born helps the baby regulate temperature and other physiologic functions. \n\nGenerally, skin to skin also promotes the release of hormones and chemicals, especially oxytocin which leads to the formation of stronger bonds and “love”\n\nAlso, like others have mentioned, the micro biome and sharing of bacteria and other microbes can be helpful for mom and baby. \n\nAll that being said, skin to skin isn’t some magical thing that makes your baby better than a baby that wasn’t skin to skin. In terms of long term outcomes, it probably doesn’t do anything like make romantic relationships stronger. Unfortunately with something like that, there’s just a million confounding factors that make it hard to study such conclusions.",
            "title_similarity": "0.7463167"
        },
        {
            "id": "gz6b59s",
            "score": 2,
            "text": "Warmth and psychology. For warmth, that's mildly obvious. Interesting side fact, lonely people statistically use hot showers longer. Temperature has some sort of effect on mental coping/health.\n\nFor psychology, it's probably a combo of human interaction (much like having limited contact for long-distance relationships), pheromones, microbiomes when sharing bacteria (which is typically a healthy thing, see kissing to share bacteria), and also a good majority of cultural/social norms where physical contact is common the closer people are to each other. \n\nAnd, finally, if you're close enough for physical contact AND familiar with that person to feel comfortable for consistent and frequent physical contact, it's probably a healthy relationship with not much distrust. Could be the reverse, where physical contact happens more if you have good mental health, rather than the other way around.",
            "title_similarity": "0.6790731"
        },
        {
            "id": "gz6bt1p",
            "score": 2,
            "text": "Well leather won't be as warm but from what I've read there's some physical stuff going on like transfer of bacteria and other things that live on the mothers skin to the baby. It also may have a larger mental effect as being cared for /held is comforting.\n\nChildren, even babies need comfort and social interaction to develop properly. There is a video showing very young children who are normal vs neglected. The difference in behaviour is shocking and quite sad to think they're so small and already the damage is done.\n\nThe main difference :\n\nHealthy baby given blocks, they focus on them entirely. They play and touch them, put them in thier mouths, etc. Exploring the way they do with the new thing.\n\nNeglected babies given blocks. They may start to touch them but are clearly not too invested in it. They look more to the people watching them and forget about the blocks. They then start to twitch nervously and breathe heavily as anxiety rises.",
            "title_similarity": "0.7065419"
        },
        {
            "id": "gz6buwd",
            "score": 1,
            "text": "When you’re touch by someone, rather than something, your brain knows the difference because it’s like: “woah! This is a person! It chose me! I must be pretty sweet!” Then it sends some signals and a couple hormones and your body’s like...cool bruh...you do you! Grow!",
            "title_similarity": "0.7332457"
        },
        {
            "id": "gz6c4lk",
            "score": 1,
            "text": "There’s nothing inorganic in this world that can mimic the feeling of skin. If there was certain toys would feel TOO realistic and a lot of us would probably never had been born if such toys existed.",
            "title_similarity": "0.4827099"
        },
        {
            "id": "gz6ezar",
            "score": 1,
            "text": "Greater intimacy, releases more \"feel good\" and \"feel love\" hormones.\n\nThese help with better romantic relationships (or even parent/child ones), and they also help you sleep better - which is the biggest factor for good health.\n\nSkin doesn't know it is touching someone else's skin, it's we who need to be aware at least subconsciously - but skin is very sensitive, and when we're touching someone's skin, it feels warm and unique - so it is very easy to notice.",
            "title_similarity": "0.8143972"
        },
        {
            "id": "gz6iuy3",
            "score": 1,
            "text": "there are also different chemicals released when interacting w different things. oxytocin in different amounts is released, along w serotonin when doing different pleasurable activities but as mentioned above, the intention of that interaction is very important. are you touching the leather as a sex or love thing? are you touching the person for affection? our skin has several different receptors in it that can distinguish between different objects. our brains then become aware of these differences and store them in our memories. then each time we engage w these things, a certain pathway is triggered (usually) and a certain set of neurotransmitters/hormones are released",
            "title_similarity": "0.6004604"
        },
        {
            "id": "gz6mzj8",
            "score": 1,
            "text": "Read no further! The answer to your question : \"how does our skin know it's touching someone else's skin\" is: \n(Drum roll, please) \nOur skin in connected to our brain, via nerve cells. Info travels from our skin, via our nerves to our brain. \nIf we were burned to a crisp, or paralyzed, we would loose our nerve connectors and not know what we were touching. \nBut, as anyone who has ever held another person naked can tell you, (and I have) the skin has A LOT to tell our brain about what it feels. \nThe robot may now close down this thread, the Q has been answered. \nThank you for playing!",
            "title_similarity": "0.5437058"
        },
        {
            "id": "gz6n6gg",
            "score": 3,
            "text": "There is a sense parallel to the basic touching sense, that tells our brain when we receive tender touching, like a hug or stroking. This can't be reproduced by touching yourself, but it can be simulated by machines. I reacts a lot to a specific range of pressure / speed of the touch and can then lead to the release of oxytocin - if the brain thinks the context is okay. A stranger on the street won't be able to give you an unexpexted dose of cuddly feels, as you'd probably just perceive him as a threat. \n\nSource: A recent German documentation, so I'm not sure if I should bother posting it here :D",
            "title_similarity": "0.55462945"
        },
        {
            "id": "gz6o4ql",
            "score": 1,
            "text": "Just wanted to add: A leather couch doesn't hug you back...normally. You can't feel the pulse of the leather couch or hear its heart beat when you lay your head against its furniture flesh...normally. When you lay on top of leather, couch or otherwise, you don't get lifted and lowered gently as it breathes underneath you...normally. Touch is a sense, it is a sense that senses temperature and pressure and the other things I'm forgetting about or nothing else if temperature and pressure together are all that's needed to explain what touch is a sensor of...normally.",
            "title_similarity": "0.44589952"
        },
        {
            "id": "gz6pr77",
            "score": 1,
            "text": "The physical contact itself raises the level of oxytocin in our brain, which is the chemical that makes us bond with other creatures. That's why we love to pet our companions so much, for example. Any contact with an entity that we want to bond with will have this effect on the hormones in our body.",
            "title_similarity": "0.6928823"
        },
        {
            "id": "gz6qbvj",
            "score": 1,
            "text": "I’ve scrolled way to far and shocked I haven’t seen the word “oxytocin” come up.  It’s probably been mentioned already but this is the key.  This is not a psychological situation but more of a biological one.  “Oxytocin” is a fight or flight hormone.  Cortisol is its opposite and cortisol triggers stress and a fight response to the environment.  Babies without touch grow up to be more anxious. It makes sense as an evolutionary response to not having protection.  Oxytocin is a calming and trusting type of hormon. This applies to the feeling we have with intimacy and trust/honesty that comes along with it.  Skin to skin helps create more oxytocin and long term brain development of oxytocin.  \n\nI do not know the mechanism within skin to skin that triggers it though.",
            "title_similarity": "0.6897155"
        },
        {
            "id": "gz6ss92",
            "score": 1,
            "text": "Minunderstanding. Non-psychologist here. But wild guess is that it is not the leather or skin. It something that includes\n\n* something that feels like skin of human being when touched\n\n* feeling of warmness\n\n* observation of pulse and breath if observed from right position\n\n* accompany of softly spoken words about love and understanding if touched gently\n\n* promise of repeated availability for touch if not touched badly\n\nThe feeling of being close to someone (father here, tried infants, big and small children, adults, baby animals, grown up animals, elderly) is a bit broader observation than just feeling the skin. Communication and trust might be something to consider also. \n\nVery young human beings not yet understanding spoken language already understand soft touch, tone of voice, repeated availability of closeness with someone else (sibling, mother, father, pet, whoever) especially if that is accompanied with peaceful environment, nutrition and understandable communication. My observations regarding communication with infants is that they very much respond to touch, facial expressions and spoken words. In very early age they can respond themshelves only using touch and facial expressions, words or something faintly resembling words comes only later - initially it is only giggling and crying depending on mood :) The touches and facial expressions given accompanied by spoken words help them in coupling words and tones of voice with their common meanings. I feel that learning to speak and understand others begins with learning how to touch, feel, smell and listen to other beings around you.  From day 0. \n\nMyself I'm an adult now, can listen and speak couple  of spoken and written languages ; have some kind of ability to consider intentions or trustworthiness of others and maybe understand the value of being able to be heard and understood myself and being able to discuss things with humans and animals around me. Still I very much value the skin-to-skin contact with my close beings. Communication by feeling the breath, pulse, warmth and touch of another living thing begins immediately after birth but at least for me has not ceased to be meaningful or important despite the fact that I've acquired other means of communication in addition to touch of skin. \n\nQuestion \"how contact leads to healthier babies\" I can't immediately answer but I can tell that lack of feeling of love, closeness or trust leads to babies being nervous, scared and fearful and stress caused by this leads finally to physical unhealthiness too. Human beings are complex compounds - I feel that fear prevents learning, learning is a must in order to survive in your environment and long-term fear makes you unable to understand your environment and therefore unable to make right decisions regarding things affecting your health, or health of others around you. This includes both health of your body and your mental health. \n\nTake care. Especially of your small ones.",
            "title_similarity": "0.7638357"
        },
        {
            "id": "gz6vae8",
            "score": 1,
            "text": "Not an exact answer but here's a [Psychological experiment done on monkeys](https://www.psychologicalscience.org/publications/observer/obsonline/harlows-classic-studies-revealed-the-importance-of-maternal-contact.html) that is related to your question. Harlow seperated infant monkeys from their mother and replaced it with 2 surrogates: One made of wood and one covered in cloth to simulate skin contact. The monkeys who had a cloth surrogate mother showed more normal signs of behaviour than the ones without skin contact.",
            "title_similarity": "0.53930056"
        },
        {
            "id": "gz6vwtv",
            "score": 1,
            "text": "They get to hear your heartbeat through your skin directly. They've heard mommy's from the inside for so long. We are animals and to raise one you must go to your roots of a being, raw unfiltered. Some mom's can't breast feed but still lay bare with their natural babes. It's the first sign of \"hey you're normal like me\".",
            "title_similarity": "0.5363375"
        },
        {
            "id": "gz6wn30",
            "score": 1,
            "text": "I'm not as smart as these people in here but all I remember is people saying our skin is considered an organ. Our mind can interact/control our organs like muscles. For ex. You can hold your breath in your lungs and have be exhale. \nMaybe it's the same as your mind can sense warmth and produce emotion which is positive in nature producing Chemicals in the mind that are healthy for a child or even people in general.",
            "title_similarity": "0.7653736"
        },
        {
            "id": "gz6wpy8",
            "score": 1,
            "text": "Your skin is connected to your brain, which uses signals from your senses (touch, smell, sight, and hearing) to know that you are touching a living person.",
            "title_similarity": "0.4001309"
        },
        {
            "id": "gz6ysk4",
            "score": 1,
            "text": "Does it maybe have something to do with bringing the baby back as close to your heartbeat as possible? After all it's just lost contact with all the familiar sounds and smells it's ever known?",
            "title_similarity": "0.6167624"
        },
        {
            "id": "gz71nkl",
            "score": 1,
            "text": "Bonding with my step daughter has been so much stronger when she hugs me and lays next to me etc. we have a great relationship and we do so much together, I just have never been a super physically intimate person. Opening up to her physically (welcoming hugs and snuggles) has truly helped us grow closer and this ELI5 makes so much sense. Yet as I write this she left without saying goodbye *eye roll*",
            "title_similarity": "0.6106452"
        },
        {
            "id": "gz72n97",
            "score": 2,
            "text": "Side question: why do I get an emotional boost when I hug my cat if I'm only touching his fur and not his skin?",
            "title_similarity": "0.4777478"
        },
        {
            "id": "gz72p0a",
            "score": 1,
            "text": "You have millions of nerve endings in your skin.  You feel the difference because the touch moves and stimulates differently.  Also, a very small amount of electrical current flows back and forth.  It’s uncommon to feel, so it cause the psychological reactions to any uncommon sensation.  For people receptive to the touch, this can build an emotional feeling of acceptance.  Many of us struggle with feeling accepted, so two people giving in to being accepted in a vulnerable manner is huge.",
            "title_similarity": "0.5665509"
        },
        {
            "id": "gz750u0",
            "score": 1,
            "text": "I’ll add in a bit of information that doesn’t directly answer your question about differentiating between skin and something else but in the Neonatal Intensive Care skin-to-skin, sometimes called kangaroo care, is extremely beneficial to neonates. In infants born extremely premature there is evidence that suggest that routine skin-to-skin results in better overall growth patterns, lower supplemental oxygen need, more regulated breathing patterns, and improved thermoregulation. Fascinating stuff and it can be scary for parents to hold their 1lb baby with a breathing tube and a central line but it’s so worth it for everyone.",
            "title_similarity": "0.7881216"
        },
        {
            "id": "gz76h5o",
            "score": 3,
            "text": "Something that I have not seen in this threat is the concept of epigenetics and how your experiences in life can literally alter your phenotype, that its, the expression of your genes.\n\nTo simplify, DNA in a cell is not coiled like it is when you think of a typical chromosome. It's relatively loose, but is given structure by proteins that it wraps around called histones. Now, for your DNA to be read and genes to be expressed, there needs to be room for the proteins and whatnot that do this to access the DNA physically.\n\nIf the DNA is too tightly wound around a histone, or some histones are clustered together, the DNA is not accessible. Different things can cause this, or undo it, but for the sake of simplicity all you need to know is that environmental factors can influence how your DNA is read, and what genes can be used. Think of it like a book, with some pages able to be read, and other pages are stuck together.\n\nHow this relates to your question is that there have been studies on the influence of parental contact on the DNA on mice. In mice with limited or no parental contact, the sections of their DNA that deal with stress relief and other factors were tightly wound, meaning the rats had a heightened stress response. \n\nMeanwhile in the ones given adequate parental contact, the DNA was looser, allowing the rats to have a healthier response to stress.\n\nIt's thought the same is true for humans, that is, parental contact is needed for healthy gene expression. So an abandoned child's DNA is altered in a way that negatively affects their development.\n\nHere's a good source for you, hope this explanation helped!\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4021821/",
            "title_similarity": "0.46582663"
        },
        {
            "id": "gz7c7ts",
            "score": 1,
            "text": "I'm just guessing based on what I've read about rearing babies via my interest in monkey behavior, but it's more likely to do with the emotional aspect of this than the physical. Physical intimacy breeds trust and tightens a bond. \n\nKind of a side info: I read a lot of research papers I find online and watch a lot of things on macaque monkeys. They are studied by various scientists because they can gain clues about human behavior from these monkeys and I've read a lot of fascinating stuff about the serious impact that small changes in rearing them can make on their behavior as they mature. \n\nI also watch a lot of video of these monkeys in a wild setting as well as videos of people who have them as pets (which monkeys absolutely should not be - I use an adblocker, so they're not making a penny from my viewing) and it gives you various perspectives on their normal / abnormal behaviors, along with the research papers. Anyways, it becomes extremely clear after only a very short time - I'd say around month, maybe even slightly less - which baby pet monkey is being given the **physical affection** that it needs. These monkeys, and I assume humans (would love someone to tell me if it's the same who is in the know) gain multiple things from the physical affection of their mother-figure that I am aware of: \n\n*Reassurance* - When the baby monkey tries something when they are just learning to jump and climb and they can't do it, they'll often fall over or get stuck somewhere and start crying and mom will come running and grab them or they'll run to mom themselves if they're able to (who is only a couple feet away at most at this young age in nature). You clearly see that the mother's physical affection in this moment provides a sense of reassurance and gives them the self-confidence to try and climb / jump from the object again...that they will be okay and that their mother is right there to help if they need it. \n\nYou'll see these pet monkeys who have good owners who provide this behave MUCH more independently and confidently. It's truly crazy how fast this kind of behavior can change when a person gets one of these babies and shows it this love. Those who don't provide this have monkeys that end up crying out all the time (while those given the affection make almost zero noise), can be very clingy when an infant, and then be very easily scared or intimidated when they get older. \n\n*Safety* - They can be absolutely terrified but if the mother is there allowing them to come up and cling to the mother will almost instantly begin to calm them and allow them to reassess the situation. This is similar to the reassurance, but that's more about self-confidence and this is more about a feeling of protection and safety from unknown or new things. Again, as with reassurance, those monkeys not provided this do not get the mental break the mother provides to calm down and reassess the situation from a place of safety so that they have the chance of becoming familiar with what's scaring them and can overcome it. They will be afraid constantly if not given this of even the most minor 'threats'. \n\n*Comfort* - This is pretty self-explanatory. It's a baby monkey's safe space and can be similar to the others listed above in some ways. Just like humans, they need someone to love them unconditionally...someone they can trust. This intimacy creates that feeling of trust and bonding that allows them to form such relationships later with others. \n\n\nBaby monkeys have a very strong instinct to cling to their mother-figure and just like with a human, the mother-figure provides them with a feeling of safety and comfort and reassurance with her physical touch. \n\n\nyou can tell which people have given the monkey the proper **physical** affection as a small baby \nues and watch a lot of various content on youtube about them and monkey (the outcomes are just easier to see and obviously faster to see birth to maturity) baby *seriously* screwed up by how you treat them as the mother figure. I've read a lot of papers about them, which studies them in various situations w/ their mother, take away from her, taken away then rejoined and on and on, as well as seen a lot of pet monkey videos and the same breed raised by their mother in the wild and the humans do not give the baby monkeys enough physical affection most of the time - because they're idiots and monkeys aren't pets they're extremely complicated and needy creatures just like we are - and it's so damn clear after just a few months which baby monkeys have been raised by a human that treats it more like it's real mother would and those that constantly put the baby monkey back onto the ground instead of allowing them to cling to them.",
            "title_similarity": "0.55629903"
        },
        {
            "id": "gz7fsdl",
            "score": 1,
            "text": "Oxytocin release, probably pheromones, and transfer of the mother’s micro biome to the kid. For example, kids who are born naturally have less allergies compared to a c section, due to picking bacteria as they leave the birth canal. Our skin is a host for billions of good bacteria",
            "title_similarity": "0.6990247"
        },
        {
            "id": "gz7fwz1",
            "score": 12,
            "text": "I don't care what anyone thinks about proving anything. After being diagnosed with an autoimmune disease it wasn't until I moved in with my fiance at the time and began sleeping next to him that I stopped having the majority of my symptoms. You will never convince me there isn't a link between touch and health including stress or just sleeping in the same close to another person you love even if there's not constant touch.\n\nThere has been a few incidents of newborn babies that were born premature and were said to die soon after birth that had one-on-one skin to skin time with their mom for hours and ended up living.\n\nJust like there isn't an exact science that got instinct you have on some things wrong with a loved one or yourself. That instinct that tells you do not go around that corner or do not go to the party that ends up being correct, there isn't an exact science to everything.",
            "title_similarity": "0.45426297"
        },
        {
            "id": "gz7nbe3",
            "score": 6,
            "text": "Warmth.\n\nWe've figured out how to simulate the effect, and we even sell it as pet toys with one idea taken from rumble strips in video game controllers, and combined with what's basically an electric blanket.  Heartbeat simulation from a warmed source imitates the effect, we use it for underage kittens when they have to be separated from their mothers.  I don't know if we use it for babies, if not, we should.\n\nThat said, it's still an imitation, but it seems to be good enough to provide some benefit.",
            "title_similarity": "0.6817219"
        },
        {
            "id": "gz7nmh7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        },
        {
            "id": "gz7wjjn",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.016879324"
        }
    ]
}