{
    "ELI5: why is it bad to swallow large amounts of your own blood?\nI was in a car accident as a kid and had to have my stomach pumped from swallowing a lot of my own blood. Why was this necessary?": [
        {
            "id": "gz9j5vz",
            "score": -172,
            "text": "[deleted]",
            "title_similarity": "0.10848683"
        },
        {
            "id": "gza95jb",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gz9vxwj",
            "score": -42,
            "text": "[removed]",
            "title_similarity": "0.052566726"
        },
        {
            "id": "gzb7qlo",
            "score": 2,
            "text": "Blood is a gastric irritant and can make you vomit. It's more likely that you'd just let it come out of your mouth rather than swallow it, just like spit. \n\nunless you had obvious orofacial injuries as well, they'd have been much more worried about internal bleeding. \n\nI'm an ER paramedic, and my preceptors still make fun of me for saying \" blah blah pump his/her stomach?\". \n\nI've virtually never seen it done, we use activated charcoal.",
            "title_similarity": "0.6986758"
        },
        {
            "id": "gza58fr",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gza2v17",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.10848683"
        },
        {
            "id": "gzahezp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzajru7",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzc5wlt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gz9j130",
            "score": -25,
            "text": "[deleted]",
            "title_similarity": "0.108486824"
        },
        {
            "id": "gzbukew",
            "score": 4,
            "text": "Because your stomach isn’t good at processing/digesting it.\n\nI used to suffer REALLY frequent and long nosebleeds as a kid. i was always told to tilt my head back too. One time when my nose was really playing up for a few days, I had had my head tilted back for so long whilst I was bleeding that apparently a LOT of blood had entered my stomach. \n\nThat was the one and only time I have ever projectile vomited. This large volume of mixed blood and stomach acid came flying out of my mouth at least a couple feet. Like a friggin laser beam. All I could taste was acidic iron. I felt great after though, as my stomach was completely fucked leading up to that moment. The feeling of so much liquid rushing out of my stomach so quickly was not nice though. \n\nI sometimes still get nosebleeds, but I always remember to tilt forwards instead of backwards now, hahaha. Actually helps the bleeding to stop sooner too.",
            "title_similarity": "0.8035773"
        },
        {
            "id": "gzbh69f",
            "score": -5,
            "text": "Most of the stuff in your blood is an irritant while in your stomach. Not necessarily toxic, but it's just like having internal bleeding everywhere else. It will directly irritate any exposed membrane it comes into continuous contact with. As a paramedic, blood in your stomach is only a concern if you're bleeding internally, or if you've been in a trauma. \n\nTo everyone saying it's dumb to think iron can be toxic in your stomach when it's coming from your blood, we also produce formeldehyde as a PH buffer. Go ahead and drink formaldehyde. I don't claim to understand all of this perfectly, or even mostly. There is a reason medicine is a practice. It's been developing since it was born.",
            "title_similarity": "0.679605"
        },
        {
            "id": "gzbxf15",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzc6581",
            "score": 2,
            "text": "To the doctors: isn't blood an emetic, that's why (aside of the iron) it's not a good idea to drink a lot of it?",
            "title_similarity": "0.58007985"
        },
        {
            "id": "gzacb43",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzb6zry",
            "score": -3,
            "text": "I know other, much more qualified people have already answered but to put things simply-\n\n1. You don't want to be bleeding in general.\n\n2. Slight internal bleeding as others have mentioned is expecially dangerous because unless you cough it up or shit it out you'll probably never notice it and just continue to bleed. Maybe you'll even overstrain the organ somehow and it'll burst.\n\nI'm not a doctor but I think these two points are pretty good.",
            "title_similarity": "0.6340799"
        },
        {
            "id": "gza6ykj",
            "score": 42,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzbdpm4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzd0czt",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.108486824"
        },
        {
            "id": "gzd66ka",
            "score": 0,
            "text": "Because it's not very good that your blood was in your stomach, it's supposed to be in veins and your heart and capillaries and stuff.\n\nStomach no good, veins good",
            "title_similarity": "0.67465925"
        },
        {
            "id": "gzdaare",
            "score": 0,
            "text": "If you swallow enough of your own blood, you won’t have enough left in your body. Simplest answer possible",
            "title_similarity": "0.52119374"
        },
        {
            "id": "gza37so",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzbdvqq",
            "score": 49,
            "text": "Honestly, the most real reason is because blood in the stomach (assuming you drink it???) makes people nauseous and vomit.  Vomiting is not good because it increases the risk of aspiration.  \n\nLots of people swallow blood from things like nosebleeds.  It's no big deal other than it can make them nauseous.\n\nI have been an Emergency Medicine physician at multiple hospitals within the US for the last 12 years.  Trauma level 1 and 2, Peds/Non-Peds, etc.  I have NEVER EVER had to \"pump someone's stomach\" for a trauma.  This is just NOT DONE in modern Emergency Medicine.  \n\n(I have intubated innumerable trauma (and non-trauma) patients and all of them get an OG tube post-intubation.  This is normal post-intubation protocol to prevent aspiration.  This could be what you are referring to, but may have understood incorrectly to be \"stomach pumped\".)\n\nI have only \"pumped a stomach\" one time in these last 12 years.  Massive + verified TCA overdose within 1h prior to arrival.  That's the ONLY case.",
            "title_similarity": "0.75666076"
        },
        {
            "id": "gzcbgw3",
            "score": -7,
            "text": "How the fuck can the main thing that pumps through your body be toxic to you...?\n\nI know jack shit about medical...but even THAT is an easy leap of logic to make.. Who the fuck dropped these kids on their heads as a baby....repeatedly?",
            "title_similarity": "0.7275393"
        },
        {
            "id": "gzcbqyp",
            "score": -1,
            "text": "I am not a doctor, but i would like to add its also harmful to swallow large amounts of other people's blood too. Just in case you were wondering.",
            "title_similarity": "0.6538005"
        },
        {
            "id": "gzcczrh",
            "score": -1,
            "text": "Bad you say? Hmmmm...",
            "title_similarity": "0.2271883"
        },
        {
            "id": "gz9ivif",
            "score": -307,
            "text": "Because blood contains iron that is toxic to the human body in large doses, affecting the nervous system, liver, and brain. In small doses, like with the poison alcohol for example, you can process iron pretty safely. \n\nAs you were a child and they were unaware of the amount of blood you had swallowed, the precautionary action of pumping your stomach, could have saved you from death.",
            "title_similarity": "0.67412126"
        },
        {
            "id": "gza1hgj",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzcfs47",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzads7m",
            "score": 304,
            "text": "Update:\nHoly shit this blew up. Big thank you to the actual doctors in here clarifying things for me. Really appreciate the time!",
            "title_similarity": "0.36768112"
        },
        {
            "id": "gz9kuvj",
            "score": 60,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzax7l7",
            "score": 71,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gz9ydi2",
            "score": -23,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gz9w2rn",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzb96dr",
            "score": -14,
            "text": "You shouldn’t consume blood in large quantities either either. I.e more than a table spoon of that. \n\nOur digestive organs are not capable of safely processing blood (liquid rich in metal). The negative repercussions’ effects range from our liver to our kidneys — terrible health consequences. \n\nSource: Article on why trying to be a vampire might not work out too well.",
            "title_similarity": "0.7295455"
        },
        {
            "id": "gzbn3he",
            "score": 56,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gzc40z5",
            "score": 51,
            "text": "As someone who just 2 weeks ago went through Maxofacial Surgery that went well beyond the predicted 4-6 hours I can confirm that blood in your stomach alone won't get your stomach pumped. I was under anesthesia for almost 9 hours and when I came to I was extremely thirsty despite the I.V. I was hooked up to. My wife gave me a syringe full of water, which is not a lot, but as soon as it hit my stomach the hospital room turned into what I can only describe as a murder scene. I had about 5 seconds of warning to tell the nurse I was going to be sick, which was odd for the little amount of water I had drank and being fasted for almost 48 hours. The nurse was scrambling for a trash can when I started exorcist vomiting all over myself (mouth wired shut), the floor, and anyone that was within 5 feet of me...it was all blood that had ran into my stomach during the surgery.",
            "title_similarity": "0.6737822"
        },
        {
            "id": "gz9j28n",
            "score": 2908,
            "text": "A) You don't want to add vomiting on top of all the other shit going down. Having a whole heap of blood in your stomach irritates it and makes it more likely.\nB) You want to know if bleeding is from the stomach or somewhere else if you do throw up. If there's a whole heap of blood from somewhere else you it's hard to tell if there's GI bleeding and that's something doctors really need to know.",
            "title_similarity": "0.72240245"
        },
        {
            "id": "gzadquw",
            "score": 120,
            "text": "[removed]",
            "title_similarity": "0.052566655"
        },
        {
            "id": "gz9zwhu",
            "score": 26908,
            "text": "Doctor here, many people are confidently wrong in this thread. Real reasons are :\n\n1) Blood in stomach or vomiting blood doesn’t necessarily mean you swallowed it. It can be your digestive tract bleeding, which would be absolute top priority to rule out or treat. Clearing it is a necessary step to check it with endoscopy (camera probe) if need be. \n\n2) Full stomach is a vomiting and aspiration (choking) risk in a trauma patient, and an anesthesia risk for the same reason. Emptying stomach protects airways and makes an eventual emergency surgery easier and safer. \n\nAll the comments about iron toxicity are completely absurd. \n\nPeople with any kind of digestive bleeding end up *severely iron DEFICIENT* since the GI tract can only absorb a small % of the iron we eat, so you’d necessarily end up with less iron in you bloodstream at the end of the day. The amount needed to be toxic would require you to drink more blood than you’ll ever have, obviously killing you from blood loss in the process. \n\nAnd even self-inflicted iron toxicity was a thing, when a kid is wrecked and bleeding profusely from a car crash, it would be ridiculously insignificant in the list of things you’d have to take care of in emergency.",
            "title_similarity": "0.669409"
        },
        {
            "id": "gza2p9q",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052566726"
        },
        {
            "id": "gzah3po",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.052566726"
        },
        {
            "id": "gzaoqqf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052566726"
        },
        {
            "id": "gzau1q0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052566726"
        },
        {
            "id": "gzbsplf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052566726"
        },
        {
            "id": "gzcg7uv",
            "score": 8,
            "text": "Point of interest: in my culture in South Africa we steam cook blood from a slaughtered cow(around 2.5 liters maybe more) and eat it, similar to blood pudding without the cereal and fat or suet. I don't think swallowing large amounts of one's own blood would be dangerous but ey! I'm not a doctor.",
            "title_similarity": "0.6342102"
        },
        {
            "id": "gzd1s7g",
            "score": 6,
            "text": "Had an open wound in my throat after a mostly successful tonsillectomy. About 12 hours of bleeding into my stomach resulted in nausea, lots of vomiting and a unique texture to the vomit that many women (am cishet male) have likened to the tacky, partially clotted results of menstruation. Can honestly say that the whole fear of aspirating vomit is a whole lot more real when you’ve got a fairly long string of congealed blood going deep into your stomach that needs to be slowly pulled out for fear of choking.\n\nThat was 10 years ago and I haven’t been able to eat anything remotely organ-y since.",
            "title_similarity": "0.7830218"
        },
        {
            "id": "gzd35h5",
            "score": 1,
            "text": "i just drank a fifth of O+, dare me to drive?",
            "title_similarity": "0.56545836"
        },
        {
            "id": "gzd3hso",
            "score": 1,
            "text": "[You can swallow a pint of blood before you get sick.](https://www.youtube.com/watch?v=LYcNa2w-HYI)",
            "title_similarity": "0.54808605"
        },
        {
            "id": "gzd455n",
            "score": 1,
            "text": "Well they wouldn't want you to become a vampire, now would they?",
            "title_similarity": "0.4442706"
        },
        {
            "id": "gzd5xck",
            "score": 2,
            "text": "Wanna add my anecdote to all the qualified people answering. While I was recovering from wisdom tooth surgery, I started vomiting up blood in the middle of the night. This was concerning. Turns out it was just because blood from my mouth was being swallowed, and the stomach does not like having blood in it",
            "title_similarity": "0.79134846"
        }
    ]
}