{
    "ELI5: Why do \"red skies at morning\" mean it's going to storm later that day?\nThe old saying goes, \"Red sky at night, sailor's delight.  Red sky at morning, sailors take warning.\"  Red skies at dawn mean storms are coming.  Is that even true?  And if it is, how can red skies at morning bring storms, but red skies at night mean fine weather?": [
        {
            "id": "gznqmlt",
            "score": 1,
            "text": "Hi Everyone, thank you for coming.\n\nPlease read [**rule 3**](https://www.reddit.com/r/explainlikeimfive/about/rules) (and the rest really) before participating. This is a pretty strict sub, and we know that. Rule 3 covers four main things that are really relevant here:\n\n**No Joke Answers**\n\n**No Anecdotes**\n\n**No Off Topic comments**\n\n**No Links Without a Written Explanation**\n\nThis only applies at **top level**, your top level comment needs to be a direct explanation to the question in the title, child comments (comments that are replies to comments) are fair game so long as you don't break Rule 1 (Be Nice).\n\nI do hope you guys enjoy the sub and the post otherwise!\n\nIf you have questions you can let us know here or in modmail. If you have suggestions for the sub we also have r/IdeasForELI5 as basically our suggestions box.\n\nHappy commenting!",
            "title_similarity": "0.42987862"
        },
        {
            "id": "gzmwsma",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzmp7us",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzoof6j",
            "score": 2,
            "text": "So first off you need to know about light and its different wavelengths, im fairly sure red light has a longer wavelength while blue light is much shorter. \n\nWhen light shines through the atmosphere red light having a long wave can easily get past and around small particles without being deflected or blocked unlike blue light which gets filtered out by those fine particles.\n\nThe sun rises in the east and sets in the west which also drives the wind and weather systems as the sun heats the air and water. \n\nSo when the sun rises or sets most of the light is traveling all the way through the atmosphere, like instead of going top down the light is going side to side so it passes through much more of the atmosphere and any suspended particles will filter out blue light while allowing red light to pass right through and this mostly happens at sunrise or sunset when the light is going east/west instead of top down like at noon.\n\nSo thats the bit about the red skies (how/why the sky turns red) the red color is important because it means the air has lots of particulate which water vapor needs in order to condense. So if you see a red sky then whatever air that light is passing through will drop its moisture as soon as the relative humidity reaches 100%\n\nSo the next bit is about the timing, red sky at morning sailor take warning, this means if you see a red sky in the morning then not only is there going to be a storm but its going to be coming your way. \n\nYou can tell because the sun rises in the east and creates a heat/pressure front that pushes most weather systems to the west, so if you see a red sky at morning then your seeing the sunlight passing through the air to your east and you know there will be a storm to your east which will be pushed west so you will have to deal with it.\n\nIf you see a red sky at night sailor delight means that you see a potential storm (red sky) but since its night/sunset your seeing the light pass through the atmosphere to your west and the storm should continue further west.\n\nTl;dr:\n\nSo the red sky means a potential storm.\n\nAt morning or night tells you if the potential storm is to the east or west and that tells you if the storm is behind you or in front of you. \n\nThis isnt a perfect methodology for predicting storms/weather and its a bit outdated but its still pretty cool.",
            "title_similarity": "0.6512216"
        },
        {
            "id": "gzmxa41",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.082459375"
        },
        {
            "id": "gzpg4u1",
            "score": 3,
            "text": "According to LOTR red skies mean blood has been spilled this night, they said nothing about storms.",
            "title_similarity": "0.5561277"
        },
        {
            "id": "gzmx501",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzn0w4z",
            "score": 4,
            "text": "\"red skies\" means the morning or evening sun is lighting up clouds, and it's important where those clouds are in relationship to you, keeping in mind that weather patterns typically move from west (sunset) to east (sunrise). Very broadly speaking, bad weather (as in a frontal system) starts with high clouds and gets progressively lower as it gets closer. If the sun is rising to your east and lighting up high clouds above you, a front is coming. If you can see red light at all it means that the sky is pretty clear between you and the horizon. So if it's morning and red sky you know that the clear weather has already passed to your east, but the high clouds are an early sign of approaching bad weather from the west. Meanwhile if it's evening with a red sky you know the weather is clear all the way to the west, and that clear will be tomorrow's weather for you",
            "title_similarity": "0.80775386"
        },
        {
            "id": "gzn3mo7",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzmle04",
            "score": 92,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzmgdur",
            "score": 29,
            "text": "The Atlantic Ocean has the trade winds that blow from the east to the west. If clouds are coming (rain or a storm) the sky is red during the sunrise. Likewise, a red sunset means the storm is already past you. \n\nSo technically only accurate in the Atlantic or the the eastern Pacific.",
            "title_similarity": "0.8274244"
        },
        {
            "id": "gzmh6g7",
            "score": 230,
            "text": "[deleted]",
            "title_similarity": "0.082459375"
        },
        {
            "id": "gzmgzfz",
            "score": 13451,
            "text": "It has to do with the scattering of incoming solar radiation. It is called Rayleigh scattering. the way weather systems travel is from west to east. \n\nThe sun rises in the east and sets in the west. \nIncoming solar radiation deflected sideways at an angle. If that angle is high then it brings about blue skies and such. If there is a blue sunrise that, to me, as a weather forecaster tells me I have low pressure to my east. The storm has passed. \n\nAs a result of low pressure being to my east, I will have high pressure to my west. High pressure is associated with good weather and great conditions. The high pressure is to come and move over my station. \n\nHigh pressure brings about a low sun angle because it condenses the atmosphere. This low sun angle gives us our red sunrises and sunsets.\n\nEdit: This is more of a mid latitude United States phenomenon. I decided to give it another shot— see below👇\n\nSun rises in the east and sets in the west.  \n\nCool. \n\nIf at any point the sun rise or sun set is the color orange, red, or pink it can be inferred that the atmosphere is being condensed under the influence of high pressure. Because the sun is low in the sky and the atmosphere is condensed this is used to locate where high pressure is. Whether it is departing or arriving to you. \n\nOn the other hand, low pressure within the atmosphere allows it to expand. Therefore, wherever low pressure is located the sky at sun rise and sun set will not appear the colors aforementioned but will be your usual blue sky. This is due to the lack of condensation in the atmosphere. It allows the blue to be seen instead of the other colors on the visible spectrum. \n\nIn the mid latitudes (not the equator or the poles) between 60 degrees N and 30 degrees N there is the polar front jet (jet stream) that is high in the sky and it helps high pressure and low pressure move across mid latitudes in a west to east fashion as this is the only way the wind travels in the polar front jet. So this is the way low pressure systems (more commonly frontal boundaries) move with high pressure ahead and behind the fronts. \n\nWeather is fluid and ever changing. What one may understand may be understood differently by another.",
            "title_similarity": "0.71757334"
        },
        {
            "id": "gzmye0v",
            "score": 703,
            "text": "Sounds like this was answered well already but just to add...I was a weather forecaster for the Air Force for 6 years. We actually had a few lessons about tips and tricks that were true to forecast. Red sky was one, also leaves that are showing their underside mean it will rain soon, cricket chirp intervals are indicative of specific temp ranges etc. There were more, I just can't remember as this was over 10 years ago. I was blown away by how many of these \"tips\" I had heard prior to my experience forecasting actually being true. Science is some cool shit!",
            "title_similarity": "0.6396195"
        },
        {
            "id": "gzmw13t",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzmy5t0",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzn0t3f",
            "score": 4,
            "text": "When the sun is near the horizon, it tends to get redder. The trick with the phrase is to look to the opposite horizon. Just before the sun rises in the east, the reddish dawn light will illuminate high clouds to the *west*, indicative of a storm system which are traveling toward you (most weather travels west-to-east). The other half, \"red at night, [sailor's/shepherd's/camper's] delight\" has to do with the setting sun illuminating high clouds to the east which have passed, indicating that the stormy weather has concluded.",
            "title_similarity": "0.86863697"
        },
        {
            "id": "gzn1orq",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gznt27r",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzo2p0i",
            "score": 1,
            "text": "I've found this to be a more accurate prediction when I lived in the UK, and less so now I live in the US (Pennsylvania). Is there a reason for that? (Or just because it rains more in the UK, so higher chance of red skies = rain?)",
            "title_similarity": "0.62355554"
        },
        {
            "id": "gzooajb",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzp1u4w",
            "score": 2,
            "text": "As a human, kinda complied some comments::\n\nHere are some basic:\n1. High pressure are associated with good weather\n2. Weather moves from West to East (hence this saying only really works for northen hemisphere)\n3. The colour of sunrise will indicate what pressure system is on ur east, the colour of sunset will indicate pressure system is on ur west\n4. Raleigh Scattering determines the colour, has to do with density, high pressure equal red colour (see top comment)\n\nOkay, so with these points we can examine the saying. \nRed sunrise = high pressure on East, weather moves west to east, so the low pressure on ur west will move over u and cause bad weather\n\nRed sunset = higher pressure on west, weather moves west to east, the high pressure will move over u and cause good weather",
            "title_similarity": "0.7307545"
        },
        {
            "id": "gzp89ln",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05647481"
        },
        {
            "id": "gzqf0ku",
            "score": 1,
            "text": "It's in the Bible in Matthew 16:2-3 where Jesus says, \"When it is evening, you say, ‘It will be fair weather, for the sky is red.’ “And in the morning, ‘There will be a storm today, for the sky is red and threatening.’ Do you know how to discern the appearance of the sky, but cannot discern the signs of the times?\"\n\nNaturally speaking, when the sunset sky is red, that means the sunlight is traveling through a bunch of dust, which usually means high pressure and stable air coming from the west, so good weather.  But a red sky in the morning can mean that the high pressure area with stable weather has already passed to the east, and that there is high humidity in the atmosphere, increasing the chances that there will be \"bad\" weather.",
            "title_similarity": "0.8333691"
        },
        {
            "id": "gzqi5yz",
            "score": 3,
            "text": "Sailors delight??.. Shepard's delight",
            "title_similarity": "0.31536978"
        },
        {
            "id": "gzqit1c",
            "score": 1,
            "text": "Sailors?!??! It was the Shepards warning us!",
            "title_similarity": "0.5043508"
        }
    ]
}