{
    "ELI5 how do water wells work? Why did medieval people know where to build them or why they provided clean drinking water?\n": [
        {
            "id": "h06sfps",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h073ehu",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.072606295"
        },
        {
            "id": "h08kv6t",
            "score": 0,
            "text": "When I was young, my parents bought a property in the Mother Lode region of California. Lots of old gold mines. The minerals made well water especially delicious, but certain areas were very rocky so finding water was tricky. \n\nThey hired a dowser - an elderly man who made his living as a water witch to advise where they should have a well drilled. His method was to walk the land holding a branch shaped like a wishbone, one end in each hand & the point facing forward. Where water was present, the point of the stick would pull downward. Fascinating stuff for a little kid. The dowser identified 3 places best suited for drilling, even knew which was best.\n\nThat was over 50 years & 3 droughts ago. Even when many of our neighbors' wells ran dry, ours has never let us down.",
            "title_similarity": "0.55935603"
        },
        {
            "id": "h073hb3",
            "score": -6,
            "text": "Medieval? Lol hunny, it went bad to nearly pre-history. The water well was the gossip center of old towns a couple thousand years ago",
            "title_similarity": "0.43273127"
        },
        {
            "id": "h07qtrs",
            "score": 12,
            "text": "\"medieval people\" and people living 10.000 years ago were not the retard brutes you see in movies (at least not all of them, or not more than today).\n\nThey were crafty and wise people who could work and cope in life, probably more than any of us, who don't know how to make anything work and have to google the plumber's phone when the toilet breaks.",
            "title_similarity": "0.4755418"
        },
        {
            "id": "h07tydx",
            "score": -1,
            "text": "Some peoples may have used divining/dowsing rods to locate the water sources underground?",
            "title_similarity": "0.6072637"
        },
        {
            "id": "h07x4jf",
            "score": 1,
            "text": "We dug wells for water.  I was taught to use a divining rod.  (I was about 6 when this occurred)  The thing is, those wells were never safe.  All those dwellings also had outhouses.  The wells were never far enough away, nor were they protected from contamination in any way.  If there were fields nearby, farmers might use pesticide (like DDT), or fertilizers.  All that goes into groundwater, along with animal waste and the diseases they carry.   They used to tell us the insect larvae in the water were \"good for us\" and to just drink up.  Since I survived, I suppose we were lucky.",
            "title_similarity": "0.49017146"
        },
        {
            "id": "h087m0l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h08ia6w",
            "score": 1,
            "text": "Areas with lower depressions are very likey to be good places for digging wells. When it's raining it's a good advice to follow where the water flows and collects because that's also a good place to dig wells. \nBut in the Philippines you will notice that almost all houses in rural areas have wells. That's because people just hope to god that they'll hit water in the area they're digging. Most of the time it works and rarely it doesn't. So really back then it was just luck and intuition. Now you can just drill and know exactly if an area has an aquifer.",
            "title_similarity": "0.5456686"
        },
        {
            "id": "h08wl9s",
            "score": 1,
            "text": "Most states have a natural resources division that has water well logs available to the public. Every time a well is drilled you are required by the state to file a well log.\n\nI'm not sure how it works in other states, but in Ohio you can do a radius search around a GPS location and it will return a spreadsheet of the wells in that area several pieces of information such as the depth where the water was found, how much water it's making, and the formations that were drilled through to reach the water.",
            "title_similarity": "0.5093926"
        },
        {
            "id": "h095cny",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h09vp75",
            "score": 1,
            "text": "FWIW: Oh, dear Lord, here we go again. Some of us try to re-teach the wheel over and over again.When Euros arrived in America the Native People knew enough not to shite in the creeks and rivers. People were healthy. On the Oregon Trail, perhaps a hundred souls died over 60 years from Native encounters. Thousand died from cholera (shite contaminated water).\n\nI live in a desert. When a child, big springs surged forth here and there from artesian sources. Today they are all dry from agricultural ground water pumping. Soon, these agro industrial farms will be out of business as they are in much of the southern Great Plains from pumping. The deeper sources are from fossil water laid down during the last ice age. Have no doubt, even with global warming, another ice age cometh next century or a few down the timeline. Be that as it may.\n\nThe water is down there. In my area there are three aquifers: a surface layer down to, say, 40 feet. That was pumped dry in my area by 1990, although I lived on a shallow well at the edge of town until 2000, likely it was contaminated with local septic systems. The second aquifer began at perhaps 100 feet and went down to about 300 feet. That was sucked dry near my town about year 2000. The deep aquifer began hundreds of feet below the surface and extended down to about 1000 feet, or the elevation of the big river in my area. It filled volcanic caverns and now the nearby town is exhausting that. I had a conversation with one of my city council people about 1990 and warned that the city was sucking us dry. He said, “well the water moves through. You know.” \n\nToday, the town has sucked its water dry and is seeking goberm’t money to bring water from a river a good fair piece away. Sorry, it has been spoken for, for 100 years by farmers. You are going to have to buy it at outrageous prices.\n\nAnyway, water from springs has been filtered through hundreds or thousands of feet of sand and may be purer than your kitchen tap or not, depending on the septic-toxic waste sites near you. Where I live, I do not question springs and some creeks above 7,000 feet depending on the livestock load, because livestock carry “beaver fever,” really cow and sheep fever.\n\nWell drillers tend to be unique people and they know the local geology. Talk to them whenever you can. Now, water witches with their forked branches, that is a whole ‘nuther story.\n\nBest backcountry water ever (and I have sampled many): Sapphire Lake, 10,000 ft. at the head of No-tell-um Creek.",
            "title_similarity": "0.4234531"
        },
        {
            "id": "h0a8am5",
            "score": -1,
            "text": "The big way that you could search for water is with divining rods. The problem with this though, you don’t know how far you’ll have to dig down to actually find the water.",
            "title_similarity": "0.55451185"
        },
        {
            "id": "h073zi3",
            "score": 6,
            "text": "Rivers and Lakes are not like pipes in the water supply or the sewers.  They are filled up by rain and snow melt.  They leak into the surrounding areas so much that there is a constant amount of water underground if you drill near a river or lake.  The further you are from natural water, the deeper you need to dig.  Also, elevation matters because you have to dig through the height of the mountain.",
            "title_similarity": "0.36987245"
        },
        {
            "id": "h0771c2",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h08ea4e",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h06mfpt",
            "score": -57,
            "text": "Once a long, long, long time ago. An illiterate, barely speaking Cro-Magnon man. Likely very bored, also likely trying to impress a female Cro-Magnon women. Started digging a big deep hole, just to show how strong he was. Many holes had been dug before in this way. These holes had also attracted the attention of said females. Though I'm just guessing about that part. But this particular hole would be special. Because for what ever reason water started filling that hole up. Later, those same Cro-Magnons would get really thirsty and he'd remember is big deep hole that filled with water. So he dug another one. Sadly, there wasn't water and he died of thirst. But Others would remember his noble sacrifice. A thousand generations would pass of thirst Cro-Magnons digging big deep holes and getting water. they'd become humans who would also continue this practice. They would also learn where water was more easily found by digging big deep holes. But despite how smart they thought they were, sometimes there just wouldn't be water and people would die of thirst. The point is, if your bored enough, horny enough, or thirsty enough. Some times all three. You dig big ass holes in the ground, and sometimes. You find water. \n\nTLDR: They didn't know. Anymore then we do. It's hit or miss. But dying is worse than digging wells.",
            "title_similarity": "0.36983177"
        },
        {
            "id": "h074dn5",
            "score": 51,
            "text": "dig deep enough literally anywhere in the world and you'll hit water\n\nthere is water underground in most environments... even the desert... like vast underground lakes.  \n\nHowever the best place to dig a well is somewhere where it rains occasionally so that the underground aquifer is replenished by rain water sinking into the ground.\n\nIf you hit water in a desert and use the well a lot... the aquifer will eventually run dry..",
            "title_similarity": "0.38414836"
        },
        {
            "id": "h073pxt",
            "score": 25,
            "text": "I have water well. In my father back yard. 7 meters deep. I believe they dug it when I was in elementary school. No science in there. You dug a hole deep enough, you found water. Of course the depth will be different in the desert or somewhere with a lot water sources (river, lake, swamp). And the quality of water are different too",
            "title_similarity": "0.4771258"
        },
        {
            "id": "h0748n2",
            "score": 86,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h078e5f",
            "score": 9,
            "text": "When it rains, water goes into the ground. When enough water builds up under the ground, you can get a little (or very big) lake that's inside of the soil. By digging deep enough into the ground, you can reach that underground lake and get water from the soil as it leaks from the soil into your well.",
            "title_similarity": "0.47968036"
        },
        {
            "id": "h06wnuf",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h06hhuf",
            "score": 153,
            "text": "You do likely see how rain water will flow on top of the ground and collect in steams and rivers to flow down hill. However some of the water find its way through the grains of dirt instead of just on top of it. Water flows much slower through the dirt then on top of it but it will still flow in a similar way. The water will not be able to flow the same through different layers of dirt and bedrock so the grondwater will often collect in similar streams and rivers under ground. But they tend to be much wider and flow much slower. It can even form huge ground water lakes the size of countries.\n\nIf you look at a terrain you can often see where the ground water flows. Both based on how the terrain is shaped how the vegitation look like and even the color of the dirt. You would then be able to dig a hole where you expect there to be water and hope to find water there. As for clean drinking water the dirt is usually a very good filter of particles and toxins so the ground water tends to be even cleaner then the surface water.",
            "title_similarity": "0.4278584"
        },
        {
            "id": "h07isfx",
            "score": 48,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h076df0",
            "score": 481,
            "text": "Knowing where isn't that easy. Throughout history people have dug for water and failed, start over somewhere else. That's why dowsers made money, that guy with a forked stick who claimed to be able to detect where water was. Either such a person was a complete charlatan, or he was just good at reading the land for water and the stick was his trick to wow the clientele.",
            "title_similarity": "0.5609649"
        },
        {
            "id": "h06jybb",
            "score": 20678,
            "text": "Have you ever sat by a lake or river and dug a little hole in the ground? After a while, water will collect in the bottom, because the water flows through dirt and stone around the river too. When it rains, a lot of water flows down into the ground and that ground that carries water is called an aquifer. Depending on what kind of dirt and rocks are there and how the hills and mountains are sloped, it will collect in certain places. \n\nVery ancient people needed water to live, just like we do today. They usually chose to live near rivers, lakes, and streams. They also dug little holes in the ground nearby, and noticed the water in those holes was nice and filtered by the dirt and sand. If they dug a hole and covered it up, their water would taste good and stay clear of leaves, sticks, and algae. So they dug deeper and deeper holes, and found they could move further from lakes and rivers which would flood from time to time. \n\nWhere to dig a well was trickier the further you got from water though. Sometimes they dug big holes for nothing, and that was disappointing, but they learned a lot from it. Parents taught their children what to look for, what kinds of rocks and plants made for good well ground.\n\nEDIT: WHOA!!! Glad so many people were amused by writing in my teacher-voice! A recurring question I’ve seen is “How can dirt filter water? Wouldn’t it be dirty?” So here’s a [link](https://www.usgs.gov/special-topic/water-science-school/science/groundwater-wells?qt-science_center_objects=0#qt-science_center_objects) to explain more about wells since it’s a pretty deep subject. In short, fine topsoil rich in organic matter doesn’t go very deep, clay settles out, and gravel and sand are excellent filters that continue to be used as part of modern water filtration systems.",
            "title_similarity": "0.53839785"
        },
        {
            "id": "h06vjfl",
            "score": 127,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h06z49i",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "0.044055693"
        },
        {
            "id": "h078o86",
            "score": 1,
            "text": "Find a river, lake, or any large amount of standing water that doesn’t have salt in it.\n\nDig below the water line.\n\nWater will become visible as the ground filters it. \n\nFilter more with charcoal, moss, dirt and rock. \n\nDrink. \n\nr/offgridsurvivalskills",
            "title_similarity": "0.48233014"
        },
        {
            "id": "h07dr42",
            "score": 9,
            "text": "I live about 450 feet from a river. Is it safe to assume as long as there is water in the river and my well is deeper than the river, it will never go dry?",
            "title_similarity": "0.49559662"
        },
        {
            "id": "h07nfep",
            "score": 1,
            "text": "Look up \"water table\" which is depth at which a hole will fill with water. You just need to dig deeper than the water table and you have a well. As for cleanliness, it generally was assuming something hadn't fallen in it but as the water is generally boiled, it's pretty safe anyway.",
            "title_similarity": "0.63878536"
        },
        {
            "id": "h07p99j",
            "score": 12,
            "text": "Primitive people learned much from observing nature! There are animals that dig for water. We ourselves are animals that have been passing down this type of knowledge.",
            "title_similarity": "0.48130918"
        },
        {
            "id": "h07qwyq",
            "score": 3,
            "text": "My home has a well (and septic) and my water literally just started flowing again 10 minutes ago. I learned a LOT about residential wells over the past 72 hours. Once the drillers find an aquifer (about 620 ft down for us) they install a pump at the end of a very long string of steel and PVC pipe with a power cable running alongside it (about 500’ down for us). The power connects to the house (like any other power circuit), the pump starts running and is connected to a switch & pressure tank. The tank is pressured (with air) to between 30-50 PSI and this creates water pressure in the home to fill hot water heater, toilets, go to faucets, etc.. \n\nIt was surprising how relatively straightforward (yet expensive) the process and equipment is.",
            "title_similarity": "0.46335897"
        },
        {
            "id": "h07vxkv",
            "score": 1,
            "text": "Doesnt drinking from a well destroy your teeth rather quickly? Because it doesnt have fluoride?",
            "title_similarity": "0.51280326"
        },
        {
            "id": "h0822b7",
            "score": 2,
            "text": "A question I've had forever: how did people maintain these water wells? How come the water never went stale?",
            "title_similarity": "0.7338298"
        },
        {
            "id": "h08chv3",
            "score": 1,
            "text": "They didn't particularly know. They just noticed that if you dig deep enough near a river, you find underground water.\n\nIf you live two miles from a river and you dig a well one mile from the river, that's one less mile that you need to walk to get water.\n\nThey didn't particularly know that they were clean, either. There are plenty of stories across history of people dying from bad well water.",
            "title_similarity": "0.53902185"
        },
        {
            "id": "h08oznz",
            "score": 1,
            "text": "Weren't there people whose job it was to find the best place to dig a well?",
            "title_similarity": "0.693863"
        },
        {
            "id": "h08stnc",
            "score": 3,
            "text": "If you buy an undeveloped plot of land and need to drill a well, you typically apply for a permit from the county, a guy comes out with the survey map and tells you where you're allowed to dig.  This will be setbacks from the property lines, roadways, wetlands, etc.\n\nThere's no \"this is where water is\", you dig until you hit water.  In hte USA you can pick a spot at random on a map of the country, and have about a 90% chance of drilling a successful well.\n\nthis is why water dowsers are so successful...it's easy to find water, it's hard to find a spot where there is NO water.  \n\nthe comical part is how dowsers will walk around and say \"ok, drill HERE\" like underground water is in a pipe or something...they literally don't even understand how water tables and aquifers even work.",
            "title_similarity": "0.5192654"
        },
        {
            "id": "h099jhh",
            "score": 2,
            "text": "A certain amount of the ground is wet. Like mud. Dig deep enough and you can find that mud, dig deeper and itll fill that hole with water.",
            "title_similarity": "0.34268484"
        },
        {
            "id": "h09f04f",
            "score": 1,
            "text": "almost everywhere in the world, there is water underground at some depth. where people live, it's usually only 10' to 200' down or so. there are various ways to dig a hole, usually with metal tools. a few people with shovels and buckets and ladders can dig wide holes down into the ground fairly quickly, in a few days or weeks, and then brick up the side so the hole doesnt cave in. at the bottom will be water. \n\nsome old wells are huge holes in the ground with stairs to the bottom. \"stepwells\".\n\ndeeper narrower holes can be dug with specialized jackahmmers, drills, buckets, and high-pressure water sprayers on the end of long pipes or ropes.\n\nin the past, people got water out of most wells by lowering one bucket at a time. nowadays, usually a small pump sits in the bottom of the well -- electricity powers it, and it pushes water up to the surface, into water tanks and more plumbing.\n\nas long as nothing contaminates the water from the surface, it's usually good to drink, because the water was filtered by the soil and rock as it seeps down deep into the ground. though there are metals and other chemicals that can be in groundwater that arent good to drink. \n\nmedieval european people weren't especially good at digging or maintaining wells. they got sick a lot from bad water.",
            "title_similarity": "0.40500396"
        },
        {
            "id": "h09pqtx",
            "score": 3,
            "text": "Medieval? We still dig wells to get water.",
            "title_similarity": "0.690766"
        },
        {
            "id": "h09wwr0",
            "score": 1,
            "text": "The pressure in your hole is lower than the pressure in the earth next to it.\n\nThis creates a differential, and the water trapped in the dirt/rock adjacent to your hole, wants to escape it's high pressure environment.\n\nEasy way to think of it? Water is always trying to equalize. By digging a hole, you are essentially creating a vacuum.",
            "title_similarity": "0.44389462"
        },
        {
            "id": "h0b3ihp",
            "score": 1,
            "text": "Almost everywhere there's water underground. It can also move just like a river, but more slowly. If you want to experiment with it and see how it work then get a big waterproof box, like a plastic box. Fill it with sand and add a bit of water, like 1/4 of the box. It should go right down to the bottom. Now make hole in the middle. You'll see the water is there.",
            "title_similarity": "0.4317962"
        },
        {
            "id": "h0ch3yz",
            "score": 1,
            "text": "Oddly enough I've had wells dug or put in and the people doing it always said 'let's go to the highest spot on this piece of land.'. I asked why is that and was told that water underground has a tendency to raise the land just the opposite of what I was thinking; that low spots would be better but come to find out it is the high spots on land that have good water because of the pressure it creates.  So I guess over time people figured that out for themselves.",
            "title_similarity": "0.57533646"
        },
        {
            "id": "h14olmt",
            "score": 1,
            "text": "So after all this talk of soft and hard water...I know hard water has all those minerals in it. Is it possible to basically overdose on them? With the exception of extremely rare water intoxication, it's not like drinking too much water will hurt you. But what if you drink shit tons of hard water and ingest all of those minerals?",
            "title_similarity": "0.37735343"
        }
    ]
}