{
    "ELI5: How does trace amounts of fetanyl kill drug users but fetanyl is regularly used as a pain medication in hospitals?\nETA (edited to add)- what’s the margin of error between a pain killing dose and a just plain killing dose?": [
        {
            "id": "h1hj6pi",
            "score": 1,
            "text": "Recreational drug users die so often because they don't actually know what they're taking, due to prohibition driving the supply chain underground (just like it did in the 1920s with alcohol...nobody could ever have predicted!). Doctors have access to reliably manufactured drugs that they can dose accurately and safely. Recreational users will be able to use fentanyl in reasonably safe ways as well, just as soon as the fascists give up on their drug war. See also https://en.wikipedia.org/wiki/Jamaica\\_ginger",
            "title_similarity": "0.7595544"
        },
        {
            "id": "h1h4u2k",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1hzdqv",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1h6hxk",
            "score": 7,
            "text": "Had fyntenol and propifol (killed Michael Jackson) when I got my tonsils out, at 35.  There’s a reason the anestiologist sits there with you.",
            "title_similarity": "0.6917311"
        },
        {
            "id": "h1j3qf3",
            "score": 7,
            "text": "We just learned recently that having 3x what was thought to be the lethal amount of fetanyl in your system is no longer considered lethal.",
            "title_similarity": "0.5525924"
        },
        {
            "id": "h1i8wo6",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1il0q9",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.1213852"
        },
        {
            "id": "h1j0iz5",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1jnqje",
            "score": 0,
            "text": "its the same way drowning kills you, but we regularly drink water. theres essentially a safe amount of every substance in the world, as well as an unsafe amount. fentanyl has a very unusually low threshold for \"unsafe amount\" but, like everything else, it also has a safe amount.\n\ndoctors are just better at precisely calibrating safe dosages than drug dealers and drug users.",
            "title_similarity": "0.6508169"
        },
        {
            "id": "h1jorqm",
            "score": 0,
            "text": "I’ve watched people cut drugs with fent, they literally just mixed the powder with the other powder, and not with proper tools. That means one bump could could contain no fent and another bump from the same batch could be 70% fent. Google how much volume ~50mg is and understand that one bump of 70% fent could easily kill multiple people much less all going into one.\n\nThen consider if you just got that batch and took a bump with no fent, did you fine but not enough so you take a few more bumps and 1 or 2 of those is more fent than anything else you are in trouble from the fent alone but also have the interaction of the other opiate (or whatever) that’s also in your system.",
            "title_similarity": "0.7301736"
        },
        {
            "id": "h1hqtzi",
            "score": 4,
            "text": "It’s also mixed with heroin. In the hospital it is pure. Regular heroin cooks down to a golden brown. If there’s even a slightly bluish/greenish tinge there is fentanyl in it and it is greatly potentiated. Addicts see in the news that a whole bunch of people died of overdoses right on the sidewalk where they used and list where it happened and addicts run over there to buy up all that dope before the cops shut it down. Some dealers seek out dope with fentanyl because it’s gets you super high. It’s the amateurs who don’t know what to look for that overdose.",
            "title_similarity": "0.7437973"
        },
        {
            "id": "h1i9xi8",
            "score": 1,
            "text": "I am an anesthesiologist. \n\nThe same reason why fentanyl kills people when the same drug is given to patients everyday in hospital, is the same reason why propofol killed Michael Jackson but every single day of my work I use the same drug to anesthetise patient and don’t kill them. \n\nI know what I am doing, I give the drug in a measured manner, and I watch my patients when I give them the drug.",
            "title_similarity": "0.73975253"
        },
        {
            "id": "h1inlf9",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1j731s",
            "score": 1,
            "text": "Trace amounts of drugs don't kill people, large amounts do. Trace amounts are found in dead people because lots of it has already been metabolized out dissipated otherwise. Not a doctor just trying to think of it logically based on experience.",
            "title_similarity": "0.5828975"
        },
        {
            "id": "h1jbbu8",
            "score": 1,
            "text": "Cops overdosing on fentanyl is a hoax.  \n\nhttps://www.freep.com/story/news/health/2019/04/29/touching-fentanyl-hysteria/3566951002/\n\nAnd their jobs being dangerous in a myth.\n\nhttps://www.ishn.com/articles/110496-most-dangerous-jobs-in-the-us-the-top-20\n\nJust stating the facts folks.",
            "title_similarity": "0.74717176"
        },
        {
            "id": "h1jdaor",
            "score": 1,
            "text": "Meta: I kept seeing people use \"ETA\" in their posts, and at first thought they were just following the example of others, without knowing what it stood for, but I saw it so often.  I finally had to search it, because by now I *knew* they didn't mean \"Estimated Time of Arrival\", but I could not, *for the life of me,* figure out what it *did* mean. \n\nAnd there, on freedictionary.com, amid the *one-hundred-four* listed definitions, was \"Edited to Add\". That makes sense, I guess. But you know what else makes sense? \"Edit:\"  That's all that's needed. It's self explanatory, and no annoying initialism needed.",
            "title_similarity": "0.5240075"
        },
        {
            "id": "h1hpcdy",
            "score": 2,
            "text": "As others have said, the therapeutic dose for fentanyl is extremely small. In addition, the therapeutic range is also very small. This means that the difference between the dose that you are given by a medical professional to keep you from feeling surgery isn't that much smaller than the dose that would kill you. (In contrast to some other drugs where the normal dose can be an order of magnitude smaller than the lethal dose)\n\n In a controlled setting, this is fine, but on the street you have no idea if you are actually getting pure heroin or pure fentanyl sold as heroin and it could be anywhere in between. \n\nTL;DR ELI5: Eating gummy bears makes me feel good, but if I have too many, I start to feel sick. With Heroin, it's like you need to eat 20 gummy bears to feel good, and eating 21 or even 25 isn't that big of a deal. But with fentanyl, you only need to eat 1 and if you nibble the ear or leg off another one you'll get really sick.\n\nEDIT: I was wrong about the therapeutic index of fentanyl, as the replies to this comment kindly explain.",
            "title_similarity": "0.7113132"
        },
        {
            "id": "h1j3kbj",
            "score": 2,
            "text": "Like you are 5?: Here's a fun cookie metaphor.\n\nYou know how when you are making chocolate chip cookies you just pour in the chocolate chips, stir it up and some cookies have more chips and some cookies have less? That's what happens with street drugs. The fentanyl gets mixed in like chocolate chips. You might get one chocolate chip and too much cookie (lame) or too much chocolate and not enough cookie and it all falls apart.\n\nIn a hospital they figure out your perfect chocolate chip to cookie ratio and watch you eat, check in constantly to make sure if it's perfect and change the chocolate chip to cookie ratio if necessary. And if you need some milk to help wash it down they will pour you a big glass.\n\nETA: also, the hospital has high quality chocolate chips. The homemade cookies *might* have anything from quality chocolate to \"chocolate style confectionary\"",
            "title_similarity": "0.5920454"
        },
        {
            "id": "h1jvq30",
            "score": -2,
            "text": "With the way Naloxone is handed out freely to addicts and their family I’m surprised anybody overdoses.",
            "title_similarity": "0.598076"
        },
        {
            "id": "h1hlzli",
            "score": 23,
            "text": "The margin of error between an effective dose and a just plain killing dose is called a therapeutic index. Fentanyl has a therapeutic index of 400, meaning it takes 400 small painkilling doses to kill the whole person instead of just the pain. For comparison, morphine has a therapeutic index of 70, so fentanyl is between 5 and 6 times harder to overdose on than morphine, all else being equal. ([source](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1312206/))\n\nThe way fentanyl kills drug users is that they think they're taking morphine or heroin and take way too much because of that mistake. Fentanyl is about a hundred times stronger than morphine ([source](https://www.dea.gov/factsheets/fentanyl)), so if you try to weigh out four small doses of morphine (which should never kill someone) but you're actually weighing out fentanyl, you've just weighed out enough to kill you. This happens because drug dealers sometimes mix fentanyl into the stuff they're selling as morphine and heroin so they can also mix in cheap fillers and save money without having weak product, but they don't always get the amount of fentanyl right. \n\nPeople who think we should legalize drugs often point to this as a reason. If someone spikes your vodka with xanax so they can dilute it with water and save money, you can report them to the police and the law will make them stop. But drug dealing is still illegal whether you mix in fentanyl and deworming medicine to save money or not, so drug dealers don't have incentives to make their products as safe as possible the way vodka makers do.",
            "title_similarity": "0.7598237"
        },
        {
            "id": "h1j3isk",
            "score": 3,
            "text": "Seriously? Why is it when it's unregulated, untested, and most likely unknown that the substance is present that it kills people while it works as intended in a harshly regulated, sterilized, and clinical environment? \n\nReally?",
            "title_similarity": "0.70865095"
        },
        {
            "id": "h1h4jjc",
            "score": 61,
            "text": "So SOME drug dealers my have no clue but thats not the case for all.\n\nthere are several major issues with fent in street drugs  \n\n\n1. while x amount spread across the entire amount in a batch of pills/bag/rock ect  might be a safe dose. often times the product is not evenly mixed.   This is fairly common but it didnt used to be fatal when they were cutting with inert things, you would just have a variety of strengths in across the single bag/rock.  \nDealers are cutting the actual product with both fillers and fent, with the intent of making more product without sacrificing the strength of the heroine or w/e they are cutting.\n   1. as a side note to this one. testing.  if product is not mixed fully,  you could run some of the product through a test kit and it come up pure, but then a chunk on the other side of the bag might have a pocket of unmixed fent.\n2. even in a case where things are mixed perfected. lets say they put 1/5 of a lethal dose of fent, in a dose of the product in question. and generally you only expect the person to do 1-2 doses because thats the usual, but what if someone knows that its nonfatal to take 10 doses at once if the product they bought was pure. and decide they want to go hard tonight.  whelp you do the math.\n3. with mdma back in the 90s it was common for dealers to make custom cuts for batches of pills. they would have mdma, but also other things like meth or heroin mixed in. part of the reason for this was to give their product a special high to try to make it worth coming back to the same dealer instead of getting the product where ever they can find it.  it was also because these products have significantly greater withdrawal effects and addictive qualities.  \n4. People are finding fent on substances they wouldnt expect to be cut with anything let alone a potentially deadly pain killer.\n   1. this is sometimes caused by residue left on scale between different products. sometimes on purpose :/\n5. Relapsing heroin junkies often od because they do the dose they were doing before they quit, but they were only able to handle that dose because their body had built op a tolerance requiring more to get where they want to get.   \nso we know its already difficult for people doing heroin to correctly measure out the correct dose for them, now add in the wild card of the chance of fent, and beyond that inconsistent strength/presence at all of it thought-out a bag.\n6. Double cutting.  Where a dealer assumes the product they were given is pure and then cuts it to try to increase their profit margin, not knowing that someone before them in the chain already cut it.",
            "title_similarity": "0.6736978"
        },
        {
            "id": "h1hdwn0",
            "score": 28,
            "text": "Fentanyl is so strong, its hard to mix it with a buffer and end up with a homogenous end product at precisely the right percentage. Some of the overdoses were from users who didn't know the drugs they were using had any fentanyl in it.\n\nSuppose you are a heroin dealer. Since the beginning of time (for example) milk producers have slipped a little water into their milk to stretch it when they sold it. Heroin dealers do the same with various cheap powders that have no drug effect, the buffer-powder only dilutes the heroin.\n\nWell, this makes heroin users angry, and they either pay less or get their heroin from someone else, so what can you do to give your cheap diluted heroin a little more punch? Add a little bit of fentanyl.\n\nOK, but...you don't have a modern pharmaceutical lab, just a brick of powdered heroin that you want to mix in some buffer powder to dilute it, and a \"pinch\" of fentanyl. How pure is the fentanyl that you bought from a fentanyl dealer who got it from a Mexican smuggler that got it from any one of several Chinese factories?\n\nHow pure is the heroin? How accurate is the label on the powdered buffer? So you dump the measured amounts into a large stainless steel bowl, and mix it slowly with a common cake batter mixer. Then you use a measuring spoon to put what you estimate is the right amount in tiny bags to sell to customers.\n\nSome of the tiny bags of adulterated heroin have more fentanyl, and some bags have less...\n\nMost of the customers are fine after using your product, but...you hear a couple of them died. Heroin addicts die all the time. Did they take too much? Did they have a stroke or heart attack? As a hardened heroin dealer, do you take the time to find out all the details? (or do you stay away, so as to not get a civil wrongful death lawsuit, or arrest for selling?).\n\nSome addicts went through rehab, and when they got out, their tolerance was lower, so they died from simply using the amount they used to use.",
            "title_similarity": "0.72036237"
        },
        {
            "id": "h1hv8nf",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1h47cn",
            "score": 7,
            "text": "Sometimes drug users don't realize how much is really there (a little but goes a long way) Or they don't realize it is there at all. People can die from fentanyl overdoses because their stuff is laced and they have no clue.",
            "title_similarity": "0.6625927"
        },
        {
            "id": "h1htdyg",
            "score": 5,
            "text": "Dose is everything.\n\nA drug like heroin or cocaine is often taken in milligrams or even grams. It's not a lot, but even a cheap electronic scale can allow you to create doses that are more or less going to be \"safe\" (as in not overdosing on a single dose).\n\nFentanyl is hundreds of times more powerful than heroin and therefore is meant to be taken in MUCH smaller doses. The doses are so small that effectively and safely measuring a dose requires a VERY  precise measurement device.\n\nIn the field of medicine (hospitals and doctors and nurses), they are EXTREMELY careful with their use of Fentanyl, the doses are all measured and monitored with the strictest processes and measurement devices.\n\nWith street drugs, the quality of measurement and adding of Fentanyl is FAR less consistent and orders of magnitude less safe. This is why someone might take a cap of extacy (Molly) and overdose and die. (Something that has happened to two of my friends, one of which took a cap of E very recreationally, ie first time in a decade that he'd done any drugs, and he died.) This can happen because there are no established safety standards when adding Fentanyl to drugs which has the predictable result of being wildly unpredictable. And also extremely dangerous.\n\nFentanyl is dangerous because it's too powerful to use safely without the strictest standards of measurement.",
            "title_similarity": "0.6535047"
        },
        {
            "id": "h1h1gk5",
            "score": 32,
            "text": "Because in the hospital they give you such a tiny amount of it. They know how much to give you. Drug dealers have no clue and people who try it do not realize how strong it is.",
            "title_similarity": "0.67372507"
        },
        {
            "id": "h1heefw",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1hlmdj",
            "score": 8,
            "text": "Being that fetanyl  is so powerful and doctors have to be so careful with it, why isn't it used for executions in the prison system? Do away with the cocktail and uae this instead Cheap and easy.",
            "title_similarity": "0.7414736"
        },
        {
            "id": "h1h17j5",
            "score": 13,
            "text": "It's measured very very carefully and precisely. Drug dealers don't know what they're doing and have access to different forms.",
            "title_similarity": "0.59636617"
        },
        {
            "id": "h1hji85",
            "score": 149,
            "text": "There was a documentary on Netflix called \"Dope\" it followed different drugs in different cities, users, dealers and cops. There was one on heroin, shows a dealer cutting it with Fen. He says he keeps adding fen till it starts killing users- then the users want it more cause it's so strong it kills people.\n\nOn the street fentanyl concentrations very wildly, from batch to batch, week to week. What it's cut with, is it veterinary dewormer or shit crystal, some benzos or maybe some baby powder ...anyone's guess.\n\nOne week you get a weak batch and you have to up your dose. Next week that same dose stops your respiratory drive and you turn purple and die. \n\nAlthough these days everyone and their dog carries Narcan. We have guys just sleeping on a bench get x4 doses up their Nose from concerned bystanders. \n\nIn the hosp, they know your weight , they have stable concentrations of the drug and the medical staff are pros who know their dosing .",
            "title_similarity": "0.7673383"
        },
        {
            "id": "h1hphvk",
            "score": 72,
            "text": "Drug manufacturer here: drugs that are active in the microgram range have separate and time consuming methods of mixing with excipients. For example fentanyl (which we don’t manufacture) would be geometrically mixed in liquid form. So you dissolve 1gr of fentanyl (that would be like 20 thousand doses) in 1ml of water you thoroughly mix and add any other excipients (emulsifiers, thickening agents, absorbers etc). Then you mix that 2ml solution with 2ml of water. Then that 4ml with 4ml of water. 8-8, 16-16 etc until you reach the the desired concentration. That takes a looooong time of meticulous dosing with expensive equipment.  \n\nThe street version is a dude with a credit card, a plate and some flour.",
            "title_similarity": "0.72658634"
        },
        {
            "id": "h1ho4n8",
            "score": 118,
            "text": "A typical dose of fentanyl in the hospital is 0.000025 g. That is an unfathomably small amount. When actual drug companies are making pills or patches, they have the right equipment, quality control, and \\~100% pure fentanyl to start with, to produce doses that are like 0.000025 +- 0.000005 g. \n\nWhen drug dealers are adding fentanyl to spike their product, there is no way in hell they can measure quantities that accurately, mix them thoroughly enough, or even know the purity of the fentanyl they're adding to begin with. \n\nLike, I worked in a lab with a digital scale that cost like $8,000 and it *might* have been accurate enough. It weighed to 4 decimal places (+-0.0001 g) so the lightest amount of fent it could weigh would be enough for hundreds of doses, so you'd have to mix them all up together in a big bowl. So you're adding hundreds of desired-doses worth of fentanyl (aka dozens of fatal doses) into a bowl, then stirring or using a kitchen mixer, then scooping it into baggies or pressing into pills and just hoping you've mixed enough that no single baggie / pill has more than 0.00001 g or whatever. It's essentially impossible to mix well enough. Oh and you're guessing at the purity of the fent you're adding to start with. If you assume 100%, then your stuff is weak, because odds are it's not. Guess the starting fent strength too low and now *lots* of your baggies have lethal doses. \n\nThe difference between a fent dose you can barely feel and a dose that kills you is barely visible. People have died from traces left on a scale used to weigh fent before the thing they weighed. Hospitals and drug companies are equipped to handle chemicals with that level of precision, illegal drug labs (even very very good ones) are not.",
            "title_similarity": "0.74117345"
        },
        {
            "id": "h1iu2fg",
            "score": 24,
            "text": "With Fentanyl laced Heroin specifically, here's an example of how it can happen:\n\nTake a deck of playing cards. Remove all the aces.\n\n- The deck will represent your bag of Heroin. \n- The Aces are going to represent your Fentanyl. \n- The other cards are going to represent the Heroin + whatever worthless filler it's cut with.\n- One Ace is a single dose of Fentanyl.\n\nWith that in mind, divide the remaining deck up evenly into four piles of 12 cards. Add one Ace to each pile to ensure the deck has an even mix of Fentanyl in it.\n\nNow shuffle the deck thoroughly for the next few minutes, and then draw 13 cards. \n\nThe shuffling is to simulate the cut drugs being moved around/transported/handled, and the mix shifting up, as well as the fact that the powder might not have been mixed perfectly evenly to begin with. The cards you're drawing, are your dose. \n\nTake a look at those 13 cards and count the Aces.\n\n- If there's one Ace, you get a regular high.\n- If you find two Aces, flip a coin, heads you survive and get *really* high, tails you're dead.\n- If you find three or four Aces, you're dead.\n- If there were no Aces, well, then you barely got high. Draw twice as many cards next time, and repeat, to simulate what a user would do after a weak dose.\n\nObviously this is an over-simplified example, but suffice to say when you're dealing with a substance as potent as Fentanyl, and mixing it in to a powder, it can end up mixed unevenly, and someone can get a hot shot that has too much of it in, and kills them. \n\nNot to mention it can happen the other way around. If their first dose ends up too weak because of the uneven mix, that can be equally as disastrous, since they can double up on their dose next time, not knowing their shit is cut with Fent, and end up getting a double dose of the Fent too.",
            "title_similarity": "0.64073104"
        },
        {
            "id": "h1h6z8j",
            "score": 64,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1hd074",
            "score": 990,
            "text": "So speaking from some experience, an old friend used to stomp his heroin with fentanyl purchased as a \"research drug\" from China and shipped to a drop house. He was 100% an addict and the reason he was cutting was he was taking his \"pure\" heroin he received, holding a large percentage back for his own use, and selling the stomped on product as \"pure.\" \n\nProblem was his supplier had the same ideas and used **carfentanil** to cut it before passing it down to be sold. My friend does his usual and shoots up a hero dose and the rest is in the obituary. [Picture](https://imgur.com/a/drk74iJ) reference for how small of an amount of these synthetic opioids is considered a lethal dose.\n\n**Edit:** Because jesus, didn't expect this to blow up. \nTo clarify, friend in question was my half brother, who unfortunately got me on drugs in the first place. I've personally been clean since 92.  He started off slinging pot for the mexican mafia back in the late 70's and branched off to coke and speed in the 80's. The wake up call (for me) was when he got shot in the head during a bad deal and managed to live. (The bullet skidded off his skull and bounced around in his sinus cavity before exiting by his eye.)\n\nI'd like to say he turned his life around at that point, but he didn't. We fell out after he started using what he was supposed to sell. (Found this out when people showed up at my moms house and held a gun to her during a family dinner.) He pops up every 5-6 years \"clean\" and we catch-up just for him to disappear again. Last time he popped up around 2013 was when he tried to recruit me into his scheme and basically laid it all out. He was dead within the year.\n\nEdit#2: As mentioned his H was white, he didn't sling black tar or that brown shit from the middle east, his words; \"My shits pure, I get it from the Asians.\"",
            "title_similarity": "0.69248533"
        },
        {
            "id": "h1hait2",
            "score": 298,
            "text": "The dosage of fentanyl is extremely small. It’s measured in micrograms. To give you perspective, there are 1000 micrograms in a milligram. Think of an regular strength Tylenol. It’s usually 200 milligrams of acetametaphine.  The normal dose of fentanyl is like 25-100 micrograms. \n\nThe margin of error for such a small amount of medication is incredibly small.",
            "title_similarity": "0.5889446"
        },
        {
            "id": "h1h1lpn",
            "score": 773,
            "text": "Hospitals prescribe Fentanyl in *extremely* controlled doses. That kind of precision may not be used when people cut other drugs with fentanyl. A lot of people don’t even know there’s fentanyl in the drug they are taking, so they take too much.",
            "title_similarity": "0.7412956"
        },
        {
            "id": "h1h2a9a",
            "score": 16157,
            "text": "I routinely prescribe fentanyl in the emergency department.  The answer to your question is very precise dosing.  A normal dose of fentanyl is 25-100 micrograms, which is an incredibly tiny amount.  At that dose you may feel a bit drowsy but it's very unlikely anything bad will happen.\n\nIt's easy to reliably give the right dose when you have drugs that are manufactured to strict standards and tested at multiple steps during production.  When you're mixing up drugs for street distribution, quality control gets pretty loose.  A variation of a few milligrams (a few thousand micrograms) one way or another is no big deal for many drugs, but would be lethal with fentanyl.\n\nAnother important factor is that patients receiving IV opioids are generally in a monitored setting so we know if their breathing slows down too much and can give them oxygen or even narcan.  If you're using recreational drugs alone or with a group of similarly intoxicated people, nobody will know you overdosed until too late.",
            "title_similarity": "0.6306789"
        },
        {
            "id": "h1hmz9b",
            "score": 1,
            "text": "They're dosing it as if it's morphine, but fentanyl is 10× more potent than morphine. We give extremely small amounts of it and monitor you very closely.",
            "title_similarity": "0.62500834"
        },
        {
            "id": "h1hnb7b",
            "score": 1,
            "text": "Fentanyl patches release the substance over time. A lot of people ingesting fentanyl are shooting it up thinking it’s heroin. Too much too fast = dead",
            "title_similarity": "0.6795147"
        },
        {
            "id": "h1hnlhq",
            "score": 1,
            "text": "Can anyone explain why it would be a good thing to cut drugs with? Like wouldn’t you want whatever you’re cutting drugs with to only be lethal In a large amount? Then you could water it down more without killing clientele?",
            "title_similarity": "0.7275359"
        },
        {
            "id": "h1hotan",
            "score": 6,
            "text": "The street fentanyl is made in sketchy circumstances, often imported from countries with... different... quality controls than ours. It is then \"cut\" and mixed in with fillers once it arrives in the area where it's going to be sold, sometimes mixed a few times at a few stages. Someone mixing this stuff up in a shed or secret warehouse isn't going to have any quality control so one pill might have 10 micrograms of the drug, but the next one might have 300. It's often sold to drug users as other opiates, and they don't even know that they're taking fentanyl, thinking it's a different drug like morphine or hydromorphone, and they had no intention of using it in the first place.\n\nThe hospital fentanyl is made in a proper medical laboratory with strict regulations, and is administered in verified doses, while supervised by medical professionals. When I was in the hospital a few months ago, I was given 4 doses of fentanyl for pain, but was hooked up to a bunch of monitors and had a nurse watching me the whole time.",
            "title_similarity": "0.6972677"
        },
        {
            "id": "h1hprcy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1hqu4a",
            "score": 1,
            "text": "Only trace amounts are found because it metabolizes so fast, not to mention it only takes trace amounts to exert an effect in the first place because it’s so potent. It kills because of its potency and some users may not have built tolerance to opioids. It’s regularly used as a pain med in hospitals for those who are already on narcotics and have built tolerance to them, plus it is used in controlled doses and patients are monitored.",
            "title_similarity": "0.73073876"
        },
        {
            "id": "h1hs2cj",
            "score": 1,
            "text": "I was given fentanyl after cancer surgery last year. It made me feel like I was dying! Extreme nausea, chest pain, difficulty breathing, super low blood pressure. When I said I felt like this the nurses encouraged me to take more of it! I was delirious with pain! Took me passing out from it for them to think of trying stopping the fentanyl. \n\nDoes anyone know if this is just some kind of allergy to opioids? Be good to know so I never try that shit again!",
            "title_similarity": "0.73947746"
        },
        {
            "id": "h1hzqaz",
            "score": 1,
            "text": "There is a rule in nature. Any overdose simply any. Could lead to death. From any substance. Even if its healthy. Overdose of water is deadly. Overdose of chocolate is deadly. Overdose of medical supplies is aswell. It all goes back to dosage. A precise safe dosage wont hurt.",
            "title_similarity": "0.6165113"
        },
        {
            "id": "h1i31kj",
            "score": 4,
            "text": "Define \"trace amounts\" ?\n\nA study of drivers pulled over while under the effects of Fentanyl gave samples showing numbers generally higher than 7 ng/ml (of blood) but less than 20.\n\nSome autopsies of overdoses show around 500 to 700 ng/ml, but generally any number over 20 is potentially fatal especially in smaller users\n\nThe famous case George Floyd supposedly had 11 ng/ml and was showing some very low amounts of norfentanyl, which means his body had just started to break the drug down, something not seen in overdoses as the drug generally kills before its decomposition starts.  This is one of many factors that lead all the medical experts brought in for the trial of Chauvin to the conclusion that George Floyd did not die of overdose, that he was murdered.",
            "title_similarity": "0.7540417"
        },
        {
            "id": "h1i5l6l",
            "score": 1,
            "text": "I have inoperable pancreatitis and end up in the hospital every few months. They gave me my usual daily meds of morphine and oxycodone in addition to fentanyl and demerol. I never felt high, but relieved that the pain was lessened. Pancreatitis pain is a bitch. Since my last hospital stay, I have discontinued the morphine because my liver is compromised, but it's been awhile since my last hospitalization because of a super strict diet. \nWhen I am in hospital,  the nurses do hang around in my room doing work on their computers and whatnot. I thought it was because it was quiet, I don't watch TV or have visitors, and I'm always in a room by myself. I guess they were keeping an eye on me.",
            "title_similarity": "0.67256224"
        },
        {
            "id": "h1i5xam",
            "score": 1,
            "text": "Another complication comes from the fact that fentanyl is often administered using a skin patch, not a tablet. \n\nWhen the patches hit the street, people will cut them into small pieces for the user to suck on. The problem is that the drug isn't evenly distributed across the whole patch, so one section may have more of the drug on it thank another. It makes dosing very inaccurate.",
            "title_similarity": "0.6481969"
        },
        {
            "id": "h1i6kp8",
            "score": 2,
            "text": "I’m an anesthesiologist and I use fentanyl routinely (on patients, not on myself).  We dose fentanyl in micrograms, with the normal bolus dose being 25-100 mcg for a non-intubated patient.  So very often you’ll read an article saying “ONLY 1 MG CAN KILL YOU”, but in reality, 1mg is a massive single dose of fentanyl (1000 mcg).  The other side of the story is that fentanyl has synergistic effects with other drugs (alcohol, benzos), so smaller doses are required to have lethal effects if you are already wasted on other stuff.",
            "title_similarity": "0.7131639"
        },
        {
            "id": "h1i6sm9",
            "score": 1,
            "text": "iirc opioid drugs have a greater risk of killing the opiate naive people than it does opiate takers(hence the 'cold turkey' for smack users from hollywood etc. withdrawal doesnt kill you. alcohol cold turkey detox however CAN kill you). For some people with NO opiate exposure, depending on them and their circumstances, even a small dose compared to 'average'(based off less naive opiate users) may potentially kill someone even whilst being small.\n\nIt was really important when I used to work in MH that any opiate user who wanted an opiate like drug that we confirmed they WERE the habitual users they said - as giving them a 'hit' could kill them if they never actually did take that drug. By the same token with alcohol users we had to be careful to NOT undermedicate them and assume they poss took more than they said and ensure we gave detox alternatives as their withdrawal could kill more than the drugs given to them instead could.",
            "title_similarity": "0.7473408"
        },
        {
            "id": "h1i762a",
            "score": 1,
            "text": "It's because it's administered in micrograms. There are 1000 micrograms in a milligram. How precise are the measuring instruments that the people who intentionally cut street drugs with fentanyl use?",
            "title_similarity": "0.6722077"
        },
        {
            "id": "h1i7r0n",
            "score": 1,
            "text": "I got wisdom teeth removed a few weeks ago and they used fentanyl for the sedation. I was scared when they said that’s what they use. But for another 5 seconds I felt like god. Then next thing I know I’m at home. Trained people really know how to administer the stuff.",
            "title_similarity": "0.66226906"
        },
        {
            "id": "h1i7sgg",
            "score": 1,
            "text": "Heroin dealers lace their dope with Fentanyl and they don't know anything about dosage. They do that because they cut the heroin with baby aspirin and other powders that weaken the product. To compensate, they add this fentanyl which a small amount is a high. A few years ago a car was contaminated in my town with Fentanyl and they had to call out people in hazmat suits to tow the car away.",
            "title_similarity": "0.7608291"
        },
        {
            "id": "h1i8ix8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1i9ckq",
            "score": 1,
            "text": "Ex opiate addict here. The problem with most drug over doses is quality control. \nAt the end of the day you have a non regulated product being sold to consumers. The amount of fentanyl being added to the product is not consistent. So people will take the same amount as what their “normal” dosage had been for them in the past, and get a surprise large % of fentanyl.",
            "title_similarity": "0.7286976"
        },
        {
            "id": "h1i9i0w",
            "score": 1,
            "text": "Fentanyl is a drug in hospitals.... But it is dosed in micrograms and accurate dosing.\n\n\n\n\nWhen you mix up micrograms and milligrams... Things go bad.\n\nFentanyl isn't even a good drug to get high off of which is ironic.   A good dose only last 20 minutes.   Ambulances use it because it takes your pain away but when you get to the hospital you can remember your pain to tell the doctor what's going on.   If you keep having to re-dose every 20 minutes it's not a great drug so it's really only used pre-hospital",
            "title_similarity": "0.7916795"
        },
        {
            "id": "h1ib4b6",
            "score": 1,
            "text": "In EMS we typically start with 25 mcg, which is a very small dose, and titrate for effect up to 100 mcg.  Lethal dose is somewhere around 2 mg, so this well below that level.",
            "title_similarity": "0.51075906"
        },
        {
            "id": "h1ien6v",
            "score": 1,
            "text": "Difference is hospitals get the fentanyl from a trusted pharm company, cartels get it from China off some sketchy site so the purity is questionable at best. Hospitals typically try to save lives good for business, sadly if cartels make something strong enough to kill someone the ppl run to it faster because no drug addict wants to feel like they didn't get their money's worth",
            "title_similarity": "0.70493877"
        },
        {
            "id": "h1ifocm",
            "score": 1,
            "text": "I cared for my father in the last years of his life. Alzheimer's put mom in a nursing home so dad wanted to die at home. I took early retirement and moved in with him. When he passed there were a few Fentanyl patches left. Suffering from a back injury for more than 30 years I was very curious as to the effects/benefits of the patches. Common sense prevailed and I gave all remaining meds to the visiting nurse. Even though I applied the patches to my father on a regular basis, due to all the news etc concerning overdoses I didn't want to risk it.",
            "title_similarity": "0.6269259"
        },
        {
            "id": "h1ifqr6",
            "score": 2,
            "text": "There's also what is known as synergism between drugs. If the fentanyl is mixed with something else, whether it be heroin or a common cutting agent like tramadol or xylazine, it can cause much stronger effects in total than either of the drugs would separately.",
            "title_similarity": "0.5565047"
        },
        {
            "id": "h1ihhdb",
            "score": 1,
            "text": "You drink a shot of whiskey nothing happens, (hospital) you drink many times the precise point at which you get alcohol poisoning, you die",
            "title_similarity": "0.601975"
        },
        {
            "id": "h1iiet7",
            "score": 1,
            "text": "I apparently lack an enzyme that breaks opioids down into their painkillers. I can take seemingly any amount of an opioid and not feel a thing from it.\n\nOP got me curious though. As someone who can’t break down opioids am I still at risk of ODing on them if taken too much? When I was younger, before I knew I had this problem, I’d get prescribed opioids for various reasons and I’d take more than the recommended dose. I didn’t do this to abuse it. I did it because I was trying to get any kind of pain relief. I’d take the dose and not feel a thing. So I’d take another dose, and another. Nothing. Eventually I’d just give up and focus on doing other things to not think of the pain. I didn’t know any better and wasn’t thinking of any dangers. Looking back on it now it probably wasn’t the greatest idea.\n\nIt sucks because if I ever have to visit a doctor because of an injury I always try to specifically ask for a non-opioid pain reliever. This just leads to being questioned and treated like a drug abuser. They give in and prescribe me the standard 800mg of ibuprofen. Ibuprofen works well enough for pain relief though so I tend to stick to that.",
            "title_similarity": "0.61597896"
        },
        {
            "id": "h1iiuhw",
            "score": 1,
            "text": "It's mostly dosage like others say. Your average drug dealer isn't separating the exact safe microgram amounts for each \"serving\", and the tiniest amount of the stuff is deadly.\n\nBut from experience losing a loved one, people taking drugs recreationally aren't taking great precaution with their health while doing so. Trace fentanyl (he didn't know about) and a large amount of alcohol killed my family member. In a hospital, you're not likely to be plastered, plus they are monitoring and can course correct if any vitals are out of line.",
            "title_similarity": "0.7346091"
        },
        {
            "id": "h1ij188",
            "score": 1,
            "text": "The primary reason was already answered (basically, fentanyl stronger). Additional note though, even those that are used to certain opioids can have issues with other opioids. The primary receptor that the drugs are acting on is the mu-opioid receptors, but there are different sub-types of those receptors and each opioid will have differences in how tightly they bind to each receptor sub-type. Even if you are used to something like morphine and you went and stole some fentanyl from the pharmacy or something (so you know it's not adulterated) and figured out how much to give yourself, there's STILL a chance you could OD. Opioids be a nasty beast.",
            "title_similarity": "0.7643569"
        },
        {
            "id": "h1ikdu7",
            "score": 1,
            "text": "A more eli5 answer is that a normal dose of fet is so small, you can't even see it. Once there's enough powder to actually see the drug, you have a lethal dose.\n\nIn this way, heroin users can be fine using the same batch for days, then suddenly they get to a part that has a tiny lump of fet in it, and they od.\n\nThat's why it's so dangerous. Let alone the fact that a pain patient on fet can theoretically just take larger doses of weaker opiates. It paints the picture that drug companies invent stronger meds like this just to kill off the addict population",
            "title_similarity": "0.7519113"
        },
        {
            "id": "h1ikuaw",
            "score": 3,
            "text": "Definitely not ELI5 and doesn’t even really answer the question but there is something you can look up call the “therapeutic index” of a drug. It is the ratio of how much it takes to be toxic vs how much it takes to be effective. It’s one measure of the danger of a drug. From that perspective, fentanyl is actually fairly safe (index of 400) vs morphine which is less safe (index of 70). Insulin (used to treat people with diabetes) is extremely low, like 2-3. That is why treatment of type 1 diabetes is so precarious. Hopefully somebody learned something new today!",
            "title_similarity": "0.720881"
        },
        {
            "id": "h1il6fh",
            "score": 1,
            "text": "It's also important to consider that if fentanyl is mixed with other opioids or depressants that the effects are amplified, and the deadly adverse effect is usually respiratory depression; your breathing slowing down to a dangerous rate because you're so sedated. \nYou'll be drowsy and unaware that you won't wake up if you fall asleep. So yeah, as he said in the first comment, monitoring after giving the med is extremely crucial.",
            "title_similarity": "0.7282388"
        },
        {
            "id": "h1ilyes",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1imk2m",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1ink3f",
            "score": 1,
            "text": "The ratio it's often described in terms of the effective therapeutic dose vs the ld50 which is the dosage which would be fatal to half of the recipients. It's a statistical amount value because there isn't one size fits all. The closer the effective and lethal doses (LD50) are the more dangerous the drug is in terms of likelihood of someone having a fatal overdose, especially if they're self administering, untrained and even more so if they don't know that they are administering it. \n\nWhen you get down to drugs with extreme potency it also becomes much harder to physically determine the dose outside a controlled environment. For the sake of analogy imagine trying to tell the difference between a pinch of salt and 1.5 pinches of salt by eye. It's super hard to do. If you discoved 10 pinches in 10 litres of water with equal concentration it would be much easier as you would now be able to extract either 1 litre or 1.5 litres which are significantly different amounts.  The way hospital doses are administered and checked is more like the second scenario.\n\nThat said, accidental overdoses can and do happen in hospitals. The last reason it's less dangerous in hospitals is that you're much more likely to have narcan and trained medical staff around in hospital than a random house.",
            "title_similarity": "0.7495461"
        },
        {
            "id": "h1io3yu",
            "score": 1,
            "text": "Hospital fentanyl is made in a lab and dosed by drug companies. A 1ml 50mcg dose is what it said it is. \n\nBlack market made in an unregulated lab or otherwise manufactured in a sketchy way is ????  No clue. A lot of times my overdose patients didn’t even know they were taking something with fentanyl. It was in their heroin or cocaine. It was in black market “percocet” they bought. Prince overdosed from black market vicodin. \n\nI work in an icu and give fentanyl almost every shift I work. It’s great in lower doses for procedures. It’s great to infuse continuously fir sedation, especially because it depresses breathing. That’s great if I want you calm and synchronized with a ventilator (highly monitor by staff). It’s not so great at a party when you stop breathing and have a cardiac arrest.",
            "title_similarity": "0.7844261"
        },
        {
            "id": "h1ioqdh",
            "score": 1,
            "text": "As others have said, it's the difference between a lab and a basement kitchen.  \n\nThink of it as a chocolate-chip cookie recipe. A big company that sells them has a certain liability to consider. If they mess up, they will have a big lawsuit on their hands. So they invest in very precise measuring scales, a research lab that's spotless, and technicians that are educated and experienced. They need to be extremely careful to make absolutely certain that there are only 5 chocolate chips in each and every cookie. No more, no less.  \n\nCompare that to a street-level dealer. All he knows is that he has enough fent for say, 1,000 doses. Most of his cookies will have 5 chocolate chips....but some of them will have 4, or even 3. Others might have 6 or 7. On *average*, they'll have 5, but some will have more and some less.  \n\n7 chips in a cookie will kill you.",
            "title_similarity": "0.5901646"
        },
        {
            "id": "h1ipsc6",
            "score": 1,
            "text": "Two women OD on that shit in my alley just last night, one dropped in the middle of the street and the other slumped over a trash can. It’s a rough neighborhood, high school football star,18 three weeks from graduation, was shot in the face on the block last month. They were trying to kill the hooker/“snitch” as pay back of talking to cops. He was in the wrong place wrong time. Rip KJ. \n\nThere are five of us neighbors that have gotten to become very friendly and we all active look out of trouble and watch each other’s properties. Kids all hangout together, drugs and shit sucks here right now but we have a strong block of good people and I refuse to yield my ground to these citizens that need help or their suppliers that are only trying to make their way through economic oppression and surviving to only way they were taught. Schools around here have failed the young black men of my community. And as a sad consequence of their hustling lifestyle we have now lost our shining star.",
            "title_similarity": "0.57158494"
        },
        {
            "id": "h1iqf3p",
            "score": 1,
            "text": "Therapeuric dose is 25-100 micrograms if a patient has no tolerance.\n\nA fatal dose is around 2mg with no tolerance. \n\n\n\nSo, this is actually a very safe opioid and is purposely used because of the good safety ratio and the short duration of action and lower rate of respiratory depression compared to other opioids. \n\n\nThe issue is when you have people on the streets dealing with the pure powder. A safe dose is the size of a grain of sand, if that. Even the tiniest fuck up can kill people because of how potent it is by weight.\n\nEven just weighing a different drug on the same scale that was used to weigh fentanyl has lead to fatalities.",
            "title_similarity": "0.6605103"
        },
        {
            "id": "h1iqfak",
            "score": 1,
            "text": "What /u/Yeti_MD said, but also note that fentanyl in most hospitals is only used in the emergency department, during anesthesia (where most hospital fentanyl is used), and in the few hours after a surgery. It is not used to treat pain routinely because it's very powerful and the half life is relatively short. It's much easier to overdose someone on fentanyl around the clock in a hospital than say dilaudid, morphine, or oxycodone. **The biggest difference between fentanyl and most other opioids is fentanyl has a higher incidence of chest wall rigidity**. That means besides stopping the drive to breath like most other opioids, fentanyl causes your chest to be rigid and makes it more difficult to breath, so you stop breathing faster (respiratory arrest) among other problems. That said, the aforementioned departments are well equipped to deal with a patient not breathing. \n\nI administer fentanyl all the time for sedation, and occasionally I'll have a patient stop breathing or have an obstructed airway. It's honestly not a big deal if that happens. Most of the time you can open their airway or use a bag to deliver oxygen for a few minutes until they're more alert. I very very rarely will need to give narcan, and I have stuff to put a breathing tube in if necessary.",
            "title_similarity": "0.731879"
        },
        {
            "id": "h1iqwgd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1iryao",
            "score": 3,
            "text": "To keep it ELI5 - it's simply the dosage.\n\nIt's kinda like tequila: 1 shot is slightly buzzed, 10 shots is piss-on-yourself drunk, 20 shots is (most likely) dead. Now if morphine is tequila (the more commonly used pain medication), then fentanyl is SuperTequila that's 100x more strong. 1 shot of this stuff is 100 shots of normal tequila.\n\nIn the ER, they have eyedroppers to measure this stuff so 1 drop = 1 normal shot. Out on the streets, these dinguses are trying to measure super tequila with a shot glass - it doesn't work and people die.",
            "title_similarity": "0.6453887"
        },
        {
            "id": "h1it2ay",
            "score": 1,
            "text": "Fentanyl is used as an anesthetic and an analgesic. \n\nWhen used as an anesthetic it's part of general anesthesia which is only used, except in the case of Michael Jackson, in an intubated patient connected to a ventilator or manual ventilated using an Ambu-bag. In other words they wouldn't use a face mask with an ambu-bag under general except in primitive or emergent circumstances.\n\nWhen used as an analgesic it used for cancer patients who have built up a tolerance to morphine and similar narcotics to the point where it's ineffective and impractical to use when Fentanyl is many times more powerful and is available. The dose given to a cancer patient could be 1000 times more than the LD50 for a person without an opiod tolerance. Also as the cancer is terminal there is certainly less to lose if an overdose does kill the patient. Usually these patients may only have a week to live.",
            "title_similarity": "0.8107244"
        },
        {
            "id": "h1iu9vt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.12138525"
        },
        {
            "id": "h1iugbe",
            "score": 1,
            "text": "Just to add to what others have said about it being better controlled dosage and purity; another major factor is the fact people don't know they're taking it. Many people who die from it are people who are taking other drugs but have it contaminated with fentnyl. This means the people who take large amounts of Xanax (a physically safe substance, but not mentally dafe neccerserily) but it is has fentnyl (a very unsafe drug in higher dosages) mixed in they then die from that. This is the situation of most of the deaths by fentnyl and for those who used to know Lil Peep this is what happened to him.",
            "title_similarity": "0.77348936"
        },
        {
            "id": "h1iunx4",
            "score": 1,
            "text": "Cancer all of last year. The radiation was a “killer” in terms of pain. Doc was so helpful, she told me beforehand that I would need fentanyl. Got 50m patches for weeks, eventually I moved down to 25s (my own decision), then 12.5s. That shit puts you in a happy cloud that tells you you’re in a normal place. I can see how some folks take great risks and amounts of $$. Demerol was also “global” in the way it makes you feel. These drugs and others take you down a road many don’t come back from. Also addiction is a special kind of hell. No surprise there.",
            "title_similarity": "0.6899123"
        },
        {
            "id": "h1iwpl6",
            "score": 2,
            "text": "You probably already got your answer but start by thinking of a sugar cube.\n\nA sugar cube size block of water is 1 gram.\n\n1 gram is 1000 mg. So consider splitting the sugar cube accurately into 1000 parts.\n\n1 of those parts, 1mg is equal to 1000 micrograms. So split the sugar cube into another 1000 parts... equally.\n\nNow you have basically split the sugar cube into 1 million equal tiny parts.\n\nIf are intending to be medicated you would start with 25 to 100 of those tiny pieces.\n\nThe amount is so tiny and so strong it's difficult to measure... you can't do it visually.  \n\nThe other issue with illegal drugs is they are diluted with other things to increase volume... sometimes fentanyl is diluted with other illegal drugs which adds more risk.\n\nThe short answer is that there is no reliable way to know how much fentanyl you are putting into your body if it is obtained illegally. So the amount (visual volume) of 1 batch that got you high might kill you from a different batch.",
            "title_similarity": "0.48979425"
        },
        {
            "id": "h1ixj76",
            "score": 1,
            "text": "As others have said the danger is proper measurement and dosing. Generally when you receive medications they are measured in milligrams (mg). Fentanyl is measured for dosing in MICROgrams (mcg) which are 1/1000 of a milligram. 100mcg = 0.1mg. It is very easy to use too much especially when you consider the person doing it is likely untrained and ignorant of proper procedure. The other issue that has an effect is there are several types of fentanyl, some of which are considerably stronger. Lastly, dealers only care about the bottom line and have no problems using untested and unregulated \"research chemicals\", many of whom are made in China. The last variable is the supply chain. It is likely that an heroin bought on the street has passed from multiple people before reaching the end user and there is a strong chance that every person who touched it cut the product again without regard to what the last person did. So you might have pure heroin cut 10 different times and there is no way to tell how much is actually in there without lab testing.\n\nThere was a scene in the show Ozark where someone decides to spike a supply and they literally throw a big handful of fentanyl on top of a large container with no measuring or mixing. This lead to some bags being almost all fentanyl which ended up causing overdoses.",
            "title_similarity": "0.66160786"
        },
        {
            "id": "h1iygj5",
            "score": 1,
            "text": "Because those giving it in hospitals (mostly) know what they are doing. Fentanyl is fantastically good at stopping respiration, even in awake patients. Just if my patient stops breathing, I (being an Intensivist) know how to support their breathing for the couple of minutes it takes for them to start breathing again.\n\nWhat isn't much appreciated is that fentanyl redistributes very quickly, and over time starts to leech back into the circulation. Biphasic respiratory depression is something I've had to treat a couple of times, even as long as 4 hours after the first does had been given.\n\nFrankly, you'd have to be insane to use fentanyl recreationally. Tolerance to the euphoric effects occurs more quickly in some than tolerance to the respiratory depressant effects. Essentially, drug addicts keep taking more and more, not realising that they've stopped breathing. Then they die.",
            "title_similarity": "0.6736521"
        },
        {
            "id": "h1izteo",
            "score": 1,
            "text": "I’m pretty late but I have another way of explaining that hopefully will help someone.\n\nFentanyl is not some big scary drug, but it does have its dangers if used incorrectly. See the main difference between fentanyl and say heroin, is that fentanyl is *much* more potent than heroin. \n\nNow that doesn’t mean that fentanyl is *better* in any way, not even for street use, all it means is the desired dose is very small.  As someone else mentioned, it may only take 25-100 *micro*grams to be effective. You wouldn’t even be able to see a microgram of fentanyl without a microscope. \n\nSo if you take the correct dose of fentanyl, it works wonders. It’s very cheap to make, since the dose is so small (and other factors).\n\nThe problem with it though, is when it gets mixed in with heroin on the street. Some dealer along the chain thinks, “hey, I can throw a little *razzmatazz* into my cheap shitty heroin and people will think it’s good!” \n\nWhat then happens is some poor person takes that heroin, not realize there is an undisclosed amount of fentanyl in it. If that dealer added one too many grains of fentanyl, it’s an easy overdose. \n\nFentanyl and heroin are fine drugs that can be administered safely, *as long as all doses of the drugs are known.* the reason that there are so many fentanyl deaths are due to the fact that fentanyl is mixed with heroin (bad idea due to dosage differences of the drugs) and street users don’t know how much fent is in their heroin. \n\nIt’s a very very dangerous mixture that would be completely solved if everyone knew exactly what was in their product. If there were regulations in place and heroin and fentanyl were street legal and you could buy it at the pharmacy, with clear and accurate doses, there would be *far* fewer deaths.",
            "title_similarity": "0.61257434"
        },
        {
            "id": "h1j1n3q",
            "score": 1,
            "text": "It all comes down to what we in the pharmacy profession refer to as the Therapeutic Index.\n\n This is defined as the dosage where a drug becomes effective and the effect can be measured until it becomes ineffective or lethal. Drugs like Cannabis have a WIDE therapeutic index, whereas with drugs like fentanyl have a razor thin index. This means the difference between an effective dose for pain relief and a potentially fatal dose is not a big difference at all, and the slightest error in dosing can be incredibly serious.\n\nGood thing, as others have said, that in medical settings we have trained professionals who can reverse or mitigate overdose at a moments notice. Street users don't usually have that unless they go to INsite or someplace similar.",
            "title_similarity": "0.7668036"
        },
        {
            "id": "h1j2b4a",
            "score": 1,
            "text": "Fentanyl in the medical setting is weight based dosing, usually 0.5-1mcg/kg. Fentanyl on the street is not. The end.",
            "title_similarity": "0.59125185"
        },
        {
            "id": "h1j2xae",
            "score": 1,
            "text": "Fentanyl is I think don’t take me to task bc I’m not exactly sure of the # but it’s about 100 Times more potent than morphine. To measure it properly it has to be measured in micrograms not milligrams.. Once you are aware of the clinical difference—(a VERY significant gap! —not a gap at all,  but a GRAND CANYON!) —that exists between micrograms and milligrams, (micrograms is THOUSANTHS, milligrams on the order of HUNDREDTHS)—, you can easily see why ppl at the street level who don’t know what they are doing, and are making pressed pills or mixing powdered dope & mixing it with cut, they overdo it, add too much fent, and a whole batch might end up killing a bunch of ppl in one clustered area.",
            "title_similarity": "0.60151595"
        },
        {
            "id": "h1j37cm",
            "score": 1,
            "text": "Im not a doctor so I dont know if this is true or not, but addicts told me that fetanyl has a long half life that lasts longer then the actual high itself. So someone will do fetanyl in the morning, and then at night when they go to take another dose they will take the same size dose but they still have fetanyl in there system from the morning so its more likely they will reach that critical mass point where they OD.",
            "title_similarity": "0.6067331"
        },
        {
            "id": "h1j39qd",
            "score": 1,
            "text": "It’s mostly used as a plaster while it gives out a small amount of fentanyl. Drug users extract them out of them, and use the extractions = high amounts of it.",
            "title_similarity": "0.6779931"
        },
        {
            "id": "h1j63zm",
            "score": 1,
            "text": "Even with heroine, one of us went first. If it wasn't stepped on, you could wind up getting slapped around in the shower. Shooters just ain't pharmacists boss.",
            "title_similarity": "0.5552916"
        },
        {
            "id": "h1j6zjq",
            "score": 1,
            "text": "As an anesthesiologist, I give my patients fentanyl routinely for surgery and pain. Like others have said here, it is done in extremely small, incremental doses with constant vital sign monitoring and supplemental oxygen. Occasionally, I’ll intentionally give enough to stop a patient from breathing, but then I’ll gently and  precisely put a breathing tube in, place them on a ventilator to breathe for them and administer oxygen to get them safely and comfortably through their surgery until the fentanyl wears off. \nEvery so often, and because every body and metabolism is different, I may need to keep a patient intubated or reverse with narcan. But that’s only done super rarely in my practice.",
            "title_similarity": "0.6689267"
        },
        {
            "id": "h1j735g",
            "score": 1,
            "text": "Where i live trace amounts of Fentanyl don’t exist. Heroin has been replaced by Fentanyl which is stronger. Initially overdoses happened as people were not ready for the strength of illicit substances they were using, now the dangers are that street drugs are all mixed and many fentanyl analogs are being sold so no one is truly tolerant to these substances.  Benzos and dirty ingredients (noxious chemicals and poisons) can also be found on these. They keep changing the mix so no one is just using one thing. Hospitals have trained people and specific drug schedules which some other people mentioned better than I did.",
            "title_similarity": "0.7251951"
        },
        {
            "id": "h1j7qij",
            "score": 1,
            "text": "That settles it. There's isn't a single human being but me that can both spell and pronounce fentanyl correctly",
            "title_similarity": "0.3128139"
        },
        {
            "id": "h1ja28t",
            "score": 1,
            "text": "“All things are poisons, for there is nothing without poisonous qualities. It is only the dose which makes a thing poison.”\r  \n\r  \n― Paracelsus",
            "title_similarity": "0.5393162"
        },
        {
            "id": "h1ja458",
            "score": 1,
            "text": "To my understanding, dealers use a coffee grinder to mix fentanyl into their heroin, because they can cut the heroin with fillers and vastly increase the quantity while using a small amount of fentanyl to bring the potency back up. Often the fentanyl won’t get thoroughly mixed into the batch of heroin and there will be small chunks floating around. When an IV user gets a piece of this unmixed fentanyl in their syringe it effectively turns a regular shot into a lethal dose.",
            "title_similarity": "0.7262895"
        },
        {
            "id": "h1jbhu3",
            "score": 1,
            "text": "Fentanyl actually has a higher therapeutic index than morphine, meaning it takes less of a relative overdose to kill you with morphine than it does with fentanyl. But fentanyl's lethal and effective doses are *ridiculously* small, so human error in illicit drug manufacturing is much more likely to accidentally overshoot the lethal dose when fentanyl is involved.",
            "title_similarity": "0.6480228"
        },
        {
            "id": "h1jccub",
            "score": 1,
            "text": "Hospitals use trace amounts.  They're just smaller and more accurate doses than the \"trace amounts\" junkies use.",
            "title_similarity": "0.54865503"
        },
        {
            "id": "h1jdfa8",
            "score": 3,
            "text": "On the other side of the coin i have some experience. Fentanyl drug users do not administer fentanyl patches as prescribed. They either squeeze the gel out of the patch and freebase it, or they put the patches in their mouth so the drug is absorbed orally. Route of administration changes how much of the drug is absorbed by your body at one time (bioavailability). Transdermal administration (as prescribed) is much slower than oral, inhalation, or injection. Effectively, it comes down to dosing and not being able to gauge it accurately when using the patch in ways other than prescribed.",
            "title_similarity": "0.7231045"
        },
        {
            "id": "h1jduml",
            "score": 4,
            "text": "The scary thing here is the continual statement that people in healthcare “give fentanyl all the time”\n\nFentanyl should not be given that often.",
            "title_similarity": "0.663826"
        },
        {
            "id": "h1jfgii",
            "score": 1,
            "text": "They're given in patches which are applied to the skin, too. They're meant to be worn for a couple days. It's a really slow release.",
            "title_similarity": "0.37105572"
        },
        {
            "id": "h1jfo2z",
            "score": 1,
            "text": "The people dying from fentanyl are because a highly concentrated form from China has been added to the heroin people have been using. The users don’t know.",
            "title_similarity": "0.7126969"
        },
        {
            "id": "h1jgj93",
            "score": 1,
            "text": "It kills drug users by surprise. People buy one thing and get another and use it as it was the product they bought. One takes a small amount one takes a large amount to achieve the same or similar high ( cheaper “ I think” fentanyl ,small amount/shorter duration..,more desirable”?” Heroin larger amount larger duration ) Now if someone who was trying to make more money may mix one with another to sell more product at a cheaper price. This leads to deaths. Fentanyl when used in a controlled setting I’m sure is safe or safer than other medications that do the same. I burnt the crap out of my hand and they were giving it to me iv and it wasn’t that effective but the dilaudid iv was so idk.",
            "title_similarity": "0.6987738"
        },
        {
            "id": "h1jgjz9",
            "score": 2,
            "text": "Logically, it can be explained that the medical use is even more \"trace\" than the drug use. Remember that it's all about concentration so a smaller amount than what the druggies use is diluted into a bigger liquid content so that it's easier to use and measure. A lot of medications have their active ingredient in a concentration in the scale of micrograms or even parts per million. You won't see any druggie dealing with such precise doses.\n\nI mean between the medical use and the recreational use the former is a powerful painkilling effect and the latter makes it so you can't breathe.",
            "title_similarity": "0.6822417"
        },
        {
            "id": "h1jiw0x",
            "score": 1,
            "text": "People die from taking pain killers laced with fentanyl so they take a normal amount if the pain killer was an oxycodone which ends up being a massive over/dose of Fentanyl.",
            "title_similarity": "0.8022641"
        },
        {
            "id": "h1jjsae",
            "score": 1,
            "text": "A doctor will give you exactly the amount he means to, whereas billy bob joe your local heroin dealer will eyeball a little fentanyl and mix that in.",
            "title_similarity": "0.69737804"
        },
        {
            "id": "h1jjzce",
            "score": 1,
            "text": "I’m not a professional but I’d think snorting even trace amounts would amplify it’s lethality.",
            "title_similarity": "0.6024999"
        },
        {
            "id": "h1jl4mj",
            "score": 1,
            "text": "Another issue when mixing street drugs is chocolate chip effect: if fentanyl is added to cocaine, its not always (probably rarely)  homogenized(mixed totally evenly throughout), potentially resulting in more fentanyl in one consumers 8 ball vs anothers. When dosing of fentanyl needs to be in the micrograms range, a little extra can be difference between life and death.",
            "title_similarity": "0.6690835"
        },
        {
            "id": "h1jlyzw",
            "score": 1,
            "text": "Fentanyl is usually only given to people with huge tolerance to opiates. Like cancer patients who have been on huge doses of other opiates for years.",
            "title_similarity": "0.62885714"
        },
        {
            "id": "h1jm2eb",
            "score": 3,
            "text": "The best analogy for this is chocolate chip cookies. Ever make chocolate chip cookies and some cookies end up stacked with chocolate chips and others have next to zero chocolate chips? Welcome to unregulated drug production. \n\nThe fentanyl that kills people is that one chocolate chip cookie in a batch that just happens to be loaded with chocolate chips. Then there are other issues like super potent chocolate chips like W-18 or carfentanil. So someone who normally takes the same dose of illicit street fentanyl (ie. eats the same cookie) can have a potentially fatal dose.",
            "title_similarity": "0.65703726"
        },
        {
            "id": "h1jobnr",
            "score": 1,
            "text": "Be informed!! Street drugs are increasingly pure Fentanyl mixed with a variety of powdered substances such as talcum, crushed aspirin and even baby powder. These are masquerading as M-30’s, Xanax, Percocet, Molly and a host of other drugs including weed. They look exactly like the real thing. It’s cheap and creates a huge profit margin for dealers. There is no quality control and people are purchasing and ingesting these thinking they are only going to get the desired high. An amount equivalent to about two grains of salt is all it takes to almost instantly drop you to the floor. Death occurs within minutes. Be informed. Spread the word. Research Fentanyl deaths. This is now reaching the west coast of the United States and it is estimated that one in four street purchases contain pure Fentanyl. These drugs are not laced, they are a pure lethal dose of fentanyl. These deaths are not overdoses. They are poisonings for all intents and purposes. Law enforcement is only in the early stages of understanding the breadth of this problem. Educate your loved ones, educate your schools, start the conversation. This young generation is a pill popping generation, and Fentanyl is dealing death to every facet of society. Every young person is familiar with Snapchat. Snapchat and similar platforms are used to market and sell illicit drugs with seeming impunity. Teens can find a dealer marketing these fake pills and order them for home delivery in under an hour. Educate yourselves and educate your children! This is life changing for families and not in a good way.",
            "title_similarity": "0.6556544"
        },
        {
            "id": "h1joi5u",
            "score": 1,
            "text": "Fentanyl, while regularly used in the clinical setting is a **very** strong medicine. It’s usually given in very small amounts because of how strong it is.\n\nDrug dealers use a powdered version of the stuff to mix with their street drugs (also called cutting). They do this to save money, but it’s hard for them to use safe amounts because the amount of fentanyl it takes to kill someone is not much at all; we’re talking a few grains of sugar worth. So when drug dealers cut their supply with fentanyl it’s very easy for them to put too much.",
            "title_similarity": "0.6849971"
        },
        {
            "id": "h1joytk",
            "score": 1,
            "text": "It has a lot to do with the user not knowing that there is fentanyl present in the heroin, since some dealers mix fentanyl into it. If it's a heavy user then the dosage he's used to might contain a lethal fentanyl dose.",
            "title_similarity": "0.7205645"
        },
        {
            "id": "h1jqpb8",
            "score": 2,
            "text": "The lethal dose of fentanyl is [extremely small](https://www.nhpr.org/sites/nhpr/files/styles/medium/public/201704/carfentanil.jpg). When a couple grains  makes the difference between being alive and dead, it is pretty easy to kill someone with it if your measurements aren't accurate enough.\n\nHospitals can measure it much more accurately than the shady dealer cutting his drugs with it, and if you overdose at a hospital, they have naloxone on hand to save your life.",
            "title_similarity": "0.77474016"
        },
        {
            "id": "h1jrx8b",
            "score": 2,
            "text": "\"Figure out what will *kill me*, and then back it off a little. That's the kind of pain I'm in.\"",
            "title_similarity": "0.56027114"
        },
        {
            "id": "h1ju0di",
            "score": 2,
            "text": "Fentanyl used in a medical setting is high quality (in the sense that it is produced in safe, clean, professional conditions and highly regulated).  It’s shipped in standardized containers and administered in extremely precise doses under the supervision of highly trained medical staff in a controlled setting where emergency medical aid can be given nearly instantly if something goes wrong. \n\nA fentanyl user on the street is self-administering a drug that has been channeled through a black market.  It may have been made in an illegal drug lab and thus is subject to shoddy quality control.  It may have been stolen/illegally obtained from licit sources.  \n\nEither way it’s likely been cut, repeatedly by the time it gets to the buyer. There’s basically no way to ensure precise dosing.  \n\nYou might think you’re shooting what you usually do and get a way bigger hit than you expected.  \n\nYou might be an opiate addict with no fentanyl experience and accidentally take too much.  \n\nIf your tolerance is fucked up for some reason you can OD by taking your usual dose.  For example, addicts held in custody long enough that they start to dry out are at a higher risk of overdosing on release from jail. \n\nOften people will buy what they are told is one drug, but it’s actually fentanyl.  On that issue in my area, there was an issue with dealers selling what appeared to be legit Oxys but actually were counterfeit and contained fentanyl.  \n\nSometimes what you are being told is fentanyl can be something even worse - carfentanyl. \n\nAny number of things like the above can go really wrong when an addict ingests fentanyl, resulting in an OD.  If there’s an OD, the may not have naloxone at the time.  They may do it alone and not have someone to administer aid.  Ambulance can take too long, etc.",
            "title_similarity": "0.6765467"
        },
        {
            "id": "h1ju2dc",
            "score": 2,
            "text": "Speaking as someone taking chemo, this old adage holds true in many cases. \"The only difference between a good medicine and a poison is the dose\" So a few dozen micrograms of fentanyl is a good medicine, a few milligrams is poison. Both would be called 'trace amounts' but only one will kill.",
            "title_similarity": "0.7086336"
        },
        {
            "id": "h1jvajz",
            "score": 1,
            "text": "A lot of times it’s not even pure fentanyl in the pills it’s a fentalogue which is like fentanyl x 500",
            "title_similarity": "0.5509448"
        },
        {
            "id": "h1jw24d",
            "score": 2,
            "text": "Druggies are not administering it in medical doses. They're just mixing it to get high. Junkie math isn't the same.",
            "title_similarity": "0.610047"
        },
        {
            "id": "h1jwu6o",
            "score": 2,
            "text": "Definitely some top comments, but no one has mentioned 'hot shots'. Cutting the drug by street dealers is done by, I presume, a grunt-level moron using an ordinary blender. After a few seconds, the mix is dumped and packaged. The mix is far from uniform so some of the hits will be duds and some will be hot, i.e. lethal.",
            "title_similarity": "0.66699743"
        },
        {
            "id": "h1jwv9b",
            "score": 4,
            "text": "Actual ELI5: This picture should say everything you need to know.\n\n[Lethal dose of Fentanyl](https://www.weho.org/home/showpublishedimage/13250/637014879571000000)\n\nAt the hospital, not only is it only a very small fraction of that amount, but they also very closely monitor how much is ACTUALLY ingested, rather than approximations that are done in street drugs.",
            "title_similarity": "0.80796725"
        },
        {
            "id": "h1jx1v4",
            "score": 4,
            "text": "If I asked you to hold this brick above your head and then let you lift all the weight, you would be find. If I asked you to hold this semi-truck above your head and then let you carry all the weight it would squish you. Why? Because your body has limits that it can handle.\n\n\nThe Limits of Fentanyl the body can handle are VERY VERY VERY SMALL. So if the concentration of the drug is high enough, e.g. it is very pure. the amount that you can put on the end of a needle is enough to kill a human.\n\nWhen a drug is prescribed the amounts are known, controlled, tested, retested, surprise tested, etc.\n\nWhen a drug is bought on the street it is manufactured poorly, cut with other material etc. What one \"dose\" is one week isn't the same as the next and any mistake can literally kill you.",
            "title_similarity": "0.73305017"
        },
        {
            "id": "h1jy545",
            "score": 1,
            "text": "A regular dose is like a single grain of sand. Overdose can be 2-4 grains of sand. Opiates are bad.",
            "title_similarity": "0.5112703"
        },
        {
            "id": "h1jy93i",
            "score": 1,
            "text": "In the hospital they use it in very very low doses. Some of the benefits include more potency than morphine which is the what all opioids are compared to so it is easy to prepare with dilutions. Also it has less active metabolites which can be a problem with other opioids",
            "title_similarity": "0.5678767"
        },
        {
            "id": "h1k16vc",
            "score": 1,
            "text": "Fentanyl dosing is in micrograms. Morphine dosing is in milligrams. \n\nAlso that “trace” amount of fentanyl further potentiates any opioid or narcotics they are on and may cause the depression of the respiratory drive.\n\nEdit: in pharmacology there’s something known as “therapeutic range” and “lethal dose”. These levels are established during clinical trials.",
            "title_similarity": "0.8398345"
        },
        {
            "id": "h1k28b2",
            "score": 1,
            "text": "As a person who has worked in vet med: syringe pumps make life a heck of a lot easier and most practices wont use fentanyl without one and will stick to easier to dose opioids and combine with synergistic drugs.",
            "title_similarity": "0.51912683"
        },
        {
            "id": "h1k6b95",
            "score": 2,
            "text": "Where are you coming up with \"trace amounts?\" \n\nFentanyl is very strong per milligram and doses are very small. Sometimes it is sold as heroin or mixed with heroin. Due to the strength though it is easy for a dose to end up too high, leading to overdose, respiratory depression, coma and death.",
            "title_similarity": "0.60894"
        },
        {
            "id": "h1k9y7k",
            "score": 1,
            "text": "Because hospitals aren't prescribing crack and fetanyl. They're giving you a dose that isn't meant to kill you. Mixing it crack/heroin/coke/speed almost always will.",
            "title_similarity": "0.6554007"
        },
        {
            "id": "h1kaxvu",
            "score": 1,
            "text": "its solved but yeah.\n\nfentanyl administered in a medical environment is premeasured in dosage, high quality stuff, plus used IV on a sober person.\n\nfentanyl on the street however is snorted and that by a person who has used and is used to god what amount of substances in their body. not to mention the absolute unknown source of origin of the stuff. so...",
            "title_similarity": "0.73255837"
        },
        {
            "id": "h1kc0mi",
            "score": 1,
            "text": "That’s why despite I think uppers are generally much safer as people generally feel sensations/ awareness / xyz",
            "title_similarity": "0.249166"
        },
        {
            "id": "h1kckbs",
            "score": 2,
            "text": "It takes very little to kill a person.   It is just mixed in poorly.   You get spots where it is not mixed properly and a person dies.  Pretty simple actually.    Quality control is not high on the street chemists list.",
            "title_similarity": "0.5127007"
        },
        {
            "id": "h1kfkyu",
            "score": 2,
            "text": "My dad went through some insane surgeries and survived. He’s a medical anomaly. He had a fetanyl patch for pain. One day he was acting really fucking weird and it turns out a nurse put one on without checking if he’d already had one, and almost killed him after all of that. Fetanyl is scary.",
            "title_similarity": "0.7640794"
        },
        {
            "id": "h1l2bu5",
            "score": 1,
            "text": "Man.... this hits hard. My neighbor just died from the junk today, and I assume it had fentanyl to blame.",
            "title_similarity": "0.6384692"
        },
        {
            "id": "h1lcf9x",
            "score": 1,
            "text": "Brain is very flexible, and I don't believe it's fully deterministic. I favor free will.. Whole other topic.  And I just remembered the OP asked about fentanyl!  Thanks for the enjoyable time discussing.",
            "title_similarity": "0.4429294"
        },
        {
            "id": "h20xbz2",
            "score": 1,
            "text": "In Germany, for example, it is often the case that addicts steal the fentanyl patches. Even used ones from the rubbish. These patches have the dose unevenly distributed on the surface. When the substance is extracted, the dose is unknown and therefore an overdose often occurs.",
            "title_similarity": "0.7240631"
        },
        {
            "id": "h4ucxqc",
            "score": 1,
            "text": "Not all fentanyl is created equal.  Street fentanyl is often a fake synthetic manufactured in China and smuggled across the border with Mexico.  Synthetics can be thousands of times more potent than FDA approved fentanyl for patient use.  Often fentanyl OD is listed as just that when reported...it is only weeks later that the lab results return confirming that it was synthetic.  Of course you can OD on prescription fentanyl, especially when you are on other meds, you have respiratory or heart conditions, and you take too much for your age/weight.  But the vast majority of OD cases are from synthetics and patients taking it when it was not prescribed legally.",
            "title_similarity": "0.6928259"
        }
    ]
}