{
    "ELI5: why do houseflies get stuck in a closed window when an open window is right beside them? Do they have bad vision?\n": [
        {
            "id": "h1mobyp",
            "score": 6,
            "text": "Tbh they ha e great vision. Doesn't take much to come to that understanding. They can detect even the smallest of changes in the environment and react accordingly. \n\nThe issue with flies when it comes to the windows is they just don't have the cognitive capabilities to understand such problems. They are more of a brute force approach of solving things I.e they would preferably bounce back from the window and come back after bouncing off a few other points. Instead of just analysing the issue at hand devising a solution.",
            "title_similarity": "0.5160537"
        },
        {
            "id": "h1mr0pv",
            "score": 2,
            "text": "There has to be more to this though than it's just a dumb fly, I mean I get that it's brain isn't thinking ok, let's try something else. But at the same time when given a choice and I see the fly going towards my window and open door beside it, it lines up for the window every time. I'm wondering if the fly maybe feels a breeze or something from the open door and doesn't like that and is why it flies to the closed window instead.\n\nI mean considering complete random chance, it's quite astonshing how often it picks the closed window as opposed to the open door long before it has reached the wall so to speak.\n\nThere has to be something to this.",
            "title_similarity": "0.6539768"
        },
        {
            "id": "h1mzecy",
            "score": 0,
            "text": "Aside from the many correct answers in the thread about a fly's limited cognitive abilities and eye structure, there are a few other factors that have yet to be touched on: \n\n**The structure of the window**\n\nA window is a pane of glass surrounded by an opaque frame.  From the fly's perspective, it is like a lake surrounded by mountains.  When you are on the lake shore, you cannot see into the next valley over because the mountains are in the way.  In the same way, the fly cannot see the open window next to the closed one because the window frame is in the way.\n\n**Selection Bias**\n\nWe see a single fly bouncing off the glass, shaking its head, and then mindlessly flying into the glass again, and we think  flies are stupid.  What we don't see is the number of flies that bounce off the glass, shake off the impact and then  choose the open pane and fly away.  What we don't see is the number of flies that choose the open pane first time. \n\nThe smart, well seeing flies escape.  All we see are the stupid flies.  All we see are the flies with bad vision and headaches.",
            "title_similarity": "0.655602"
        },
        {
            "id": "h1mebgj",
            "score": 18,
            "text": "Flies have like a hundred eyes, but each eye basically sees if it's light or dark in the direction it's facing, beyond having barely any brain to think about things they have not tons of visual sense.",
            "title_similarity": "0.5578271"
        },
        {
            "id": "h1mw5u8",
            "score": 0,
            "text": "Can you see a spotless clean window? You know there is a window because you expect a window when there is a hole in the wall and you can see the closed window frame.",
            "title_similarity": "0.6835489"
        },
        {
            "id": "h1ou7ku",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.15491502"
        },
        {
            "id": "h1p4abz",
            "score": 0,
            "text": "In a free world game, you're going too far so you hit an invisible wall. Flies dont know what a window is.",
            "title_similarity": "0.6305329"
        },
        {
            "id": "h1mxuwe",
            "score": -1,
            "text": "In some cases the flies' nervous system gets hijacked by a fungus. That leads them to climb high and latch on to a window screen and then stay there. [Entomophthora](https://botit.botany.wisc.edu/toms_fungi/mar2000.html)",
            "title_similarity": "0.60183793"
        },
        {
            "id": "h1oc704",
            "score": 1,
            "text": "Because they are retarded. Insects keep flying to a against a lamp that burns them alive. If their brains had a source code it would be 5 lines.",
            "title_similarity": "0.62650466"
        },
        {
            "id": "h1mvhly",
            "score": -2,
            "text": "Same reason why some flys get caught in spiderwebs and humans also walk into glass sliding doors.\n\nNot paying enough attention.",
            "title_similarity": "0.74264383"
        },
        {
            "id": "h1muy2g",
            "score": 6,
            "text": "There are 2 reasons to that\n\n1. They have mosaic vision so it's really not of great help as a sensory organ with really poor precision which mainly just works with detecting light and movement.\n\n2. Because of how little information they have and even lesser capabilities of comprehending it, they get stuck with an open window beside them.",
            "title_similarity": "0.6634137"
        },
        {
            "id": "h1mzx6b",
            "score": 36,
            "text": "[deleted]",
            "title_similarity": "0.20364362"
        },
        {
            "id": "h1myazr",
            "score": 26,
            "text": "Part of it, is an issue of scope. They’re only really considering their surrounding vision, in their general vicinity. \n\nImagine you’re on a mountain range, and it’s super foggy, so you can’t see much around you. You’re trying to get to the highest point. You can tell when you’re going up and down, but you can’t see the other mountains in a distance. If you’re at the top of one mountain peak, you can’t guarantee you’re on the *highest* mountain peak. And simultaneously, any direction away from where you are, is an immediate negative from where you are. \n\nThe fly sees freedom. It doesn’t see the window next to him. And traveling away from the closed window, is a step away from the goal. \n\nMoving one step back, to move two steps forward is a pretty complicated strategy for any animal that isn’t a human.",
            "title_similarity": "0.43430388"
        },
        {
            "id": "h1msl7v",
            "score": 270,
            "text": "Top comment by u/atomfullerene when a similar question was asked 6 months ago:   \n   \n\"Flies get into houses because they are searching for food. Flies find food by smell. Smell diffuses through air. So imagine a fly trying to get into your house. If it comes to a closed window, it can't smell food through the window so it ignores it. If there's an open crack at the bottom of the window or an open door or something, it can smell the food and will follow the scent through the opening, which will actually let it get inside, because usually where the smell is going out there is an actual passage for the fly going in. The exception here is screen doors and windows, and sometimes you will see flies buzzing all around those trying to get inside and failing, because they can't follow the smell.  \nFlies bump into glass windows but can't escape because flies, when not following a scent towards food, are attracted to light. Flies aren't very smart, so they usually just home in on the brightest light source. Inside a house, the light source is usually the window. The fly doesn't really understand glass, so it keeps banging against it trying to fly toward the light. It's not smart enough to realize it isn't making progress and search around for another way out.  \nTo sum up: Flies following the light to leave a house tend to run into an impassible barrier (glass) while flies following smells to get into a house tend to find actual openings (open cracks, open doors). So they get in more easily than they get out.\"",
            "title_similarity": "0.71482766"
        },
        {
            "id": "h1mgrgg",
            "score": 962,
            "text": "Houseflies (and most other insects) have rather specialized eyes adapted to navigate in flight. A fly primarily sees what's known as \"optical flow\", i.e its movement relative to stuff around it, which it uses to navigate. It's not adapted to handle transparent barriers like glass (because such barriers just don't exist in a fly's natural environment).\n\nMost animals have significantly worse eyesight than humans - when it comes to generalized daytime vision, humans are among the best, only a few birds of prey have better eyesight.",
            "title_similarity": "0.6195718"
        },
        {
            "id": "h1mq2b2",
            "score": 1315,
            "text": "The concept of transparent glass does not exist to insects.\n\nThe flies are just trying to fly towards the light source they see. Whether or not they are capable of seeing the glass as different from air, they don't understand the concept of having an object they can see through but cannot fly through. To the insect, if they see the light then they just fly towards it. They are incapable of understanding that they cannot fly through glass. Therefore they won't \"know\" too look for an open window. They just keep trying until they accidentally hit the opening.",
            "title_similarity": "0.62934434"
        },
        {
            "id": "h1mcxwg",
            "score": 10302,
            "text": "Flies have very simple brains. Through their evolution it has been enough to fly towards light; then along came us tricky humans and put transparent glass in their way.\n\nIn a similar situation we can observe, learn and devise a strategy to escape. Flies can't, so this is less an issue of vision and more one of brainpower.",
            "title_similarity": "0.46736437"
        },
        {
            "id": "h1ms149",
            "score": 12,
            "text": "This is pretty much a variation of a similar but common question\n\nhttps://old.reddit.com/r/explainlikeimfive/search?q=Flies+circle&restrict_sr=on&sort=relevance&t=all",
            "title_similarity": "0.3923651"
        },
        {
            "id": "h1mvv36",
            "score": 3,
            "text": "Flies only know how to fly :) in the direction of light, wich was enough to survive untill we made windows and other transparent objects.",
            "title_similarity": "0.46125242"
        },
        {
            "id": "h1n01px",
            "score": 1,
            "text": "My brother has a simple explanation for this. \"Think of all the flies outside\" he says. \"there are much more out there than in here. It's just a numbers game that one will get into the house.\" Doesn't mean they meant to. Doesn't mean that they even knew how to. It just happened.",
            "title_similarity": "0.5538926"
        },
        {
            "id": "h1n08o1",
            "score": 1,
            "text": "Their responses to sensory input are pretty simple:\n\n* If they see half the world lighter and half darker, they know which way is up.\n\n* If they see mostly darker and an area of light, they know that's the way out.\n\n* If they feel wind they tend to go toward it.\n\nWindow screens and glass, of course, render these simple rules useless.",
            "title_similarity": "0.4830074"
        },
        {
            "id": "h1n0ote",
            "score": 1,
            "text": "Flies and other insects have evolved for million of years where transparent glass didn't exist, suddenly (200-500 hundred years ago) humans created it and started using it. Evolution is a slow thing so houseflies will need thousands or maybe million of years more before they adapt to a world with transparent glass. A similarly thing happens with bugs that are attracted to light.",
            "title_similarity": "0.52004015"
        },
        {
            "id": "h1n68fe",
            "score": 7,
            "text": "Flies don't have bad vision, just different vision. Their eyes take in light and send it to their brains in the way that helps them survive. It's more like what an almost blind person might see than than what we normally see--light and dark, movement, blobs of colors. If they had fancier eyes, they would need bigger brains to take all the images and make sense of them.  But a fly with a bigger brain would be too heavy to fly and fall to the ground and die.\n\nWe have different eyes and bigger brains that can do more with everything the eye sends to it. We tell ourselves that what we see is what's really there, but people walk into glass doors all the time. We don't do it more because we learn that if something looks like it should be a door or a window, it probably is and there is probably a piece of glass there if we can't see it. Flies just don't know what doors and windows are.\n\nIf we could really see what's really there, we would be able to see bacteria and maybe even viruses and maybe we would see who is breathing out viruses and avoid getting sick. But that would take much bigger, fancier eyes and much, much bigger brains. And we wouldn't be able to hold our heads up and we would fall over and die.",
            "title_similarity": "0.45948562"
        },
        {
            "id": "h1ndeq4",
            "score": 1,
            "text": "I've seen a lot of people bumping into glass, as well. Also, a window is huuuge to a fly. Let's say ~100 times bigger than the length of one. That's like a window of around 200 meters (~650 feet) for a human. That's a big detour when you are relatively simple creature which just wants to go towards the light.",
            "title_similarity": "0.4869731"
        },
        {
            "id": "h1ndffw",
            "score": 1,
            "text": "This is all well and good but can someone ELI5 why flies do laps around a non-existant obstacle in the middle of the room?",
            "title_similarity": "0.48903233"
        },
        {
            "id": "h1nfj3x",
            "score": 10,
            "text": "Others have offered very good explanations, but I’ll try to combine those into one as ELI5 as possible.\n\nFirst, their eyes. Flying insects don’t have eyes like we do, their vision system is wildly different and hard for us to understand. First, their two big compound eyes can be thought of as thousands of individual eyes, each with one or a small number of “pixels” pointed in different directions. When combined these form an almost 360° panoramic view in all directions, but it’s a very *very* low resolution view, their total visual field in all directions might only have as much image information as a 240p YouTube video depending on the species. So while they can get a good feel for their surroundings and recognize certain targets or threats they don’t have sharp detailed vision in any direction.\n\nBut flies don’t just have two eyes. Many also have a set of three “simple eyes” on the top of their head, arranged in a triangle pattern. Each of these isn’t so much an eye as a light detector, and it’s believed that these are for orientation, like aligning the sun with one of these eyes to ensure they keep traveling in the same direction.\n\nThen as others have said flies have very simple brains. They don’t appear to *think* so much as they react to stimulus. When moths fly in circles around a porch light it’s because their brains are wired to keep the moon in a certain part of their visual field to guide them, but when they come across an artificial light they can’t tell that it’s not the moon so they’ll try to follow it the same way, which means looping around and around forever. A simple insect brain can be replicated with a basic computer program, if the light isn’t in this part of the sky reorient yourself until it is, if you see a flower or whatever go towards it. They don’t really reason or plan like more advanced animals do.\n\nAnd of course, no animal is capable of intuitively understanding the concept of windows because that is not a situation that exists in nature, if you can see through it you can move through it. More advanced animals can figure out windows from experience, a cat only has to try to jump through one a couple times before they understand they’re impenetrable, but insects generally aren’t capable of that kind of reasoning and learning. If they weren’t able to fly through it the first time they’ll just try again, because in a sense they aren’t even capable of realizing that they didn’t succeed the first time.\n\nAnd because their vision and brans are so simple insects tend to follow other senses like smell, so houses can mess with that too. If they don’t have a sense to follow their brains will just default to cruise control until they either pick up on something or some other impulse need takes over and causes them to land or return to home base.",
            "title_similarity": "0.63834965"
        },
        {
            "id": "h1nkhw5",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.15491502"
        },
        {
            "id": "h1nl567",
            "score": 1,
            "text": "You are all forgetting a simple reason, there's wind coming in. \n\nThe fly gets pushed back in, and they only know to 'fly to the light to get out'.",
            "title_similarity": "0.4215872"
        },
        {
            "id": "h1npizm",
            "score": 3,
            "text": "Yes! Most insect eyes are actually pretty terrible! There are a lot of reasons for this, but the simplest of those reasons is that the smaller the eye is the less light can enter it, so the less it can see. A little telescope sees fewer stars than a big one.  \n\n\nFor creatures with small eyes, the world is always dimly lit and poorly focused - it's like looking through a first generation cellphone camera. The resolution is terrible, the lens is terrible, and the sensor is half the size of a grain of rice. So really, flies and many other insects (though, not all) visually just react to strong sources of light or things with high visual contrast, and often can't see more than a few feet.",
            "title_similarity": "0.7156074"
        },
        {
            "id": "h1npmzo",
            "score": 3,
            "text": "I think they’re not interested in what you think is inside or outside. They don’t know freedom or being trapped. They just buzz buzz buzzzzzz",
            "title_similarity": "0.53656477"
        },
        {
            "id": "h1nwoi8",
            "score": 1,
            "text": "They’re guided by the light, even if there’s a light breeze going through the open window, all the fly can think about is the fact that there’s an invisible, invincible field stopping it from reaching the light\n\nThis also explains why it comes in, since most windows block light, but a slightly ajar window doesn’t, so the fly goes to the strongest source",
            "title_similarity": "0.5579966"
        },
        {
            "id": "h1o3emf",
            "score": 1,
            "text": "Fly eyes are tuned to detect movement. I don't think they recognize shapes very well. You can easily catch a resting fly by moving your hand very slowly.",
            "title_similarity": "0.48035833"
        },
        {
            "id": "h1o68kf",
            "score": 1,
            "text": "Can you see, from where you stand the ground, the fastest route to walk to a destination 6 miles away? No, you need a larger perspective, like your phone GPS. The fly has a smaller perspective than you do of the distance between the two windows.",
            "title_similarity": "0.41370007"
        },
        {
            "id": "h1o9sgx",
            "score": 2,
            "text": "Flies have very different eyes than us. A files eyes are actually a bunch of eyes in a way. It's sort of like looking through lot and lots of those skinny telescopes all at the same time. \n\nBecause of this any type of movement is instantly captured because if something moves even a tiny bit on one telescope it moves the same way on all of them at once. Because of that flies are very hard to catch. I'm sure you know this if you've tried to sneak up on one.\n\nThe other thing about this type of eye is that it's much more difficult to see details. If you turn a telescope around and look through it backwards the image is pretty small and you don't see much detail. Now imagine looking through a bunch of them backwards and all at once. You'd have a hard time telling if the room even had a window let alone where to find it.\n\nSo that's why flies have a hard time telling the difference between an open and closed window. It's just because they see things differently than we do!",
            "title_similarity": "0.59135425"
        },
        {
            "id": "h1oaq5r",
            "score": 2,
            "text": "The 5yo daughter of a friend of mine answered this question thusly;\n\n\"Flies don't understand glass mummy\"",
            "title_similarity": "0.6091756"
        },
        {
            "id": "h1ofv30",
            "score": 2,
            "text": "Long and short, yeah. Fly eyes are made of many many many lenses in a geodesic ball. While humans have one extremely advanced lens that has tons of features and whistles, the fly eyes are very simple but provide a very wide range of vision that doesn't extend very far. Which is why Flys almost always know if a hand is about to hit them, but seeing something 3 feet away? No dice",
            "title_similarity": "0.39660007"
        },
        {
            "id": "h1ojfv5",
            "score": 1,
            "text": "You only *notice* the flies bashing themselves in the window… the ones that fly right out the window go unnoticed. That said, windows are relatively new, compared to the time flies evolved vision… they can’t see the window and don’t understand the open window beside it, it all looks the same",
            "title_similarity": "0.6436342"
        },
        {
            "id": "h1ok8qz",
            "score": 4,
            "text": "Its like when you get stuck in a job or relationship you dont like for years, because you cant see further than the next hour or day.",
            "title_similarity": "0.4737353"
        },
        {
            "id": "h1on9ea",
            "score": 1,
            "text": "They barely have brains. You’re asking a question about something that basically acts on instinct. \n\nDon’t try and rationalize what a fly does.\n\nThey love shit. They go to shit. They play in shit. That’s about all u need to know.",
            "title_similarity": "0.46796572"
        },
        {
            "id": "h1osfg2",
            "score": 1,
            "text": "I have heard flies follow their nose towards a smell. That’s how they can fly into drinks/rooms etc. but I don’t think they can “smell” fresh air so then they are stuck.",
            "title_similarity": "0.69355416"
        },
        {
            "id": "h1p0rtq",
            "score": 1,
            "text": "Evolution doesn't allow them to process what window is, and that there can be an object you can see through but not fly through.",
            "title_similarity": "0.52820385"
        },
        {
            "id": "h1p4b5v",
            "score": 1,
            "text": "Don’t flies have kaleidoscope vision? Which makes them so fast when you try to seat at them, cause they can see the threat from multiple angles? I thought this was a fact I hope I don’t sound stupid bc that’s what my mom told me when I was a kid I’ve believed that was the case ever since lol\n\nEdit: spelling",
            "title_similarity": "0.51267713"
        },
        {
            "id": "h1p5wqt",
            "score": 1,
            "text": "They do have worse navigation skills than other insects. You should google this to make sure I’m telling the truth, but a group of scientists made a flying robot controlled by a simulation of a fly’s brain, and the robot would just crash all the time, they thought the simulation was wrong, but then they decided to simulate a dragonfly and it flew much better",
            "title_similarity": "0.57543945"
        },
        {
            "id": "h1p6z2c",
            "score": 2,
            "text": "They don‘t know what a window is.\n\nIn their mind they somehow found their way inside this space, but now there is an invisible forcefield blocking the way back.",
            "title_similarity": "0.59457326"
        },
        {
            "id": "h1p7cpz",
            "score": 1,
            "text": "Actually a fly's vision is quite good with each eye composed of thousands of simple, individual lenses which provides an excellent mosaic view all around the fly, which is why they are so quick getting away if you try to swat them. However, as already mentioned, their limited brain capacity doesn't allow them to work out those transparent traps us humans have created.",
            "title_similarity": "0.47038287"
        },
        {
            "id": "h1p8cij",
            "score": 1,
            "text": "It has absolutely nothing to do with the glass, and everything to do with air-flow through an open window. \n\nThe air flowing into your house practically carries them through on a current of air. That same flow is then what prevents them from navigating their way back out again.",
            "title_similarity": "0.55319923"
        },
        {
            "id": "h1pa0jm",
            "score": 3,
            "text": "Okay, so most of the answers I have seen here do a pretty good job of explaining why flies don't see glass (like birds and a lot of other animals, including the occasional human!) but I haven't seen anyone yet explain why they won't fly out an open window (at least I haven't bothered to scroll down that far yet!) and the answer has to do with air flow; an open window will tend to have air flowing through it which affects the direction the fly can fly in and, as most people have a window open to let air in, the air flow will tend to push against a fly attempting to fly out through it, so it will instead try to fly out the closed window near by because there is less air resistance. The trick to get a fly to fly out a window is to open another window on the other side of the house, or room, so that the air can flow in one and out the other; eventually the fly will find the open window where the air is not pushing against them to easily fly out.",
            "title_similarity": "0.5991167"
        },
        {
            "id": "h1pdapk",
            "score": 1,
            "text": "You only see the stuck ones too, not the ones that made it out successful without you noticing. So we think that flies can just never find the open window but in reality it's just because we don't see those ones leave.",
            "title_similarity": "0.6229706"
        },
        {
            "id": "h1pjxyn",
            "score": 1,
            "text": "Flies have incredibly simple vision. \n\nIt’s a mixture of having a compound eye and such an incredibly small focal length. \n\nAlso flys have no way to focus an image or adjust the exposure of an image. \n\nSo essentially they can only see something a couple of feet away; if that. And they can only really see shapes. The advantage of their vision though is that they have an incredibly wide field of view and they are incredible at identifying movement. \n\nAlso because they have a compound eye they basically see in mosaic. Each eye only seem a little bit; but put it all together and you have an image. Generally the more eyes in a compound eye the more detailed the image they see. \n\nThere’s no way to know how the image is actually being processed by the flys brain though. \n\nIt’s unclear but doubtful flies even have a consciousness so they probably don’t even “see” anything. They just react to preset patterns without ever really having a concept that they are doing anything at all.",
            "title_similarity": "0.5020243"
        },
        {
            "id": "h1pp6ry",
            "score": 1,
            "text": "I have a sensor lamp and a fly keeps turning on the light! Like stoppp. Everytime I turn it off a fly just activates it again. \nSo yeah they are attracted to light",
            "title_similarity": "0.36635965"
        },
        {
            "id": "h1pphyd",
            "score": 1,
            "text": "The real question is how flies get stuck between 2window panels. Do they try hard enough that they manage to go through one layer of glass. Are flies magicians.",
            "title_similarity": "0.66672087"
        },
        {
            "id": "h1pqf6v",
            "score": 1,
            "text": "Flies do this deliberately, because word got around the fly community that the buzzing sound against the window is really annoying and since fewer people are having picnics these days, the flies needed a replacement pastime to annoy the crap out of us.",
            "title_similarity": "0.660033"
        },
        {
            "id": "h1ps6wr",
            "score": 1,
            "text": "https://www.reddit.com/r/Whatcouldgowrong/comments/nzgjg6/if_i_try_and_take_the_bus/?utm_medium=android_app&utm_source=share\n\nI am just gonna leave this here...",
            "title_similarity": "0.3132944"
        },
        {
            "id": "h1psvey",
            "score": 1,
            "text": "cool side-fact:\n\nfruit flies repetitively fly in remarkably-close-to 90 degree angles, ‘trying out’ each approach while they seek out the smelliest thing in the room\n\nwatch one move next time its fascinating observing the relationship between nature and math",
            "title_similarity": "0.53087765"
        },
        {
            "id": "h1px95g",
            "score": 1,
            "text": "Simple and smooth brains so they think nothings there, bump into it, think \"why doesnt it work\" and try it again. Some are quiet smart tho and immediatly think of searching for holes or just fly around it.",
            "title_similarity": "0.4440908"
        },
        {
            "id": "h1qdmuw",
            "score": 1,
            "text": "I think it has to do with draught as well. The closed window looks like light without resistance, the open window is the same light, but has resistance (air pressure) pushing against it. Just a guess.",
            "title_similarity": "0.5926801"
        },
        {
            "id": "h1qeyh7",
            "score": 1,
            "text": "Maybe it's your point of view. You don't see the many (smarter) flys going in and out of the unscreened window, just the hapless ones who mistakenly trapped in the screen 🤔",
            "title_similarity": "0.6633604"
        },
        {
            "id": "h1rvqai",
            "score": 1,
            "text": "Small tip : When you try to shoo away a fly in a certain direction, wave your arm in the opposite direction you want her to go. Most of the time they will go the other way.",
            "title_similarity": "0.4543946"
        },
        {
            "id": "h253d6p",
            "score": 1,
            "text": "The clue's in the name \"housefly\", they've evolved to live with us and they want to be in our houses. They'll forget about the closed windows in a few hundred (1000) years, glass is relatively new.",
            "title_similarity": "0.46565974"
        },
        {
            "id": "h2d8fvh",
            "score": 1,
            "text": "I could be wrong but I believe it’s due to how they navigate. Flies use wind/air like a moth uses moonlight to navigate their flight.\n\nOpen windows and doors usually draw air to circulate inwards. Hence when you ‘waft’ your arm they follow it briefly before returning to flight when you draw your arm back. So when a window is open right next to them its blowing inward so they are unable to fly out.",
            "title_similarity": "0.5460587"
        }
    ]
}