{
    "ELI5: How did Germany stop being Nazis after the end of WWII? Did everyone just \"snap out of it\" after Hitler's death?\n": [
        {
            "id": "h47a6h2",
            "score": 1,
            "text": "Hi Everyone,\n\nI'm going to have to lock this post. I know people hate that, and fairly so. ELI5 is an objective and impartial community, we literally have rules specifically banning soapboxing and any non objective topics.\n\nIt is very clear that this topic has both a. been addressed well, and b. is a topic that people cannot restrain themselves from veering into modern politics, particularly US politics. This is not the place for it.\n\nI hope you all enjoy the learning that is still here, and you can let us know in mod mail if you have any questions (but please don't message us because you had a comeback you really wanted to make to someone on the other side of america's bizarre team sport version of politics).",
            "title_similarity": "0.5063392"
        },
        {
            "id": "h478iig",
            "score": 0,
            "text": "They didn't. Those that were caught were arrested were either prosecuted and put to death or jailed and eventually released.\n\nThose that weren't just kept their mouths shut. They kept their hands down and their personal opinions to themselves.\n\nThat's no longer the case. Proof:\n\n[https://www.youtube.com/watch?v=K6bH2fHbt2w](https://www.youtube.com/watch?v=K6bH2fHbt2w)\n\nNazi's are like HIV. You think it's no longer a major issue for humanity, but it's still *everywhere*. It's not as bad of a problem as it was before...but it still is very much a problem.",
            "title_similarity": "0.70810705"
        },
        {
            "id": "h470mxo",
            "score": -3,
            "text": "The Germans honored their surrender. Many of the leading Nazis killed themselves. Others just stopped fighting. There were no sleeper cells like we see in the Middle East, where the government loses but the fighting never ends.",
            "title_similarity": "0.71857905"
        },
        {
            "id": "h470ywz",
            "score": 13,
            "text": "Evil doesn’t stop being evil. Nor does evil just ‘appear’. No matter what label you put on a group, they don’t disappear when they aren’t the majority in power, nor do they suddenly appear when a political party you disagree with assumes power.\n\nThis is the problem with labels. Socialist, Libertarian, Communist, Republican or Democrat…evil people institute evil policies and usually hide it as ‘for the greater good.’",
            "title_similarity": "0.5192164"
        },
        {
            "id": "h47259u",
            "score": 18,
            "text": "A few reasons. A good chunk of Germany didn’t agree with the nazi ideology, they were just in the wrong place. Germany still have veterans earning pensions for serving in ww2. Germany made it illegal to be pro nazi. Another reason is that a lot of Nazis were killed off. Think of it as Darwinism. You also have to remember that being a Nazi was a political party and it didn’t work so people abandoned it. Like how a lot of Russians in other countries are anti communism",
            "title_similarity": "0.74730563"
        },
        {
            "id": "h473sx0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.26874304"
        },
        {
            "id": "h477ab5",
            "score": 26,
            "text": "Hitler put a bullet in his brain and with him died the dream of a 1000 year Reich. The nationalism and propaganda stopped, millions of men had been killed or injured, people were starving living in cities that had been obliterated by bombing, the Russians raped an estimated 2 million women, people had to watch movies on the horrors that occurred in the death camps. Being a Nazi and the promises it once gave kinda lost its shine in a devastated and defeated country now occupied and run by other nations.",
            "title_similarity": "0.73036134"
        },
        {
            "id": "h4766v5",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.26874304"
        },
        {
            "id": "h475l9o",
            "score": 80,
            "text": "To start with, most people weren’t Nazis, but they did agree with them on certain ideas. They did believe the USSR was a mortal threat, various antisemitic conspiracies (which even Churchill believed) etc., but whether they agreed on the obsession with racial purity and the need for exterminating the Jews was another question. These beliefs predated the Nazis.\n\nNow, did they “snap out of it”? Well, no, but being occupied by Allied powers and with the political leadership coming from an anti Nazi background there wasn’t any room for open sympathy. New generations were taught a more honest history, and there is still great shame felt over WWII. On top of this, there are government agencies dedicated to fighting Nazi like groups which threaten the Constitution. Military members are encouraged to place the Constitution and human rights above their orders, there is a division of the intelligence agency dedicated to fighting extremist groups.\n\nHowever, in private, a lot of Nazism remained within Germany, after all a lot of Nazis were still around, and they had kids too. Neo Nazi movements had been a problem in East Germany, but instead of doing anything about it the government covered it up. So there was always this undercurrent, but rather than doing anything about it they tried to downplay it. \n\nThey’re deeply unpopular, so instead they’ve tried to infiltrate the government. The government for its part had take a blind eye to far right extremists, partly because they didn’t take it seriously but also because members of the far right themselves were influencing decisions, often shifting the focus on murders of non ethnic Germans to an Arab mafia and drug trafficking rather than a hate crime. That all came to a head when a man named Franco A was caught. He had been impersonating a Syrian refugee, and was trying to carry out a terrorist attack while pretending to be one. Franco was a high ranking member of the German military and part of the National Socialist Underground, a Neo Nazi group that has infiltrated the government. Since the. The German government has been more vigilant about far right extremism, but we still don’t know the full extent of the infiltration. \n\nAll in all, de nazification had some successes, but the governments have tried their best to ignore the failures.",
            "title_similarity": "0.6602133"
        },
        {
            "id": "h47867z",
            "score": 15,
            "text": "No, quite a few moved away from Germany though, Argentina and Namibia are two locations I know of but there could be more. The remake of the Prisoner was filmed in Namibia and one actor said the local shops sold Nazi memorabilia and the locals spoke of the \"good old days\" and they found the whole place quite creepy.   \nIn Germany there's still plenty of far right supporters but the general culture is very different for example they don't have school uniforms as it's seen as militaristic, freedom is embraced and encouraged and the general attitudes towards life are far removed form Nazism and the positives of this outlook are highlighted.",
            "title_similarity": "0.6224187"
        },
        {
            "id": "h475ttf",
            "score": 28,
            "text": "I haven't seen anyone comment on the fact that the Cold War happened. Germany was split and tightly controlled by the Western Allies and the Soviet Union. The allies searched out and put on trial every Nazi that they possibly could (accept for scientists because the nuclear arms race was on). Meanwhile the Soviets jailed everyone who wasn't on board with communism.",
            "title_similarity": "0.71407074"
        },
        {
            "id": "h47812j",
            "score": 21,
            "text": "If you were a high ranking government official you were shot or hanged, if  you were a low level one you were generally allowed to keep your post as long as you kept your head down (until the 80s in the west and forever in the East), and if you were gestapo you were recruited into the Stasi by the Soviets",
            "title_similarity": "0.57586765"
        },
        {
            "id": "h46vq8y",
            "score": 153,
            "text": "They abolished the party and made it illegal to be a Nazi. They also tried the leaders for war crimes.",
            "title_similarity": "0.7302387"
        },
        {
            "id": "h46xsdc",
            "score": 43,
            "text": "It was an extensive process of education on the part of the allies and the Russians of average Germans, also holding Nazi leaders accountable",
            "title_similarity": "0.49386567"
        },
        {
            "id": "h46ya4w",
            "score": 981,
            "text": "[removed]",
            "title_similarity": "0.26874304"
        },
        {
            "id": "h470d66",
            "score": 219,
            "text": "Germany was full of Nazi supporters after the war. They just weren't in a position to say or do anything about it. The country was [occupied](https://en.wikipedia.org/wiki/Allied-occupied_Germany), its leaders were executed or imprisoned, it was not allowed to have a military until 1955, and it was split into two opposing halves until 1990. The people who emerged from all that were essentially denazified.",
            "title_similarity": "0.7771963"
        },
        {
            "id": "h471zfk",
            "score": 257,
            "text": "[removed]",
            "title_similarity": "0.26874304"
        },
        {
            "id": "h4790bb",
            "score": 184,
            "text": "One really important thing was the Marshall Plan. After WWI the Germans were punished and put in an economic situation that made Hitler's nationalism attractive. So after WWII, the Americans poured a lot of money into rebuilding Germany. This made it much more attractive to give up on the Nazi failure and become part of a more cooperative European and world order.",
            "title_similarity": "0.6751697"
        },
        {
            "id": "h46yasu",
            "score": 922,
            "text": "A lot of people didn't stop. They just stopped talking about the past. Or they talked about their views only in private.\n\nAlso, a lot of powerful people just kept their influence, and the institutions they worked for helped them by keeping quiet so as not to draw negative public scrutiny to the institutions past (there were a lot of outspoken Nazis in academia for example).\n\nAt some point it was then decided that the matter was dealt with and a thing of the past, but in reality victims often did not get justice, and their neighbors still had kept their racist views, and did not treat them better then before.\n\nAt least that is what happened where I am from.",
            "title_similarity": "0.5448925"
        },
        {
            "id": "h471bf8",
            "score": 503,
            "text": "Read up on Dreher's Law... Aside from everything else that's been commented on, much of the postwar law hindered and buried a lot of the past because Nazi judges and lawyers, themselves not held directly responsible for war crimes, had architected the law and continued to serve in the German legal system.\n\nSo it took a very long time to hold these people to account and purge these remnants, to prevent them from continuing to influence German society.",
            "title_similarity": "0.6806948"
        },
        {
            "id": "h474cwt",
            "score": 2231,
            "text": "In addition to what’s been mentioned above, in Germany they teach about the Holocaust. They don’t try and pretend it didn’t happen or that it was just a few ppl participating. They take full blame and teach how it was wrong.",
            "title_similarity": "0.73405814"
        },
        {
            "id": "h4751rc",
            "score": 193,
            "text": "Not at all\n\nBoth east and west Germany had tons of Nazis after\n\nWell into the 60s, many judges etc were nazi supporters\n\nThere's actually quite a bit of info on it, I'd watch the documentary the accountant of Auschwitz  it's a very good film but quite devastating",
            "title_similarity": "0.6198964"
        },
        {
            "id": "h46xspt",
            "score": 9820,
            "text": "There's an old German joke and the gist of it is \"Who were the Nazis\" and the punchline is \"someone else's grandfather.\"  The joke is that clearly many, many people's grandfathers were Nazis, but never yours!\n\nIt wasn't like everyone \"woke up\" and realized they'd been evil Nazis and stopped thinking those things, they just didn't have power any longer because they were literally destroyed by foreign armies.\n\nThey never stopped being Nazis they just lost the ability to be public Nazis.  Maybe some of them changed their minds after seeing the results of the war, maybe a lot did, but plenty didn't too and they didn't go anywhere.",
            "title_similarity": "0.8028494"
        },
        {
            "id": "h46vu2r",
            "score": 14507,
            "text": "There were a lot of politicians the Nazis had arrested or removed from office.  The first leader of West Germany had spent time in a Nazi prison. The US and the Allies had a specific 'De-Nazification' program they used.  It included things like forcing Germans to visit the death camps.",
            "title_similarity": "0.7004639"
        },
        {
            "id": "h478cnl",
            "score": 6227,
            "text": "Time and silence.  \n\nFor 13 years, almost all of the elite had to join the Nazi party.  In 1952, 25% of West Germans admitted to having a \"good opinion\" of Hitler.  In his first official address to the parliament, Chancellor Adenauer (in 1949) said \"The government of the Federal Republic, in the belief that many have subjectively atoned for a guilt that was not heavy, is determined where it appears acceptable to do so to put the past behind us.\"  The German government was generally determined to forget.  \n\nIn 1968, Germany had its own set of internal revolutions, where the baby boom children grew up and protested against the crimes of their fathers, so to speak.  This was helped along by the fact that the actual chancellor, the third in the history of West Germany, was himself a former Nazi and a party member from 1933-1945 who served under Ribbentrop.  https://en.wikipedia.org/wiki/Kurt_Georg_Kiesinger#Early_life_and_Nazi_activities\n\nThey made it illegal to continue to be a Nazi or to support Hitler, but for the most part, if you were a Nazi and said \"sorry about all that Nazi stuff\" the German government was fine with it.",
            "title_similarity": "0.6807324"
        },
        {
            "id": "h46vn65",
            "score": 51,
            "text": "[removed]",
            "title_similarity": "0.26874304"
        }
    ]
}