{
    "ELI5: Why is canned soda always so much colder than bottled soda, despite them being in the refrigerator just as long, or long enough to where they should be just as cold?\n": [
        {
            "id": "h7z566a",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.13433678"
        },
        {
            "id": "h7z7rz8",
            "score": -2,
            "text": "Metal has freely moving electron that move throughout the metal thus transferring temprature and electricity",
            "title_similarity": "0.19547084"
        },
        {
            "id": "h7zx736",
            "score": 0,
            "text": "And as a follow-up question, why does soda in a glass bottle taste like ambrosia compared to the same drink out of a can that tastes like liquid sugar",
            "title_similarity": "0.5820446"
        },
        {
            "id": "h7zkdyg",
            "score": 4,
            "text": "Because metal is exceptionally good at transferring energy, and temperature is a form of energy.  This is why we use metal to cool things off (heat sinks on computers), to evenly heat things up (baking sheets that are used in the oven), and many other uses.\n\nFun facts about most metals:\n\n- Metal gets longer or shorter when they get hot or cold respectively.  This is important in bridges, where special gaps and joints must be designed to accomodate it.  Also, because of this the SR71 Blackbird was rumored to be designed to take this into account and supposedly leaked while it was on the ground, but not in flight, because in flight temperatures caused the metal to expand and create more secure connections.\n\nEdited: added in rumor and supposedly to the SR71 allegory.  I'm not an expert.\n\n- Baking sheets can be used to help defrost things faster.  Stick your frozen object on the sheet and the increased surface area will work in the exact opposite way of a heat sink and warm up your object faster.",
            "title_similarity": "0.6067476"
        },
        {
            "id": "h7zpvqm",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.13433678"
        },
        {
            "id": "h7zitl2",
            "score": 2,
            "text": "Plastic bottle of soda will get cold more slowly, as plastic insulates the soda, holding in its warmth. And the plastic bottle will not feel as cold at any given temperature as a metal can.\n\nMetal can of soda will get cold faster, as metal conducts heat more readily. And a metal can of soda will feel colder than a plastic can at the same temperature.\n\nSo the plastic bottle may actually still be warmer than the can, but even if it isn’t, it can easily still feel warmer than the can.",
            "title_similarity": "0.74422306"
        },
        {
            "id": "h7zoaye",
            "score": 0,
            "text": "I’ve found that when I keep the soda in the fridge and not in my large intestine it is crisp and cold.",
            "title_similarity": "0.7175068"
        },
        {
            "id": "h7zqr9v",
            "score": 0,
            "text": "Add on to the OP, do cola companies have different recipes for their colas based on whether or not it is canned, or, bottled in plastic or glass?\n\nI've found that the only way I can stand a standard cola is from a soda fountain or a can. Any other vessel tastes strange to me.",
            "title_similarity": "0.6836383"
        },
        {
            "id": "h80g38s",
            "score": -1,
            "text": "Glass is an insulator. Aluminum is a conductor. That goes for heat as well as electricity. ;-)",
            "title_similarity": "0.3832758"
        },
        {
            "id": "h81j4ct",
            "score": -1,
            "text": "Becaus plastik isent aktualy air tight and the fizzy carbonation cools the drink ,metal cans hafe a smale layer of plastic but the metal aktualy makes it air tight not the plastic .",
            "title_similarity": "0.6481944"
        },
        {
            "id": "h7yu0k9",
            "score": 311,
            "text": "Plastic is a semi-decent insulator, and glass is an excellent insulator.  Aluminum, in contrast, is a very poor insulator.\n\nWhen all three are put in the fridge, the aluminum will transfer the heat out of the soda very quickly, meaning that the can will cool very fast. Plastic will take a bit longer, as heat doesn't transfer as well to plastic, and glass will take a very long time, as glass does not transfer heat well at all.",
            "title_similarity": "0.80577666"
        },
        {
            "id": "h7ytrdt",
            "score": 71,
            "text": "[removed]",
            "title_similarity": "0.13433678"
        },
        {
            "id": "h7z6b1z",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.13433678"
        },
        {
            "id": "h7zeat6",
            "score": 27,
            "text": "So what you feel when you touch something, is not the temperature of the object, but rather, how quickly heat is leaving (if the object is colder) or entering (if the object is hotter) your body. The faster heat leaves, the colder it'll feel, and vice versa if hot (the faster heat goes in you, the hotter it'll feel). \n\nLook around you in your room, do you see anything out of metal? what about anything out of wood (furniture or a book)? Both of them have been in the room long enough to be at the same (room) temperature. Now place a hand on both of those object and you'll feel like the metal object is colder than the book (wood item). This is because the metal object conducts heat faster through it, and therefore, the heat from your hand leaves your body faster while you're touching it. therefore feeling 'colder'. The same applies to the canned drink vs glass drink. Aluminum (spelled aluminium questionmark) [higher heat conductivity metal] conducts heat faster than glass [lower heat conductivity, i.e. insulator). \n\nHeat conductivity is also why your frying pan is made of metal (so the heat from the range can get distributed along the pan faster and heat up the food for cooking) while the handle of the same pan is made of wood (lower conductivity and doesn't heat up, allowing you to hold it without burning your hand).",
            "title_similarity": "0.6748896"
        },
        {
            "id": "h7z6oyl",
            "score": 168,
            "text": "[removed]",
            "title_similarity": "0.13433678"
        },
        {
            "id": "h81cfeo",
            "score": 86,
            "text": "False premise. The temperature of the liquid is exactly the same given the same conditions.\n\nYour hands perceive the Aluminum can as being colder because the aluminum more readily conducts temperature than the plastic or glass bottle",
            "title_similarity": "0.6401746"
        },
        {
            "id": "h7z3wvy",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.13433678"
        },
        {
            "id": "h7yu2vr",
            "score": 13964,
            "text": "When you touch something and it feels cold, that's because heat is leaving your body and flowing into the cold object. This is called thermal conduction, and different materials conduct heat at different rates. This is measured in Watts per meter Kelvin, and **the higher this number is, the faster a material conducts heat**. \n\nGlass has a thermal conductivity coefficient around **0.8 W/mK**. Aluminum's is around **239 W/mK**. That's a big difference! If you measure the temperature of both liquids right out of the fridge, they will be the same temperature. But the one in metal feels colder in your hand because it is taking heat from you faster than the one in the glass bottle. This means that the drink in the glass bottle will actually stay colder for a longer period of time, since it will take longer for the liquid to absorb the same amount of heat. \n\nFun fact: this is also why the benches in saunas are made of wood, not metal. Wood doesnt conduct heat quickly enough to be uncomfortable or to burn your skin in the kinds of temperatures a sauna creates, but metal can.",
            "title_similarity": "0.7627736"
        },
        {
            "id": "h7z93yi",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.13433678"
        },
        {
            "id": "h7zly99",
            "score": 1,
            "text": "Aluminum cans absorb heat faster so they will cool down the beverage faster than glass. That being said, they will also warm up faster once they are out of the fridge.\n\nThe mass of the glass will take longer to cool, but once it's cold, it will help to keep the beverage colder longer. \n\nWhen they are both thoroughly cold overnight in the fridge and you touch them, the glass will be slower to shed it's coldness into your finger, but the aluminum will shed it's coldness very rapidly.",
            "title_similarity": "0.7683099"
        },
        {
            "id": "h7zth74",
            "score": 1,
            "text": "Thermal conductivity. I once saw a great example: dude put an icecube on a flat piece of aluminum and another ice cube on a flat piece of plastic and the aluminum melted ice faster",
            "title_similarity": "0.6813415"
        },
        {
            "id": "h7zw24k",
            "score": 1,
            "text": "Not sure if it's been mentioned but when opened you get a drop in pressure, a drop in pressure requires movement, movement requires energy. \n\nSo when you open a can the temp drops a few degrees, not sure what the difference is between bottles and cans pressure wise but apparently co2 can leak through plastic over time so lower pressure, might be the reason, might not but it's an interesting thought train",
            "title_similarity": "0.65883243"
        },
        {
            "id": "h7zw54g",
            "score": 1,
            "text": "I made a beer cooler out of a clean display transmission housing once. \n\nFucking worst cooler ever LOL. We had to feed that thing ice all day long.",
            "title_similarity": "0.7568362"
        },
        {
            "id": "h7zxd0v",
            "score": 1,
            "text": "Wet papertowel wrapped around aluminum beer can in the freezer for about 10 minutes is perfect temp",
            "title_similarity": "0.6173166"
        },
        {
            "id": "h80adxn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13433678"
        },
        {
            "id": "h80cptp",
            "score": 1,
            "text": "Lots of people saying the same thing: aluminum conducts better than plastic.\n\nNot one person mentioning the fact that aluminum cans are normally smaller than plastic bottles.",
            "title_similarity": "0.5267564"
        },
        {
            "id": "h80ctz7",
            "score": 1,
            "text": "To add on to this question, why does soda in a can taste so much better than soda in a plastic bottle?",
            "title_similarity": "0.59837747"
        },
        {
            "id": "h80f1q7",
            "score": 5,
            "text": "As an extra note. There is a reason that plastic bottles taste different and less fizzy. [plastic is more permeable to CO2](https://www.news.com.au/lifestyle/food/drink/science-has-revealed-why-coca-cola-tastes-better-from-a-glass-bottle-than-a-plastic-bottle/news-story/346cf098c70d217bdc69d4d653034b07)",
            "title_similarity": "0.6302276"
        },
        {
            "id": "h80m2jl",
            "score": 1,
            "text": "You don't feel the temperature of the bottle or can. If they were both in the refrigerator long enough, they are at the same temperature. What you feel is your hand getting warmer or colder from being in contact with the can or bottle. So, the can is taking warmth from your hand much faster than the bottle. As a result, the can is worse at keeping the soda cold.",
            "title_similarity": "0.8508316"
        },
        {
            "id": "h80s42h",
            "score": 1,
            "text": "It's probably not colder. It just feels more colder to you due to better thermal conductivity.",
            "title_similarity": "0.49180326"
        },
        {
            "id": "h80wk0f",
            "score": 1,
            "text": "Aluminum transfers heat and cold better and faster than glass. Glass is actually an insulator and prevents energy transfer.",
            "title_similarity": "0.6446843"
        },
        {
            "id": "h80wx5g",
            "score": 2,
            "text": "They don't get colder but they cool down faster, and you can feel the cold in your hand as you drink it.\n\nIf you put a 2 liter of soda in the refrigerator at the same time as a 12 pack of soda, there is less volume of soda per can to cool down, so heat leaves it faster. The material holding the soda in the cans also transfers heat faster than plastic so the time it takes the cans to cool down is less than than 2 liter, although they will both reach the same temperature eventually.\n\nBut; Even if you left both soda containers in the refridgerator for a day, when you took them out you'd still be holding either a cold can or a room-temperature glass that is itself adjusting to the contents inside it, and incidentally slightly warming the drink up. The sensation of holding something cold in your hand and feeling something cold on your lips while drinking adds to the feeling that the beverage is itself cold.\n\nTo recap: Canned soda cools down faster due to the material it is held in and because it has less volume. Further, drinking out of a chilled container like a recently refridgerated soda can feels colder because the more of your own body's surface area is touching something that is cold.",
            "title_similarity": "0.7628481"
        },
        {
            "id": "h80y6wj",
            "score": 1,
            "text": "There is more air in a soda can than there is in a glass bottle. When a gas expands (i.e. when you open it) it cools down. In the case of the can, this could conceivably chill the drink itself by an appreciable amount more than what would happen when you open the glass bottle.",
            "title_similarity": "0.72721213"
        },
        {
            "id": "h8118xf",
            "score": 1,
            "text": "The faster something heats up the faster it will lose the said heat. With alluminum cans that means that it will take the heat in faster meaning it will feel colder and it will also mean it cools off faster in the fridge. A",
            "title_similarity": "0.7426574"
        },
        {
            "id": "h81bkxt",
            "score": 1,
            "text": "I think it’s because canned soda can conduct cold better than plastic does. This way, it can keep the drink cold for a longer period of time",
            "title_similarity": "0.7377488"
        },
        {
            "id": "h81enn8",
            "score": 1,
            "text": "This has to do with how well of a conductor v insulator the material is. Aluminum is a bet conductor so it feels colder. It is tranfering cold out of the system quicker so its colder to touch",
            "title_similarity": "0.7045382"
        },
        {
            "id": "h81ik2x",
            "score": 1,
            "text": "Temperature works a bit differently to bodies that create heat themselves and those that don't.\n\nThermal conductivity does only part of the job, since static objects will still get cold, but it will take longer time.\n\nWe create heat ourselves, so touching cold can is a battle of how fast can it take the heat away from you vs how fast can you produce the heat. That's why objects with very little thermal conductivity like styrofoam can be touched for long time despite extreme temperatures because we exchange temperature faster than styrofoam.\n\nWind also increases thermal conductivity. That's why the same temperature feels colder when wind blows and that's why our computer components are cooled when the air from fan blows. Computers generate heat like us.",
            "title_similarity": "0.7039571"
        },
        {
            "id": "h81jsqp",
            "score": 1,
            "text": "Why do sports drinks like Gatorade always feel cooler at room temp than say.. a can of cola?",
            "title_similarity": "0.68435997"
        },
        {
            "id": "h81rsgs",
            "score": 2,
            "text": "When I read that post I didn't realize OP meant cold to the touch....when holding the can or bottle. I would ask the same question, but as it pertains to drinking the liquid. To me, a bottle of coke always seems colder when I drink it versus when I drink the coke out of a can.",
            "title_similarity": "0.7279484"
        },
        {
            "id": "h81sa43",
            "score": 1,
            "text": "It is not, the surface of the container feels colder because it is made of aluminium, and metals in general CONDUCT heat more than glass. So heat leaves your hands faster, making it cold faster.\n\nIf you hold both in two hands LONG ENOUGH then both will feel the same level of cold",
            "title_similarity": "0.7269978"
        },
        {
            "id": "h81ux9v",
            "score": 1,
            "text": "The can is metal, metal stays at the same temp for a lot longer than plastic and plastic doesn't absorb temperature around it as fast as metal",
            "title_similarity": "0.62564087"
        },
        {
            "id": "h81wwih",
            "score": 1,
            "text": "Because metal is a better conductor of heat than plastic thus more thermal energy can leave the beverage",
            "title_similarity": "0.4961824"
        },
        {
            "id": "h82gv1o",
            "score": 2,
            "text": "It isn’t.  It’s likely the same temperature.   \n\nBut it FEELS colder because the rate of heat transfer from your finger is much faster on metal than on glass.   \n\nLet your tongue and mouth do the temperature judging. 😉 \n\nNow go have a soda and report back",
            "title_similarity": "0.7714233"
        },
        {
            "id": "h82qlcc",
            "score": 1,
            "text": "I can’t stand to drink soda from a plastic bottle. Lots of places don’t even sell cans anymore.\n\nA can feels cold to my hand and to my lips and mouth. And I swear it just tastes colder and the experience is completely different. I know that doesn’t make sense. \n\nEither way I put it in a glass or cup  full of ice. Can’t get it cold enough for my taste",
            "title_similarity": "0.77570015"
        },
        {
            "id": "h8qoh9n",
            "score": 1,
            "text": "Why not just say the can is metal and bottles are Plastic so quite naturally it would be colder or feel colder 🤷🏿‍♂️🤦🏿",
            "title_similarity": "0.69088984"
        }
    ]
}