{
    "ELI5: The maximum limits to human lifespan appears to be around 120 years old. Why does the limit to human life expectancy seem to hit a ceiling at this particular point?\n": [
        {
            "id": "h8o8xw5",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.18694523"
        },
        {
            "id": "h8oab9t",
            "score": 15,
            "text": "Interesting that this is mentioned in the Bible.\n\n“Then the Lord said, “My Spirit shall not abide in man forever, for he is flesh: his days shall be 120 years.””\n‭‭Genesis‬ ‭6:3‬ ‭ESV‬‬",
            "title_similarity": "0.6521548"
        },
        {
            "id": "h8omajh",
            "score": -1,
            "text": "When mankind had become corrupted in the period preceding the flood, God said: 'My spirit shall not abide in man for ever, for he is flesh; his days shall be a hundred and twenty years' (Gen. 6:3).",
            "title_similarity": "0.52888155"
        },
        {
            "id": "h8oszb3",
            "score": 0,
            "text": "Easy answer:\n\n> 3 And the LORD said, My spirit shall not always strive with man, for that he also [is] flesh: **yet his days shall be an hundred and twenty years.** (Gen 6:3 KJV)\n>",
            "title_similarity": "0.53793836"
        },
        {
            "id": "h8oi3k6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.18694523"
        },
        {
            "id": "h8p3goq",
            "score": 1,
            "text": "Genesis 6:3 KJV\nAnd the Lord said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.",
            "title_similarity": "0.53017795"
        },
        {
            "id": "h8odnj5",
            "score": 48,
            "text": "[removed]",
            "title_similarity": "0.18694523"
        },
        {
            "id": "h8p3kca",
            "score": 17,
            "text": "Genesis 6:3 NIV\n\nThen the LORD said, “My Spirit will not contend with humans forever, for they are mortal; their days will be a hundred and twenty years.”",
            "title_similarity": "0.5693201"
        },
        {
            "id": "h8q14is",
            "score": 4,
            "text": "Trust me the last thing you want is for human life to be extended any further, you think the mega wealthy are cunts now just wait till they live forever.",
            "title_similarity": "0.46758044"
        },
        {
            "id": "h8nd66i",
            "score": 4,
            "text": "I’ve actually heard 150 being a max. I’m curious where the 120 comes from though. I suppose one major factor is that DNA only being able to replicate so many times. Our ability to replace tissues when cells die or become damaged diminishes. There’s a couple of documentaries covering this topic. I remember learning about the discovery of cancer and how it was first thought the “fountain of youth” was discovered because the cells seemingly were able to replicate forever.",
            "title_similarity": "0.5441078"
        },
        {
            "id": "h8oqdyw",
            "score": 0,
            "text": "IMHO, the further we get away from the perfection that had, and lost, the lower our lifespan, and raises our chances of health and wellness issues.",
            "title_similarity": "0.40512377"
        },
        {
            "id": "h8ossqy",
            "score": 0,
            "text": "People live too long as is. Old relatives that live longer are actually a financial burden. Thats why theres so many living facilities for them. Can you imagine how over populated the world would be if people lived longer than that. Half of China is already ninjas plus immortality! Its impossible",
            "title_similarity": "0.50551546"
        },
        {
            "id": "h8pb20o",
            "score": 0,
            "text": "Would it be possible to live longer than that in the future with new medicines and technology?",
            "title_similarity": "0.4737665"
        },
        {
            "id": "h8pc21o",
            "score": 0,
            "text": "There was this great book I read about 10 years ago (and I can't find it) about why we die. There are like 7 reasons what the body goes through, and if you were to overcome those obstacles you wouldn't.\n\nBut it seems like, as u/pieiscool points out, that our cells get damaged over time, or the DNA is a bit off, and errors start pilling up. Usually this makes cancer, but these small errors over a 100 years can make body functions cease to perform their functions well. This was one of the 7 reasons why our bodies give out. \n\nA source point in the book was a guy who has been trying to make a perfect computer prediction model for weather for 30 years and is still working on it. I'm trying to find the source/book but have been unable to. Was a good read.",
            "title_similarity": "0.55851936"
        },
        {
            "id": "h8pnk5n",
            "score": 0,
            "text": "This may be insightful: https://link.springer.com/chapter/10.1007/978-94-010-0199-1_2\n\nWe could look at the science behind it, but we could more easily see *why* it happens if we look at the source. I find it fascinating that for a large portion of history (since Moses wrote the Pentateuch and Torah around the 5th century, depending on your stance and worldview), we knew that Man's age was capped at 120 years. We didn't know about DNA, but we as humans knew about God. Everyone knows about God - Even the demons fear and shudder at the thought of him. You know that there is a God, where else would base morality come from? No normal human being grows up thinking that it is perfectly fine to murder everyone. No one will honestly say that stealing is right, all of which point to a divine creator.\n\nSimply put, Man (the race, all human beings), are fallen. God will not contend with us forever, and decided to cap Man's lifespan at 120 years. Before that, it was not uncommon for normal human beings to live to 500+ years. \n\nThat would have been cool to be the child of a guy who had been living for 600 years. Boomer to the max.\n\nCitation: https://www.biblegateway.com/passage/?search=Genesis+6&version=NASB",
            "title_similarity": "0.67482185"
        },
        {
            "id": "h8potsy",
            "score": 0,
            "text": "Not an answer to your question and I don’t believe it myself, but it’s interesting that “120 years” has evidently been observed as an effective limit on human aging for a long time. \n\nGen. 6:3  Then the LORD said, “My Spirit shall not strive with man forever, because he also is flesh; nevertheless his days shall be one hundred and twenty years.”  \n\nI interpret that as someone needing to write down something and used the observed limit of age in human society at their time, but it’s still interesting to see it show up 1500 years ago.",
            "title_similarity": "0.6851492"
        },
        {
            "id": "h8qejwc",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.1997865"
        },
        {
            "id": "h8r6jd0",
            "score": 0,
            "text": "This isn’t an answer, and I also do remember hearing about telomere lengths shortening per cellular replication in biology. But, on a very interesting coincidence, the 120 year age limit can be referenced biblically:\n\n3 Then the Lord said, ‘My Spirit will not contend with humans forever, for they are mortal; their days will be a hundred and twenty years.’”\n‭‭Genesis‬ ‭6:3‬ ‭NIV‬‬\n\nI remember seeing that and being curious on what the average human lifespan is.\n\nEDIT: *can be referenced biblically",
            "title_similarity": "0.6357838"
        },
        {
            "id": "h8ranko",
            "score": 0,
            "text": "Well the life expectancy was usually around 30 years and years ago. We don't have the technology to live longer *yet*",
            "title_similarity": "0.71073776"
        },
        {
            "id": "h8rclcg",
            "score": 0,
            "text": "Actually, God wanted to shorten the lifespan of man kind because they were corrupted.  I’m thinking it’s because of 800 year life span, people had more opportunity to sin and it was more temptation than a person could resist.  God doesn’t tempt people past their limits.  That’s why he flooded the earth.  The lack of genetic diversity meant it was more likely that both parents carried the genes for certain disorders.  Over the next generation’s the lifespan on mankind lowered down to 120.  There are a few people that have lived a little more but there hasn’t been a verified account of any recent people living much longer than that.  So basically the copier thing everyone else said but with compatibility issues with the human genome.",
            "title_similarity": "0.53256744"
        },
        {
            "id": "h8rg9jj",
            "score": 0,
            "text": "We take in oxygen, and then breath C02\n\nOxygen is this (O)\nC02 = (COO)\n\nThe C, is carbon... \n\nYour body is carbon. \n\nEvery time you breathe out more carbon atoms, you die quicker. \n\n\nImagine that is like a car, the car requires oil, which then any contaminates  of said dirty oil will be needed to be filtered, if it goes in a tube, it must be clean and not leak, if it  is a container, it must be clean and not leak, the adapters to the hoses and the containers must be clean... There is filters for that oil, but it needs to perform the job well, we can replace the filters for some of organs, but not all of them, we cant replace tubing, we can't do a oil swap for all the blood in your body, we can't do an insulin flush, we can't do a virtual flush, we can't do a bacterial flush... \n\nOur body's are very complicated, and we still don't know how to make the body perform better and last longer.",
            "title_similarity": "0.3909998"
        },
        {
            "id": "h8rh270",
            "score": 0,
            "text": "From what I know, our ancestors lived longer; some of them lived around 1000 years. So 120 years is nothing. But I wonder why the lifespan is increasing again after it kept decreasing historically?",
            "title_similarity": "0.7122842"
        },
        {
            "id": "h8rhye7",
            "score": 0,
            "text": "A lot of people have mentioned copy of a copy and telomeres. They arent actually hard limits to our age (from a physics perspective) . \n\nOne of the main reasons is that for from an evolutionary perspective living longer isn't valuable since very few survived long enough from sicknesses and carnivores, and the extra life just didn't benefit our species to be optimized via evolution.",
            "title_similarity": "0.40816727"
        },
        {
            "id": "h8rkliv",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.18694523"
        },
        {
            "id": "h8oqm4d",
            "score": -1,
            "text": "Simplified answer.\n\nThe same way women have x amount of eggs, cells have x amount of copies, and each copy is worse than the previous one.",
            "title_similarity": "0.37046933"
        },
        {
            "id": "h8ozr5t",
            "score": 1,
            "text": "These ELI5 answers seem a bit over even my adult head! Here's a stab at an ELI2:\n\nThe human body is a lot like the shoes we wear. They can last a long time if properly cared for. You never see them get damaged while walking. However, if you look at your shoes over the months and years the soles wear out.\n\nThe human body does the same thing. Over time and work things wear out and eventually stop working.",
            "title_similarity": "0.46224526"
        },
        {
            "id": "h8p5tk5",
            "score": 1,
            "text": "Most people treat life like it's an all-out sprint (*see; die early*) rather than the marathon it is.\n\nThe sprinters reproduce, their kids inherit some of the same sprint-to-death energy. The marathoners reproduce, their kids inherit some of that same longevity. People's genetics likely require precedent for the scaffolding of longevity, and the more precedent there is (*see; long-time survivors in your family tree*) the more likely the offspring are to contribute to the genetic precedents (*genetic snowball of likelihood - cuts both ways for stuff like heart disease and drug addiction as it does for stuff like longevity*).\n\nHumans can probably keep pushing the boundaries of their lifespans but the real question would be... why bother pushing at that particular ceiling?\n\nAside from existing (*which given the ever-increasing cost of living appears to be increasingly disincentivized*) what exactly is the net-positive benefit of people living to be 200, or 300, or 400 - most of which will be spent as an emaciated, fragile skeleton that requires the TLC of a registered health practitioner?\n\nAnd then when people live twice as long they'll need to spend twice the time in the workplace (*80 year grind*) until they can retire? Or three times? (*120 year grind*) Four times? (*160 year grind*).\n\nEw, no.",
            "title_similarity": "0.46896318"
        },
        {
            "id": "h8pb18i",
            "score": 1,
            "text": "A lot of others are making it more complicated than it needs to be. We have a limited lifespan because our bodies are programmed to stop trying to stay alive. Nature has simply built into us, and all animals, a limitation to our lifespan on purpose. There are multiple mechanisms that work together to make sure we don't live too long. There are many reasons that a programmed lifespan is good in evolutionary terms, but mainly, if parents never died then eventually there would be no resources left for new children and only disasters would kill the adults. Without natural death, adults would need some way to stop having children only when the resources ran out, and since intelligence is limited, nature basically just found it easier to make all adults have a limited lifespan instead. The reason humans live 120 years, and other animals live different lifespans isn't really well understood. Some believe that we have fairly long lifespans compared to other animals is because our children need parents to care for them for many years before they can survive on their own. However, some species of parrots have lifespans almost as long as ours and their children don't need nearly as much care as ours do, so it's clearly not the only reason.",
            "title_similarity": "0.40604025"
        },
        {
            "id": "h8pc3dk",
            "score": 1,
            "text": "We rely on replicating our shit every couple of days/weeks/whatever, eventually something goes.wrong in that copy and it snowballs into dead",
            "title_similarity": "0.36814898"
        },
        {
            "id": "h8pwej1",
            "score": -1,
            "text": "According to ancient Sumerian tablets,  which are the earliest known writing,  when the Annunaki altered human DNA they limited the lifespan.  If I remember correctly,  to 130 years.  But hey,  it's just a coincidence that nobody ever lives past that age right?",
            "title_similarity": "0.69253784"
        },
        {
            "id": "h8qrloj",
            "score": -1,
            "text": "Interestingly, in the Bible this limit is put on humans by God in Genesis sometime before the flood. \n\n“Then the Lord said, \"My Spirit shall not abide in man forever, for he is flesh: his days shall be 120 years.\"”\n‭‭\nGenesis‬ ‭6:3‬ ‭ESV‬‬\n\nIn Christianity, we believe that we will eventually be translated to a new body that is spirit, like Jesus’ body was when he was resurrected. Human bodies die, spirit doesn’t.",
            "title_similarity": "0.6369387"
        },
        {
            "id": "h8ob5gw",
            "score": 39,
            "text": "[removed]",
            "title_similarity": "0.18694523"
        },
        {
            "id": "h8nvkov",
            "score": -2,
            "text": "Entropy. \n\n&#x200B;\n\nThe longer you live the more likely random events will affect your body. So your body goes through a process that can result in a chaotic event. Could be cancer, blood clot or other random unlikely event.",
            "title_similarity": "0.45228198"
        },
        {
            "id": "h8qf80g",
            "score": 2,
            "text": "Stop with all the religious references and false beliefs. No person ever lived to be a thousand years old or even hundreds of years old. A long time ago there were 100 times more things that could kill you than today. There may or may not have been cancer but a simple wood splinter then could easily have got infected or an abscess tooth unwittingly would kill a person.",
            "title_similarity": "0.54081976"
        },
        {
            "id": "h8qxk9k",
            "score": -2,
            "text": "Interesting I just had this conversation with my brother the other day.  In the bible, 120 years is the exact age God set for humans.\n\nThen the Lord said, “My Spirit will not contend with humans forever, for they are mortal; their days will be a hundred and twenty years.”\r\nGenesis 6:3 NIV\r\nhttps://genesis.bible/genesis-6-3",
            "title_similarity": "0.667635"
        },
        {
            "id": "h8nd2ib",
            "score": 527,
            "text": "OK, this is based on my high-school knowledge so you know... pinch of salt.\nAs you know our cells divide in order to keep us alive and in good condition. The ting is, cells have a sort of timer called telomere. What this nifty little thing does is essentially a countdown, with each copy of a cell the telomere gets shorter (AFAIR it actually looses some form of membrane/insulation but that's above my pay grade), when there's not enough of if cells start dividing wonky and so we start slowly decaying with age.\n\nAs to why it happens.... 🤷‍♂️",
            "title_similarity": "0.535834"
        },
        {
            "id": "h8oosnt",
            "score": 3,
            "text": "Wasn't it proved to be 150 recently?",
            "title_similarity": "0.56166506"
        },
        {
            "id": "h8qdda5",
            "score": -4,
            "text": "Because it was written in Genesis.  Humans want to play God, especially the oligarchy billionaires, and think we can solve all problems ourselves.  That’s why the world is all banged up. Because billionaires will stop at nothing to live forever from injecting themselves with other peoples blood to other weird occultic stuff so god just made clear since the early days - 120 years.  I’m glad too- imagine Bezos living forever? We’d have one company only.  We should count of days and make the best of them and stop trying to become immortal",
            "title_similarity": "0.49004573"
        },
        {
            "id": "h8nhd0x",
            "score": 26,
            "text": "The short version is that our body parts (particularly organs) wear out over time, and as of right now we don’t have the technology to create new ones. The only way to replace organs is with a transplant, and no transplant committee is going to approve giving a kidney to an 80 year old because statistically they’ll be dead in a few years (at most they’re getting like 15 years out of it, whereas a 20 year old could get 60-70 years). \n\nAlso, as we go through life and cells divide more, the risk of many cancers increases. Our approaches to cancer are improving, but they’re still relatively reactive as opposed to proactive. Certain cancers (such as pancreatic cancer) are still effectively a death sentence.",
            "title_similarity": "0.5353052"
        },
        {
            "id": "h8ofj8v",
            "score": 3,
            "text": "Aging research is wild! There are some crazy animals that you don't expet to age, like naked mole rats. Crazy stuff they are finding out.\n\n\nAging is completely tied to reproduction. In natural selection, the genes that are best suited to the environment leading up to reproduction are the genes that get passed on. However, the genes that were selected before reproduction might have detrimental effects after reproduction, but since they occur after reproduction they are not eliminated from being passed on. \n\n(This is kind of hard to conceptualize, imagine a creature with perfect coloring for their environment, lets say a mouse that is green and blends into grass. However, after a certain amount of time that coloring starts to turn bright red making them super visible, but it happens after reproduction. Then all the green mice do well, produce a ton, but then have a shorter life span than other brown mice because they all turn red a year later.)\n\nThe more an organism reproduces over it's lifespan, the more likely these detrimental gene effects are eliminated. Trees are a great example here. They produce thousands of offspring over their long lives. If a detremintal gene effect occurs, then the offspring of that tree die and they end up having less offspring, while the other trees that didn't have the detrimental gene continue to reproduce, slowly eliminating the later-in-life detremintal gene effects. This is belived to be the reason why trees have such a long lifespan.\n\nSince people produce so slowly and stop at a young age we have the same detremintal genes pretty much across the board. Weakening hearts, brain failure, arthritis, all that stuff is believed to be from negative effects from genes that are beneficial before reproduction. If older people in their 90s could reproduce, human life spans would be much different.\n\nEdit: wanted to add an example of an animal that should have a longer lifespan than it does. Octopuses have a complex nervous system that is very costly to build. It gives them an enormous amount of abilities to be incredibly efficient predators. But.....they die after reproduction. The females spend their final days defending their eggs. So, octopuses only live 1-2 years even though their nervous system rivals ours.",
            "title_similarity": "0.2738691"
        },
        {
            "id": "h8pvyyv",
            "score": -4,
            "text": "Because that's what God ordained.  Always remember.  Science continually progress the Bible correct.\n\nGenesis 6:3\nThen the Lord said, “My Spirit shall not strive with man forever, because he also is flesh; nevertheless his days shall be one hundred and twenty years.”",
            "title_similarity": "0.48571047"
        },
        {
            "id": "h8q9du0",
            "score": -3,
            "text": "Man used to live to be over a thousand years old until the great flood. Then man's years decreased to 120. We didn't eat meat until we came out of the ark. The world changed and our diets changed. Look up biblical timelines and look at the ages of the first generations according to Genesis.",
            "title_similarity": "0.66995674"
        },
        {
            "id": "h8nmwqj",
            "score": 58,
            "text": "I remember one of the mythbusters did a special on what if you could live forever. At a certain point our organs fail because they just cant divide and create new cells fast enough and old dead cells cant be cleaned up fast enough. Also something called telomeres have to do with it also. If we could find a way to rejuvenate our organs then we could easily live another 200 years or so. Then I think it said our brains would simply have no room left for new information.",
            "title_similarity": "0.5529695"
        },
        {
            "id": "h8pd4oz",
            "score": 31,
            "text": "There is no hard ceiling. The number has no inherent meaning. The number is just an emergent property of a system in exponential decay. It's just roughly reflects that rate at which people die on average from various things, including diseases and genetic limits.\n\nThink about it like this: Imagine a tomato spoiling in the fridge. Pick several numbers of days. At some point you will find a number where it's vanishingly unlikely you will ever have a tomato last longer than that without spoiling. You can find a number where you will only ever have found 1 or 2 tomatoes that have ever lasted longer than that number and which expired shortly after. That's basically what I mean by an emergent property of the system that has no real value. It's just a statistic. The real interesting stuff is the underlying dynamics that lead to that number. But those dynamics don't care about the number. The dynamics simply exist and act upon the tomato.",
            "title_similarity": "0.4492998"
        },
        {
            "id": "h8ne47b",
            "score": 129,
            "text": "This is a very active area of research and we are not quite sure about all the mechanisms involved. However it looks as if there is a built inn self destruct in our body. Our DNA have what is known as telomeres at the end of them. These are repeating structures which marks the end of the DNA and caps it off. These are also very important to allow the enzymes to copy the DNA when needed. It is not possible to copy from the very begining so they need some sort of dead space where the copying can start from. But this means that every time the DNA is copied these telomeres get a bit shorter. So there is a limited number of times the DNA can be copied and the cells divide.\n\nThere is some mechanisms for making more telomeres. However this is not being done throughout the body. What we suspect is that people who have the ability to regenerate the telomeres might be more at risk for cancer. In general cancer is when the cells start dividing uncontrollably and the limit to the amount of times the cell can divide may be limiting the cancers ability to spread. So extinding the telomeres using some kind of drug might shorten our lifespan due to cancer. The area of active research is if we can somehow controll this process in some way so that we can only extend the telomeres when needed and keep them short to protect against cancer.",
            "title_similarity": "0.3511365"
        },
        {
            "id": "h8ofd5v",
            "score": 27,
            "text": "Great episode of Explained, on Netflix, goes over this. I cannot remember much but it was entertaining.",
            "title_similarity": "0.19039142"
        },
        {
            "id": "h8o65xx",
            "score": 1796,
            "text": "Unfortunately I don't think the \"cap\" itself can really truly be ELI5'd in a super simple way. Researchers are still investigating the underlying mechanisms of aging and it's a multi-factorial problem including the telomeres mentioned in another comment. But here's my non-ELI5 understanding of some of it, as a biology undergrad who has been considering getting into research on this!\n\n(EDIT TO CLARIFY: The following on telomeres is just a part of the aging picture. There are a multitude of factors which I'm not really qualified to try to ELI5, but basically when you're young the body is more resilient to problems so that you can have a baby, and then it doesn't maintain those processes as well later on in time. These factors are the Hallmarks of Aging: https://en.m.wikipedia.org/wiki/Hallmarks_of_aging)\n\nFor the telomeres, they're basically \"extra DNA\" tacked onto the end of each DNA strand since every time DNA is copied, it can't copy a little part of the end (due to some underlying molecular biology stuff). There's a thing called \"telomerase\" which could tack on more of this \"extra DNA\" to lengthen the telomere occasionally.\n\nBut, even if we kept the telomeres by using telomerase, we still ultimately suffer from cancer since that DNA we've been maintaining using the telomerase still eventually gets damaged somewhere in the _middle_ either by radiation or some other causes. The longer we live, the more DNA damage we can accumulate like this, and the more cancerous potential we have.\n\nIn general, the human body's immune system and other things that keep it going are not sufficiently maintained the older we become, for reasons I'm not familiar enough to describe myself. This leaves us continually more susceptible to heart disease, cancer, and general pathology until we succumb to one of these ailments.\n\nSorry I don't have a good full answer, but hope this helps elaborate on some other responses!\n\nIf you're interested in the maximum age and longevity, there's a subreddit which often has research posted for this field: /r/Longevity",
            "title_similarity": "0.3574528"
        },
        {
            "id": "h8of29r",
            "score": 10,
            "text": "I know about the telemere explanation, but something is off here, because clearly our body *can* produce cells with fresh telemeres, otherwise new human life couldn't be produced, because all babies would just use cells with half-used up telomeres from there parents. \n\nSo there must be a way to counter the telemere death.",
            "title_similarity": "0.36866164"
        },
        {
            "id": "h8ocq40",
            "score": 145,
            "text": "The telomeres is one. The other one is that DNA (the genetic code that makes up our cells and what we are as an organism) replication is not error free.\n\nImagine us making mistakes no matter how careful we are, this is what is happening to pretty much any living organism during DNA replication. RNA based replication (e. g. viruses) are even more error riddled.\n\nIn short, it's the natural outcome of living in an imperfect world where every process has error rates. When  your cells multiply enough, so will those \"errors\".",
            "title_similarity": "0.25868016"
        },
        {
            "id": "h8rswir",
            "score": 53,
            "text": "Many of the answers here are incomplete. Telomeres shortening is just one of the hallmarks of aging.\n\n\nhttps://www.youtube.com/watch?v=4yV_UEse-lU&t=18s\n\n\nAging is the accumulation of damage of various types that the body doesn't repair well or junk that the body doesn't clean up well (or at all). Like any machine, it can tolerate a certain amount of damage buildup without affecting performance. Then at a certain threshold, performance starts to drop.\n\n\n120 as a maximum is just the limit the how long a body can go under the luckiest circumstances and genetics (slowest accumulation of damage, and the perfect combination of the rate of each).\n\n\nBut like vintage cars, in theory, if we were to do periodic maintenance, there is no hard limit to how long we could live in a youthful healthy state. The damage is at a cellular level. It's just a matter of identifying the types of damage and junk we need to clean up (we have -- there are seven categories), and developing the therapies to fix the damage or clean up the junk that builds up. This will allow us to rejuvenate the body a little bit, and more as we get better at it. When we get to the point where we can repair and clean up faster than the damage occurs, there is no longer any limit. Most people will then die of accidents rather than aging.",
            "title_similarity": "0.52546924"
        },
        {
            "id": "h8o6djc",
            "score": 14561,
            "text": "Imagine making a copy of a document with a scanner. Every time you scan a scanned document to make a copy it gets degraded. That's what's happening in your cells, a scanned copy of a scanned copy of a scanned copy. \n\nNow your body is doing that every few days or weeks depending on they type of cell. After 100+ years, it just gets degraded to the point where your organs start to fail. \n\nThat's also how we get cancer, if you get a smudge on one of the photocopies and can't read it anymore, then keep photocopying it.",
            "title_similarity": "0.45849493"
        },
        {
            "id": "h8obwi1",
            "score": 1,
            "text": "I agree with the answer by KCPRTV. In addition, body function starts to decrease. Bone starts to mineralize and get weaker. The heart muscle becomes loose because of working your entire life and the Ejection fraction decreases. Kidneys do not filter the waste as well so GFR decreases.",
            "title_similarity": "0.346708"
        },
        {
            "id": "h8ohm19",
            "score": 1,
            "text": "I saw that it's because our hearts can only beat up to 3 billion beats. Animals that like totoises have a slower heartbeat/metabolic system, thus live longer. And animals that live less (like rats) have high bpm/metabolic system, and reach that \"cap\" much quickly.\n\nAccording to that, it is also why athletes and people who regularly exercise, by having a slower heartbeat than most, can live longer (of course other things can affect that but that's the gist).\n\nAll I said is based on [this](https://youtu.be/ivU_q0raZ68) video, by a famous biologist in my country, which have references in the comments (it's in portuguese though).",
            "title_similarity": "0.46668217"
        },
        {
            "id": "h8oi2s0",
            "score": 1,
            "text": "DNA is a blueprint for our cells telling them how to divide and grow new, healthy cells. Over time this DNA blueprint degrades, getting worse and worse, resulting in the new cells  not being as healthy or strong.\n\nThis is what causes aging.\n\nThis aging is the underlying disease that leads to other diseases that eventually lead to death \n\nEdit: There's a lot of context missing and complications glosses over, but this is ELI5, and this is the most concise explanation I can think of.\n\nEdit 2: I wish there was more societal interest in researching how to slow down/stop aging. Aging is not an inevitable law of the universe - it can be stopped completely, leading to much longer and healthier lives for humans",
            "title_similarity": "0.3691622"
        },
        {
            "id": "h8oiod2",
            "score": 2,
            "text": "Okay, Gerontologist here 👋\n\nPardon, if this has already been mentioned/explained in the comments but there are two main schools of thought \n\nStochastic vs nonstochastic mechanisms of biological aging, within those schools of thought we have more niche/specific explanations like programmed cell death (apoptosis), oxidative stress, replication error etc. Certain theories have more weight/evidence than others, but likely they all interact and the biology of physical aging is simultaneously programmed and random \n\nIf you're really into it: this book chapter sums things up pretty nicely \n\nhttps://connect.springerpub.com/content/book/978-0-8261-9865-5/chapter/ch02",
            "title_similarity": "0.38821834"
        },
        {
            "id": "h8okesg",
            "score": 1,
            "text": "Anyone has a link or news about anyone celebrating 120th birthday? Just curious.",
            "title_similarity": "0.6186387"
        },
        {
            "id": "h8om714",
            "score": 1,
            "text": "My limited understanding is that humans have many aging \"clocks\" a few of which can be slowed or stopped, but not all. And for reasons already mentioned, DNA damage eventually catches up with us. Remember only a few aging mechanisms can cause Progeria syndrome (premature aging in children); one would need to address ALL the mechanisms to actually increase lifespan.",
            "title_similarity": "0.49396393"
        },
        {
            "id": "h8omgrj",
            "score": 1,
            "text": "We don' t actually know  what the upper limit is, longevity researchers like David Sinclair think it might be much higher.  For more info see his book Lifespan.",
            "title_similarity": "0.59532344"
        },
        {
            "id": "h8omj8t",
            "score": 1,
            "text": "that's simple: we do not know..by \"we\" i mean scientists..actually, we know very little about processes in our body, especially brain, heck, we even do not know exactly how some medications work, we just know they work and that's it...",
            "title_similarity": "0.3170148"
        },
        {
            "id": "h8omoes",
            "score": 1,
            "text": "It seems there is a clock in our DNA.   Later in life the cells of your body just don't repair the DNA as effectively as a young person's can.  Errors and mutations begin to accumulate, increasing the risk of out of control cancers.  Everything becomes less efficient.  Cells accumulate various molecules that can't be pushed out.  Organs get tired and don't work as well.    \n\n\nIt also gets harder to take care of oneself.  The people who make it to 100 are usually active, independent, and do great self-care for much longer than average.    I am willing to bet they have superior ability to cope with stress, and are more careful if they do something that is contra-survival.  George Burns made it to 100 despite his cigars, but he didn't seem to do a lot of other unhealthy things immoderately, he laughed, and he wasn't lonely.  I think these are all important things.  But the ability of your cells to keep up with DNA repairs is an answer science keeps finding, so it has to be pretty important.",
            "title_similarity": "0.46617115"
        },
        {
            "id": "h8on36y",
            "score": 1,
            "text": "Actually watch a great video on this the other day. [Link](https://youtu.be/QRt7LjqJ45k) is here.\n\nThe gist of it is pretty simple, the mechanism in our dna that develops the code for our cells to work correctly slowly begins to wear out. If we could develop a way to re-energize this portion of our dna we wouldn’t age.",
            "title_similarity": "0.3953514"
        },
        {
            "id": "h8on7tj",
            "score": 1,
            "text": "I'm not positive about this, but it might have something to do with telomere length. When the cells in your body duplicate they have to make identical copies of their DNA. When they do this they lose bits off the ends of the strands because of the way they make the copies. The ends of the strands are made up of junk sections which don't code for anything, called telomeres.\n\nThe more a DNA strand is copied, the shorter it gets. So maybe by the time someone reaches 120 years old a critical amount of their DNA has shortened to the point where they can't properly make the proteins they need to maintain survival.\n\nAgain I'm not sure about this, but this has always been my thought on what happens as people age.",
            "title_similarity": "0.48921204"
        },
        {
            "id": "h8ooh6p",
            "score": 1,
            "text": "each time your cells divide the telomeres on your DNA fray just a little... think of a brand new shoelace, that plastic aglet on the tip... that's a telomere.  There is a finite number of times that aglet can be pushed through a hole before it frays so completely it just isn't a shoelace anymore. You can add some tape and temporarily fix it but it only buys you a week or so. Humans are machines.. Machines are designed to wear out. and even the most pristinely maintained machines turn to rust and dust eventually. It's biological planned obsolescence.",
            "title_similarity": "0.44675285"
        },
        {
            "id": "h8opqex",
            "score": 1,
            "text": "Simply put, every species main goal is for the species to survive. This is best achieved through reproduction with minor mutations. Those beneficial to the environment around it will eventually flourish.\n\nFor the species as a whole, it’s beneficial for the older generation to die. They are using the same resources (food, water) as the newer more adaptable generation.\n\nIt so happens that the path our species went on, we have this life expectancy.\n\nYou would be asking the same question if we capped out at 30 or 300. It just so happens that this worked out best.\n\nAdd medical advances to the equation, we have perhaps artificially extended our ‘cap’\n\nIn terms of the physical mechanisms inside of the body, that’s best explained by someone else. However I thought this view was worth exploring.",
            "title_similarity": "0.4576796"
        },
        {
            "id": "h8oq4kr",
            "score": 1,
            "text": "Just like a lot of things on your car need to be replaced at 60,000 miles. A lot of things on the human body just start to break down at 120 and some parts can’t be replaced yet. 120 is really old and honestly that’s longer than any other mammal. Interesting enough is that the median life span hasn’t changed for hundreds of years. The reason life expectancy has gone up is because we’ve become better at getting children to live past 5. But in the olden times if you lived to 5 years old you were pretty much gonna make it to your 70s or 80s",
            "title_similarity": "0.632238"
        },
        {
            "id": "h8orv3u",
            "score": 1,
            "text": "I had a teacher describe it as rolling a 120-sided die.  Every year, the die loses a side. This die determines whether your cells replicate perfectly or if there's an abnormality.  The abnormality occurs when you land on 1.  So at 10, it's now a 110-sided die and at 30 its now a 90-sided die.  As we get older, the odds of cells replicating perfectly diminishes to the point where replication failure is inevitable.  Maybe that's wrong or too simplified?  IDK.",
            "title_similarity": "0.65844744"
        },
        {
            "id": "h8ory1x",
            "score": 1,
            "text": "In one sentence: somatic cells can only divide a finite number of times before introducing deletions with depleted telomeres.",
            "title_similarity": "0.4870142"
        },
        {
            "id": "h8os574",
            "score": 1,
            "text": "Literal ELI5 answer:\n\nThink of it like this... every cell in our body has a clock inside it. Some run faster than others. When the clock runs out, the cell gets replaced with a new one.\n\nAs we get older, the ability to replace these cells gets slower and slower. We are slower to heal from injuries, and slower to recover from getting sick.\n\nEventually we reach a point where the cells die faster than the body can replace them.\n\nThis is probably not technically correct, but how I would explain it to a 5 year old.",
            "title_similarity": "0.53804064"
        },
        {
            "id": "h8osq81",
            "score": 1,
            "text": "Note that the research article where the 120 year claim emerged from was [**heavily criticized for its poor statistics**](https://www.nature.com/articles/nature22784).\n\nBut of course this follow-up didn't make the same media splash...",
            "title_similarity": "0.4485563"
        },
        {
            "id": "h8osqig",
            "score": 1,
            "text": "We run out of a thing called telomeres, which are basically a mattress for your DNA that buffers falls from a height. Every time you use it (DNA replicating itself), the springs (telomeres) get worn more and more until you're finally just hitting the ground and dying (can't replicate anymore.)\n\nThat's basically how telomeres function in DNA. Every time your DNA replicates it gets shorter, but telomeres are a buffer zone that keep getting cut until they're gone, at which point our cells start failing because they can't replicate anymore and we go into organ failure and die.",
            "title_similarity": "0.38943732"
        },
        {
            "id": "h8ot7br",
            "score": 1,
            "text": "Most of the replies seem to be about telomeres, but there's a lot more to it. Check out the SENS foundation and \"hallmarks of aging\" for more detail but, trying for an eli5 explanation... (With some less eli5 stuff in parentheses):\n\nMost of your cells contain an instruction manual for making you, and for how you should function. This has multiple parts: there's your genome, which is like a list of ingredients (instructions for proteins), and your epigenome, which is like a recipe, telling your cells what to do with those ingredients: when to get/make them and how much to use etc. (which proteins to make and how much). You are made of cells, which are little workers, carrying out those instructions to make all your bodily processes work. But this can go wrong in lots of ways:\n\n1. Your ingredient list (DNA) can get damaged. This can happen in a few ways:\n\n1a. Every time your cells divide and DNA is copied it gets small errors so the ingredients can get messed up. \n\n1b. One of the ways copying can damage your DNA is prevented by telomeres (read the other replies for details) but they get smaller with every copy so eventually stop working. \n\n1c. Random things can also damage dna, like radiation, free radicals etc. \n\n2. Your recipe (epigenome) is made of little tags on the dna, which are different between cells. This can also get damaged as the tags randomly change so cells forget how they are supposed to behave. \n\n3. Cells do what they do in colonies called tissues, but those tissues can get stuck together by chemical modifications that shouldn't be there. Cells also produce waste that can build up and be toxic. Your body is good at getting rid of waste but still misses some so it can slowly build up. \n\n4. Your cells get energy from mitrocondrea, which have their own little genome, but also produce chemicals that are good at damaging genomes and do other kinds of harm to cells when things go wrong. They can also just stop working. \n\n5. Cells can forget how to pick up food.\n\n6. Sometimes cells just give up and become \"scenescent\" for various reasons, including stuff related to the above. When cells in tissues don't pull their weight, the tissues don't work properly. \n\n7. There are some powerful cells called stem cells, that your body relies on to replace old cells. Sometimes they stop working, often for reasons related to the above. \n\n\nThere are other things as well (google sens for a more comprehensive description). But why 120? Noone knows. There are some highly mathematical arguments about information degradation and all that but basically noone knows for sure. But... People age and die randomly. Imagine you have 7 random number generators, that pop up a 0 or a 1 once a year. If any of the 7 hits 1, you die. You need all 0s to live for another year. But it's ok, the probability of hitting 1 is low. At first. But over time, it slowly creeps up. First slowly, but then more quickly (interplay between aging mechanisms listed above causing aging to accelerate further aging). The probability of dying young from aging is very low but the probability increases over time, faster and faster because of the above \"aging\". Eventually the probability of still being alive at a given age is so low that we never actually see anyone living longer than that. There is no magic number where you just die, but if the probability of a human living past and age of A is less than, say, 1 in a trillion, we don't expect to see anyone past that age. If the above mechanisms are happening as slowly as they normally happen, given the population of the world, the age that we expect to see few humans living past happens to be around 120. \n\n\nThere's a bunch of anti-aging research happening. Some people consider it to be quackery or immoral (for some reason), but others.. don't... If you are interested in anti-aging research or just mechanisms of aging, check out the SENS foundation as well as books by David Sinclair and Aubry de Gray. There are also a few subreddits about it.\n\nTL;DR things go wrong over time, with your body's instructions to function and body itself. Those errors build up and make you more likely to die. At about 120 you are very unlikely to keep living. \n\n\n\nEdit: formatting and added tl;dr\n\nEdit: typo in \"de Grey\"",
            "title_similarity": "0.31132224"
        },
        {
            "id": "h8otba5",
            "score": 1,
            "text": "I've heard this can be up to ~200 years old given your body can be replaced/healed. This limitation being from the deterioration of your brain which there is no way around.",
            "title_similarity": "0.6043166"
        },
        {
            "id": "h8otwqx",
            "score": 1,
            "text": "There is no evolutionary reason to survive after child rearing age, then its a slow decline as we die. As for specific reasons. No one really knows.",
            "title_similarity": "0.4469177"
        },
        {
            "id": "h8owx6b",
            "score": 2,
            "text": "When you make a photocopy of picture, sometimes it doesn’t look quite the same, and then if you make a photocopy of a photocopy sometimes it looks even more different until eventually you can’t tell what it was supposed to be originally. Your DNA uses something called telomeres to copy itself to repair your body and they lose quality the more they are copied. \n\nAlso sometimes the data gets corrupted and it starts distorting the picture, and as it gets worse the picture gets more unrecognizable. This is like cancer spreading through the body.\n\nThe more distorted the picture gets, the less your body works well, and eventually the picture gets too distorted and the body stops working.",
            "title_similarity": "0.32494318"
        },
        {
            "id": "h8oxs39",
            "score": 1,
            "text": "DNA quality divides over time. You can try to retain some quality, but not all of it. Which ends in being wrinkly and old and stuff until eventually DNA quality is bad enough you're pretty much weak to any and all sickness.",
            "title_similarity": "0.38433552"
        },
        {
            "id": "h8p097l",
            "score": 1,
            "text": "Our bodies are made of a bunch of tiny little parts called cells. Those cells wear out, just like a pair of shoes wear out. Just like you need new shoes when they wear out, you need new cells when they wear out.\n\nOur cells are cool because they know when they are worn out and they will build replacement cells to replace themselves. The problem is that each cell has a certain number of times it can do this. It keeps count with a thing called a telemore & every time it replaces itself, it uses one of those telemores. Once it runs out of telemores, it can’t replace itself and becomes worn out. When that happens to too many of our cells, then our bodies become worn out and we die.",
            "title_similarity": "0.36601606"
        },
        {
            "id": "h8p16g1",
            "score": 1,
            "text": "You ever make a copy of a copy?  Try doing that for 100 years.  That’s what your DNA is doing.",
            "title_similarity": "0.58698976"
        },
        {
            "id": "h8p7g8f",
            "score": 1,
            "text": "Actually, it’s not. I’m an actuary, so we work on life insurance. For that we need to keep track of how long people usually live. Our tables for that currently stop at 120, but we are in the process of updating them to go all the way to 150. Before that, they stopped at 100. It just seems like a cap because the max age rises sooooooo slowly.",
            "title_similarity": "0.69940734"
        },
        {
            "id": "h8p9eai",
            "score": 2,
            "text": "TL;DR 120 isn't the max age a human can get to, its just usually the max timespan a non-altered human body takes to completely break down due to the effect physics has on the human body.\n\n[Turritopsis dohrniif jellyfish](https://immortal-jellyfish.com/) serve as a perfect example of this in nature.\n\nIt's important to understand a system before you can attempt to maintenance it, the human body is a very, very, very complex system which is why our attempts to \"fix it\" at least until relatively recently have been rather unsatisfactory.\n\nThink of aging not as an inevitable forgone conclusion and more as a systematic process of failure and decline due to the underlying physics at play.\n\nIf you would, take a moment to understand that the human body is rather analogous to that of a car. Both have underlying schematics from which the means of proper construction of parts and systems are derived. In the case of a car, we have it's blueprints designating it's exactly optimal specifications.  For the human body we have DnA and RnA doing the same, both systems just act as storage for information, one analog, one bio-mechanical.\n\nNow with this baseline understanding down, lets take a trip down a hypothetical. If we look at [Ford model T](https://en.wikipedia.org/wiki/Ford_Model_T) , widely accepted to be the first affordable car, seeing mass roll-out starting in 1908, that was over 113 years ago. After purchase that car would have been used and been subject to the natural laws of physics just like any other object.\n\nThrough it's many years of continuous use and service a slow but gradual degrade of the original would take place. The rubber wheels would crack, the paint would peel, the engine would die and eventually it would lose it's ability to function.  These failures of operation are the direct result of both time and physics on a system.\n\nNow lets go back to today, in modern times there are Ford Model T's in more pristine condition than when they rolled off the factory line over 113 years ago. Why is this? The answer is maintenance and upkeep. The original blueprints for which the system is derived were preserved in their entirety and replacement parts were installed to replace the old failing parts the original contained.\n\nCars are just like humans, in the way that through proper preservation and upkeep they can both continue to exist in perpetuity. Our bodies already act as both natural archivists of our \"blueprints if you would\" and mechanics of our overall systems. What causes our untimely demise is that our bodies are imperfect and despite it's best efforts the \"blueprints\" for which the information necessary to repair the systems is damaged and ultimately lost entirely over time.\n\nThe cause of this degrade isn't entirely understood yet, it can partly be attributed to the natural radiation we intake constantly, another ongoing idea is that through the process of metabolism we create \"free radicals\" which can and do damage our dna overtime as well. Regardless, thankfully we don't need to fully understand the causes of the damage to arrive at a treatment for the deficiencies these damages cause..\n\nAll we really need to figure out is how to precisely replace broken pieces of our \"blueprints / dna\" and to remove those broken parts. This however is where my knowledge of the subject is spotty at best. There are an array of different things being trialed at the moment, from treatments to kill cancers by training our cells to detect for specific proteins that the majority of cancers have. To injecting foreign dna into out \"blueprints\" via CRISPER in attempt to act as a tool for repair. These techniques and ideas as well as their applications however are still relatively new, only 10-15 years at the time of writing.\n\nA few years ago a chinese scientist by name of [He Jiankui successfully used the CRISPER technique to modify 2 embryo's to effectively become immune to HIV/AIDS.](https://www.nbcnews.com/health/health-news/chinese-scientist-says-he-made-gene-edited-twins-using-crispr-n940026) This was done to prevent the two babies from becoming infected by the virus as the father was HIV positive. This experiment ultimately proved successful as the mother carried them to term and then eventually to delivery. As a result two HIV/AIDS immune girls named \"Lulu and Nana\" were born into the world.\n\nThis experiment was almost immediately condemned as premature and unethical, the scientist in question is currently under investigation by various organizations to see if he violated any laws doing what he did. Still the end result was the worlds first 2 genetically engineered humans in history. At the time of writing from what I can gather the two children are both healthy and happy.\n\nI personally don't know how to think about this experiment, if anything I would compare it to the experiments conducted by [Edward Jenner the man who invented the small pox vaccine.](https://en.wikipedia.org/wiki/Edward_Jenner) Marveled then and today for his contributions to mankind, his work and procedures would have been thrown out and he likely would have been imprisoned for his actions if done today.\n\nI suppose ultimately only time will tell if what He Jiankui did was justifiable in the end. Anyways sorry to get off topic and ramble. To close, it is important to acknowledge that with further progress human life expectancy will trend upwards and to rectify the misunderstanding of a maximum lifespan, given our current understand of physics, there is no maximum lifespan at least with the proper medical intervention.",
            "title_similarity": "0.5175308"
        },
        {
            "id": "h8pago3",
            "score": 1,
            "text": "Very few people make it that long anyways. We aren't meant to live any longer, just like a dog lives 8-15 years, humans are meant to go around 70-90. Some are outliers and live much longer, even healthy and relatively Hale past 100, but not many people do. The idea of extending our lives at this point is counter productive to our species survival. We are consuming so much of the biomass the planet is capable of sustaining and there are currently more of us than ever, living longer than ever. The planet can't keep up and we will reach a tipping point soon if we can't get the global population in check. Have you ever experimented with a terrarium? You can only get so much out of it, especially if you introduce anything outside of plants. The earth is one big terrarium and we are severely messing with the balance just by sheer numbers...",
            "title_similarity": "0.54640883"
        },
        {
            "id": "h8paogk",
            "score": 1,
            "text": "The statistical case-  it isnt like everyone is just getting to 120 and then falling over dead, theres a probability everyone is going to drop off every year, it goes up as age gets really high.  Often the oldest person in the world is YEARS older than the next person.\n\nYou're likely to see a LOT more people pushing that number and breaking it as time goes on, cancer and heart disease are going to drop steeply as the people hitting those high ages didnt smoke or get exposed to as many industrial hazards, as well as the standard of living going up worldwide.  We have seen something like 500 people hit 115 or so, when it starts being like 5000 people or 10000 you might start expecting to see more hitting 120 and higher.",
            "title_similarity": "0.6054874"
        },
        {
            "id": "h8pjjlk",
            "score": 1,
            "text": "It has to do with how well the body can replenish its cells. We have DNA in the nuclei of cells in the form of chromosomes. At the end of these chromosomes are protective caps of repeating DNA sequences, like the plastic caps at the end of shoelaces, called telomeres.\n\nNow, when your cells divide, these telomeres start shrinking until they are gone. Then your affected cells stop dividing and enter old age, or die depending on that particular cells genetics.",
            "title_similarity": "0.35084948"
        },
        {
            "id": "h8pk7pa",
            "score": 1,
            "text": "At any given point that you are alive, there is a long list of things in your body that need to work right, but it only takes a few of them failing for you to die. They keep themselves working with repair machines, but those repair machines eventually stop working, too. 120 years is about how long it takes for it to be almost certain that enough of the repair machines have failed for enough of the list of things you need to stay alive to also fail.",
            "title_similarity": "0.6028257"
        },
        {
            "id": "h8po0vd",
            "score": 1,
            "text": "ITT there are a lot of good technical explanations of teleomeres et c.  \nBut there may be evolutionary reasons for the current lifespan limit of 4 generations.  \nDuring the thousands of years in which the human race evolved, it looks as if it were an advantage if sexual reproduction did not take place immediately after it was physically possible (ie. just after puberty)\nInstead, children had the greatest chance of survival if their mothers and  fathers were fully developed - and thus benefitting from better health, and more experience.  \nFor a child, it was (and is) also beneficial to have living grand and great grand parents, who could assist the parents and serve as a store of knowledge.  \nFor most of the human history, we did not have the benefits of writing - so a tribe that possessed members with great life-experience, would have an advantage over those where parents died immediately after their children had reached puberty.  \nSo the minimum lifespan that could preserve human culture is around 30 - but if a tribe wanted to reap the benefits of late reproduction (between the ages of 20-30), and the wisdom of grandparents, it is neccessary to have a lifespan of around 90 years.  \nStatistically, if a reasonable number of humans are to reach 90, there need to be possibilities for a somewhat longer lifespan.  \nAnd for the technical reasons outlined in many good posts her, that lifespan tends to max out at around 120.  \n(Which is too bad - I have always wanted to see the human race established off earth, but the medical technologies move to slow for that to be possible :(",
            "title_similarity": "0.5116441"
        },
        {
            "id": "h8po1lr",
            "score": 1,
            "text": "imagine a circle. every so often, a small dot will appear in the circle, and take a very small percentage of space. over time, the circle will eventually be full of dots.\n\nthe circles represent our cells, and the dots represent the amount of errors made when replicating them.",
            "title_similarity": "0.37675825"
        },
        {
            "id": "h8po445",
            "score": 1,
            "text": "The old have to die so the young don’t have to fight for resources.\n\nBaby. Parents to take care of the baby. Grandparents to be backup incase parents die. Grandparents also help keep traditions (food safety, manners) around. Once baby is about old enough to have babies, grandparents start getting redundant.",
            "title_similarity": "0.381129"
        },
        {
            "id": "h8pplcm",
            "score": 1,
            "text": "Mammals run hot. This generates a lot of toxic waste that damages the body and wears it out. Humans are one of the longest living mammal species.",
            "title_similarity": "0.3967878"
        },
        {
            "id": "h8pq3ah",
            "score": 1,
            "text": "Those ends of the shoe laces called aglets wear out the ends. Your cells only can die and regrow itself so many times. Cancer is cell immortality. Which is bad. Hence death by aging.",
            "title_similarity": "0.4617059"
        },
        {
            "id": "h8pqmpt",
            "score": 1,
            "text": "So if cells were replaced at a slower rate would that increase lifespan?",
            "title_similarity": "0.47683007"
        },
        {
            "id": "h8ps2di",
            "score": 1,
            "text": "Humans have children early in life, so there is no way for evolution to pass the \"live longer\" genes ahead",
            "title_similarity": "0.4759731"
        },
        {
            "id": "h8ptcfj",
            "score": 2,
            "text": "Lots of research going into this at the moment! one thing we know is that the mTOR signaling pathway seems to have a correlation with life expectancy. mTOR plays a big role in building muscle and when you are young you produce a bunch of it which helps you grow. mTOR is a good thing when you are young but as you age you do not adequately slow it down(especially men). Scientists do not the exact reason why but too much mTOR signaling at an old age seems to cause a break down in vital functions thus shortening life span.\n\nThis is why they sometimes give certain medications to the elderly which inhibit(or block) mTOR. such medications have been shown to increase life span at an average of 1.5 years IIRC. Of course this is just one piece of the puzzle!",
            "title_similarity": "0.44214714"
        },
        {
            "id": "h8puthh",
            "score": 1,
            "text": "Currently 120. 100 years ago it was much shorter. 100 years from now it may be longer... depends on societal choices. As we poison the earth we will suffer the fallout. If clean air and water become a priority the skys the limit. Research into regenerative procedures are showing great promise for future generations to slow or stop aging.",
            "title_similarity": "0.54837036"
        },
        {
            "id": "h8pw3bd",
            "score": 1,
            "text": "If our body could simply get energy without the need for digestion, our lifespan would be way longer.",
            "title_similarity": "0.50107753"
        },
        {
            "id": "h8pwpyd",
            "score": 1,
            "text": "But how  this copying machanism is different for plants, I am certain that you can keep a copy of same genetic material alive for a huge time even though mother plant is going to die at some point, \n\nasexual reproduction",
            "title_similarity": "0.44502077"
        },
        {
            "id": "h8pzri8",
            "score": 1,
            "text": "Cell death. When you die of old age, you are actually dying of organ failure.   \n\nOver the course of roughly 7 or more years, every cell in your body is gradually replaced with a new one. The way these cells replace one another is by splitting off new cells from the old cell and then cannibalizing the old cell. This transfer of genetic information between cells through cannibalization is how a tattoo remains when a cell is replaced.    \n\nOver time, cells become too worn out to make new cells and eventually just die. This leads to a lack of new cells to maintain your body, especially your somewhat fragile internal organs. And when your organs are unable to actively repair themselves, they fail and you die.",
            "title_similarity": "0.45605797"
        },
        {
            "id": "h8q0ka1",
            "score": 1,
            "text": "Telomeres. Every time a cell 'reproduces' they get shorter until cell division stops. If you remove the telomeres you get lots and lots of cancer. \n\nI have absolutely no expertise or even basic knowledge of this but it would seem, at least intuitively, that if it's possible to increase the length of the telomeres you could increase longevity and if you can replace the telomeres (if that's even possible) with 'fresh' ones then immortality is possible.",
            "title_similarity": "0.5361839"
        },
        {
            "id": "h8q0yz3",
            "score": 1,
            "text": "Well I'm halfway through and my knees hurt, skin bleeds easy, takes ages to heal, hair loss, eyes and hearing going, it was fun but now getting  monotonous fuck another sixty years.",
            "title_similarity": "0.47585005"
        },
        {
            "id": "h8q1b5c",
            "score": 1,
            "text": "Disease and the ability for our cells to replicate as they age. \n\nReally the aging you see on the elderly is simple a reflection of our cells aging. \n\nAs we age the struggle to make perfect copies, DNA gets damaged, you take longer to fully recover from things.",
            "title_similarity": "0.47397804"
        },
        {
            "id": "h8q1ujp",
            "score": 1,
            "text": "Telomeres. Think of the little plastic tip on the end of shoelaces as the cap on your DNA. Over time the plastic tip degrades and the eventually falls off so the shoelace unravels. \n\nThat’s is what’s happening to your DNA.",
            "title_similarity": "0.3033166"
        },
        {
            "id": "h8q50ob",
            "score": 2,
            "text": "This question is flawed. There’s no hard ceiling at 120.  \n\nThe broad answer to your question is: Nature doesn’t care what happens to you after you’ve raised your offspring to their breeding age.  \n\nThe molecular answer is we’re not sure. But probably some combination of epigenetic methylation, telomeres, and long-term damage accumulation.",
            "title_similarity": "0.49669167"
        },
        {
            "id": "h8q674j",
            "score": 1,
            "text": "Seems like we die.",
            "title_similarity": "0.33731645"
        },
        {
            "id": "h8q6bey",
            "score": 1,
            "text": "My buddy who is a Biochem told me that \"All men will get prostate cancer. Most just don't live enough.\"",
            "title_similarity": "0.46450892"
        },
        {
            "id": "h8qe5cm",
            "score": 2,
            "text": "So you are probably coming at this question by noticing that the average human life expectancy has been increasing over time. Or that some countries in the world with worse living conditions have a lower life expectancy.\n\nIn both of these situations it's not that the maximum age people live too is really different. It's that as time has gone on we have gotten better at avoiding certain kinds of deaths like accidental, child birth, common diseases like the flu and others. Over time we have gotten better at eliminating these deaths but the max age has not really changed, just more people ok average are making it there.\n\nThere are still plenty of diseases like cancer, heart disease, Alzheimer's... That occur at high ages that we can't really do much about.",
            "title_similarity": "0.49193197"
        },
        {
            "id": "h8qldsz",
            "score": 1,
            "text": "The photocopy analogy is maybe ELI3, or at least over summarizing. Some of the cell replication process that changes over iterations are very much intentional and expected. You have the same dna at birth as you do 100 years later, so why do you look different? Those mechanisms aren’t caused by accumulation of mutations. Really those mutations are happening at nearly the same rate at birth compared to slightly higher later in life, however your cell maintenance system detects those bad cells better when you are young. Likewise, when young the protein translation process works better off of dna which has longer extra sections. These sections get shorter every time the dna replicates. This process rarely change the overall function, but normally have effects on the stability of the protein generated from it. Eventually, when you copy the dna you end up with no extra end and start trimming into the functional parts.",
            "title_similarity": "0.43563312"
        },
        {
            "id": "h8qlglm",
            "score": 1,
            "text": "we are all an element with a half life.. a battery that runs out of juice, a clock that loses time. without serious injury to invade.. 120 is a long time isn't it.",
            "title_similarity": "0.62718034"
        },
        {
            "id": "h8qlkze",
            "score": 1,
            "text": "Lots of good explanations, but I'll just add one aspect.\n\nOur body's cells copy themselves, but the machinery that does the copying sometimes makes errors. These errors are actually a good thing as a species, since these errors are actually the source of evolution (occasionally these errors randomly lead to a small change in our body that could actually be advantageous). But over many long years of copying our cells eventually these erros will lead to out bodies not functioning as intended or developing a cancer, and then we die.",
            "title_similarity": "0.3383174"
        },
        {
            "id": "h8qmaqy",
            "score": 5,
            "text": "I might actually suggest watching [this Kurzgesagt video](https://www.youtube.com/watch?v=MjdpR-TY6QU). It explains it better than I could (and even provides potential solutions to extend not just lifespans, but healthspans--which is the extent of your life that you are healthy), but it's not only the common explanation of the telomeres getting cut off over time. \n\nMy quick explanation would be that it's a few factors:\n\n1. Telomeres, the explanation everybody is giving. These are like caps on the end of your DNA, which serve to protect it from harm when it replicates itself when your cells divide. Over time, the telomeres slowly decay from the millions and millions of cell divisions, and eventually cell division starts grinding down your DNA instead of the telomeres.\n2. Some cells refuse to die. Most cells are programmed to die eventually, but sometimes, either as a \"I can't replace myself\" ordeal or through damage to the DNA, a cell will refuse to kill itself, staying alive as a zombie cell (called senescent cells) and draining the body's resources while not really doing much. This is also part of the process of getting cancer, which includes cells refusing to kill themselves when they're defective AND cells ignoring programming on when to divide and just dividing whenever they can, draining the body's resources and slowly killing you. This bullet point is somewhat linked to the decay of telomeres, as it's generally a result of DNA damage or cells knowing that they cannot reproduce any more without DNA damage.\n3. Some hormones don't get produced in sufficient quantities. The video I linked notes NAD+ as one of the major factors here, but there are others, and as everybody else is saying, the science of aging is not a complete science; we're still learning a lot.\n4. And lastly, stem cells. We kind of run out of them as we age. They're supposed to help with a lot, and we're still learning more about them. I won't try to explain everything that stem cells do, since I honestly don't understand half of it, but they're a pretty big deal in slowing aging.",
            "title_similarity": "0.42717862"
        },
        {
            "id": "h8qpsvu",
            "score": 2,
            "text": "You know how if you xerox something, then xerox that xoppy, then that xoppy, etc etc etc the quality gets worse each time? That's what your cells are doing when they copy dna during mitosis.",
            "title_similarity": "0.3185646"
        },
        {
            "id": "h8qrr67",
            "score": 1,
            "text": "Telomeres get copied over and over and lose a little bit of information here a little bit of information there off the ends which are mostly redundent info until you've lost all the redundant info and start losing important stuff that makes your body less and less resilient. \n\nTldr: Too many bits broke off now I'm old.",
            "title_similarity": "0.41746932"
        },
        {
            "id": "h8qwhk5",
            "score": 3,
            "text": "TOP RESPONSES ARE INCORRECT.\n\nWhat causes aging is most like a restaurant that starts making English food when it first started out making Souther BBQ or something. The restaurant (your DNA) is JUST FINE but the recipes it starts to make are changing (good genes are turning OFF and bad genes are turning ON). \nSo after a long time without correction of WHICH recipies to make, the body becomes eclectic and loses it's...flavor. \n\nTelomeres can be lengthened, mutations or bad copies can be fixed (your body has genes to do this) but you have to TELL the cell to turn these genes on. \n\nVeritasium makes a great video about the research we've done to reverse aging in mice, and how we will do it in humans.",
            "title_similarity": "0.336127"
        },
        {
            "id": "h8qykl7",
            "score": 2,
            "text": "The real answer: we do not know. Other organisms can live longer. It's certainly probable that lifespans can evolve. Humans live longer than chimpanzees, despite being quite close, 99% similar by genetic code. Get chimps die off in their 50s and 60s, we die in our 80s.\n\nHumans simply haven't evolved to live longer yet. All other things being equal, an individual that sticks around longer has some fraction of likelihood to produce more offspring. Over 10,000 generations, a 1% offspring production rate increase is highly significant and will sweep to fixation. However, it takes time.\n\nAs to what molecular systems break down most, it varies from person to person in cause of death or research theory. Some people think it's DNA mutation accumulation. Others think it's chromatin signature drift. Others think specific runaway programs are the cause. We do not know. Telomeres are not a problem, our stem cells produce telomerase, which adds sequence to that which is lost each cell division.",
            "title_similarity": "0.628641"
        },
        {
            "id": "h8r68p9",
            "score": 1,
            "text": "There are 3D printers made (almost) entirely out of 3D printed parts. Imagine the tiniest, most imperceptible defect in one component. If you keep repairing the printer with parts it printed itself, eventually any defects will magnify to the point that it can’t print its own parts any more. Your body is just the same - it regenerates its own components, but as time goes on, it will inevitably create worse and worse versions until those components no longer function. I’m not informed enough about biology to know why this doesn’t apply to having babies, I just thought I had a decent analogy and wanted to share it.",
            "title_similarity": "0.39944786"
        },
        {
            "id": "h8r8eiy",
            "score": 1,
            "text": "Genetic engineering can add around 30% of peak years to mice.\n\nIt will probably have a bigger effect in humans due to the way we live and deteriorate. Mice don't have long phases of senescence.\n\n\n\nMy body is ready.",
            "title_similarity": "0.43142086"
        },
        {
            "id": "h8r8ws6",
            "score": 1,
            "text": "I’m just regurgitating a minutephysics video (or was it minuteearth?) but their explanation boiled down to this: humans were naturally selected for longer lives, but only up to a point. People get genes that protect us slightly from illness and aging into maybe our 80s, but anyone who makes it past the magic age suddenly has zero protection, since it was never an evolutionary advantage. This population then has a half life, in that half of them die to random things (like organs that suddenly fail) every year or so. There are just too few of those people alive at any given moment for any of them to get really old; if we assumed that people had a 50% chance of death per year beginning at age 90, you would need a beginning population of 1024 for one to be likely to live to 100, and more than 1,000,000 for one of them to be likely to live to 110. \n\nThe real numbers are different but the idea is that if we had exponentially more old people, they would live a few years longer just by chance.",
            "title_similarity": "0.60881823"
        },
        {
            "id": "h8rblko",
            "score": 1,
            "text": "This all has to do with the hayflick limit right?",
            "title_similarity": "0.39293987"
        },
        {
            "id": "h8rc06c",
            "score": 1,
            "text": "Richard Dawkins talked about this a little bit in his book The Selfish Gene. There was a thought experiment where you take a population and only let them repopulate at a certain age and gradually raise that age until you get a civilization that are repopulating in the 50s and 60s and people are living a lot longer. I know I did a very brief paraphrasing of him, but it borders on the idea of eugenics and gets a bit sketchy.",
            "title_similarity": "0.5522132"
        },
        {
            "id": "h8rf12i",
            "score": 2,
            "text": "Some replies answered this very well. Just to ad a thought: Through modern medicine we have actually increased human lifespan over the last several decades. It’s estimated that someone has already been born that will live to the age of 150.  \n\nSource: https://www.wsj.com/articles/is-100-the-new-life-expectancy-for-people-born-in-the-21st-century-11587041951.  \nSorry for the paywall from wsj",
            "title_similarity": "0.642797"
        },
        {
            "id": "h8rfbwd",
            "score": 1,
            "text": "If standard health improved in the world we might live longer, it may only appear that we can live up to around 120 years old.",
            "title_similarity": "0.68515754"
        },
        {
            "id": "h8rglu2",
            "score": 1,
            "text": "Secondhand retelling so take this with a grain of salt.\n\nAccording some expert, the chemical process of breathing (consuming oxygen) damages the body over time. That damage is not particularly high, but we breath a lot throughout the lifespan.",
            "title_similarity": "0.49532795"
        },
        {
            "id": "h8rjil3",
            "score": 1,
            "text": "Something that I haven’t seen mentioned in any of the top comments are the epigenetic factors that contribute to aging. \n\nIn addition to the shortening of telomeres with each replication and all of the small mutations that accumulate over time, the way DNA is organized in the nucleus plays a major part. This organization is referred to as the epigenome. Even though all cells have the same exact DNA (ignoring mutations), they don’t have the same functions. In order to achieve this, the DNA is bundled up in a way so that only portions of the DNA can be read at a time. \n\nInstead of a brain cell reading literally the entire genome, including all the DNA that only pertains to liver cells or skin cells or whatever else, those parts of the genome are bundled up around proteins called histones. The only parts of the gene that aren’t bundled up are the brain cell instructions. Imagine a long string wrapped around a bunch of different balls, with parts of the string in between each ball not completely raveled up.\n\nHere is the fun part. When radiation (or one of a fuckton of other things) causes cell damage, the strings inevitably become unravelled. Now, in a brain cell where at one point the only genes that could be read were brain cell genes, the genes for hair cells, for example, can now also be read.\n \nThere’s a mechanism for the reparation of the epigenome coded in the genes, but after enough damage, the mechanism sometimes fails.\n\nEventually these cells build up and begin to hinder the regular function of the organs. A bunch of skin cells, liver cells, and lung cells in the brain is not going to be great for the brain, and the same goes every other organ. \n\n\nTLDR; Repeated DNA damage causes cells to eventually forget what they’re supposed to do and these cells become a burden on the surrounding cells.\n\n\nIf anyone is interested in the topic beyond this post, Lifespan by David Sinclair is really good and where I got a lot of this knowledge from. There’s also a video he did with Veritasium which is interesting as fuck and covers a lot of what he discusses in the book. The video is called “How to Slow Aging (And even reverse it)” on YouTube.",
            "title_similarity": "0.42279524"
        },
        {
            "id": "h8rjz3p",
            "score": 1,
            "text": "It's been said before but I want to try it short and sweet:\n\nEvery time cells copy themselves they miss out on a little bit of DNA. We have a disposal buffer (telomeres) for this which runs out around that age.",
            "title_similarity": "0.42511442"
        },
        {
            "id": "h8rjza8",
            "score": 1,
            "text": "Because the limit is more like 105 but then ocassionally some humans live longer than that due to extremely good luck genetics and health habits",
            "title_similarity": "0.43080872"
        },
        {
            "id": "h8rm112",
            "score": 1,
            "text": "This question is silly, I think 20 year olds today will die around 120, similarly aged to our current 80-90 year olds. \n\nIt might be slightly harder for the younger people to understand, but just looking at people today and knowing their ages, you can see how drastically people have slowed aging just in these past 30 years. \n\nMy dad is over 60, looks like he’s in his 40s. His father had 4 heart attacks and was dead by his age, and my father has all the same physical health problems that are now managed with medical ease. \n\nA few years ago, I own a small general contracting and run semi-skilled labors as subs… either way, we go to help this woman clean up her garden beds and do some outside work for her. She is taking to me and apologizing for bothering us for this small work. I assured her it wasn’t easy or small work and even with 3 young men, it would be all day of moving dirt, cleaning, etc. \n\nShe told me she has done all this work, every year for the past 35 years, but she promised her kids since she just turned 90 she wouldn’t do it anymore, that’s why she called us. She still worked a whole day out there and frankly, worked harder than some young men I’ve had in my employ. \n\nEither way, tobacco will be gone in a couple years, everyone knows sugar is bad, people are generally healthier, we have medicines for everything. They’re making great strides with hormonal drugs, and I haven’t been as up with it, they are also making progress on the mental degradation afflictions. I know about 5-6 years ago I read in a new scientist magazine that they started the first FDA approved drug trial for the sole purpose of “life extension.” Some diabetes drug that they found is keeping people alive longer. Either way, that was 5-6 years ago in like. 77-85 age test group.",
            "title_similarity": "0.617192"
        },
        {
            "id": "h8rm6td",
            "score": 1,
            "text": "Starting in your mid-30s, so when by nature's standard you would start having grandchildren, your body goes into a steady decline.\n\nDuring this decline, each year the cumulative likelyhood of at least one survival critical organ failing increases. At our current level of medical technology, by age 120, that likelyhood is very close to 100%. \n\nScience has already done a lot to slow the rate of decline, since we now can repair or work around many failing organ's functions.\n\nBut despite what some people here seem to think, there is little evidence for human DNA having an in-built self-destuct timer set for precisely 120 years.\n\nThere are actually a lot of even complex animal and plant species that are biologically immortal. We can speculate about a lot of reasons why nature did not give us this ability (yet?), but human biological immortality is likely within the realms of physical feasibility.\n\nThat is not to say we won't run into novel religious, ethical, economical, medical and psycholgical challenges once we approach it, but that is a question for another ELI5.",
            "title_similarity": "0.6316667"
        },
        {
            "id": "h8rpsg3",
            "score": 1,
            "text": "Our bodies are designed to grow to fertility, breed, provide for offspring for a few years and then die off.\n\nAny lifespan after this point (say between 50s-70s at the moment) is part luck and part modern lifestyles and medicine, the lifestyle part seems to have swung right around to having bad practices that kill us off quicker though.   120 is more an outlier, too, 80 is the average.\n\nI guess another way is to compare it to an apple.  An apple grows from seed, is there to be eaten (and pips scattered) then goes mouldy.  A mouldy apple is still an apple until it collapses under the strain of the mould.  Chemicals can prolong that process, but it's still going to happen.  Post breeding age, we're all mouldy apples.",
            "title_similarity": "0.4982475"
        },
        {
            "id": "h8rq91w",
            "score": 2,
            "text": "Because when we get to 150, we enter the First Cocoon stage. Where we emerge 10 years later as our Secondary Form (with wings) we can retain life until 300 years old. From there, the Secondary Cocoon stage kicks in where we gestate for around 6 years this time and emerge with telekinesis and live in zero oxygen environments for extended periods of time. The Third, and final, Cocoon stage kicks in at about 1000 years old. It is assumed by this point that you would have already joined mentally into the hive mind with others of your species so the Final Cocoon (Earth's crust) would usually consist of the Mind That Perseveres while the regressors tend to it for the next billion or so years then 'die', since they have been mentally regressed for this purpose. Over the next 5 billion more years, The Earth will eventually have all energy moved to the cocoon core (us), and from the outside, our Earth Cocoon will look like a grey husk. Once we emerge, we will have reached the Supreme Apex stage where we will create our own omnidimention 'outside' where we can join the 'plane'. Luna already made it almost this far, but they are telling us how they cracked the immortality code and probably won't tell us when they emerge and 'leave'.",
            "title_similarity": "0.6515094"
        },
        {
            "id": "h8runkn",
            "score": 1,
            "text": "Contrary to popular belief I see no reason to think that there's a hard ceiling at 120. The bigger problem is that organs break down with age so by that point you're likely to die of heart disease, cancer, or any of the other numerous age-related conditions that can kill you. If we found a cure for cancer and a viable way to reproduce organs it's possible that we could see people living to 120 and beyond. You would still have to address the damage we accumulate in our cells though along with the issue of telomeres shortening with age.\n\nIn reality it's highly unlikely that we'll see people live past 120 in our lifetime though. Radical life-extension is still viewed as a fringe science and isn't really taken seriously by the scientific community. Although it is possible that we might see an overall increase in our life expectancy as medical technology develops.",
            "title_similarity": "0.51700526"
        },
        {
            "id": "h8rxw5h",
            "score": 1,
            "text": "Currently, due to lack of knowledge STILL about the human body and its aging process.\n\nWe're getting there but regulation has stopped our BEST shot of figuring it out for a long time, CRISPR and genetic engineering. \n\nWe found aging genes and anti aging genes in other animals aaand I'm betting we could find them in us. Or try to put the genes in us from animal were they properly synthesized. \n\nSince we were forced to drag our feet because of religious fears of \"playing god\" we're 20 years back, at least. 🤷‍♂️\n\nMaybe they'll figure it out by the time I'm 80 but I don't forsee wanting to be 80 forever or for a prolonged period of time. Lol",
            "title_similarity": "0.49903288"
        },
        {
            "id": "h8s198z",
            "score": 1,
            "text": "Our cells run out of splitting juice.\n\nImagine you have a giant, 10-lb bouillon cube. That represents a fresh cell slam *packed* with tasty splittin' juice. Cut it in half, still got lots of juice. Cut it in half again, still lots of juice. Repeat this, like, 1000s of times until you have a tiny piece left. That's an old cell with next to no splitting juice left. Probably couldn't even taste it ffs!",
            "title_similarity": "0.44712052"
        },
        {
            "id": "h8s6xwk",
            "score": 1,
            "text": "\"And the LORD said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.\" - Gn 6:3",
            "title_similarity": "0.5298845"
        },
        {
            "id": "h8td13c",
            "score": 1,
            "text": "Genesis 6:3 \nAnd the Lord said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.",
            "title_similarity": "0.5164174"
        },
        {
            "id": "h8tecab",
            "score": 1,
            "text": "your body rebuilding's itself every few days , every time it rebuilds itself it leaves behind a tiny a bit....eventually there are no more tiny bits to leave behind and things start breaking from lack or spare parts. \n\n&#x200B;\n\nAlso there is a small program in our body (In our DNA for those not 5) that actually tells our body to accelerate the decay and break down for some reason at a certain old age called a terminator .  And exactly the the bad robots in the movie when they go on the hunt they hunt you down and terminate You!",
            "title_similarity": "0.34602275"
        },
        {
            "id": "h8th5fv",
            "score": 1,
            "text": "It is not at all certain that 120 years is the ceiling. Over the past 160 years, every time that we thought that a ceiling had been reached, we were wrong, according to [this article](https://science.sciencemag.org/content/296/5570/1029.full) by two demographers. There are many good explanations in this thread of why ageing might be bad for your chances of survival. But they don't answer the question why 120 would be the ceiling, instead of 80 or 150.",
            "title_similarity": "0.62411815"
        },
        {
            "id": "h8ti7sl",
            "score": 1,
            "text": "I like your question and I haven’t seen any good answers that addresses the specific cap at ~120, only the degradation of telomeres. Tortoises also have those telomeres why can they live much longer?",
            "title_similarity": "0.45202067"
        },
        {
            "id": "h8ubgsl",
            "score": 2,
            "text": "Why is the limit at 120? In the 1900s, average life expectancy was 50. Now its 75. Therefore, advances in nutrition, better living and even hygiene have affected life spans significantly. Who knows what advances in genetics could do in the near future?\nGoogle \"telomere\"",
            "title_similarity": "0.65280306"
        },
        {
            "id": "h8zonj1",
            "score": 1,
            "text": "There is a maximum due to epigenetic (changes where DNA is not altered, but gene expression is) noise. When DNA is damaged, proteins and genes will repair the damage. For example, there is a protein called SIR2 that normally silences a gene that hinder growth and fertility. However, when DNA damage occurs (from UV, radiation, etc.), the SIR2 protein travels to the site of DNA damage and helps repair. In doing so, the gene that hinder growth and fertility will be turned on, hunkering the cell down. If this gene were suppressed, massive amounts of damage would occur if an organism/cell reproduced. Now after the SIR2 protein repairs the DNA damage, it  will normally return to the hunkering gene, silencing it so that the organism/cell may return to growing and reproducing. Now, sometimes, the SIR2 protein will find it’s way back to another gene (mistakes occur), and silence a gene that was supposed to be active. This is the basis to aging; it has to do with epigenetic noise, and overtime after these mistakes accumulate, the cell/organism will perish. There has been research into reversing aging by reversing the epigenetic clock. I am quite optimistic that we will be able to live many more healthy years in the future. \n\nFor more info: read about the information theory of aging.",
            "title_similarity": "0.29193217"
        },
        {
            "id": "h9awqtz",
            "score": 1,
            "text": "Sun ray crazy. Make man like hulk, but man not hulk. Man dead instead. Sun burn man little by little. Man no recover. Sun ray cut man. Many cuts when man is 100. Man no heal from cut. Cut too small.",
            "title_similarity": "0.3744476"
        },
        {
            "id": "h9ekrpv",
            "score": 1,
            "text": "Gen. 6:3  Then the LORD said, “My Spirit shall not strive with man forever, because he also is flesh; nevertheless his days shall be one hundred and twenty years.”",
            "title_similarity": "0.53726405"
        },
        {
            "id": "h9hmgus",
            "score": 1,
            "text": "Its sounds batshit crazy, but It’s about diet, what you keep in your body, and a lot to do with spirituality. There’s levels to it… Level 1 would be vegan. Level 2, alkaline vegan. Level 3, raw vegan. Level 4, breatharian. Then you get into dry fasting (no foods or liquids at all) and no sleep. It’s really advanced shit.\n\nPeople are suppose to live much longer than we do these days.",
            "title_similarity": "0.52279043"
        },
        {
            "id": "hhkl4hl",
            "score": 2,
            "text": "At a social evolutionary level.  Have you ever seen great-grandparents/great-great grandparents help raise grandkids?  Some 50 years or so after raising your kids and possibly grandkids,your not really needed in your family lineage anymore.  Imagine a 100 year old having to help take care of their 135 year old parents!?!?  And the 135 year old having to take care of their 157 year old mother!?!?.......\n\nFrom an evolutionary viewpoint wouldn't make sense for such extended family lineage to all be alive at the same time.  Be a different society today if you could go visit your great-great-great-grandfather who fought in the Civil War.",
            "title_similarity": "0.5700853"
        }
    ]
}