{
    "ELI5: What are weightstations on US interstates used for? They always seem empty, closed, or marked as skipped. Is this outdated tech or process?\nLooking for some insight from drivers if possible. I know trucks are supposed to be weighed but I've rarely seen weigh stations being used. I also see dedicated truck only parts of interstates with rumble strips and toll tag style sensors. Is the weigh station obsolete?\n\nThanks for your help!\n\nEdit: Thanks for the awards and replies. Like most things in this country there seems to be a lot of variance by state/region. We need trucks and interstates to have the fun things in life, and now I know a lot more about it works. \n\nSafe driving to all the operators that replied!": [
        {
            "id": "h9dck4w",
            "score": 0,
            "text": "Truck driver here\n\n\n\n18 wheelers can't be over 80,001 lbs these station are their to make sure we stay in regulation. The law is set at 80,001 lbs because anymore would cause the engine to over heat in mountain terrain which can make the engine blow up. Over sized load trucks have additional radiators to keep them from over heating.\n\n\n\nAs for why they always seem empty almost all scale houses only pull trucks in before noon, I'm assuming because that's when most of us are on the road and they use the afternoon to file and submit paper work.",
            "title_similarity": "0.7771494"
        },
        {
            "id": "h9cxntf",
            "score": 2,
            "text": "They make sure the cargo in a truck is distributed evenly. Most trucks probably don't have to spend much time in them, as they distribute the stuff properly. It makes economic sense for them to do so, so they don't have long delays.",
            "title_similarity": "0.5241754"
        },
        {
            "id": "h9e8g96",
            "score": 29,
            "text": "All these answers like you are a fucking 14 year old god dammit it's explain like I'm 5.\n\nHeavy trucks break the road. These are scales like what you have in the bathroom at home to make sure the truck didn't eat too much cargo. If the truck is too fat, they get a ticket, just like if you drive over the speed limit.",
            "title_similarity": "0.7210807"
        },
        {
            "id": "h9d8s9m",
            "score": -12,
            "text": "If you begin a question with \"what\" and end it with \"for,\" just use how. \"What for\" is improper at the beginning, split or at the end if a question.  \n\nThat's an ELI5 for you.",
            "title_similarity": "0.39267325"
        },
        {
            "id": "h9d8cf4",
            "score": 2,
            "text": "On top of what other people said, it is used to actually verify the proposed quantity being hauled. If I order 15 tons of chocolate, I better get a slip of paper saying I got 15 tons and not 14.9. Make sure none was lost/siphoned during transport.",
            "title_similarity": "0.57180095"
        },
        {
            "id": "h9d79l1",
            "score": 0,
            "text": "They will be outdated in less than a decade.  The Ministry of Transport in Ontario (and I am sure other jurisdictions), now use portable scales to do what weigh stations used to.  They have not completely taken over, but it's only a matter of time.",
            "title_similarity": "0.61975944"
        },
        {
            "id": "h9fve0h",
            "score": 0,
            "text": "Also serious question, why do some trucks have their emergency lights on just driving. It’s too common an occurrence for it to be an emergency. They’ll be going real slow in the right lane and multiple trucks will be doing it. I’ve been wondering this for a while.",
            "title_similarity": "0.8160237"
        },
        {
            "id": "h9gqx28",
            "score": 0,
            "text": "Does anyone here know why so many big trucks (more specifically the trailer parts of them) have Maine plates? Here in California I probably see one car with Maine plates a year, but I see truck trailers with Maine plates every time I get on the freeway. Maine is not known as a low-tax or low-regulation state, so that can't be it.",
            "title_similarity": "0.7272382"
        },
        {
            "id": "h9e63ub",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.11901073"
        },
        {
            "id": "h9efs5y",
            "score": -1,
            "text": "I remember when I moved to Cali 20 years ago I drove a friggin pickup truck (Durango) and the law said I had to go weigh it at one of those stations it was retarded.",
            "title_similarity": "0.6237125"
        },
        {
            "id": "h9ekbe1",
            "score": 1,
            "text": "During the war with Germany. The most feared were called the Gestapo. Ruthless animals butchered millions including women and children.\nYes my trucker friends referred to the weigh station occupants as Gestapo, Nazis . These varmints can and do put drivers. OUT OF SERVICE .\nSo your stuck rite where your at. Until a useless marker light on the top of the trailer is replaced. And of coarse the repair service outfit is cocked and ready to replace this useless lite. Then bill an astronomical price. It’s a racket. An example of why you don’t want government in charge. CORRUPTION at its worst. There are different theories as to why independent owner operators seem to be the targets. I believe the big box trucking companies send fancy talking lawyers with lots of cash to spread around to Washington. There objective is to eliminate as many independents (competitors) as possible. By getting Congress to add as much red tape (useless rules) as possible. They call it SAFETY.\nOMG. I have seen there SAFETY departments in action. Most of the folks hired in the safety dept. absolutely have no idea how a truck works.\n\nRetired,\nWore out driver",
            "title_similarity": "0.710923"
        },
        {
            "id": "h9f1ezp",
            "score": -1,
            "text": "They are a tax generating device, used to screw truckers out of money. You are allowed 80,000 pounds. If you go over they tax you  $2 a pound. Since truck drivers do not load the truck, a shipper could overload the truck, and screw the driver. \n\nThem being closed is a good thing. \n\nOn another note, the national weight limit should be 90,000+ and not 80,000 to save tons of money by shipping more products in each truck.",
            "title_similarity": "0.72876555"
        },
        {
            "id": "h9de3lg",
            "score": 7,
            "text": "I hate weigh stations as a truck driver. Especially when my pick up location doesn't have a scale and the ticket says 40,000lbs. I can either refuse the load and wait more hours for them to unload it or drive (probably) a few miles (could be 10, 20 or more) to a truck stop and scale it and try to make it legal. Then I can decide to then go back to where I was loaded at and show them I'm over weight and get them to unload some (waiting hours to do so) or say fuck it and by pass or just run the scales risking tickets.\n\nPay is good though.",
            "title_similarity": "0.80722183"
        },
        {
            "id": "h9dbyro",
            "score": 2,
            "text": "There’s also lots of weigh stations all over. So if you’re hauling a load 6 hours north, you may pass a lot of weigh stations and as your load doesn’t change, you don’t need to weigh in each time. So not all the stations are used at all times. \n\nThe ones that are open are generally just in areas where weight could become a problem. Remember this is something that costs money to operate these so they only have them open when they need them. Trucks do very much still get weighed though. \n\nAnecdotal but, when I drive to the river I pass a ton of weigh stations. Some open some closed, but there is one that is by an area with tons of hills and is subject to strong winds. That weigh stations is always open and has trucks using it. The only way you can skip it is if you’ve already been weighed. Big ticket though if you get caught skipping a weigh station and you haven’t been weighed. Really big if you get weighed and go over afterwards.",
            "title_similarity": "0.7607906"
        },
        {
            "id": "h9dgpif",
            "score": 2,
            "text": "Also what is the first window at taco bell used for?",
            "title_similarity": "0.2420725"
        },
        {
            "id": "h9d3ll9",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.11901073"
        },
        {
            "id": "h9du0q5",
            "score": 3,
            "text": "My dad is a truck driver, and has been for 30+ years.\n\nIn the simplest words.. without caveats..\n\nIf it's an active, mandatory weigh station, every 18 wheeler style truck has to stop and be weighed.\n\nIf you're over a certain weight, that's illegal, you get fined.\n\nWherever you picked up your load, they shouldn't have overloaded you. But if they did, that sucks.",
            "title_similarity": "0.7580325"
        },
        {
            "id": "h9cwk9h",
            "score": 4,
            "text": "I've seen them used before but I'm honestly curious about the answer here. Don't really understand the concept either.",
            "title_similarity": "0.4843876"
        },
        {
            "id": "h9d6djx",
            "score": 4,
            "text": "The exactly what they are intended for check the weight of the truck.  There is an overall weight you cannot exceed but there are also weight limits for each axel.  The company I worked for had transponders, if it flashed green you could by pass the scale.  Many have rolling scales you pull in and drive 45 MPH across the scale if you are under they will give you a green light and you can keep going.  If you are close to the maximum weight they will give you a signal to pull on to the scales by the scale house and stop.  They will then check you weight more accurately.  If you are over weight they can put you out of service.  I have seen drivers at truck stops selling fuel from their tanks but they filled up and it put made them over weight.  They knew they would not be able to burn off enough before have to cross a scale.",
            "title_similarity": "0.70327055"
        },
        {
            "id": "h9dyna0",
            "score": 3,
            "text": "I’m a dump truck driver and those weigh stations not only weigh your truck and load,but they also make you do a pre trip or do it themselves,and if your truck is too heavy or if it dosent pass safety inspection you’ll be stuck there until your boss does something. Dump trucks in my city avoid them by going on alternate routes which is illlegal but bosses don’t care, we barely get any breaks it’s go go go 6 days a week sometimes 7, they also have portable scales for the very purpose of people avoiding the scales and have the right to stop you anytime anywhere to check the safety of your truck. Dump trucking is tough work but I love my job so it dosent feel like work when I’m driving. If your truck max load is 18 tons and you goto a gravel pit they usually have a scale so you weigh on the way out and you’re fine,but if your doing haul offs (hauling concrete or any other scrap to a dump) or if your hauling dirt there is no way to scale you, so that’s when you hope and pray them dot boys don’t get you!",
            "title_similarity": "0.82230806"
        },
        {
            "id": "h9d7n5l",
            "score": 19,
            "text": "My favorite is the companies that know their trucks are overweight. The cops know they are overweight. So the company pays a yearly fine to let the trucks drive on the interstate. Cops never mess with them.",
            "title_similarity": "0.68705297"
        },
        {
            "id": "h9d9c43",
            "score": 72,
            "text": "One thing I haven't seen here in my scrolling so far (surprisingly) is they are measuring for differences in weights to check for illegal activities. Now I don't mean, oh you're over weight here is a ticket, which happens, but I mean, you left Jackson with 2tons, you're now in Willington with 2.25 tons. Where did those .25 come from? Drugs, stolen goods, HUMANS, there are more than a few things. If the log don't match up with the stops and weights then, the authorities will check, and often, arrest.",
            "title_similarity": "0.7623222"
        },
        {
            "id": "h9d232p",
            "score": 64,
            "text": "I don't know about weight stations on interstates in particular, but with regard to truck scales in general: the company I work for buys large quantities of bulk raw material.\n\nTruck drivers go get weighed before they load, often times at CAT scale place or at the railway terminal at which they get loaded. That's their tare weight.\n\nThen they go get loaded and return to the weight station after to get their gross weight. They also get a seal there.\n\nThey send the weight tickets to their dispatcher who sends it to our supplier I think and also bring weight tickets with their paperwork to document the weight.\n\nEssentially the difference between gross weight and tare weight is the amount of material that is being delivered to us (net weight). That's what we buy.\n\nReceiving clerks are supposed to check the certified scale weight tickets against the paperwork to make sure we are being billed the correct amount.",
            "title_similarity": "0.7683994"
        },
        {
            "id": "h9d4zxo",
            "score": 35,
            "text": "Most weigh stations are smart stations now-a-days. They have in motion weighing. That is why you see the electronic gizmos having over the road. \nInside of the trucker cab they have an electronic log. As they pass under the gizmo they can be given a pass to by-pass the scales or be told to go into the weigh station\n\nI’m not 100% sure how they work but I will assume one of two ways. \n\nOne they log the truck has been weighed once prior with some verification that the load is unlikely or has not changed\n\nOr, and unlikely, they weigh the truck in motion and, with a margin of error, guess the trucks weight.\n\nEdit. Welp. It’s the second according to wiki",
            "title_similarity": "0.7632344"
        },
        {
            "id": "h9d92hh",
            "score": 14,
            "text": "It depends on the state. If you are in California all trucks enter the weigh station. Sometimes they will have you park and check paperwork and/or inspect the mechanical condition of the truck and trailer. \n\nOther states have signs saying all trucks right lane for weigh in motion scales like Louisiana. Others like Florida will have trucks enter the scale and do a weigh in motion. An arrow will indicate if you need to pull on the stationary scale or can by pass it.",
            "title_similarity": "0.70961297"
        },
        {
            "id": "h9d4s7j",
            "score": 19,
            "text": "Having weigh stations open 24/7 takes many people to operate it, people who are educated on what they're doing and would cause a lot of freight to be late. Not only are they there to weigh commercial vehicles but to inspect them as well. Some weigh stations may be open several times a week and some may be only a few times a year. I'm not sure what all the factors are in why they are this way. Usually if there's heavy construction in the area they'll stay closed just for safety.",
            "title_similarity": "0.7830286"
        },
        {
            "id": "h9cyfvf",
            "score": 182,
            "text": "[removed]",
            "title_similarity": "0.11901073"
        },
        {
            "id": "h9cx3xs",
            "score": 1056,
            "text": "There’s laws about maximum axle loads and vehicle loads for trucks on highways. This is because the amount of road wear a vehicle does increases dramatically with the axle weight (one something like a cube or fourth-power ratio).\n\nIf a highway patrol think a truck is overloaded they can direct them to a weight station and check to see if they’re overloaded.",
            "title_similarity": "0.6706108"
        },
        {
            "id": "h9ebgnd",
            "score": 47,
            "text": "23 years over the road driving.  Lot of good information here but it's scattered, so I will try to consolidate it \n\nWeigh stations do more than check the weight of the truck. They are also safetly stations.  Besides weighing the truck they will also check out the driver and the truck to make sure everything is in order.\n\nA full inspection is where they will weigh my truck then have me put around back to an inspection place.  There they will check my CDL license, check my registration and permits, inspect the paperwork for my load (bill of lading or BOL), inspect load for proper securement, and inspect the truck for yoo to bottom (yes they ho under it) front to back.\n\nThey can do all that or they might just have me drive over a sensor that weighs my truck and send me back out without me ever stopping.  \n\nOn the side of every truck is a DOT number.  This number identifies the company that owns the authority to operate that truck. There is also a safety rating associated with that number.  The rating is based upon violations that the company has accumulated. When I enter a station that number is captured and looked up.  This helps them determine who to inspect. (I worked for a company once that had a driver involved in a large incident in Colorado, after that if I drove by a Colorado scale house it was guaranteed I was getting inspected)\n\nAlong with that number on the side, I have transponders in the truck that will communicate with the scale before I get there.  This transponder will inform the scale house who I am and they can decide if I should stop or just keep driving. I will receive either a green light or red light on the transponder that tells me shat to do.\n\nAlso some states have sensors in the highway that will give a good estimate of the truck weight and flash a message on a message board on side of the road to tell the driver to bypass or pull in.\n\nAs far as why they closed or open it depends on your location and time of year.  Some are never open and some never close.  It depends on budget and how much of a problem they have in that area.  \n\nSometimes the states will get together and have a targeted enforcement and they will open all the inspection points and inspect as many trucks as they can.",
            "title_similarity": "0.7919948"
        },
        {
            "id": "h9d42cz",
            "score": 7054,
            "text": "Source: I was a scale tech for about a year.\n\nThey're used to make sure trucks aren't overloaded. Some roads, especially the ones up north, have weight restrictions due to the freezing and thawing over the year. So lots of times a truck needs to pull in to make sure theyre not over their gross vehicle limit.\n\nThey're usually shut down because they operate during heavy times, usually around seeding and harvest. Lots of times the trucks aren't too heavily loaded. Given the nature of what's required to fully weigh a truck its not super pragmatic to have them open at all times (unless its at super busy stretch of road).\n\nAlso, all those big elevators you see across the country have a similar scale in them. The older ones are mechanical, and they almost always work more reliably than the digital ones. \n\nTo answer your other question, the tech is super outdated though. Most of the indicators (the brain of the scale that sits in the office or junction box nearby) is old digital equipment working mostly off dipswitches and basic circuitry. There's an interface - but it's mostly parameter based with binary values. The load cells themselves are just a basic circuit that measures the amount of force put on them. The type of circuit is called a \"wheatstone bridge\". They don't typically just break or become visibly damaged (some are rated for thousands of kgs), but they can get loopy when one of the circuit paths starts to degrade. Typically you'll see this during the spring in my experience after the thaw. I once opened up a highway scale that was showing only \"0\" regardless of weight, and the entire pit below the scale deck was filled with about 2' of water. We had to pull the junction box out by the cord and drain it! Also, \"binding\" is an issue - ice can get built up between the scale and the pit (the \"hole\" the scale sits in) wall which will cause undue force on the scale and throw readings off. So they are subject to a lot of environmental stress too, which can have them unmanned / unoperated.\n\nEdit: Lots of comments about contraband here. I never came across this as I wasn't so much a \"scale cop\" but just a technician (and my relatively short time in the field), but I did hear stories about farmers and truckers manipulating their loads to get around this. I worked in mid-west Canada typically on scales on private land and/or less prominent highways, and I never saw much police presence for drug trafficking but I'm sure that it does happen in the more major areas of the country.\n\nEdit 2: Thank you for the awards kind strangers. The scale tech job kind of broke me mentally for a little while but I'm glad to share the little knowledge I have with you fine folks.",
            "title_similarity": "0.7870177"
        },
        {
            "id": "h9dlokp",
            "score": 75,
            "text": "A little late to the game but as someone that trains people how to driver tractor trailers here's my take. \n\nWhile as a lot of people are correct in commenting for weight, there are a lot of other things ports check. Permits; in certain states you have to have a long combination vehicle permit to pull more than two 28's or a single 45 or 53. They also check hours of service, a semi driver can not drive more than 11 consecutive hours in any 24 hour period. They perform what are called roadside inspections for violations of the actual vehicle, brake thickness, wipers, lights, tires, tire chains in the Northern states, steering, etc. Port employees can take a driver put of service for any violations. \n\nFor the overweight trailer question. The port can instruct you to offload freight but that usually doesn't happen unless you are grossly overweight. Typically you just get a ticket, but they can make you offload to another vehicle if necessary. Coming from a company and area that can pull overlength sets of trailers, we typically \"drop\". What that means if we're pulling triple 28's or double 45's we have to leave a trailer at the port and another driver has to come retrieve it. Not all companies have the license to do this and the state decides if the roads can handle overlength/overweight trailers. \n\nSource: I train drivers not to do any of things I just listed above. Ever.",
            "title_similarity": "0.8363317"
        },
        {
            "id": "h9d60nt",
            "score": 410,
            "text": "I used to be a scale master back in the day (mid 90's). The standard semi and trailer you see on the road is not supposed to weigh more than 80000 lbs. Front axle weight limit is 12000, drive axle at 34000 and trailer axle at 34000. It was possible for a fully loaded semi to be legal at 80000, but for the axles to be 32k and 36k, making that rear axle illegal. Trailers come with movable axles to shift weight around. Even the tongue can shift on the drive axle. I worked at a private scale, meaning drivers would come in and weigh with me first, at a cost, to make sure they were legal. Back then we charged 3.50. our scales were certified by the state and I was bonded and insured just in case our weight was off and the trucker wanted to sue. It never happened.",
            "title_similarity": "0.7583333"
        },
        {
            "id": "h9d4sy0",
            "score": 2,
            "text": "Yeah, this is a good ELI5. I feel like most of the time they are 100% empty, not even any workers. Other times, they are jam packed with trucks. What's up with that?",
            "title_similarity": "0.7689143"
        },
        {
            "id": "h9d6f94",
            "score": 2,
            "text": "I know that 80,000 lbs. Is the maximum weight in the U.S. and a pound over will get a fine.",
            "title_similarity": "0.29485062"
        },
        {
            "id": "h9d7s8o",
            "score": 2,
            "text": "I don't remember what it's called, but they have a system that lets trucks transit the scales at the speed limit, like 65mph. Signs mention some kind of terminal in the driver's cab that allows this.",
            "title_similarity": "0.724134"
        },
        {
            "id": "h9d8h1w",
            "score": 3,
            "text": "Trucks have axle weight limits. In most states 34000 lbs for the drive axles and tandem axles. (The wheels at the back of the truck and wheels on the trailer) The tandem axles slide forward and backward working like the lever on a teeter-totter to balance the weights. Semi truck and trailer loads have a maximum gross weight limit of 80000 lbs as well. These weigh stations check to make sure all of these axles are within legal parameters.",
            "title_similarity": "0.69958115"
        },
        {
            "id": "h9d8svz",
            "score": 1,
            "text": "I had a friend who knew the weight of his truck and on his way back from collecting rocks he would hit the weigh station so he knew how many pounds he collected. \n\nGreat question because I'm seeing a lot of answers to questions I've had for a long time!",
            "title_similarity": "0.68484443"
        },
        {
            "id": "h9d90w9",
            "score": 1,
            "text": "Weigh stations are very much alive and well. They may be more dormant in your area due to budgets or interest, but other areas thrive. Some are always open, they are mainly checking to see if you are over-weight. However, they do check tags/stickers to make sure the trucks are paying that tax money. Also no matter how many lights are on a truck and trailer- they all have to work (unless that has changed lately); and they will very much check those (1:30 a.m. in Texas, a State Trooper jumped Interstate 10's median, ran me down, just to give me a warning that one of my 3 cab lights were out)///  There are x-ray scanners at some stations, and others like to pick trucks at random to pull to the side and check the drivers logs and inspect the entire truck and trailer inside and underneath. The officers will even get out a wrench and check the brakes. No they aren't obsolete, they make a lot of money for the government.",
            "title_similarity": "0.7977773"
        },
        {
            "id": "h9d9cmn",
            "score": 2,
            "text": "Trucks are heavy and therefore there’s more weight on each axle compared to your car. That more weight damages the road surface so the government mandated weight limits per axle. Hence the creation of weigh stations to measure truck axle weights and make sure they’re under the limit.\n\nOne of the reasons you may not see a weigh scale open has to do with seasons. Iirc road surfaces are more susceptible to damage in the spring and fall months (please correct me if I’m wrong) so there’s less of a need for them in the winter/summer and the government won’t open them to save money.",
            "title_similarity": "0.76304543"
        },
        {
            "id": "h9da0fr",
            "score": 3,
            "text": "In CA they are used all the time. You will see an \"All Trucks Must Stop\" sign on. Sometimes they are closed, but a lot are open, and EVERY semi must pass through. In Idaho, never seen one open.",
            "title_similarity": "0.73063946"
        },
        {
            "id": "h9dadmb",
            "score": 1,
            "text": "The goal is not to weigh every truck, but to weigh a statistically useful number of trucks. Sort of like QA in a factory-- don't have to identify every product/item off the line, just a useful enough number to identify if/when/where there are issues and to address consistent problems.\n\nThere is also an element of deterring offenses, but as a single-offense is unlikely to cause real problem to goal is to keep overweight from becoming a chronic issue and, if shippers are consistently overweight then to address that with them one on one.",
            "title_similarity": "0.7498624"
        },
        {
            "id": "h9daojn",
            "score": 1,
            "text": "In addition to what others have said about weight and cargo, states have reciprocity agreements with other states. States get federal money (via fuel tax) to repair highways. Each state tracks where trucks are from and how many miles they travel in their state. They then either pay other states, or get paid, to balance out the mileage and tax dollars. This way it doesn't matter where a truck is from, or where it buys fuel. The states work out the highway tax dollars by measuring mileage and settling up with each other, usually on a monthly basis.",
            "title_similarity": "0.6732435"
        },
        {
            "id": "h9dap0k",
            "score": 3,
            "text": "Here in Canada they will also inspect your truck for safety violations and pollution control compliance",
            "title_similarity": "0.5751796"
        },
        {
            "id": "h9dap7h",
            "score": 1,
            "text": "This is a great question! I've always wondered the same but not strongly enough to ask someone.\n\nAnd the barely used (/I've never seen it used but there're probably some occasions it is) weigh station near me is just a place people stupidly and/or tragically have car accidents from running into it at highway speeds.",
            "title_similarity": "0.8519763"
        },
        {
            "id": "h9db33q",
            "score": 2,
            "text": "Weigh Stations on various highways and interstates across the country are often used for spot-checking the safety, axle-, gross-weights, and legal licensure of operators of heavy commercial trucks.\n\nThey may be checking the gross combined weight of the tractor (colloquially called a 'semi truck'), its trailer or trailers (which are actually 'semi-trailers'), the nature of its load, and the licensure of the driver.\n\nAny commercial motor vehicle can be stopped and inspected by the agency with jurisdiction. Often it would be the agency referred to as State Police, State Highway Patrol, State Patrol, State Trooper, or similar.\n\nWhen weighing, they weigh not only the total weight of the truck, its trailer or trailers, but may also calculate the individual axle weights. Certain areas prohibit axles over a given weight.\n\nThey can also perform spot-safety inspection of a truck -- identical to the daily inspection that a CDL-holder would perform on his or her own truck looking for any indication of damage or needed repairs in its external engine, exhaust system, brakes (and brake shoes), tires and tread-depths, lights and reflectors -- many things.\n\nIn some areas, there may be a Weigh In Motion policy that provides a transponder for the truck to indicate that it's not required to stop for additional inspection at that particular station. Or it may be required to stop.\n\nPersonal vehicles, RVs, motorcycles, and so forth can just drive by.",
            "title_similarity": "0.7567513"
        },
        {
            "id": "h9ddarm",
            "score": 1,
            "text": "I have a distant cousin in law enforcement in Arkansas. He once told me that the only time they run their weigh stations is when they know something illegal is on a truck and need a reason to stop it.",
            "title_similarity": "0.7924249"
        },
        {
            "id": "h9ddle6",
            "score": 1,
            "text": "The Interstate Commerce Act killed their primary revenue source.  They quickly became an expense vs. a profit make for states.  Then over the next couple decades they slowly went away.",
            "title_similarity": "0.5915375"
        },
        {
            "id": "h9ddpuv",
            "score": 3,
            "text": "The one I had to pass by a few times a day was open and pulled me over later in the night. It was right before a steel bridge in Northern California and had a scale. I was driving a box truck with medical gases and they verified my lights were working, had a look at my license and insurance, and asked what my cargo was. The inspector applied a new dot inspection sticker and sent me on my way. They’re mostly for axle weight, permits, cargo securement, and hazmat compliance as far as I know.",
            "title_similarity": "0.7037902"
        },
        {
            "id": "h9df4ue",
            "score": 1,
            "text": "I legit thought they were for the purpose to weigh trucks over time so they can identify mass transit of  illegal contraband. They, being some government officials. This is interesting.",
            "title_similarity": "0.6913066"
        },
        {
            "id": "h9dfhp4",
            "score": 2,
            "text": "There's one between San Marcos and Austin on 35 that I always see empty, actually saw a guy think it was an exit and dodged the barrels blocking it last minute",
            "title_similarity": "0.6838478"
        },
        {
            "id": "h9dgvrp",
            "score": 1,
            "text": "Also, a lot of those scales have become obsolete, because the trucks have computers now that communicate with the station, tell it what the load is, how much its supposed to weigh, how long the drivers been on the road etc. With this they've started a lot more \"weigh in motion\" systems don't even need to leave the freeway",
            "title_similarity": "0.8099518"
        },
        {
            "id": "h9dhb7l",
            "score": 1,
            "text": "If I remember correctly, it's to ensure that the load is balanced properly. This is important from a safety standpoint because if there is too much weight on the rear, it can make it harder to control the trailer and increase the likelihood of an accident. If there is too much weight on the front and rear or in the middle, the trailer can literally crumple in half, which is a hot mess. \n\nAs for the weigh stations, from what I remember they had to stop if they were open, unless they had a pass. You could be ticketed if you didn't, and getting tickets as a trucker is bad news bears. \n\nMy knowledge comes from working as a freight clerk.\n\nEdited cause I remembered something wrong",
            "title_similarity": "0.67795646"
        },
        {
            "id": "h9dhcdr",
            "score": 1,
            "text": "In Texas, they are pretty much always manned and busy. Especially near the southern border.",
            "title_similarity": "0.3838281"
        },
        {
            "id": "h9dirnd",
            "score": 2,
            "text": "Just want to add that weight is only part of what weigh stations are for. They're enforcing safety as well.. the weigh master is checking each truck for dead lights, leaking loads, unsecured loads etc. Another aspect is logbooks; each driver has to maintain a logbook to ensure that he isn't spending too much time on the road. As an example, Truckers are getting paid by the load they haul. So if you get paid $5k to haul a load of watermelon from hermiston to Portland, then wouldn't you be tempted to go crazy and do back to back hauls to get big money? But this activity would put us common folk in alot of danger. Weigh masters are ensuring that doesn't happen. Nowadays trucks are equipped with electronic logbooks which is basically a computerized time clock that is using gps and those transponder scanners that hang over the highway to track how many hrs a truck is on the road. These days drivers are only permitted to drive 10hrs a day.",
            "title_similarity": "0.7728334"
        },
        {
            "id": "h9djqrj",
            "score": 1,
            "text": "Weigh stations are typically operated by state DOTs with budget concerns and like every other industry, they also have trouble filling positions lately. These scales are operated by hoomans who have kids who get sick, take vacations, etc. \n\nThe name is a bit misleading, as others mentioned, yes they check weight but as the truck is rolling by they are looking for numerous other things. Are they drifting all over the place, not following posted directions (what to do at various signal lights), is the load secured, flat tires, articulating parts of tractors and machinery locked / secured, appropriate license plates / tags on the tractor and trailer. While watching all that, did the driver have their seat belt on? If you go out to ask them for their oversized permit or any other question, do you smell dope on the driver?\n\nDrivers can be selected for inspection of the drivers papers and inspection of the truck tractor trailer combo and put out of service for a wide variety of violations.",
            "title_similarity": "0.84922695"
        },
        {
            "id": "h9djwu5",
            "score": 2,
            "text": "I’ll throw in some info about Weigh-in-Motion (WIM) systems too:\n\n\nThere are sensors which can be put in roads which weigh the truck axles as they drive over them at highway speeds. Or at least, get a good approximation of the weight. These systems will then notify the driver (either through in-cab systems or digital signs further down the road) if they can bypass the station, or need to stop for inspection. These sites will typical also have cameras to get pictures of the truck and it’s license plate. As this technology progresses, there is some chance of making weighstations obsolete in “direct enforcement” sites. ie: fines can be issued directly from the data gathered by the WIM, without needing to be confirmed at a weigh station.\n\n\nThere will also typically be sensors just after the exit to the station, to track if a truck which was told to exit did not. And sensors in lanes adjacent to the WIM sensors, to catch trucks trying to dodge the scales.\n\n\nA couple notes about new technology, for anyone into this kind of thing: it used to be big, heavy, steel scales buried into the road. Those are still used, but more often now it’s just a couple rows of small sensors, a couple inches thick/wide that can just be cut into the top layer of asphalt/concrete. Also, the hot new technology is sensors that can measure if a truck’s tires are under inflated as it drives over.\n\n\nSource: work for a company that sells/installs WIM systems.",
            "title_similarity": "0.7453109"
        },
        {
            "id": "h9dk8p8",
            "score": 2,
            "text": "*taxes* my friend. the larger trucks put a great deal of stress on roadways, *thus* a system to account for them + they’re easy targets for traffic violations, so tickets then generate revenue for the DOT to operate and/or fix roads.",
            "title_similarity": "0.7181064"
        },
        {
            "id": "h9dkpo6",
            "score": 2,
            "text": "I'm not a trucker, and this may not be accurate but as a layman, I'd also guess that the stations are important when traversing over mountain ranges, to help prevent loads from shifting or allowing truckers to make a quick brake check. I live on the West Coast, and there's a few areas on I-5 where an unbalanced load (or faulty brakes) could be dangerous.",
            "title_similarity": "0.71630555"
        },
        {
            "id": "h9dl7qo",
            "score": 1,
            "text": "I thought they used to make money with fines ,for the state it was in. Ours are always closed now.",
            "title_similarity": "0.6953836"
        },
        {
            "id": "h9dlr5p",
            "score": 1,
            "text": "For some reason I always have the worst luck at the Yulee FL port of entry. Last time they pulled me into the barn. Guy was cool enough, but bruh",
            "title_similarity": "0.69421333"
        },
        {
            "id": "h9dmpe4",
            "score": 2,
            "text": "They're used in Oregon all the time! Oregon still has a weight-mile tax that is charged on commercial vehicles over 26k lbs. so the weigh stations are necessary for the trucks to calculate how much they owe. Not all trucks have to stop at the main weigh stations because weigh in motion scales have been installed near these stations and if the truck has the appropriate device on board to use the weigh in motion scale, they don't have to stop. [source](https://www.oregon.gov/odot/MCT/New%20Carrier%20Education%20Manual/Section_3_Weight-MileTax.pdf)",
            "title_similarity": "0.77323115"
        },
        {
            "id": "h9dn9t3",
            "score": 1,
            "text": "For context I don’t know much about the weight stations on the road but I operate one at a truck stop, from what I understand they are placed before bridges or stretches of road that have weight restrictions. Most bridges and some sections of roads have a limit on how much weight a single axle can be holding at one time. This is to limit road wear and other structural issues that could come as a result of it.",
            "title_similarity": "0.7840765"
        },
        {
            "id": "h9dnen1",
            "score": 2,
            "text": "What about those weigh stations out in the middle of no where? \n\nYour in a town of 300 people and you hit the back road highway. Out by a field there's a weigh station. No buildings, but just a long concrete strip, and a few signs. \n\nWhen are those used? What prompts those weigh stations to open?",
            "title_similarity": "0.689584"
        },
        {
            "id": "h9dq5tg",
            "score": 2,
            "text": "To add on to what others have said, our family has had to use them before to get refunded for military moves. We have to weigh the vehicle empty and then loaded.",
            "title_similarity": "0.6666584"
        },
        {
            "id": "h9dsfpe",
            "score": 1,
            "text": "Lay French man here, I had to drive a small moving truck from Davis to Santa Cruz for my brother-in-law and they did ask me to get weighed at the weighing station. Personnel was very friendly, checking licenses and stuff. I was a little worried about how to get on the scale but they were friendly and understood that I had never done this. The whole process was quick and simple. Of course I hadn't overloaded the truck.",
            "title_similarity": "0.70465744"
        },
        {
            "id": "h9dslvo",
            "score": 1,
            "text": "A little late but around me I've always heard they only use them when they suspect there may be something sketchy on an upcoming shipment so they can check every truck that goes by",
            "title_similarity": "0.71974087"
        },
        {
            "id": "h9dszjs",
            "score": 4,
            "text": "I drove a truck for many years. Didn't see answered to all your questions.\n\nSkip sign- the digital ones are usually linked to high speed scales built into the right lane of the interstate. They are a rough estimate of if you're close to the weight limit. If you are the sign will change to enter / weigh for your truck and then switch back. You then enter the scales for a more exact measurement.\n\nEzpass looking thing- basically larger trucking companies have digital copies of what your hauling and its uploaded to DOT. Unlike ezpass these tags have lights/beeps and will signal green for skip or yellow for weigh. There is a semi random factor as well. Depending on your company's record you will be more or less likely to get pulled. (Worst company I worked for I got pulled 2 times a week. Best I got pulled 2 times a year.)\n\nBridge Law- I'm barely going to scratch the surface of this as it's kind of involved. The total weight of your vehicle is less important than its distribution. You can get permits to run overgross. (>80,000lbs for 5 axels) but you cannot run overweight per axel. Unmarked bridges in the US are designed to a standard weight capacity per span. A span is about 10 feet if I recall. This is why super heavy items are carried on trailers that are really long with a bazillion tires. For  a single axel weight max is 20,000lbs and for tandem axels the max is 34,000lbs. For a standard \"18 wheeler\" configuration, gross is 80,000lbs, but you can have a max of 14,000lbs on the steer axel and 34,000lbs on each drives and trailer. Add those and you get 82,000lbs. Very little wiggle room. Modern loading is pretty precise.the weight of each pallet is known pretty precisely. There are programs that tell the person loading your trailer what order each pallet needs to go in to keep you balanced. This all goes out the window with produce, raw materials, and trash. During harvest in areas where root/bulb vegetables are grown scales run much more frequently.\n\nIn short they don't open the scales often anymore because they aren't really needed that much anymore.",
            "title_similarity": "0.8448626"
        },
        {
            "id": "h9dt5wj",
            "score": 3,
            "text": "I'm not seeing this answer here yet, but they are also commonly used in military housing moves. If a service member chooses to move their own household goods instead of having the government shipping contractors do it for them, you are compensated based on mileage and weight. So you weigh your vehicle (and trailer if you use one) empty, then weigh it again after everything is packed. At the end of your trip, you weigh it again to ensure you didn't alter the weight to cheat the system and make more in compensation.",
            "title_similarity": "0.6668808"
        },
        {
            "id": "h9dty9h",
            "score": 3,
            "text": "Work for an international moving company. The weight tickets from these stations are also needed for multiple purposes. For one, they are needed to meet DoT regulations as stated in other posts. For another, if a move is being charged based on its actual weight (which isn’t normal these days) the weight tickets are used to determine that. Also they are expressly required for military moves regardless of whether the move is charged by the actual weight.",
            "title_similarity": "0.6238514"
        },
        {
            "id": "h9dv3da",
            "score": 1,
            "text": "Here in Canada any commercial vehicle registered over 5500kg is supposed to drive through the scale when it's open. It's not all about weight they will also stop you for improperly secured loads and stuff. I run a mobile welding truck and I've been stopped a few times. I recently bought a single rear wheel pickup instead of a dually, so that I'm slightly lighter. I registered it for 5500kg and now I'm not required to stop.",
            "title_similarity": "0.7250775"
        },
        {
            "id": "h9dzxyf",
            "score": 1,
            "text": "This is where truck inspections are done. These inspections are usually very quick and depending on the tech most weighs are done while the truck is moving before it even reaches the off ramp. In my state there is a small subset of the highway patrol that actually mans those stations. They always seem closed because much like a patrol officer setting up to catch speeding these stations are opened randomly to avoid drivers intentionally skipping them.\n\nDuring a weight check in the driver may be required to produce their log book for examination, their vehicle is given an inspection, and the driver advised of anything that’s defective or in need of repair.",
            "title_similarity": "0.83632994"
        },
        {
            "id": "h9e2b0z",
            "score": 2,
            "text": "Used to work in a scale house for a osb plant. They're to make sure that trucks aren't overloaded. if I remember correctly they can't surpass 80k pounds or they're in violation. I've sent trucks back into the plant for being 5 pounds over 80k",
            "title_similarity": "0.74047387"
        },
        {
            "id": "h9e2opp",
            "score": 2,
            "text": "I drove semi trucks for 3 years. They are spaces that thd department of transportation  ( DOT) open randomly off and on. Some are open more frequently than others.\n\nTheir purpose is to be check points to ensure transportation guidelines & policies are followed. They check the axle weight of trucks & look over our papers. Inspection of equipment as well as random drug testing can happen.\n\nThey give police chances to enter every truck and do anything they want with helps to also prevent drug trafficking & human/ animal smuggling.",
            "title_similarity": "0.76874936"
        },
        {
            "id": "h9e4n0x",
            "score": 1,
            "text": "Trucks have an 80,000 lb weight limit that is divided among each set of tires. Weigh stations make sure they aren't overweight and damaging the roads.",
            "title_similarity": "0.6994461"
        },
        {
            "id": "h9e62sd",
            "score": 2,
            "text": "In Indiana a large number of former weigh stations are permanently closed. However, Indiana State Police are equipped with [portable scales,](https://www.youtube.com/watch?v=fGr7AWrHTHg) which can be used at roadside to estimate a semi-trailer's weight. They use a combination of random stops, along with targeted stops - evidently there are some visual observations that can suggest that a given trailer might be overloaded.",
            "title_similarity": "0.803395"
        },
        {
            "id": "h9e7zde",
            "score": 2,
            "text": "Semi trucks have to meet certain weight requirements to be street legal. \n\nYour typical semi truck can't have a load of over 80,000 lbs. Also the load has to be balanced properly so that it's close to 40,000 on the front wheels and 40,000 on the back. You can adjust your \"tandems\" which is the rear wheel position, relatively easily to balance out your load. \n\nSpecial loads over 80,000 are allowed but because they do so much more wear and tear on the roads there's additional taxes on those. Special permits too. \n\nAs far as those weight stations on the side of the highway, yeah not really sure what the deal is with those. At my workplace we load trailers and we have our own scale on site (that is validated by the department of transportation twice a year) and we just print scale tickets for our drivers. So if they are pulled over they can show that this trailer is street legal. \n\nThere's frequently also scales at truck stops. So truckers can check their loads at those too if the site they're picking up from doesn't have a scale. \n\nAnyway I think those scales have mostly gone privatized. And I think that's why the ones on the side of the highways (the state run ones) are mostly unused at this point.  Easier for the state to just validate private ones than to actually corral all the semi trucks through their spot.",
            "title_similarity": "0.7727527"
        },
        {
            "id": "h9e8gnd",
            "score": 41,
            "text": "As a truck driver, scales usually aren't more than a small inconvinence as long as you planned ahead and checked your axle weights before hitting the road. Being caught overweight can be incredibly expensive and also can put you out of service until you or your company can remedy the situation.\n\n With DOT scales I am mostly concerned about axle weights. Your load may be under maximum payload for the truck but overweight on one or more axles. Interstate scales typically measure each axle group individually. In general weights max 12,000 lbs for the front axle 34,000 lbs for the rear truck axles a 34,000 lbs for the trailer axles (on most trucks). It can get much more complicated with oversize/overweight heavy hauling and other specialized trucks and trailer.\n\n Most trailers have the ability to slide the trailer axles forward and back and trucks usually can slide the 5th wheel to help you distribute the weight properly over all the axles. \n\n  I do scale with most loads before hitting the road at the nearest truck stop if the shipper doesn't have one on location. Most truck stops have scales for $10-12 and you can re-weigh for about $2 if you need to adjust the load or truck. Fuel weight must also be taken into consideration. I have also scaled my truck empty as well to get a baseline weight so I have an idea of what my payload weight can be before arriving at the shipper.",
            "title_similarity": "0.8002231"
        },
        {
            "id": "h9e8kid",
            "score": 1,
            "text": "I.C.C. is a checking on down the line\n\nWell I'm a little overweight and my log book's 'way behind\n\nBut nothing bothers me tonight\n\nI can dodge all the scales all right",
            "title_similarity": "0.6273916"
        },
        {
            "id": "h9e8x7w",
            "score": 2,
            "text": "The scales are open or monitored the plates on the highway have a pre pass sensor built in for some company’s running overweight is the operators fault completely",
            "title_similarity": "0.773584"
        },
        {
            "id": "h9eb8ct",
            "score": 1,
            "text": "Some police carry mats in their patrol cats that can be used to weigh semi trucks at any time, they use these from time to time.\n\nAlso I drive past a weigh station every day in Michigan, they have it active during busy trucking hours and weigh every large, commercial vehicle. Our roads are already shit so they collect fines on vehicles that put too much stress on the roads",
            "title_similarity": "0.7454195"
        },
        {
            "id": "h9eby8p",
            "score": 1,
            "text": "These facilities also often perform safety related inspections.   They can look at each wheel with thermal imaging to make sure the brakes on each axle are working as they should.   If one axle is cold, indicating the brakes are not functioning,  they will likely pull the truck in for a manual inspection.",
            "title_similarity": "0.59531105"
        },
        {
            "id": "h9ec2ku",
            "score": 1,
            "text": "MONETIZATION of a vulnerable industry. Mostly hitting small business owners. Back in the day they were never closed but as Megas (very large trucking companies) now have a strangle hold on most general freight, many lie dormant unless the local economy is dead. If you drive around the country you will see that the poorer a state is, the more likely their Weigh Stations are to be open.",
            "title_similarity": "0.81092745"
        },
        {
            "id": "h9ecdn0",
            "score": 1,
            "text": "When I use to drive, only about half were ever open.  But enough we’re still open, that you had better not be driving around with an overweight vehicle.",
            "title_similarity": "0.6577301"
        },
        {
            "id": "h9echk2",
            "score": 1,
            "text": "The scales here were used to make sure they could handle grades. An overloaded truck could go out of control down a grade by burning out the brakes, resulting in massive wrecks.",
            "title_similarity": "0.6929954"
        },
        {
            "id": "h9ed6fr",
            "score": 1,
            "text": "In addition to all the other good answers, they can inspect your truck to make sure it’s in working condition, so if you pull in with an old ass beat up truck that’s leaning to one side they can pull you for an inspection and possibly take you off the road",
            "title_similarity": "0.6695027"
        },
        {
            "id": "h9eekdp",
            "score": 1,
            "text": "Before you approach a weigh station, there are sensors in the road that weigh your truck. The sensors send a signal to the truck and weigh station letting you know to stop or pass. \nYou will see the EZ pass sensors hanging over the road right before the entrance to the scale house.",
            "title_similarity": "0.65478307"
        },
        {
            "id": "h9eezid",
            "score": 2,
            "text": "Check out the Michigan trains 11 axles of pure tire-rubber-goodness.\n\n[https://www.truckinginfo.com/158924/michigan-trains-productive-and-safe-with-a-flaming-exception-years-ago](https://www.truckinginfo.com/158924/michigan-trains-productive-and-safe-with-a-flaming-exception-years-ago)",
            "title_similarity": "0.52974"
        },
        {
            "id": "h9ef9gh",
            "score": 1,
            "text": "So say a trailer is overloaded, does the driver get a fine or whatever company loaded the truck?  Not sure how much agency truckers have over what they're carrying.",
            "title_similarity": "0.71641964"
        },
        {
            "id": "h9eh4m1",
            "score": 1,
            "text": "I just wanted to throw in another one you might see if you travel at all through the mountains.   \n\nYou may encounter these long strips of gravel just going off nowhere.   These are for trucks to use in case they lose control on the mountains.  The townward pull will just make them build speed until a catostphoc ending.  The gravel ramp is there for the semi to veer to and essentially will drag them to a stop without flying off the mountain.\n\nhttps://youtu.be/h5KgKebgkwk\n\nSide note, the video is slightly misleading on how it looks, because the road itself is at a severe downward slant but looks flat.",
            "title_similarity": "0.7282218"
        },
        {
            "id": "h9ehf2n",
            "score": 2,
            "text": "I used to live right by one on I74 near the Ohio/Indiana border. Drove by it daily for years.\n\nIt was occasionally open.",
            "title_similarity": "0.4362075"
        },
        {
            "id": "h9ei6o6",
            "score": 1,
            "text": "A weigh station isn't obsolete. Generally the weigh stations are either manned by someone who strictly weighs the commercial vehicles or by commercial vehicle enforcement police officers. They check commercial vehicles for weight and inspect them. There are around 4 million inspections in the US every year. During a typical shift we open and close the scales all day long. You get a slow driver going through the scales, you close the scales so commercial truck traffic doesn't get backed up onto the expressway. You pull a vehicle around for an inspection or to weigh them; you close the scales because nobody is watching traffic anymore. You get called out to a crash, complaint, someone who bypasses the scale, etc.; you close the scales. Some officers prefer working at the scales, some do more mobile inspections. Also we have one portable scale unit per district that can weigh trucks on the side of the road. In my area we have one scale that has been closed for over a year because the base of the scale shifted and the state hasn't allocated money to fix it.",
            "title_similarity": "0.7881667"
        },
        {
            "id": "h9emzuy",
            "score": 2,
            "text": "The scales are there to weigh the trucks as they pass by that section of fwy. They also have the right to inspect your truck to make sure it is safe to operate. If you pass inspection you get a sticker with a color and number that you put on the bottom passenger side of your windshield that represents the year and month you got it. So they will usually leave you alone for 3 months from when you got it.",
            "title_similarity": "0.7429513"
        },
        {
            "id": "h9en0oa",
            "score": 1,
            "text": "Missing from my scan:\nWeigh stations typically are only open at the incoming border of a State. When you leave a state, most times the last station will be closed, but as you enter a new state, you will find the 1st weigh station open typically. I have found this to be the case in many East-West journeys over the years.",
            "title_similarity": "0.6953893"
        },
        {
            "id": "h9epbgt",
            "score": 5,
            "text": "Truck driver here. Newer scales are located on the traffic lanes. The state can weigh the trucks at speed. If they’re overweight, they can be flagged into the station. Newer stations also have the means to measure brake temperatures to determine if brakes are adjusted properly. The scales on I-40 in Knoxville, tn even scan for radioactivity.",
            "title_similarity": "0.7448484"
        },
        {
            "id": "h9erdpj",
            "score": 1,
            "text": "They're literally used for weighing trucks.\n\nThey keep people from driving trucks that are too heavy and they let drivers see how much load they have.",
            "title_similarity": "0.76883245"
        },
        {
            "id": "h9erv45",
            "score": 1,
            "text": "I went on one with my grandad when I was a kid and I thought it was the most exciting thing ever (TBF I was very young, primary school age). He had just picked up a load from a quarry which was obviously heavy so had to check his load weight",
            "title_similarity": "0.5078661"
        },
        {
            "id": "h9esqn0",
            "score": 3,
            "text": "I used to be a truck driver about 10 years ago and I agree with all the scale techs that have answered. When I got my license, I didn't scale out any loads I hauled for the first 6 months just because the weigh stations were never open. Then one day in Colorado, I had to go through one and I got a ticket for one of my axels being overloaded. So, I got a ticket for being overweight (which is something funny I like to say). \n\nI was able to fix it because you can adjust the balance of the load by moving the back tires of the trailer to even out weight distribution. That's what all those holes are on the underside of a trailer near the back tires. Doing that doesn't work if you are over your gross weight.",
            "title_similarity": "0.76203966"
        },
        {
            "id": "h9etn5b",
            "score": 1,
            "text": "this little of info may be here somewhere, too many to read all. the declared weight on the paperwork must also match the weight of the load. if the truck is heavier than stated (don't know the variance allowed), e.g., paperwork stated 6 tons, actual weight on scale, 6 1/4. they most likely will open it up & inspect everything and look for contraband of any kind. eli5, what solar system are you from?",
            "title_similarity": "0.7189473"
        },
        {
            "id": "h9eupc7",
            "score": 1,
            "text": "Each state has slightly different procedures.  A weigh station is a location for the commercial vehicle enforcement division to inspect commercial vehicles. Weight is only a small part of the various safety regulations. Vehicle condition and driver paperwork is also frequently inspected. \n\nConsider a weigh station like an airport security checkpoint. When the station is operating every truck will enter the line. Some are simply waved through, some are spot checked for one or two things.  Some are given a thorough inspection including measuring the adjustment of brakes.   Once I was given a ticket because my windshield washer fluid was empty. \n\nSome states operate weigh stations 24/7, however the majority are used randomly so as to catch people off guard.  This allows a smaller force of officers to influence behavior over a large area because you never know when that station might be open.",
            "title_similarity": "0.8625113"
        },
        {
            "id": "h9euw3j",
            "score": 3,
            "text": "and just because no one else seems to have mentioned it.\n\nthey dont always have to have every one open to cover the largest logistics routes.\n\nif youre driving a long route you'll eventually hit one thats open.\n\nthats really common in Canada going through the mountains. theres only 3 passes and each of them have a 1/2 dozen inspection stations.\n\nthey open them randomly to screen each of the feeder routes into the major routes.\n\nit saves time for  long haul drivers because they dont have to stop at all of them if theyre going straight through but the local drivers have to gamble if the one they go past is open.\n\nthe long haul guys know theyre going to hit at least one, so they dont fuck around.\n\nthe local guys are risking their drivers and business licences, if they make a habit of being slimy they'll get caught eventually.",
            "title_similarity": "0.6965575"
        },
        {
            "id": "h9ewmtv",
            "score": 1,
            "text": "Why weigh on a sunny day?",
            "title_similarity": "-0.0075683296"
        },
        {
            "id": "h9exkde",
            "score": 2,
            "text": "Everyone is talking about big trucks, but you can weigh your vehicle on those as well. It's very annoying that some places shut them off when not in use. Up in the northwest they are left open and the public can use them.\n\nI often need to check my weights when going on road trips and this is the only way to do it.",
            "title_similarity": "0.8453072"
        },
        {
            "id": "h9eyq4u",
            "score": 2,
            "text": "They are open here, some trucks get weighed and others get flagged over for inspection by specially trained state patrol. They get under the hood, and check for all sorts of stuff - checking to make sure the trucks are safe + maintained. Some get huge fines",
            "title_similarity": "0.71359694"
        },
        {
            "id": "h9ez6ph",
            "score": 1,
            "text": "I am dying to know what would happen if I got in line behind semi with my fiat 500 and asked to be weighed. Would I get a ticket for trespassing?",
            "title_similarity": "0.6193002"
        },
        {
            "id": "h9f0084",
            "score": 2,
            "text": "I go through truck scales almost every day here in so cal. Not only is it for making sure yoy aren't overloaded, sometimes they pull you out to inspect brakes, tires, lights, steering wheel play, paperwork, etc.",
            "title_similarity": "0.6818203"
        },
        {
            "id": "h9f0q9h",
            "score": 3,
            "text": "When military people move they also have to use these stations to weigh their goods. They get paid by the amount of weight that they have to move across the United States. So they have to do a weigh before they move  (empty) and a weight after they move.",
            "title_similarity": "0.6226611"
        },
        {
            "id": "h9f7wyq",
            "score": 1,
            "text": "I’m apart of a moving company and there just open at certain times but it just make sure the trucks aren’t over weight for the license that the driver has",
            "title_similarity": "0.7877798"
        },
        {
            "id": "h9fekoy",
            "score": 2,
            "text": "A weight station can also be empty while in use because they have installed in-road scales that weigh as the vehicles roll over them at highway speed. They aren't as accurate, but they are only looking for trucks that could potentially be over,  and only those trucks are signaled to pull in for a weigh on the old scale.",
            "title_similarity": "0.8813826"
        },
        {
            "id": "h9fesmk",
            "score": 2,
            "text": "Most weigh stations in the middle of a state are used during harvests and annual truck traffic.   Depending on the state the weigh stations at the entrance and exits to states on main interstate roads are open more often.  The reason you see them as closed is because states tend to us w.i.m (weigh in motion), these are scales placed into the highway that you cannot see.  If the weight is not close to 80,000lbs then sensors in the truck tell the driver to bypass the weigh station. Most bigger trucking company trucks talk to the weigh stations.  Rarely do weigh stations pull in all trucks, that usually only happens when they are checking for safety violations. Btw the weighs for a regular trackter and trailer is steers=12,000 drives=34,000 and   trailer tandems= 34,000 full rig 80,000.  Also be aware weigh stations are for all commercial vehicles over 12,000lbs not just trucks.",
            "title_similarity": "0.85862386"
        },
        {
            "id": "h9ff7e5",
            "score": 1,
            "text": "For those who don't know, those white plastic cone looking things that are often suspended over the highway near weigh stations are used to track trucks and cargo containers fitted with various gps devices so that owners of those things can track their progress.",
            "title_similarity": "0.6412845"
        },
        {
            "id": "h9ffe3l",
            "score": 3,
            "text": "Truck driver here, it's not just about weight, they also inspect your truck to make sure it's operationally sound. If there's an issue with your truck, or your inspection form, they will not hesitate to pull your ass over and give your company (or do, depending on if you're independent) a ticket.",
            "title_similarity": "0.67262983"
        },
        {
            "id": "h9fj2hc",
            "score": 2,
            "text": "I work with a large fleet and all of our drivers have \"passes\" that are scanned as they drive by weigh stations  and it tells them if they have to pull in or not. It tells the station who is driving the truck and our company info and stuff like that. Older drivers who have had no driving issues very very rarely have to pull in. Our new drivers and drivers that have recent tickets and issues have to pull in nearly every time.",
            "title_similarity": "0.73715025"
        },
        {
            "id": "h9fjnao",
            "score": 5,
            "text": "The military use them too. When we move (PCS), we are paid to do so. One of the ways they pay us is if we choose to do a DIY PCS, is by weight of all your crap. So if you had to move 2,000 lbs of your crap, you get paid by the DoD 2,000 lbs worth of crap moveage. Move less, get paid less.\n\nWe are instructed to weigh the vehicle prior to loading up, and then after loading up, before we get to our new duty station. So if your UHaul weighs 2,000 lbs, you load the truck, weigh it again and it reads 4,000 lbs. The government will do the math and pay you 2,000 lbs worth of moving crap.\n\nSo military personnel use vehicle scales to figure out how much our crap weighs so we can be paid to move our butts to a new duty station. So the trick is, be as light as possible before and as heavy as possible after. So a lot of times we will weigh it on an empty tank, then load up, get gas, then weigh again then XD I had a vehicle to move too, so I didnt have the car attached when I weighed it the first time, then had it attached for the 2nd weigh in lol Almost a $5,000 dollar paycheck. Keep in mind though it cost money and time and effort to move. So its not like I (or we) gain a profit necessarily haha I probably only made 1,000 ish bucks? But that still is cool.",
            "title_similarity": "0.6736623"
        },
        {
            "id": "h9fml9r",
            "score": 2,
            "text": "I got stopped once in a work cube truck. I was taking giant batteries from NYC to Rhode Island and got stopped in CT. \n\nThe truck was overweight and they had to inspect everything. I didn’t have a properly filled out log book and there were a few other things I didn’t have right. Apparently it would have been a big deal if I ever got caught again. I didn’t have a CDL and didn’t need one for the truck I was driving, and I only vaguely knew about log books since it isn’t typically needed for the job I did. \n\nEventually they let me go, but it was an ordeal.",
            "title_similarity": "0.80314076"
        },
        {
            "id": "h9frfmm",
            "score": 2,
            "text": "These aren’t only look for ‘weight’ there is usually a State Trooper who specializes in commercial vehicle safety, random inspections on safety, cargo, lighting, brakes.  \n\nIf you have something he notices he’ll pull you around back and give you a more detailed inspection.\n\nAlso inspects logs, and bills to make sure nothing dangerous is going on",
            "title_similarity": "0.70074403"
        },
        {
            "id": "h9g2vl1",
            "score": 1,
            "text": "Weight stations are used to check for overall legal operations, not just overweight trucks. They can request hours-of service logs and other DOT required documentation during the scale check, as well as visual inspection of electrical and mechanical components for safe operation (tractor/trailer lights are functioning, pneumatic air hoses are working and intact to ensure braking/suspension systems would work as anticipated, etc.). \n\nCommercial trucking companies are also required to list certain information on the driver-side door, so the DOT officers can run the company motor carrier or US/State DOT numbers for operational history. If they have a shit HOS/safety/maintenance history, they need to be inspected more frequently until they've shown a pattern of passed inspections.\n\nThe DOT's also have mobile electronic scales that can be deployed during roadside stops by an individual officer, so avoiding a scale house is just rolling the dice that you won't get spotted enroute. And avoiding a hwy scale house can usually involve driving on non-commercial routes.....and they can get you for that, too. \n\n*Have worked in the North American trucking/supply chain industry for 18 yrs",
            "title_similarity": "0.6955726"
        },
        {
            "id": "h9g4tnb",
            "score": 2,
            "text": "This post is tangential, but still related. I worked with a company and dealt with commercial trucking industry every day. \n\nCommercial trucking is super strictly regulated. Compared to passenger vehicles, there is exponentially higher and more expensive damage that a truck can inflict. Cargos might be harmful, toxic or dangerous. But the sheer weight is monumental and can much more easily kill people and damage property. Weigh stations might be rarely used, but if they are, they add another level to monitoring commercial trucking. Random openings of them keep truck drivers on their toes, and might keep most drivers honest. Also see /u/serath62 comments on  this.\n\nAs to more information on commercial trucking, the following is more than you might want to know, but here it is anyways:\n\n.\n\nFirst, Gross Vehicle Weight Rating (GVWR). The gross vehicle weight is assigned by each manufacturer, and it the total a truck is allowed to carry, including the truck itself. So if a truck is rated at 26,000 pounds GVRW, and if the truck itself weighs 10,000 pounds, then it can carry a maximum of 16,000 pounds of cargo, for that total of 26,000 pounds gross weight. \n\nTrucks whose manufacturer’s Gross Vehicle Weight Rating (GVWR) that is **greater than** 11,500 pounds are required to register as a commercial vehicle in California, so you pay extra fees and get a special license plates and have commercial auto insurance, and get a MCP (Motor Carrier Permit) from the DMV. Additionally, trucks that are **under** 11,500 pounds are required to register as commercial vehicles if their bed is a box, flatbed, utility bed (utility beds are those trucks that plumbers and other trades use that have doors on the side).\n\nAs an aside, a commercial drivers license is required for drivers with trucks with a GVWR greater than 26,000 pounds.\n\nIn California, and probably in other states, police carry inflatable scales in the trunk of their cars - I know for sure  the CHP does. So if they pull you over, they put four inflatable scales under each of your truck's tires, and proceed to inflate them, and can weigh the truck. If your truck's weight is over the GVWR, you will get a ticket for that.\n\nAs I mentioned in the second paragraph, this is mainly for safety reasons. If you are carrying more than what your truck is rated for, you might not be able to stop, and then crash into other vehicles, or not be able to stop in time for a stop sign and kill a pedestrian crossing the road. It's even worse in bad weather conditions, for example rain will cause grip issues on the road.\n\nAccording to the National Highway Traffic Safety Administration (NHTSA), there were 3,900 fatalities and 104,000 individuals injured as a result of truck crashes in 2012. One common reason for catastrophic injuries in truck collisions is a driver's loss of control of an overweight or overloaded truck.  According to the NTEA, large trucks that were severely over their GVWR caused over 3,500 deaths in 2016. \n\nAdditionally, your insurance policy probably wont protect you if the vehicle is overloaded.",
            "title_similarity": "0.7719693"
        },
        {
            "id": "h9g6f2q",
            "score": 2,
            "text": "All the comments seem to contain attitudes that indicate lack of thought or knee-jerk reactions! Then also devolve into subjects that are not pertinent.  \nWhen people discuss laws they should research it first. Overloaded trucks pose a hazard as the braking, steering and suspension are compromised. Drivers stand to lose income from violations of every kind and losing control of your rig can be quite deadly to motorists. Trucks easily damage roads and quickly as well. I ride motorcycle and road ruts from 18 wheelers make a ride a hazardous proposition especially with cars riding your donkey. Number 1 cause of fatalities on highways is excessive speed then following too closely. I travel a 2 lane that has heavy big rig traffic and can always anticipate truckers coming from behind me and will use my lights or CB to let them know I am going make passing me easy. They appreciate it by flashing brake lights which is something cars used to do but those road manners do not exist anymore. Cars driven by rude young people raised by idiot parents. The highway I mentioned has plenty of collisions and rollovers and not one 18 wheel mishap that I have seen. Deer and elk on the roadway after dark is not taken into account by these boneheads either. Airbags have saved lives of idiots driving much too fast which has me wishing airbags were illegal,",
            "title_similarity": "0.7798262"
        },
        {
            "id": "h9gem6y",
            "score": 3,
            "text": "Source: Class A Driver who goes through scales regularly.\n\nTo explain like you're 5:\n\nThey're to see how heavy the big trucks are. Certain roads can't handle the weight of a big truck.\n\nTrucks also have a registration weight they need to comply with. If they want to haul heavier loads they need to pay more to the State.\n\nTrucks also need to be inspected for safety reasons. If brakes are leaking or the load is not centered over the axles there could be an accident.\n\nThey also check for licenses. You need a special license to haul heavy loads and hazardous chemicals. If you haul hazardous material without a hazmat endorsement you can be jailed or fined huge amounts of money.\n\nThe truck routes are usually built so theyre not so steep so the heavy loads and get up hills or alleviate traffic.\n\nThere's more but you're 5 and probably overloaded already.",
            "title_similarity": "0.8032507"
        },
        {
            "id": "h9gge3q",
            "score": 2,
            "text": "So, i used to drive a tow truck.  Every vehicle over 10,000 lbs used commercially gets weighed at these stations,  especially common near state borders. \n\nGenerally,  they're checking to make sure that you're not overloaded or overweight.  Semis are limited to iirc, 80k lbs. \n\n\nThey also run semi-random inspections.  They check things like brakes, frame, suspension,  emissions,  driver logs (commercial drivers are limited to a certain number of hours driving per day).",
            "title_similarity": "0.75812215"
        },
        {
            "id": "h9gledj",
            "score": 1,
            "text": "They just built a weigh station in a place of where they removed tollbooths in favor of cashless rolling, so I was curious about this too.",
            "title_similarity": "0.7512412"
        },
        {
            "id": "ha3bl63",
            "score": 1,
            "text": "  I spent a lot of time on the road about 25 years ago. Maybe things are different now, because I didn’t see any comments with the information I have.   \n\n\nBack then, weigh stations were rarely open. But when one was, it was obvious for a mile beforehand because of the long line of trucks lined up waiting for it to close so they could continue on their way without being stopped.   \n\n\nWeigh stations did not only measure weight. There were, and hopefully still are, laws about how many hours a trucker could drive per day. It helped to have a partner but still I think they were only allowed by law to drive 8 hours each. However, when your employer, or the company for whose contract you were bidding, said to get a truck to its destination in a shorter time than was allowed by law, you did it or someone else got the job/contract.   \n\n\nThere were ways to fake your logs. I don’t know what they were.",
            "title_similarity": "0.82882285"
        },
        {
            "id": "hbh5tsf",
            "score": 1,
            "text": "Nijinim immumk.ijnk no h KK k ki mkn mm III mm JJ\n,,8d破風るさらするスラするスラマ真冬はフフラは、フルする？ラルサろサルサパブピポハラル補佐ブヘラルラフフすすをふさばフフ春？パプス？璃ホル破風？スフラるるぶラフらふ\n. Huh hi is ki ki ki in ki ki JJ MN k JJ j 　　ルベ瀬和はボブは祖父破風あさふわさふふさるはふらほフラフハフハフザブザブは)ルラ婦ふるふフル）流布さるるるるプラザラルは不ハセマすまさく？ふふはや、らほらぬはひ ki AS?! ki j. Ki ki nun JJ 🎤 l",
            "title_similarity": "0.2762508"
        }
    ]
}