{
    "eli5 Why does down syndrome cause an almost identical face structure no matter the parents genes?\nJust curious": [
        {
            "id": "hnmy1zq",
            "score": -10,
            "text": "It doesn't really. DS tends to cause facial features that are distinct in people with DS, meaning you can recognize someone as having DS. But if you look closely, people with DS look far more like their parents than they look like each other. They have something in common that causes you to notice, but that doesn't mean it is their most prominent feature.",
            "title_similarity": "0.7272588"
        },
        {
            "id": "hnnm0br",
            "score": 6,
            "text": "For the same reason people used to say that all Chinese people look the same.  If you don’t know very many Asians, the unique features common among Asians overwhelm the individual variation.  The same thing applies to Down’s syndrome.  They all share certain features as part of the Down’s syndrome genotype.",
            "title_similarity": "0.561401"
        },
        {
            "id": "hnno5kq",
            "score": -2,
            "text": "Down's syndrome people all look the same for the same reason that non Down's syndrome people all look different (actually the same.) It's just like looking at someone of a different race.",
            "title_similarity": "0.6136546"
        },
        {
            "id": "hnotqag",
            "score": -2,
            "text": "none of these answers left me satisfied and nobody answered the question that OP actually asked.  why do they have the bugged out eyes, the foreheads, the mouths.  the chins.  the cheeks.  why are THOSE all the same, no matter if they are black or white or asian, they all have that.. face.. what in the downs causes, that?\n\nthats what we want to know. its not a your not used to it or fish out of water thing.  they look the friggin same that its disrespectful when someone not downs plays one on tv.\n\nedit: nevermind one about 4 comment chains in finally takes off the kid gloves and shit",
            "title_similarity": "0.623293"
        },
        {
            "id": "hnmshxh",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnnolft",
            "score": 0,
            "text": "Chromosomes are the brickstones of development.  \nWhen an issue is with those it will cause things to not develop.  \nSo that’s why the faces look off the same way for every person with down syndrome, you can see the mutual development issue.  \nBut their faces are different from eachother",
            "title_similarity": "0.7046783"
        },
        {
            "id": "hnmn407",
            "score": 345,
            "text": "[deleted]",
            "title_similarity": "0.1686305"
        },
        {
            "id": "hnmz15r",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hno3jx6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnoyou1",
            "score": 2,
            "text": "I really think this is akin to the trope \"x race all looks alike.\"\n\nHumans are pretty terrible at differentiating the faces of races and in this case, the faces of people with disabilities, that they did not grow up with.  I bet if you grew up with a sibling who had down syndrome, you might have an easier time seeing the major differences between other down syndrome individuals, and wouldn't think they all look alike.\n\nSince you didn't grow up with someone who had down syndrome, you're not queued up to see the subtle differences, and just see the major picture.  Unlike people of your own ethnicity, you easily see the subtle difference, and automatically don't think they all look alike.",
            "title_similarity": "0.6875579"
        },
        {
            "id": "hnn4jgx",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnntzoo",
            "score": -1,
            "text": "There is an extra chromosome in their DNA.\n\nThat extra chromosome is dominant and overrides other DNA.\n\nIt is no different than why we have blue eyed or red haired people.",
            "title_similarity": "0.5570456"
        },
        {
            "id": "hno03ry",
            "score": 4,
            "text": "Does anyone know who the first person was to actually be classified with DS and/or the first professional who coined the term DS?\n\nWhy downs? Why not ups syndrome? Asking seriously.",
            "title_similarity": "0.59691465"
        },
        {
            "id": "hnp0eg4",
            "score": -2,
            "text": "On a side note of the given answer: This is the same as asking why do every Chinese or every African or Caucasian look the same. It’s an expression of the genes but the faces are as different as you know it from the majority of people surrounding you",
            "title_similarity": "0.5819806"
        },
        {
            "id": "hnnmohg",
            "score": 0,
            "text": "Most other trisomies are fatal and likely result in miscarriage. There are some other trisomies like 18 and 13 that are relatively common.",
            "title_similarity": "0.45453635"
        },
        {
            "id": "hnobhi7",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnpqlia",
            "score": 0,
            "text": "I've noticed that non-white children, especially black children, don't present with the typical facial features of Down Syndrome.",
            "title_similarity": "0.43141693"
        },
        {
            "id": "hno079k",
            "score": 10,
            "text": "FYI there are many genetic problems and people who have the same syndromes look similar, enough so that you can tell from looking. Down Syndrome is one of the more common ones we know.",
            "title_similarity": "0.5518352"
        },
        {
            "id": "hnoqhay",
            "score": 5,
            "text": "When young and seeing highlights of the special Olympics, I wondered aloud how one person could be so good at so many sports. My mom got a laugh out of that!",
            "title_similarity": "0.47783792"
        },
        {
            "id": "hnn16xy",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnn3gw9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnnz6vg",
            "score": -1,
            "text": "I want more explanation of DS feature similarities yet I’m stuck in a nacho cheese quagmire and am wanting nachos and cheese.\n\nBut. That’s nacho business. <get it>",
            "title_similarity": "0.45993292"
        },
        {
            "id": "hnow9gn",
            "score": 1,
            "text": "I'll bet if you lined up 100 photos of people with down syndrome faces, and 100 photos of non-down syndrom faces, their parents of children with downs would be able to pick out their child just as quick as the parents without!  \n\nThey look \"almost identical\" to us, because we're not used to seeing them every day.",
            "title_similarity": "0.6609749"
        },
        {
            "id": "hnmyd6p",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hno6b24",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnnfpgj",
            "score": 40,
            "text": "Can someone give me a different analogy than the gloved one?\nI thought we were the overly inflated gloved and those who suffer from down syndrome would have a less inflate glove. Since their features would be \"similar\", doesnt that make sense?",
            "title_similarity": "0.6249159"
        },
        {
            "id": "hnn0zyn",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnno2se",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnnyu1k",
            "score": 9,
            "text": "I have a close friend with DS. You can definitely see the resemblance to his parents if you look through the DS.",
            "title_similarity": "0.5033262"
        },
        {
            "id": "hnnjfr5",
            "score": 58,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnpbhbt",
            "score": 21,
            "text": "My brother has down syndrome and aside from some of the Down syndrome features, if you compare my mothers pictures as a baby and child to his, they’re practically twins. They do look like their parents, you just don’t see it.",
            "title_similarity": "0.75049925"
        },
        {
            "id": "hnnew05",
            "score": 171,
            "text": "Since we're here, can anyone explain why Chromosome 21 is particularly likely to show up 'with company'? I've heard of Trisomy 23 as a layperson, and both XYY and XXY, but that's about it.",
            "title_similarity": "0.63912755"
        },
        {
            "id": "hnoydf5",
            "score": 33,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnn6p9l",
            "score": 497,
            "text": "Ok, let me ask this please. I have a client that has facial features of DS but that's it. Talking with him on the phone I would never know. Even in person when I look at him I have to make special effort to realize that he is not challenged in any way. I think to myself that it must suck to make people realize he has no mental challenges. Am I missing something? Can you have the physical characteristics but but the mental characteristics?",
            "title_similarity": "0.6314291"
        },
        {
            "id": "hnmmps3",
            "score": 5492,
            "text": "You're assembling tables but each kit comes with one and a half set of certain parts. Instead of 4 legs, you get 6 along with all the mounting hardware. With your boss breathing behind your back, you can't exactly throw away the excess parts.\n\nMost assemblers, when given the extra material will end up putting the extra legs in the middle of the table on opposite sides. The appearance of the tables is different from intended but consistent among all the tables with 6 legs.\n\nThis is how Down's syndrome causes similar physical appearances. Humans typically have 2 of each chromosome, one per parent. People with Down's syndrome have an extra 3rd 21st chromosome. This causes their cells to express those genes 1.5 times the normal amount. The genes written on that chromosome have many effects on the body and having more of them will affect the body in similar ways among people with Down's Syndrome.\n\nThe 1.5x production of genes on chromosome 21 causes similar physical appearances among people with Down's syndrome.",
            "title_similarity": "0.5585067"
        },
        {
            "id": "hnmm2a2",
            "score": 23609,
            "text": "Have you ever inflated a rubber glove? With just a little air the glove looks like a hand, but the more air you add, the more it distorts as the palm fills but the fingers don't.\n\nDown syndrome happens when a person has an extra chromosome. Everyone has two of every chromosome, which means two copies of every gene. Someone with down syndrome has three copies of a small set of genes; the third copy is on that extra chromosome. As a result, those genes get expressed too much, resulting in the familiar features that seem to hide or overshadow the features that would make them more \"normal\". We all have these features, but in most of us they're toned way down. Their gloves have more air in them than ours.\n\nEdit: Many of you have correctly pointed out that DS people do not \"all look the same\". They have similar features explained by genetics, yes, but so do various ethnicities. Unfamiliarity can make it difficult for an \"outsider\" to tell the differences between individuals, but those differences are not only there, they are as stark as the differences between two random French people, or two random Han people.",
            "title_similarity": "0.62302846"
        },
        {
            "id": "hnmyh12",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnn51sv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13283761"
        },
        {
            "id": "hnnycoa",
            "score": 1,
            "text": "How early can you detect DS?",
            "title_similarity": "0.3182863"
        },
        {
            "id": "hno2kba",
            "score": 1,
            "text": "Jumping on the back of this... What are the characteristics that look similar in them? \n\nI've read the replies here but I still don't understand what it is about them that look similar, is it a larger distance between eyes, rounder faces, larger forehead, or what? \n\nI hope this doesn't come across as offensive, I don't intend it to be... But, there is a \"look\" that is common among people with DS, but I can't put my finger on what that is exactly.",
            "title_similarity": "0.60013497"
        },
        {
            "id": "hnoe9eb",
            "score": 1,
            "text": "Why do other trisomy not look like downs (trisomy 21) and not really look the same as the same trisomy like downs does.",
            "title_similarity": "0.6254815"
        },
        {
            "id": "hnonfg3",
            "score": 1,
            "text": "so why is our/my brain so bad at distinguishing faces? i cant tell apart DS faces. I had believed our brain was pro at facial recognition",
            "title_similarity": "0.6183131"
        },
        {
            "id": "hnotbkn",
            "score": 1,
            "text": "Because it’s a chromosomal difference. Your parents genes make up your chromosome. But if Down syndrome you have an extra chromosome.",
            "title_similarity": "0.70681834"
        },
        {
            "id": "hnow9vt",
            "score": 3,
            "text": "Let me just preface this by saying that it doesn't cause an \"almost identical\" face structure.\n\nHowever, the extra chromosome causes the same divergence in all people with DS. That's because certain genes have been duplicated so they are expressed more and features caused by those genes are amplified.\n\nBut are people with DS more similar to each other than people without it are? That's hard to say actually. Humans' facial structure, regardless of whether they have DS, is more similar than you would think, we are just evolved to be able to pick up on slight differences because we are social animals.\n\nBut because the difference in certain facial features between people with and without DS is bigger than the difference between two people who don't have it, your brain automatically registers them as their most defining feature.",
            "title_similarity": "0.6551663"
        },
        {
            "id": "hnpgy2i",
            "score": 1,
            "text": "Side question, so that affects the brain and heart the same way?",
            "title_similarity": "0.4896508"
        },
        {
            "id": "hnqc8vr",
            "score": 1,
            "text": "Because we are all one species no matter our cosmetic appearance there are no actual difference in race we are all homo Sapiens",
            "title_similarity": "0.5439924"
        },
        {
            "id": "hnqjjdo",
            "score": 1,
            "text": "It's a great question and I understand where it comes from.\n\nThere are a number of physical traits associated with downs.\n\nRounded eyes, tapered ears, single crease in the palm. A  propensity for large glasses (lol)\n\nBut I would challenge you to find the family traits too. They are most certainly there.\n\nMy nephew (who has downs, now in his 20s) has very strong family traits. He is obviously my brothers son, and obviously my dad's grandson. He's a good looking guy (in my opinion), strong, and will chat faster on Xbox than anyone I've seen.",
            "title_similarity": "0.5694802"
        },
        {
            "id": "hnr1tkf",
            "score": 1,
            "text": "This is somewhat unrelated, but it just reminded me of a time in college, the professor put up a picture of a palm from a person with downs syndrome, to show that the line on there hand goes straight across, and everyone else's usually has diagonal lines..... Everyone in the class looked at their hands afterwards, lol.",
            "title_similarity": "0.57369435"
        },
        {
            "id": "hnrtlri",
            "score": 1,
            "text": "Top comment from the post 9y ago asking same question:\n\nChromosomes are funny blob-shaped things that are too small for us to see and they contain all your genes. Genes are basically sets of instructions that tell your body how to grow and work properly. Every normal person has 23 pairs of chromosomes. Each pair should normally be a matching copy (excepting X and Y chromosomes - i'll explain this later).\n\nWhen a mommy and daddy have had sex and create a baby inside the mommy's womb, sometimes a mistake happens. It is nobody's fault, but the new baby has 3 copies of chromosome number 21 instead of just 2 copies like a normal person would.\n\nThis means the new baby's body gets the wrong instructions on how to grow, and so it grows into a funny shape. The genes that tell a person's face what shape it will be are messed up and that's why most people with Down Syndrome have strange looking faces. The extra chromosome also makes the Down Syndrome person's brain grow funny, which is why Down Syndrome people are usually not as smart as other people.\n\nNow you might be wondering why boys and girls are different if everyone has the same 23 pairs of chromosomes. The answer is that everyone doesn't. Girls have two \"X\" chromosomes (they are called that because they look like the letter X). But boys are different - instead of having two X chromosomes, they have an X and a Y chromosome. It is this Y chromosome that contains all the instructions to tell their body how to become a boy's body.\n\nThere are many other problems that can happen if something is wrong with a person's chromosomes, Down Syndrome is only one.\n\nEdit: So the reason that Down Syndrome people's faces all have those similar features is because they all have the same problem with their genes - an extra copy of chromosome 21.",
            "title_similarity": "0.6594136"
        },
        {
            "id": "hnvmrqg",
            "score": 1,
            "text": "I was 8 months  pregnant  and was told my daughter  was probably  have down syndrome.  The Dr was very cold and also told, sorry, now is too late for somenthing  to be done. I would  never have thought  of not having  her. But now I had only  a few weeks to prepare  emotionally  and financially  for a special  need baby, And they only thought  that because  they found out she was going  to have a kidney problem \" reflux grade 4\", and most of the kids that had also were special  need kids,  so I was sent to see a ge e-ticket, that wanted  me to do some tests  to verify  and I refused. I said, I love her already, and I will accept  exactly  how she is. When she was born  they had doctors  Unit  waiting  in case she needed  any special  treatment.   She indeed  was born  with kidney  problems,  however  no down syndrome.  I took my daughter  home, and took me 2 days to finally  be able  to choose  her a name  due to the stress of the  rest of my pregnancy. Today I look  to my beautiful,  smart  and talented  daughter,  that is graduating  high school  this year, and is having  a free ride to  college getting her master and than getting  I to med school  in 2 years and I think  how many  kids were not able  to had the change  to come to this world  because  some doctors  one day told their mom, same thing that I told one day and  they were scared of trying. \n\nFor all the special  need kids out there my heart goes to you and to your parents💗",
            "title_similarity": "0.55581343"
        },
        {
            "id": "hnx1iv7",
            "score": 1,
            "text": " N \n\n\nM  no.  We see ew we  we E have b kbvrrrreddedddddddddtddd vjvdotdo  every time we get get there lol lol I’m I’m sorry sorry buddy I’m not going home yet yet I’m just going going home home now I just just woke my phone and I’m going home lol lol I don’t don’t know how long it was going lol I was like yeah yeah that’s cool yeah dude yeah bro yeah yeah bro bro that’s why why don’t do me yeah dude that’s that’s what I’m I’m going on on my own yeah dude yeah bro I love love it all I know know it’s funny funny I I don’t don’t want anything to say I don’t want you too damn funny lol I don’t don’t think you know know I don’t want you too bro bro that’s why I’m going home and I’m not working anymore anymore anymore I’m just going home home I love love it all I know it’s it’s all day love love it all I hope you have it done and I’m I’m sorry for that that but you know what I’m thinking I I ryyryyryyrryryyrrryrryrrrrrryrytyyrrryryyryyryryyryyyryryyryyyyyyyyyyyyyyyyyyyyyyyrryyrrrryyryyyyyyyyyyySr\nMkhc is going eto",
            "title_similarity": "0.49552"
        },
        {
            "id": "hoynwnu",
            "score": 1,
            "text": "Why do you think they look the same?",
            "title_similarity": "0.47927207"
        },
        {
            "id": "hp9mkel",
            "score": 1,
            "text": "My momma \nAhead of her time \nTaught me that souls develop into angels once they've earned their wings\nDeveloped over their many lessons and visits to this world \nAlso, that brand spankin' new souls (downs babies) are only blessed to 2 very old souls\n(just before they get these wings)\nLove",
            "title_similarity": "0.51941264"
        }
    ]
}