{
    "ELI5- What is gaslighting?\nI have heard a wide variety of definitions of what it is but I truly don't understand, psychologically, what it means.\n\nEDIT: I'm amazed by how many great responses there are here. It's some really great conversations about all different types of examples and I'm going to continue to read through them all. Thank you for this discussion reddit folks.": [
        {
            "id": "hp7phjj",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7k6k0",
            "score": -6,
            "text": "A friend was supposed to pick me up once at a round about and I had been there ahead of time and waiting. He arrived 45 minutes late and then tried to claim he had been there and driven by 5 times and I hadn't been there or hadn't seen him. \n\nThat is gaslighting (Edit to add this in because some people missed the point) **because he was trying to make me doubt myself**.\n\nIt was ridiculous because there was no way he could have driven by without me seeing him and if he had actually been there and I had not he would have waited at our designated meeting point.\n\nEdit: \n\nSome people are disagreeing that this was gaslighting on the basis that it did not occur over an extended period of time and thus merely constituted a lie and another person has taken it so far to declare that I \"just got bored with the word lying and wanna play like you're the victim of abuse.\"\n\nHere are the definitions of gaslighting from the Oxford, Merriam Webster and Cambridge Dictionaries and the American Psychological Association for those who care to know.\n\n**Oxford**\n*gas·light\n/ˈɡaslīt/\nverb\ngerund or present participle: gaslighting\nmanipulate (someone) by psychological means into questioning their own sanity.*\n\n**Merriam Webster**\n\n*psychological manipulation of a person usually over an extended period of time that causes the victim to question the validity of their own thoughts, perception of reality, or memories and typically leads to confusion, loss of confidence and self-esteem, uncertainty of one's emotional or mental stability, and a dependency on the perpetrator*\n\n**Cambridge**\n\n*gaslight\nverb [ I or T ]\nUS  /ˈɡæs.laɪt/ UK  /ˈɡæs.laɪt/\npast tense and past participle gaslighted\n \nto trick or control someone by making them believe that their memories or beliefs about something are wrong*\n\n**APA**\ngaslight\n*vb. to manipulate another person into doubting his or her perceptions, experiences, or understanding of events. The term once referred to manipulation so extreme as to induce mental illness or to justify commitment of the gaslighted person to a psychiatric institution but is now used more generally. It is usually considered a colloquialism, though occasionally it is seen in clinical literature, referring, for example, to the manipulative tactics associated with antisocial personality disorder. —gaslighted adj. [from Gaslight, a 1938 stage play and two later film adaptations (1940, 1944) in which a wife is nearly driven to insanity by the deceptions of her husband]*\n\nAs you can see, gaslighting is an effort to **make the victim question themselves.** That is what my friend in this example was doing.\n\nWhile the Merriam Webster definition states that it is *\"usually over an extended period of time\"* it does not *need* to be, and time is not mentioned at all in the Oxford, Cambridge or APA definition. \n\nGaslighting differs from a simple lie because a simple lie need not have the element of *making the person being lied to question and doubt themselves and their experiences.*",
            "title_similarity": "0.49427482"
        },
        {
            "id": "hp7y05z",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7j3lm",
            "score": 6,
            "text": "“We know they’re lying, they know they’re lying, they know that we know they’re lying, we also know that they know that we know they’re lying, but they STILL LIE.” \n\nThey are gaslighting us.\n\nIt is effective because eventually you may start doubting yourself. Then you start believing their word over your own experience.",
            "title_similarity": "0.51274675"
        },
        {
            "id": "hp7qfvc",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7tt1o",
            "score": -1,
            "text": "I'll add to all the others commenters explanation of it and just say that, gaslighting happens quite frequently and unintentionally. That is probably why it has been brought up so much in 'calling people out'.\n\nGaslighting can happen alot in arguments to try and invalidate someone even if they do not mean it with malicious or manipulative intent.\n\nIt's good to understand what gaslighting is and whether the person is actually trying to gaslight you to ensure misunderstanding and false accusations don't occur. \n\n'Falsely' accusing someone of being a gaslighter to make them rethink and question things is ironic and a double whammy of manipulation.",
            "title_similarity": "0.681312"
        },
        {
            "id": "hp7sfrt",
            "score": 0,
            "text": "It's like manipulation but using physical surroundings to persuade the victim what's being said is true.",
            "title_similarity": "0.43278265"
        },
        {
            "id": "hp8jpug",
            "score": 0,
            "text": "Gaslighting doesn’t exist. It’s never existed. You’re just being paranoid. There’s no reason to believe that gaslighting is real, it’s something you made up in your head because you can’t deal with the fact you’re depressed and messed up and kinda dumb. \n\nAaaand scene. \n\nThat’s what gaslighting is.",
            "title_similarity": "0.33768386"
        },
        {
            "id": "hp8w22y",
            "score": 0,
            "text": "You already know what gaslighting is, we already had this conversation.\n\n(Obviously we've never had this conversation but I'm acting so confident and persistent that you start to second guess yourself.  That's gaslighting.)",
            "title_similarity": "0.6171628"
        },
        {
            "id": "hp9ris7",
            "score": 0,
            "text": "A person does something mean to you than pretends that you're the one who did something mean to them instead",
            "title_similarity": "0.2017794"
        },
        {
            "id": "hp7ilsx",
            "score": 35,
            "text": "A form of manipulation where someone is lead to doubt their own actions, opinions, memories, feelings, or even objective facts. Gaslighters not only try to convince their victim that they're irrational or wrong, but they also sometimes try to convince their victim that the victim is the abusive one.\n\nIf a spouse is cheating and wants to convince their partner that they're not cheating, they may gaslight them by saying things such as, \"What? I was just visiting a friend. Cheating? You're just making things up, blowing things out of proportion. Don't be so jealous, you're being possessive and abusive by not letting me see my friends.\"",
            "title_similarity": "0.4803322"
        },
        {
            "id": "hp7rfjw",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp7mfaa",
            "score": 30,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp86sry",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp82f56",
            "score": -4,
            "text": "Since top comment wrote an essay\n\nAnd 5 year olds don't like reading\n\n\nTldr: gaslighting = trying to make someone sound crazy by attacking *them* and their credibility, rather than the argument they're making",
            "title_similarity": "0.47749656"
        },
        {
            "id": "hp7ppob",
            "score": 15,
            "text": "Did you watch Star Trek: the Next Generation? There was a two part episode called \"Chain of Command\". \n\n**Spoilers** In that episode, Picard is captured by some Cardassians.  Cardassians are notorious for torturing prisoners, and this episode lays the groundwork for that character trait going forward. \n\nAs part of the torture, Gul Madred turns on a series of four lights behind him and asks Picard the simple question, \"How many lights do you see?\". Picard would always answer \"four\", but Gul Madred would always tell Picard that he was wrong, and there were in fact **five** lights. And then he'd do torture things.  He did this over and over, even promising food, water, clothes, respite if Picard would only give him the correct answer of **five**. \n\nGul Madred was attempting to gaslight Picard by having him say \"five\" lights. The implication was, that if Gul Madred could make Picard question his reality, then he could plant his own reality in Picard and essentially flip him to a double agent/spy/intelligence asset. \n\nThere is a lot in that episode that mirrors today's reality. It's very chilling to watch today. I recommend it to everyone when the topic of gaslighting comes up.",
            "title_similarity": "0.51602495"
        },
        {
            "id": "hp7kfuc",
            "score": -3,
            "text": "Gaslighting is intricate misdirection or over emphasis from fact or fiction/over inflation of fact to dilute the self of the individual within a group or sub group or entire grouping of individuals for complacency within something that is not acceptable for that person(s) or incorrect all together.",
            "title_similarity": "0.43372664"
        },
        {
            "id": "hp7uidd",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp8a67t",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7fuyi",
            "score": 68,
            "text": "It is a manipulation technique designed to distort reality, often used to convince people that their feelings or opinions are invalid. \nFor example, if someone constantly tells their partner something like 'nobody else would react like this', when they are reacting entirely reasonably.",
            "title_similarity": "0.42751616"
        },
        {
            "id": "hp7m9tw",
            "score": 0,
            "text": "It’s [insert definition here]\nCos why would a Redditor ever lie to you?\n\nReplace “Redditor” with other words, like ‘I’ or ‘mother’ or ‘brother’ and this seems to become a valid argument that someone is telling the truth.\nThey are taking advantage of your trust in them when they do this.\nThat is at least what I think gaslighting is. But I don’t know if it is correct. Cheers.",
            "title_similarity": "0.605282"
        },
        {
            "id": "hp85978",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp8adi2",
            "score": 40,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7mr76",
            "score": 9,
            "text": "A women in the movie \"Gaslight\" insists that she sees the lights in the house fluctuate but her manipulative husband convinces her she's crazy.\n\nSpoiler alert: she wasn't crazy.",
            "title_similarity": "0.49903935"
        },
        {
            "id": "hp7rakg",
            "score": -4,
            "text": "It’s a common tactic of the narcissist. Narcs refuse to accept that they’ve made a mistake so they’ll blame everyone and everything else.\n\nEg my ex didn’t come home one weeknight until about 1am and when I confronted him at the door in tears from worry, he convinced me that I was just being crazy and I was at fault for starting an argument over nothing. \n\nWhen these people cause harm to their partners or family they convince the victim that it’s their own fault for making them angry. “Look what you made me do” is a common excuse for violence.",
            "title_similarity": "0.4606209"
        },
        {
            "id": "hp7slw3",
            "score": -5,
            "text": "The most public gaslighting campaign I can think of, Planet Fitness. Come to Planet Fitness.  We don't judge you here.  Not like out there.  We are nice and friendly here.  Not mean and judgemental like it is out there.  You want to waste your time walking on a treadmill for 30 minutes, acting like your doing a real workout, we support that.  We don't let big, mean people who judge and intimidate you in here.  Just come here.  We have pizza on Friday.  You like pizza don't you?  Just join us.  No one will stare at you.  You don't want to get stared at and laughed at, like at those other places.  Join us.  You can be fat and out of shape and we won't laugh at you.  They will laugh at you.  We have an alarm here to keep those bad people out.  Join us....\n\nThat's gaslighting perfection.",
            "title_similarity": "0.4617615"
        },
        {
            "id": "hp7tyfr",
            "score": -4,
            "text": "I's the american version of \"you are a naive fuck\", where you blame the more clever person for your inability to defend yourself in a conversation.",
            "title_similarity": "0.42806578"
        },
        {
            "id": "hp7fz3m",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.020581147"
        },
        {
            "id": "hp81q4i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp84507",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp84ixy",
            "score": 1,
            "text": "It's trying to trick someone into thinking their crazy by pretending something is different from the way it really is.\n\nIt's from an old movie where a guy tries to make his wife think she's going crazy by messing with the lights but acting like it's normal.",
            "title_similarity": "0.4055336"
        },
        {
            "id": "hp8w3om",
            "score": -1,
            "text": "I want to be mean to you but I don't want you to know I'm a mean person. So I'll tell you what I'm doing is not really mean, you're just sensitive.",
            "title_similarity": "0.383457"
        },
        {
            "id": "hp8wvy1",
            "score": -1,
            "text": "\"Gaslighting\" is what self-absorbed people call disagreement. Specifically, when someone disagrees with their version of past events. \n\nIt is actually very common for people to remember the same events differently. Some of this is because we are each sensitive to different things, and so we notice and remember things that others don't. We also constantly revise our memories to be consonant with how we feel today, and to cast ourselves in the role of hero in our own story. \n\nPeople who are ignorant of these facts often believe that memory is like a video recording: a perfect representation of past events. From that false premise, it follows that:\n\n- Your memory of a given event is true and accurate, and\n- It's not possible for someone else to have a different recollection of the same event in good faith, and (if you're especially vain) \n- Anyone disagreeing with your version of events is not merely mistaken, but trying to manipulate you. They _know_ they're doing it, because if they were honest, they would agree with you and your one-true-version of the event(s) in question. \n\nThat's quite a combination of conceit, ignorance, and self-absorption.\n\nIf you're contemplating a relationship with someone who uses the word \"gaslighting\" unironically when you disagree about something, _run_.",
            "title_similarity": "0.6925211"
        },
        {
            "id": "hp8x1n4",
            "score": -1,
            "text": "Lighting that uses Propane or Natural gas. Such as a Coleman lantern that uses the small Propane  bottles. That is gas lighting.",
            "title_similarity": "0.20973009"
        },
        {
            "id": "hp8y3d7",
            "score": -1,
            "text": "There are many definitions nowadays so it means different things to different people. Most people when they someone gaslit them what they just mean is they think they were being psychologically manipulative.",
            "title_similarity": "0.6009799"
        },
        {
            "id": "hp8yity",
            "score": -1,
            "text": "I always thought gas lighting was getting charged something for nothing...you know, like Atlanta Gas Light charges you $40/mo to be hooked up to their gas lines which you have no control over and even if you dont use it...",
            "title_similarity": "0.47628617"
        },
        {
            "id": "hp9d5jk",
            "score": -1,
            "text": "It’s kinda like being told you need to wear a life jacket at all times even though there’s no body of water nearby and you’re an adult that’s perfectly capable of swimming if wanted to go near water. Then, because someone else who never learned to swim drowned one time, you’re told you need to put a second life jacket on.",
            "title_similarity": "0.33495986"
        },
        {
            "id": "hp9hghv",
            "score": -1,
            "text": "It’s like when some people want to defund the police and then a particular politician convinces those people that a different group of people were the ones who were trying to defund the police",
            "title_similarity": "0.31395352"
        },
        {
            "id": "hpakl76",
            "score": -1,
            "text": "How do I gaslight my gf? Tips pls",
            "title_similarity": "0.3607925"
        },
        {
            "id": "hpbfhib",
            "score": -1,
            "text": "Thanks for asking cause I certainly tried to figure this out and failed. \n\nWorst thing is....my ex prob thinks I'm gas lighting her...when really she was plain NUTS. Couldn't get her back down to earth and ended it. But she always used the term gas lighting. And I was like....mhmm....",
            "title_similarity": "0.5799091"
        },
        {
            "id": "hp804z5",
            "score": 6,
            "text": "1. Distort reality (make person doubt own mind)\n2. Segment information (not talk publicly only in small groups) \n3. Refusal to apologize\n\nIf you’ve got all 3, it’s prolly gaslighting. You combat it by making things public, talking in groups, which allows others to verify reality and break #1.",
            "title_similarity": "0.44261032"
        },
        {
            "id": "hp8k61w",
            "score": 40,
            "text": "Gaslighting isn't considered, generally, to be an \"official\" term in the field of psychology or psychiatry - its a colloquial term.\n\nA lot of people misuse it or are bad at identifying it, but generally it's used to describe when person 1 (intentionally or unintentionally) presents a false narrative to person 2 that leads person 2 to doubt their perception of reality in some way.\n\nHowever, there are a lot of situations in which people have warped views of reality, so a lot of people will use that term when they feel a view of theirs is being challenged. It is extremely overused and often incorrectly, which has honestly almost made the term useless. I personally find a lot of these terms that have popped up pretty useless because people don't understand them and use them as crutches without properly understanding them. It makes discourse much harder when people hide behind these words and refuse to engage",
            "title_similarity": "0.5444166"
        },
        {
            "id": "hp7tolv",
            "score": 2,
            "text": "The word definition is what everyone else has said, in internet dialect it means lying, misremembering, misunderstanding - generally sharing misinformation with or without ill intent.",
            "title_similarity": "0.55959255"
        },
        {
            "id": "hp7tov5",
            "score": 2,
            "text": "It was a (quite good, not long, b&w) film, in which a Victorian husband, not being able to divorce his wife then, decides to get free by getting her certified mad and sent to an institution. He does it by convincing her she's mad eg making noises in the night and saying \"I didn't hear anything, you're mad!\" Nowadays its best use is denying a reality you didn't notice/care about: \"He wasn't being racist, he was just joking\" and it's worst is like \"passive-aggressive\" or \"poisonous\", just a modern insult. It's never used to mean \"drive you mad or convince you you are by denying your reality\", which would be a great meaning.",
            "title_similarity": "0.45776644"
        },
        {
            "id": "hp8c2ln",
            "score": -2,
            "text": "In short it means manipulating someone into thinking they’re going mad. \n\nWhen a conservative uses it it’s normally because you’ve shown them a fact that contradicts their worldview.",
            "title_similarity": "0.3878106"
        },
        {
            "id": "hp8ns6l",
            "score": -2,
            "text": "Trump’s insistence that he had “a bigger inauguration crowd than Obama, maybe the biggest ever” was maybe the most blatant example of political gaslighting in recent memory. Instead of getting you to doubt your *own* perception, Trump’s goal was to get you to doubt the media. There were clear photos that showed he was lying - but that didn’t matter, because they could have been doctored, or they were from the wrong angle, whatever it was, it was the medias fault. Trust *him*, don’t believe anyone else, even your own eyes. \n\nGaslighting is all about an abuser getting you to believe that their distorted reality is the accurate one, and that if you ever disagree, it’s because there’s something wrong with you. This way they can get away with further abuse, and create a sense of dependence on the abuser.",
            "title_similarity": "0.52768993"
        },
        {
            "id": "hp8ns8v",
            "score": -2,
            "text": "It is a form of gang stocking. It's a form of torture people use or groups of societies to mess up ones life,because you exposed there wrong doings",
            "title_similarity": "0.3309564"
        },
        {
            "id": "hp8oqa3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp8xqsu",
            "score": -2,
            "text": "Gaslighting is very broad and sometimes is very complicated. The simplest example I can think of is someone who is rude and aggressive towards you then when you get upset by it says you're overly sensitive. This is not always intentional but very common, especially where undue criticism is placed on work or delivered poorly and with consequence.  \n\n\nOf course it can become more complex than this and intentional, creating a narrative and then shaping it to make you feel like you doubt everything. I had a boss that would pit workers against each other with false he said / she said things then deny they were ever said.",
            "title_similarity": "0.5827887"
        },
        {
            "id": "hp9eznx",
            "score": 3,
            "text": "Gaslighting is one of the most misused terms in recent years. People like to call everything gaslighting these days.",
            "title_similarity": "0.5764202"
        },
        {
            "id": "hp8s2s1",
            "score": 74,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7u01m",
            "score": 519,
            "text": "Gaslighting is reddit's favorite term to use wrong. Basically any time anybody lies about something reddit thinks it's \"gaslighting\". I dunno why, maybe people think it makes them sound smart.\n\nWhat gaslighting *really* is is making somebody doubt their perception of reality. This is more than just lying to someone.\n\nThe best example is the 1944 film from which the term gets its name, *Gaslight*, in which a husband tricks his wife into thinking she's crazy so that he can steal from her.",
            "title_similarity": "0.5038064"
        },
        {
            "id": "hp7m3zc",
            "score": 172,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp7r2kr",
            "score": 70,
            "text": "There's an old movie called \"Gaslight.\" This woman has a house with a treasure hidden somewhere in it. This handsome guy shows up and starts dating her, and weird things start happening in the house. Things move around, she hears creaking, and he keeps convincing her that it's her imagination.\n\nOne of the things that's happening is the gaslights in the living room dim, almost to darkness. The guy tells her it's in her mind, and it's perfectly bright. \n\nThe reason the lights were dimmed is because the guy was turning on the lamps in the attic where he was searching for the treasure.\n\nGaslighting is whenever someone is trying to convince you that you're crazy to cover up their own actions.",
            "title_similarity": "0.48784375"
        },
        {
            "id": "hp7oivg",
            "score": 390,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp8ytd4",
            "score": 11,
            "text": "What? Gaslighting dosent exist. Why are you making up words? That sounds so silly.",
            "title_similarity": "0.46822464"
        },
        {
            "id": "hp7tplr",
            "score": 48,
            "text": "Deliberately making people question their own judgements, actions and memory of what has been said, discussed and agreed. Slowly you begin to doubt your own sanity.",
            "title_similarity": "0.44842458"
        },
        {
            "id": "hp7ntug",
            "score": 54,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp850a5",
            "score": 254,
            "text": "It's a common misused phrase. Disagreeing is not gaslighting, having a different perspective is not gaslighting. Correcting someone by telling them what was actually happening is not gaslighting. \n\nGaslighting is a abusive manipulation tactic used to manipulate someone and have them question their sanity. This is why people have confessed to crimes they didn't commit or why people wrongly believe they had done something wrong and are confused about it.",
            "title_similarity": "0.42102453"
        },
        {
            "id": "hp7gism",
            "score": 704,
            "text": "The origin of the term is a play from the early 20th century called gaslight, where a man convinces his wife she’s going mad so she doesn’t trust the evidence he’s a murderer. It is a form of emotional abuse where you try to convince someone they are insane, delusional, or similar.",
            "title_similarity": "0.4312787"
        },
        {
            "id": "hp7qh42",
            "score": 110,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7hiel",
            "score": 14015,
            "text": "I've told you over and over what gaslighting is.  Why don't you ever pay attention when I tell you things?  We've had this discussion at least a dozen times; you really should know what it is by now.  I go through all this effort to explain it to you, and you can't even try to remember?  Look, the last time I explained what gaslighting is, you *promised* that you'd remember, right?  Remember?  What are you talking about?  Of course you promised.  It was when we were at that place that one time, remember?  You remember, right?  Good.  Well, don't make me explain it again!\n\nThat's what gaslighting is:  making someone doubt reality.",
            "title_similarity": "0.61048466"
        },
        {
            "id": "hp7jgh7",
            "score": 21012,
            "text": "Gaslighting is a type of manipulation in which someone leads the victim not only to believe something, but to distrust their own knowledge, memory, perception, or judgment.\n\n\"Gaslighting\" gets its name from a play called \"Gaslight\" in which a man convinces his wife she is crazy. One thing he does is to raise and lower the gaslights in their house, and when she asks about it, he insists everything looks normal and she must be hallucinating.  Gaslighting is all about the effect, not the lie itself- is not really about the lights, its about making her believe she can't trust her own eyes. By making her doubt her own sanity, she's more likely to rely on him for judgments, and to do the things he says. \\[Edit- some of my details from the play were wrong but the point is the same\\] \n\nIt is often cumulative, meaning the abuser uses a lot of small, unimportant things to make their victim doubt themself. For example, an abuser who wants their victim to distrust their own memory might ask their victim to get them a coke, then when their victim does, they insist they asked for a sprite, and express worry about the person's poor memory. This itself is a small thing, but if they do it enough the victim may begin to genuinely believe they have a memory problem, and when the abuser says something like \"you don't remember giving me that $1,000? We talked about it last night,\" or \"You think I hit you? I'd never do that- you walked into the door, you must be remembering wrong,\" they are more likely to believe them.\n\nGaslighting can be a form of abuse with an obvious purpose- like getting away with stealing money from a victim, or just to make a victim rely on their abuser for judgments, which gives the abuser power and control.",
            "title_similarity": "0.4473325"
        },
        {
            "id": "hp7pynx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7u2fg",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp7uzcs",
            "score": 1,
            "text": "Mom hides dad's car keys then tells dad he's always misplacing them and forgetful. \n\nPerson A does something with the desire to make person B question themselves and their actions. It's generally used to belittle person B or make them more reliant on person A.",
            "title_similarity": "0.41569895"
        },
        {
            "id": "hp7vsxw",
            "score": 1,
            "text": "gaslighting- forcing others to believe or act as though they believe a lie through subtle, verbal, emotional, and physical manipulation and even abusive verbal, emotional, physical punishment, and violence. \n\nYou okay know when you call someone out and they pretend they didn’t hear you? Or they act like they don’t remember what you’re talking about. Remember stealing a little bit of liquor from your parents and using water to make the bottle look just as full again? Or it could be as serious as forging someone’s signature on a last will and testament. The thing is that gaslighting doesn’t stop with these kind of infractions. It encompasses their entire identity and any little moment can be a call to verbal arms in order to push the narrative. Every moment every day for everything they’re insecure about until you think you’re crazy. \n\nhttps://www.northpointrecovery.com/blog/gaslighting-examples-effects-confront-abuse/\n\nE.g. “Anytime I stood up for myself he would say that he wouldn’t yell at me or call me names if I didn’t act so stupid, or if I didn’t behave a certain way. He would even say that my actions had consequences and reactions. Constantly made me feel like a child that was being punished.”",
            "title_similarity": "0.4245336"
        },
        {
            "id": "hp7w99m",
            "score": 1,
            "text": "it makes you question your reality . what its not is a simple disagreement.  i hear it get used a lot for that. just because someone doesnt agree with it isnt gaslighting .",
            "title_similarity": "0.5663533"
        },
        {
            "id": "hp7xroo",
            "score": 1,
            "text": "So this thread has a lot of very good definitions of gaslighting. I have to warn you tho, that a great deal of the time when the term is used, it is used to mean something very different. Often people use it to refer to a situation in which someone else (Person B) disagrees with them (Person A) on a subject that they consider to be obvious to everyone, and so Person A thinks that since their opinion is basic reality, any attempt to disagree with it must be gaslighting.   \n\n\nHowever, this is pretty rarely the case. Most situations I've seen the term used, Person B just disagreed with Person A. Sometimes Person B was in denial, sometimes it was really obvious, and sometimes Person B was being incredibly self-serving. But that doesn't make it gaslighting. Gaslighting is a conscious and deliberate attempt to make another person disbelieve their own mind, and that's pretty rare. It happens, but it's far more common that Person B is just being subconsciously self-serving.   \n\n\nI think we need to be able to talk about legitimate gaslighting when it occurs, and I think we also need to be able to talk about other instances where people are being self-serving but not consciously gaslighting, and I think we need to recognize that these differences are quite significant. Someone who is being subconsciously selfish is perhaps not a lost cause, and might even wish you well, but someone who is consciously manipulative is unlikely to ever stop that kind of behaviour, and certainly does not wish you well in any relevant way, nor do they have (in my opinion) the proper respect for humanity that is necessary for them to live a good life and benefit society.  \n\n\nOf course, sometimes the person who accuses someone else of gaslighting might themself be gaslighting. It's a messy pit to wade into. Don't use the term lightly, and don't believe it lightly when others use it.",
            "title_similarity": "0.6993569"
        },
        {
            "id": "hp7ypny",
            "score": 1,
            "text": "Imagine you are a 5yo kid and go on a fair with your family and get a green ballon that you liked so much. 10 years later, you remember that moment, but your mom says\"it wasnt green, it was a red balloon, dont you remember \". Basically, changing the way you remember stuff.",
            "title_similarity": "0.44706026"
        },
        {
            "id": "hp7zb1d",
            "score": 1,
            "text": "It's a movie title which was so effective in explaining how to deceive someone into thinking they're crazy... it's also now a verb.  [https://en.wikipedia.org/wiki/Gaslight\\_(1944\\_film)](https://en.wikipedia.org/wiki/Gaslight_(1944_film))",
            "title_similarity": "0.56650555"
        },
        {
            "id": "hp80q72",
            "score": 1,
            "text": "It's when you manipulate people's emotions by keeping them in enclosed spaces, only telling them what you want them to hear, etc etc. The person might end up morally dependent on you, and it will become supeemely difficult for them to break free. Someone else prob explained it better",
            "title_similarity": "0.3756429"
        },
        {
            "id": "hp80tut",
            "score": 1,
            "text": "This joke from tiktok helped me understand it\n\nPerson 1: Did you hear the joke about gaslighting?\n\nPerson 2: No\n\nPerson 1: Yes you did",
            "title_similarity": "0.5311922"
        },
        {
            "id": "hp81k15",
            "score": 1,
            "text": "Bud we already talked about what gaslighting is. Had a huge conversation about it just the other day. Don't you remember? That's concerning if you don't, not the first time that whole conversations have just suddenly not happened.  \n\n/s but that's an example of gaslighting",
            "title_similarity": "0.6509873"
        },
        {
            "id": "hp81ki5",
            "score": 1,
            "text": "It's also worth mentioning that, unfortunately, due to its rise in popularity, the term gaslighting has been hijacked by some people as a crutch to deflect valid criticism. Rather than defending their viewpoint through debate, they'll resort to accusing the other side of trying to \"gaslight\" them, which ironically is a form of gaslighting in itself.",
            "title_similarity": "0.6342331"
        },
        {
            "id": "hp82hm6",
            "score": 1,
            "text": "I honestly hate the term “gaslighting” because I can never seem to match the definition with the word. Gaslighting just doesn’t feel like the right fit for what it is actually describing. It seems like instigating would be a synonym to gaslighting- just based off of what lighting gas is in reality- but it’s not at all.",
            "title_similarity": "0.44847107"
        },
        {
            "id": "hp82qlv",
            "score": 1,
            "text": "Gaslighting isn't even a real term. You just got it in your head that gaslighting is real because you heard it said somewhere. Everything I've said to you is the truth.\n\n- that's gaslighting",
            "title_similarity": "0.60720253"
        },
        {
            "id": "hp82uu5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp83x0z",
            "score": 1,
            "text": "\"There is no such thing as gaslighting.\"\n\nThat was an example of gaslighting... or is it? Okay, okay, I'm just joking geez, lighten up. Don't take things so seriously. It's not a big deal. It's just a little gas and a little lighting! Completely different things.\n\nWe weren't even *talking* about gaslighting! Why are you just now bringing this up?! What were we even talking about?! You do this all the time! You interrupt me and make it about you or something stupid and then I forget what I was going to say.\n\nYou do that on purpose don't you! You *want* me to forget things!\n\nI *know* you can light a gas stove with a match, you don't have to keep telling me that! I get it. End of discussion!!!!!\n\n------------------------------\n\n^(And when I explained it like that to little Billy, that was the first time I saw a 5 year-old drink hard liquor.)",
            "title_similarity": "0.47819597"
        },
        {
            "id": "hp84hlv",
            "score": 1,
            "text": "The most common manifestation of it that I’ve experienced is someone acting like they don’t remember saying or doing something to their own advantage. Maybe once or twice in a blue moon you can give them the benefit of the doubt if you’re referencing something that happened a long time ago, but if it’s a pattern, and/or something that happened last week… yea unless they got hit in the head with a shovel and have clinical amnesia that’s definitely gaslighting.",
            "title_similarity": "0.53809905"
        },
        {
            "id": "hp855vl",
            "score": 1,
            "text": "and some people will accuse you of \"gaslighting\" them when you're 100% correct and they know you've caught them in a bald faced lie.\n\ntrust your eyes. trust your intuition.",
            "title_similarity": "0.57802975"
        },
        {
            "id": "hp85hbk",
            "score": 3,
            "text": "A simple definition is essentially you know something happened or something was said and someone (who knows you're right but doesn't want to admit it) basically tries to convince you that what was said actually wasn't said and oh yeah that didn't actually happen. That's gaslighting. Normally it's when the gaslighter says or does something that is really fucked up that they're trying to deny",
            "title_similarity": "0.47866374"
        },
        {
            "id": "hp86ahc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp8792e",
            "score": 1,
            "text": "Don't believe your own eyes and ears and instead believe what I'm telling you.\n\nYou have a blue pen, you have written with the pen and seen the blue ink on the paper. I tell you \"what? No your crazy the pen isn't blue, it's red.\"\n\nBut the intention behind the behavior is to make you doubt yourself and make you look like a fool. It's different from say how scientific progress is made, which often time does end up with one person in essence saying that a person that came before them was wrong. In science you make a claim and you present your proof, then if I think you are wrong or made mistakes, I make my own claim and present proof as to why your claim is wrong and mine is right.\n\nThis is why something like \"what color is the dress?\" isn't gaslighting because while you may see it as gold and may think it's gold one explains how light and the surrounding colors and all those things makes it so you see the dress a certain color and think it's a certain color. In this example I give you the skill and tools to understand the illusion.\n\nWith gaslighting I just tell you \"No, you are crazy/dumb/fool the dress is blue\" but then never tell you why, which in the case of gaslighting you can't ever tell a person why they are wrong because it's all based on a lie. Gaslighting is about making you think you are crazy, dumb or untrustworthy.",
            "title_similarity": "0.48093557"
        },
        {
            "id": "hp87lly",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp87zo8",
            "score": 1,
            "text": "Didn't you just ask this yesterday?",
            "title_similarity": "0.20380579"
        },
        {
            "id": "hp88345",
            "score": 1,
            "text": "it is a manipulation technique that is used to cause the victim to doubt their own judgement and believe the words of the gaslighter.\n\nMost commonly, it's used to make the victim only trust the gaslighter, so the gaslighter can get away with doing anything to the victim",
            "title_similarity": "0.4755839"
        },
        {
            "id": "hp88583",
            "score": 1,
            "text": "Saying something did or did not happen inaccurately, intentionally, as a form of manipulation.",
            "title_similarity": "0.20735908"
        },
        {
            "id": "hp88frp",
            "score": 1,
            "text": "I think this happens on occasion, but we're all clear that in relationships there's pretty much always two sides to every story.",
            "title_similarity": "0.48142773"
        },
        {
            "id": "hp88iad",
            "score": 1,
            "text": "\"No, no, you don't understand, your ELI5 is all wrong!\"\n\nImagine a sequence of those applied to everything you say or do. That's ~~what my sister always~~  an operational definition of gaslighting.",
            "title_similarity": "0.5531335"
        },
        {
            "id": "hp8944e",
            "score": 1,
            "text": "They're working hard to make a child do this just to see the non-Leafs version of that electric mail delivery van they’re missing is a blind dog\n\nhttps://i.imgur.com/TR78rYR.png",
            "title_similarity": "0.3740617"
        },
        {
            "id": "hp896m4",
            "score": 1,
            "text": "All these explanations are for 50 year olds.  Can someone please ELI5?",
            "title_similarity": "0.34275842"
        },
        {
            "id": "hp8a11m",
            "score": 1,
            "text": "The worst is when they have no memory of any of it. Sometimes you are actually the only sane one, because other people there blocked it out.",
            "title_similarity": "0.34885174"
        },
        {
            "id": "hp8a6y2",
            "score": 1,
            "text": "After reading these comments you gotta be pretty gullible to be gas lit. Amazes me that people think they can't change their opinions or talk about things in reality.",
            "title_similarity": "0.5947294"
        },
        {
            "id": "hp8ak4d",
            "score": 1,
            "text": "You know what gaslighting is. Stop being dramatic and trying to karma whore. You already knew when you made this post, we both know you did. \n\n&#x200B;\n\n(Basically it's that)",
            "title_similarity": "0.47764507"
        },
        {
            "id": "hp8bhh8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp8bjim",
            "score": 1,
            "text": "There is manipulative gaslighting covered by others here in this post. For just torturing someone into believing they are crazy please watch the movie Amalié.",
            "title_similarity": "0.5269228"
        },
        {
            "id": "hp8cf50",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp8cs2a",
            "score": 1,
            "text": "It's when you trick someone into questioning their own sanity. It's usually down slowly, over time, so that they don't know it's happening to them.",
            "title_similarity": "0.32721508"
        },
        {
            "id": "hp8cz7d",
            "score": 1,
            "text": "Gaslighting? I've never heard of it. Are you sure you didn't make it up?  Maybe you're thinking of something else and just got the word wrong, you do that a lot. Because it's not a thing. Must have just been one of your brain farts then.\n\nIf you read that and questioned anything about what the word is, whether you spelled it wrong, gendered it correctly, etc., congrats. Now you know what gaslighting is. By repetition, questioning, and often insulting, a person is made to question themselves and their perception of reality. It is an insidious and oftentimes quite subtle form of abuse.",
            "title_similarity": "0.61103904"
        },
        {
            "id": "hp8dgyz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp8dh33",
            "score": 1,
            "text": "Sorry kiddo, but gaslighting isn't real don't you remember you made that all up?",
            "title_similarity": "0.49781638"
        },
        {
            "id": "hp8e2ka",
            "score": 1,
            "text": "God, I've told you like five times already. Don't you remember?",
            "title_similarity": "0.30506182"
        },
        {
            "id": "hp8em20",
            "score": 1,
            "text": "\"Don't gaslight me.\"\n\"Gaslighting doesn't exist. You made it up cause you're fucking crazy.\"",
            "title_similarity": "0.28724286"
        },
        {
            "id": "hp8enwe",
            "score": 1,
            "text": "What are you talking about? There's no gaslighting.",
            "title_similarity": "0.053266767"
        },
        {
            "id": "hp8eyfo",
            "score": 1,
            "text": "I equate the term Gaslighting with the Start Trek episode \"Chain of Command\" where Picard is tortured and made to believe the set of lights in the room are three bulbs when there's actually four.  This point is argued throughout the episode and the very end scene Picard mentions that despite insisting there are four lights, he briefly believed there were three.",
            "title_similarity": "0.50142103"
        },
        {
            "id": "hp8f0dl",
            "score": 1,
            "text": "In the personal sense it's to make someone question their perception of reality(i.e. make them think they're crazy).\n\nIn the political sense it's convincing people to believe that something is a hoax when it's not. For example: denying climate change by saying that it's made up as part of political theatre.",
            "title_similarity": "0.4173454"
        },
        {
            "id": "hp8faie",
            "score": 1,
            "text": "What is gaslighting? \nMy ex husband...",
            "title_similarity": "0.31137884"
        },
        {
            "id": "hp8fgqd",
            "score": 1,
            "text": "tricking someone to think what they actually  believe and remember is not the truth.\n\ni.e. you went to the fair and got a red balloon.  but some guy tells you no the baloon was green dont you remember?\n\n(when it was actually red).\n\nthats gaslighting.\n\nafter a while being told that you might actually start to believe that you were wrong....thats how people can manipulate you.",
            "title_similarity": "0.5030415"
        },
        {
            "id": "hp8fjs1",
            "score": 1,
            "text": "Trying to convince and bully someone (usually a weaker individual) into believing in that their views or ideas are wrong and in extreme cases actually insane.",
            "title_similarity": "0.3706578"
        },
        {
            "id": "hp8fl4o",
            "score": 1,
            "text": "We’re having a conversation in which you claim to love candy more than cake.\n\nWe talk about your love for candy for minutes. \n\nI go get you a candy. You immediately turn and say “why did you get me candy? I told you I loved cake.” \n\nYou then may arrange facts to fit your story in such a way that would make me question if I really did misunderstand our entire conversation over your love for candy.",
            "title_similarity": "0.5836024"
        },
        {
            "id": "hp8fmxm",
            "score": 1,
            "text": "Gaslighting!?! That word doesn’t exist in the dictionary. \n\n-The Gaslighter",
            "title_similarity": "0.2044434"
        },
        {
            "id": "hp8fx2w",
            "score": 1,
            "text": "It’s not always a bad thing. I once gas lite my ex into thinking she farted when it was really me.",
            "title_similarity": "0.5587368"
        },
        {
            "id": "hp8fytt",
            "score": 1,
            "text": "Just realized I had someone do some type of gaslighting on me by reading this. It’s like someone knew I had to read this…",
            "title_similarity": "0.5513419"
        },
        {
            "id": "hp8fyz5",
            "score": 1,
            "text": "It's when someone manipulates you into questioning your own sanity or reality.  \n\n\nLet's say that hot new date of yours agreed to visit a local amusement park with you after her university exam the following month.  A month goes by and she passes her final exam with flying colours and you revisit the arrangement, asking whether she prefers Saturday or Sunday to make that visit.  \n\nShe wonders what you're talking about and you remind her that the two of you agreed to visit SuperFunLand Amusement Park after her exam.  She denies the two of you ever spoke about that, leaving you to wonder whether that initial conversation was an artifact of a particularly vivid dream or something, and when you say \"well, would you like to go anyway?\"  She answers \"not really, I hate roller coasters.\"",
            "title_similarity": "0.40636343"
        },
        {
            "id": "hp8g40l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp8gk0s",
            "score": 1,
            "text": "Never heard of this \"Gaslighting\"? You sound crazy.",
            "title_similarity": "0.3606939"
        },
        {
            "id": "hp8gk6l",
            "score": 1,
            "text": "Gaslighting doesn’t exist?",
            "title_similarity": "0.07250671"
        },
        {
            "id": "hp8go11",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp8gv7r",
            "score": 1,
            "text": "Did you hear the joke about gaslighting? Yes you did.",
            "title_similarity": "0.4779171"
        },
        {
            "id": "hp8hbi6",
            "score": 1,
            "text": "Gas lighting? What are you talking about, that’s not a real word",
            "title_similarity": "0.2634712"
        },
        {
            "id": "hp8hhkm",
            "score": 1,
            "text": "What do you mean you don’t know what gaslighting is? Yes you do, stop lying. \n\nYou know what it means, after all, you made it up, remember? You remember right? Ah. Now you remember. See, your memory was wrong all this time. You should doubt your ability to remember things.\n\n^ that.",
            "title_similarity": "0.5013391"
        },
        {
            "id": "hp8hlay",
            "score": 1,
            "text": "I just explained this to you yesterday; why can't you ever remember this stuff?",
            "title_similarity": "0.33127564"
        },
        {
            "id": "hp8i1o4",
            "score": 1,
            "text": "My brother does this. We live on opposite sides of the country and rarely saw each other but talked on the phone frequently. I moved my family to his town to work with him on his suggestion but I had no idea what a truly narcissistic, lying, gaslighting, manipulator he is. A week or so after we arrived he offered his expensive boat for my family to use. I was nervous about taking the responsibility but I’m good with boats so off we went. \nHe gave my two specific instructions, don’t leave the ladder down and put the motor in a specific position when we park. I did those two things just like he asked. A few weeks later he was mad at me, out of the blue, for not doing either of those things. Some time had passed and I couldn’t remember so I apologized and we never asked to use the boat again and it was never offered again. Now more than a year has gone by and I know him. We no longer speak to each other.  He has made wild accusations of me stealing from him and other things. Boy I’m telling you, gaslighting experts can really fuck with your head. Avoid them like the plague.",
            "title_similarity": "0.4758862"
        },
        {
            "id": "hp8ij2c",
            "score": 1,
            "text": "ELI5: “Hey! You just did something I didn’t like”…\n“No I didn’t and it’s your fault anyway”",
            "title_similarity": "0.32223976"
        },
        {
            "id": "hp8ilc1",
            "score": 1,
            "text": "I know it wouldn’t be right for the sub. But how great if everyone just banded together to gaslight OP with absolutely no /s or just kiddings",
            "title_similarity": "0.4966048"
        },
        {
            "id": "hp8izny",
            "score": 1,
            "text": "See if you can find a copy of [Gaslight] (https://www.imdb.com/title/tt0036855/) on-line to watch. It's a good movie and it's where ther term came from.",
            "title_similarity": "0.55656374"
        },
        {
            "id": "hp8j6cv",
            "score": 1,
            "text": "It’s been insanely busy at work and all of my coworkers are stressed. Our boss sent out an email telling us how incredible our positive energy is and how we impact everyone around us with positivity. Thanks for being so happy in this trying time. \n\nEveryone I’ve asked says they are not happy. Not positive. But boss is telling us we are. \n\nI didn’t really understand gaslighting until this.",
            "title_similarity": "0.6749792"
        },
        {
            "id": "hp8jplo",
            "score": 1,
            "text": "Let’s say Max threw a plate at the wall. You SAW Max throw a plate at the wall. Max tells you not only did he NOT throw the plate, but you clearly have vision or memory issues causing you to incorrectly believe that he did. He says the plate fell, or that the cat broke it, or you did.",
            "title_similarity": "0.40468353"
        },
        {
            "id": "hp8jsad",
            "score": 1,
            "text": "Psychologicaly speaking, gaslighting is[forced confabulation.](https://www.sciencedirect.com/science/article/abs/pii/S0022096512001701) (Link is an example)",
            "title_similarity": "0.46276176"
        },
        {
            "id": "hp8jupy",
            "score": 1,
            "text": "A great example is Boris Johnson being caught out many times lying but still denying it happened and repeating it so often, most the country believe him & forget and just move on",
            "title_similarity": "0.60102713"
        },
        {
            "id": "hp8kcc9",
            "score": 1,
            "text": "Come on OP. You know what Gaslighting is! We told you this yesterday remember?",
            "title_similarity": "0.3880667"
        },
        {
            "id": "hp8ke7q",
            "score": 1,
            "text": "You've already received many good explanations. \n\nLet me put in a plug for the original movie - it's really good, a classic, and helped cement the meaning of the word in my brain.",
            "title_similarity": "0.74869823"
        },
        {
            "id": "hp8kk3m",
            "score": 1,
            "text": "You always ask me the same things. Do you not like talking to me? Whatever. I'm going to my ex's house, there's a party and I'm upset so I'm going alone.. don't be paranoid you're so crazy. I'll be home for breakfast, you said you'd cook when I get home didn't you?",
            "title_similarity": "0.43721086"
        },
        {
            "id": "hp8l2ab",
            "score": 1,
            "text": "Dude, why do you keep posting this?",
            "title_similarity": "0.33283275"
        },
        {
            "id": "hp8l7n6",
            "score": 1,
            "text": "Gaslighting is about getting you to not trust your own perception. Most of the examples I've read on this post talk about physically changing things (changing the oven temp, breaking a cell phone, etc) but it is as or more often 100% psychological. \n\nSay you and your wife go to dinner with a group of her coworkers and you have a great time. You really hit it of with them, are sharing jokes back and forth, relating well. You leave dinner feeling great.\n\nThen she turns to you and says \"I'm sorry dinner went so badly. It's my fault, I shouldn't have expected you to be able to keep up with the conversation.\" And your're lost. \n\n\"But dinner went really well\" And she tells you that they were just laughing out of politeness. Didn't I see the looks they were all sharing? And one of them pulled her aside while you were in the bathroom, and asked her why you were trying to talk over everyone. Were you trying to make yourself look important? \n\nAnd at that point all your happiness about the evening is gone. And you genuinely start to wonder if you are bad at reading other people.",
            "title_similarity": "0.61360544"
        },
        {
            "id": "hp8lteq",
            "score": 1,
            "text": "You know how the sky is blue? And you can look up and see that it's blue. Well imagine someone said \"what do you mean blue? You think that's blue? No, no, that's actually pink. You even said the other day that it was pink, you don't remember?\" Until even you aren't sure what color the sky is, what blue looks like, or what you said or didn't say.",
            "title_similarity": "0.36743617"
        },
        {
            "id": "hp8m0b3",
            "score": 1,
            "text": "It means highlighting someone who was lying to you to make you doubt what is truth\n\nNow i find it’s just used as an easy way to get people on your side in an arguement whenever someone disagrees with you",
            "title_similarity": "0.45276815"
        },
        {
            "id": "hp8m478",
            "score": 1,
            "text": "The really messy part is when someone is trying to gaslight you and when you say you remember it differently than they do, they accuse YOU of gaslighting!\n\nThat’s super fun! And by that I mean, put some distance between yourself and that situation if it ever happens to you.",
            "title_similarity": "0.5372388"
        },
        {
            "id": "hp8maoc",
            "score": 1,
            "text": "A christmas without panettone?? That's an humanitarian crisis! We need to have to attack and when it realised its stuck. It's so obviously not acting like you know what \"gaslighting\" and just RAN with it. One group has shifted so far to find this!\n\n\"BUUBBBBLLESS! Bubbles! My bubbles!\"",
            "title_similarity": "0.46516767"
        },
        {
            "id": "hp8mij7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp8mkup",
            "score": 1,
            "text": "You know what gaslighting is. You already asked this question. Do you honestly not remember??",
            "title_similarity": "0.4010002"
        },
        {
            "id": "hp8mwzh",
            "score": 1,
            "text": "Pulling your strings into believing youre crazy for example . or not believing your own eyes ...",
            "title_similarity": "0.38039657"
        },
        {
            "id": "hp8mx7c",
            "score": 1,
            "text": "You keep asking us this same question, and we keep telling you the answer. Why do you keep forgetting?",
            "title_similarity": "0.51184285"
        },
        {
            "id": "hp8mxpy",
            "score": 1,
            "text": "Gaslighting is when you try to convince someone that something other than what happened is what happened so you can manipulate or control them.",
            "title_similarity": "0.40887737"
        },
        {
            "id": "hp8n1t5",
            "score": 1,
            "text": "Fun fact, telling someone they are gaslighting you and lying about it is also gaslighting. I’ve seen it happen. Gaslightception",
            "title_similarity": "0.5680517"
        },
        {
            "id": "hp8n809",
            "score": 1,
            "text": "*\"You already asked this here. Why did you post this again?*\n\n\n*What do you mean this is the first time you asked this question?*\n\n\n*You know what, I'm getting real sick of this little game you play where you act all confused and upset when I ask you a simple question.\nIt's not cute, it's not funny, it's fucking annoying and if I wasn't such a nice person you'd be out the goddamn door.\nBut you know what? If you were ever on your own, not a single person out there would tolerate this bullshit and take you in. Not one. No would see past your annoyances and love you like I do. I'm the best you'll ever get and you'd be stupid to ever think otherwise. So you're welcome, and honestly a little gratitude once in a while for the patience I have while dealing with your crap would be appreciated. I'm going to bed and if you love me you won't bring this up again\"*",
            "title_similarity": "0.5118066"
        },
        {
            "id": "hp8nln6",
            "score": 1,
            "text": "Here is a pretty good comment I saw recently that explains gaslighting with examples and sources (I cut out part of it since this was a response to another comment):\n\nLink: https://old.reddit.com/r/tifu/comments/rd935d/tifu_by_having_a_horny_reddit_hookup/ho1qzqp/\n\nUser: u/music_user\n\n\n\"So that definition is super constrained and actually completely outside of the scope of what was originally considered to be gaslighting.\n\nThe first discussions of gaslighting occured in psychiatric journals in the late 1960s and 1970s. All of the case studies discussed from that period and definitions of gaslighting from that period pay no attention to what the victim thinks of their own sanity whatsoever. In that first batch of case studies there are examples of victims who are actually extremely convinced of their own sanity. This early work is actually aimed at psychiatrists and hospital intake staff and views gaslighting as an attempt to have someone institutionalized in a psychiatric hospital on false pretense. The whole purpose of this literature is to warn psychiatrists to take patients who say they are sane seriously. So pretty far from your definition.\n\nIn the 1980s psychodynamic / psychoanalytic researchers started discussing gaslighting. They define gaslighting somewhat more similarly to you, but obviously go into much greater detail. They outline a number of tactics used in gaslighting. One such tactic is trying to establish among others that the victim is 'crazy'. This is the tactic of gaslighting that is being enacted in this thread, even from this more constrained psychoanalytic view. Within the psychoanalytic tradition there is discussions of how social power (such as gender) play into gaslighting. For example, negative stereotypes about woman as being overly emotional or crazy are perpetuated through the culture, and then used to undermine and control woman, or used to help people avoid accountability for mistreating them.\n\nMore recently, gaslighting has been applied to a wide variety of contexts. There are again recent examples of gaslighting in the literature where the victim's view of their own sanity is irrelevant / secondary, so long as other people are convinced that the victim is epistemically incompotent (i.e. not worth listening too; e.g. crazy). One example of this is nurses who 'blow the whistle' on unsafe practices in hospitals and then are labelled as 'cracking under the pressure' or being 'too stressed to perform their jobs well'. So long as hospital admin is convinved it isn't super relevant whether the nurse buys into the gaslighting or not.\n\nThis thread can factor into gaslighting in a variety of ways. For one, if the woman who the thread is about were to call OP on his ethically questionable behavior, he could literally show her this thread and say \"See reddit thinks you are crazy\". Similarly, if his shitty behavior becomes known around his small town he could avoid accountability by showing his peers the thread and saying \"see she is the crazy one\". Thus, this thread is a prime example of the way group dynamics contribute to gaslighting. On a broader scale it reinforces the negative stereotypes about woman that are frequently used in gaslighting. Lastly, situations like OPs are not uncommon, and by labelling the victim crazy any other victim of similar circumstances reading this thread is effectively gaslit.\n\nIn sum, gaslighting involves convincing others that a victim is epistemically incompotent (for example crazy) but that person may or may not be the victim. Furthermore, gaslighting is made up of a wide variety of behaviors. Not all of these behaviors must be present for something to be gaslighting. One such behavior is bringing in others to help in the labelling of the victim as being crazy.\n\nHere is a list of some of the specific articles I'm discussing here:\n\nBarton, R., & Whitehead, J. A. (1969). THE GAS-LIGHT PHENOMENON. The Lancet, 293(7608), 1258–1260. https://doi.org/10.1016/S0140-6736(69)92133-392133-3)\n\nCawthra, R., O’Brien, G., & Hassanyeh, F. (1987). “Imposed psychosis”. A case variant of the gaslight phenomenon. The British Journal of Psychiatry: The Journal of Mental Science, 150, 553–556. https://doi.org/10.1192/bjp.150.4.553\n\nDorpat, T. L. (1996). Gaslighting, the Double Whammy, Interrogation, and Other Methods of Covert Control in Psychotherapy and Psychoanalysis. J. Aronson.\n\nGass, G. Z., & Nichols, W. C. (1988). Gaslighting: A marital syndrome. Contemporary Family Therapy, 10(1), 3–16. https://doi.org/10.1007/BF00922429\n\nAbramson, K. (2014). Turning up the Lights on Gaslighting. Philosophical Perspectives, 28(1), 1–30. https://doi.org/10.1111/phpe.12046\n\nAbramson, K. (2014). Turning up the Lights on Gaslighting. Philosophical Perspectives, 28(1), 1–30. https://doi.org/10.1111/phpe.12046\"",
            "title_similarity": "0.63498914"
        },
        {
            "id": "hp8nwzu",
            "score": 1,
            "text": "To use as few words as possible, it’s convincing someone that they’re crazy so that they’re easier to lie to and control.\n\nTo use a few more, it’s making someone mistrust their own perception of reality in order to make them more susceptible to manipulation.\n\nA classic and unfortunately common example is in an abusive relationship where the abuser makes the victim think that the abuse is their fault and that the abuser is not a bad person, but that the victim did something wrong to cause the abuse they receive.",
            "title_similarity": "0.45870864"
        },
        {
            "id": "hp8o0y6",
            "score": 1,
            "text": "So does that mean Mysterio gaslit spiderman?",
            "title_similarity": "0.3475729"
        },
        {
            "id": "hp8ojtj",
            "score": 1,
            "text": "“I had to grab you by the mouth to muffle you because you were causing a scene and the neighbors might hear. If you could just stop being so emotional these things wouldn’t happen and we could just be happy.”",
            "title_similarity": "0.48662794"
        },
        {
            "id": "hp8oztd",
            "score": 1,
            "text": "I would answer your question but you never posted one?!?",
            "title_similarity": "0.26415193"
        },
        {
            "id": "hp8p3yi",
            "score": 1,
            "text": "He term comes from a play in the 30s. Watch the movie adaptation Gaslight from from the 40s.",
            "title_similarity": "0.31144762"
        },
        {
            "id": "hp8p7a3",
            "score": 1,
            "text": "It’s a manipulation tactic that makes someone doubt or distrust their own memory or reality. \n\nMy examples: \nMy ex stole my sisters wallet, I found it & confronted him.  He told that me he found it in my purse so I must have stolen it and I probably didn’t remember stealing it because of the brain surgeries & seizures I’ve had. \n\nHe used to call me his exes name (I believe on purpose) and then would tell me I was just hallucinating it out of insecurity and insanity, again because I’ve had brain surgeries/seizures .",
            "title_similarity": "0.4696789"
        },
        {
            "id": "hp8p9wq",
            "score": 1,
            "text": "You know what it is.  You asked this question last week.  I explained then.  You were cool with it.",
            "title_similarity": "0.40972227"
        },
        {
            "id": "hp8pidz",
            "score": 1,
            "text": "I was thinking about [this](https://youtu.be/T_x6QmuJdms) today when I heard it. It’s like the ultimate gaslighting song.",
            "title_similarity": "0.59304625"
        },
        {
            "id": "hp8pm95",
            "score": 1,
            "text": "Sad but good show that is a very good example of this. The Shrink Next Door. It's new and with Paul Rudd and Will Ferrel but far from a comedy. I'd recommend reading these comments and then watching that show for a great example to tie it all together.",
            "title_similarity": "0.6190526"
        },
        {
            "id": "hp8pzx5",
            "score": 1,
            "text": "Lots of people have covered the definition really well. Here’s my example:\n\nEx boyfriend and I had a… turbulent relationship. One time after we’d had a fight, he walked a very long way to my house, late at night, to “prove to me he was sorry and he loved me”. He showed up drunk, although the walk had sobered him up a lot compared to how he was when he first called, before he started walking. \n\nWe made up, we had sex, we talked a lot. As a side note, during our conversations that night he pointed out a couple of my physical flaws that I was insecure about and asked me probing questions about them. I got upset, the conversation died and he fell asleep, I stayed awake stewing over everything.\n\nIn the morning he got a bus home.\nA few days after that we had another argument and when I brought up that night and some of the things he/we said and did, he claimed he never said those things, none of it happened and I was remembering it all wrong because “I was so drunk and emotional at the time”. I’d had like 1 drink that night. \n\nLater, in yet another argument, it came up again and he told me he didn’t even remember a single thing about that night because *he* was so drunk. So we couldn’t talk about it. \n\nAnd finally, a few weeks later when I called to break up with him because he cheated, he admitted he *did* actually remember it all but he never wanted to talk about it because it made him look bad. \n\nThis kind of thing happened a lot - him claiming I’d said stuff I hadn’t, or done stuff I hadn’t while I was “blackout drunk”, or that I was making up stories about him that weren’t true, or that my friends were lying to me about the shady shit he’d said and done. \n\nThankfully I never fell for it, and got out of there before things went too far. Thank god for my friends too, as they genuinely had my back and I always trusted them over him despite his efforts…",
            "title_similarity": "0.5240118"
        },
        {
            "id": "hp8qjb5",
            "score": 1,
            "text": "Why is this concept popular right now? My girlfriend's 19- yr-old son told me the other night in fun to quit gaslighting him and I've read and heard the term a lot lately.",
            "title_similarity": "0.51573086"
        },
        {
            "id": "hp8qwky",
            "score": 1,
            "text": "“Like you don’t know!? Omg that’s just like you to bait me with a question like that.”",
            "title_similarity": "0.42554614"
        },
        {
            "id": "hp8qxz7",
            "score": 1,
            "text": "Gaslighting is a psychological pop-culture term, it is not an accepted medical psychology or psychiatry term. Even the term itself is a pop-culture reference to an old movie.  As a result, you will get different definitions of it depending on who you ask, with everyone being absolutely sure of their definition. And the problem is, by being a pop culture term, its definition will expand and change over time.\n\nIn its most restricted definition, it is a form of abuse where someone’s suffering is dismissed as them being the problem, or them being the crazy one. It does not have to be conscious or purposeful. The trouble is, this is an extreme gray area because self-rationalization, self-justification, and a tendency to blame the victims for one’s own selfish desires or needs is an incredibly common trait in all of humanity by default.\n\nAnother problem is that humans often simply do not share the same flawed recollection or interpretation of events. We have a universally proven tendency to remember events in whatever light tends to make us look best. And so it is not inherently abusive or problematic for two people to not agree on the actual source of a problem, or to not interpret actual past events the same way.\n\nAnd these days, accusing someone of “gaslighting” is often just an attempt to reject another’s persons’ recollection or understanding as purposely toxic and abusive when that may not be the case. It is invoked as a way to stop debate or conversation rather than work through it. In many cases, an accusation of gaslighting may be, in fact, gaslighting!\n\nThis is why you will never see it used in actual medical psychology or psychiatric sources. It has mostly sprung up through pop-culture and less medically accredited sources in talk therapy and similar, as a shorthand.",
            "title_similarity": "0.5933008"
        },
        {
            "id": "hp8ra2m",
            "score": 1,
            "text": "In short, fucking with someone mentally in order to deceive and/or manipulate the other person. It’s a form of abuse.",
            "title_similarity": "0.2982266"
        },
        {
            "id": "hp8rdkn",
            "score": 1,
            "text": "I already told you what gaslighting is.  Don’t you remember?",
            "title_similarity": "0.37340477"
        },
        {
            "id": "hp8rs80",
            "score": 1,
            "text": "You already know this, why are you asking?",
            "title_similarity": "0.28639203"
        },
        {
            "id": "hp8sbxs",
            "score": 1,
            "text": "Honestly 90% of the time people using gaslighting are wrong with definition, I’m sure I’ve been wrong on occasion myself too",
            "title_similarity": "0.51853096"
        },
        {
            "id": "hp8skxi",
            "score": 1,
            "text": "A manipulation tactic that is aimed at questioning yourself (whether it's your sanity, judgement, memory or anything). Its like a subtle form of denial and deflecting.",
            "title_similarity": "0.3493122"
        },
        {
            "id": "hp8sm7t",
            "score": 1,
            "text": "The top comment is spot on. I've been in an extremely abusive relationship before, and he gaslighted me a lot. I can provide some specific examples of what his manipulative ass would do: \n\n- He would hide my car keys. I eventually made it a point to put my keys on a table by the front door, made a mental note about it, thought about it for 10 seconds before waking away. The following morning before work, those keys would be gone and placed somewhere else. He never admitted moving them. \n\n- deny events that happened the previous day, I'd recall something that happened, something small, like going to the store and he would tell me that didn't happen. \n\n-ask him to help pay for bills, but he would tell me he already gave me money\n\nThose are just a few things I remember from 10+ years ago. I do remember that towards the end I felt fucking insane, he also deprived me of sleep and ate as much food as possible, leaving me feeling always hungry.",
            "title_similarity": "0.51829183"
        },
        {
            "id": "hp8ttpp",
            "score": 1,
            "text": "Gaslighting isn't a thing. I don't know where you heard it from but it's not real and never has been.\n\nThat's an example of using gaslighting. Making someone question their belief on something they were almost certain about knowing or seeing.",
            "title_similarity": "0.36974"
        },
        {
            "id": "hp8tzur",
            "score": 1,
            "text": "basically, it amounts to inducing schizophrenia (making it so that their perception of reality is split from the normal) in someone through long term manipulation (suggesting that the split reality is normal by consistently contradicting their perception)",
            "title_similarity": "0.41052896"
        },
        {
            "id": "hp8u35c",
            "score": 1,
            "text": "So what would be a genuine real life example of gaslighting?",
            "title_similarity": "0.39457098"
        },
        {
            "id": "hp8uhxk",
            "score": 1,
            "text": "It’s an idea that is far too complicated for conservatives to understand so they get gaslit literally 24/7",
            "title_similarity": "0.60546464"
        },
        {
            "id": "hp8vije",
            "score": 1,
            "text": "we already talked about this OP, don't you remember?",
            "title_similarity": "0.36229402"
        },
        {
            "id": "hp8vm43",
            "score": 1,
            "text": "It's that scene in star trek TNG where the cardassian tries to convince Picard that there are 3 lights.",
            "title_similarity": "0.37760624"
        },
        {
            "id": "hp8vofu",
            "score": 1,
            "text": "This is interesting. I always assumed gaslighting is just saying things that you know will set someone off.",
            "title_similarity": "0.5409637"
        },
        {
            "id": "hp8wcyi",
            "score": 1,
            "text": "Pretty sure my friends’ chickens are gaslighting me while I’ve been taking care of them. Day 1, water container at 50%. Day 2 at 25% so I refill it. Day 3, completely empty. I asked the chickens if I refilled it and all they did was cluck at me and peck at another water bowl.",
            "title_similarity": "0.47837868"
        },
        {
            "id": "hp8wepc",
            "score": 1,
            "text": "Someone punches you in the face, you say “Why did you punch me in the face?” They respond “I didn’t punch you in the face, and people wouldn’t punch you in the face if you weren’t always accusing people of doing things they didn’t do, really if anyone is at fault here it’s you.”",
            "title_similarity": "0.45003444"
        },
        {
            "id": "hp8wo6i",
            "score": 1,
            "text": "There's no such thing as gaslighting. Whoever told you about that is lying and you should trust me on this.",
            "title_similarity": "0.32482302"
        },
        {
            "id": "hp8x86d",
            "score": 1,
            "text": "Its me when I tell my wife there were always only four brownies left over even though she swears there were 6.",
            "title_similarity": "0.3460583"
        },
        {
            "id": "hp8xelf",
            "score": 1,
            "text": "Why do you keep making these posts? We've already explained what gaslighting is to you in all your other posts on the subject.",
            "title_similarity": "0.6188689"
        },
        {
            "id": "hp8xfid",
            "score": 1,
            "text": "I feel like the top answers don't really get at when this is commonly used.  It's usually not to convince people that they're just crazy about the world in general.  It's usually to convince them that they're crazy about *social* things.  Like, \"Yes, I went out for drinks alone with my female coworker and didn't come back home until after midnight!  We're friends, that's a perfectly normal thing to do!  I love you honey, but you have this crazy jealous streak that needs to stop...\"",
            "title_similarity": "0.5408515"
        },
        {
            "id": "hp8xke2",
            "score": 2,
            "text": "It's lying to a person with at least one goal being to get the person being lied to to doubt the faculties of their own mind. \"Are you gonna believe me, or your lying eyes?\" kind of thing. Bonus points if you're trying to actually drive the other person insane by getting them to question their own sanity.",
            "title_similarity": "0.4157559"
        },
        {
            "id": "hp8y8b6",
            "score": 1,
            "text": "Don't you remember? I already told you what It is",
            "title_similarity": "0.2187038"
        },
        {
            "id": "hp8z0vf",
            "score": 1,
            "text": "Gaslighting? What the hell are you talking about?",
            "title_similarity": "0.2663126"
        },
        {
            "id": "hp8zajk",
            "score": 1,
            "text": "Applying an electric current to a gas like rarefied neon or a similar one that ionizes it making it emit light.",
            "title_similarity": "0.2244437"
        },
        {
            "id": "hp8zsjo",
            "score": 1,
            "text": "Nothing, what are you talking about? That's not even a real thing.",
            "title_similarity": "0.0874534"
        },
        {
            "id": "hp8zzo4",
            "score": 1,
            "text": "After being gaslit, you just know. It hits you like a ton of bricks. Your self esteem is gone. You don’t know who you are anymore. You see the world different. You don’t trust people. It’s absolute misery to encounter a gaslighter. I called out my gaslighting ex once and they said “I don’t do this or this or this” after showing them an article that said “ten ways someone may be gaslighting you.” And that… in itself is gaslighting. Remember it’s not all encompassing. If someone is doing one trait of gaslighting, it’s still gaslighting.",
            "title_similarity": "0.52294415"
        },
        {
            "id": "hp901zi",
            "score": 1,
            "text": "Gaslighting is when someone tries to make you believe you can't trust your own brain, or eyes, or ears, or memory. \n\nIt's more than just disagreeing, or telling a lie. \n\nFor example: let's say you agree to let me play with your favorite toy, and then when you find it layer it's broken. You ask me if I broke it. \n\nIf i say \"no, i didn't break it\" or \"no, i never played with it\" that's not gaslighting, even if I actually DID break it. Maybe i forgot, or maybe i just lied. \n\nIf i say \"no, i never played with it because you said i couldn't, remember?\" that could be gaslighting if lie that way a lot, because I'm lying to you about what *you* experienced- over time it could make you think your memory is bad. Or i might not be lying - i might just remember it differently.\n\nIf you say you *saw* me play with the toy, and i say you must be confused about what you saw, or tell you you just remember it wrong because you have a bad memory that's gaslighting. Now I'm telling you you can't trust your own brain. \n\nA lot of times, gaslighting works by taking advantage of a real reason someone might trust someone else's thinking over their own. \n\nFor example, if i say \"what are you talking about? It's not even broken, it's supposed to do that, it says so right here\" and then show you the instructions, that's DEFINITELY gaslighting, because i *know* you're 5 and can't read them. And if I'm an adult in your life, i probably read things for you all the time - you're used to believing me when i tell you what instructions say.",
            "title_similarity": "0.44910634"
        },
        {
            "id": "hp90dwh",
            "score": 1,
            "text": ">Gaslighting doesn't exist, anyone who tells you it does is lying, and you're crazy if you believe them\n\nGaslighting ^",
            "title_similarity": "0.34111422"
        },
        {
            "id": "hp90q4g",
            "score": 1,
            "text": "...you asked me that yesterday. Do you seriously not remember?",
            "title_similarity": "0.26561442"
        },
        {
            "id": "hp90yda",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp911u5",
            "score": 1,
            "text": "Don’t listen to these people. They don’t know what gaslighting is. The internet has for some weird reason has this skewed idea about gaslighting to where it means something that it actually is not. I’m here to tell you that the internet is conclusively wrong and not to listen to anyone in this thread, for they do not truly know what gaslighting is nor have taken a class on psychological phenomena such as gaslighting. Gaslighting, truthfully, is the act of appealing to one’s sense of truth by confirming something they know to be true in order to distract from some other lie that you’re telling. Again, this may seem different from anything that you’ve ever heard in regards to gaslighting, but most Internet forums are completely and totally incorrect in their definition.",
            "title_similarity": "0.5218029"
        },
        {
            "id": "hp914px",
            "score": 1,
            "text": "We've already talked about this. You don't remember? 🙄\n\n^that's gaslighting. We've never spoke but I'm going to make you question what you know",
            "title_similarity": "0.47111046"
        },
        {
            "id": "hp91dv8",
            "score": 1,
            "text": "We've already told you before, why are you still asking?",
            "title_similarity": "0.33021855"
        },
        {
            "id": "hp91hfl",
            "score": 1,
            "text": "When you're not five, and I repeatedly drill into your head that you are five, you actually start believing it even though it's contrary to objective reality.",
            "title_similarity": "0.5303286"
        },
        {
            "id": "hp9209t",
            "score": 1,
            "text": "Come on man, you know what gaslighting is. We've already had this conversation like 5 times what do you keep forgetting or something? You know, since your mom had dementia we should probably get you checked out just to be safe.",
            "title_similarity": "0.4534958"
        },
        {
            "id": "hp9289v",
            "score": 1,
            "text": "There are far better explanations in this comment section of what it actually is, but I’ve always considered it as an old time term for trolling.  Except, with a troll, they seem to not play victim.  To me a gaslight is when someone sets the stage, maliciously for their target to react, even overreact, then play victim when the person is mad as hell.",
            "title_similarity": "0.58590305"
        },
        {
            "id": "hp92gea",
            "score": 1,
            "text": "Just think of Danny DeVito in Matilda I believe this single quote kinda sums it up: \n\n“I’m smart, you’re dumb; I’m big, you’re little; I’m right, you’re wrong, and there’s nothing you can do about it”.",
            "title_similarity": "0.4721121"
        },
        {
            "id": "hp92som",
            "score": 1,
            "text": "thank you so much for asking this ELI5. none native English speaker here and I’ve been reading this term in so many political posts but I cant seem to figure out what the word actually implies. my initial thought on its meaning is ‘someone trying to ignite or start an uprising’.",
            "title_similarity": "0.6888298"
        },
        {
            "id": "hp93bhq",
            "score": 1,
            "text": "Gaslighting? There you go again making up words again. You know how insane you sound right now?\n\nSo ye that’s pretty much it",
            "title_similarity": "0.5368566"
        },
        {
            "id": "hp93ckt",
            "score": 1,
            "text": "I know you know what gaslighting is /u/pwa09 don't play dumb.\n\nIt's when I act confident, while lying to you about something you clearly have no knowledge of. It can be about anything. I take your car keys, hide them, you look around for them for hours. I put them back where they were originally. You doubt yourself.\n\nRepeat as long as necessary until I erode your ability to trust yourself and your memories. It's usually done in order to manipulate or gain power.",
            "title_similarity": "0.51552784"
        },
        {
            "id": "hp93yuh",
            "score": 1,
            "text": "So this is a bit of a personal question, since a family member of mine has been called a gaslighter, but I’m not sure if she’s just forgetting unpleasant incidents because she gets easily upset. Would that be considered gas lighting?",
            "title_similarity": "0.5498599"
        },
        {
            "id": "hp94000",
            "score": 1,
            "text": "Am I the only one who hasn't heard this term til a year or two ago?",
            "title_similarity": "0.18623978"
        },
        {
            "id": "hp9412e",
            "score": 1,
            "text": "It's when you suspect X is true, and person B knows X is true. But when you ask person B if X is true, they dismiss your suspicions, and then try to convince you you were mentally incompetent to think X in the first place, all without you questioning them, their motives or realizing they're leading you by the nose.",
            "title_similarity": "0.43389538"
        },
        {
            "id": "hp948z0",
            "score": 1,
            "text": "Can be wrapped up in this one quote\n\n\"Who are you gonna believe, me or your own eyes?\"",
            "title_similarity": "0.32488883"
        },
        {
            "id": "hp94qgc",
            "score": 1,
            "text": "One form of gaslighting in medicine/clinical psychology is “Munchhausen Syndrome by proxy.” Whereas Munchhausen Syndrome is just a person claiming themself to be sick (even though they might not be), Munchhausen *by proxy* is claiming sickness for others. Some might go as far as mimicking and inflicting injury or symptom.",
            "title_similarity": "0.42565128"
        },
        {
            "id": "hp962aw",
            "score": 1,
            "text": "There was an episode of the Simpsons where Bart's dog ate Milhouse's pet goldfish, but Bart tells him that he never had a goldfish to begin with. That's a rudimentary example of gaslighting. \n\nMilhouse would then counter by asking then why did he have a goldfish bowl.",
            "title_similarity": "0.36325043"
        },
        {
            "id": "hp9661d",
            "score": 1,
            "text": "It's NOTHING. I don't even know why you'd bring it up. Why are you even asking about it? You're crazy, you know that? You're always making things up and asking questions about things that are already settled. You know, your mom was right when she told me you were hard to raise; always throwing tantrums, starting drama, and making up stories. I've always got to walk on egg shells around you because every little thing that isn't perfect just sets you off. Just get off my back, okay?!",
            "title_similarity": "0.5515361"
        },
        {
            "id": "hp96met",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hp96qnk",
            "score": 1,
            "text": "I call this artificial dementia. It's designed to completely crush a person' s knowledge of everything the person has ever known. It's cruel.",
            "title_similarity": "0.36396465"
        },
        {
            "id": "hp96tmj",
            "score": 1,
            "text": "“Wtf are you serious right now?? Are you trying bait me into an argument? You know exactly what gaslighting is! I’m so fucking sick and tired of you playing these childish games just to get attendtion or a reaction from me!”\n\n^ that’s gaslighting no matter what the situation is you are always the bad person and you will always feel guilty and apologize for it afterwards. \n\nYour experiences and reality are real and valid no matter how much someone tries to convince you otherwise. You are not crazy. You are not blowing things out of proportion and you are not a bad person. Gaslighting a very effective form of manipulation and anyone can fall victim to it.",
            "title_similarity": "0.60159695"
        },
        {
            "id": "hp96ypm",
            "score": 1,
            "text": "I would highly recommend watching the Ingrid Bergman film “Gaslight.” The modern use stems from that film. In it, a husband trying to take advantage of his wife and have her declared insane decides to flicker the gas lamps in the house and pretend he doesn’t see it when she asks him about it and insists it’s occurring. Gaslighting someone is doing something similar. I’m not going to define it further as I feel a lot of other posters have done this well. The movie might help add context though.",
            "title_similarity": "0.55143386"
        },
        {
            "id": "hp9719q",
            "score": 1,
            "text": "Simply put: it’s manipulating someone and then leading them to believe that it is their fault.",
            "title_similarity": "0.26554835"
        },
        {
            "id": "hp978dk",
            "score": 1,
            "text": "today i learned what gaslighting actually is, and it’s not what i hear it being used as. I still don’t know what the other definition is",
            "title_similarity": "0.47395998"
        },
        {
            "id": "hp97kwg",
            "score": 1,
            "text": "When you go into a dark room or cave and you use a lighter or a flame to amplify your field of vision its happening due to the combustion of the gas in the air. Hence why it's called gaslighting.",
            "title_similarity": "0.3641582"
        },
        {
            "id": "hp97qlj",
            "score": 1,
            "text": "When you throw a toad into boiling water, it will do everything it can to jump out, but when you put the toad into a pot of cold water and slowly heat it, the toad will die in the pot, never being the wiser.",
            "title_similarity": "0.3683837"
        },
        {
            "id": "hp98dpr",
            "score": 1,
            "text": "Didn’t we explain this to you yesterday?",
            "title_similarity": "0.26271728"
        },
        {
            "id": "hp98x54",
            "score": 1,
            "text": "well, the short version is that **gaslighting is a manipulation tactic in which an individual makes you doubt your own perception, memories, etc**. an example of that is that someone I know tends to talk to people she doesn't like with a snarky tone and often throwing around indirect insults. I've seen her openly admit to it yet when the other person called her out on it, she told the person she had completely misinterpreted what she was saying and that she had never meant to be insulting. at some point she even insinuated she was crazy. *that way, she manipulated the other person into doubting her own judgement and perception by lying about her actual intentions and even facts (like the tone she used).* \n\nit's a very fucked up thing to do, because you end up doubting yourself at every turn and you no longer \"know\" when you're being mistreated because you wonder if maybe you're just \"crazy\", \"overly sensitive\", \"dramatic\", etc. it's a tactic abusers use to make sure the victim takes their abuse endlessly.",
            "title_similarity": "0.5457142"
        },
        {
            "id": "hp996md",
            "score": 1,
            "text": "Is this anyhow related to Wang Leehom?",
            "title_similarity": "0.11856593"
        },
        {
            "id": "hp998lv",
            "score": 1,
            "text": "Gaslighting isn’t a thing. I don’t know where you heard that from. It doesn’t mean anything at all.",
            "title_similarity": "0.17616627"
        },
        {
            "id": "hp9998n",
            "score": 1,
            "text": "Every time this thread comes around I ask this question and never seem to get an answer but here it goes again….I’m wondering if corporate gaslighting is a thing? I don’t mean a boss gaslighting their employee directly though. Here’s my example: Bob works in an inbound sales call center. There are “good” calls and “calls”. Good calls come from areas in the country that have more money, they have bought from the company before, etc. Bad calls are the complete opposite as you can imagine and very rarely result in a sale. \n\nThe company can determine who gets good calls and who gets bad calls, although they deny the ability to do so. But any individual working there knows when they’re getting good ones consistently and when they’re getting bad ones. There are a few factors that seem to influence the amount of good calls someone gets like working more hours for example. \n\nThe problem arises when someone is consistently getting bad calls, since there is “no way to give better calls to a specific individual” the person getting the bad ones is made to believe it’s all their fault that they’re not performing well. They’re reprimanded, lose pay, can actually become worse at their job and suffer emotional distress when in reality it’s not their fault it’s just the hand they were dealt. \n\nI guess I’m wondering if in a situation like this if it would be considered gaslighting and if there is name for something like that scenario (although I understand it is very specific). TIA for any answers.",
            "title_similarity": "0.5397079"
        },
        {
            "id": "hp999j8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hp99e4o",
            "score": 1,
            "text": "You know very well what gaslighting is. I’ve explained it to you plenty of times before. You’re only here asking again to get attention. It’s pathetic. You really just need to stop this and trust me from now on. I will protect you from everything, even yourself and your own insecurities.\n\nEdit: I typed this before reading any of the other comments. I realize that I, as per friggin usual, am late to the comment party.",
            "title_similarity": "0.58968997"
        },
        {
            "id": "hp99fi0",
            "score": 1,
            "text": "It’s nothing. Gaslighting isn’t even a thing. That’s a weird thing to even bring up, are you ok? What have you been reading?",
            "title_similarity": "0.3121281"
        },
        {
            "id": "hp99s95",
            "score": 1,
            "text": "This post again? How many times does op need to ask about gaslighting?\n\n\n\n\n\n\n/s",
            "title_similarity": "0.46529037"
        },
        {
            "id": "hp9ad6m",
            "score": 1,
            "text": "My parents main parenting strategy. But \"jokes\" aside, it basically means that people pretend that something happened that didn't, in the hope that the person being gaslighted second guesses themselves and believes what the others are telling them even though it is false.",
            "title_similarity": "0.4649093"
        },
        {
            "id": "hp9ambz",
            "score": 1,
            "text": "I already explained what gaslighting was to you last week.  Why don't you listen to me or remember what I'm saying?  What's wrong with you?",
            "title_similarity": "0.43732402"
        },
        {
            "id": "hp9aqh7",
            "score": 1,
            "text": "Yes its a form of manipulation of the mind. Someone may take your personal items and then lie about it and say you are crazy they never took it. Im going through this with some one in my life right now. Its very upsetting and unsettling. You start thinking you are going crazy. When in reality you are being manipulated.",
            "title_similarity": "0.44727445"
        },
        {
            "id": "hp9arqw",
            "score": 1,
            "text": "Can you gaslight unintentionally? One of my exes accused me of gaslighting her, but I've never tried to gaslight anyone",
            "title_similarity": "0.41106033"
        },
        {
            "id": "hp9asiv",
            "score": 1,
            "text": "Gaslighting in today’s world is continued lies and deception with the intent to redirect and misdirect another’s perception of reality with the ultimate end being control.\n\nIt can happen in subtle and not so subtle ways, but the intent is to erode someone’s sense of self. Controlling someone by systematically causing their self esteem to be in constant disaccord becomes so much easier. \n\nGaslighting is deceiving someone into believing they’re crazy.",
            "title_similarity": "0.49209294"
        },
        {
            "id": "hp9avnw",
            "score": 1,
            "text": "Their goal is to isolate you and make you look crazy and probably even get rid of you for some reason or another.",
            "title_similarity": "0.3091687"
        },
        {
            "id": "hp9bbxc",
            "score": 1,
            "text": "When you hear someone say....\n\n\"I would NEVER do that!\"\n\n\"How could you think I would do such a thing??!!!\"\n\n\"That's not what happened at all!!!!\"",
            "title_similarity": "0.16498685"
        },
        {
            "id": "hp9bcoa",
            "score": 1,
            "text": "Do people not know how to use google?",
            "title_similarity": "0.30629975"
        },
        {
            "id": "hp9bj3n",
            "score": 1,
            "text": "Gaslighting used to be used in like Sherlock Holmes terms to describe someone innocent being set up or leading an investigation to the wrong person, now it’s used by girls on Twitter to describe guys who tell them they’re exaggerating when they find out they’re getting nudes from girls in their dms",
            "title_similarity": "0.52870595"
        },
        {
            "id": "hp9bxo0",
            "score": 1,
            "text": "Gas lighting was the act of a professional person who lit the gas lights on the street circa 1920s",
            "title_similarity": "0.323155"
        },
        {
            "id": "hp9c1e4",
            "score": 1,
            "text": "- what a beautiful green sky\n- you mean blue, right?\n- no, can’t you see, the sky is green today\n- are you sure? I only see blue\n- you need to check your eyes, seriously\n- you’re pulling my leg right?\n- no really your eyes look red\n- are you serious?\n- yes I swear. something must be wrong with your eyes\n- yes, I’ve been working late a few days. but i’ve never heard of green skies\n- what? are you okey? everybody knows the sky is green sometimes\n- you mean this is something i’ve missed all these years?\n- yes something is not right with you. you may have an cognitive or a memory issue. this is common knowledge. \n- that’s so strange\n- maybe it’s early on-set dementia\n- i suppose you are right. I appreciate you telling me about it....\n\nContinued day after day, week after week, month after month....\n\nBe grateful gaslighting has not happened to you in real life.",
            "title_similarity": "0.5152228"
        },
        {
            "id": "hp9c583",
            "score": 1,
            "text": "Slang has really gone downhill what happened to dope or da bomb ???",
            "title_similarity": "0.39136672"
        },
        {
            "id": "hp9c58e",
            "score": 1,
            "text": "I already told you this. Why are you asking again?",
            "title_similarity": "0.32539827"
        },
        {
            "id": "hp9c9tz",
            "score": 1,
            "text": "Why are you asking us? You know what gaslighting is. You’re the one who taught it to us. Or do you not remember? You must be losing your mind!",
            "title_similarity": "0.4987971"
        },
        {
            "id": "hp9ca4j",
            "score": 1,
            "text": "The best visual example I know of gaslighting is [this scene from Star Trek. ](https://youtu.be/wjKQQpPVifY)\n\nTrying to make someone believe that their reality is false, while narrating your falsehoods as truth.",
            "title_similarity": "0.54969573"
        },
        {
            "id": "hp9cj5v",
            "score": 1,
            "text": "It’s nothing, don’t worry about it... I don’t even think that’s a term... stop making up words.",
            "title_similarity": "0.14227967"
        },
        {
            "id": "hp9coye",
            "score": 1,
            "text": "Lots of people above have given great definitions. I had an ex who was an absolute master at gaslighting. The only way I can describe it is being in a cult of two. He would work for months on planting a “truth”. For example, he had me convinced he was at my birth in the form of an angel. And I began to truly “remember” it. \n\nBut it’s more than being convinced of something, it’s more like your entire perception of reality shifts. For me it took years to get to a point where my mind was almost completely moldable, but it was terrifying, not being able to trust your own memories. I was a smart and grounded teenager, with no history of psychosis or mental illness. I believe it could happen to anyone.\n\nThis was before the word gaslighting popular in the vocabulary of the general public. I remember when, years after we broke up, I heard that word and looked it up and just cried and cried when I learned what it meant. There was a name for it, others had gone through it. I’m so thankful more people are aware of it now, so they can identify it early and get the fuck out.",
            "title_similarity": "0.6018126"
        },
        {
            "id": "hp9d0os",
            "score": 1,
            "text": "It's where I make you think you're living in a certain reality for a long period of time, but really you're not, I just convinced you that you are through intentional skullduggery.",
            "title_similarity": "0.50407493"
        },
        {
            "id": "hp9d2bi",
            "score": 1,
            "text": "Dude, we've already explained this to you. Wve explained it so many times. We shouldn't have to tell you again. You already know this.",
            "title_similarity": "0.51217437"
        },
        {
            "id": "hp9d7iy",
            "score": 1,
            "text": "Intentionally setting someone off by telling them that a conflict one is pushing on them doesn't exist, or they are over reacting, or crazy for bei g upset by something.\n\nIn practical terms, a boyfriend might be havi g a relationship with another girl, but as part of a power play, leaves evidense to incite his main girlfriend, but plays the situation off as her over active imagination. Sparking her to react with hostility, this would be classic gaslighting. \n\nCould easily be the other way around of course",
            "title_similarity": "0.41326654"
        },
        {
            "id": "hp9dtgo",
            "score": 1,
            "text": "You don't know what gaslighting is?\n\nUhm, yes you do.",
            "title_similarity": "0.34744373"
        },
        {
            "id": "hp9e4dn",
            "score": 1,
            "text": "Let's say you see your wife kissing a coworker at your office Christmas party. You're shocked and hurt, and don't know how to react, so you just stand there stunned for a second. Your coworker sees you and pulls your wife out of your sight line and into a room with people.\nYou follow and tell your wife you two need to talk. You ask her what's going on. She pretends she doesn't know what you're talking about. You say that you caught her kissing your coworker.\n\nThen she says she's been in that common room with the large group of people all night. You must have seen him kissing someone else. Also, haven't you had a few drinks? And weren't you smoking a cigarette while some other coworkers were hitting a joint outside? Maybe that joint was laced with something weird, that one coworker is kind of sketchy. It feels like maybe you aren't in the best place to be sure that was her you saw. You two should go home, she'll drive since you're a little drunk. You aren't a little drunk, but you're mad and also want to leave, so you can talk about this more.\n\nAll night you argue, and all night she denies. You talk about breaking up, she calls you crazy and gets angry. You're angry too, but eventually you decide to sleep on the couch and deal with the logistics of probably breaking up the next day.\nAt first you're so sure. But then...you aren't. The next day, the memory is a little more faded. It was dark in that side room. If you ask your coworker, he'll probably deny too. So there's no point in asking him. Should you ask some other people that were in the common room? But then if you're wrong, or they didn't see, you'll look like kind of a crazy person in front of other coworkers.\n\nBehind all of this, there's a big part of you that doesn't want this to be happening. Deep down, you kind of hope you're wrong. And eventually, you start to believe it. The more time passes, the more the memory fades, the less certain you can be. Your wife, meanwhile, is steadfast and resolute in her rightness, and angry at you for questioning her fidelity. Maybe you'll always sort of know what you saw, but you'll never be able to really talk about it without sounding crazy and you'll never act on it.\n\nThis is gaslighting.",
            "title_similarity": "0.427357"
        },
        {
            "id": "hp9e7bv",
            "score": 1,
            "text": "It's when all the people you know get together and try to trick you into believing your memories or your perception of the reality are incorrect, either as a prank or for more nefarious reasons.",
            "title_similarity": "0.54984874"
        },
        {
            "id": "hp9ecya",
            "score": 1,
            "text": "Gaslighting is a crappy thing to do to someone, and if you dont believe its a \"thing\" then you've either never been gaslighted or you ARE a gaslighter.",
            "title_similarity": "0.37725884"
        },
        {
            "id": "hp9erxm",
            "score": 1,
            "text": "Secondarily, how do you know whether it's gaslighting or poor memory?",
            "title_similarity": "0.30409575"
        },
        {
            "id": "hp9esem",
            "score": 1,
            "text": "Short description: When someone makes statements that are extremely unbelievable, and is also so convincing (through various methods) that it makes you question reality itself and believe that your perceptions are wrong.\n\nEventually, you are much easier to convince of *anything* that someone tells you, because you don't have any trust in your own perception.\n\nExample: I tell you that it's your fault that a cup fell on the floor and broke. You know that you didn't do it, because you saw someone else bump the table, and knock the cup on the floor. However, because I am either very charismatic, very insistent, or simply abusive, you start to believe that it's actually your fault - maybe you think that the other person knocked it off because of something you did, or maybe you even start to think that your memory is simply wrong.",
            "title_similarity": "0.6085825"
        },
        {
            "id": "hp9f3eb",
            "score": 1,
            "text": "It’s when someone tells you what you are feeling,seeing, hearing, or experiencing is not true.",
            "title_similarity": "0.26370126"
        },
        {
            "id": "hp9fqwy",
            "score": 1,
            "text": "I’ve always thought it was when someone wrongs you and then they flip it around to making you the bad guy and/or making you look crazy for your reaction to their wrong doing. Am I wrong??",
            "title_similarity": "0.4585034"
        },
        {
            "id": "hp9g3bj",
            "score": 1,
            "text": "When I was in the mental health system I had a lot of mean professionals gaslight me and blame it on my bipolar disorder and said I was hallucinating thing that didn't happen and I was abused in jail and tried to talk about it and they said no your crazy. But later on in my life I told someone about the stories in rehab and he told me they were gaslighting me and.told me about this movie and it made me.feel such relief after that cuz I understood it",
            "title_similarity": "0.54954946"
        },
        {
            "id": "hp9gvy1",
            "score": 1,
            "text": "Thanks for posting this, i always wondered what gaslighting is but never bothered finding out myself",
            "title_similarity": "0.5995941"
        },
        {
            "id": "hp9gzc2",
            "score": 1,
            "text": "Lee hom, is this you?",
            "title_similarity": "0.12234549"
        },
        {
            "id": "hp9gzdx",
            "score": 1,
            "text": "I already explained this to you. Don’t you remember?",
            "title_similarity": "0.3061967"
        },
        {
            "id": "hp9hdqb",
            "score": 1,
            "text": "Gaslighting isn’t fucking real. Complete falsehood. Anyone who tells you anything about gaslighting isn’t telling the truth and doesn’t have your well-being at heart",
            "title_similarity": "0.34986806"
        },
        {
            "id": "hp9ihj6",
            "score": 1,
            "text": "Stop asking.  You posted this last week.  And twice the week before, and we're all getting tired of it.",
            "title_similarity": "0.39084163"
        },
        {
            "id": "hp9jbr4",
            "score": 1,
            "text": "Example: Don't Believe the people here that say that gaslighting has anything to do with lies or misinformation.\n\nGaslighting is when you re-light a stove (or sometimes water heaters) pilot light.\n\nIt's as simple as that and always has been.",
            "title_similarity": "0.43500984"
        },
        {
            "id": "hp9jiub",
            "score": 1,
            "text": "Gaslighting was a once useful psychological term that became popular and now kids on sm use it whenever they don't have a legit counterargument.",
            "title_similarity": "0.5982901"
        },
        {
            "id": "hp9jnbi",
            "score": 1,
            "text": "Whatever China is doing in this story: \"Chinese tennis star Peng denies that she made accusation of sexual assault\"\n\nVanished tennis star comes back and recants story about misconduct by someone high up? Yeah, totally believable.",
            "title_similarity": "0.41853064"
        },
        {
            "id": "hp9jogy",
            "score": 1,
            "text": "Isn’t a car salesman gaslighting to some degree?\n\n“Beautiful day, isn’t it?”\n\n“How ‘bout that game last night?”\n\n“Isn’t this car a beauty?”\n\nYou’ll learn to just keep saying yes.",
            "title_similarity": "0.5098973"
        },
        {
            "id": "hp9jufm",
            "score": 1,
            "text": "How many lights do you see?",
            "title_similarity": "0.27553445"
        },
        {
            "id": "hp9kq1t",
            "score": 1,
            "text": "Gaslighting? Wow babe that’s a big word",
            "title_similarity": "0.50311476"
        },
        {
            "id": "hp9l0c8",
            "score": 1,
            "text": "u/pwa09, why are you asking this question again? I talked to some of your friends and they remember explaining it to you. Infact, they remember you explaining it to them. Is this some kind of attempt to whore karma, or are you just trying to hit the front page with pointless questions again? \n\nIf you actually dont remember having asked this question before, maybe we should go to the hospital and have your head checked. Have you ever forgotten why you entered a room as soon as you got there? Is it happening more frequently these days? When was the last time it happened? You cant remember? Thats not good man... In fact, I'm sure something is going on with you. Im concerned for you. Ive noticed some concerning changes in your personality lately that I can't just chock up to stress. \n\n/that's gaslighting. In reality its way more subtle over a much longer time, and is typically done by people who have worked to earn your trust first.",
            "title_similarity": "0.5776978"
        },
        {
            "id": "hp9l76g",
            "score": 1,
            "text": "I was in a relationship in which my ex was cheating on me pretty much the whole two years. Towards the end of it, HE accused ME of accusing him of cheating, when I never said that (I was so deep in denial.) He made me feel like I was reacting crazy and he was simply out riding his motorcycle from the time I went to bed until I woke up. \n\nBut karma got him. He (31 at the time) messed with the wrong 14 y/o and got himself tossed in prison and labeled a sex offender for life.",
            "title_similarity": "0.415479"
        },
        {
            "id": "hp9lqlf",
            "score": 1,
            "text": "Telling someone that something isn’t happening and it’s all in their head when you know damn well it is happening, usually with the intention to manipulate them",
            "title_similarity": "0.2401624"
        },
        {
            "id": "hp9lw7q",
            "score": 3,
            "text": "The misuse of the term means 'to convince someone he logic they use is wrong because they think wrong' which is not what it is. Gaslighting, as in the movie where the term comes from, is to make a person disbelieve their eyes, ears, and mind work properly altogether. In the movie a man made a woman see lights flicker, and hear strange sounds, and observe that things were disappearing, but he insisted none of it was happening.  \nJust convincing someone they use faulty logic or to disbelieve evidence isn't gaslighting, you have to shake their faith in their own ability to perceive, think, and remember.",
            "title_similarity": "0.41668707"
        },
        {
            "id": "hp9m7f3",
            "score": 1,
            "text": "Is gaslighting always deliberate? Or is it possible that sometimes a person exhibits some of these behaviours without meaning to gaslight the other person?",
            "title_similarity": "0.32100448"
        },
        {
            "id": "hp9meyc",
            "score": 1,
            "text": "My ex would do the same thing.. I had to record and get HARD evidence that put her in her lie before she would confess… it took me 3 years to catch her… she had me questioning my own reality like I was the bad guy but I knew if I could just get some hard evidence that she was cheating on me I could walk away knowing the truth… I had to take our iPad clear out the memory. Put it on video upside down under our entertainment center..go to work for 12 hours.. wait until she left for a long time and just listen to every minute of the 12 hours it recorded to hopefully get a glimpse of her doing what I thought she did… finally I had my proof.. confronted her.. she had 5 friends step in and try to lie for her too.. like they concocted this “grand situation” and I waited.. I let them come up and state the full thing.. then I played the recording that I saved on my phone I front of all of them… and they shut down… SHUT DOWN. She even tried to say it wasn’t her that did it!!! PAAAAHHHLEEESE.. it messed me up mentally.. I still don’t trust anyone.",
            "title_similarity": "0.4899751"
        },
        {
            "id": "hp9mk7l",
            "score": 1,
            "text": "I've experienced this first-hand to the fullest, was able to finally figure it out, and noped the fck out",
            "title_similarity": "0.52865916"
        },
        {
            "id": "hp9mnui",
            "score": 1,
            "text": "*Bob smokes Jon’s weed \n\nJon - did you smoke my weed? \n\nBob - No, you’re always high and prob don’t remember smoking it kinda like how you always lose your keys \n\nJon - ….but I swear I had a gram left \n\nBob - dude you need to smoke less weed it’s starting to affect your memory \n\nJon - yea I guess you’re probably right…",
            "title_similarity": "0.5012118"
        },
        {
            "id": "hp9o2b3",
            "score": 1,
            "text": "The most overused word for psudo-intelectuals and has fallen into the same cringe category as \"gamechanger\"",
            "title_similarity": "0.46868974"
        },
        {
            "id": "hp9o8m9",
            "score": 1,
            "text": "To OP question, most responses have been about the movie. However, gaslighting is real abuse. It happens in relations and all too often in the workplace.\nVery recently I had a boss who was gaslighting me. He would give orders to do one thing, then weeks later would deny it entirely. I had to start asking for everything via email. Then he started with the “don’t you trust me” language. \nWhen I called him out on it, I was “twisting” his words. \nAnother way bosses use gaslighting is they promise rewards down the road with no intention of ever following through.\nIt’s abuse. Plain and simple.",
            "title_similarity": "0.60874236"
        },
        {
            "id": "hp9ohtw",
            "score": 1,
            "text": "Like your five? It’s Mother Gothel from Tangled. [Cinema Therapy](https://youtu.be/Efua__7B7j4) does a great video on it. But in simple term, it’s making a person doubt themselves through various conversational tricks. Many are psychological, but they all result in the victim turning dependent on the gaslighter in an unhealthy way.",
            "title_similarity": "0.5890922"
        },
        {
            "id": "hp9om91",
            "score": 1,
            "text": "It's a form of manipulating someone repeatedly so that they begin to distrust their own memory and senses. For example, the victim correctly remembers something, like loaning the manipulator $50, but the manipulator convinces them it was only $20. \"It was a $20 bill, not a $50 bill. You're remembering it wrong, or maybe you need to get your eyes checked.\"\n\nRepeat again for smaller details, or slowly change something until a drastic change is complete. If they notice, convince them it's always been this way. For example, slowly move the sofa everyday until it's across the room, and if the victim notices, convince them it's always been in this spot.",
            "title_similarity": "0.5220617"
        },
        {
            "id": "hp9p1f0",
            "score": 1,
            "text": "You KNOW what gaslighting is.  We have already been through this, you just don’t remember asking and having all of us tell you.  You never remember correctly.  You always forget things like this, and it’s really annoying.  You should try to do a better job remembering.\n\n\nThat.  That’s gaslighting.",
            "title_similarity": "0.55360043"
        },
        {
            "id": "hp9p8gf",
            "score": 1,
            "text": "“Gaslighting isn’t real. You made it up because you’re fucking crazy”\n-a joke from Rick and Morty that also explains it perfectly",
            "title_similarity": "0.534277"
        },
        {
            "id": "hp9plal",
            "score": 2,
            "text": "The only problem it that before this the only logical option and choice given at the time is to promise to do whatever they say and know the whole time you can't fulfill said promise. That's how my step mom would be about me promising to turn in all my homework at school. Every year before the year started she would \"make\" me promise to do everything right and be perfect that year. And when it did go like she wanted it would be used against me during the summer. Yeah school punishments carried over to the summertime. That's how I'm like 89% sure I spent the two full 365s grounded In my fourth and fifth grade years.",
            "title_similarity": "0.4097118"
        },
        {
            "id": "hp9qa90",
            "score": 2,
            "text": "Have you heard the joke about the gas lighter?\n\nWhat do you mean, no? I've told it to you.\n\nYes I have, you must not remember. What a surprise.\n\nYes, I specifically remember telling you about it. Your memory is acting up again.\n\nThe above is a seemingly innocent example of gaslighting. Even if it isn't malicious, it's done to make you doubt your recollection and believe mine, thereby elevating your opinion of me as reliable. It's insidious because the more it is done, and successful, the more you'll doubt yourself and lean on me to make your decisions for you.",
            "title_similarity": "0.616502"
        },
        {
            "id": "hp9qfs2",
            "score": 1,
            "text": "Gaslighting is when you manipulate someone into believing something that isnt true.\n\nI a relationship someone could do it through repeatedly saying the same thing.\n\nOr alternatively a social media site could ban & censor eveeyone holding a certain opinion in order to create an artificial consensus.",
            "title_similarity": "0.50347173"
        },
        {
            "id": "hp9qu9i",
            "score": 1,
            "text": "I had to google gaslighting after reading that post about that girl who got in trouble by her parents for drinking and she made money by selling her book online 😂",
            "title_similarity": "0.5086022"
        },
        {
            "id": "hp9srzh",
            "score": 1,
            "text": "What is the opposite of gaslighting? When you live with someone who is actively rewriting history, forgetting events that put them in a bad light (but not the events that came as a consequence)?\n\nI guess it’s a narcissist’s trait to need to be the good guy in their own story, so they bend the narrative to support that?\n\nIt can be extremely difficult to be around such a person, and I get accused of gaslighting a lot, which is really frustrating. But family is family.",
            "title_similarity": "0.56115675"
        },
        {
            "id": "hp9wi40",
            "score": 1,
            "text": "It seems like if ever you get into a disagreement with someone, it is a modern technique to say \"You're gaslighting me\".\n\nIt gives them a powerful advantage because they immediately become a \"victim\". They become the good one...you are the bad one...Most people don't really understand what it means so can't defend themselves against this accusation.\n\nReality is more nuanced, fault usually lies with both parties in any argument.",
            "title_similarity": "0.6552841"
        },
        {
            "id": "hp9wwsy",
            "score": 1,
            "text": "/u/pwa09 ,I have already explained what gaslighting is to you a DOZEN times!  Don’t pretend you don’t know what it is.  You’re better than that.",
            "title_similarity": "0.65491503"
        },
        {
            "id": "hpa0m64",
            "score": 1,
            "text": "You're standing on a pile of sand.\n\nSomeone you trust pushes you to the left twice, the right once, left three times, right three times. They keep at it, over and over. Random direction. Random amount of times.\n\nWhen they stop, you try to figure out where you're standing relative to where you started so you can navigate where you want to go. \n\nYou can't. \n\nThe person you trust comforts you and tells you exactly where you are standing and that it's solid ground and not sand. \n\nAnd you believe them because you're confused, disoriented and trust them. \n\nOr you don't believe them and start walking in the direction you wanted to go and they repeat the whole process all over again until your legs are so tired you can't stand anymore.",
            "title_similarity": "0.4827447"
        },
        {
            "id": "hpa0nl5",
            "score": 1,
            "text": "It's when somebody acts like whatever happened wasn't really the way things happened and try to make you think you remember wrong/ you're crazy/ or even just distract your attention so you don't think about it anymore, in order to avoid taking responsibility for their actions of course.",
            "title_similarity": "0.33138543"
        },
        {
            "id": "hpa0tig",
            "score": 1,
            "text": "Something to look out for: when a manipulative person convinces you that *you* are the manipulative person. We tend to think of family members and significant others engaging in this sort of behavior, but bosses fucking *love* to do this too.",
            "title_similarity": "0.586608"
        },
        {
            "id": "hpa1700",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hpa264p",
            "score": 1,
            "text": "Haha, you know what gaslighting is, stop playing. Something wrong with your memory, or what?",
            "title_similarity": "0.30441397"
        },
        {
            "id": "hpa3w9s",
            "score": 1,
            "text": "So after reading all the explanations, is shutter island just a movie about how they gaslight leonardo into believing that he was a prisoner?",
            "title_similarity": "0.47862497"
        },
        {
            "id": "hpa51jj",
            "score": 1,
            "text": "You'll notice a lot of people saying that anyone who they think is lying to them is \"gaslighting\" them. This is the normal process for the dilution and confusion of a word's meaning, when saying the word is fun and makes you feel smart.",
            "title_similarity": "0.6749307"
        },
        {
            "id": "hpa5kwt",
            "score": 1,
            "text": "i didn’t understand it from context until someone i was asking made it clear that gaslighting can be fully intentional, or not at all. someone unable to believe the truth with gaslight by repeating the falsehood or distorted reality they observe to others. i have been on both ends of it in my past. in my case, i was misled, in many ways by myself. in such a case, its less an intentional lie, and more of a distorted understanding of reality. if you don’t see the truth, its hard to communicate it. i personally avoid actually reporting what i know to be false as truth.\n\non the recieving end, it can be pretty hard to tell if someone is doing it to you intentionally or not. personality disorders make it hard to be in touch with reality. i think a lot of gaslighters have trouble understanding the truth, and can end up convinced of their distorted understanding.\n\nso does the intentional gaslighter exist? i’m sure, i was just never one of them. i believe i’ve been victim to this, but being the recipient, its hard to ever be sure.",
            "title_similarity": "0.5441078"
        },
        {
            "id": "hpa61yi",
            "score": 1,
            "text": "Star Trek The Next Generation Season 6 Episodes 10 and 11 (\"Chain of Command\") was a great example of gaslighting, if you want to see it in action. The movie that gave the name to the act of gaslighting is a pretty interesting watch too (\"Gaslight\" 1944) for a black and white film. I found that watching these allowed me to say \"hey now, the antagonist is lying but the victim(s) can't see it\" and realized that this is exactly how it is supposed to work 😕 queue dealing with past trauma.",
            "title_similarity": "0.61638385"
        },
        {
            "id": "hpa6tk5",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hpa7bcj",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hpaaoha",
            "score": 1,
            "text": "What are peoples thoughts on wether gaslighting is always intentional? Or do you think some people do it and don’t realise, because they genuinely believe what they are saying is true?",
            "title_similarity": "0.5742638"
        },
        {
            "id": "hpaauer",
            "score": 1,
            "text": "You don't need to know about gaslighting, sweetie. It's not something worth learning about.",
            "title_similarity": "0.16575165"
        },
        {
            "id": "hpab2gr",
            "score": 1,
            "text": "There is no such thing as gaslighting. Stop making up words to make yourself seem important!",
            "title_similarity": "0.19590288"
        },
        {
            "id": "hpabb3i",
            "score": 1,
            "text": "What are you talking about, I've explained gaslighting to you multiple times now. You must be losing your mind. \n\nThat's gaslighting.",
            "title_similarity": "0.5798036"
        },
        {
            "id": "hpabk1g",
            "score": 1,
            "text": "Well, according to most people on this website, everything is. For all I know, I might be gaslighting you now.",
            "title_similarity": "0.6429492"
        },
        {
            "id": "hpac2xj",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.049290873"
        },
        {
            "id": "hpac73e",
            "score": 1,
            "text": "I hope all these explanations help someone, anyone notice the signs. I suffered it for over 3 years until I knew what it was and how it was achieved. The relief now is amazing, I am now free and I hope other people get the same freedom from this post.",
            "title_similarity": "0.58963996"
        },
        {
            "id": "hpae2lw",
            "score": 1,
            "text": "It's like Fox News hosts frantically texting Meadows that he needs to tell the Orange to step up and stop his deranged sycophants but on their shows, try their damnedest to convince everyone that they heard it was Antifa.",
            "title_similarity": "0.5187768"
        },
        {
            "id": "hpaea88",
            "score": 1,
            "text": "*Gaslighting would be if I said it is a historical form of lighting based on natural gas, and that's all it is.  It doesn't have any other meaning.  You're crazy to think it has any other meaning.  You always come up with these weird definitions of words that don't make any sense.  Why do you do that all the time?  Do you even English, bro?  You need to stop believing everything you hear on the internet and listen to me instead.  I'll keep you safe.*\n\nSomething like that italicized paragraph would be gaslighting.  Some kind of lie, but one structured to make the person who knows the truth question their own sanity and for the person pushing the lie to steer your perception of the world by falsely maintaining the lie even if they actually know the truth too.\n\nIt can expand to situations where the liar creates evidence of a \"false truth\", like if I went onto the wikipedia page for \"gaslighting\" and edited it to eliminate anything but the literal meaning, or if I rigged up my home router so that it provided you a false page if you tried to look it up, or if I winked at my friends and got them to go along with it.  It's basically about manipulation and control of the target rather than merely lying.",
            "title_similarity": "0.5984837"
        },
        {
            "id": "hpaegm6",
            "score": 1,
            "text": "Imagine someone punches you. Immediately after, when you say \"why the fuck would you punch me?\" They blame you. It can be \"well you should have seen it coming\" or \"you're a big strong man, you could have stopped it\" or \"why were you stupid enough to let it happen.\n\nOr, you get in to a fight with your partner, and they tell you \"maybe you would be better off without me.\" Essentially blaming the reason for the tension on you. Sure, it sounds like they're taking the blame, but in actuality they are trying to both shift focus away from whatever real problem caused the fight, and shift the blame for it on to you. You have a problem with them, whatever it is, which means really the fight is your fault for having that problem with them /s.",
            "title_similarity": "0.47000474"
        },
        {
            "id": "hpaehsh",
            "score": 1,
            "text": "why do you want to know it all over again? did you forget about the last post you made already?  you're so stupid. \n\n.......but we all love you and it's okay to slip up once or twice, just take your meds regularly.",
            "title_similarity": "0.64887196"
        },
        {
            "id": "hpaf18c",
            "score": 1,
            "text": "“I already told you what gaslighting means” would be an example of gaslighting. Obviously I never told you, but now I will claim that I did, to make you doubt yourself and to shrug off any responsibility",
            "title_similarity": "0.45237052"
        },
        {
            "id": "hpafeba",
            "score": 1,
            "text": "I explained last week, don't you remember?.",
            "title_similarity": "0.18745822"
        },
        {
            "id": "hpahcf1",
            "score": 1,
            "text": "I think it actually doesnt exist in a meaningful way.\n\nI think if somebody (A) accuses someone else (B) of ‘gaslighting’ then probably its more likely that A has actual psychological problems than B going through all the trouble to ‘gaslight’ A. \n\nOr even less complicated: bad communication, not every misunderstanding / different viewpoint is an attempt to destroy your mind.",
            "title_similarity": "0.45244363"
        },
        {
            "id": "hpahwz4",
            "score": 1,
            "text": "My girlfriend will often persistently ask me if I'm okay , and then she will repeat, and then she will say \"well, you don't seem fine, you were fine this morning and now you're all quiet and you don't seem yourself\" \n\nIs this gaslighting ? Please help .",
            "title_similarity": "0.54109484"
        },
        {
            "id": "hpairei",
            "score": 1,
            "text": "Its when inflation is going up along with gas prices and you see you cannot afford things you used to be able to buy but all the talking heads tell you it's good for you to be broke.",
            "title_similarity": "0.5029967"
        },
        {
            "id": "hpaixs2",
            "score": 1,
            "text": "It’s a bullshit fad term that stupid people use to sound smart. People use it to replace lying. \n\n“You aren’t gaslighting me, you’re just lying”. \n\nDon’t worry, it’ll go away soon.",
            "title_similarity": "0.46088865"
        },
        {
            "id": "hpaj8gs",
            "score": 1,
            "text": "In a nutshell it's creating cognitive dissonance in a target.  That is, two possible realities existing simultaneously inside a person's mind and through a series of manipulations nudging them away from the reality that they can perceive for themselves and enforcing a false narrative.  It is helpful to see real life examples of gaslighting:\n\nQAnon.\n\n\"I did not have sexual relations with that woman.\"\n\nSandy Hook was done by crisis actors.\n\nTrickle down economics.\n\nGay marriage will lead to bestiality and turning kids gay.\n\nWearing masks takes away your freedom.\n\nMy point being that if you think that you aren't a victim of gaslighting, well, you're probably wrong about that.",
            "title_similarity": "0.48048645"
        },
        {
            "id": "hpaj8x3",
            "score": 1,
            "text": "One of the most used examples of gaslighting I've seen countless times\n\n\"The Earth is flat and you'd be mental to believe otherwise\".\n\nIt's one of their most popular tactics of many.",
            "title_similarity": "0.66199625"
        },
        {
            "id": "hpakq8c",
            "score": 1,
            "text": "Gaslighting? Dude you need to stop making up words, do you know how crazy you sound?",
            "title_similarity": "0.38713473"
        },
        {
            "id": "hpakxcv",
            "score": 1,
            "text": "Reading these responses, ya'll clearly forgot what the sub name is. Words like manipulation, perception, hallucinating...just explain it like they're five.",
            "title_similarity": "0.4712332"
        },
        {
            "id": "hpal4i6",
            "score": 1,
            "text": "Most of the conversations that Shiv has with Tom in Succession.  She’s a master gaslighter.",
            "title_similarity": "0.60956633"
        },
        {
            "id": "hpalwm9",
            "score": 1,
            "text": "It’s essentially saying to someone “The thing you thought happened is wrong, and you’re insane for thinking that”",
            "title_similarity": "0.33620727"
        },
        {
            "id": "hpaly52",
            "score": 1,
            "text": "Originally known as “mind touch”, the Jedi mind trick allows the practitioner to control the thoughts, behaviors, and actions of the affected. The most well-known version was likely “These aren’t the droids you’re looking for,” spoken by Obi Wan Kenobi when stopped by stormtroopers on Tatooine. The troopers immediately repeat “these aren’t the droids we’re looking for” and instruct them to move along. The Jedi mind trick requires great power and use of the force to produce such instantaneous results. Modern wannabe Jedis attempt to control weak-minded others by repeating lies over and over in an effort to trick the subject into believing the lies by questioning their own reality. The stronger the lie and the weaker the mind the more effective the mind control. May the force be with you.",
            "title_similarity": "0.51616377"
        },
        {
            "id": "hpamh5n",
            "score": 1,
            "text": "**Lying** is trying to make you change your mind using false evidence.\n\n**Gaslighting** is trying to make you change your mind **AND doubt your own judgement** using false evidence.  \n\nThis attack is more personal, because part of the target/goal is to undermine your future decision making process.",
            "title_similarity": "0.39905846"
        },
        {
            "id": "hpamnb0",
            "score": 1,
            "text": "Republic politics. \"I won the election\". \"So much voter fraud\".\n\nIt's repeating the same false hoods until the person can't see the false narrative.",
            "title_similarity": "0.47759318"
        },
        {
            "id": "hpan0a7",
            "score": 1,
            "text": "Gaslighting is something being done to me right now by three different guys that claim to love me",
            "title_similarity": "0.63342285"
        },
        {
            "id": "hpaorbi",
            "score": 1,
            "text": "Telling patients healthcare costs are going up for organic market trends while multinational corporations are engaging in market manipulation.",
            "title_similarity": "0.41505894"
        },
        {
            "id": "hpap8ng",
            "score": 1,
            "text": "Form of Emotional Abuse. Manipulation to make you doubt yourself or think you’re crazy. \n\nTypical answers from someone who’s gaslighting you : \n\nThat never happened.\" ...\n\"You're too sensitive.\" ...\n\"You have a terrible memory.\" ...\n\"You're crazy — and other people think so, too.\" \n\"I'm sorry you think that I hurt you.\"\n\nSigns of gaslighting\nfeel confused and constantly second-guess themselves.\nfind it difficult to make simple decisions.\nfrequently question if they are too sensitive.\nbecome withdrawn or unsociable.\nconstantly apologize to the abusive person.\ndefend the abusive person's behavior.",
            "title_similarity": "0.5314607"
        },
        {
            "id": "hpapa4s",
            "score": 1,
            "text": "If you think White Nationalism is a legitimate problem and don't realize blacks murder, rape, and rob whites at almost 10x the rate whites victimize blacks (including all police interactions),  you're a victim of gaslighting.",
            "title_similarity": "0.46844387"
        },
        {
            "id": "hpapevl",
            "score": 1,
            "text": "There's no such thing as gaslighting, what are you talking about, are you crazy or something?",
            "title_similarity": "0.22273043"
        },
        {
            "id": "hpaq7nh",
            "score": 1,
            "text": "I've read a few books and articles about memory which illustrate that we synthesize much of what we remember; i.e. we actually only store a small bit of information and then on recall we 'fill in the blanks'. \n\nShort of recording the event we seek to recall, how can we be sure that we're remembering things correctly?\n\nFor example, I'm giving directions from the passenger seat and say \"Take the next right\" and the driver goes left. I'm sure I said \"right\" and the driver is sure I said \"left\". I have a memory of myself saying \"right\".\n\nMemory is a fickle thing tied strongly to perceptoins and I don't trust it.",
            "title_similarity": "0.5443746"
        },
        {
            "id": "hpaql6l",
            "score": 1,
            "text": "I've been gaslit by covert narcissist guys and women before\n\nAbusive toxic people who only abuse when they feel like they can get away with it & want to control someone just for the sake of it, they hide it completely when they feel like they have no power or authority in the situation & pretend to be good human beings.\n\nGaslighting normally happens in a more personal setting, a relationship with someone you're connected to somehow. Maybe a boyfriend, a girlfriend, an old friend, a family member. \n\nThey do \\*\\*\\*\\*ty things then convince you that you're actually the bad guy in the scenario to make you feel bad about it all! \n\nIts very dangerous and predatory behavior, you have to protect yourself if you're being gaslit.",
            "title_similarity": "0.5179846"
        },
        {
            "id": "hpaqood",
            "score": 1,
            "text": "I understand what it is from the comments, but can anyone give me an example of how and when it’s used in say, a political debate or argument?",
            "title_similarity": "0.5224961"
        },
        {
            "id": "hpar998",
            "score": 1,
            "text": "Its when someone makes you question your own ability to understand reality.\n\nLets take an example scenario. You do some mental calculations 12+15 and come up with 27. Then someone keeps insisting its 28. And they keep inventing more lies to explain youre wrong. And you start doubting if youre able to count.",
            "title_similarity": "0.50622743"
        },
        {
            "id": "hparig2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hparlzf",
            "score": 1,
            "text": "The entire Democratic Party in the USA telling their fellow Democrats with a straight face that they believe that Joe Manchin is actually a Democrat too and definitely not a Republican who fooled his way into a Democrat primary to get elected as a wolf in sheep's clothing.",
            "title_similarity": "0.28591526"
        },
        {
            "id": "hpasgb9",
            "score": 1,
            "text": "So what if she does?",
            "title_similarity": "0.036402315"
        },
        {
            "id": "hpasjxc",
            "score": 1,
            "text": "Thanks for this coincidental post. It reminded me of why I broke up with my ex. I was just thinking about whether I fucked up ending it but then this reminded me she frequently gaslight me.",
            "title_similarity": "0.51275885"
        },
        {
            "id": "hpaspxm",
            "score": 1,
            "text": "It's the word that has been overused so much by people not wanting to deal with the fact that maybe they just have shitty communication skills and misunderstand because they aren't actually paying attention to conversations.\n\nGaslighting is a thing that actually happens.\n\nPerson hides keys after someone comes home.  Tells friend / lover / whomever else \"where are the keys?  you said you were taking the keys, why didn't you put them back?\"\n\nThen 'finds' the keys and tells the person that they're so forgetful and how would they function without them.  Usually in a fake loving / joking tone.\n\n All with the intention of making this person doubt their own senses and ability to make judgments in order to manipulate them further down the line.   Often escalating in the severity of the manipulation.\n\nGaslighting is NOT:\nThe speaker poorly communicating feelings or wants.\nThe speaker actually thinking they said or did something when they didn't, or vice versa.\nIf the listener actually does in fact have a really shitty memory and / or doesn't pay attention during conversation.\nTwo people not being on the same page when it comes to understanding what words and phrases and tones of voice actually mean.\n\n Gaslighting is one of the most overused phrases in modern social dialog.  As near as I can tell most of the time when people say the word, they aren't even remotely accurate in describing the thing as gaslighting.  It has become the new go to buzzword.\n\n That's not even to say that a misuse of the word gaslighting means that there's no problem going on at all.   But when people accuse someone of something they aren't actually doing, like accusing them of gaslighting when they aren't? That ironically is a form of gaslighting.\n\n Also people in the comments below need to be way more careful when they use the word abuser.  I'm seeing a whole lot of cases where couples just suck ass communicating.  There's a whole lot of overusing the word abuse and there's a whole lot of overusing the word gaslighting.",
            "title_similarity": "0.43432364"
        },
        {
            "id": "hpasyio",
            "score": 1,
            "text": "I recommend you this video on Cinema Therapy, they explain gaslighting though the movie Tangled. \nhttps://youtu.be/Efua__7B7j4",
            "title_similarity": "0.48410708"
        },
        {
            "id": "hpath3m",
            "score": 1,
            "text": "An ex-crush of mine is also very good at gaslighting. Only the people here are lazy (or something) and refuse to make him learn how to treat women that he supposedly \"likes\" better.",
            "title_similarity": "0.51288885"
        },
        {
            "id": "hpatnz8",
            "score": 1,
            "text": "So what do you call reverse gaslighting? Where you just go along with someone else's description of events (when you know the truth)...but maybe add subtle details back into it to start to make them believe that what they are saying is true.",
            "title_similarity": "0.4874424"
        },
        {
            "id": "hpau46x",
            "score": 1,
            "text": "'Gaslighting doesn't exist, you made it up because you're fucking crazy'\n  \n  \nMy favorites example of gaslighting.",
            "title_similarity": "0.44943416"
        },
        {
            "id": "hpau8r0",
            "score": 1,
            "text": "You asked this question before, why are you asking it again?",
            "title_similarity": "0.32274842"
        },
        {
            "id": "hpavv0s",
            "score": 1,
            "text": "It’s overused and lost its original meaning. Now it just means you disagree with someone’s idea or idea about the truth. “I don’t like what this person is saying therefore they are gaslighting me.” Don’t ever say it.",
            "title_similarity": "0.43649033"
        },
        {
            "id": "hpaw16a",
            "score": 1,
            "text": "As a former victim of gaslighting, it's an attempt to change your perspective of reality and not trust your intuition though constant affirmations that what you know is wrong, even with evidence to the contrary. It's a tactic to break you down mentally.",
            "title_similarity": "0.41639787"
        },
        {
            "id": "hpawh9a",
            "score": 1,
            "text": "Say i had a red balloon as a kid i know for a fact its red. But you come in. Saying nah man it was green over and over. Finally i start to believe it wasnt red it was green. Thats gaslighting",
            "title_similarity": "0.54780674"
        },
        {
            "id": "hpawvnn",
            "score": 1,
            "text": "Don't pretend like you don't know. You asked the same question last week and we all replied then too. What's the matter with you? ~s",
            "title_similarity": "0.46503985"
        },
        {
            "id": "hpax8kv",
            "score": 1,
            "text": "Gaslighting? Don’t you think that’s a big word for you?",
            "title_similarity": "0.46615118"
        },
        {
            "id": "hpay0rz",
            "score": 1,
            "text": "Does anyone know if there are psychological studies in this area? Like having people look around a room filled with objects then responding to statements that may or may not be true like “the candle was red” or “there were two chairs at opposite ends of the table”? I can see it ethically being a little gray but it would be interesting to see how people’s confidence is affected in answering questions later when they’re told they’re wrong about certain things in real time.",
            "title_similarity": "0.5881771"
        },
        {
            "id": "hpay2im",
            "score": 1,
            "text": "Don't act like you don't know what gaslighting is u/pwa09. You know what it is and you're lying.",
            "title_similarity": "0.3313217"
        },
        {
            "id": "hpayucz",
            "score": 1,
            "text": "You didnt ask that question, what are you talking about.  Youre lying..........thats gaslighting simplified",
            "title_similarity": "0.33009616"
        },
        {
            "id": "hpayukn",
            "score": 1,
            "text": "I thought gaslighting was putting the blame of something onto somebody. \n\nLike if you cheated on your wife but you say \"I felt alone, you weren't giving me any attention, you are too controlling\" etc. You're shifting responsibility and your own shitty behaviour on to them. \n\nI'm seeing some different explanations though so maybe mine is wrong.",
            "title_similarity": "0.4469557"
        },
        {
            "id": "hpazgqh",
            "score": 1,
            "text": "I already told you what it is. Why are you so forgetful? Seriously you need to get mental help. I think your memory is going. You better give me your car keys just to make sure don’t misplace them.",
            "title_similarity": "0.4205745"
        },
        {
            "id": "hpazzci",
            "score": 1,
            "text": "But I already told you what gaslighting is?",
            "title_similarity": "0.32991487"
        },
        {
            "id": "hpb0rzr",
            "score": 1,
            "text": "Here is an example of gaslighting analyzed in the movie Tangled, with Mother Gothel being the gaslighter: https://www.youtube.com/watch?v=Efua\\_\\_7B7j4",
            "title_similarity": "0.38669428"
        },
        {
            "id": "hpb1dqz",
            "score": 1,
            "text": "Gaslighting is a manipulation technique where the manipulator hides his actions/behavior by convincing the victim not to trust their senses/memory.\n\nIE Manipulator steals money from victims wallet.  Victim asks manipulator if they have seen the money.  Manipulator blames victim for losing money and convinces victim that they are too careless.",
            "title_similarity": "0.33234167"
        },
        {
            "id": "hpb1r8x",
            "score": 1,
            "text": "Trying to change someone's reality with twisted ideas instead of facts. \"No I didn't rape you, you loved me so it's not rape\" is one example.",
            "title_similarity": "0.42801866"
        },
        {
            "id": "hpb1vc3",
            "score": 2,
            "text": "Thanks for the great explanations from \"nobutthanksanyway\" and \"bodacious.....\"   I've been a little confused about the use and meaning of gaslighting too.  I can't help but make the comparison to today's division and world of politics.   To be informed of the facts and the \"whole\" of what is happening in our country right now, a person has to make an actual effort, or be a victim of gaslighting.  Virtually every person in the U.S is inundated with the one-sided garbage information and censorship spewed by the mass media, including Google, Twitter, FB, academia, Hollywood.  That is all we hear in our waking hours.  If we choose to be lazy and ignorant, we are gas-lit zombies.  If we make make the effort to explore and care about hearing the whole story, we become credible, intelligent people/voters.",
            "title_similarity": "0.7001538"
        },
        {
            "id": "hpb35ht",
            "score": 1,
            "text": "Once you understand gaslighting and see that you're being subjected to it, you become very attuned to it.\n\nI remember with an ex, we were in counseling and I brought up a promise he broke.  Without missing a beat, he just responded with \"I never promised that.\"  It was a pretty significant promise so I remembered every detail about it down to what we were wearing and where we were standing.  It was in that moment, that I realized what was happening.  And from there on, it was high alert times for me.  And each time it happened after that (and it was a lot), I didn't let it get to me; I just went into observer mode.\n\nAnyway, that relationship is a thing of the past.\n\nFor those of you that think this is happening to you, I would encourage you to journal things for reference (but only if you can do it safely!)",
            "title_similarity": "0.6493763"
        },
        {
            "id": "hpb3ikf",
            "score": 1,
            "text": "How would you use “gaslighting” in a sentence?",
            "title_similarity": "0.26058775"
        },
        {
            "id": "hpb3qmc",
            "score": 1,
            "text": "Named derived by a movie in 47 with Ingid Bergmen. Which was also titled Gaslighting,\nwhich lights in houses and street used gas. \nMovie was about mental illness and how people use it against someone.",
            "title_similarity": "0.36184606"
        },
        {
            "id": "hpb4eug",
            "score": 1,
            "text": "Do not listen to all these idiots.\n\nGas lighting is literally lighting gas.\n\nThey are all laughing at you and it's really embarassing, I am the only one telling you the truth.",
            "title_similarity": "0.620991"
        },
        {
            "id": "hpb4fsz",
            "score": 1,
            "text": "A perfect example is your mother calling you and telling you you should probably get your brain looked at because you’re not doing very well economically",
            "title_similarity": "0.44658142"
        },
        {
            "id": "hpb6mk7",
            "score": 1,
            "text": "This is such a hard one because Reddit loves to call everyone who lies a gaslighter. That’s not it. One lie is not gaslighting. It’s more of a lengthy process. The best way for me to explain it is to describe my experience with it.\n\nMy ex used to constantly tell me I was doing things wrong, that I could never get anything right, that I wasn’t trying hard enough. All little things and all contradictory. Why did he always have to be the one to pick out where we went to dinner? Why did I insist on eating at that restaurant he clearly hated? Why didn’t I visit him enough? Why wasn’t he allowed to have space? Why was I socializing with an ex bf from hs? Clearly something nefarious was going on and he only wanted to get in my pants (I didn’t believe this until he convinced me of it and I stopped hanging out with this person because of it). Why wasn’t he allowed to hang out with an old ex of his? It was so long ago, of course nothing was going on.\n\nThere’s a lot more little anecdotes like this but it all happened over the course of 9 months so you don’t realize how sketch it all is until you look back and start adding up the math. And if I tried to tell him that well, the reason I insisted on eating at this restaurant is cuz you asked me to be more assertive in our dinner plans, it turned into WWIII where he accuses me of holding on to past things to use against him and that’s not even true anyways. It made me feel like I was crazy. Did he really say that or was I misremembering it?\n\nThen there’s the bigger stuff. After he found out how much $ I had, he kept telling me how I should be investing it properly and not letting it sit in a savings account with a low interest rate. I would say that’s great, but I don’t know anything about the stock market. He said it’s easy to learn, he used to be a stock broker (so he claims). It would go on and on like this for 3 weeks. I said, recommend me a book so I can learn more about investing cuz I’m not pouring my life savings into something I know nothing about. He kept bringing it up and got more insistent and angrier and angrier. Full on screaming at me. Finally one night when he brings it up at dinner, it clicks. He hasn’t said it but he wants me to give him my life savings so he can invest it cuz he’s too pussy to invest his own. He saw the look in my eyes and realized he went to far. You can gaslight to a point. I will not give anyone my money. He never brought it up again.\n\nLast thing I will say is that I think there’s a lot of overlap between alcoholics/drug addicts and gas lighters. He was an alcoholic who got black out drunk every other nite and he spent just as much time lying to himself about his addiction as he did to me. He could drink either half a bottle of hard liquor or a couple bottles of wine in an evening. And yet he was very good at keeping himself together to the point where I couldn’t tell if he had a few drinks or not. I think the biggest gas lighting occurred around drinking and driving. According to him he was okay to drive and I was not allowed to drive his car. I know in my gut that wasn’t true and there were some scary moments getting home at nite. I really regret that. And to be clear, I don’t drink so the only thing clouding my judgement was him and my fear of him and my warped version of reality that he had helped to create at that point.\n\nAnd that, is my best explanation of gaslighting. I hope this helps OP.",
            "title_similarity": "0.5284609"
        },
        {
            "id": "hpb799z",
            "score": 1,
            "text": "There’s no such thing as gaslighting\n\n\n\n- Bout sums it up? :)",
            "title_similarity": "0.18717547"
        },
        {
            "id": "hpb7pft",
            "score": 1,
            "text": "There is a great film called **Gaslight (1940)** which showcases the meaning of the word in a suspenseful 89 minute psychological thriller. Highly recommend watching it!",
            "title_similarity": "0.574401"
        },
        {
            "id": "hpb84sn",
            "score": 1,
            "text": "gaslighting? That's a pretty big word, did you make that up? Come back here when you have an actual question to ask",
            "title_similarity": "0.5484065"
        },
        {
            "id": "hpb86pe",
            "score": 1,
            "text": "> ELI5- What is gaslighting?\n\nIt's what the media and politicians like to do.  Plenty of it on reddit as well.",
            "title_similarity": "0.7166843"
        },
        {
            "id": "hpb88w7",
            "score": 1,
            "text": "All i know is that being gaslit into oblivion is very hard to recover from. Meanwhile the ex is on to the next one. Fook me man....",
            "title_similarity": "0.51056117"
        },
        {
            "id": "hpb89br",
            "score": 1,
            "text": "Reddit likes to gaslight you into thinking you are gaslighting until you forget what gaslighting actually means and wonder if you are actually gaslighting people.",
            "title_similarity": "0.55194837"
        },
        {
            "id": "hpb979v",
            "score": 1,
            "text": "My ex-wife did this to me for years, the whole time accusing me of gaslighting her.  There were countless \"you were *here* at such and such time, you were obviously having an affair.  I can prove it because your phone location said you were there.  I don't care about your receipts showing you were somewhere else at the time, someone else gave you those to help you lie... stop gaslighting me!  I KNOW you were cheating on me during that time.  You even coached our daughter to lie for you and tell me that you were both at the store buying flowers for me, I know it.\"  Turned out she was seeing someone else.  When I found the evidence on her phone (explicit text messages from the guy she was seeing), it was \"you work in IT, you somehow faked those messages to accuse me of cheating... stop gaslighting me!\"  \n\n\nI questioned my own memory and mental health for years until a coworker of hers let me in on the fact that she had been caught having sex in her car on lunch with the guy.  When I moved out, she threw it all in my face, stating that I was so dumb that she had been doing it under my nose for years and that since I was too stupid to catch her, then it was my fault.",
            "title_similarity": "0.4626388"
        },
        {
            "id": "hpb97zh",
            "score": 1,
            "text": "Have you heard the joke about the gas lighter?\n\nNo?\n\nYes you have, I told you yesterday",
            "title_similarity": "0.45168352"
        },
        {
            "id": "hpba9al",
            "score": 1,
            "text": "We've had this conversation before. Why do you always forget about things that we have already discussed?",
            "title_similarity": "0.47166735"
        },
        {
            "id": "hpbcc7b",
            "score": 1,
            "text": "There are a lot of good explanations here-- I'll add that human minds can be exceptionally receptive to fabricating memories, and gaslighting is deliberately exploiting this for manipulative gain.\n\nI once saw an experiment where someone fabricated a reasonably believable, but false story about a night out at the pub with their friends, supposedly from a few years previously. He brought this story up to those friends, nobody remembered what he was talking about and kind of shrugged it off. However, as the person kept reiterating the same story over a few months, all of a sudden his friends had built memories about that night at the pub that never happened.",
            "title_similarity": "0.6316593"
        },
        {
            "id": "hpbcctg",
            "score": 3,
            "text": "Gaslighing never existed. You’re miss remembering. \n\nOr to quote the Simpson’s:\nRemember when you killed my fish and then lied to me and said I never had a fish?\nThen why did I have the bowl Bart? Why did I have the bowl?",
            "title_similarity": "0.31658912"
        },
        {
            "id": "hpbd08w",
            "score": 1,
            "text": "It’s all these good explanations. \n\nAnd it’s also a word some people use as a weapon, to try to end a debate they’re losing by attacking the other person. \n\nSee also: toxic, cringe, bully, narcissist",
            "title_similarity": "0.52701145"
        },
        {
            "id": "hpbdc4e",
            "score": 1,
            "text": "An ex boyfriend of mine twists history to suit the reality he prefers to believe. For example, even though I was the one to break up with him, he claims it was the opposite. We are still friends, and at times I am baffled by how he manages to warp reality.\n\nI don't believe it's intentional because he is genuinely convinced of the things he says.\n\nI've always considered it a form of \"unintentional gaslighting\". Like a defense mechanism he unknowingly uses because it's easier for him to twist history to suit his preferred narrative.\n\nIs that a thing?? Because I see most answers refer to people being intentionally manipulative, which I don't think he is.",
            "title_similarity": "0.6180217"
        },
        {
            "id": "hpbdcrd",
            "score": 1,
            "text": "When you lie to someone to make their sane thoughts seem crazy. Like whenever Republicans talk about the capitol riot they say it is actually the democrats that sanctioned looting and riots all summer that allowed for it to happen. They wants you to be like \"yeah it's the democrats fault, I can't believe my eyes and ears!\"",
            "title_similarity": "0.45855966"
        },
        {
            "id": "hpbdwl0",
            "score": 1,
            "text": "Didn't know until I had therapy that I was gaslit for years.It started after my mum died and all my family had moved away.For years I thought my family hated me only because my ex husband lied and planted seeds of doubt in my head.He did it with friends too ended up drinking doing stupid stuff cos thought I was crazy only said to myself was done when he wanted me to quit my job cos couldn't look after him plus the house and kids.He worked part-time I worked full time he did nothing .The last 8 years of marriage tried to push back had affairs degraded myself drank too much because I thought I was worthless .It was hard broke free lost friends cos he told them stuff lost my kids respect for a while found a new person who knows how to treat me.My now adult kids are closer with me plus rebuilt stuff with family.I still over apologise to everyone but no longer self destruct my mental health us better 23 years is a long time to be gaslit but I'm free not crazy.",
            "title_similarity": "0.40964565"
        },
        {
            "id": "hpbe456",
            "score": 1,
            "text": "Got into an argument the other day.  This person has been dieting off and on for years.  Diet and weight goes down, fall off and weight goes up. Always happens.  Claims this particular diet is the only one that works for them.  Their doctor referred them to a nutritionist.  They did the “how dare they refer me to someone. They’re not even an MD. Etc etc.”  I suggested since their diet didn’t work, maybe it wasn’t a hateful idea to get a fresh perspective.\n\n“You’re calling me a failure!?!”\n\n\n“No. I’m saying that diet wasn’t sustainable and maybe someone might be able to help with alternatives.”\n\n\n“My diet was sustainable. How could you call me failure?”\n\n“I didn’t call you a failure. The definition of sustainable is something that is sustained. This was not.”\n\n\n“It was sustainable! I just wasn’t able to keep up with it. If you think I’m a failure why are we even talking?”\n\n\n“No. I just want you to be happy and find a path that works for you.”\n\n\n(Them:) Do you know what an enabler is? You bake too much. It’s like offering alcohol to an alcoholic. I *fail* because of you.”\n\n\n“If you equate food to addictive chemicals, you really need to speak to someone. Let’s work on getting help.”\n\n\n“Yes that’s me. A failure and an addict. Why do you even bother with me?”\n\n\nThis continued and still to this day they’re mad at me because I called them a failure.  That’s gaslighting. It’s bending a conversation to alter reality, often through repetition and brow beating, until the argument becomes something they deem “winnable” or they have what they perceive to be the high ground. \n\nThey will continue to dig, expand, and/or focus on items that are secondary to change the tone of the argument or discussion. \n\nIf you think you’re being gaslighted by someone: Write down your issue on paper. Just one line.  If at the end of the discussion you compare it to what you were arguing about at the end and it doesn’t remotely sync, there’s a good chance you’ve been gaslighted.  If you walk in with hurt feelings and walk out apologizing and trying to figure out how to make it up to the person, it’s gaslighting.",
            "title_similarity": "0.4431334"
        },
        {
            "id": "hpbeegz",
            "score": 1,
            "text": "I started dating a guy that I really, really liked.  Unique sense of humor, common interests, and good looking.  \n\nThe gaslighting started after a few weeks.   I'm 10 years older than him and although I told him right away that I was considerably older, I jokingly wouldn't admit my actual age. It became a running joke with us.  Then, one day, he mentioned something about his mom.  He angrily asked why I wanted to know how old his mom is. Wtf?!?  I didn't care how old his mom is, much less ask him.  Then, he insisted it was the 3rd time I'd asked him how old his mom is. Hmm.  He hadn't been drinking that much, so I assumed to myself that he had an issue with his mom and her age (teen mom? Idk and don't care).  I let it go.\n\nThen, he started gaslighting me left and right.  He even accused me of gaslighting him. He actually used the word *gaslighting*.\n\nYeah, we're not dating anymore.",
            "title_similarity": "0.57249475"
        },
        {
            "id": "hpbeypr",
            "score": 1,
            "text": "One tends only to realize after the damage has been done, this is why it is so important to trust your instincts on certain things and to verify things in any way possible... someone being suspicious ask someone they dealt with in the past if the same thing happened. Trust me their strength is your silence and their weakness is their greed... they may never allow themselves to admit to the truth, such has been the case for a few I know, however they tend to slip up in a few ways be it bits of story not adding up (if you so choose to bring this up they may have a way/lie out of of so ensure you have a secondary catch that if they lie about or attempt to alter only guarantees that they fall into ie “tightening the noose” for example: Trick them by asking about something you may or may not know about but have a piece of said story already confirmed to you by someone else prior to the set up or simply fabricate a bit yourself and see if they fall into your own lie, however this one you do not confront them on as they may just as likely said, “Oh well I actually meant...” although I know some very good liars so it is rather dependent on the situation. Another thing you can so is press them on their story, an example being that they say someone can’t/won’t do something and you possibly believe it to be false but because they do not think you will go through with the bother or drama or whatever else that was likely to stop you in the past well simply demand they take you to see the person or go yourself with or with their knowledge (likely better without so they have no way of knowing and thus cannot intervene). Remember patterns & past actions/beliefs are key as they know yours and use them against you anyway possible to achieve their insidious & greedy end goal.",
            "title_similarity": "0.50969046"
        },
        {
            "id": "hpbf0pk",
            "score": 1,
            "text": "Person 1: “Have you heard the joke about gas lighting?”\n\nPerson 2: “No?”\n\nPerson 1: “Yes you have.” \n\nPerson 2: “No I haven’t….?”\n\nPerson 1: “Yes you have. You are being crazy.”",
            "title_similarity": "0.50833"
        },
        {
            "id": "hpbh4ip",
            "score": 1,
            "text": "That's like as if you walked a street with a friend. You both saw a brown cat but friend turns to you and tries his/her best to convince you that you saw a black cat.",
            "title_similarity": "0.34559348"
        },
        {
            "id": "hpbkx57",
            "score": 1,
            "text": "To everyone commenting, this is not what gaslighting is. You've just convinced yourself that it is",
            "title_similarity": "0.34928143"
        },
        {
            "id": "hpbucik",
            "score": 1,
            "text": "There’s no such thing as gaslighting. It’s a myth spreads by crazy people.\n\n\nThat’s what gaslighting is.",
            "title_similarity": "0.40817317"
        },
        {
            "id": "hpbx2dc",
            "score": 1,
            "text": "This term is commonly used now a days for politicians and supporters against people calling them on their garbage.\n\n“You might THINK things are bad but they really aren’t.“\n\n“What is the REAL reason you are so angry about this? “",
            "title_similarity": "0.5067866"
        },
        {
            "id": "hpbxouf",
            "score": 1,
            "text": "TIL gaslighting is named after a play. Also it would alleviate a lot of confusion if it wasn't.",
            "title_similarity": "0.5609176"
        },
        {
            "id": "hpbyvov",
            "score": 1,
            "text": "It doesn’t exist. You’re just making up words. Are you off your meds again? You sound crazy. \n\n/s",
            "title_similarity": "0.33694142"
        },
        {
            "id": "hpc3ge9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04929086"
        },
        {
            "id": "hpc6w7e",
            "score": 1,
            "text": "Have you ever watched the movie Inception? That’s how I think of gaslighting. Planting an idea within someone else’s mind and getting them to believe that that’s how they actually feel.",
            "title_similarity": "0.53421414"
        },
        {
            "id": "hpf42b4",
            "score": 1,
            "text": "Gas lighting is a severe form of denying something. \n\nEg if I slapped you then told you I didn’t and that you hallucinated it and you’re crazy and stuff like that to the point you believe it. \n\nCommonly denying or lying isn’t gaslighting and the term is overused",
            "title_similarity": "0.5097836"
        },
        {
            "id": "hpvbyir",
            "score": 1,
            "text": "Sometimes it's as simple as making something up and insisting on it to deny responsibility. My ex tried to convince me that a sweater he found on the floor belonged to out son when I asked him why he was holding it (saw it on the ground in the schoolyard where we were). He tried to tell me our son wore it out of the house, and he took it off him because it was getting hot outside. The sweater was for a much larger child (no way could have fit my child). I tried bringing this up to him in conversation later and he immediately accused me of being crazy just for bringing up something so \"benign\" that happened so long ago. To be fair, if you are ever delusional, it's is a concern and never benign. Talked to my pop about it and he insists my ex knew he was lying, but was trying to convince me of something else (probably embarrassed for picking up clothing off the floor outside when asked about it). He was so ashamed he tried to make up a story and convince me of it. If I wasn't so self assured, he might have convinced me otherwise. People can gaslight out of shame and fear and not to \"do something\" to you. Equally fucked up, just differently motivated.",
            "title_similarity": "0.41800767"
        },
        {
            "id": "hpyykek",
            "score": 1,
            "text": "There’s a old movie called gaslight watch it on you tube, the terminology came from that movie",
            "title_similarity": "0.37508923"
        },
        {
            "id": "hpyzqj5",
            "score": 1,
            "text": "I had a nervous breakdown because of gaslighting, about 4 yes ago the psychologist that saw me had never even heard of gaslighting, but I knew that what was happening to me was odd watched the movie gaslighting and knew that was the same technique that was being used by my psychologist daughter, I’m still unsure if the gaslighters even know that what they’re doing is damaging.",
            "title_similarity": "0.50958896"
        },
        {
            "id": "hrgpule",
            "score": 1,
            "text": "So say you see a tree in a field if I were to gaslight you I would make you think that there was no tree there. \nBasically it's convincing someone that what they know happened was all in there head and that there crazy for believing the truth",
            "title_similarity": "0.41486534"
        },
        {
            "id": "hsbwgre",
            "score": 1,
            "text": "To gaslight someone has two meanings the more common meaning is to repeatedly lie to someone until they think it's the truth or to use lies to make them think something else the other meaning is to lock someone in an airtight box and pump gas into it when they fall unconscious you flip the switch that turns on the blowtorch making them gaslit",
            "title_similarity": "0.46187356"
        },
        {
            "id": "hsftc8g",
            "score": 1,
            "text": "Late to this and not sure if someone else covered it but it's also gaslighting to keep making remarks about the mental health of another person when you don't know what they do for 90% of their time... especially if you don't have a degree in psychology.",
            "title_similarity": "0.5030834"
        },
        {
            "id": "hsfzb09",
            "score": 1,
            "text": "Gaslighting is breaking down or mentally abusing a partner/significant other into questioning their own sanity by using psychological  manipulation.",
            "title_similarity": "0.35643607"
        },
        {
            "id": "ht1g1h0",
            "score": 1,
            "text": "My parents. This was a contributing factor to my BPD.\nHowever, I got therapy for over 10 years, now I'm in remission, on meds and LOADS better (my symptoms are all but gone and I don't qualify as a BPD patient anymore). I can now help other people recognise such behaviours in spouses, friends and family members. So it wasn't all for nothing!",
            "title_similarity": "0.53167653"
        },
        {
            "id": "ht2nyws",
            "score": 1,
            "text": "Cinema Therapy on YouTube did an excellent study of the subject gaslighting on the movie Tangled.",
            "title_similarity": "0.5651416"
        },
        {
            "id": "hu01vh6",
            "score": 1,
            "text": "there's a classic movie named gaslight in which a newly married couple move to their new home. the husband is a psychopath who is a criminal and tries to convince his wife that she's lost her mind she sees things that are really not there. the whole movie shows you this concept although by focusing on the gaslights of London tries to make audiences to take it literally.",
            "title_similarity": "0.45482844"
        },
        {
            "id": "hzly5i0",
            "score": 1,
            "text": "I’m surprised by how many commenters are asserting that gaslighting must be intentional, that it must involve doing something blatant to make the other person doubt their perception of reality. I really have to wonder where all of these people are getting their information from. How many of them\nAre therapists who specialize in crazy making behavior? How many of them are actually in therapy for gaslighting and actively seeking recovery from it? How many of them have just seen the movie or the definition in the dictionary. \nI admit, I’m still learning about gaslighting in therapy myself, and it’s taken me years in recovery from a very abusive upbringing to get to the point where I sometimes think I know I’ve ruled out gaslighting as the issue, and my therapist will tell me, no, he was gaslighting you. She has had to break it down for me numerous times. There are examples of gaslighting that she has pointed out that I was in disbelief that they were actually gaslighting. So I’m still trying to gain a full grasp of what GL is and isn’t. Having said that, I feel like I’m getting much better at spotting the more subtle instances of it in the past few months. Here’s an example of something that I was shocked to hear is gaslighting. My partner often tries to take the last of my food off my plate while I’m still eating. One day he reached down for my last fry, and I said “no, I’m still eating that. Please ask me before you take food off my plate.” He responded by scoffing and saying, “Really? You’re not gonna share your last fry with me?” As if I had done something wrong, and as if he was the one who was acting reasonably. \nThis came up in therapy because I have food insecurity issues and I wanted to address them. So when my therapist, a seasoned expert in complex PTSD, inner child therapy, and gaslighting, told me that he was gaslighting me, I was in complete disbelief. How? He wasn’t trying to harm me. He didn’t do it maliciously. He didn’t try to convince me something happened that didn’t really happen. So how could this be gaslighting?\n\nShe explained that he dismissed my feelings and my account of reality- which was that he was being rude and inconsiderate of the fact that I was still eating my food- and he dismissed it by playing victim and acting like I had done something wrong by not being willing to share my last fry.\nIt doesn’t matter if it was intentional. Gaslighting often isn’t. It doesn’t matter if he caused overt or significant harm with that instance. It’s still gaslighting. It doesn’t matter if it’s traumatic. It sometimes isn’t.\n\nSo basically, according to my therapist, gaslighting is one piece of crazy making behavior and if it happens frequently, no matter how small scale the harm caused by it may be, whether it’s traumatic or not, it creates dysfunction in that relationship and perpetuates the other pieces of the dysfunction.\n\nFor me personally, I’ve experienced gaslighting by my parents for so many of my formative years and about such traumatic abuse and neglect and abandonment, that now as an adult in recovery, I have no tolerance for ANY form of gaslighting, no matter how non traumatic the instance may be. It’s still triggering for me, and I have to address it on the spot. That is, when I can spot it.",
            "title_similarity": "0.6973436"
        }
    ]
}