{
    "ELI5: Why did latin, a language spoken by a huge portion of Europe, completely die?\n": [
        {
            "id": "hpu3p14",
            "score": 3,
            "text": "Because it wasn't actually spoken by a \"huge portion\" of Europe.  It may have been the most popular language across Europe, but not the most popular language in any one area besides Rome.",
            "title_similarity": "0.5674303"
        },
        {
            "id": "hpubo51",
            "score": 1,
            "text": "Was it actually spoken by a huge number, though? Or was it mostly administrative? I feel like a lot of Gallic peoples probably spoke their own language or just mingled it with Latin to the point that they made new languages. So Latin never disappeared per se, it was just absorbed.",
            "title_similarity": "0.578033"
        },
        {
            "id": "hpv49gj",
            "score": 3,
            "text": "It didn’t die. It evolved into Spanish, Italian, Portuguese, French, etc. (aka the Romance Languages). \n\nYou could make the argument it’s still the most spoken language in the world. At least it’s influence is.",
            "title_similarity": "0.3822767"
        },
        {
            "id": "hpuem9a",
            "score": -2,
            "text": "Latin Died out because of the catholic church... they used formal Latin in all documents and only taught the language to the upper crust of society.. they did this so the average person had to rely on priests for religious instruction and the priest could tell them that the bible said ANYTHING..... so when you only allow a small portion of the world to learn a language... in a generation, you have  1/10 of the former speakers and it declines every succeeding generation. and that's how you kill a language.",
            "title_similarity": "0.67915064"
        },
        {
            "id": "hpukjfk",
            "score": 0,
            "text": "Remember it was written not necessarily spoken in communications between elites who had no other shared language\n\nIt was the lingua Franca, but not anyone’s language\n\nIf you were a scientist you had to publish in Latin\n\nNowadays you have to publish in English\n\nBefore that you had to publish in French",
            "title_similarity": "0.52466524"
        },
        {
            "id": "hpumt87",
            "score": 0,
            "text": "Bc after time during the empire, Roman citizens stopped believing in Rome.\n\nRoman citizenship meant jack shit anymore. Everyone around the empire, all the subject people, were now “Roman citizens”. and they were overrun by gothic immigrants in the west.  \n\nTheir military and insitutions became filled with new “Roman citizens” who didn’t think of themselves as Roman. At all.  \n\nTheir  old ways nobody cared about anymore, and they simply became irrelevant in their own land. \n\nThey didn’t ever put up a real last stand fight to save themselves. They just faded away. \n\nThen the Goth immigrants became the leaders, and didn’t treat the native Roman acestory people well at all. So they had an incentive to hide the fact of them being Roman. \n\nThe church was the only thing strong enough to stand, and save the ways and language of a now destroyed people.\n\nAnd the western empire lost so much when they passed.  They didn’t really recover until the renaissance",
            "title_similarity": "0.68740034"
        },
        {
            "id": "hpuzavp",
            "score": 0,
            "text": "I think it's easy to understand this when you realise that people in the next city over from you can have a vastly different accent, and use words that you never heard before. Sometimes even people at other ends of the same city. In my home city the people in the north side of the city seem to have a completely different language to everyone else. \n\nAnd when you apply the same concept to people living thousands of miles apart, without any form of instant communication, it's not surprising that words will get butchered/shortened/misused over the space of a thousand years.",
            "title_similarity": "0.52297056"
        },
        {
            "id": "hpv75vq",
            "score": 0,
            "text": "It branched and evolved to German French and most European languages and like the what is the multitude of sects and religions and Cults that came from Christianity it got kind of lost",
            "title_similarity": "0.6950131"
        },
        {
            "id": "hpv7rgc",
            "score": 0,
            "text": "To add to others here, Latin as we know it today is almost exclusively a written language (excluding religious setting) by scholars and highly educated people at the time. Its is extremely complex and has a specific tense for almost every word in the sentence. \nSpoken latin was probably leagues more informal allowing it to be  altered slightly by different regions where it was used. Facilitating its branching out to the different languages we know today",
            "title_similarity": "0.5441861"
        },
        {
            "id": "hpveywh",
            "score": 0,
            "text": "I wish I had the opportunity to take Latin. It's usefulness in chemistry and other sciences.",
            "title_similarity": "0.45662922"
        },
        {
            "id": "hpvq1l2",
            "score": 0,
            "text": "I mean. You wrote your question in a modern dialect of Latin. So it's not dead, just.... evolved.",
            "title_similarity": "0.431507"
        },
        {
            "id": "hpvsjm6",
            "score": 0,
            "text": "People are lazy.\n\nWhich is why language is getting shorter and shorter everday.\n\nIt takes soooooo much effort to say \"Legend\" so now, you say \"Ledge\".\n\nAn so on.\n\nEmma Thompson summed it up well.",
            "title_similarity": "0.3994506"
        },
        {
            "id": "hpvxqyr",
            "score": 0,
            "text": "TL:DR\n\nBecause it **wasn't** spoken by a huge portion of Europe.\n\nFrance, England, Italy and Spain fell to varying degrees to Germanic tribes some vaguely Romanised, many not, the Greeks never stopped speaking Greek in the first place, including in Byzantium.\n\nThe Church, and to some extent the elite retained Latin, but regular people did not.\n\nSo you have Latin derived languages in the older Roman territories (Italy, Spain, France), Germanic and Celtic languages in England, and Greek in the east, replaced by Arabic when Byzantium fell.",
            "title_similarity": "0.7327416"
        },
        {
            "id": "hpvxwyx",
            "score": 0,
            "text": "Once in a linguistics thread (reddit) I said I thought it was due to the plague--which hit cities/educated people proportionally harder (latin speakers/readers). Whereas the plague hit the countryside less, and those 'uneducated' serfs gained more power and status than before--and brought the vulgar languages to the fore.\n\nThis idea was totally shot down, the timing was wrong, etc.\n\n(just an example of a wrong answer to OP's question)",
            "title_similarity": "0.64174676"
        },
        {
            "id": "hpvyaaj",
            "score": 0,
            "text": "Latin is the best sounding Language in the Western Hemisphere. Absolutely Classic. The Best.\nIn Middle East it's Hindu and Arabic. Both are beautiful rich languages.\nIn the East it's Chinese and Japanese. Japanese sounds much better though.",
            "title_similarity": "0.41283327"
        },
        {
            "id": "hpwgy4y",
            "score": 0,
            "text": "A huge portion of Europe? The only people in Europe, who spoke latin other than the romans, were scholars and priests.",
            "title_similarity": "0.6727206"
        },
        {
            "id": "hpx3ci4",
            "score": 0,
            "text": "History is mostly a lie.  This language is one of those obvious but hard to hide things that fell through the cracks.  Do you really think priests were commonly giving mass in a fully dead language as recently as 50 years ago?  Who taught it to them?\n\nThat is the reason you are asking the question and why despite the thousand of answers here no one can clearly explain it.   Commonly taught history is a lie.  Answering this for yourself will require hundreds of hours of reading non traditional history and you will still never fully get an answer.  Though you will see that it has to do with the victors burying the losers of history.",
            "title_similarity": "0.6062262"
        },
        {
            "id": "hpx77ym",
            "score": 0,
            "text": "Latin was the langauge of the Roman empire.\n\nThe Roman empire died.\n\nTherefore the language died, as it was the language of the conquerors.\n\n&#x200B;\n\nToday's show has been brought to you by the number '1', and the letter 'F'.",
            "title_similarity": "0.7521459"
        },
        {
            "id": "hpttdpy",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.32494158"
        },
        {
            "id": "hpursum",
            "score": 13,
            "text": "Do Pokémon die when they evolve? No, right? And you know how there are Pokémon that can have multiple lines of evolutions? \n\nThese Pokémon, like Vileplume and Bellossom, are completely different but still maintain a relationship of proximity. And they both come from Oddish.",
            "title_similarity": "0.42891923"
        },
        {
            "id": "hpuik0b",
            "score": 1,
            "text": "Short answer: it didn't. It's just called Italian now.\n\nYou don't think of Old English as having died, because modern English is a direct descendant of it.\n\nFrench, Spanish, Portuguese and Italian are modern dialects of Latin. Literally (well, new languages that are direct descendants of Latin. But they evolved from Latin dialects).",
            "title_similarity": "0.5648273"
        },
        {
            "id": "hpumi3v",
            "score": -1,
            "text": "Strange but true, it is illegal to print or publish a word on France that is not deemed \"French\" by the Acadame de la France'. A word like microprocessor had to be invented in French, as with any new word that is not French in origin.",
            "title_similarity": "0.45313078"
        },
        {
            "id": "hpurr1e",
            "score": 1,
            "text": "How come no one mentions Romansh here? (One of four official languages of Switzerland, also descended from Latin.)",
            "title_similarity": "0.59458625"
        },
        {
            "id": "hpuxi7l",
            "score": 1,
            "text": "It didn’t die, it evolved. Just consider how American English has changed since the early 1800s, or even just 50 years ago. Sure is swell how things totally bodaciously change in like like like fifty years amirite?",
            "title_similarity": "0.46428132"
        },
        {
            "id": "hpuyjy5",
            "score": 1,
            "text": "It did not die. Instead, the spoken language evolved distinctly in several different places until it no longer corresponded with written Latin. The various ways people spoke the language also no longer corresponded with each other.",
            "title_similarity": "0.5388645"
        },
        {
            "id": "hpv4s0w",
            "score": 1,
            "text": "Languages are living things, they chang, evolve, no language is ever dies it just become a new language",
            "title_similarity": "0.34009057"
        },
        {
            "id": "hpvh82o",
            "score": 1,
            "text": "They spoke Latin in Rome and Rome took over lots of other countries or regions where they spoke other languages.  Once the Roman Empire fell, most people went back to their old languages while mixing in Latin to create the languages we have now. \n\nI'm really just pointing out that the Romans are partially responsible for our languages due to nothing more than military conquest.  If they had just stayed within Italy and didn't bother a bunch of other cultures with pointy weapons, we'd be speaking different languages right now. \n\nOr in other words, the Romans diluted their own culture so much by continually expanding into new territory, that even their own Latin language was transformed by barbarian invaders and settlers into Italian.",
            "title_similarity": "0.6704272"
        },
        {
            "id": "hpvq44f",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.32494158"
        },
        {
            "id": "hpw31mj",
            "score": 1,
            "text": "My high school Latin teacher was so old. She said she remembered when the ancient ruins in Rome were new.",
            "title_similarity": "0.49558103"
        },
        {
            "id": "hpukpdh",
            "score": 2,
            "text": "Do people not read other comments before replying? Like half the comments here say the exact same thing",
            "title_similarity": "0.35265628"
        },
        {
            "id": "hpv2zfb",
            "score": 2,
            "text": "It... Didn't?\n\nEven during the time of Rome they knew the language changed. The latin spoken during the Kingdom of Rome would be unintelligible to someone born during the Empire. \n\nThe languages changed with time. It always had, and it continues to change to this day. The big reason Europe doesn't have one big major language is due to the fall of Rome, that much is true. This resulted in Latin developing and changing independently in several different areas. It ended up developing into Italian, Spanish, Portuguese, Occitan, French, Romansch, Romanian, Austurian, Galician, Catalan, Walloon, Venetian, Arogonese, and more.\n\nThese languages are all \"Latin.\" They all just developed separately without the empire holding them together. \n\nAnd these languages continue to change. When you look at French when it was first recognized as a new language, it's basically unintelligible to a modern Frenchman. \n\nLanguages change over time. Always have. Always will.",
            "title_similarity": "0.72321045"
        },
        {
            "id": "hpushav",
            "score": 4,
            "text": "Latin, you must know, had a vulgar (popular) version and a literary version, spoken by the elite.\n\nVulgar Latin mixed with the various dialects and other languages, becoming Italian, French, English, Spanish et cetera.\n\nLiterary Latin is still there, but it's always only been used by the elite.\n\nNowadays we are in the mass culture era.\n\nThat is to say, elites are not elites because they followed the elites route via special studies or careers, they are just normal people who achieved stuff.\n\nAnd normal people speak vulgar Latin, which is, so, entirely different languages by now.",
            "title_similarity": "0.6299327"
        },
        {
            "id": "hpuxvl6",
            "score": 2,
            "text": "I’m somewhat fluent in Latin, and it’s just evolved. Speaking it is somewhat unintuitive and many Romance languages fix that. It’s also probably why the literacy rate is much higher now than when Latin was spoken.",
            "title_similarity": "0.5372468"
        },
        {
            "id": "hpx8g9e",
            "score": -4,
            "text": "Because the Latin Americans took over the language and now it’s called Spanish conquistadors",
            "title_similarity": "0.5284535"
        },
        {
            "id": "hpuj4hi",
            "score": 4,
            "text": "There are records of old people complaining about the broken Latin young kids and hoodlums started using. We now call that ghetto speak Italian. (Source: I personally translated some of those letters from Latin to English. The actual situation is more complicated, but this was one aspect of the development. Notably, Italian is much closer to church Latin than Classical Latin, so the morphology is a bit puzzling. I'm sure someone who knows more will come along and add detail.",
            "title_similarity": "0.5717735"
        },
        {
            "id": "hpufyby",
            "score": 4,
            "text": "Think about how different our language is compared to 10 years ago. New slang comes in, old slang goes out. Think about the different words and idioms that have come and gone in the past 100 years. Latin has had 2-3 millenia to go through these cycles. Eventually, given long enough, you get the romance languages, French, Spanish, Italian, etc.",
            "title_similarity": "0.5964637"
        },
        {
            "id": "hpud1pf",
            "score": 18,
            "text": "It didn’t die, it evolved into the latin languages: Italian, Spanish, Portuguese, French, Romanian.",
            "title_similarity": "0.459884"
        },
        {
            "id": "hpuahn1",
            "score": 19,
            "text": "It did not. It evolved into all of the Romance languages still spoken across Europe (and large parts of the rest of the world). Latin itself evolved from Latino-Faliscan, which evolved from proto-Italic, which evolved in turn from Proto-Indo-European. This is how language works.\n\nThe English you speak is very different from older versions of the same language for many of the same reasons. A very nice example of this is the Greek language. In school, we learn classical Greek -- Plato, Homer, all that good stuff -- which was spoken some 2,500 years ago. The Greeks still speak Greek, and it looks very similar, but it has undergone significant change.",
            "title_similarity": "0.6777303"
        },
        {
            "id": "hpuh8a6",
            "score": 6,
            "text": "Two points:  \n\n\n1. It was not spoken by a huge portion of Europe. Depending on what time it would've been a minority language in Europe. Most patricians/nobles across the continent would have spoken it as well as those in and around the city of Rome. But it took a very long time for it spread up and down what is now Italy. And after that it was mainly Gaul and Iberia, France and Spain/Portugal respectively. And even then it was mixed heavily with later Celtic languages. Meanwhile the eastern half of the Mediterranean was more Greek. Then you also have to remember that pretty much all of the west was then conquered by Germanic kingdoms. \n2. Over time languages change. Pronunciations shift over time. Interactions with foreigners brings new words in. And some times the people in charge decide to make small changes to fit their version of the language. Latin isn't spoken because it evolved into new languages. I wouldn't be all that surprised if a Latin speaker from 753 BCE (founding of Rome) and one from 476 CE (end of Western Empire) struggled to understand each other. After a while classic Latin was only used for ceremonial purposes or church writings. And likely itself has changed a bit over the past 1500 years.",
            "title_similarity": "0.6877122"
        },
        {
            "id": "hpu7ri3",
            "score": 24,
            "text": "It sort of didn’t. Everyone kept speaking latin, but every so often someone would come up with a new slang term, or teach their kids to pronounce a word slightly weirdly. Bare in mind that most latin-speaking areas were mostly inhabited by the descendants of people who spoke latin as a second language, hence why certain accents and native words survived. Since most people at the time didn’t really travel beyond where they were born, these little differences- new words, new meanings for old ones, funky accents- didn’t spread. Eventually, these small changes built up until, if you went too far from your native region, you literally wouldn’t be able to understand people, even though they were speaking a descendant of latin, just like you. Whenever you have two populations that don’t interact, even if they start off with the same language, they will inevitably start to speak differently until you lose mutual intelligibility.",
            "title_similarity": "0.5130385"
        },
        {
            "id": "hpugrr0",
            "score": 7,
            "text": "The debate of the \"vernacular\" was way more prominent than anyone in this thread gives it credence for. So far, the discussion gives far too much credence to the hegemony of Rome and Latin in general. A better question might be along those lines: Why don't we speak Greek? Which was the language used by the Byzantine (Roman) Empire.\n\nAsking why an imperial language \"died\" is missing the point that most of Europe didn't actually speak Latin. Romans brought Latin to the majority of Europe geographically but by population, it was primarily government officials and later ecclesiastics were the only people that used it for centuries.",
            "title_similarity": "0.66843545"
        },
        {
            "id": "hpuijf8",
            "score": 11,
            "text": "It didn’t die, it morphed into other languages: French, Spanish, Italian, Portuguese, Romanian, and indirectly, English.  It remained a language of learning and the Church even through today, still spoken at the Vatican.",
            "title_similarity": "0.35557055"
        },
        {
            "id": "hpuc3b4",
            "score": 37,
            "text": "It kinda didn't. It just evolved into the latin-based regional dialects, then eventually into other, distict languages. \n\nIt's not like people suddenly stopped speaking latin one day. It just changed into something else over centuries. \n\n300 years ago, an English speaker to modern 2021 English speakers would be damn hard to understand. 800 years ago, English sounded more like modern German than it does modern English. I'd argue they aren't even the same language. \n\nI'd wager with almost any amount of money that latin, as spoken in 300 BC by Roman republic citizens was probably quite different from latin spoken in 300 AD late empire times. Languages evolve.",
            "title_similarity": "0.7029463"
        },
        {
            "id": "hpul6iu",
            "score": 16,
            "text": "It morphed into Spanish, Catalan, Portuguese, French, Italian, Romanian and a bunch of other languages.",
            "title_similarity": "0.41493958"
        },
        {
            "id": "hpu6vt5",
            "score": 18,
            "text": "It didn't die. It morphed over time in different cultural contexts. \n\nAs a language it is held as an arbitrary and stable standard, but it was like any other language and never stable.",
            "title_similarity": "0.27864337"
        },
        {
            "id": "hpttpo4",
            "score": 70,
            "text": "Latin was the *lingua franca* of its day, and while it heavily influenced other languages, it was never universally spoken across Europe.",
            "title_similarity": "0.71288216"
        },
        {
            "id": "hpuehh3",
            "score": 80,
            "text": "Linguist here.\n\n\n\nIt didn't technically die, it adapted to the need of the everyday people and turned into the romance languages. The needs of people changed place to place and time period to time period. Language often changes to keep up with the ever changing needs. Over time, the parent language can become unintelligible to the newer languages that were created.\n\n\nTldr: latin is eeve. Romance languages are the eeveutions. Eevee didn't die, just changed.",
            "title_similarity": "0.45828456"
        },
        {
            "id": "hpu1vgb",
            "score": 327,
            "text": "As many people have said, it did morph in to the romance languages. However, I think what a lot of people are missing is the influence of the church. Languages naturally change over time, but they wanted to keep Latin exactly as it was. Therefore, Latin become more and more different than what people were actually speaking and so it became relegated to to the clergy and church context.",
            "title_similarity": "0.5584432"
        },
        {
            "id": "hpu0f26",
            "score": 145,
            "text": "Latin did not completely die. It morphed into the Romance Languages, and was retained at least in part in the Church. \n\nAll languages evolve and shift over time. Eventually that shifting is enough to classify it as a new language when compared to what was used earlier in time. Sometimes this is a very slow process, but sometimes it can occur within a few decades if two separate languages are blending.",
            "title_similarity": "0.45295048"
        },
        {
            "id": "hpttfa8",
            "score": 878,
            "text": "It didn't. It changed over time and went through linguistic drift in different locations, becoming an entire family of languages. The same thing has happened to innumerable other languages families, including English.",
            "title_similarity": "0.5554975"
        },
        {
            "id": "hptt9y2",
            "score": 6812,
            "text": "It changed into french, italian, spanish, etc. \n\nLanguages constantly change and given enough time and isolation languages can become completely different. After the fall of the Roman empire communication and travel stopped being possible so these languages became isolated and then developed on their own.",
            "title_similarity": "0.6570918"
        },
        {
            "id": "hpu91b5",
            "score": 9845,
            "text": "Plenty of folks have pointed out that it didn't die, it just transformed, as languages do.\n\nA more interesting question is: why do we *remember* Latin, and not all the other ancient language-forms? Old English, for example, is just as dead, but hardly anyone besides linguists knows about it or speaks it. The Church has kept the ancient version of this one language alive.",
            "title_similarity": "0.48154262"
        },
        {
            "id": "hpucgid",
            "score": 1,
            "text": "It got absorbed into the language of other cultures Rome invaded and morphed with those languages.",
            "title_similarity": "0.5230208"
        },
        {
            "id": "hpuefug",
            "score": 2,
            "text": "It's easy to explain. Show them an \"English\" text written by your typical teenager and then show them a text written by someone older than 50.",
            "title_similarity": "0.2855542"
        },
        {
            "id": "hpueira",
            "score": 3,
            "text": "All the folks talking about how Latin morphed over time into the romance languages are absolutely right. But there's another aspect to this. It could be said that Classical Latin didn't just die, it was murdered. While the romance languages were developing, formal Latin continued to be used as a lingua franca for the church, for academia, for legal proceedings, for record keeping, and for diplomacy for centuries. While it was being used this way it wasn't static ... it continued to evolve to suit the needs of its speakers. This gave it a strange status. It wasn't what we'd think of as a living language because it stopped being the native language of a population of people, but it wasn't really dead, either, since it was not only still used, it continued to grow and change through use. It enjoyed this odd status throughout the 1000-some-odd years of the Middle Ages.\n\nIt was during the Renaissance that the \"murder\" was committed, though this was really done more out of misguided love than malice. The scholars of the Renaissance saw how the Latin of their day was very much different from Classical Latin and decided to restore the language to its past glory. They deprecated the Latin that had been thriving (in that odd way) throughout the Middle Ages and brought back the Latin of 1000 years prior. In that way, they killed the living language and replaced it with the corpse of its ancestor.",
            "title_similarity": "0.5180653"
        },
        {
            "id": "hpufsnb",
            "score": 1,
            "text": "It didn’t die at all actually though some call it a dead language. It simple developed slightly in each region to become different languages like English, French and Spanish.\n\nIf you speak English, you speak Latin every day. Trust me, I study Latin in school. Video? I see. Disco? I learn. Audio? I hear, etc (et cetera is a Latin phrase too!)\n\nBasically, Latin speaking people got lazier with their speech over time and evolved into other languages.",
            "title_similarity": "0.48411372"
        },
        {
            "id": "hpuh7h1",
            "score": 1,
            "text": "Note that the move away from latin started before Rome became the Roman Empire.\n\nBy the time of Cicero, Julius Ceasar and Augustus the latin of the public was not classical latin (latin as we understand it) but the vulgar latin. The classical latin was pretty much only spoken by the social elites (and they often preferred to speak greek). But since classical latin was \"the most roman latin\" it survived as a status marker, the latin of poetry, politics and philosophy.",
            "title_similarity": "0.65399903"
        },
        {
            "id": "hpujq5r",
            "score": 3,
            "text": "For the same reason that the language Chaucer spoke is no longer spoken- it evolved into something else.  Chaucer's language evolved into Modern English, Latin, over a period three times as long, evolved into Italian.  Over the same period, French descended from Gaulish-accented Latin, and Spanish descended from Iberian-accented Latin.\n\nAnd of course Ancient Greek evolved into Modern Greek.\n\nPart of the reason it feels like Latin died, is that none of its vernacular descendants are called \"Latin\".   *Italian* is named after the peninsula, rather than ancient Latium.  Dante is said to be the last person who referred to the language he spoke as \"Latin\".",
            "title_similarity": "0.69414604"
        },
        {
            "id": "hpukzjh",
            "score": 1,
            "text": "Languages are formed from the bottom up rather than the top down.  Slang, colloquialisms, and dialects from the common masses shape languages writ large.  So that's how you go from Latin to the Romance languages.  It also didn't help that the Roman Empire got conquered and suddenly needing to know/speak Latin to deal with Roman merchants, soldiers, and Governors didn't matter anymore.  As with all things, language is tied to economics.  That's why the international language of business is, for now, at least, still English.\n\nOr sometimes you get something like Romanian which is a lingual anomaly given its surroundings, and the closest thing we have to \"modern Latin.\"",
            "title_similarity": "0.6143649"
        },
        {
            "id": "hpul9ku",
            "score": 2,
            "text": "All languages evolve over time.  Think about how common English slang like the words \"cool, bad, sick, ratchet, axe, etc.\" All have very different meanings today than hundreds of years ago.  Eventually slang becomes standard throughout the years and over enough time the language can become vastly different.\n\nThis is also sped up greatly if the population isn't literate and educated on set rules of grammar that are more rigid over time.  Next, if an area is conquered by another dialect, the languages will intermix and evolve even further.\n\nNo language stays stable throughout time.  Any ancient language is going to be intelligible by modern descendents.  Ancient English, Persian, etc are so different to the modern version that they would be classified as separate languages.\n\nOne day in the future, the United States may fracture like the Roman empire did and become hundreds of isolated countries in the same way.  After a thousand years in isolation, English will have become new languages in all these different areas.",
            "title_similarity": "0.5614872"
        },
        {
            "id": "hpuly6f",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.32494158"
        },
        {
            "id": "hpumfwi",
            "score": 2,
            "text": "Slow change. Latin just changed slightly over and over in different regions.\n\nYou can think of Western Romance (a descendant of Latin) as a period where French, Spanish, and Portuguese were literally the same language. Slight regional variations in pronunciation and grammar can quickly pile up and become harder to understand until at some point they are completely unintelligible... we call that a new language, but the line is somewhat arbitrary because there is naturally a period where they are clearly different but are close enough that you can understand one another.\n\nChange is the natural state of language and strict structure is a very new thing (and ultimately a fool's errand).",
            "title_similarity": "0.5576458"
        },
        {
            "id": "hpumiqc",
            "score": 1,
            "text": "It also didn’t really die per se as most medical lingo is Latin related. I also took it in high school so it was being taught at some point.",
            "title_similarity": "0.39742702"
        },
        {
            "id": "hpumlbd",
            "score": 2,
            "text": "Even in ancient times, there were two versions of Latin - Latin proper, used for official purposes, and Vulgar Latin. Vulgar Latin was the language spoken by most people, and had a simpler grammar than Latin proper. After the collapse of the Roman Empire, Vulgar Latin gradually evolved into separate languages - French, Spanish, Italian etc. due to the breakdown of infrastructure and populations becoming more isolated. Latin proper largely remained the language of education, the Church, law etc. just as it had been in ancient Rome. The decline of Latin proper began in the 14th century when the poet Dante praised the modern languages of Italy as being more beautiful and natural than Latin, and composed his popular poem The Divine Comedy in Italian rather than Latin. It was also accelerated by Protestantism, which taught that the Bible should be translated into languages accessible to ordinary people, and the rise of nationalism and its desire to make local languages the language of education and government.",
            "title_similarity": "0.6649226"
        },
        {
            "id": "hpumu6f",
            "score": 1,
            "text": "It didn't die it evolved. That's like asking why did English die off just because we speak differently than we did in the 1600s",
            "title_similarity": "0.53655076"
        },
        {
            "id": "hpun2wn",
            "score": 1,
            "text": "It was widespread across such a large area that it evolved alongside each region's local influences. Even the countries that once spoke Latin in some shape or form usually still have the minority Romance languages like Sicilian in Italy and Catalan in Spain, amongst many other examples.\n\nTime, distance and a wealth of geo-political factors quite literally just made latin evolve. That's not to even say the Latin some of these countries once spoke as a dominant language didn't speak it with dialectal differences to begin with.\n\nEdit: It's a bit like saying Old Norse died in Iceland, whereas in fact it just evolved in isolation into modern-day Icelandic.",
            "title_similarity": "0.6375284"
        },
        {
            "id": "hpupzix",
            "score": 1,
            "text": "Latin assimilated into the local languages.  It wasn't spoken by \"everyone\" just the ruling/upper class... i.e. Romans.. once Rome fell people were able to resume their previous languages but Latin had already influenced it to point where they were more familiar with Latin than the local dialects.. but still different enough to be entirely new languages. It's more nuanced than that but if you want to know more, checkout your local libraries.  They are all considered Romance Languages.. except for English (though it does share a lot of similar words) which is Germanic.",
            "title_similarity": "0.6408268"
        },
        {
            "id": "hpuq87n",
            "score": 1,
            "text": "It has not died, it’s is still used to describe different classifications of certain things. \nSuch as clouds for example. It if wasn’t for Latin such descriptions wouldn’t be possible. The correct words don’t exist in modern versions of the language such as Italian Spanish and the like.",
            "title_similarity": "0.41277894"
        },
        {
            "id": "hpuspk2",
            "score": 1,
            "text": "In short, the dark ages happened.  Basically a time period where the infrastructure from the world super power at the time, Rome, fell away because of barbarians, societal decline and the plague.\n\n&#x200B;\n\n  Before all the Rome had united the western world under a common economy, government and language(latin)\n\n&#x200B;\n\n  When all that fell away for various reasons all around the same 100year or so period, states that were once aligned were now totally separated.  This led to regional dialects and slang to develop their own distinct languages.  When society picked up the pieces new Superpowers like France and England emerged with their own infrastructure and economies.",
            "title_similarity": "0.7988578"
        },
        {
            "id": "hputhl5",
            "score": 1,
            "text": "I mean, the best answer I have for you is the meaning of \"Google,\" \"Texted,\" or even the meaning of the word \"Literally.\" In English, none of these mean the same thing anymore in the same way that English has evolved from Shakespearian to what we see today. I mean, the dude evented the word \"Elbow\" which is pretty dope. I'd argue that plenty common vernacular comes from Shakespeare and his wordplay.",
            "title_similarity": "0.4330405"
        },
        {
            "id": "hpuvwjb",
            "score": 1,
            "text": "It evolved. Just like every other language keeps evolving. English is a great example of this- its an absolute mongrel of a language that has adopted and adapted from latin, german, anglo-saxon, italian, spanish, etc.",
            "title_similarity": "0.49611598"
        },
        {
            "id": "hpuw5sk",
            "score": 2,
            "text": "It didn't die. It evolved.\n\nThe \"huge portion of Europe\" part is important - those people lived all over the place, never seeing one another and having different experiences. Over time, Latin they used changed in different ways. Just look at Romania - it was cut off from other Latins more than anyone, and today it's unrecognisable for many.",
            "title_similarity": "0.6769577"
        },
        {
            "id": "hpuwgr0",
            "score": 1,
            "text": "This is because Italian (in Italy) and English took over instead for the most part. And similar stuff like German and French. There was no point in speaking Latin anymore except for games like priests casting spells.",
            "title_similarity": "0.5733887"
        },
        {
            "id": "hpuwn1t",
            "score": 1,
            "text": "It didn't die, it evolved. You can see the same happening to English right now - we have Scots, British English, American English, Pidgin, and we are starting to see sort of beginnings of European and Asian forms of English as well, with distinct expressions at the moment and future changes to come.",
            "title_similarity": "0.33848655"
        },
        {
            "id": "hpuwwqm",
            "score": 1,
            "text": "Wasn't it at some point only for the Vatican popes or elites? I think it was seen as holy language or something",
            "title_similarity": "0.48262408"
        },
        {
            "id": "hpuxh6r",
            "score": 2,
            "text": "Latin didn't exactly die, it just evolved into the romance languages which became much more wide spread and popular.\n\nIt's kind of like the dinosaurs. Yes they're extinct, but that's because they evolved into birds.",
            "title_similarity": "0.4668392"
        },
        {
            "id": "hpv1644",
            "score": 2,
            "text": "Personally I've always wondered why Spanish and Portuguese are two entirely different languages",
            "title_similarity": "0.51908976"
        },
        {
            "id": "hpv2wk0",
            "score": 5,
            "text": "The Italian language we know now days hit is actually the language spoken in the toscana region that's where Florence is. Italy has many languages each region used to have its own language, venetian, Lombardo, sardo, sicilian, etc. The rise and penetration of the tv made the Italian language unification easier since it could be shared easily throughout the whole country. \nThe city of latina south of Rome that's where Latin comes from and where Latin is still a thing tough a tiny thing. There used to be a Latin radio station some years ago.",
            "title_similarity": "0.52255297"
        },
        {
            "id": "hpv3izi",
            "score": 3,
            "text": "People have some great answers, I think a huge contributing factor is that Latin was a bit of an education gate keeping - it wasn’t really taught in its pure form to the “working glass” and therefore fell out of use as the “common” language evolved",
            "title_similarity": "0.6296809"
        },
        {
            "id": "hpv5rof",
            "score": 1,
            "text": "Everyone mentioned that Latin was the root of romance language, but the influence it had on the english language is very significative, even if we don't realize it https://en.wikipedia.org/wiki/List\\_of\\_Latin\\_words\\_with\\_English\\_derivatives",
            "title_similarity": "0.5550051"
        },
        {
            "id": "hpv793o",
            "score": 3,
            "text": "Re: Ecclesiastical Latin\n\nNowadays most of what you see coming out of the Vatican as official versions of documents *is* structured to be Classical Latin.  Some of the historic legal/theological/liturgical texts depart from the Classical norms more or less depending on what century they were from (e.g. for most of the “Patristic Era” in the West—well into the 5th/6th C and even beyond—Latin was a *living language* with all that entails.)\n\nMost of the Latin liturgies (Masses and other services) are pronounced in the “Ecclesiastical” (read: Italianate) pronunciation, but in some places you’ll hear the “Classical” pronunciation even in prayers. I saw a Vespers service from a German-speaking monastic house in Austria, and was totally thrown off when they started into Classical pronunciation.",
            "title_similarity": "0.608173"
        },
        {
            "id": "hpv91cd",
            "score": 1,
            "text": "Well the thing is it just evolved, all the Romance languages (Spanish, French, Italian etc…) are derived from Latin. When the Roman empire fell the people of Rome became isolated from each other and slowly evolved different Latin dialects, then languages as their people drifted apart linguistically becoming more and more segmented as their languages became more and more different",
            "title_similarity": "0.776514"
        },
        {
            "id": "hpv9d6m",
            "score": 1,
            "text": "My understanding is that Latin wasn't used like we use various languages today. People weren't as literate and each corner of Europe spoke it slightly differently. Which is why it evolved over time in different dialects then languages.",
            "title_similarity": "0.62953883"
        },
        {
            "id": "hpva55x",
            "score": 1,
            "text": "As people have mentioned the latin roots evolved into many future european languages  but I think a further question is \"why?\" To explain that you need to go to the fall of Rome and the rise of the gret european powers: Germany, France and Spain. After Rome unified much of Europe under one banner once these other nations rose up they became very territorial towards one another. The entire middle ages is rife with wars between Spain and France, France and (what would become Germany), everyone and England etc. These wars and tensions encouraged these areas to develop their own unique cultural identity beyond \"Rome\" and that further drove the push for the languages to divide.\n\nAnother fun fact, although Ancient Rome as we know it collapsed around 395 AD, it spawned two inheritors that each claimed to be the continuance of rome: The Holy Roman Empire in Central Europe (which lasted until Napolean beat it up in 1806 and forced them to break up basically) and the Byzantine Empire (aka The Eastern Roman Empire) that lasted until around 1450s when the Ottomons conquered it turning it into the muslim Ottoman Empire.",
            "title_similarity": "0.6721724"
        },
        {
            "id": "hpvacut",
            "score": 2,
            "text": "Hey u/nico87ca if you’re interested in asking more historical questions, I highly recommend the r/AskHistorians subreddit.\n\nIt’s one of the most well respected subreddits. Answers to questions have to be high effort, and often times commenters link citations. The moderators don’t allow useless comments, so you often only receive high quality responses.",
            "title_similarity": "0.26701373"
        },
        {
            "id": "hpvchwc",
            "score": 1,
            "text": "First if all, classical Latin was only spoken by the elite, and they mostly favored Greek. Greek was also the language of the Eastern Roman Empire and was used in Roman Britain also. The people spoke Vulgar Latin, and after the fall of the Roman Empire, all the forms of vulgar Latin evolved in the myriad of Latin dialects in Europe: Spanish, Catalan, Italian, Neopolitan, Occitan,   Portuguese, Etc. If anything the major Latin languages like Spanish, Italian and French have been imposed onto the rest of the country in an imperialistic sort of way to the detriment of local dialects via standardized education and social pressure.",
            "title_similarity": "0.68759704"
        },
        {
            "id": "hpvd9jf",
            "score": 1,
            "text": "If you count the descendants, it’s still the second language in the world ( as mother language)",
            "title_similarity": "0.39933977"
        },
        {
            "id": "hpvdpku",
            "score": 7,
            "text": "It didn't die. It lives and prospers as Italian, French, Spanish, Catalan, Portuguese, Romanian, Sardinian and some other languages. Even classic Latin which was a language of a certain class for a short specific period of time lives on with the Catholic church and the Academia. The Latin language and it's vocabulary is an integral part of Germanic and Slavic languages too. And were you aware that the Latin languages are actually closer and more mutually intelligible than the various dialects of the Chinese language.\nLanguages evolve all languages, take any language no one speaks the same as people 100 years ago",
            "title_similarity": "0.5378295"
        },
        {
            "id": "hpvdwd0",
            "score": 1,
            "text": "Check out \"Ad Infinitum: A Biography of Latin\" by Nicholas Ostler. Great book on how Latin transformed into the modern romance languages. It sounds dry, but as I remember it is an easy and interesting read.",
            "title_similarity": "0.4783541"
        },
        {
            "id": "hpveym1",
            "score": 1,
            "text": "Wait wasnt the whole point of translating the bible because hardly anyone spoke latin?",
            "title_similarity": "0.59914047"
        },
        {
            "id": "hpvfbna",
            "score": 2,
            "text": "- “What’s all this?”\n\n- “It..It says ‘Romans go home’!”\n\n- “No it doesn’t”\n\n- “Yes it does”\n\n- “‘Romanes Eunt Domus’? People called Romans, they go the house?!”",
            "title_similarity": "0.47839302"
        },
        {
            "id": "hpvfnbx",
            "score": 1,
            "text": "I didn’t! So Romance languages are called that not because they are “romantic” but because they are “Roman” it’s why French, spanish and Italian share so many language rules, and often times have interchangeable words and phases with only small changes. \n\nUltimately after rome fell, the type of empire that Rome was, was not seen in Europe again in history, a trans continental empire spanning all of Europe under a single governing authority. They broke into smaller kingdoms like Castile, or the Italian city states such as Milan, Florence, Venice, the Papal States, Syria, Palestine, England, france, the list goes on. The 300 years following the fall of the empire was fractured, and without a trans continental and singular authority to govern trade, the military, taxes and laws, such as what the emperor and proconsuls of Rome did during the time of the empire, they looks to more local authority. The nations were much smaller, Aragon, Castile, Portugal, just to give a few Iberian examples. \n\nSo when the people from france don’t mix with the people from Spain for a few hundred years, the languages begin to diverge.",
            "title_similarity": "0.65441394"
        },
        {
            "id": "hpvgppg",
            "score": 1,
            "text": "Before the printing press, there was no such thing as \"spelling\" in fact most people couldn't read. \n\nFor this reason, spelling was whatever the hell someone wrote down and people argued about it constantly. These arguments would only be over letters where more misspellings would happen.\n\nOver short distances, these could be consistent, but over more than a few dozen miles and letters would take months and months, so people would just make their own spellings.",
            "title_similarity": "0.52462304"
        },
        {
            "id": "hpvh9nk",
            "score": 1,
            "text": "I don't know if this has been posted yet, but this YouTube channel explores Latin in modern times among other things. You want to know about Latin? [Here you go.](https://youtube.com/c/PolymathyLuke)",
            "title_similarity": "0.40402812"
        },
        {
            "id": "hpvhx97",
            "score": 1,
            "text": "I leaned it in high school. I'm late 30s and as a kid there was always mass in Latin at some churches. As far as why it became less prevalent...the empire fell. Even during the height of the empire conquered areas also had their own language. FWIW Latin as a language morphed into others and was absorbed into other languages too.",
            "title_similarity": "0.6290875"
        },
        {
            "id": "hpvjott",
            "score": 1,
            "text": "Didn't Gutenberg's (sp?) press and the mass distribution of common tongue (vs academic latin) have something to do with it?  Then there was the internet duh!",
            "title_similarity": "0.62082505"
        },
        {
            "id": "hpvl6px",
            "score": 1,
            "text": "The last 200 years of history are unique because before then, mass literacy and society-wide language education were not a thing. You learned language(s) from your family, friends, and community. If every generation starts with a language we call Latin and makes one minor change every generation, over the course of several hundred years, you will have a different language altogether.",
            "title_similarity": "0.6226603"
        },
        {
            "id": "hpvmjpv",
            "score": 1,
            "text": "Latin was already quite regionally divergent even in its hay day, so after the western Roman Empire fell, Europe became very decentralized (with the exception of the church) and the Vulgar Latin variants diverged more substantially based on the locality of various European cultures and their neighboring languages",
            "title_similarity": "0.75305235"
        },
        {
            "id": "hpvp0q9",
            "score": 1,
            "text": "It didn't: it changed into regional dialects over time, which gradually changed into totally different languages.",
            "title_similarity": "0.52541864"
        },
        {
            "id": "hpvpt2g",
            "score": 1,
            "text": "Latin never died, it evolved! About as many people speak a modern version of Latin as do Mandarin Chinese or Arabic. Spanish, French, Portuguese, and Italian are all evolved from Latin. All languages change, especially over millennia. We just happen to have a lot of examples of Latin because of the Roman Catholic Church and European Academia using Latin and preserving it that way.",
            "title_similarity": "0.5366323"
        },
        {
            "id": "hpvpwbc",
            "score": 1,
            "text": "Latin is still spoken by a huge portion of Europe, except we call the variety of modern Latin spoken in Spain \"Spanish\", the variety of Latin spoken in Italy \"Italian\", the variety of Latin spoken in France \"French\", etc. Consider the Arabic language, whose modern dialects are just as divergent from each other and Classical Arabic as the modern Romance languages are from each other and Classical Latin. But we recognize the modern Arabic \"dialects\" as being living continuations of Classical Arabic because of the shared culture and religion of the Arab world. However, the various groups of Europe have been separated long enough that they consider their ways of speaking modern Latin as a separate \"language\" and a part of their national identity, rather than just a dialect of Latin.",
            "title_similarity": "0.6537167"
        },
        {
            "id": "hpvq017",
            "score": 2,
            "text": "Latin didn't die. It changed over time into a plethora of languages in different regions referred to as the Romance language family.\n\nSome of the still living descendants of Vulgar Latin are Sardinian, Logudorese, Campidanese, Aromanian, Istro-Romanian, Megleno-Romanian, Romanian, Corsican, Istriot, Italian, Neapolitan, Sassarese, Sicilian, Aragonese, Asturian, Extremanduran, Leonese, Mirandese, Ladino, Spanish, Eonavian, Fala, Galician, Portuguese, Arpitan, Emilian, Ligurian, Lombard, Piedmontese, Venetian, French, Gallo, Norman, Walloon, Catalan, Occitan, Friulian, Ladin, and Romansh.",
            "title_similarity": "0.47694266"
        },
        {
            "id": "hpvreg8",
            "score": 1,
            "text": "I took Latin every semester of college… that and German were required for Roman Archaeology",
            "title_similarity": "0.52685887"
        },
        {
            "id": "hpvs97j",
            "score": 1,
            "text": "It died out because you couldn’t order a goddam cup of coffe without accidentally summoning a demon",
            "title_similarity": "0.47020805"
        },
        {
            "id": "hpvsrr1",
            "score": 1,
            "text": "It didn't completely die.\n\n1. A large international community continues learning it as a second language. Latin stayed important for educated people because monks, priests, and other important people throughout the Middle Ages kept it up as the official language of the Catholic Church. In the early days of real science, scientists often used it for communication between different countries. And people today look at all the things that have been written in Latin and think it would be an awful shame if nobody understood what they really meant any more. (Reading a translation into a different language isn't quite the same as understanding the original version.)\n\n2. Just like how some dinosaurs evolved into birds and European settlers became today's European-Americans, groups of people speaking Latin slowly changed into groups of people speaking languages like Italian, Spanish, and French that are just evolved forms of Latin.",
            "title_similarity": "0.5199328"
        },
        {
            "id": "hpvt5cd",
            "score": 1,
            "text": "If it did really completely died then why does the Vatican and the Pope speak it?",
            "title_similarity": "0.74340296"
        },
        {
            "id": "hpvtgm4",
            "score": 1,
            "text": "The real answer has to do with the fall of the Roman Empire. \n\nAs Rome retreated, it took its educated scholars and clergymen with it. Latin ceased to be taught and almost nothing was written doen in any language in Britannia, for instance, for about 200-300 years after the Romans finally left for good. \n\nThe dark ages are considered dark because we stopped keeping records. We don’t really know what happened in a lot of places from 500 to about 1000 AD. \n\nThat killed off the written language which in turn killed off the spoken language. \n\nWe actually have more insights into the history of the Sumerians than we do of much of Europe in that era. And the Sumerians existed something like 4000 years earlier. But they wrote things down. Which is why we know what they spoke and said and believed and did.",
            "title_similarity": "0.73741144"
        },
        {
            "id": "hpvtwwr",
            "score": 1,
            "text": "Hard to keep a language alive when you randomly summon demons while have a nice chat over brunch.",
            "title_similarity": "0.29168233"
        },
        {
            "id": "hpvty14",
            "score": 1,
            "text": "It did not die.  It evolved to form the bulk of the languages of modern (south)western Europe and Romania.  It also heavily influenced Dutch and English, and to a much lesser extent German and the Scandinavian languages.",
            "title_similarity": "0.48832294"
        },
        {
            "id": "hpvuf34",
            "score": 1,
            "text": "It’s like Sanskrit, it branched off into multiple different languages, and people sort of left the old language behind. Both are still used in religious scripts and prayers.",
            "title_similarity": "0.50912195"
        },
        {
            "id": "hpvv66e",
            "score": 4,
            "text": "It didnt die, it evolved. French, Italian, Portuguese, Spanish and Romanian, Catalan etc. all evolved from Vulgal Latin.",
            "title_similarity": "0.45633426"
        },
        {
            "id": "hpvva7l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.32494158"
        },
        {
            "id": "hpvvjr4",
            "score": 1,
            "text": "During the Qin dynasty, the first emperor of China made it so that the empire standardized many things, language was one of them. What they did was to force every province in the Qin Empire to \"write and read\" the same. This made it so that dialects could develop and it would be hard to speak or listen to people's from different regions. But everyone could understand the common written language and pay taxes and such. This unity of the written Chinese language is one of the reasons theorized that China stayed one big entity over thousand years instead of breaking up into independent kingdoms, seeking self-determination when the Roman Empire collapsed.",
            "title_similarity": "0.5403702"
        },
        {
            "id": "hpvwwm1",
            "score": 1,
            "text": "It hasn't completely died. For starters, anyone who studies medicine can tell you--\\*many* body parts are [still referred to by their original Latin names when were first identified in Western medicine:](https://jmedicalcasereports.biomedcentral.com/articles/10.1186/s13256-018-1562-x)\n\n\"The adequate use of Latin terms in medical case reports is an essential prerequisite of effective sharing of one’s clinical findings with fellow researchers from all over the world. Therefore, it is highly important to draw students’ attention to Latin terms and expressions that are used in medical case reports most frequently. Hence, the analysis of structural, thematic, and contextual features of Latin terms in case reports should be an integral part of curricula at medical universities.\"",
            "title_similarity": "0.40839937"
        },
        {
            "id": "hpvyzth",
            "score": 3,
            "text": "Latin is really just proto-spanish/french/portuguese/romansch/romanian/etc. Preserved because it's a language which is central to a religion, similar I suppose to Hebrew (before it was reinstated to living status via Israel).\n\nProbably safer to say Latin is a single source material which those languages emerged from, but they also cited other influences, including germanic languages, Arabic languages, etc.",
            "title_similarity": "0.49579155"
        },
        {
            "id": "hpvz7gy",
            "score": 1,
            "text": "I enjoyed the series *Barbarians* on Netflix which tells the story of the struggles between Germanic tribes and the Roman Legions. The Romans actually speak Latin.",
            "title_similarity": "0.5793003"
        },
        {
            "id": "hpw0g5q",
            "score": 1,
            "text": "I was under the impression that it was a language used by the \"educated\" and not the laity.",
            "title_similarity": "0.31606525"
        },
        {
            "id": "hpw26pu",
            "score": 1,
            "text": "The survival is mainly because of Written tradition : Romans wrote a lot of stuff, more than the greeks and they were more advanced because of a more recent epoch, and then after Rome, Latin was perpetuated through religious books (The Bible mainly).  \nThen why did it \"disappear\" and evolved into various different languages ? Because Romans were the best (maybe first) civilization to conquer its neighbours and integrate them, just not exterminate and enslave, so the local languages stayed and mixed with Latin.  \nAlso, the first language academia (the French one from 1634) was the first institution to monitor how people spoke and had the authority to regulate the official language, before that, no country was really paying attention to the deviation of language.",
            "title_similarity": "0.5514258"
        },
        {
            "id": "hpw3xq9",
            "score": 1,
            "text": "But isn’t Latin still used for plant taxonomy, and many other science based studies? It’s actually very cool because you can speak a language different from another, but still identify plants.",
            "title_similarity": "0.36394274"
        },
        {
            "id": "hpw5bn6",
            "score": 1,
            "text": "“Latin is a dead language, it’s plain enough to see. It killed off all the Romans and now it’s killing me.” - autograph book",
            "title_similarity": "0.7464771"
        },
        {
            "id": "hpw60y5",
            "score": 1,
            "text": "Literacy plummeted when the empire fell. The eastern empire returned to Greek, which was always their preference anyway. Trade slowed to a point that more and more people had no contact with the center of the language, Rome, so they began to drift apart into local dialects. It was almost a millennium before literacy began to climb again, by which point the languages were distinct enough to be called as such. By then, peoples were conquered over and over by the Franks, Gauls, Vikingers, Goths, etc.\n\nThink of a language a being borne on the “backs” of a group of people. If the people trade and travel and read and remember a similar enough set of events, the language stays whole. If they diverge by having unique experiences, the language diverges equally. A thousand years of very little centralization means a thousand years of splintering.",
            "title_similarity": "0.6910137"
        },
        {
            "id": "hpw6fxj",
            "score": 1,
            "text": "I know some Greek, but know zero Latin.\n\nTell me does Latin uses the same Yoda-style sentence structure of nearly always putting the subject/verb combo at the end of the sentence instead of the beginning?\n\nEnglish Example:  I went to the sea\n\nGreek Example:  To the sea I went  (Στη θάλασσα πήγα)",
            "title_similarity": "0.5122263"
        },
        {
            "id": "hpw6p2t",
            "score": 1,
            "text": "Because over time, distance, and isolation, languages evolve and change like animals. \n\nYou don’t even have to Latin turning into French, Spanish, Italian, etc. for this. Look at British English and American English for an example of this. What Americans call “trash” is “rubbish”, what Brits call “bonnets” are “hoods.” Had this been a different time, it’s very possible that eventually American English and British English would have eventually split enough to be called separate languages but enough of a base that speakers of one can understand the other, like Spanish and Italian.",
            "title_similarity": "0.51562464"
        },
        {
            "id": "hpw73ft",
            "score": 1,
            "text": "It didn't. The people that spoke it spread out to disparate regions where it was aletered and changed over the centuries.",
            "title_similarity": "0.5569873"
        },
        {
            "id": "hpw7kn5",
            "score": 7,
            "text": "The really interesting question is not why did vulgar Latin take different directions in various countries from the Roman era onwards, but why universities, legal systems, the church and educated people generally stopped using Latin, gradually replacing it with local vernaculars in an increasing number of fields from the end of the middle ages.  \n\nEven a hundred years ago, you were unlikely to have completed your schooling, let alone university without learning Latin as part of it, possibly as one of the main parts of it.\n\nIMO there's no single answer, but a major current is the *gradual self-assertion of modern knowledge and modern states* as equivalent and indeed superior to 'classical civilization'.\n\nBasically, if your ideal of knowledge, learning and – up to the 13th-15th centuries in most countries in Europe even literary style – was Greco-Roman, and if maintaining our reviving ancient knowledge was the most you could hope for (Christianity, the idea of the 'Renaissance'), then Latin (along with Greek and Hebrew) were always going to be central. \n\nBut if your idea of knowledge was of a growing body of ( modern, empirical) 'science'; if your religion was a national church; if vernacular literature was considered the equal of classical forebears; if your image of a powerful state with an effective administration was as much France, England or Spain as Rome... \n\nIf Aristotle, the Vulgate and the Code of Justinian were only peers and no longer idols. \n\nIf national systems of education were beginning to promote universal literacy geared less to creating a small class of 'learned men' than effective administrators of modern states and empires...\n\nMaybe the key moment was the 30 Years War: Bacon, Descartes, Newton, Leibnitz and Spinoza all still wrote in Latin, but few of any significance who came after then did. The Westphalian system was maybe the final nail in the coffin of Latin - the Catholic church and the disciplinary apparatus of (primary) schooling birth the major hold outs for a couple more centuries.",
            "title_similarity": "0.68205667"
        },
        {
            "id": "hpw8e60",
            "score": 1,
            "text": "It didn’t die, it evolved. Into Italian, French, Spanish, Portuguese, Romanian, Raetoroman etc",
            "title_similarity": "0.24032533"
        },
        {
            "id": "hpw8su7",
            "score": 1,
            "text": "Latin didn't die, it evolved. Primarily it evolved into the 5 romance languages Romanian, Italian, French, Spanish, and Portuguese, but latin loan words are found in many different languages including Germanic and Scandanavian ones. \n\nTo make an analogy, right now English is kind of the language of entertainment thanks to hollywood movies and the internet. If at this moment, the internet went down forever, and no new hollywood movies or television shows were made, if we were all cut off from one another, our language, slang, memes, would continue to evolve all on their own. But without that cross pollination of different words, slang, memes, from say, Scotland to say New Zealand, their language would develop independently of each other. After a few hundred years you might end up with two very different languages. After a few thousand, you might not even understand each other anymore. \n\nInstead of TV and movies, Latin had the Roman empire going for it, spreading Latin through trade and imperialism. When the Roman empire fell, so did the common language and each region started putting their own spin on it. The Gauls and Francs mixed their languages with Latin to form French for instance. It happened over thousands of years.",
            "title_similarity": "0.57622826"
        },
        {
            "id": "hpw93pq",
            "score": 1,
            "text": "Times were different back then. People and villages were much more isolated than today, hence why different towns developed hundreds of separate languages. \n\nLatin eventually turned into the ‘romance’ languages we know today. But these, Italian, French, whatever are fairly new. It’s only up until recently, like I said, once we’ve globalised and brought instant communication across the globe that many languages either merged or disappeared. \n\nI’m summary; it’s globalisation. \n\nBarely not longer than your grandparents era; much of the world were extremely isolated and not many travelled, languages were hyper-specific to locations and geographic features like mountains and rivers would separate communities, peoples and languages very easily. \n\nThis just doesn’t happen anymore. Think about it; right now, I’m from Australia speaking English talking to anyone of a potential billion people who could read this from any corner of the planet; or even space!\n\nTimes changed. Languages are dying out rapidly, merging, changing. \n\nHardly ten years ago nobody ever used ‘unfriended’. Society dictates language.",
            "title_similarity": "0.66978323"
        },
        {
            "id": "hpwac50",
            "score": 1,
            "text": "Any person in Romania who is between 25 and 45 and would attend an Humanities focused highschool would do 4 years latin. Also if you are around my age (37) you would do in the last year of middle school 2 yours per week latin.",
            "title_similarity": "0.4473432"
        },
        {
            "id": "hpwdff6",
            "score": 1,
            "text": "\"I saved Latin. What did you ever do?\"",
            "title_similarity": "0.39912814"
        },
        {
            "id": "hpwf2l4",
            "score": 1,
            "text": "So that future taxonomists could play Doctor Frankenstein with it. (By plugging in bits of the world’s languages, and reviving it to name literally everything in the world)",
            "title_similarity": "0.4498412"
        },
        {
            "id": "hpwgtnt",
            "score": 1,
            "text": "Oh Latin! What a cool language. Medical terminology and physiology are all in Latin, it’s not dead.",
            "title_similarity": "0.35785314"
        },
        {
            "id": "hpwhhi0",
            "score": 1,
            "text": "As others pointed out ancient languages Latin never died.\nLanguages can die which happens when there is a replacement happening as has happened with nearly all indigenous European languages. They died because their speakers where replaced by by indo Europeans (Sidenote replacement does not necessarily mean forceful action but it can and most likly has take form as grudally shift over generations)\nA dead language is one that has no current successor language which is true for indigenous European languages (exception is basque and its ancestor languages)\n\nLatin never died. Latin evolved into many modern languages which all drifted apart due to geological distance. As language always do. So Spanish Italian French or Românește are the living descendants of Latin.\n\nWhat is special about Latin is that it was kept preserved even when the local language already changed so much that its recognized as a new language. The reason it was preserved was the church and the usage of Latin as ligua franca of the church.\n\nAnd under this view it makes sense. Latin a language spoken by a huge portion of Europes population is the ancestor of a many European languages with many speaker. Either as a direct ancestor or even as a massive influence on the lokal language.\n\nYou can see that in German which is no Latin ancestor language. Yet it has quite sophisticated similarities with Latin in grammar and many Latin loan words.",
            "title_similarity": "0.6440946"
        },
        {
            "id": "hpwi033",
            "score": 1,
            "text": "Languages change and latin didnt die, it just changed. Its still used in medicine tho you cant call it completely changed or dead.",
            "title_similarity": "0.4133665"
        },
        {
            "id": "hpwjmxj",
            "score": 1,
            "text": "I think what a lot if people are leaving out here is the fact that Latin was the lingua franca in education for centuries before English took over. If you were writing a scientific thesis, or anything else for that matter, you wrote it in Latin so it could be understood anywhere.",
            "title_similarity": "0.67326105"
        },
        {
            "id": "hpwkuuf",
            "score": 1,
            "text": "Most simple explanation possible: because it became a written language during the Middle Ages, as opposed to neo-Latin languages which were actually spoken by 95% of the population (the illiterate people who could not write). Neo-Latin languages survived and evolved, Latin disappeared. Things is Latin was absolutely not the most spoken language already in the Middle Ages, despite being the official language for basically anything.",
            "title_similarity": "0.6723061"
        },
        {
            "id": "hpwlie3",
            "score": 1,
            "text": "It didn't really die, it just got mixed with other languages and evolved into the ones the we know now. The Catholic church still uses Latin and medicine also uses it (along with old Greek) as it is easier to have a common language when conducting studies.",
            "title_similarity": "0.405123"
        },
        {
            "id": "hpwm3tx",
            "score": 1,
            "text": "Because it was bad, so bad that it was inefficient, when the germanics invaded Gaul they took the Latin culture yet mixed the language due to the overall terribleness of Latin when compared to the Germanic world so it was just inefficient, in Egypt and North Africa Arabic become central because not only of Islam and it’s spreading there but also the vandal Germans invasion who simply made the conversion to Arabic easier, the Spaniards kept it longer then most yet simply adapted to the new ways of their Germanic overlords and the Italians actually kept it, but with the commoners and the culture of Europe soon the priests and only the educated can use it, in Byzantium it was forced to change because of how in inefficient the language was, simply put it was changed because it was garbage by most standards at the time and because of Europe and its ever changing landscape simply needing it to change",
            "title_similarity": "0.59403276"
        },
        {
            "id": "hpwnb5x",
            "score": 1,
            "text": "What’s the etymology of the word?",
            "title_similarity": "0.2268443"
        },
        {
            "id": "hpwnp1m",
            "score": 1,
            "text": "Because it is completely impractial. The grammer is too complex to learn perfectly. In some situations grammar cases overlap, which means it’s not conclusive. It’s really slow at conveying information (even slower than fucking german). To summarize it’s the same as with the imperial and metric system. The imperial one should have died out already because it’s just utter trash compared to the other one.",
            "title_similarity": "0.5420091"
        },
        {
            "id": "hpwo9dz",
            "score": 1,
            "text": "I know everyone else already said this, but I’m bored, so he’s my way of wording the answer:\n\nEither it’s because we still do, or because a large part of Europe didn’t, at least for a while. Language evolves. There was never a point Latin died, or just changed so much, in different ways depending on where you are, that you can’t consider the results the same\n\nTake English and Spanish, they are very similar. they use the same letters, have a few of the same words, the same vowels, and have a lot of similar rules.\n\nItalian and French are also similar. These are all Latin languages. People in different areas started speaking a little differently, and eventually started speaking more differently to the point the languages became separate\n\nSo in conclusion, we kinda are speaking Latin. English is just as much Latin as French, Spanish, Italian and a bunch of other languages are. They’re all built on the same philosophy",
            "title_similarity": "0.5302715"
        },
        {
            "id": "hpwpdbw",
            "score": 1,
            "text": "The language spoken by the people was [vulgar latin](https://en.m.wikipedia.org/wiki/Vulgar_Latin), not the kind still used today. \n\nFor instance, vulgar latin miss the neutral gender, so all nowadays Romance languages just have two genders even though classical latin has three. \n\nVulgar Latin received influences from different neighbors and slowly diverged into different languages. \n\nThe same is happening with English in different parts of the world.\n\nThe same is happening with Spanish in different parts of the world.",
            "title_similarity": "0.6588877"
        },
        {
            "id": "hpwpigi",
            "score": 1,
            "text": "Also, the emergence of print capitalism in the 16th century created an economic imperative to print in vernacular languages, since more people would be able to understand them (and increasingly, to read them). Over time, this meant Latin would lose it dominance among the written languages. The emergence of official languages of state was another deathblow. Nation states, which represented a new political model, wanted their own official languages, both to reflect their sovereignty and to accommodate a growing functionary class (vernacular speaking bureaucrats). Languages like French, German and English subsequently replaced Latin as court/’civilised’ languages.",
            "title_similarity": "0.5677208"
        },
        {
            "id": "hpwpudg",
            "score": 1,
            "text": "It's not exactly dead, Other languages are a continuation of Latin. Also, Catholic Church uses it.",
            "title_similarity": "0.42394903"
        },
        {
            "id": "hpwr5wh",
            "score": 1,
            "text": "When I learned compulsory Latin at junior school we had a rhyme: \nLatin is a language as dead as dead can be. \nIt killed the ancient Romans, and now it’s killing me.",
            "title_similarity": "0.7045609"
        },
        {
            "id": "hpwru2h",
            "score": 1,
            "text": "Latin was never spoken by a huge portion of europe, only \"elite\" spoke it, the majority of people spoke \"vulgar\" which roughly translate in the \"language of people\"",
            "title_similarity": "0.6324056"
        },
        {
            "id": "hpwt1xw",
            "score": 1,
            "text": "The main reason Latin didn't stay the same is because it is a shit fucking language.\n\nI learnt it. It has 7 declensions for each noun. The sentence structure is fucking stupid. There are exceptions for exceptions, even French would be confused.\n\nEven ancient Romans didn't speak formal Latin they spoke a simplified colloquial Latin.\n\nEvery language developes to a simpler more convenient form of itself.\n\nA current example is German which is slowly loosing one of it's declensions.",
            "title_similarity": "0.6599969"
        },
        {
            "id": "hpwtfgo",
            "score": 1,
            "text": "It didn't die, it just evolved. Some of the most spoken languages in the world have descended from Latin, so you could say that 50% or whatever of the world speaks Latin in one form or another. Languages never stay the same, they always change and evolve, but our nostalgia for the roman empire has kept  Latin in popular culture whereas pretty much every other dead language has been forgotten outside of academic pursuits.",
            "title_similarity": "0.6311329"
        },
        {
            "id": "hpwu2n8",
            "score": 1,
            "text": "It didn’t, its dialects just became more distinct to the point we now call them separate languages. Spanish, french, Italian, Portuguese, Romanian… that’s all Latin spoken with varying accents and dialects, given a couple thousand years and they’re different enough from one another to be their own languages, but it’s all just Latin.",
            "title_similarity": "0.64618266"
        },
        {
            "id": "hpwu4gp",
            "score": 1,
            "text": "someone wrote this in a Latin textbook back in the day, \n\n“Latin is a dead dead language, as dead as it can be\n\nIt killed all the Romans, now it’s killing me”",
            "title_similarity": "0.73700523"
        },
        {
            "id": "hpwvrde",
            "score": 1,
            "text": "In pictura est puella nomine Cornelia sedate sub arbore.\n\nFirst line of text from textbook Ecce Romani 30 years ago. Thanks, Mr Beswetherick!",
            "title_similarity": "0.44184586"
        },
        {
            "id": "hpww4lk",
            "score": 1,
            "text": "It didn't really die it just evolved into other languages over time. The same way that there's that little European island that spells color like \"colour\" and tire as \"Tyre\" even though the majority of English speakers don't. Languages change and evolve over time",
            "title_similarity": "0.47636017"
        },
        {
            "id": "hpwxcvi",
            "score": 1,
            "text": "If latin is completely dead, then wtf are all those biologists going on about?",
            "title_similarity": "0.6780228"
        },
        {
            "id": "hpwzl49",
            "score": 1,
            "text": "Isn't it true we keep latin naming in science due to the static nature of the language therefore not decaying the description as language changes?",
            "title_similarity": "0.34991208"
        },
        {
            "id": "hpx05ph",
            "score": 1,
            "text": "Where my Caecilius fam at?",
            "title_similarity": "0.28743395"
        },
        {
            "id": "hpx0wwy",
            "score": 1,
            "text": "A) It wasn't spoken by a huge portion of Europe. It was distinctly a Northern Mediterranean Coast language.  \n\n \n\nB) It didn't die. What do you think Italian is?",
            "title_similarity": "0.47202307"
        },
        {
            "id": "hpx1ciw",
            "score": 1,
            "text": "The same reason Old English died out.  Language is always changing.   Also when a few thousand guys speaking another language show up and kill a bunch of people and take over you start talking differently.",
            "title_similarity": "0.6603585"
        },
        {
            "id": "hpx1fkf",
            "score": 1,
            "text": "What I want to know is, what did satan and all the other demonic creatures speak before they found Latin?",
            "title_similarity": "0.62410235"
        },
        {
            "id": "hpx249f",
            "score": 1,
            "text": "While I’m not a linguist, I have been told by others that Latin was a complex language with difficult grammatical structures. It was more common for the poorly educated to speak ‘vulgar Latin’ or Greek. I think it’s fair to say that it had spread so widely in Roman times that it still lives on in its evolved forms - Italian, Spanish, French, Portuguese, Romania",
            "title_similarity": "0.58256876"
        },
        {
            "id": "hpx2cgu",
            "score": 1,
            "text": "It arguably didnt die. While the active speaking population dwindled by the 8th and 9th century BCE the language continued being spoken in monasteries. And in writing it was used as the main form of communication until the 18th century. But if you look around you will still see alot of latin, atleast when you are in Europe. \nThe reason why the spoken aspect vanished from day to day life has probably to do with the nature of the roman empire. People in the provinces continued using their natural language, especially in later periods and regions added later in time. It is quite similar to India, where countless different languages and dialects exist while there is one lingua franca, that was introduced by an occupying force (Great Britain). At one point the regional languages mix with the lingua franca to such a degree that they form something new. There is still a long way to go for that to happen in India (and it migh never). In Europe this process was finished around the time Charlemagne came around so in the 8th century bce.  \n\nMonks, especially educated monks, still used it, not only as a writing language, but actively spoke it, this carried over into the universities, where courses were also taught in latin for centuries. One reason was that classical literature was highly appreciated throughout the middle ages. Another was that the laws were based on roman law. Only when people started writing in their own languages did it become less feasible to teach in latin. So the vanishing of latin is also a story of democratisation. After all the most important thing Martin Luther did was to translate the bible into German.",
            "title_similarity": "0.63331324"
        },
        {
            "id": "hpx2daq",
            "score": 1,
            "text": "we all need to speak. a majority cannot be riddling complex things. I got a big lesson with just my one surname. 1st round crusader out of basque spain. 99% of the world does not know it means st. john. I then found 4 definitions, 3 langauges on just two islands.. ireland and UK. All extinct.. except my name, and the english (thank god) that took over. The summary of language is the average mind of people that need to use it. English became a champion for being very simple.. uncomplicated. Saves ink and paper for that matter.",
            "title_similarity": "0.49680376"
        },
        {
            "id": "hpx3ksb",
            "score": 1,
            "text": "Latin was never a widely spoken language. It was the language of the Roman elite and in turn became the language of the Catholic church but it was not the language of the Roman plebeians and was certainly never widely spoken in the provinces.",
            "title_similarity": "0.58788383"
        },
        {
            "id": "hpx51r7",
            "score": 1,
            "text": "Latin wasn’t spoken by the vast majority of Europe, just the nobility and highly educated. Most people only spoke their home language and being multilingual was only something you could do if you had money or time, something which everyone aside from the nobility had no chance to do.",
            "title_similarity": "0.56221366"
        },
        {
            "id": "hpx5vln",
            "score": 1,
            "text": "1 it was not spoken by a huge portion of europe. It used by elits and administrations, more as a tool than than as a language. Folks were using what ever language they were using before romans came in.\n\n2 it didn't died. It evolved and merged with the local pre-roman invasion languages.",
            "title_similarity": "0.55117536"
        },
        {
            "id": "hpx6oix",
            "score": 1,
            "text": "It hasn’t died. Look at academia, law, church , the languages lives on. But generally it branched into the Romance languages.",
            "title_similarity": "0.33951914"
        },
        {
            "id": "hpx711n",
            "score": 2,
            "text": "When Rome was at its height as a contiguous entity, Latin was spoken throughout most of the empire, and where it wasn't spoken, Greek or regional minority languages were spoken.\n\nFirst the Huns invaded in the 400s and in doing so pushed many previously settled peoples into Romes borders, mostly Germans. Germans eventually ended up conquering and settling all of the modern day Romance language speaking countries, with each respective Germanic kingdom (Suebi and Visigoths in Iberia, Franks in France, Ostrogoths and Langobardi in Italy). Obviously they don't speak German now, but you can find traces of old Germanic words in Portuguese, Spanish, French and Italian (mostly Lombardic).\nBecause of this intermixing it propelled the Latin in each region to take its own course of evolution, evolving into the respective Romance languages of today.\nIn the case of Britain it seems the Latin spoken there was entirely extinguished. \n\nThis was in the Western empire. In the east they mostly spoke Greek but there was also Latin spoken throughout North Africa, the Levant, Anatolia, and the Balkans.\n\nIn the 500s the Slavs also invaded and conquered Pannonia, further displacing the Latin speaking population in the area. \n\nIn the 600s the Arab conquests began, and through the conquests and administrative policies enacted by the Ummayads and Abbasids, this also further alienated the Roman population in the region. \n\nBy the 800s Latin had already evolved into the early forms of each Romance language. \n\nLatin was still used as a lingua franca/bridge language in literacy, but by this point the common European did not speak Latin. \nSince then Latin has only been used for liturgical purposes by the Papacy/Vatican.",
            "title_similarity": "0.72322416"
        },
        {
            "id": "hpxhgs8",
            "score": 1,
            "text": "So everyone* in Europe spoke Latin, such that walking from Rome to Paris the local dialect will gradually transform from Italian into French.\n\nLanguages “die” when the remote changes aren’t brought back into the fold. With Latin, as others mentioned, the Church wanted to keep it pure. So only clergy and academics spoke it, while at home they’re speaking modern Latin with all the dialect and slang that transformed it into, say, Italian.\n\nLinguistically, we learn a first/primary language regardless of how many are spoken in a household. They found that even with faking a Latin speaking household, that it was not the primary language in any child’s development anymore. Once a language is only learned as secondary, it dies. We can still make up new words but our vocabulary is not the same.\n\nLatin is a dead language because all natural speakers are dead. There are conservation efforts to try and prevent this fate for many indigenous languages, but it’s an uphill battle against missionaries building “schools” that teach English to teach about Christ.",
            "title_similarity": "0.5858668"
        },
        {
            "id": "hpxwech",
            "score": 1,
            "text": "It didn't die. It turned into Spanish, Portuguese, Italian, French and Romanian after the collapse of the Roman Empire.",
            "title_similarity": "0.5202795"
        },
        {
            "id": "hq0kvhe",
            "score": 1,
            "text": "You have to remember that Latin is the language of Rome, who were conquerors. Latin was mostly spoken by the legionaries and the local regional governors, which then passed down to the native locals that they conquered. The locals didn't *stop* speaking their own language from before Latin, but they did learn Latin.\n\nOver time, the local languages combined with Latin to form unique regional dialects like Italian, Spanish, French, (not English because that one's even weirder), Portuguese, and Romanian. English ended up being even crazier because of how frequently England was occupied by different conquerors, from the Romans, to the Normans, to the Danes, and each one passed down words and changed the language dramatically.",
            "title_similarity": "0.6325018"
        }
    ]
}