{
    "ELI5: Where do STDs come from if you can only get them from someone who has one?\nWhere did STI/STDs come from? I’ve always been taught that you can only contract ‘most’ of them from sexual contact. \n\nThis begs the question of where did they originate from?": [
        {
            "id": "hqsrh4q",
            "score": 1,
            "text": "There is no evidence to suggest that any STD came from **sexual** contact between humans and animals. You can stop suggesting that as an explanation.",
            "title_similarity": "0.52370954"
        },
        {
            "id": "hqs1mxh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.221912"
        },
        {
            "id": "hqs6pli",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.23815781"
        },
        {
            "id": "hqrzxgo",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "0.221912"
        },
        {
            "id": "hqs1lr1",
            "score": 68,
            "text": "they come from animals.  for example.  HIV came from a chimp.  a chimp was infected with HIV, a human ate the brain of that infected chimp and got HIV.  and then it spread among humans.",
            "title_similarity": "0.3781314"
        },
        {
            "id": "hqs7vpx",
            "score": 1,
            "text": "Viruses/bacteria that cause STDs are a form of life. (Well, bacteria is a form of life but viruses comes from a form of life)\n\nSo they all come from the same place life came from, from its “parents” before it.",
            "title_similarity": "0.47920072"
        },
        {
            "id": "hqs8dft",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.22191203"
        },
        {
            "id": "hqsaa0x",
            "score": 3,
            "text": "From blood usually. HIV/AIDS for example, originated in monkeys. It stayed in monkeys for lord and science only knows how long, mutated the ability to transfer to humans via blood (or sex, as the variant that made it out suggests) and hunters contracted it via the butchering process when they go to a small room or designated area to get covered head to toe in HIV positive blood while separating bones and preparing the meat.\n\nAfter it's had time to incubate, they spread it to their sexual partners and probably doctors before it was understood, via blood and sexual fluids, and since people have CRAZY amounts of sex and before the super deadly disease, condoms were not extremely popular, it spread all over the world extremely fast. Blood born pathogens also spread quickly when basic precautions are not taken and it spread less quickly that way as well.. Especially among gay men where condoms were not usually even a consideration without the risk of pregnancy, but it did not stay mostly confined there for long as gay men (and women) were ostracized and usually pressured into hetero marriages to raise children, and so spread it to their other gendered partner\n\nAt one point it was the number one killer of Americans, and before that we didn't even know what it was, how it worked, or how you got it, only that it was a deadly immunodeficiency found mostly in gay men (it was even called GRID at first, gay related immune deficiency)",
            "title_similarity": "0.5909581"
        },
        {
            "id": "hqs9psm",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.22191203"
        },
        {
            "id": "hqs5q0c",
            "score": 13,
            "text": "Most can be spread through other means, intercourse is just one of the most common.\n\nDrinking out of the same water as a person or animal that was infected, or eating infected animals that weren't properly cooked, is likely where most of them first entered the human population.",
            "title_similarity": "0.62072587"
        },
        {
            "id": "hqt4z2g",
            "score": 0,
            "text": "Why is no one addressing the obvious follow up question? 'Why do most animal originated viruses down die out? only because humans lie about having it? or do close contact transmissions from animals still happen nowadays at such high rates?'",
            "title_similarity": "0.5652519"
        },
        {
            "id": "hqt949d",
            "score": 0,
            "text": "So the public health community speculated that a bat flew into the cloaca of a pangolin which was then consumed after being sold at a wet market in Wuhan, China leading to the outbreak of COVID. Later, we learn through diligent journalistic work that the lab leak hypothesis is not only possible, it’s probably.  Let’s go back to the early 80’s. The medical community speculated that someone ate infected monkey meat?  Does that make any sense now that we know about how HIV is transmitted?",
            "title_similarity": "0.4858761"
        },
        {
            "id": "hqtmgbu",
            "score": 0,
            "text": "Ummm…. From someone who got one that got it from someone who had it? Probably originates from a chick somewhere. Yeast infections and little crabbies combine with viral loads and mutate over time.",
            "title_similarity": "0.50404"
        },
        {
            "id": "hqtvplb",
            "score": 0,
            "text": "I hope I’m not going to embarrass myself asking this but without starting a new thread, why is the aids virus more generalized with the gay community? Like why are they more likely to contract it if that’s true? Please don’t burn me at the stake lol it’s just a curiosity.",
            "title_similarity": "0.54874927"
        },
        {
            "id": "hqtw6xg",
            "score": 0,
            "text": "When in public bathrooms I almost never see other people wash their hands before going to the bathroom. That's a lot of people touching their genitals with dirty hands. Who knows what they touched before handling their genitals, but once they touch their genitals they realize how dirty their hands are, and they wash them--sometimes.",
            "title_similarity": "0.59305054"
        },
        {
            "id": "hqtz0ig",
            "score": 0,
            "text": "Where did COVID come from if you can only catch it from someone who has it?",
            "title_similarity": "0.5867901"
        },
        {
            "id": "hqsga07",
            "score": 35,
            "text": "Fun fact: “begs the question” doesn’t actually mean “makes you want to ask the question”. It is a type of philosophical fallacy where one assumes one’s position is correct while making a conclusion from that perspective. I.e. “Fruits and vegetables are part of a healthy diet. After all, a healthy eating plan includes fruits and vegetables.”\n\nWhat we actually mean when we usually say “begs the question” is actually *prompts the question*\n\nThanks for coming to my Ted talk.",
            "title_similarity": "0.48791057"
        },
        {
            "id": "hqszf1j",
            "score": 1,
            "text": "Same place that any disease like covid came from that you can only catch from another person. Something started them all.",
            "title_similarity": "0.7141592"
        },
        {
            "id": "hqt427i",
            "score": -1,
            "text": "My does mean if my dog got herpes on his wiener?",
            "title_similarity": "0.40352958"
        },
        {
            "id": "hqtf52d",
            "score": 1,
            "text": "As someone who is sexually active, works at an STD clinic, and has many sex-wprker friends, I can assure you that sex is just one of the transmission vectors. Chlamydia and Gonhorea both transmissible through saliva or bad hygiene practices, both tjings that don't have to be necessarily transmited during sex. The same goes for aids and syphilis. AIDS in particular being transmitted via blood-blood contact.\n\nSo even if STDs come from animals, it doesn't mean it came from sex with animals. The most likely answer is combination of mutations, poor hygiene, and poor food safety.",
            "title_similarity": "0.7307884"
        },
        {
            "id": "hqtnt2r",
            "score": -1,
            "text": "Like everything else, it came from the Gov't. \n\nCreated it in a lab..\n\nAnyone ever hear of the syphilis experiment, it even has a name: the Tuskegee experiment.\n\nI know they like to throw you off track, and most people think of the, Tuskegee airmen.\n\nNope. Its the govt.",
            "title_similarity": "0.6273459"
        },
        {
            "id": "hqs676o",
            "score": 658,
            "text": "Before the Europeans came to the Americas, syphilis was only found in llamas. After the Europeans came to the Americas, syphilis was found in llamas and humans. One theory is that some people would use condoms made from Llama intestine, and the intestine infected with syphilis would pass on to the humans. Another theory is that horny conquistadors fucked llamas.",
            "title_similarity": "0.5836105"
        },
        {
            "id": "hqssqs0",
            "score": 9,
            "text": "TL;DR Microbes.\nI just took a sophomore college level microbiology class. Basically there are bacteria, viruses, fungi, and helminths all around us, on us, and inside of us all the time. They’re in the air, on everything, all over your body and inside your body, in your teeth/mouth, skin, nose, the environment, everything. Most are only visible with microscopes and some need even electron microscopes to view them. Same thing with animals to answer the “well how did the animals get them” thing. Some are beneficial, some are harmless and some are pathogenic. The pathogenic ones are the ones that cause STDs . The beneficial/harmless ones live on you and in you and use the real estate of your cells for nutrients and replicate without causing you any harm. The pathogenic ones are usually super resistant to your body’s defense mechanisms (white blood cells, immune cells etc etc. that’s why they created antibiotics and antiviral medications, to do what your body can’t do on its own and get rid of them. But they evolve over time and become resistant to medications as well, which means new medications need to keep being produced) and take up residence where the healthy microbes are supposed to be.. they out compete them basically. They also use your tissues for nutrients and real estate, but they cause harm by invading your cells and doing all sorts of nasty stuff to ya, chewing up your cells leading to pus and crusts and bumps etc. I’m no expert but, I would advise coming up with a list of STDs, googling them to find out what microbe causes them, and then you can read more about where the microbes originated , etc because there are thousands. They were discovered by scientists and doctors back in the day before there was any knowledge of hand washing or anti septic anything, and scientists and doctors were prompted to research them by noticing how food could rot and ferment, and people would die after surgery from what we now know as infections or sepsis . Moral of the story … BE CLEAN AND ONLY FORNICATE WITH CLEAN PEOPLE lol. But if you want to go way way back and say where did the microbes come from, most of that stuff is unknown BUT there are theories. Look up “microbe origin theories”. I THINK endosymbiotic theory is the most widely accepted today. So long story short …. Microbes. Microbes are where STDs come from . That is why they are transmissible. Because the little microscopic critters spread from person to person , or animal to person or environment to person, even dirt and poop to person . Then they use their little virulence factors to wreak havoc on their hosts. You can look at a free online microbiology textbook on Openstax and flip to the STD chapters",
            "title_similarity": "0.45440626"
        },
        {
            "id": "hqs43g6",
            "score": -28,
            "text": "[removed]",
            "title_similarity": "0.221912"
        },
        {
            "id": "hqs4en5",
            "score": 97,
            "text": "Perfect thread to drop that human pubic lice is extremely genetically similar to ape pubic lice. So it made a jump, just don't wanna fill in the details of how",
            "title_similarity": "0.5359205"
        },
        {
            "id": "hqrvyd1",
            "score": 1103,
            "text": "The answer disturbingly is mostly from animals. That's not to say they necessarily came from sexual relations with an animal, although some of them did, but others have crossed species through close contact and become STDs through mutations.",
            "title_similarity": "0.56389445"
        },
        {
            "id": "hqshkdf",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.22191203"
        },
        {
            "id": "hqsafif",
            "score": 13,
            "text": "So i think its clear these viruses mutate and find human hosts either by biting or whatever your imagination holds but as for how STDs are transmitted majority can be acquired through non sexual ways even if the percentage of passing them nonsexually are quite small\n\nHIV can be from blood to blood transfusions, mother to child.\n\nSyphilis comes from close contact with the affected part or the ulcers or vesicles\n\nHerpes is also close contact transmission of the affdcted part. Oral to genital or oral to oral.\n\nParasitic STDs such as crab louses can be passed by sharing the same bedding, but they mostly reside in genital areas which makes them highly contagious STDs but you can acquire them even without sex.",
            "title_similarity": "0.65686333"
        },
        {
            "id": "hqs3rj5",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.221912"
        },
        {
            "id": "hqs3mdx",
            "score": 190,
            "text": "Some STDs have been in the human species for a long time. Like we have used the herpes virus r\nDna to track human migration. Though this is for the cold sore, the hsv2 diverged from have hsv1 6 million years ago so it has been around a long time too.",
            "title_similarity": "0.42972797"
        },
        {
            "id": "hqs631o",
            "score": 117,
            "text": "Depends on what you mean by originate.  Other comments have explained that for many we got them from animals but that begs the question of where animals got them.\n\n\nIf you want to keep following that line it is not much different than asking where you came from. Many many many slightly different versions going in a chain all the way back to the origin of life.",
            "title_similarity": "0.53518957"
        },
        {
            "id": "hqsand6",
            "score": 12,
            "text": "STD’s are from contact. \n\nRingworm from the gym floor is a std, even if you didn’t bang phill.\n\nSTD’s are usually transmitted from non sexual contact, or even indirect non sexual contact. In America we have a huge stigma about a lot of stds even though by our own definitions many std’s are what we consider not a big deal. Instead social stigma makes it out so a curable std from not sex is ok, a curable std from sex is bad, and a incurable std from any source is really bad.",
            "title_similarity": "0.67516434"
        },
        {
            "id": "hqsin9c",
            "score": 19,
            "text": "Evolution. The entire planet is coated in microscopic organisms at this point. Randomly, those organisms become infectious and replicate under certain conditions. As other people have said, this is often when large creatures like humans are in contact with other large creatures like other animals *or* other humans.\n\nSo, as with everything else evolving with animals, it's a matter of mutations. That's a higher possibility of something particularly unique forming when you're talking about billions upon billions of microscopic things.",
            "title_similarity": "0.3749838"
        },
        {
            "id": "hqs9ctl",
            "score": 19232,
            "text": "Most STDs came from close contact with animals. Not necessarily sexual contact, just close contact.\n\nGonorrhea came from close contact with cattle. A person working on an infected animal could easily be exposed to the bacteria. Milking a cow or helping birth a calf and then going to the bathroom without washing your hands would be enough.\n\nChlamydia is caused by a very common bacteria that affects all sorts of animals including humans. Most famously almost the entire population of Koalas are infected.\n\nSyphilis may have come from Sheep or Cattle, but it also may have come from Llamas. Working theory is that it was a disease that early explorers brought back to Europe from America.\n\nHIV likely came from a human eating an infected monkey or another primate.\n\nHerpes is by far the most interesting (from a historical standpoint) because humans have always had Herpes. Our species inherited the disease from our evolutionary ancestors. Genetic testing shows junk DNA from Herpes infected our species hundreds of thousands of years before we even left Africa. Likely because one of our ancestors ate another infected primate. So Herpes, Warts, and Cold Sores are older than humans.\n\nSo when you hear on the news that we caught a bird flu, or a bat virus, it's because a disease mutated and jumped species to us. But does it work in reverse? Is there a common Human virus that could potentially jump to another species? yup... Herpes. \n\nDogs can get Herpes Cold sores... and they got it from close contact with us.\n\n**EDIT for clarity:** Dog Cold sores aren't like ours, but they get wart like growths and lesions and it can be very serious so if you suspect your dog is infected see a vet. \n\nDogs have their own version of the Herpes virus and can't be infected by regular human herpes directly and vice versa. But Dog Herpes likely originated from humans ages ago when it jumped species and mutated.",
            "title_similarity": "0.5176176"
        },
        {
            "id": "hqsgskv",
            "score": 148,
            "text": "Other commentors lay out that most of the more egregious viruses make the jump to humans from animals. That's not to say there's something intrinsic about animals though.\n\nRather, its that most viruses slowly mutate and evolve in a biological arms war in lock-step with us (or any animal). Over time if we evolve to become more immune (by say having the vulnerable die off), selection pressure is exerted on the virus to become more virulent etc. In a sense, we both get stronger in relation to one another over time (and only specifically to one another).\n\nThen a freak mutation happens and it jumps species.\n\nSuddenly 10 thousand years of evolutionary pressure sharpening knives against a certain animal's immune system which has likewise been buffing itself up for the same amount of time.. is let loose on a human who has no such defenses, yet are similar enough that the virus has a field day. And these are the viruses that get the headlines due to how catastrophic it is on whoever it is on the other end of the species jump.\n\nSexual contact just happens to be the easiest vector for all sorts of bodily fluids that may be carrying the virus.",
            "title_similarity": "0.5339533"
        },
        {
            "id": "hqrvwg0",
            "score": 5394,
            "text": "Like most things they mutate from something else. HIV for example is an immune disease, mutated from SIV(simian immunodeficiency virus), which muted from another virus.",
            "title_similarity": "0.5358299"
        },
        {
            "id": "hqsieor",
            "score": 1,
            "text": "oof. Well poor child you can actually pick them up from unexpected places. If I had to guess on the most common one, it's probably various strands of herpes. You can inherit some in the womb. You can get it kissing. You can get it playing beer pong. You can get it engaging in much more fun activities.\n\nIf you are questioning biogenesis on these viruses? 🤷. I'd have to explain biogenesis generally speaking and that's waaaaayyyyy out of my (or any other living person's) purview I suspect with any degree of accuracy. I will say this. Viruses like to survive. So do bacteria. So do all living organisms. The kind that stick around tend to find a way not to kill the host. Just ask your stomach",
            "title_similarity": "0.6374489"
        },
        {
            "id": "hqsmkcl",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.22191203"
        },
        {
            "id": "hqsqzwg",
            "score": 1,
            "text": "One main way it could occur is through a mucus membrane like the eyes.  Get some infected stuff on your eyes and you could contract it.  Its definitely easier to contract through the eyes than the mouth, nose, or even a covered wound.",
            "title_similarity": "0.4462639"
        },
        {
            "id": "hqsvd75",
            "score": 1,
            "text": "STDs are diseases that can be transmitted sexually but that doesn’t mean it’s their only method of transmission",
            "title_similarity": "0.64832914"
        },
        {
            "id": "hqswyzc",
            "score": 3,
            "text": "Since no one else has mentioned this one so far… pubic lice (crabs) likely came from the ancestor of gorillas. The human head and body louse appear to have always lived on humans and we are their exclusive host (very interestingly, body louse appear to have evolved from head lice that learned to live on our clothing). Public lice on the other hand are more closely related to the gorilla louse and appear to have diverged roughly 3 million years ago, a time well after our split from chimpanzees. We likely caught this infection either from scavenging the remains of proto-gorillas (the human lineage of apes, australopithecines, by this point were not an apex predator so it’s hard to say that we deliberately could kill other large primates) or we received it from habitually sleeping in the bedding material created by proto-Gorillas.",
            "title_similarity": "0.5656127"
        },
        {
            "id": "hqt258d",
            "score": 1,
            "text": "This is a lot like saying if it takes people to make people, where do people come from. They evolve.",
            "title_similarity": "0.38636076"
        },
        {
            "id": "hqt3ohi",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.221912"
        },
        {
            "id": "hqt5sa2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.22191203"
        },
        {
            "id": "hqt64nx",
            "score": 1,
            "text": "Where does any infectious disease come from. Don't be fooled into thinking you get colds from being cold. They either already inhabit your body and just become a disease later, or you catch it from someone else.",
            "title_similarity": "0.5206524"
        },
        {
            "id": "hqt6vu3",
            "score": 1,
            "text": "You don't need sex to get an STD. Epididymitis causes inflammation of the sperm-carrying tube located directly behind the testicals. Feels like getting flicked in the nuts.\n\nYou can get it from something as simple as a groin injury.",
            "title_similarity": "0.6416827"
        },
        {
            "id": "hqtatfv",
            "score": 1,
            "text": "I have this same question about bedbugs. They don't live in the wild so where the hell did they come from?",
            "title_similarity": "0.5018842"
        },
        {
            "id": "hqtcx2t",
            "score": 1,
            "text": "You CAN get an STD from sex with animals, I'm proof, I got one from my ex and she is an \\*ss.\n\nThis is actually a great question.  I know my grandmother ended up getting an STD in her late 60's when they went on a vacation and were in a hot tub, they are breeding ground, so always make sure if you go in one, it's cleaned and treated regularly",
            "title_similarity": "0.55880696"
        },
        {
            "id": "hqteyi7",
            "score": 1,
            "text": "There's many theories & studies.\n\nOne of many being Animals + Humans. However, the most likely is members of different human species.\n\nThere was most likely a genetic strain on a relatively harmless bacteria, and a combination between two-different genome combinations.\n\nWhen there was Neanderthals + Homo Erectus probably had many combinations that resulted in sterile breeds, as well as, many error-prome combonations that could of resulted in a bacterial strains being more apt to target a genome closer to homo-sapiens.\n\nAs well, Neaderthals lasted well into the extinction of Homo erectus, and first generations of Homo-Sapiens.\n\n---\n\nUs, Homo-Sapien Sapiens is a sub of the Homo-Sapiens. We are the last of hundreds of different humans. Many who were as different as a Saint Bernard and a Chihuahua.\n\nIt's entirely feasible that STDs developed from a cross strain between an Older Less-evolved Human species & Animals, then that spread to more evolved humans over generations.\n\nOr perhaps, a harmless strain that targeted what many STDs targeted suddenly developed more harmful characteristics.\n\n\nBut. It's all theory; there's no much research done unto STD history.",
            "title_similarity": "0.4679171"
        },
        {
            "id": "hqtf50n",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.22191203"
        },
        {
            "id": "hqtfv6q",
            "score": 2,
            "text": "Like most viruses or bacteria that make us sick, it comes from animals (Cattle, pigs, birds, soil) then mutates to adapt/survive.",
            "title_similarity": "0.36512643"
        },
        {
            "id": "hqtgh4x",
            "score": 1,
            "text": "Ah, the classic question of which came first, the chicken or the herpes?",
            "title_similarity": "0.3972376"
        },
        {
            "id": "hqtgzt3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.22191203"
        },
        {
            "id": "hqthvjf",
            "score": 1,
            "text": "I watched a history of syphilis probably on You Tube.  It originated in about the Middle East, and was originally a common skin condition that required skin to skin contact to transmit.   Most people got it in childhood and were then immune to it.\n\nAs skin contact became more restricted, the germ evolved new opportunities.  It isn't like there will ever be a shortage of people sleeping around!\n\nThe horrendous late manifestations of the new syphilis spread and became common right around the time Spain began to have contact with America.   But it did not come from America.",
            "title_similarity": "0.65436023"
        },
        {
            "id": "hqti8h2",
            "score": 1,
            "text": "Sheep…horses…donkeys…dogs…other non-human primates… \n\nsome people enjoy seriously weird shit.",
            "title_similarity": "0.33863378"
        },
        {
            "id": "hqtjodb",
            "score": 1,
            "text": "Usually what matters is the exchange of bodily fluids. Sex is the main reason that happens, but it can also happen if you have a cut and get something in it, or drink milk from an infected animal, etc. (Some can be passed this way, others not.) So they can spread between species when one eats another, or handles them without being careful.\n\nThat still doesn't answer where they actually came from, though. The answer there is, they evolved like everything else.",
            "title_similarity": "0.6953939"
        },
        {
            "id": "hqtkiq7",
            "score": 1,
            "text": "No one is answering the actual question here: where did they *originate*? \n\nIf animals gave them to use them where did animals get them?",
            "title_similarity": "0.44280052"
        },
        {
            "id": "hqtl926",
            "score": 1,
            "text": "Most STDs are more blood borne pathogens than actually sexually transmitted diseases. Pretty much all seminal fluid or discharges have even a small amount of blood.\n\nSo no, no one had to fuck a monkey to get HIV. Its more likely we got a lot of diseases from hunters getting animal blood on small wounds",
            "title_similarity": "0.65130496"
        },
        {
            "id": "hqtlc0j",
            "score": 1,
            "text": "Gotta leave these poor sick monkeys alone. They’re sick. They got problems enough as it is!",
            "title_similarity": "0.45571885"
        },
        {
            "id": "hqtnftx",
            "score": 1,
            "text": "Well imagine a virus or bacteria that ends up on the genitals.  That virus will evolve to more effectively attack that area.  It needs to spread and persist.  I imagine a bug that went from infecting anywhere to specializing in certain organs or modes of transmission.\n\nSource: My uneducated understanding",
            "title_similarity": "0.47969252"
        },
        {
            "id": "hqtonz0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.22191203"
        },
        {
            "id": "hqtoyiu",
            "score": 2,
            "text": "Viruses are basically the most fundamental life unit that has existed. There are more unique species of virus in a table spoon of water than all nonvirus entities on the planet. There wasn't a time when life existed before viruses, they've always been a part of the equation",
            "title_similarity": "0.54048026"
        },
        {
            "id": "hqtpcaw",
            "score": 1,
            "text": "Where did anything originate from?",
            "title_similarity": "0.23718978"
        },
        {
            "id": "hqttas7",
            "score": 1,
            "text": "Think of covid. It mutated from something else and spread the world in months. STDs just require more personal contact.",
            "title_similarity": "0.56012857"
        },
        {
            "id": "hqtwctm",
            "score": 1,
            "text": "Everyone is like “oh, from animals blah blah”\n\nOkay, and where did the animals get it?",
            "title_similarity": "0.43384355"
        },
        {
            "id": "hqtwrds",
            "score": 1,
            "text": "Transference via blood. \n\nJust because they can get transmitted sexually doesn't mean they have to. \n\nHIV, for example, seems to have originated from being near the blood of SIV-infected apes. Humans were slaughtering them for \"bushmeat\" and the repeat exposures to the foreign virus ended up with a mutated version that could infect humans. There's a bit of research in these cross-species infections. IIRC it requires a lot of frequent re-exposures to get a version that can not only infect one individual but also spread in the new species population. \n\nSo basically viruses constantly mutate. Being around blood and getting infected blood in an open wound or mucus membrane means introducing your own bodily system to it. At that point it just means being exposed to a mutated version of a virus that can infect human cells, and (IIRC) having a repeated exposure. \n\nThis tends to happen where there is a lot of blood, which tends to happen around animal slaughter. Take also, for example, COVID-19 and the \"wet market\" with pangolins and bats. \n\nYou'll find a lot of these new viruses actually stem from eating animals not previously in the diet, but occasionally among existing ones (e.g., swine flu, h1n1).\n\nThey are transferred via blood. Which is why sharing needles can transmit HIV.\n\nIt's just that a lot of blood-transmitted viruses can also be transmitted via sex. And since people today have more sex than they do share blood, they end up getting called STIs/STDs.",
            "title_similarity": "0.56027484"
        },
        {
            "id": "hqtxf66",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.221912"
        },
        {
            "id": "hqtxfin",
            "score": 1,
            "text": "The viruses probably evolved alongside humans. I'll bet herpes has been around before homo sapiens. We probably got them from neanderthals, they got them from denisovians, and so on down the family tree.",
            "title_similarity": "0.49090505"
        },
        {
            "id": "hqtxkbi",
            "score": 1,
            "text": "Herpes simplex 1 is not actually an STI at all. You can get it from sexual contact and you can also get it if you were to touch someone's arm if they were to have a breakout there (they don't happen there but a person could catch it if they did and someone touched it). More than 60 of the people on this planet have some type of herpes virus in their bodies. \n\nAlso nearly 80% have some type of HPV.",
            "title_similarity": "0.6592946"
        },
        {
            "id": "hqtxz94",
            "score": 1,
            "text": "It's like those achievements in video games like \"play with someone that has this achievement\"\nSimply, the devs just give it to people to start the spread",
            "title_similarity": "0.4720811"
        },
        {
            "id": "hqty8f4",
            "score": 2,
            "text": "I have no answer. However I do have one thing to contribute. It's the same for all viruses. You can only get a cold from someone else who has a cold.",
            "title_similarity": "0.61144936"
        }
    ]
}