{
    "ELI5: Why is euthanasia often the only option when a horse breaks its leg?\n": [
        {
            "id": "hqxhylg",
            "score": 18,
            "text": "It isn't the only option.\n\nIt's the *cheapest* option for a racehorse, because having broken its leg the horse will never be able to withstand the strain of racing again.\n\nIn some cases, if the horse has enough of a career, putting it out to stud remains an option, but mostly it's just not worth (economically) the effort.",
            "title_similarity": "0.66898113"
        },
        {
            "id": "hqxgg7e",
            "score": -6,
            "text": "The horse is an animal that needs to run to fully live. If it has a broken leg it will have to limp for the rest of it’s life. Imagine a horse that can’t even walk or ever be able to run. What kind of a life would that be?",
            "title_similarity": "0.6994693"
        },
        {
            "id": "hr1jjhx",
            "score": 1,
            "text": "A reason that I haven't seen mentioned yet:\n\nSome people don't love their horse. Some people think of their horse like an ATV or bicycle.\n\nPeople like that choose to euthanize horses as soon as a vet mentions long recovery time, or money. If a horse gets injured and needs months (or years) of recovery time, that owner can't have fun riding the horse. Someone like that will buy a \"replacement\" horse and regret nothing.",
            "title_similarity": "0.7681129"
        },
        {
            "id": "hqyw0x8",
            "score": 1,
            "text": "Horses are naturally much smaller animals than we've bred them to be.  We bred them to be bigger and have longer bones but the process didn't make their bones any thicker or stronger.  So their bones really aren't strong enough to support their weight.  Other four legged animals can get along on three legs.  Horses cannot.  No one has yet figured out how to get a horse to not put weight on one leg long enough for the bone to heal.\n\nA few years ago there was a racehorse named Barbareau (sp?).  Broke a leg.  Millions of dollars of stud fees at issue.  Literally everything in modern science that could be done was done to save him.  But they couldn't...",
            "title_similarity": "0.69408333"
        },
        {
            "id": "hr0u8fq",
            "score": 1,
            "text": "The correct answer is because we like to pretend we value horses but when it comes to spending money to keep them alive it comes down to money. It's expensive to keep a horse alive and if the cost outweighs buying a new horse people will put it down. \n\nThey will come up with all kinds of excuses but this is the real one.",
            "title_similarity": "0.55242205"
        },
        {
            "id": "hqxiaee",
            "score": 29,
            "text": "It is very expensive to fix a horse's broken leg because when they break they tend to shatter.  \n\nMost of the horses you hear about breaking their legs are race horses which as soon as they break a leg are useless to the owner.  The owner isn't going to shell out tens of thousands of dollars fixing a horse that will even when better will never race again.  So like any business they throw out what isn't worth keeping or sell it to a pet food company or something.\n\nNow, if it's a pet and you can afford it you might be willing to shell out the money to hopefully get it fixed.  However, it quite often won't fully recover and so euthanasia is quite often still at the end recommended.\n\nThis was the same like 100 years ago for a pet cat or dog.  People loved their pet cats and dogs but even the slightest injury meant dad went and got a gun and shot it.  Why?  The cost of a vet back then was hideously expensive for an injured cat or dog.  Even when people loved their cat or dog they couldn't afford to get it fixed.  Today it's a lot cheaper and works more often when dogs and cats get sick or injured.  People today even pay money to get pet goldfish fixed when injured or sick.  20 years ago you whacked it against a table and threw it out.\n\nEdit:\n\nSpelling, how does it work?",
            "title_similarity": "0.74183476"
        },
        {
            "id": "hqxhz0d",
            "score": 29,
            "text": "often its not, the issue is that that kind of damage is extremely difficult to heal properly and the horse will never return to the performance he had before the breakage. Not ot mention the actual healing process is extremely difficult to have a horse be cooperative during a time where they are gonna be in constant pain(+ not being able to have them lie down for extended period of time without hampering their health).\n\nResult:  horse owners, woudl rather not spend the time and money for an animal that wont return to their prime, it's often more financially viable to euthanize",
            "title_similarity": "0.6660653"
        },
        {
            "id": "hqz7yf6",
            "score": 5,
            "text": "In the beginning, there was Eohippus. The proto-horse. It was a small hooved animal about the size of a dog, and it ate grass. It was a simple creature, and in my (factual) opinion it represents the last time that the Horse lineage was untainted by sin. Now, it is worth noting that life was not easy for this proto-horse, in fact life for early hooved mammals was so difficult, that some of them said \"fuck that\" and moonwalked back into the ocean to become cetaceans (Whales and Dolphins). That's right, The proto-horse had so stupid an existence, that hooved mammals went back into the ocean (lacking gills and flippers) and had more success than horses would have on land.\n\nOkay, So why was life so hard for Eohippus? Well, they are herbivores eating almost exclusively grasses. Grasses, as you may know, are not particularly nutritious. But more importantly, grasses are smarter than Horses. See, Grass does not want to be eaten, and evolutionary pressure caused the grasses to start incorporating silica (ie sand) into their structure. Silica is extremely hard. Hard enough to wear down Horse teeth. Now there is another evolutionary pressure acting on Eohippus; It's teeth wear down by the mere act of eating, to the point that it will starve to death. Eohippus teeth do not regrow, instead, Eohippus evolved bigger teeth. However, bigger teeth mean a bigger jaw, bigger head, and a bigger body to carry it.\n\nThese opposing evolutionary pressures started an arms race in which the grasses incorporated more and more silica, and Horses got bigger and bigger, just so they would have big enough teeth to grow and reproduce before finally starving to death. And eventually our cute dog-sized pony evolved into the 1,500-pound, dumb-as-rocks prey animal i loathe today.\n\nBut wait, there's more! See, Horses are extremely fragile. There is a reason why a \"horse doctor\" typically prescribes a dose of double-0 buckshot in the event of a leg injury. A horse is very heavy, and it has very thin legs to carry that weight. If any one leg gets fractured, it is exceptionally unlikely that it will heal well enough for the Horse to walk again, and is extremely likely to break again just carrying the weight of the horse. Remember, a human thigh bone is gigantic relative to the size of our bodies, a horse leg bone is absolutely minuscule relative to the weight it carries.\n\nAlso, Hooves: I want you to imagine that instead of feet, you have a giant toenail at the end of your leg. That is how the Horse do. That is what a hoof is. A giant toenail. It is extremely delicate, and joined to the leg by a vast network of very fine connective tissue, and oh yeah it also bears the weight of a fucking HORSE. If a hoof gets infected (which is quite common, because imagine how often shit would get stuck under your toenails if you walked on them), the Horse immune system responds in the typical way: via inflammation of the area. The problem is, a horse hoof is a rigid \"cup\". It cannot accomodate the swelling from inflammatory response. The Horse hoof will basically pop off the leg like a sock. On top of that, remember the Horse is putting 1,500 pounds of weight on it (because Horses can't redistribute their weight very well since all of their legs can BARELY support their share of the total weight).\n\nSo, Horse apologists will claim that Horses are good at one thing: Turning Grass into Fast. As the previous two paragraphs show, they can't even do that right. Locomotion is very dangerous for a Horse, and if the Fast doesn't kill them they'll starve to death just by eating.\n\nOn top of that, they are dumb as all fuck. Horses will often do something called \"Cribbing\", which is when they decide to bite down on something (literally anything) as hard as they can, and suck in air. They just keep sucking in air until they inflate like a balloon. Eventually, the vet will show up and literally deflate the Horse with a long needle to let the air out of them, and hopefully get them to just... stop...\n\nFirst off, horses are obligate nasal breathers. If our noses are stuffed up we can breathe through our mouths. If our pets' noses are stuffed up (except for rabbits, who are also really fragile but unlike horses aren't stuck having only one baby a year) they can breathe through their mouths. If a horse can't breathe through its nose, it will suffocate and die.\n\nHorse eyes are exquisitely sensitive to steroids. Most animal eyes are, except for cows because cows are tanks, but horses are extremely sensitive. Corneal ulcers won't heal. They'll probably get worse. They might rupture and cause eyeball fluid to leak out.\n\nIf you overexert a horse they can get exertional rhabodmyolysis. Basically you overwork their muscles and they break down and die and release their contents. Super painful, and then you get scarifying and necrosis. But that's not the problem. See, when muscles die hey release myoglobin, which goes into the blood and is filtered by the kidneys. If you dump a bucket of myoglobin into the blood then it shreds the kidneys, causing acutel renal failure. This kills the horse. People and other animals can get that too but in school we only talked about it in context of the horse.\n\nHorses can only have one foal at a time. Their uterus simply can't support two foals. If a pregnant horse has twins you have to abort one or they'll both die and possibly kill the mother with them. A lot of this has to do with the way horse placentas work.\n\nIf a horse rears up on its hind legs it can fall over, hit the back of its head, and get a traumatic brain injury.\n\nNow to their digestive system. Oh boy. First of all, they can't vomit. There's an incredibly tight sphincter in between the stomach and esophagus that simply won't open up. If a horse is vomiting it's literally about to die. In many cases their stomach will rupture before they vomit. When treating colic you need to reflux the horse, which means shoving a tube into their stomach and pumping out any material to decompress the stomach and proximal GI tract. Their small intestines are 70+ feet long (which is expected for a big herbivore) and can get strangulated, which is fatal without surgery.\n\nLet's go to the large intestine. Horses are hindgut fermenters, not ruminants. I'll spare you the diagram and extended anatomy lesson but here's what you need to know: Their cecum is large enough to shove a person into, and the path of digesta doubles back on itself. The large intestine is very long, has segments of various diameters, multiple flexures, and doubles back on itself several times. It's not anchored to the body wall with mesentery like it is in many other animals. The spleen can get trapped. Parts of the colon can get filled with gas or digested food and/or get displaced. Parts of the large intestine can twist on themselves, causing torsions or volvulus. These conditions can range from mildly painful to excruciating. Many require surgery or intense medical therapy for the horse to have any chance of surviving. Any part of the large intestine can fail at any time and potentially kill the horse. A change in feed can cause colic. Giving birth can cause I believe a large colon volvulus I don't know at the moment I'm going into small animal medicine. Infections can cause colic. Lots of things can cause colic and you better hope it's an impaction that can be treated on the farm and not enteritis or a volvulus.\n\nAnd now the legs. Before we start with bones and hooves let's talk about the skin. The skin on horse legs, particularly their lower legs, is under a lot of tension and has basically no subcutaneous tissue. If a horse lacerated its legs and has a dangling flap of skin that's a fucking nightmare. That skin is incredibly difficult to successfully suture back together because it's under so much tension. There's basically no subcutaneous tissue underneath. You need to use releasing incisions and all sorts of undermining techniques to even get the skin loose enough to close without tearing itself apart afterwards. Also horses like to get this thing called proud flesh where scar tissue just builds up into this giant ugly mass that restricts movement. If a horse severely lacerated a leg it will take months to heal and the prognosis is not great.\n\nI hope this information has enlightened you, and that you will join me in hating these stupid goddamn bastard animals.",
            "title_similarity": "0.61034334"
        },
        {
            "id": "hqxuptl",
            "score": -3,
            "text": "The brutal truth is: becos it takes too much effort and costly equipment to do otherwise.\n\nRedditors have this obsession with explaining away facts with irrelevant trivialities, when you can literally read countee-arguments being made that dismantle their narrative.\n Proof: comments below.",
            "title_similarity": "0.48878568"
        },
        {
            "id": "hr0550j",
            "score": -1,
            "text": "people love to murder animals and put it under the guise of \"they're no longer suffering.\"  let them die at home naturally with pain meds around loved ones. not in some strange vet.offoce with weird smells and strangers.",
            "title_similarity": "0.5625192"
        },
        {
            "id": "hqxtw67",
            "score": 0,
            "text": "What is the purpose of a horse?",
            "title_similarity": "0.3429189"
        },
        {
            "id": "hqy1a1c",
            "score": 0,
            "text": "Is it possible for a horse to live with only 3 legs? Like an amputation or born that way",
            "title_similarity": "0.60174996"
        },
        {
            "id": "hqy3up4",
            "score": 0,
            "text": "Here's a question. Would it be better to amputated the leg and then attach a prosthetic?",
            "title_similarity": "0.50546277"
        },
        {
            "id": "hqy4jzy",
            "score": 0,
            "text": "Why cant they make wheelie carts like they do for dogs? Lol",
            "title_similarity": "0.4845898"
        },
        {
            "id": "hqy5j2g",
            "score": 0,
            "text": "Cant they cast it, and give it one of those leg rolly things until its all healed?",
            "title_similarity": "0.5495987"
        },
        {
            "id": "hqy5skt",
            "score": 0,
            "text": "Question: can humans not create bionic legs for them, is it just cost?",
            "title_similarity": "0.44571108"
        },
        {
            "id": "hqygaas",
            "score": 0,
            "text": "It's a sad reality. Maybe in the future they can use 3d printing and titanium fused to fix the broken bone.",
            "title_similarity": "0.5480393"
        },
        {
            "id": "hqyr8il",
            "score": 0,
            "text": "I owned several horses was a horse girl all my early life and it was just one of those things. Cheaper to buy a new horse than get surgery and hope maybe the horse gets better",
            "title_similarity": "0.55865085"
        },
        {
            "id": "hqyz06r",
            "score": 0,
            "text": "So legit question.....we can't suspend them from trees or sum and have them \"lay\"???? Like I think obviously the horse will just get fed up like us and try to get out but if it's body were security wrapped and then fed u think it'd help?????? I'm just trynna find solutions since I know they only stand",
            "title_similarity": "0.6350329"
        },
        {
            "id": "hqzdh54",
            "score": 0,
            "text": "It's probably the most humane option.\n\nMany farmers and country bumpkins will simply shoot the horse though. A large caliber rifle isn't required, but accuracy and precision is a must if the round isn't that powerful. \n\nI've also heard of farmers gassing wounded animals so that it's similar  to falling asleep peacefully.\n\nAlso seen em use the bolt gun that they use to kill cattle. Its reusable and does the job as long as the person using it knows what they are doing.\n\nAnd if you were a sick SoB you could probably drown a horse with a broken leg but that would require a crazy amount of effort and would be very inhumane.\n\nSo, euthanasia is used because it is probably the most humane way to kill a horse with a broken leg. It may not be the cheapest, but it is very humane and a very peaceful way to go.",
            "title_similarity": "0.70262533"
        },
        {
            "id": "hr09p89",
            "score": 0,
            "text": "In case no one has linked this before, here is an explanation written. https://deadinsidedressage.tumblr.com/post/190045047905/ooof-cant-believe-someone-actually-thought/embed",
            "title_similarity": "0.46695346"
        },
        {
            "id": "hr11udr",
            "score": 0,
            "text": "Horses like to run and leaving them alive with a broken leg is an act of torture to the horse. \n\nSince it isn’t a human being, putting it down is allowed and perhaps the right thing to do.",
            "title_similarity": "0.69044685"
        },
        {
            "id": "hr17m57",
            "score": 0,
            "text": "Never seen a three legged horse!  You?",
            "title_similarity": "0.41591638"
        },
        {
            "id": "hr1watb",
            "score": 0,
            "text": "I’ve read the answers and I have to ask, isn’t their like a baby walker but for horses while the leg/hoove heals, or will the leg just break again",
            "title_similarity": "0.7282909"
        },
        {
            "id": "hr1yn0o",
            "score": 0,
            "text": "Can’t you just give it metal legs?",
            "title_similarity": "0.25338286"
        },
        {
            "id": "hr1zrak",
            "score": 0,
            "text": "Because it’s to old for infanticide?",
            "title_similarity": "0.4587609"
        },
        {
            "id": "hr2439h",
            "score": 0,
            "text": "They are like Saiyans. If they get really fcked up and heal back to normal they become incredibly more powerful. Can't let that happen, it would be chaos!",
            "title_similarity": "0.4269025"
        },
        {
            "id": "hr294p5",
            "score": 0,
            "text": "Money. A race horse that breaks their leg can never race again, even if it heals. They can not be used to breed who wants genetics with weak bones.  Cut your losses and collect the insurance. That’s the real answer. Oh and the farmer in this situation who is barely making ends meet can’t afford to rehab the horse.",
            "title_similarity": "0.71925616"
        },
        {
            "id": "hr36tme",
            "score": 0,
            "text": "Well there also youth in africa, but its pretty much the same thing but with killer dance moves.",
            "title_similarity": "0.21129079"
        },
        {
            "id": "hue544b",
            "score": 0,
            "text": "Youth in Asia?? I think that's how Asian folks are only allowed to have a certain #  of children, no? Has absolutely nothing to do with horses",
            "title_similarity": "0.42832208"
        },
        {
            "id": "hv3iz07",
            "score": 0,
            "text": "Horse break leg, body no work right if only on 3 legs, other legs go bad too. Horsey suffers. Horsey goes night night forever",
            "title_similarity": "0.6968523"
        },
        {
            "id": "hqxorb7",
            "score": -6,
            "text": "I asked the very same question and I got the all the responses below. But what it really came down to for most was cost. There are harnesses that can be used to keep good blood flow, but the cost of care usually out weighs the worth 9f the horse for general owners.",
            "title_similarity": "0.5965128"
        },
        {
            "id": "hqxvsb4",
            "score": 1,
            "text": "Because it's often not financially viable to spend more money on a horse that will never get back up to its prime considering the things the horse would have to go through just for that broken leg to heal. It can be done but It's going to be expensive thinking economically it's much for viable to raise another horse than to spend resources on a broken one.",
            "title_similarity": "0.6108296"
        },
        {
            "id": "hqxzvnt",
            "score": 1,
            "text": "Actually, it isn't. Horses can get surgery and have steel plates and screws installed.  However, it all depends on the horse's age, job, and the break, well that and the owner's financial abilities.",
            "title_similarity": "0.6398556"
        },
        {
            "id": "hqydd41",
            "score": 1,
            "text": "Because horses are fucking huge. They’re too heavy to carry and the ambulance is too small to take them. \n\nA bullet in the head is a kindness for everyone involved.",
            "title_similarity": "0.638837"
        },
        {
            "id": "hqytbmn",
            "score": 1,
            "text": "Actual horse person: Fractures are actually more treatable in this day and age than most soft tissue injuries. With that said, if a horse is non weight bearing, which is the context that you most often see this in, it’s very challenging to rehabilitate without causing damage to the opposite hoof from the extra weight. Most fractures that horses have are more along the lines of causing them to limp versus be on three legs, but not everyone has access to the kind of diagnostics needed, so perhaps they’re just not identified and lumped in as “hurt leg, let him rest a while”",
            "title_similarity": "0.6915772"
        },
        {
            "id": "hqz61xm",
            "score": -1,
            "text": "But I mean, humans get casts and still move around?",
            "title_similarity": "0.107091576"
        },
        {
            "id": "hqzttqp",
            "score": -1,
            "text": "What if they tied the horse down for a few weeks to remove all weight on the leg? It would be tough for the horse but at least it wouldn’t have to die?",
            "title_similarity": "0.713158"
        },
        {
            "id": "hr2836k",
            "score": -1,
            "text": "Because the humans who own the horses don't want to care for a permanently damaged horse. They don't need to be killed. They could be taken care of. But humans don't give a shit about damaged race horses. They will race them into the ground in the Alberta Rodeo and then kill them right on the spot when they hurt them.",
            "title_similarity": "0.620128"
        },
        {
            "id": "hr2sg01",
            "score": -1,
            "text": "It isn't. There are ways to heal the animal if you want to out the time and effort into it.",
            "title_similarity": "0.46384114"
        },
        {
            "id": "hqybu00",
            "score": -2,
            "text": "TIL this is something that is still being done? I thought shooting the horse with a broken leg was something they did back in the 1800's or whenever. I thought surely medical technology had improved to the point where an animal didn't have to be euthanised over a bone fracture.\n\nHurry up nanotechnology you got horses to save!",
            "title_similarity": "0.70876634"
        },
        {
            "id": "hqz2d04",
            "score": -2,
            "text": "How in the blue hell did this get so many upvotes? That many people really couldn’t figure that out on their own?? Y’all need some critical thinking skills.",
            "title_similarity": "0.3944447"
        },
        {
            "id": "hqzhynk",
            "score": -2,
            "text": "What about a wheelchair for the horse to support either the front or rear of the horse?",
            "title_similarity": "0.44309837"
        },
        {
            "id": "hr04u8d",
            "score": 2,
            "text": "It's the kindest option.\n\nBroken bones require a lot of time to heal and they screw up your balance/weight distribution. It's difficult for us humans to heal after breaking a leg and we're able to sit!\n\nHorses don't have that option and because of the way they lay down, having a broken leg makes that near impossible. Then take into account that they're now down to three working legs, that messes up their weight distribution a *lot* all the while they're forced to stand. All equines are front-heavy so taking away a leg, whether it's front or back, is going to hurt them long term. Now add in there's the pain from the broken leg and that really messes them up. \n\nThen we can get into where the break is. If it's up near their elbows/stifle then getting a cast on them is going to be incredibly difficult if not impossible.\n\nAnd if this didn't seem like enough to deal with, on average a horse (not minis/ponies/drafts) can weight anywhere between 800-1600lbs. That's a lot of weight to be on only three hooves (and that can cause a whole bunch of extra issues with those three hooves).\n\nSo between all those issues (and more, since every horse and their homes are different) it really is the kindest option.",
            "title_similarity": "0.72272843"
        },
        {
            "id": "hr1eovw",
            "score": 2,
            "text": "It's not.  The horse just may not be rideable or workable, hence waste of food so traditionally you would put them down.  Dunno why a supposed vet is saying you can't because it can cause laminitis which not only have I seen horse have broken legs healed, I've seen horses with laminitis rehabbed to the point of comfort.  Neither needs be a death sentence.",
            "title_similarity": "0.7652712"
        },
        {
            "id": "hr1g1f0",
            "score": 2,
            "text": "Why you gotta blame the youth in Asia?",
            "title_similarity": "0.32743418"
        },
        {
            "id": "hqyp0vt",
            "score": 4,
            "text": "Is it not. I am an equine veterinarian and there are a lot of things to discuss here. There are some fractures that are harder to treat, like fractures close to the shoulder, that involve a big joint or got contaminated, for these the odds are super bad. But most of the long bone and toe fractures are treatable via surgery (usually using pins and plates). Now, the problem is that these surgeries are expensive and not everyone can afford them and the horse will not naturally heal, so instead of leaving the horse to die on its own, we usually choose euthanasia to avoid more pain. As mentioned before, horses are not the best patients, especially when in pain and will not stand still, and if they lie down for too long they will suffer muscle problems initially and eventually gastrointestinal issues that will end in death. Also, if the skin breaks, the bones become easily infected and this can lead to sepsis and a slow death too.\n\nSo these accidents can happen in nature too but there are some things we have done as humans that make it worse, especially working horses at a very young age, which is what happens in racetracks. But it is important to consider that horses are athletes, with good training and nutrition, patience and respect, and a bit of good luck, you can have a friend/ partner to go for many miles and many many years.",
            "title_similarity": "0.73803127"
        },
        {
            "id": "hqy8wtc",
            "score": 7,
            "text": "Horses don't listen to physical therapists for one.  Complete recovery then becomes near impossible and the horse won't ever be right again and it may even be in pain for the remainder of its life.  Then there's the economics of the situation: The surgery required to fix a leg is many times what the cost of the horse and probably not on the cards for people with limited money.  \n\nYou do see drastic measures taken for horses that are extremely expensive, like those that people pay hundreds of thousands of dollars for their offspring...",
            "title_similarity": "0.712648"
        },
        {
            "id": "hqxqdz4",
            "score": 99,
            "text": "As everyone is saying expense is a major factor.  But horses have lot of problems standing still.  First they actually are standing on a single fingernail and don’t have much muscle in there legs.  There’s a couple tendons and blood vessels and the bone that’s it.  The frogs in their hooves act as four extra hearts driving the blood back up their legs with every step.  If the can’t even pace around their stall a little they have a lot of issues.  Barbaro didn’t die a broken leg.  His owner was filthy rich and threw all the money at the problem and it wasn’t enough.  Barbaro died because the bone in his other front leg rotated and punched through his hoof.  \nRuffian was another racehorse that they tried to save.  She completely freaked out in the harness.  They had to put her down.  \nHorses also have very sensitive digestion.  They really are meant to be moving 24/7.  Grazing a few bites, walking a few steps, checking for predators, grazing a bit more.  Their digestion doesn’t work right if they can’t move.  Not to mention the ulcers from the stress of being away from their herd mates.  And the danger of taking care a confined panicked prey animal whose kick can kill you.  \nNot exactly the same situation but I accidentally bought a pregnant mare.  Blackberry is a sweet girl, very well trained.  A former school horse that little kids rode.  Several times I had her in the cross ties to groom her while her foal just roamed around the tack up area.  Blackberry stood still for a while but when she thought she should check on her baby, you got to see how strong and smart she really was.  She just leaned back slowly testing the strength of the halter until the metal buckle snapped and she could back up and find her foal.  No panicking, no thrashing, no white eyes or pinned ears.  Just calmly and deliberately breaking her halter cause she didn’t want to be confined while her baby was in danger.  And once she could see that she could get to the foal if she wanted to she stood still a let me groom her.",
            "title_similarity": "0.65124017"
        },
        {
            "id": "hqyb1sz",
            "score": 8,
            "text": "All this wonderful medical technology…, and we can’t even fix a horse’s bones…. It just doesnt seem right",
            "title_similarity": "0.6242451"
        },
        {
            "id": "hqxppqd",
            "score": 97,
            "text": "[removed]",
            "title_similarity": "0.14688702"
        },
        {
            "id": "hqzos9z",
            "score": 10,
            "text": "Why does nobody on this subreddit explain things like were five?",
            "title_similarity": "0.3820227"
        },
        {
            "id": "hqxrbjz",
            "score": 456,
            "text": "Vet here. People are tossing around a lot of absolutes (only the sith deal in absolutes) in these comments, which are missing the subtlety of the situation. The missing components are: 1) that the fracture conformation (shape and orientation) and location (which bone) have a large impact on the ability to stabilize the fracture and heal appropriately, and 2) that the use/job of the horse is often a major determinant of the owners willingness to pursue treatment, aside from finances.  As people are saying, a thoroughbred racehorse with a catastrophic breakdown fracture will most often be career ending, even if it could be repaired.  The same fracture in a rich person's pleasure horse that is fine being a pet or pasture ornament might receive treatment, even with a guarded prognosis to complete soundness (walking without a limp).",
            "title_similarity": "0.72922873"
        },
        {
            "id": "hqxuunm",
            "score": 28,
            "text": "Honestly it's amazing we used horses for transport at all. They are huge skittish fragile animals that are immune to logic or reason. They seem to get massive infections from the smallest cuts and broken bones just simply don't heal.",
            "title_similarity": "0.62416625"
        },
        {
            "id": "hqxvf7s",
            "score": 139,
            "text": "A saying among equine vets is that horses have five hearts. Each hoof contributes to whole-body circulation. A horse with one leg out of commission has more health problems  than  just the  leg. It immediately becomes either a financial liability or a gamble. It's sad, but that's the system we've created.\n\nA horse will try to walk on a broken leg, preventing a callus (new bone) from developing at the break. An intramedullary pin/nail is an option, but a very expensive one. Farm horses won't get one. Even a race horse won't get one unless it's already a big winner and its sperm is sufficiently marketable to much more than offset the combined costs.\n\nIt sucks.\n\nEdit: Sorry, I got caught up and blew the ELI5 part.",
            "title_similarity": "0.79683316"
        },
        {
            "id": "hqxqedi",
            "score": 34,
            "text": "As said, it is very difficult to recover from because the horse has to put weight somewhere, and horses are pretty heavy. Their single bone support in the lower leg of each limb doesn't help, compared to other hoofed animals which often fare better with multiple toes spreading the weight better.  \n  \nIf a horse does actually keep enough weight off of the broken leg to heal, the strain on the other three legs is sufficient to cause harm. And at this point, the horse is trapped in a no-win situation.  \n  \nAdditional thought: I suspect this is less applicable to zebra, wild ass and land race type ponies. All have shorter, stockier legs than racehorses. Natural selection against artificial.",
            "title_similarity": "0.7080469"
        },
        {
            "id": "hqxtvvf",
            "score": 3027,
            "text": "[removed]",
            "title_similarity": "0.14688702"
        },
        {
            "id": "hqxwqn0",
            "score": 448,
            "text": "Ok I don't know how to link to comments, so I'll just credit u/Walshy231231 for this answer that I saved a year ago. I don't even remember the question at this point, but the comment made me laugh so hard (having grown up with horses) that I had to save it. Apologies if formatting is an issue.\n\nu/Walshy231231 : Well, in the beginning, there was Eohippus. The proto-horse. It was a small hooved animal about the size of a dog, and it ate grass. It was a simple creature, and in my (factual) opinion it represents the last time that the Horse lineage was untainted by sin. Now, it is worth noting that life was not easy for this proto-horse, in fact life for early hooved mammals was so difficult, that some of them said \"fuck that\" and moonwalked back into the ocean to become cetaceans (Whales and Dolphins). That's right, The proto-horse had so stupid an existence, that hooved mammals went back into the ocean (lacking gills and flippers) and had more success than horses would have on land.\n\nOkay, So why was life so hard for Eohippus? Well, they are herbivores eating almost exclusively grasses. Grasses, as you may know, are not particularly nutritious. But more importantly, grasses are smarter than Horses. See, Grass does not want to be eaten, and evolutionary pressure caused the grasses to start incorporating silica (ie sand) into their structure. Silica is extremely hard. Hard enough to wear down Horse teeth. Now there is another evolutionary pressure acting on Eohippus; It's teeth wear down by the mere act of eating, to the point that it will starve to death. Eohippus teeth do not regrow, instead, Eohippus evolved bigger teeth. However, bigger teeth mean a bigger jaw, bigger head, and a bigger body to carry it.\n\nThese opposing evolutionary pressures started an arms race in which the grasses incorporated more and more silica, and Horses got bigger and bigger, just so they would have big enough teeth to grow and reproduce before finally starving to death. And eventually our cute dog-sized pony evolved into the 1,500-pound, dumb-as-rocks prey animal i loathe today.\n\nBut wait, there's more! See, Horses are extremely fragile. There is a reason why a \"horse doctor\" typically prescribes a dose of double-0 buckshot in the event of a leg injury. A horse is very heavy, and it has very thin legs to carry that weight. If any one leg gets fractured, it is exceptionally unlikely that it will heal well enough for the Horse to walk again, and is extremely likely to break again just carrying the weight of the horse. Remember, a human thigh bone is gigantic relative to the size of our bodies, a horse leg bone is absolutely minuscule relative to the weight it carries.\n\nAlso, Hooves: I want you to imagine that instead of feet, you have a giant toenail at the end of your leg. That is how the Horse do. That is what a hoof is. A giant toenail. It is extremely delicate, and joined to the leg by a vast network of very fine connective tissue, and oh yeah it also bears the weight of a fucking HORSE. If a hoof gets infected (which is quite common, because imagine how often shit would get stuck under your toenails if you walked on them), the Horse immune system responds in the typical way: via inflammation of the area. The problem is, a horse hoof is a rigid \"cup\". It cannot accomodate the swelling from inflammatory response. The Horse hoof will basically pop off the leg like a sock. On top of that, remember the Horse is putting 1,500 pounds of weight on it (because Horses can't redistribute their weight very well since all of their legs can BARELY support their share of the total weight).\n\nSo, Horse apologists will claim that Horses are good at one thing: Turning Grass into Fast. As the previous two paragraphs show, they can't even do that right. Locomotion is very dangerous for a Horse, and if the Fast doesn't kill them they'll starve to death just by eating.\n\nOn top of that, they are dumb as all fuck. Horses will often do something called \"Cribbing\", which is when they decide to bite down on something (literally anything) as hard as they can, and suck in air. They just keep sucking in air until they inflate like a balloon. Eventually, the vet will show up and literally deflate the Horse with a long needle to let the air out of them, and hopefully get them to just... stop...\n\nFirst off, horses are obligate nasal breathers. If our noses are stuffed up we can breathe through our mouths. If our pets' noses are stuffed up (except for rabbits, who are also really fragile but unlike horses aren't stuck having only one baby a year) they can breathe through their mouths. If a horse can't breathe through its nose, it will suffocate and die.\n\nHorse eyes are exquisitely sensitive to steroids. Most animal eyes are, except for cows because cows are tanks, but horses are extremely sensitive. Corneal ulcers won't heal. They'll probably get worse. They might rupture and cause eyeball fluid to leak out.\n\nIf you overexert a horse they can get exertional rhabodmyolysis. Basically you overwork their muscles and they break down and die and release their contents. Super painful, and then you get scarifying and necrosis. But that's not the problem. See, when muscles die hey release myoglobin, which goes into the blood and is filtered by the kidneys. If you dump a bucket of myoglobin into the blood then it shreds the kidneys, causing acutel renal failure. This kills the horse. People and other animals can get that too but in school we only talked about it in context of the horse.\n\nHorses can only have one foal at a time. Their uterus simply can't support two foals. If a pregnant horse has twins you have to abort one or they'll both die and possibly kill the mother with them. A lot of this has to do with the way horse placentas work.\n\nIf a horse rears up on its hind legs it can fall over, hit the back of its head, and get a traumatic brain injury.\n\nNow to their digestive system. Oh boy. First of all, they can't vomit. There's an incredibly tight sphincter in between the stomach and esophagus that simply won't open up. If a horse is vomiting it's literally about to die. In many cases their stomach will rupture before they vomit. When treating colic you need to reflux the horse, which means shoving a tube into their stomach and pumping out any material to decompress the stomach and proximal GI tract. Their small intestines are 70+ feet long (which is expected for a big herbivore) and can get strangulated, which is fatal without surgery.\n\nLet's go to the large intestine. Horses are hindgut fermenters, not ruminants. I'll spare you the diagram and extended anatomy lesson but here's what you need to know: Their cecum is large enough to shove a person into, and the path of digesta doubles back on itself. The large intestine is very long, has segments of various diameters, multiple flexures, and doubles back on itself several times. It's not anchored to the body wall with mesentery like it is in many other animals. The spleen can get trapped. Parts of the colon can get filled with gas or digested food and/or get displaced. Parts of the large intestine can twist on themselves, causing torsions or volvulus. These conditions can range from mildly painful to excruciating. Many require surgery or intense medical therapy for the horse to have any chance of surviving. Any part of the large intestine can fail at any time and potentially kill the horse. A change in feed can cause colic. Giving birth can cause I believe a large colon volvulus I don't know at the moment I'm going into small animal medicine. Infections can cause colic. Lots of things can cause colic and you better hope it's an impaction that can be treated on the farm and not enteritis or a volvulus.\n\nAnd now the legs. Before we start with bones and hooves let's talk about the skin. The skin on horse legs, particularly their lower legs, is under a lot of tension and has basically no subcutaneous tissue. If a horse lacerated its legs and has a dangling flap of skin that's a fucking nightmare. That skin is incredibly difficult to successfully suture back together because it's under so much tension. There's basically no subcutaneous tissue underneath. You need to use releasing incisions and all sorts of undermining techniques to even get the skin loose enough to close without tearing itself apart afterwards. Also horses like to get this thing called proud flesh where scar tissue just builds up into this giant ugly mass that restricts movement. If a horse severely lacerated a leg it will take months to heal and the prognosis is not great.\n\nI hope this information has enlightened you, and that you will join me in hating these stupid goddamn bastard animals.",
            "title_similarity": "0.60846734"
        },
        {
            "id": "hqxpwpo",
            "score": 1268,
            "text": "Horses are on their legs most of the time. They sleep standing up for the most part. They can’t lay down for extended periods of time because their weight will start damaging their internal organs. Placing their weight on 3 legs for an extended time will cause other complications, like founder for example, which are equally as terrible. There is at least one small bone I know of, the sesamoid, that can be healed.  But usually when someone refers to a broken leg this is not the type of break that they are referring to. Unfortunately, a major fracture does spell disaster. Every owner I know would love to have a fix, but there is not one, at least not a good one.",
            "title_similarity": "0.7047527"
        },
        {
            "id": "hqxm7i8",
            "score": 18302,
            "text": "Because a horse needs to stand up and move to be healthy.  Horses do not sit down.  They often sleep standing up.\n\nThey aren't designed to be off their feet for extended periods of time.\n\nA horse will never stay still long enough for a leg to heal properly. They are just massive animals, whose bones are massive, but fundamentally little different than yours or mine,, and can only heal slowly.\n\nIf the break is bad enough, then there is just no way to keep the animal from being in constant torture.  It will put weight on the broken leg. Any healing that may have occurred will be undone.  The horse will be in incredible pain.  Repeat daily until the horse is driven mad.\n\nIt has everything to do with compassion for the animal.\n\nIt has very little to do with cost. If it were possible to immobilizer a horse long enough for a fracture to heal, they would have figured it out centuries ago.  But there isn't. \n\nThese are not 100lb dogs.  These are 600-800lb horses. [Fixed typos]",
            "title_similarity": "0.6733824"
        },
        {
            "id": "hqxxy2d",
            "score": 6092,
            "text": "Vet here. Something major that I’m not seeing anyone else mention is a condition called laminitis. (Or founder). When a horse has an injured leg, they will put all the extra weight on their other 3 legs. This additional pressure will cause laminitis - the layers of their hoof wall will literally fall apart, even to the point of their bones pushing through the bottom of their hooves. At this point, euthanasia is a kindness because there really isn’t anything that can be done once it reaches this point. Horses can recover from lesser degrees of laminitis but not when they only have 3 legs to stand on. :-(",
            "title_similarity": "0.7839497"
        },
        {
            "id": "hqxtltp",
            "score": 2,
            "text": "So from what I gather in the comments, does it mean that people who practice horse jumping  are actually putting them at a fairly high risk of death if they break their legs?",
            "title_similarity": "0.7595206"
        },
        {
            "id": "hqxy7rj",
            "score": 6,
            "text": "Let me put it this way, if there was a method to quickly fix a horse’s broken leg without injuring the animal further, we would’ve invented it already back when they were the only method of transportation.",
            "title_similarity": "0.6941031"
        },
        {
            "id": "hqy05lk",
            "score": 2,
            "text": "The problem you run into, ultimately, is with a horse's digestive tract. A horse's digestive system is like a super high revving racing engine. When it's working properly, it turns 15 hours worth of constant eating grasses into 25 pounds of poop every day. Whereas a cow's digestive system is made to extract as much nutrition as possible from whatever it's eating, a horse's digestive system is made to process as much food as possible as fast as possible.\n\nAny disturbance to that system and it locks up... Often killing the horse. It's called colic. \n\nSomething as simple as changing the type of grass a horse is grazing on can cause a complete crash of a horse's high speed digestive system.\n\nIt's that digestive system that prevents you from, for example, suspending the horse in a harness for two months while a leg heals.",
            "title_similarity": "0.63120747"
        },
        {
            "id": "hqy1oeg",
            "score": 3,
            "text": "reading this and the comments, are bringing tears to my eyes.  We had horses when we lived out in the country, we had 20 acres and got a couple of horses, we even adopted a Mustang as well.  The kids loved them, and we did trail rides as well as a few parades.  We didnt  have race or special registed horses, just for pleasure.  What every was saying is essentially true, horses do sleep laying down, but also standing up.  We had horses for over 10 years, and yes their digestive tracks are sensitive, we had to use a harness and suspended one for overnight by the tractor loader due to founder and laying down too long. With all that work, the poor animal still did not make it.  we also had a horse break her leg somehow during a ice storm, a few years later.  with the Vet there, there was nothing we could do for her, this was one of our favorite horses.  The vet had to put her down, it was something I never want to see again.   These horses were just for pleasure and riding, never abused.  Another note, is that Horses are  \"prey\" animals,, which means they survival means they have to be able to run. they have been bred that way.  even if they  are safe at home, even mustangs need to  be able to run.  so any length of time on the ground can be fatal.  and a long term harness to hold them up one work.    Sorry for the long reply, but brought a lot of memories.",
            "title_similarity": "0.6409789"
        },
        {
            "id": "hqy1ziu",
            "score": 3,
            "text": "Also if they don’t move around or are able to not bear weight on one leg they’ll often develop laminitis in the other hooves which is a big problem in and of itself.",
            "title_similarity": "0.5258182"
        },
        {
            "id": "hqy2nar",
            "score": 2,
            "text": "So the Peppa Pig episode on which Pedro Pony breaks his leg and goes to the hospital is not completely accurate?",
            "title_similarity": "0.73355937"
        },
        {
            "id": "hqy6btq",
            "score": 2,
            "text": "All you need to do it look at what the owners, trainers, and veterinarians put Barbaro through.\n\nThey did everything possible for the horse, and used literally every treatment money could buy.\n\nThe problem is that horses will develop laminitis carrying too much weight on one leg.\n\nSo you have one leg hurt, and the other one well on its way to being hurt.\n\nPlenty of people argue that even *attempting* the surgery was cruel, since even some of the best equestrian veterinarians only gave him a 50% chance of survival, even assuming a successful surgery.\n\nI'll leave aside the discussion on the ethics of horse racing for another time, I use this horse as an example of how difficult it is for a horse to recover from a leg injury even if it's owners have all the money in the world to throw at it.\n\nAnyone who doesn't have millions to spend on these treatments will have absolutely no choice.",
            "title_similarity": "0.74385667"
        },
        {
            "id": "hqy9m8r",
            "score": 2,
            "text": "Horses have very few blood vessels below the knee. A fracture usually tears enough of them that it's nearly impossible for the break to heal... Their body simply can't get enough repair material into the break.\n\nAlso, the torn blood vessels almost always lead to major infections since the injury occurs in dirt. Once infected, the lack of fresh blood to the area makes it impossible to filter out germs. The horse will get some awful disease rather quickly.\n\nHorses just evolved this way. It makes some sense... In the wild, animals don't normally heal from major breaks... Predators would pick them off in days. In the wild they're doomed anyway, little reason to evolve the structures that would repair and major fracture.",
            "title_similarity": "0.71921664"
        },
        {
            "id": "hqya7xf",
            "score": 2,
            "text": "There was a post a few months back about how horses just WANT to die. Not literally but the poster pointed out all the various seemingly innocuous things that can kill a horse. It was kind of shocking. I don’t actually remember the details but it was like the P&R meme. Eat too much grass, dead. Not enough grass also dead. Run too fast, dead. Not run fast enough? Also dead. etc etc",
            "title_similarity": "0.7684003"
        },
        {
            "id": "hqyaa6d",
            "score": 2,
            "text": "Equine vet reply : horses weigh a lot. Spreading weight over 3 legs is a no go. They're poorly designed. Essentially, horse anatomy is crap. Their hoof is our finger equivalent. \nThis is from my partner. She also added in a dozen long words I excluded...",
            "title_similarity": "0.7434109"
        },
        {
            "id": "hqyedt4",
            "score": 5,
            "text": "Often it is the case, however as most things their are outlier cases. It really depends on the break/fracture etc. Cost and the financial ability of the owner is another big factor that comes into play. An incomplete fracture that hasn’t affected the joint is often seen as a decent candidate for screws and casting and will more times than not heal to allow the horse at minimum a lasting pain-free life in the pasture. At best total resumption of work and full range of motion etc. This last fall I had a mule fracture his cannon bone from the top of the fetlock joint to the exterior of the cannon bone along a vertical line. I opted for just casting him and then stall time. He spent 5 weeks in a cast and another 5 weeks in the stall after removal and just recently is back in the pasture and is back to probably around 90% of what he was pre-fracture. I am confident with continued rehab, strengthening and some patience he will be very close to what he once was in terms of strength and agility. Just wanted to remind everyone that a break isn’t always a death sentence and with advancements in vet technology etc. outlooks are much more positive when these unfortunate events take place.",
            "title_similarity": "0.69338953"
        },
        {
            "id": "hqyf3nu",
            "score": 1,
            "text": "Euthanasia is not the only option. There is a way to heal broken bones on a horse but it's a bit expensive. Horses cant lie down for more than 3 hours or so. Any longer and the compressed tissues begin to  experience ischemia or hypoxia. Basically, horses' own body weight restricts blood flow to any tissues that are compressed; this tissue becomes starved of oxygen (ischemia). When blood flow is restored, ischemia reperfusion occurs. For reasons not entirely understood, the compressed tissues become swollen and inflamed when blood is returned. This inflammation causes a lot of damage (reperfusion). Since we dont understand how to prevent the swelling from reperfusion, most attempts at healing broken bones involve protecting the animal from getting ischemia in the first place. One idea is to mend the broken bone then suspend the horse in a pool of saline water. Adding buoyant pads to keep the horse afloat and immobilizing the broken limb. Letting the horse float removes the risk of reperfusion injury.",
            "title_similarity": "0.7565971"
        },
        {
            "id": "hqygsz7",
            "score": 1,
            "text": "So wild horses can't break legs and survive?",
            "title_similarity": "0.6313734"
        },
        {
            "id": "hqyjqp1",
            "score": 1,
            "text": "Veterinarian here. Full disclosure, I am not really that into equine medicine but I'm a new graduate so I had to study this stuff only a months-years ago. It's part of the training.\n\nThe premise here isn't really true. Orthopaedic surgery is a common thing done in equine veterinary practice all over the world. The idea that horses are put down over a broken limb can be true but it's more of a meme than fact in my opinion though I admit I've only seen referral practice at university so far from the reality of GP.\n\nAs other's have mentioned, horses, 'by design' need to stand on their legs so a fracture is often a big problem. That being said, there are means of stabilizing the leg pre and post-op that allows for the horse to survive with a broken limb.\n\nOften times it is cost and logistics that prohibits treatment. Race horses in particular may never reach their full genetic potential after a fracture due to the muscle atrophy that can happen during recovery to name an example.\n\nOpen fractures are a common indication for euthanasia but this is largely due to the low chance of fixing the fracture without causing a septic inflammation of the bone/bone marrow.",
            "title_similarity": "0.6733556"
        },
        {
            "id": "hqyov3i",
            "score": 2,
            "text": "Imagine you're an Olympic runner and you train for hours daily. You completely shatter your right leg. Well, horses can't just stop training for hours daily. They hardly ever lay down at all. They will feel that pain for years and it'll never heal because they won't be able to get off of the leg. It's considered extremely cruel to keep a horse alive after it breaks it's leg in some way. Now small injuries can sometimes be healed, but it's rare and has to be small enough that they can still walk on it regularly.",
            "title_similarity": "0.60841435"
        },
        {
            "id": "hqypxrg",
            "score": 1,
            "text": "If there was any way to offload the horse long enough for the leg to heal the muscles would be so atrophied the horse would never walk again anyway",
            "title_similarity": "0.7276654"
        },
        {
            "id": "hqyt66f",
            "score": 3,
            "text": "Usually because when a Horse breaks a leg it shatters and is largely irrecoverable in the process. The bones typically fragment into hundreds of splinters everywhere, which means the wound will almost always be a point of aggravation, and a constant potential source of internal damage/bleeding, and its basically impossible to mend the break due to the type of damage sustained in the break. If Horse bones broke cleaner like Human breaks tend to, then it wouldn't be such an \"impossible\" task.\n\nUltimately its more an act of kindness than it is one of avoidance of cost. The Horse will never be the same following a broken leg, if it ever even heals properly its other 3 legs will have structural damage from supporting the Horse, typically in Joints namely knees and hips, as well as muscle damage from over strain.\n\nOne of the largest concerns with repairing a Horses leg, and getting it to stay off it until it heals is infections in the hooves. A horse who can't run will typically end up getting Lamintis, or Abscess in the bones/ligaments in its feet. Lamintis is a particularly concerning issues as it results in the whole lower floor of the Hoof becoming pivoted and therefore the typically even weight distribution across the bones and ligaments of the foot is pushed towards the \"toe\", as this happens the Horse will more and more be incapable of putting any weight or pressure on that foot, and it will never be able to use it to walk or run again.\n\nConsidering the Horse will essentially lose any semblance of its \"life\" euthanasia is often seen as a mercy to the horse, rather than a cost savings for the owner of it. Once a Horse breaks its leg...it will never ever ever be the same, even if you manage to fix it, it can't be, because it causes chronic problems in the remaining legs.\n\nIn the Natural World a broken leg for a horse is a death sentence, its just the way the are built.",
            "title_similarity": "0.69859827"
        },
        {
            "id": "hqytuov",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14688702"
        },
        {
            "id": "hqyv2o3",
            "score": 1,
            "text": "Vet here. The above answers are mostly correct; they need to be on their feet. We can treat many fractures, but the recovery period is problematic because if they offload their weight onto their other foot for prolonged periods there is a high risk of developing laminitis.\nIt’s also an economics thing. Sure we can fix it, but it’ll cost thousands of dollars and your horse won’t be as good as it was (ex: articular fractures will result in arthritis) and it’s either now a pasture pet or you can use it as a stud if male.",
            "title_similarity": "0.6729274"
        },
        {
            "id": "hqyvaex",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14688702"
        },
        {
            "id": "hqyvars",
            "score": 1,
            "text": "Because it will never heal properly.  Horses weigh a lot and are on their legs %99 of the time.  They sleep standing.  Everytime they move on that broken leg, it's gonna break off more splinters.  They will be in constant AGONY for the rest of their lives.  So you shoot them so they won't have to live a life of agony.  I lived on a farm for a few years and had to put down 2 horses due to broken legs.  One horse broke its own leg, the other was the farmers fault.  You ever seen a hard man cry?  It's not pleasant. No one wants to put a horse down, and if it was a matter of cost, then most horses wouldn't get put down, but it's not.  It's preventing a life of agony.",
            "title_similarity": "0.69352865"
        },
        {
            "id": "hqyvtgi",
            "score": 1,
            "text": "There are lifts to take the weight off the horses limbs during re-hab, but is difficult. Here is an article of one such device. I know that there has been a lot of research and development in the harness to support the horse.  Also, the support is a gantry so the horse can move around. And the weight counterbalance is servo controlled.\n\n[https://www.americanfarriers.com/articles/8235-robotic-system-gives-healing-horses-a-lift](https://www.americanfarriers.com/articles/8235-robotic-system-gives-healing-horses-a-lift)",
            "title_similarity": "0.607195"
        },
        {
            "id": "hqywgrj",
            "score": 1,
            "text": "What are you gonna do? Put it in a walking cast?",
            "title_similarity": "0.19231105"
        },
        {
            "id": "hqywow2",
            "score": 1,
            "text": "I think because horse legs usually shatter and clean breaks almost never happen. And horses like most animals will never stay off the injury enough to let it heal. I used to work at a racetrack and casino as IT and this is what was commonly told to me.",
            "title_similarity": "0.6683964"
        },
        {
            "id": "hqyx9j5",
            "score": 1,
            "text": "Generally a broken leg for a horse is just too difficult and expensive to repair. You would have to build an exoskeleton that the horse could safely stand and walk in for six months without hurting itself further. Which, who knows, someone might do eventually to save *very* valuable horses.",
            "title_similarity": "0.6759994"
        },
        {
            "id": "hqyz3nn",
            "score": 1,
            "text": "Reading all these replys, could they make some huge harness like thing. Like what Jessie was tied up to in breaking bad",
            "title_similarity": "0.53529024"
        },
        {
            "id": "hqz15ag",
            "score": 4,
            "text": "Paramedic here.\n\nOne of my personal ‘worst’ jobs involved a horse that threw its rider and bolted.\nIt jumped a wall onto a nearby road and got hit by a car.\nWe obviously got called for the rider, but she would t leave her horse. \nThe horse was lying on the ground, clearly visible damage to his back leg but otherwise, conscious and not happy at all.\n We end up trying to treat the horse. Probably going all the wrong things.. \nwe managed to get oxygen tubing up his nose and blast him with some high flow 02. Also managed to get an iv in.. I’ve no idea how we did this but we did. It went through every bag of fluid we had between 2 ambulances in about 10 minutes.\nA vet appeared, secured the iv further. A tow truck arrives for the car and we talk him into loading the horse on it to take to the vets a little further down the road. We strap him up, with help of the fire service, and slowly start to lift him.\n“If we lift and then lower him, and he tries to weight bare.. he has a chance” says the vet.\nUp, up, up he goes.. 20-odd first responders practically holding our breath and willing this beautiful monster of a horse to try to stand…\n\nHe was now fully suspended and the recovery driver starts to lower him down.. \nhis hooves touched the tarmac and his legs immediately crumple under him.\n\nVet just asked the rider/owner if she want to say goodbye and gives them a few minutes. \nThen just administers a massive dose of whatever and the big horse just whinnies once and goes limp..\n\nI turned away to try and hide my tears that I could feel running down my face but soon realised there was no need. Every one of us was the same.\n\nI’ve seen some next-level fucked up shit in my career.. but 12 years later, this one still gets me.",
            "title_similarity": "0.74347067"
        },
        {
            "id": "hqz1srr",
            "score": 1,
            "text": "I mean if it's a wild horse and it breaks it's leg it's done for and will be eaten by predators eventually. No difference in us doing it only we don't eat the horse (just make glue out of it).",
            "title_similarity": "0.6461003"
        },
        {
            "id": "hqz28f8",
            "score": 1,
            "text": "In short, because horse bones shatter, rather than break cleanly. Even if they could be saved from the break itself and the leg could be pieced back together or mended otherwise, they’d need a lengthy amount of time off the leg which just isn’t possible without causing them other serious deficits.",
            "title_similarity": "0.6795186"
        },
        {
            "id": "hqz2f77",
            "score": 1,
            "text": "A horses whole anatomy is dependent on moving! They can’t lay down for long periods of time without their organs being crushed. Extra weight on the sound limbs could actually cause something called laminitis which causes extreme pain and rotation of their pedal bones (they can sometimes even come through the bottom of their feet). \n\nTheir digestive system needs constant forage and movement to work correctly or they can develop ulcers. \n\nNot to mention the extreme stress box rest puts on them, and the slow rehabilitation that would often only let them be field sound. It’s often kinder to say goodbye. \n\nIt can be done, I know of 2 horses have have ‘broken’ their legs and be rehabilitated but it is very time consuming and expensive. \n\nIn terms of racehorses, it gets even more complicated. They’re such fit high blooded horses they’re often going to hurt themselves again on box rest and it’s not really viable for the owners to pay out all the money for a horse that can no longer race ( as harsh as it sounds it is a for profit business!)",
            "title_similarity": "0.6753364"
        },
        {
            "id": "hqz2g96",
            "score": 1,
            "text": "I think it depends on the bone that breaks, equine bone structure is very complex with lots of moving parts. My horse broke the splint bone in her left hind leg and had surgery to remove the splintered bits and is completely fine and sounds as ever. A cannon bone break would be catastrophic and likely end in euthanasia but a fracture could be treatable. A sesamoid fracture isn't usually life ending but can have limitations to future performance. I think it totally depends on the bone.",
            "title_similarity": "0.7782873"
        },
        {
            "id": "hqz3jrg",
            "score": 1,
            "text": "Look up Barbaro's X-Ray after they tried to save him and you'll see why. That and laminitis",
            "title_similarity": "0.5001361"
        },
        {
            "id": "hqzbnd6",
            "score": 1,
            "text": "It depends on what the owner is willing to spend. There have been amazing strides in the vet medicine world where a broken leg is no longer is no longer a death sentence. However, it’s very expensive and takes a long time to heal. Horses are prey animals and depend on their legs. Even hoof issues could be a death sentence for a wild horse. There’s a saying that goes “No hoof, No horse.” Meaning if the problem is bad enough, the kind thing to do is euthanasia. Racehorses are worth a ton of money. Between race winnings, stud fees… you are looking at thousands and sometimes millions of dollars. Those horses aren’t just put down. They go through rehab and if their career was good enough are still used as studs or brood mares. Hope this helps.",
            "title_similarity": "0.7275761"
        },
        {
            "id": "hqzcw3n",
            "score": 1,
            "text": "There’s obviously a good reason why we can’t do this, or we would, but for a beloved horse where money isn’t a factor. Why can’t he “hang” the horse is something similar to a hammock with four holes in it, one for each leg, and let it chill like that for a few weeks while healing? Would something like this destroy its torso/organs?",
            "title_similarity": "0.77744806"
        },
        {
            "id": "hqzdohi",
            "score": 1,
            "text": "What if we made a contraption that would hoist the horse's torso up in a hammock, that could then move around on wheels",
            "title_similarity": "0.42877775"
        },
        {
            "id": "hqzdxug",
            "score": 5,
            "text": "Speaking from my own personal experience:\n\nI had to have my horse put down in December of 2016 after he fractured his leg during an unfortunate and rather freak accident. \n\nFirst of all, the surgery that would be required for such an injury is *expensive* af. Not only that, but because it’s a 1200lb + animal, they usually have to spend a long time in a stall, supported by a large sling-like apparatus that hangs from the ceiling and wraps underneath them to hold their weight up. \n\nEven if you can afford to do all of that, it’s not a guarantee that they will make it out alive. A friend of mine did do all of this .. but her horse had complications about 6 weeks later and they had to put him down anyway. And remember: horses won’t sit on a couch and elevate their broken limb to reduce swelling, they can’t do that. So it’s a really tough thing for a horse to get through. \n\nI personally did not opt for surgery because he had splintered his pastern bone into shards. Even with a successful surgery and rehab, it would have been very unlikely he would have ever been mobile enough to enjoy any quality of life in the future. Moreover, he was young. He was only 6 years old and I knew that putting him through all of that would have been asking too much. He was a very goofy horse, very happy and curious, he could also be quite boisterous and wild. I know his mental health would have declined rapidly .. and the vets said that best case scenario: he’d have to be on strict stall rest for at least a year, and may never be sound enough to even manage living in a field. Horses need to move and they need to walk in order to be healthy and their gastrointestinal system relies on it. A horse’s gut is the key, more or less, to their health and survival. \n\nThat being said, it also depends on where the fracture is. From what I’ve seen and heard in my 30 years with horse, the higher up the fracture, the better their chances are for rebounding successfully (even if they will only ever be sound enough to live in a field for the rest of their lives). My horse’s fracture was basically at the ankle, right above his hoof. \n\nRIP Wubby, he was such a wonderful horse and it still pains me to this day when I remember that whole thing happening.. but I definitely know I made the right call for him. Quality of life is usually what it boils down to :(",
            "title_similarity": "0.75449806"
        },
        {
            "id": "hqzgd52",
            "score": 1,
            "text": "Can the horse not be rigged onto a thing that holds its weight so keeps it standing up? I can't remember what it's called but smaller animals that can't use any legs are sometimes in smaller versions with wheels, usually just made by the owner.\n\n&#x200B;\n\nSo on the broken leg, it would be raised slightly. Maybe that'd be bad for the horses hip though.",
            "title_similarity": "0.7254521"
        },
        {
            "id": "hqzgdzv",
            "score": 586,
            "text": "Vet here.\n\nThere are several reasons. Horses develop problems in their hooves if they don't move around enough or are forced to put weight on only 3 legs. You can think of their hoof as a giant fingernail, and the bone behind it is shaped like a wedge pointing forwards and towards the ground. Too much pressure on the other 3 hooves can cause severe pain, swelling, and separation of the bone from the hoof. In severe cases the bone in the hoof can puncture through the bottom or separate from the top.\n\nSo then you might ask \"why can't we make them rest while they heal?\"\n\nWell horses can't lie down for a long period of time. Not only can that negatively affect their hooves and muscle tone over time, but the pressure from their own body can restrict blood flow. \n\nWithin 2 to 4 hours of a horse not being able to move from one side, they can develop muscle and nerve damage. In surgery, horses are often kept on giant foam pads to help reduce the pressure on their body. Keep in mind bones take months to heal. A horse cannot realistically be on the ground to wait for that. \n\nThe other option is a sling for the horse to stand stationary and upright while it heals. But this creates challenges with pressure sores and excessive pressure on their breathing.\n\nThere are other issues including dietary concerns and gastrointestinal effects, but in short, it is very very hard to heal a broken bone in an animal that needs to constantly keep using that bone to survive.\n\nEdit: Also when horses break a bone in their leg, they tend to panic and start trying to run. The flailing they do can cause very severe injury to tendons, rip muscles, tear joints, and it's not uncommon that the bone rips through the skin, which creates a big risk of infection. So a broken leg in a horse is often much more severe and catastrophic than what we see in other animals. In some horses they flail so much from one broken leg that they break a second leg.",
            "title_similarity": "0.7091395"
        },
        {
            "id": "hqzhs8f",
            "score": 1,
            "text": "What about a prosthetic leg?  The horse can’t relearn with one through rehab or it’s just too expensive?",
            "title_similarity": "0.68935525"
        },
        {
            "id": "hqzkecs",
            "score": 1,
            "text": "Not just horses, most large 4 legged animals.\n\nBasically anything deer or bigger will die from a broken leg slowly and painfully. So in general it's better to just put them out of their misery.",
            "title_similarity": "0.7156497"
        },
        {
            "id": "hqztjnv",
            "score": 1,
            "text": "I heard horses have no periosteum membrane on their bones so a break can not heal.\nI do not know if that is true though (am not an animal doctor)",
            "title_similarity": "0.6014861"
        },
        {
            "id": "hqztpg8",
            "score": 1,
            "text": "Because a huge part of a horse’s life is spent standing. A horse who can’t stand on its own just to look forward to a life of suffering.\n\nIt’s more humane to put it down. Of course, it would be better to never exploit it in the first place.",
            "title_similarity": "0.6368424"
        },
        {
            "id": "hqzuitr",
            "score": 1,
            "text": "They are slow to heal, are large animals that do not do well being immobile or laying down. \n\nWe have had to put two of our best horses down due to leg injury. \n\nOne fell and broke one leg in two places during a bad thunderstorm (slipped).\n\nThe other was chased by coyotes into a fence, sheered the coat/meat/muscles to the bone from their knee to their hock. The vet really tried with this one because there was no broken bones, but it just got too badly infected. \n\nFucking awful and sad.",
            "title_similarity": "0.72328115"
        },
        {
            "id": "hqzwq8z",
            "score": 1,
            "text": "What about a sort of standing wheelchair? \n\nLet's say it breaks a front leg. You could put a platform understand it's stomach to keep the front legs off the ground. Or even just three of them, if it's possible to keep the leg bent. It would allow it to walk around (enough to get a bit if exercise, but not too much, to avoid falling over) \n\nPeople have said that they are too heavy to walk on only 3 legs, so this platform would help with that too. It could even potentially make the stain even less on the back legs.",
            "title_similarity": "0.6131227"
        },
        {
            "id": "hr00cx0",
            "score": 1,
            "text": "Horses don't break things in half measures, alot of time they break a leg it will be hanging off literally hanging off. If that's the case there fucked. Alot of breaks of the kneecap peice round the back of the leg cam be fixed if you can keep the horse still for 2 months, not that hard tbh. The vets wrap the legs into like elephant sized things to so they can't move the leg, some also get special shoes to force foot positions to help repair.",
            "title_similarity": "0.6959592"
        },
        {
            "id": "hr02qu9",
            "score": 1,
            "text": "Its due to the way a horse breaks it's leg. It's not a simple fracture or lateral break like in a human. The bone almost splinters into multiple fractures on itself making proper healing almost impossible. Some horses have recovered, but it's a very costly process, and takes a very long time to heal. Saving the horse from the pain and stress involved is more humane than the result of the process.",
            "title_similarity": "0.71280634"
        },
        {
            "id": "hr06snq",
            "score": 1,
            "text": "When it comes down to it it's simply because they are heavy and when you have that much weight 3 legs aren't enough to stand on, you could patch it up BUT essentially you'd have to put the horse on bed rest aaaaaaaaaaaaand horses don't have beds, they have feet.\n\nDue to the massive weight shitty leg combination their other 3 legs would get fucked up really bad.",
            "title_similarity": "0.6716498"
        },
        {
            "id": "hr0eq81",
            "score": 7,
            "text": "I've seen facilities keep horses with broken legs and try to work with the horse through it. It's torture. A horse needing to be on strict stall rest for an entire year. Sometimes two is not fair. Most horses loose their minds. We as humans know the other side of it and the ideal outcome but they don't. They don't know anything they just know they haven't moved more then a couple steps for months and months. \n\nThe mental toll that goes into recovery sometimes just isn't fair.",
            "title_similarity": "0.6706493"
        },
        {
            "id": "hr0hs34",
            "score": 1,
            "text": "Better yet, why isn't their crutches for horses? Or some kinda rolly dealy?",
            "title_similarity": "0.64680743"
        },
        {
            "id": "hr0nu3c",
            "score": 1,
            "text": "1000+ lbs on 3 legs isn’t going to work. And they won’t stay still long enough for the bum leg to heal.",
            "title_similarity": "0.52584344"
        },
        {
            "id": "hr0o2cq",
            "score": 2,
            "text": "It also depends on which leg. Back legs are almost always able to be healed. They may be lame and unrideable, they might not. My halter QH got her leg broken when we leased her out when I was away in the military by having the stupid lady slam a trailer door on her leg. She was OK. But non ridable ever again. She became a brood mare. Now front legs are different and are much harder to heal and make the horse be still long enough for it to heal. Depends on the horse's temperament and how severe the breaks are. It's not an easy answer. All horses are different. All breaks are different. I was an exercise rider at the track for years and saw horses go down quite a bit. Some could be saved because it was not that bad of a break (like when Charismatic broke down in the Belmont) and then others are euthanized because it's not possible to rehab them.",
            "title_similarity": "0.7423028"
        },
        {
            "id": "hr0octr",
            "score": 3,
            "text": "It's an extremely expensive and difficult injury to rehab for an animal that may never move easily/cleanly again and many horses' lives are dependent upon their bodies being fit for work as they are otherwise expensive animals to keep.",
            "title_similarity": "0.5750109"
        },
        {
            "id": "hr0p2ro",
            "score": 1,
            "text": "Why do we not replace the entire home or half of it with titanium? Don’t we do that with human hips and bones too?",
            "title_similarity": "0.51855975"
        },
        {
            "id": "hr0p60v",
            "score": 1,
            "text": "If coat wasn't an option could a horse be placed in a medical coma until the leg would heal?\n\nWhat about a walking cast to keep the bone set and allow the horse to stand or walk?",
            "title_similarity": "0.7383952"
        },
        {
            "id": "hr0u8ud",
            "score": 1,
            "text": "I was always told feeding a horse that couldn't do any work wasn't worth it but after this thread i know its not that simple",
            "title_similarity": "0.59557104"
        },
        {
            "id": "hr0uzum",
            "score": 1,
            "text": "They can’t stay off their legs. For bone to heal, you need to stay off the bone. Infection will happen even with proper treatment, seeing that they literally can’t stay off their legs.",
            "title_similarity": "0.58311886"
        },
        {
            "id": "hr0xnmr",
            "score": 5,
            "text": "Horses need to move to stay healthy. Movement is important for gut digestion, but it is also imperative that they move around to pump their legs and prevent fluid from settling in their legs. Evolutionarily they are meant to walk and graze almost constantly. The lymph system does not have a heart to keep fluids moving. It relies on muscle contractions to keep those fluids circulating. Horses also cannot rest their weight on their opposing “healthy” leg for an extended period of time without developing laminitis. Basically the bone that is suspended inside the hoof will start to move due to the increased pressure and having to take the weight two legs would normally support. Any sort of long-term severe lameness can cause laminitis in the other legs. Not just a broken bone. Just trying to keep a lame horse on stall rest for a couple of weeks can be extremely difficult. They will generally start to act out from being pent up and can injure themselves further in addition to the over-all health issues they can develop from a lack of movement. I have seen cases of people going to extreme lengths to try to save horses with broken bones and it is not pretty. Keeping them drugged so that they can hang in a sling to support their weight for months, special casts that restrict movement, etc. etc. Finding a solution that allows them to walk and move while also allowing the broken bone to rest and heal is next to impossible. Euthanizing is almost always a much more humane option. Keep in mind that a broken leg in the wild would also cause them to be easy prey and I can’t picture a scenario where they would be able to keep up with the herd, find food and water, and survive for any length of time. They would quickly become a part of the food chain. There was a special on one of the racehorses who won the Kentucky derby maybe 10 years ago and broke a bone in a hind leg. They documented their veterinary care and his progress during the special. Later on, he too was euthanized even with that top tier of veterinary medicine and $ at their disposal.\n\nEdit: Horse I referenced was named Barbaro and there is a lot of information out there about what they tried to do to save him.",
            "title_similarity": "0.5714853"
        },
        {
            "id": "hr0zaoa",
            "score": 2,
            "text": "Got through her shift okay and came home and made chicken soup, is now talking to her mom in Cuba.  I just found out that you were able to say hey to the family in Cuba on Christmas Eve.  That is so cool.  I was distracted at the time and didn’t find out til now",
            "title_similarity": "0.43015513"
        },
        {
            "id": "hr13nhk",
            "score": 1,
            "text": "Well they’ve gotta eat, don’t they?",
            "title_similarity": "0.11912098"
        },
        {
            "id": "hr1akx4",
            "score": 1,
            "text": "Can u flip them over or on there side and strap them down until the heal moving the thing they are strapped to around and switching side sometimes to try and keep them comfortable",
            "title_similarity": "0.49773484"
        },
        {
            "id": "hr1av4l",
            "score": 1,
            "text": "I'm just a photographer by trade, but my best guess is that it would probably be pretty difficult to get a horse through rehab for a broken leg.",
            "title_similarity": "0.74173176"
        },
        {
            "id": "hr1bqic",
            "score": 1,
            "text": "I can only share a very narrow insight, I work with a humane society and we absolutely do not take horses. Companion animals only. In the past I have looked into getting old or sick horses placed in rescues. It is very expensive to care for a horse especially one with failing health. The rescues were always being overwhelmed especially where I live. Since there's no industry value to them in the US sadly a lot of those animals ended up being trucked to Mexico.",
            "title_similarity": "0.6975203"
        },
        {
            "id": "hr1ev49",
            "score": 1,
            "text": "It's a kindness. Their legs are so fragile, even an infected hoof is a major problem, whereas an infected toenail would be a minor problem for humans. If it breaks the leg, infection is almost a guarantee if it breaks the skin, they roll around in dirt for fun and live around flies and rodents. This is a massive animal, humans have spent thousands of years developing technology and metallurgy and prosthetics, but we havent perfected it for humans, let alone a 1+ ton animal, we havent even perfected surgery, so spending thousands and thousands of dollars on an animal that will just continue suffering is kind of your call but it leans towards putting the animal down. If I lost my balls, my leg, and had to spend half my life in a hospital and the other half limping around in pain, I'd ask for a bullet between my eyes.",
            "title_similarity": "0.66200906"
        },
        {
            "id": "hr1evht",
            "score": 3,
            "text": "We had a horse break her leg when I was kid. Dad loved that horse so damn much he refused to put her down. Splinted the leg and stayed with her practically day and night for months until everything healed properly. She recovered and 10 years later was still galloping around the farm. I remember the Vet expressing disbelief at how well it healed. Never could ride her again, but dad was just happy to have her around (he adopted and trained wild mustangs and she was always a big part in helping to control them).",
            "title_similarity": "0.6223583"
        },
        {
            "id": "hr1g67z",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14688702"
        },
        {
            "id": "hr1kftd",
            "score": 1,
            "text": "As I understood from what I've read... Horses by evolution escape their prey by running away. So basically, a lame horse is toast.  They will be attacked and killed by wolves, jackals, hyenas, or whatever large predator finds them first. Their main defense other than running is kicking, which could be awkward with three legs, and no doubt most predators are clever enough to recognize the lame leg and the indefensible direction. \n\nAs a result, horses have not evolved to deal with a bad leg. It is almost impossible that such an animal survive in the wild, so the capability never evolved. (Remember, evolution creates these capabilities when the ones that have even a bit of such ability survive to reproduce.) Remember, not all breaks are \"OMG, your leg is at an impossible angle\". it also involves painful bone cracks which make using the leg painful but normally should heal somewhat in a week or two if not aggravated by frequent use.  that  is not even an option for a horse. \n\nIn fact, we've also bred horses to be much bigger than their original ancestors who were more like ponies. But that breeding has not allowed bones size and strength to catch up, so the pounding race horses' ankles and other bones go through in heavy racing can sometimes crack the bones. (Just like basketball players over 6'6\" are prone to leg and ankle problems) \n\nIt's more of an option for a herd of, say, cows or deer to get by with a cracked leg bone... these have antlers, and one defense is to put their heads down and use their horns to spear attackers - which does not involve running. \n\nPredators - wolves, cats like cougars and lions, etc. - could maybe drag themselves around, and feed scavenging off carcasses left by other predators until they can limp enough to get back on their feet. A cat or dog fights off attackers with jaws and claws, so does not need to be able to run. They would drag themselves around on three legs until they could stand on the fourth.",
            "title_similarity": "0.7138807"
        },
        {
            "id": "hr1t9i6",
            "score": 3,
            "text": "Equine vet here. Not all fractures require euthanasia. Some fractures will heal with conservative treatment (rest), providing no complications like laminitis arise. We can also do some pretty cool orthopaedic stuff in horses these days too. Many of the surgeons I work with do standing fracture repairs to reduce anaesthetic and recovery risk. Saved plenty of horses that only a couple of years ago would have had to be PTS.",
            "title_similarity": "0.63535184"
        },
        {
            "id": "hr20v7r",
            "score": 1,
            "text": "A horse is about as smart as a goldfish and will keep standing on a painfully broken leg no matter what you do",
            "title_similarity": "0.5084341"
        },
        {
            "id": "hr25rha",
            "score": 1,
            "text": "Because after helping an injured horse walk for a while you get a bit peckish and I mean it’s just like a giant meatball standing there waiting to be eaten.  So it’s not mercy or anything.  It’s just convenient.  The original fast food.",
            "title_similarity": "0.53665376"
        },
        {
            "id": "hr25vlq",
            "score": 3,
            "text": "Horses put all their points into stamina and poison resistance. As a result, they have very little HP, and will be startled, if not killed, by most encounters.",
            "title_similarity": "0.6449427"
        },
        {
            "id": "hr26dl0",
            "score": 1,
            "text": "Because horses are good for 3 things. Riding, racing, and glue.. Horse breaks a leg even on a stress fracture and all the other legs bear the brunt of the weight. Not like they use crutches. And you have to consider ongoing ligament damage and risk of reinjury plus that they are used for riding or pack animal work. I love 'em but they're freakin expensive if you just think of them as pets\n\nLong story short, stuff gets serious when you start talking about farm animals",
            "title_similarity": "0.7242609"
        },
        {
            "id": "hr27mcv",
            "score": 1,
            "text": "Vet here.\n\nThe simplest answer is, sometimes they can be fixed, sometimes they can’t. Depends on the type of break.\n\nBut mostly, in racing it’s just not economical to pay for treatment & rehabilitation for a horse that will likely never race again.\n\nInsurance also pays out the full premium for a “fatal injury”, so there’s no sense in keeping an injured horse.\n\nThat’s the harsh reality. Don’t like it? Then don’t support horse racing.",
            "title_similarity": "0.69283986"
        },
        {
            "id": "hr2arx9",
            "score": 3,
            "text": "My aunt was a vet and fixed a horse after it broke a leg.\n\nThe horse lived another 10 years and lived free in a field with other injured mates.",
            "title_similarity": "0.62361676"
        },
        {
            "id": "hr2hslg",
            "score": 3,
            "text": "People are asking the same questions over and over. This will probably get lost at the bottom but I thought I’d take a stab at it, as a non-vet but someone very familiar with these issues. \n\nThere are two main reasons horses are put down for broken legs. The first is when break is so severe and the horse in so much pain and so unlikely to ever heal that it’s the only humane option. Even aside from the risk of laminitis (see below), horses cannot be made to stand still while they heal unless they are tied to a wall, and there’s an argument that doing that to a horse for months with little guarantee he’ll survive anyway (see below) is not humane. It’s worse if the break is severe enough that the horse wouldn’t be able to put any weight on the leg while healing - you certainly can’t make him lie down for 3 months with his leg in traction.\n\nAs already mentioned, the other reason horses often end up having to be put down when they break a leg is later in the healing process is because of laminitis (or in anticipation of it), also called founder. This happens when too much weight on a leg causes tissues that support the bones inside the hoof to break down, so those bones are no longer supported and start to drop, sometimes far enough to pierce the bottom of the hoof (it can also be caused by other things, like eating too much sugar). \n\nAnswers to  of the questions that have been asked repeatedly:\n\n- Laminitis doesn’t happen when horses are ridden not because riders aren’t heavy enough to matter, but because laminitis only occurs when there is sustained weight on the limbs. When a horse is being ridden, each of his feet regularly leaves the ground and becomes non-weight bearing. Generally when not being ridden, horses move around, or they stand and rest one hind leg at a time, or they lie down for short periods. They are always moving and changing position and taking weight on and off each leg. But when a leg is broken, the other 3 legs have to bear much more than they are designed to all the time, without rest, for a very long period of time. This sustained extra weight without relief is what triggers laminitis.\n- Other animals like dogs can do fine on 3 legs for a few reasons. First, they don’t have hooves in which the bones are supported only by delicate tissues that can break down, so they can’t get laminitis. Second, they are able to lie down and get up much more frequently and easily than horses, and stay down for much longer periods, taking the weight off their other legs. And third, horses are just evolved to the narrowest tolerance, to be as large as possible but able to run as fast as possible, and there is little room for anything to go wrong, while dogs and cats and humans (and almost every other animal!!) are much more flexible and can adapt to changes in their bodies and environments more easily.\n- Slings can be helpful. But, see above, horses have narrow tolerance in all areas, not just their hooves and weight. Also in their diet and digestive system, their living conditions, etc. They are meant to move and graze for about 18 hours a day, and they don’t do well confined in a sling, either psychologically or physically. They can develop sores, muscle atrophy, colic (basically a blockage in their 100 feet of intestines that can require surgery), ulcers, and all sorts of other problems, and often have to be constantly sedated, which has side effects. \n- Horses cannot be forced to lie down, and lying down for too long often isn’t good for them. Those who choose to do so more often (they vary in how much time they prefer to spend lying down) might have better odds - if they don’t damage the broken leg in the process of lying down and standing up. \n\nThe racehorse Barbaro eventually died of laminitis after breaking his leg in the Preakness. His owners tried desperately to save him and spared no expense, but ultimately he succumbed. As I understand, they have funded a lot of research on laminitis, but it still remains frustratingly difficult to prevent or treat. This is not a matter of people not wanting to put the effort in - there is a ton of money and research in horse medicine. It’s just a very, very intractable problem.\n\nThat being said - many more horses survive broken legs now than did a decade much less 50 years ago. A compound fracture that involves a joint maybe not, but hairline fractures are often survivable, and even a more serious break that requires surgery (sometimes with pins & plates etc) might not be fatal depending on the location (and the horse’s temperament). Not every horse who breaks a leg is put down, and there is now more knowledge about, and techniques for attempting to prevent, laminitis, and more research ongoing.",
            "title_similarity": "0.74564695"
        },
        {
            "id": "hr2ix8u",
            "score": 1,
            "text": "Didn’t see it mentioned but also they’re herd animals. The herd leaves the weak, so they will tend to try to get up and further injure themselves. We have fixed a handful of broken legs, it’s just rare.",
            "title_similarity": "0.68333554"
        },
        {
            "id": "hr3b5ux",
            "score": 2,
            "text": "I just read a local article yesterday about a bunch of horses that were scared off from fireworks and one had to be euthanized due to a compound fracture ):",
            "title_similarity": "0.71773154"
        },
        {
            "id": "hr47l69",
            "score": 2,
            "text": "I learned so much about horses today. Thank you everyone. I’m actually terrified of horses but hearing how fragile they are makes me more sympathetic to them.",
            "title_similarity": "0.6048187"
        },
        {
            "id": "hr4yk6s",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.19244318"
        },
        {
            "id": "hrtixnw",
            "score": 1,
            "text": "Because they can’t exactly lay down because I’d they’re down for too long it can and will affect their lungs",
            "title_similarity": "0.5276375"
        },
        {
            "id": "htqt6bu",
            "score": 1,
            "text": "Yeah, I'll never forget being a young adult and learning how my aunt found out she had colon cancer. That knowledge has lived rent-free for years now.",
            "title_similarity": "0.44273758"
        },
        {
            "id": "htzqkir",
            "score": 1,
            "text": "Pro Tip:\n\nIf you ever need to put down a horse, don't talk to him about it, don't get close to it, and don't let him trick you. If you do, he will tackle you, take away your shotgun and proceed to kneecap you. All the while mocking you that he needs to put you down cuz you have busted kneecaps, as you are agonizing from the pain.",
            "title_similarity": "0.6390507"
        }
    ]
}