{
    "ELI5: Why are so many photos of celestial bodies ‘enhanced’ to the point where they explain that ‘it would not look like this to the human eye’? Why show me this unreal image in the first place?\n": [
        {
            "id": "hsxrzt7",
            "score": -2,
            "text": "I always wondered the same about mars. My understanding is mars isn’t really “red.” It’s pretty brown. But nasa has adjusted it in photos to look more red to make it align more with our expectations of the “red planet.” But I’ve never seen mars with my naked eye. If i think it’s red that’s because I was either told it was red or because I’ve seen (apparently altered) photos of it looking red. \n\nIf it’s not really that red, why make it seem like it is? I really don’t care if mars is brown.",
            "title_similarity": "0.72879964"
        },
        {
            "id": "hsye7hp",
            "score": 0,
            "text": "Right!? Just shows us the real deal for once.",
            "title_similarity": "0.3517937"
        },
        {
            "id": "hsygzz4",
            "score": 0,
            "text": "The purpose of enhancing the image is to give you tiny glimpse into the true beauty of the universe that exists beyond our visual range. It more a crutch than a lie.\n\nDont you want to see a celestial fountain spewing particles of incredibly powerful particles that only exists beyond what our eyes can see?\n\nTLDR: There is more to the universe that what our eyes can sense.",
            "title_similarity": "0.73673725"
        },
        {
            "id": "hsyo06f",
            "score": 0,
            "text": "I once asked this same question in some science subreddit and had a few responses that made me think they didn't understand what I was asking. \n\nI want to know what (for instance) Pluto looks like if I were in a tin can out there and looked out the window at it. Those beautiful shots we saw of the probe flyby were great, but I can't imagine it's be THAT bright that far out from the sun. \n\nI love the doctored shots, but I also want to know what it looks like to my human eye if I were flying at an optimal distance in a spaceship.",
            "title_similarity": "0.708429"
        },
        {
            "id": "hsxzy21",
            "score": 1,
            "text": "You literally explained why we need infrared for night vision or Xray to see inside the body.\n\nBecause if you use visible light you will not see anything in the night, or see the skin instead of what you want to see on the inside. Using false colors allows us to map spectrum of light beyond our vision into spectrum of light we can actually see and make sense of things.",
            "title_similarity": "0.597534"
        },
        {
            "id": "ht1akxm",
            "score": -1,
            "text": "Because that stuff doesn’t really exist. It’s just your scientism overlords trying to give you science porn. \n\nWe have yet to see any undoctored pictures of space.",
            "title_similarity": "0.6408946"
        },
        {
            "id": "hsyoi28",
            "score": 4,
            "text": "Human eyes are designed for life on earth. You would not see much in space. \n\nThe manipulation they do to these images is just to represent what is actually there, but in a way that you can look at. \n\nThey have not made unreal images, they've just dumbed reality down for our stupid monkey eyes.",
            "title_similarity": "0.6320317"
        },
        {
            "id": "ht0e9hy",
            "score": 3,
            "text": "I once met Laurie Anderson, who was NASA’s very first official artist in residence. She had this exact same question, and spent weeks working her way through channels inside NASA to get access to the actual computer artists that generated these images. They told her, flat out, that out the reason they enhance the photos to ultra saturated “Disney colors” is simply for funding. They explained that if they presented the images as the naked eye would see them, they’d essentially be completely black and grey. They’d be comparatively “ugly”, and this would be counter-intuitive to the human desire to imagine the heavens as beautiful and idyllic. They make them beautiful so that NASA continues to get funding.",
            "title_similarity": "0.5698906"
        },
        {
            "id": "hsydais",
            "score": -13,
            "text": "The same reason they show kids santa claus and the tooth fairy. Except it's the adult version.",
            "title_similarity": "0.38672227"
        },
        {
            "id": "hsy8q7a",
            "score": 4,
            "text": "These pictures only increase my love of space and the sense of wonder i still feel for space.",
            "title_similarity": "0.51658285"
        },
        {
            "id": "hsyt4zr",
            "score": -4,
            "text": "Yeah agreed.  It pisses me off too, particularly when they try to pass it off as a photo of the actual thing vs an artists rendition based on the actual data or photo.",
            "title_similarity": "0.647287"
        },
        {
            "id": "ht0la4x",
            "score": -4,
            "text": "Because it’s propaganda to gain support for space science funding from the government. Money.",
            "title_similarity": "0.5745392"
        },
        {
            "id": "hsyoco7",
            "score": 0,
            "text": "Electron microscopes see stuff using electron wavelengths instead of visible light. Does a virus imaged via EM make it less real?",
            "title_similarity": "0.63542783"
        },
        {
            "id": "ht08vmy",
            "score": 0,
            "text": "Ever seen an atom or a molecule? Yet we know what it looks like. Just like sound there are certain things humans can see and certain we can’t without aid of other tools.",
            "title_similarity": "0.5182366"
        },
        {
            "id": "ht0id5a",
            "score": -5,
            "text": "Because people don't realise this, and then get excessively excited by the pictures. It's equivalent to clickbait. 99% of astrophotography could as well just be photoshopped fantasy images IMO.",
            "title_similarity": "0.78700954"
        },
        {
            "id": "ht1c8d7",
            "score": 0,
            "text": "For reasons not fully understood, space is expanding. This causes light from distant objects to stretch out and become shifted into a frequency that humans can't see.\n\n\nThe consequence of this is that when you look into the night sky, you only see things that are relatively close.\n\n\nTherefore, one way to look at distant objects is to capture this low frequency invisible light and shift it back into visible light. That allows us to undo the stretching and create pictures of what things would look like if they were closer.",
            "title_similarity": "0.71515584"
        },
        {
            "id": "ht1hthu",
            "score": 0,
            "text": "Because without enhancements there would be no image to look at. Open your mind, the universe does not entirely exist within the visible spectrum of light.",
            "title_similarity": "0.66814405"
        },
        {
            "id": "ht2f606",
            "score": 0,
            "text": "I just want to share that I read this as \"celebrity bodies\" and the question still makes sense that way too.",
            "title_similarity": "0.44464797"
        },
        {
            "id": "hsxvl75",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.23653625"
        },
        {
            "id": "hsyx4s4",
            "score": 1,
            "text": "Many media shots are enhanced...the camera doesn't lie but it can be an accessory to a lie.",
            "title_similarity": "0.47851112"
        },
        {
            "id": "hsz8mtq",
            "score": 1,
            "text": "Note that we also do this on the opposite end of the spectrum. All of those colored protein and subcellular structures you see. Yeah, false colors.",
            "title_similarity": "0.457723"
        },
        {
            "id": "ht0b7f5",
            "score": 1,
            "text": "Well simply put, we see/hear/smell etc. a very small amount of stuff compared to how much stuff there is, so when they show you an ‘unrealistic’ photo of something it’s probably because the human eye wouldn’t see *anything* and thus we need special cameras and telescopes to show us what’s ‘really’ there.",
            "title_similarity": "0.7363629"
        },
        {
            "id": "ht0h56i",
            "score": 1,
            "text": "Allowing us to see stuff that isn't visible to the naked eye is sort of the point of telescopes to start with.",
            "title_similarity": "0.63917637"
        },
        {
            "id": "hsyfjjf",
            "score": 10,
            "text": "* nobody wants to look at dull, low intensity black and white images\n* CCD sensor =/= human eye\n* images usually cover broader electromagnetic range, not only visible light (e.g. UV, IR...)\n* images are usually black and white and colored later in data processing\n* light from celestial objects is faint, CCD can accumulate this light so resulting image is brighter, more vivid with rich hues\n* different colors represent usually different elements, so by showing you this rich colored image you can easily visualize composition of the given object\n\nTools that we use \"see\" very differently compared to human eye. They see broader range of electromagnetic radiation but natively they see it as \"black and white\", e.g. you have only intensity value at a given point but not a color. That can be solved by using [color filters](https://www.space.com/8059-truth-photos-hubble-space-telescope-sees.html). So they get lot of different spectral images and then they need to combine them to a single photo by tinting them with different colors. Light is also collected for a long time so it leads to higher intensity and better contrast.",
            "title_similarity": "0.679016"
        },
        {
            "id": "hsyatm5",
            "score": 2,
            "text": "This is more EL13 but your question here is an opportunity for you to expand your mind. You are assuming that what you see with your eyes is somehow \"real\", and that an enhanced image is somehow \"less real\". You are wrong.\n\nThe trick is to realize there is no spoon.\n\nYou think that is air you are breathing?",
            "title_similarity": "0.69395626"
        },
        {
            "id": "hsxzp57",
            "score": 3,
            "text": "Lots of things exists that our eyes can't see. \nThat's why we invented all sorts of technology that can make them appear for us. \n\nWhy wouldn't you want to see the invisible?",
            "title_similarity": "0.69919705"
        },
        {
            "id": "hsz9gvo",
            "score": -3,
            "text": "Why have photos at all, they’re fake you know, they use chemicals and digital tricks to make it look real",
            "title_similarity": "0.68414915"
        },
        {
            "id": "hsyf3b5",
            "score": 3,
            "text": "There are smells the human nose cannot detect, sounds the human ear cannot hear, and light the human eye cannot see.\n\nThese images are an attempt to translate types of electromagnetic radiation that falls outside of the spectrum that is visible to humans to that which falls inside the visible spectrum.\n\nNot being able to see something doesn't make it any less real. There is a vast amount of information in the universe which you are unable to perceive.",
            "title_similarity": "0.7171551"
        },
        {
            "id": "hszbnq4",
            "score": 4,
            "text": "The Milky Way is *so much* prettier in the infrared than in the wavelengths the human eye can see. You can see far more detail and structure.\n\nOne of the most common artificial display schemes is to find three different wavelengths that highlight different aspects of an object, and then display those three wavelengths mapped to the familiar red, green, and blue of RGB color.  So it's not precisely unreal, it's just the way the object would look to a species with different color receptors in its eyes. \n\n(For an example closer to home, the flowers in your garden have interesting markings in ultraviolet colors -- why? Because their pollinating insects can see and act on those colors.)\n\nSource: worked at NASA and participated in making some of those \"false color\" images.",
            "title_similarity": "0.55462044"
        },
        {
            "id": "hszuaeu",
            "score": -5,
            "text": "For marketing. Space outside low orbit is mostly just trivia in regards to humanity. So people try to make it look cool to justify their trivia collecting work.",
            "title_similarity": "0.67616385"
        },
        {
            "id": "ht011j3",
            "score": 5,
            "text": "Actual ELI5: The picture would be completely black.\n\nThey have to change the colors so you can see it.\n\nWhat you see is the real shape, but the colors are \"fake\".",
            "title_similarity": "0.5897881"
        },
        {
            "id": "hsxxi59",
            "score": 7,
            "text": "Because many of these things cannot be seen unless you use this type of contrast.\n\nWe cannot see UV light or infrared, but many star systems give off this type of radiation.\n\nUsing a different type of camera system we can look at a picture of it, from the cameras point of view.",
            "title_similarity": "0.7165561"
        },
        {
            "id": "hsxvs89",
            "score": 107,
            "text": "Because it's actually there, you just can't see it. They are trying to show what it would look like if you could see it lol",
            "title_similarity": "0.57062614"
        },
        {
            "id": "hsy7osc",
            "score": 69,
            "text": "We don't build huge, expensive telescopes and launch satellites like Hubble so we can take pretty pictures.  We make these things to do science.\n\nThe pictures you see are design to give scientific information, not to replicate what the human eye can see.  But the images we create this way are pretty anyway, so that's what the public sees.\n\nHere's how that works.  First, they take a picture, but use a filter on the camera.  This filter blocks out all light except for a very specific color, a wavelength of light that's only emitted by one element of the periodic table.\n\nLet's say they use the \"hydrogen alpha\" filter.  Now they have an image of all the hydrogen in a nebula.  This has scientific value.  Since everything in the image is the same color, black-and-white is often used rather than making everything red.\n\nBut they can use other filters too.  Maybe they take another image of the oxygen in that same nebula.  And maybe another of the sulfur.  Three different black-and-white images of the same thing, showing slightly different things.\n\nBut this is hard to visualize together, comparing the three images.  This is where we get tricky, by combining them together as a single color image.  We could make each use their proper colors, but that's not useful.  Sulfur and hydrogen and both red, just slightly different shades.\n\nSo they're given false colors.  Red for sulfur, blue for oxygen, and green for hydrogen, and then combine those together.  This way we can clearly see what's going on with those elements.\n\nThat's what you're seeing with astronomy pictures.  Is it accurate to what your eyes see? No, not hardly.  If they used proper red/green/blue filters st would be mostly red to your eyes, not as interesting and not nearly as scientifically informative.",
            "title_similarity": "0.66132516"
        },
        {
            "id": "hsyguou",
            "score": 7,
            "text": "When a doctor wants to treat you, he asks for an X-ray. He isn't interested in how your bones \"look like to the human eye\", he is interested if they are broken or not.\n\nSame with astronomers. They want to know specific things about celestial bodies, not how they really look like. So they do \"X-rays\". Sometimes literally, in fact.\n\nThe reason you're seeing a bunch of X-rays instead of anatomical illustrations with actual colors is because nobody bothers to draw those.",
            "title_similarity": "0.6386484"
        },
        {
            "id": "hsyvxyg",
            "score": 10,
            "text": "Do you find a point in night vision goggles? It's the same thing. The human eye cant see what night vision goggles can see. Night vision goggles just translate what it can see into what the human wearing it can see. When you look into night vision goggles, what you see isn't an accurate representation of what you would see without them.",
            "title_similarity": "0.57986"
        },
        {
            "id": "hsxtyb7",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.21227399"
        },
        {
            "id": "hsxv9c2",
            "score": 61,
            "text": "Because most things wouldn’t look like anything to the eye. We have very small eyes and not sensitive enough.  \n\nI mean look at the galaxy. Billions of stars and you barely see a haze in the night sky. A nebula wouldn’t even register in our eyes. For example, have you seen pictures of the andromeda galaxy?  Impressive right? And taken in visible wavelength from the Hubble so that’s what you’d see if you where closer.   \n\nSadly no. The andromeda galaxy is pretty large. Like 6 times the size of the moon in the sky. It’s not distance. It’s just too dim regardless of how close you are.",
            "title_similarity": "0.67841786"
        },
        {
            "id": "hsxnscx",
            "score": 874,
            "text": "Lots of images show colors that human eyes are not sensitive to. You might see photos of galaxies that include infrared, ultraviolet, etc but since your eyes are not able to see these colors, they have to me manipulated to represent those as visible colors.",
            "title_similarity": "0.73511267"
        },
        {
            "id": "hsxnkxf",
            "score": 75,
            "text": "Because generally the gasses in those bodies are a spectrum that cannot be seen with the naked eye, so they enhance the image to colors that we can see. They are usually in the ultraviolet or other high wave length spectrums.\n\nSo to the naked eye it's literally invisible.",
            "title_similarity": "0.6837472"
        },
        {
            "id": "hsxuz5n",
            "score": 875,
            "text": "Kinda like why an X-ray of your bone is informative to look at, even though no human eyes can see them naturally. Not all \"lights\" are visible to human eyes, yet they reveal a great deal of structures that are interesting to a human.",
            "title_similarity": "0.5289397"
        },
        {
            "id": "hsyc08e",
            "score": 1323,
            "text": "Imagine I am playing a beautiful song, but the notes are so high that you cannot hear a thing.  \n\nSo… I lower the music by a few octaves.   Now you can hear and appreciate it.   It is the same beauty but in a range you can experience.  \n\nWe essentially change the octaves of light, allowing you to see what would otherwise be invisible, but maintaining all the original beauty.",
            "title_similarity": "0.58568716"
        },
        {
            "id": "hsxnl9v",
            "score": 16791,
            "text": "There is a lot of interesting stuff that the human eye can't see. A billowing nebula of hydrogen and helium gas slowly collapsing to form a new star is really cool!\n\nBut, it would be too dim for the human eye to see so it would just be black. So we up the brightness. But also the human eye can't see sparse gas against vacuum, and it can't see the frequencies of light required to distinguish between hydrogen and helium. So we shift the frequency into something in visible light, effectively picking a color to represent each gas.\n\nAt the end you have an image that doesn't really represent what the naked eye could view. But it would also be pretty silly to say \"Check out this image from my infrared camera!\" and hand you a blank sheet of paper because you can't see infrared light.",
            "title_similarity": "0.71334046"
        },
        {
            "id": "hsxxunr",
            "score": 2,
            "text": "Really if you want the average person to be interested in them (as with most science things) you have to give them something to grasp onto. There really are two routes to do this:\n\n1) Look at this Woooo! (which is the only option for the celestial bodies) and shows the rock, star system, or whatever in a way to make it visually appealing.\n\n2) Practical use, I (a random person) may not understand how the cholorfloro carbon nanotubes in the excelsior drive works, but I don't care what does it do?. Oh it is a super efficient engine awesome. This really isn't viable for space because most of the time the answer is 'well it exists' and eventually may have some application or lead to a breakthrough that will one day change something.",
            "title_similarity": "0.674397"
        },
        {
            "id": "hsy243j",
            "score": 5,
            "text": "Maybe you can think of it like a graph. Each color in the image you see represents some variation, some characteristics of the matter. Like a weather report on the map doesn't show clouds. It translates the conditions to a set of colors. The information you obtain from the image is still very interesting. What temperatures? What density? In what shape? How does it change over time? It's not an image to show you how pretty something really is, though the resulting images might be pretty and the representation might be chosen because it's pretty.",
            "title_similarity": "0.5408926"
        },
        {
            "id": "hsy2akr",
            "score": 1,
            "text": "The issue is that our eyes are very limited on what “types” of light we can see, and our telescopes can see more “types” of light. So we have to convert the types of light we can’t see, into something we can see to make an image.\n\n\nMuch more detailed version: \n\nA lot of the light we receive from far away objects are red-shifted (because they’re moving away from us, the whole Doppler effect and everything). So we mostly get red and infrared light, a lot of which isn’t visible to our eyes. That’s why the JWST is a infrared telescope. \n\nTo make an image to release to the public, they have to turn this raw sensor data into a picture. These telescopes don’t record pictures in RGB. So they need to apply some transformation to turn these different wavelengths into human-visible colors. Plus filtering to make things more clear and interesting. The raw sensor data from these telescopes is literally just a bunch of numbers, that show what wavelengths of light hit different parts of the sensor, and their amplitude and what not.",
            "title_similarity": "0.7373586"
        },
        {
            "id": "hsy2m1s",
            "score": 1,
            "text": "We use technology to capture light our eyes cant see, then use digital processing to assign rgb values (aka light our eyes CAN see) to display on a screen",
            "title_similarity": "0.5329633"
        },
        {
            "id": "hsy7iuv",
            "score": 4,
            "text": "In astronomy, most image sensors are monochromatic, but you might take multiple exposures with different filters, and assign a different color to the image taken with each filter.  You might use those filters to be more selective about light coming from the object you want to look at, rather than light pollution from a nearby city. The wavelength of light your telescope is capturing might not even be visible in the first place, so you'd have to color shift it to make it visible. Still real though.",
            "title_similarity": "0.7018777"
        },
        {
            "id": "hsyco45",
            "score": 1,
            "text": "Many brighter nebulas, galaxies and such are visible to the eye through amateur telescopes, they just don't show much if any color.  Time exposures do capture colors characteristic of the constituent elements, such as hydrogen alpha (pinkish red), doubly ionized oxygen (blue-green), etc.  What irritates me is when false colors are used, or images are over processed to the point of looking unreal.  Amateur astronomer of 40+ years experience, over processed imagery stands out like a sore thumb to me.  I do see some color in showcase objects, by eye, not imaged.",
            "title_similarity": "0.74539983"
        },
        {
            "id": "hsydlsm",
            "score": 4,
            "text": "To help you perceive the shape of the object even if part or all of it would look transparent, imagine a magnificent sculpture made of completely transparent glass, a picture of it would look completely empty, it would make sense to use some other information to colour it",
            "title_similarity": "0.54690456"
        },
        {
            "id": "hsyefvt",
            "score": 2,
            "text": "Often the picture is layered digitally but similar to putting on slide over another and seeing the image, the clever bit is lining it all up.\n\nSome telescopes see wavelengths (colours) that are beyond our eyes capability, is if we lived in say the Orion nebula it would be a super bright red/ grey sky.\n\nIf you eye was capable it would see all those colours.\n\nIt's like making a picture black and white for a dog.",
            "title_similarity": "0.6837358"
        },
        {
            "id": "hsyfqwq",
            "score": 2,
            "text": "In many cases to a human eye it's not even there.  We are talking about sticking your camera straight up into the sky, opening the aperture as wide as you can and just keeping it open for far, far longer than any normal image.  No part of it is normal, a normal picture the aperture is open for 1/10 of a second for a star picture it could be hours.  Meanwhile the Earth is rotating so your camera has to rotate at the exact speed the Earth does to get a good picture.  It is a completely normal process taken to it's absolute extreme to the point that we all agree we need to send a 22' telescope to a Legrange point.  It is worth learning about.",
            "title_similarity": "0.646184"
        },
        {
            "id": "hsygldt",
            "score": 2,
            "text": "The software that goes into enhancing the light is bespoke and high end, massive amount of maths, and a lot of checks just for one spark of light in the data that is sent back. The guy who did it had an office just outside the help desk area of ESO when I worked there. Quiet unassuming German bloke. I think his name was Norbert. 20+ years ago now.",
            "title_similarity": "0.42428228"
        },
        {
            "id": "hsyh14l",
            "score": 1,
            "text": "Astronomical observations are often made by detectors in frequency ranges outside of what we can perceive, usually to “see through” obstacles like dust clouds that are opaque to visible light, or to reveal features that only appear in those frequencies. So then these images are mapped onto a range of colors within the human-visible range. This is often referred to as a “false color image” but that doesn’t mean that it’s lying, just that the presentation in color is artificial, to help make the image easier for human vision to interpret.",
            "title_similarity": "0.7675298"
        },
        {
            "id": "hsyi51n",
            "score": 3,
            "text": "If we’re keeping this at true ELI5 level, there are many “colors” out there that humans can’t see, and much of the universe is in those colors, so they change the colors to ones that you can see so that you get a sense for what’s out there.",
            "title_similarity": "0.7164761"
        },
        {
            "id": "hsyj0ra",
            "score": 1,
            "text": "Nebulae are balls of gas. You can't see them with the naked eye for the same reason you can't see a ball of hydrogen and helium gas in your room.",
            "title_similarity": "0.6319262"
        },
        {
            "id": "hsyjfv5",
            "score": 2,
            "text": "To ELI5 for the why: an analogous thing we see regularly is satellite weather photographs and videos we see on tv weather reports. Just showing clouds doesn’t really tell the full story, so almost all images are enhanced with an infrared overlay. Then we can see not just the visible clouds but also large bodies of moisture in the air. It’s about not just showing what we can see, but also showing the interesting highlights that tell more of the story.",
            "title_similarity": "0.62429965"
        },
        {
            "id": "hsyjgz9",
            "score": 1,
            "text": "Because most photos are black and white and some cameras see in only UV or IR so people/computers colour different areas slightly different colors to make it easier for people to understand what is being represented in the photos. It is something called [False Colour Imaging](https://earthobservatory.nasa.gov/features/FalseColor/page6.php). I believe that is what you are talking about.",
            "title_similarity": "0.7040542"
        },
        {
            "id": "hsykf3h",
            "score": 1,
            "text": "You can’t perceive color in dim light. The color sensitive cells in your eyes don’t register dim light. Other cells are more sensitive but don’t register color. Astronomy photos are enhanced to show color you wouldn’t see otherwise.",
            "title_similarity": "0.5870465"
        },
        {
            "id": "hsylruv",
            "score": 1,
            "text": "Kind of related, but are there pictures of what celestial bodies would like to a naked eye ?",
            "title_similarity": "0.76454026"
        },
        {
            "id": "hsyludh",
            "score": 1,
            "text": "Is there a \"Thumbs up all\" for all comments and replies? I'm loving the replies and questions.",
            "title_similarity": "0.32902604"
        },
        {
            "id": "hsymaie",
            "score": 1,
            "text": "You see those heat signature photos? With The blue , green, yellow, orange and red colours? The human eye can't see that but you can with infrared.",
            "title_similarity": "0.5475471"
        },
        {
            "id": "hsymb92",
            "score": 1,
            "text": "It looks that way, but I’m ways that we can’t actually perceive. There are many lights that we can’t see, but it actually gives off.",
            "title_similarity": "0.67224747"
        },
        {
            "id": "hsymhfc",
            "score": 1,
            "text": "My high school Astronomy teacher told me aside from the technical reasons everyone else is stating regarding what the human eye can see, it's done in order to make findings look appealing to lawmakers and congressional panels and well as the public to garner interest and secure funding for continued research and projects. I always thought that was an interesting take, I got to look through a telescope at Mars and some of other planets that year and was pretty underwhelmed after seeing all the edited pictures.",
            "title_similarity": "0.6401559"
        },
        {
            "id": "hsyn4id",
            "score": 1,
            "text": "It isn’t an unreal image, it just includes things we normally wouldn’t be able to see. \n\nImagine going to a doctor if we still lived in a world that didn’t believe germs existed because they couldn’t be seen.",
            "title_similarity": "0.5856148"
        },
        {
            "id": "hsyn7z0",
            "score": 1,
            "text": "I know some of them say they assign colors humans can see color X Y Z to element A B C.\n\nAs others said. What you would see is nothing.",
            "title_similarity": "0.63033366"
        },
        {
            "id": "hsyomzh",
            "score": 1,
            "text": "Because, “No Bucks, No Buck Rogers.”  \n\nIf the image isn’t cool and attention grabbing, who is going to want to fund more images?",
            "title_similarity": "0.6042186"
        },
        {
            "id": "hsypkf0",
            "score": 1,
            "text": "A black square saying, this is an unltra violet image of a neutron star wouldn't be good press.",
            "title_similarity": "0.6345085"
        },
        {
            "id": "hsyptci",
            "score": 1,
            "text": "Also, the shapes we see and the names we give them are as viewed only from our specific viewpoint in space.  If we were to see this body from any other angle, it would be very different.",
            "title_similarity": "0.73916984"
        },
        {
            "id": "hsyqsbk",
            "score": 2,
            "text": "The objects are so far away that you are getting an almost ignorable amount of light reaching your eye. Because of this most objects you can't even see with the naked eye. If you use a telescope that can increase the amount of light reaching your eyes, but it's still a very small amount and your eyes cannot distinguish between different colors so it just looks like a faint grey blob.\n\nIn other words: it'd be a boring picture if it was what a human can see.\n\nBut those colors are still there and that's where these enhancements come in. When astrophotographers take those breathtaking pictures they're actually hundreds of minutes-long exposure images layered on top of eachother. The longer the picture is exposed, the more light it gets and keeps adding to the data to eventually get color (our eyes cannot do this), but not too long because then we get the overexposure problem. Then they take multiple pictures and then combine them because the distance makes it so that one minute-long exposure can still be missing details. Combining hundreds of those images will create one picture with all the detail and color. Then finally they mess with the color balance to make it look good.\n\nAnd then there's a lot of things we can learn by taking pictures of light we cannot see. Like Infrared can penetrate the dust clouds littering our galaxy while visible light cannot and then we can find neutron stars using X-Ray imaging, to name a couple examples.",
            "title_similarity": "0.7509879"
        },
        {
            "id": "hsyrk8m",
            "score": 1,
            "text": "Much like things that are only discernible under the microscope or internal mechanisms that only show when disassembled, a lot of celestial images are \"enhanced\" because human vision is unbelievably limited.\n\nSeeing the \"real thing\" is not possible with your naked eyes.",
            "title_similarity": "0.7903757"
        },
        {
            "id": "hsyrv8f",
            "score": 1,
            "text": "In this case enhanced doesn't mean beautification filter. It usually means the photo is captured using special sensors in light frequencies that are not visible to human eyes at all. \n\nThink about thermal imaging where colors represent temperature. The coloring is the 'enhancement' so you can see it.",
            "title_similarity": "0.54846025"
        },
        {
            "id": "hsyrylj",
            "score": 1,
            "text": "Lot of talk about galaxies here but I think OP was asking about planets in our solar system...",
            "title_similarity": "0.64470077"
        },
        {
            "id": "hsysyrh",
            "score": 1,
            "text": "To add what people say, here is an example of non celestial.. [this is a flower half in normal light, half in UV](https://2.img-dpreview.com/files/p/E~C840x0S2160x2160T1200x1200~articles/6222641961/uv_light_see_the_world_through_the_eyes_of_insects.jpeg). WE just dont see that pattern at all with the human eye. some insects do and thats why a lot of flowers have different patterns in uv. and well it teaches us new stuff.\n\n(and yeah a lot of stuff is the right color and all its just it would be too dim for us to see all those colors, they are there we would just need a larger non moving eye to capture all teh photons)",
            "title_similarity": "0.58431077"
        },
        {
            "id": "hsyvros",
            "score": 1,
            "text": "In a more broad sense about the subject, without artistic interpretation, about 99% of physics wouldn't be possible to conceptualize. \n\nPictures of celestial bodies that are modified to the point where they'd never look the same in person is no different than a drawing of an atom or a diagram of light going through a lens. They all offer more information from a different perspective that allows for further understanding of the topic.",
            "title_similarity": "0.8115773"
        },
        {
            "id": "hsywnqo",
            "score": 1,
            "text": "For anyone interested, Vox has a very interesting and digestible video on this topic.\n\nhttps://youtu.be/WSG0MnmUsEY",
            "title_similarity": "0.4063641"
        },
        {
            "id": "hsyx04q",
            "score": 2,
            "text": "Can someone do the favor of uploading a raw vs edited picture of space?",
            "title_similarity": "0.6675602"
        },
        {
            "id": "hsyx5of",
            "score": 1,
            "text": "Is there any website where we could see how celestial bodies look like for the human eye ?",
            "title_similarity": "0.6613856"
        },
        {
            "id": "hsyymw5",
            "score": 2,
            "text": "To translate scientific understanding to theauperson.  \nAn atom doesn't look like balls with orbits, a black hole is not a whirlpool, and planets mostly look like smudges and piles of numeric data.  If you saw what human insteuments really recorded you'd need the same PhD than those who are making sense of it.",
            "title_similarity": "0.6377832"
        },
        {
            "id": "hsyztjb",
            "score": 1,
            "text": "The same reason why they show you those fancy lines on a magnetic field.  \n\n\nSo you understand that it's there in an easily digestable visual medium (aka a picture with colours you can see), and just how much of it is there that you normally cannot percieve, but is still there anyway.",
            "title_similarity": "0.5195216"
        },
        {
            "id": "hsz0bae",
            "score": 2,
            "text": "So you can see the beautiful structures you otherwise couldn’t see but that are still there.",
            "title_similarity": "0.3975415"
        },
        {
            "id": "hsz3jg4",
            "score": 1,
            "text": "This is basically the question that started science. Humans senses are everything to us, and we put so much emphasis on things only mattering if we can detect them with one of them. Yet the universe is vastly greater than any of our senses can detect. \n\nThe point of showing you something you can't see is to make you aware of that. Hopefully, that encourages a curiosity into what else your senses are failing to tell you.",
            "title_similarity": "0.72306716"
        },
        {
            "id": "hsz41w1",
            "score": 1,
            "text": "Because the human eye cannot see in the IR or UV or radio or gamma ray spectra. If a given celestial object has details in those non-visible parts of the electro-magnetic spectrum, how else, besides a \"false-color\" image would get that detail across? For example, a massive cloud of gas and dust might have several proto-star systems forming within it, but the material of the cloud blocks those details, while looking at the same scene in IR makes each proto-star pop out in bright relief.\n\nEven presenting those non-visible images in monochrome is not \"honest\", since black and white images are visible while the underlying IR or UV or radio or gamma ray imagery is not.",
            "title_similarity": "0.78298616"
        },
        {
            "id": "hsz5kvv",
            "score": 1,
            "text": "SmarterEveryDay did did a video on the James Webb telescope, and explains some of this concept here: https://youtu.be/4P8fKd0IVOs?t=843\n\nIn short, the universe is still expanding away from us. You likely know of the doppler effect which relates to your perception of sound as the source moves either towards or away from you and the pitch changing accordingly.\n\nThe same is also true for light. If you have a light source that is moving away from you at great speed, that can also do the same and affect the \"pitch\" of the light. Because our eyes are only sensitive to a very small piece of spectrum, this alone can push the light coming at us out of the visible spectrum and into infrared which we cannot see with our eyes. \n\nThe light being emitted from these celestial bodies can be seen in our visible spectrum, and if we were closer and moving at the same speed relative to it, we would be able to see it with our naked eye. Because of the reasons mentioned above, the light has shifted to a wavelength we can no longer see and we must make certain assumptions on what it would look like to correct and shift back to the visible spectrum.",
            "title_similarity": "0.6900867"
        },
        {
            "id": "hsz5nij",
            "score": 1,
            "text": "Have you ever appreciated a photo of the Northern Lights? Let me tell you that unless conditions are absolutely perfect, they don't look like that to the naked eye. Does that mean we shouldn't set a camera up with a long exposure to appreciate all the colors that are actually there?",
            "title_similarity": "0.6400143"
        },
        {
            "id": "hsz794x",
            "score": 1,
            "text": "Why show a security video if it was filmed using a night vision camera?",
            "title_similarity": "0.5015998"
        },
        {
            "id": "hsz7nf6",
            "score": 1,
            "text": "It’s a good question. Personally I think image-wide enhancements are legit (Eg the gain of green is boosted, the min and max are adjusted). What I find illegitimate for photographs is selective filtering. For example, a nebula where one object is selected with a lasso tool and colors adjusted. I think that is painting, not astrophotography. Unfortunately, most pretty nebulas are painted these days.",
            "title_similarity": "0.6503533"
        },
        {
            "id": "hsz7rwp",
            "score": 2,
            "text": "The human eye is only a guide, it doesn't see everything. Bringing the invisible into the visible spectrum allows humans to understand more and guess less.",
            "title_similarity": "0.49851292"
        },
        {
            "id": "hszadbx",
            "score": 1,
            "text": "I no right! It's like when I'm looking at a graph of statistics or whatever and they draw all the lines using different colors.\n\nThey're NUMBERS. NUMBERS don't have colors!",
            "title_similarity": "0.56895256"
        },
        {
            "id": "hszanb0",
            "score": 1,
            "text": "Just wait till you hear about Venus. That bright orangey yellow image you see everywhere? Completely false color. It’s actually all a dull brown.",
            "title_similarity": "0.60291195"
        },
        {
            "id": "hszcanl",
            "score": 1,
            "text": "I thought you were talking about artistic depictions of celestial beings, like angels and stuff. Man I was confused",
            "title_similarity": "0.75921875"
        },
        {
            "id": "hszdlem",
            "score": 1,
            "text": "Why does it matter whether the biology of your human eyeball would allow to physically see the celestial body or not? The image isn't any less real. Also I imagine if people wanted to see blank pictures they could just stare at a piece of paper in the dark.",
            "title_similarity": "0.72681946"
        },
        {
            "id": "hszdwmp",
            "score": 1,
            "text": "Color enhanced for visual simulation and enjoyment..... enjoy the splendor and be glad it's not bland...",
            "title_similarity": "0.26968974"
        },
        {
            "id": "hszfmrt",
            "score": 1,
            "text": "Same reason you might read to a blind or illiterate person — just because they can’t see it themself doesn’t mean they wouldn’t find it interesting.\n\nThere’s lots going on that to ‘see’ we need translated into spectra and forms that we can parse.\n\nThe difference between this and faking is whether the photo accurately and intelligibly reflects something real, ‘out there’.",
            "title_similarity": "0.6714311"
        },
        {
            "id": "hszfu7q",
            "score": 1,
            "text": "it has a lot to do with how the sensors work and what they want to know about.\n\nif you know about [chemical bands](https://www.britannica.com/science/band-spectrum) in light.\n\nthe sensor are designed to see different colours and are then composited together to form the image for an over all visible light image.\n\nthat way it can be tuned to highlight the particular molecules theyre interested in on an individual sensor.\n\n(eli5) its RGB but the B isnt the wavelength of primary Blue its the wavelength of the oxygen band.\n\ntelescope sensors arent even colour at all, theyre black and white, but the 'White' is actually a particular colour in the spectrum.\n\nits a measurement of how many photons of a particular wavelength hit that spot on the sensor.",
            "title_similarity": "0.65534806"
        },
        {
            "id": "hszfym3",
            "score": 1,
            "text": "Would you prefer to look at a picture of near black nothingness?  That's what it would look like with your eyes.\n\nThink of it like night vision in a pitch black room.  The things you can see with night vision are actually there, but without any lights on, you can't see them with your unaided eyes.\n\nI think this is stemming from depictions of space that we see in science fiction movies.  Everything in those movies are brightly lit, easy to see, and appear to be close.",
            "title_similarity": "0.59687406"
        },
        {
            "id": "hszfzkh",
            "score": 1,
            "text": "Everyone is approaching this from a scientific perspective so I’ll at an artistic angle:\n\nThere is more than what the human eye would see in a photo. For a photo to be powerful it needs to capture what is visually present, but more importantly it needs to capture the feeling of the situation. When one goes out to see the stars you may only be seeing a dim set of dots really far away, but there is a feeling of greatness that can only be demonstrated by adjusting the colors. \n\nA quick example of this is a photo I took a while back. [This](https://i.imgur.com/dwaAjfN.jpg) is what the stars really looked like in the camera. It is a bit dimmer than what the naked eye would see, but fairly close. [This](https://i.imgur.com/BWy5Hmm.jpg) is what the final image looks like. You could argue that it is too edited (it didn’t turn out perfectly), but I believe that it is a better representation of what one would “experience” rather than just what one could see.\n\nEdit: also it is just prettier.",
            "title_similarity": "0.7923237"
        },
        {
            "id": "hszg7hp",
            "score": 1,
            "text": "This is not the explanation you're looking for. But those images show light we cannot normally see with our eyes. If those pictures were shown with only what's visible to our eyes you'd essentially have a dim boring picture with no detail around what's going on in the image. Do you want handed a dull mostly static image or a bright near incomprehensible yet unimaginable image of our galaxy?",
            "title_similarity": "0.74239457"
        },
        {
            "id": "hszj3f3",
            "score": 1,
            "text": "All star photos are \"enhanced\" whether it's enhanced brightness by long exposure, or enhanced color by shifting infra-red into visible light.\n\nThe purpose is to be able to visualize these things that are not otherwise visible.",
            "title_similarity": "0.53069085"
        },
        {
            "id": "hszl0r9",
            "score": 1,
            "text": "I remember the first time I saw Saturn through a telescope. I had just started working at a college where they had an observatory, and I got to go there on a public observation night. I was absolutely stunned because Saturn looked to the naked eye exactly like it does in all the pictures I’d seen throughout my life. I don’t know exactly what I was expecting, but I guess I just somehow assumed that the photos and books were enhanced or almost like an artist rendition. But I could clearly see the rings and the coloration of the planet. It was mind blowing!",
            "title_similarity": "0.67077553"
        },
        {
            "id": "hszn9ho",
            "score": 1,
            "text": "You don’t have Predator vision where you can see human heat signatures, but I bet you thought it was awesome when you saw the rendering of them from the Predator’s perspective in the movie. \n\nJust because human eyes can’t detect certain wavelengths of light (i.e., nearly all of them) doesn’t mean the stuff going on there wouldn’t be awesome to see if we *could*. \n\nJust be happy we can even see *some* of the invisible universe around us because of geniuses who gave us the capability to look at it. It’s fucking amazing.",
            "title_similarity": "0.6731747"
        },
        {
            "id": "hszotfe",
            "score": 1,
            "text": "Finding this out was such an incredibly crushing moment for me as someone that loved space all my life.",
            "title_similarity": "0.48086143"
        },
        {
            "id": "hszptgo",
            "score": 1,
            "text": "Doctors don’t look at X-ray photographs in the X-ray spectrum. They use film that changes to absorb visible light based on how much X-ray light it has been exposed to. The result is a picture that you cannot normally see because you cannot see through flesh and you cannot see through bones.\n\nSame deal here. There’s stuff in space we can’t see, but they emit frequencies of light that can be shifted to a point where we can discern important details that matter.",
            "title_similarity": "0.7064596"
        },
        {
            "id": "hszr30n",
            "score": 1,
            "text": "Because OIII and HA(hydrogen alpha) are extremely dim to humans when observing.  Because you'd never be able to process light accumulative like cmos/CCD sensors and computers.  So enhancing them and simulating them to get an image is the only way.",
            "title_similarity": "0.6552041"
        },
        {
            "id": "hszrh2f",
            "score": 1,
            "text": "Imagine a blind person asking why a sunset was worth looking at.  That’s us when it comes to cosmic phenomena.",
            "title_similarity": "0.65360093"
        },
        {
            "id": "hszth5x",
            "score": 1,
            "text": "Because the telescopes we have usually don't gather light in the visible spectrum (which is only a tiny sliver of the entire light spectrum).\n\nInstead they might gather something from the radio spectrum, or the x-ray, infrared, etc etc etc.\n\nThere's benefits to these other parts of the spectrum (they vary depending on what part).\n\nFor example:\n\n1. Some parts of the spectrum can penetrate further into the universe without scattering meaning we can see further.\n2. some can act as signatures for atoms since different atoms absorb/reflect different parts of the spectrum, meaning we can get an idea of what that object is primarily made of.\n3. could be as simple as the hardware is lighter/cheaper/longer lasting/etc for picking up these different parts of the spectrum\n\nIt allows us to get a diverse set of information about the celestial body we see.\n\nBut also it means that most of these celestial bodies don't actually have \"visible spectrum\" images of them because we never bothered to take a picture of it. Or if they do, they're kind of boring. Consider it... most celestial bodies are made up of dust and stars... so a whole lot of \"white\". Not the most interesting thing to look at a big glowing white blob.\n\nLook in the sky at night... it's all white blobs!\n\nYou're seeing what the visible spectrum has to offer!\n\nThink about it... you're not going to see a distant planet like this. You're going to see stars and galaxies which are made up of stars. And it's not like a star has a varying surface with details. It's going to mostly be 1 color... white, maybe reddish or blueish... but pretty much... bright whitish.\n\nThese other spectrums are just... more interesting to look at!",
            "title_similarity": "0.6600721"
        },
        {
            "id": "hszw7xi",
            "score": 1,
            "text": "Because what the makes eye can see isn't  all that's interesting or important. \n\nMost often, you're seeing \"false-colour\" images, where the colours of the object as seen in the picture do not represent the colours you would see with your eyes - this is because there are a lot more 'colours' that your eye simply can't see. It's better to give those a false colour and show them on the image anyway, as you might see some new structures of gas or dust that are giving off light of that colour. \n\nThe frequency/wavelength range of light that our eyes are sensitive to is extremely narrow - we see light with wavelengths of 400-700nm - already about 100x narrower than a human hair, and that's our entire range. \n\nA lot of the light emitted by objects in deep space is in the infrared (longer than 700nm), stretching out to tens of micrometres. \nA lot of this infrared light is extremely informative, as it shows where a lot of the gas and dust lies - which is super important for physics and astronomy. \n\nThe pretty images are usually to help us understand the size, location and shape of such structures - colour is simply used to create contrast between different things - not to represent what the human eye would see.",
            "title_similarity": "0.7317041"
        },
        {
            "id": "hszx37j",
            "score": 1,
            "text": "The milky way you can barely see. Took the picture with my camera and couldn't believe all that was right above my head",
            "title_similarity": "0.721935"
        },
        {
            "id": "hszx41x",
            "score": 1,
            "text": "Much of what is captured in telescopes is often too dim to be seen by the human eye, or in light-wavelengths we cannot see ourselves (x-rays, etc).\n\nHence, any washed-out white image you get from an observatory might be information-dense, but to our eyes it's still just a smudge (Mr Lunis?).\n\nHence, that smudge needs to have it's contrast, color-levels, etc adjusted so it makes sense to US.",
            "title_similarity": "0.7454753"
        },
        {
            "id": "hszxyky",
            "score": 1,
            "text": "Electromagnetic radiation spans a huge frequency range of which humans only see a small fraction of in the teraherz range. However most radio astronomy and optical autonomy are in non visible frequencies. Observations that are able to create images from the collected data map the frequency and intensity information into human visible spectrums using a variety of algorithms.  What's going on with these imagining algorithms is far far more sophisticated than a filter you might use on a phone app or Photoshop.",
            "title_similarity": "0.63882166"
        },
        {
            "id": "ht014zx",
            "score": 3,
            "text": "These images show interesting stuff that you would not otherwise see. Remarkable and fascinating stuff that might be completely uninteresting to look at if you only display visible light. To simplify think pictures of deep sea creatures - there is no visible light so deep under water so you would just not see the creature",
            "title_similarity": "0.6007694"
        },
        {
            "id": "ht01iup",
            "score": 1,
            "text": "Best way I can put it simply. We use filters to block and allow specific wavelengths of light, so that we can see what is happening, and then we combine them to get a whole picture of what is going on.\n\nFor example, 3 of the most common filters (apart from the typical colours) are calles Hydrogen-alpha, Oxygen-3 and Sulphur-2. Each one allows a very specific wavelength through it, and our cameras then pick it up in the image. When you look at them, you will likely see a description something like \"Photographed  in HaGB\" which means that the Hydrogen-Alpha, green and Blue light filters were used, with Ha being used in place of Red.",
            "title_similarity": "0.56888276"
        },
        {
            "id": "ht04ttb",
            "score": 1,
            "text": "bruh i was already shook that chickens can see more light than us but now i learned that pictures of nebulae are fake and i’ll never be able to see one ?? 🤕",
            "title_similarity": "0.75183314"
        },
        {
            "id": "ht04ypi",
            "score": 1,
            "text": "Well, it’s highly debatable how an object thousands of light year away in the void of space make look up-close. How one can even start to think such thing is possible is the culprit here.",
            "title_similarity": "0.7242347"
        },
        {
            "id": "ht05hwv",
            "score": 1,
            "text": "Not all celestial bodies are \"photographed\" in the visible spectrum (the light and colours we can see). \n\nSome aspects of space can only be seen using other parts of the light spectrum (uv, xray, etc) \nLong story short, space is messy. When we're looking far away it isn't always a \"clean\" line of view. So we have techniques that allow us to look through all the dirt and debris. \n\nSo if you looked through a regular telescope you'd see blurry nothingness (trying to look too far).\nBUT if you had filters on a telescope that was hooked up to a computer that could \"absorb\" \"light\" for extended periods into one photo: that's when you get the Magic. 🥰\n\nWhen we get those photos, we do some awesome layering stuffs with astronomy specific software, if needed-some fake colourization, and the finished product is the photos you see (: \n(The ACTUAL raw pictures are ugly and sometimes you can't even tell there's a galaxy there until you put it through the computer magic!) It's all a really cool process (:",
            "title_similarity": "0.7508119"
        },
        {
            "id": "ht06ds9",
            "score": 1,
            "text": "Think of it like looking at something under a Scanning Micron Electroscope (SEM). You'll never see it that way but wouldn't you want to know what it looks like?",
            "title_similarity": "0.53003144"
        },
        {
            "id": "ht07nik",
            "score": 1,
            "text": "It's called marketing, same with paleontology.\n\nThe show you something cool and interesting, even though the thing they have looks nothing like what they show you.\n\nIt's supposed to help people donate more to thier field of science.",
            "title_similarity": "0.53830683"
        },
        {
            "id": "ht07u07",
            "score": 1,
            "text": "Would you like to see the picture in regular mode or god mode?",
            "title_similarity": "0.48276445"
        },
        {
            "id": "ht083cb",
            "score": 1,
            "text": "Perhaps someone has an answer, but would it ever be possible to increase the humans ability to actually see these events without the aid of trickery/editing photos.",
            "title_similarity": "0.68115807"
        },
        {
            "id": "ht08hk8",
            "score": 1,
            "text": "I'm a layman on the topic, so weigh the clearly more educated comments accordingly. My thought process is something along the lines of \"thermal imaging cameras are altered, but reveal something we can't see.\" these other filters applied to celestial bodies surely have their use as well. \n\nIn not so many words, we're looking at a data bit astronomers would use, not art.",
            "title_similarity": "0.7473844"
        },
        {
            "id": "ht08qbk",
            "score": 1,
            "text": "To show you what is, unfettered by the limitations of human vision. We have instruments which can tell us so much more than our eyes, but to visualize this information, it's mapped to visible colors.",
            "title_similarity": "0.6704323"
        },
        {
            "id": "ht0fw24",
            "score": 2,
            "text": "Because the raw data is often so uninteresting - and the human eye so poor at seeing the dim and distant object in question....\n\nhttps://imgur.com/abDVRsG\n(one raw unprocessed image that I took with a robotic observatory from a total of 12 that were acquired)\n\nThat you really NEED it to be enhanced and stretched and processed to make it worth discussing at all.\nhttps://imgur.com/YKpNnbk\n(the finished result of stacking and processing the 12 images)\n\nThe resulting image is real.  It's using special filters to enhance what you see.   But it has to be processed to tell the story.",
            "title_similarity": "0.69968104"
        },
        {
            "id": "ht0jy55",
            "score": 1,
            "text": "that's like claiming a topographic map is useless -- an image is always a representation of something. The colors, xyz coordinates, arrows, etc are all representations of density, temperature, spin, or other characteristics that cannot be observed. a topographic map doesn't have trees or lakes but it has elevation, which is an abstract concept",
            "title_similarity": "0.5854336"
        },
        {
            "id": "ht0lhc2",
            "score": 1,
            "text": "Same with infrared cameras. Your eyes can’t see infrared light, but infrared cameras comes with a nice visualization where you see infrared as red.",
            "title_similarity": "0.51269126"
        },
        {
            "id": "ht0mibr",
            "score": 1,
            "text": "Biggest reason is to make it look more interesting. It can also help us see things that are there but not visible to us; we can't see wind but using some smoke we can see it.",
            "title_similarity": "0.54517424"
        },
        {
            "id": "ht0muoj",
            "score": 1,
            "text": "a few reasons. number one is that there are many spectrums of light we are unable to see. the space and earth based telescopes are able to see in those spectrums but provide imaging that isn't always...pretty to the average observer. they artificially color these images to provide us with more visual context and contrast for what we're looking at. \n\nadditionally, they do this for PR reasonings. Pretty images with catchy titles that spread like wildfire on the internet are always a benefit for these researchers.",
            "title_similarity": "0.69884366"
        },
        {
            "id": "ht0na49",
            "score": 2,
            "text": "There's different reasons pictures will have different colors. One reason might be because they took a picture of just the light from hydrogen atoms then another of helium atoms and combined the 2 pictures. Instead of having 2 shades of nearly identical orange one color might be changed to blue so you can see the difference. Another reason is they will take pictures from different telescopes that can see different things, like infrared, x-ray and visible light. They then combine all the pictures into one but change the color for each source so you can see the different spectrums.\n\nHere is an astrophysicist explaining it much better. https://m.youtube.com/watch?v=-dmiS_6YrGU",
            "title_similarity": "0.69703305"
        },
        {
            "id": "ht0puzi",
            "score": 17,
            "text": "There are a lot of good answers here, but it's worth sharing an actual, visible light image of something.\n\n[This](https://imgur.com/iT6MIX6.jpg) is the Dumbbell Nebula.\n\n[This](https://imgur.com/dxUac6q.jpg) is the Eagle Nebula. You may recognize the famous Pillars of Creation near the center.\n\nI took both of these with a simple astronomical camera and an amateur telescope. The camera is nothing more than a CMOS detector, in a housing that fits into the telescope, with a USB cable connecting it to my laptop. The sensor is more sensitive to infrared light than your eye, so I use a filter to remove that part of the spectrum.\n\nThe telescope just acts like a telephoto lens on a camera, but it's important that it has a large-diameter lens to gather more light.\n\nBoth of these objects are easily visible to the eye in an amateur telescope. The Dumbbell will show its shape in even a small telescope, but it will be grey because there's not enough light hitting your retina to activate your cone cells that perceive color. The Eagle Nebula will be a faint cloud of light around a star cluster because the details are too subtle for the eye to pick out; the bigger the telescope, the more easily you will perceive the light of the cloud. In a smaller telescope all you will see is a star cluster.\n\nIn a larger telescope, say, with a 24\" diameter, it will gather enough light that you will perceive color in the Dumbbell and fine structure in the Eagle. This is where the camera really does what your eye cannot - it can gather light continuously, getting more and more data the longer you leave the \"shutter\" open, even in a smaller telescope where looking through an eyepiece would show a faint patch of lightness. Our eyes simply aren't sensitive enough to see the same thing as the camera. \n\nThe objects shown in all these pictures are 100% out there and exist in the form that is presented - the pictures just show us details our eyes can't pick up. A lot of the other answers I see here are dealing with \"false color\" images, which have been well-explained.",
            "title_similarity": "0.67781794"
        },
        {
            "id": "ht0q0cv",
            "score": 1,
            "text": "It is the same as with CCTV cameras filming at night. As your eyes are able to change their perception of your surroundings (you may have noticed that you will gain some sort of night vision when in a dark room for some time) so are the cameras able to change the appearance of what they sense with their imaging sensor so the person in front of the screen can process this information.\nThe same thing applies to all digital images you see. When taking a picture you have - depending on the type of camera you are using - lots of possibilities to change the outcome of the image. For astrophotography this is very important as the differences that the scientist are interested with in are very subtle and sometimes not even visible to the human eye. So they change the settings of their cameras to visualize the thing they are interested in better.",
            "title_similarity": "0.5347152"
        },
        {
            "id": "ht0un70",
            "score": 2,
            "text": "This is a question that photographers get as well when we do low light photography.\n\nThe simplest answer is that the eyes can't see detail well in low light or distant objects. Space is both distant and low light.\n\nIt isn't fake. It is an enhanced image because our naked eye has a limit to what we can see. Sensors are able to capture detail and data our eyes cannot. Software is able to make those captured detail and data more obvious.",
            "title_similarity": "0.60564494"
        },
        {
            "id": "ht0v4np",
            "score": 1,
            "text": "Electron microscopy is the same. They’re always in black and white but colored afterwards. This is because for electron microscopy they are showing the smallest details possible that they are smaller than the wavelengths of color which I personally think is super cool",
            "title_similarity": "0.44653016"
        },
        {
            "id": "ht0xrj6",
            "score": 1,
            "text": "Today I finally realized that Eli aged 5 isn’t an active member of this sub but actually the shortened version of the subreddit’s name.",
            "title_similarity": "0.42927718"
        },
        {
            "id": "ht14581",
            "score": 1,
            "text": "Presumably for the same reason so many pictures of nature and people are enhanced. It looks prettier.",
            "title_similarity": "0.41875368"
        },
        {
            "id": "ht1545f",
            "score": 1,
            "text": "The primary reason is that these images are taken with wavelengths of light other than the visible light spectrum. This allows us to take detailed images of celestial objects which do not appear very bright in the visual spectrum.\n\nIt can also allow us to detect objects which do emit light in the visual spectrum, but which are so far away that the light has been shifted out of the visual spectrum by the doppler effect.\n\nWe then turn these images into something which can be interpreted by humans by keying wavelengths of the band we use to image them to wavelengths of visual light, creating a 'false color' image.",
            "title_similarity": "0.72178614"
        },
        {
            "id": "ht1dq3u",
            "score": 1,
            "text": "Just because an image is something that can't be perceived in the visible light spectrum of humans doesn't make it \"unreal\" image. It is totally real, and the astrophotographer is simply wanting to enhance it to the point of making it visible for the viewer since their limited eyesight couldn't enjoy it in it's natural state.",
            "title_similarity": "0.6893585"
        },
        {
            "id": "ht1eng5",
            "score": 1,
            "text": "Same is true of anything we look at through a microscope. It is still real, just greatly enhanced so our weak human eyes can see details.",
            "title_similarity": "0.43160427"
        },
        {
            "id": "ht1exw4",
            "score": 1,
            "text": "The way it was described to me is that the enhanced pictures have more of an aesthetic appeal. This will help draw more attention to the topic. In a number of ways this attention can be used to acquire value.\n\nTldr My friend thinks it's because people will pay for pretty space pictures and are more likely to fun new project to find other celestial bodies. Scanning space can be expensive.",
            "title_similarity": "0.68487215"
        },
        {
            "id": "ht1g3yi",
            "score": 2,
            "text": "Its not that we 'enhance' them so to say, it's either we've received them that way (Radio/Xray/non-optical-imaging lenses) or we've changed the key spectrum of colors we're interested in seeing, or to improve visibility on things we can't see well, such as deep space nebulae. \n\nAs an image analysis tech that's part of my job :D",
            "title_similarity": "0.7314723"
        },
        {
            "id": "ht1j5f4",
            "score": 1,
            "text": "It's like watching weather temperature maps where dark blue is below freezing and red is above body temperature.\n\nThe world sure doesn't look like that, but it's really informative, cool and useful",
            "title_similarity": "0.46394637"
        },
        {
            "id": "ht1khmz",
            "score": 1,
            "text": "To tell you what gasses are present in the nebula.  Blue for oxygen, red for hydrogen, yellow/green/purple for other gasses/elements.  IRL most of them just look white like smoke, and as far as the general public is concerned the colorful images are way more appealing",
            "title_similarity": "0.57667744"
        },
        {
            "id": "ht1km0u",
            "score": 1,
            "text": "One issue is that a lot of space objects emit narrowband, rather than broadband. Our eyes evolved to see broadband though! So an astronomer will use a set of narrowband filters to allow light from specific gasses through and isolate them from each other. Hydrogen, oxygen, and sulfur are common elements of an image, and might form different structures in a nebula. Using normal RGB filters, you would see some of the elements as the same color. Using narrowband filters, you can color the gasses differently from each other.",
            "title_similarity": "0.66079694"
        },
        {
            "id": "ht1mics",
            "score": 1,
            "text": "The electromagnetic spectrum stretches from radio waves to gamma waves, but only a tiny portion of that spectrum is visible to you. The rest is hidden. A lot of cosmic phenomena happens in the parts of the spectrum you can't see, so scientists shift images of those phenomena to the part of the spectrum you can see.",
            "title_similarity": "0.7104244"
        },
        {
            "id": "ht1qrzf",
            "score": 2,
            "text": "Because it's not unreal!\n\nWords! Words are important. More words! Words, words, words, which are good, which are bad?! Words, words, words.",
            "title_similarity": "0.3290331"
        },
        {
            "id": "ht1qs30",
            "score": 1,
            "text": "I thought the question asked about celebrity bodies and I was very confused at answers I saw until I re-read the title, lol",
            "title_similarity": "0.67188305"
        },
        {
            "id": "ht1th8i",
            "score": 1,
            "text": "What color IS Jupiter anyway? I don't even know anymore...",
            "title_similarity": "0.55058724"
        },
        {
            "id": "ht1tpkx",
            "score": 1,
            "text": "Our eyes are quite feeble in terms of seeing the electro magnetic spectrum but our brain is quite keen on seeing patterns. These altered pictures while pretty allows the brain to try to come up with theory on cosmic processes that our eyes could never see.",
            "title_similarity": "0.6853397"
        },
        {
            "id": "ht1vif9",
            "score": 1,
            "text": "Humans can analyze images and audio way better than they can analyze raw data. UV and IR images can show things like denser cloud layers or hidden volcanic activity by showing \"Hot spots\" which are just an area with denser IR sources, or we can see different atmospheric make up by viewing how the atmosphere of a planet in UV and see how much solar radiation is being reflected by the atmosphere of the planet. (speaking about like the different filtered views of our local planets).  \n\n\nIts really about giving a better representation for people to be able to view the information and study it. Also this isn't just a science thing every digital device you interact with on a daily basis does the same thing, if you have a thermostat its giving you the data its receiving formatted in a way you can understand, or if you have ever used an IR camera its the same thing. None of the information is made up, its just formatted in a way that makes it easier to analyze as a human.",
            "title_similarity": "0.68788266"
        },
        {
            "id": "ht1wakl",
            "score": 1,
            "text": "Astrophotography is also about the craft of it. It’s a skill people learn a lot about and the photo/end result is an accumulation of their knowledge and skill they worked hard to achieve.",
            "title_similarity": "0.4642588"
        },
        {
            "id": "ht1x9gb",
            "score": 1,
            "text": "The same reason people post enhanced photos of EVERYTHING.\n\nThey get more attention than the non enhanced version.",
            "title_similarity": "0.50386024"
        },
        {
            "id": "ht22qu2",
            "score": 1,
            "text": "\"Neurologically speaking, we really only deal with matter of a certain size, and energy of a few select wavelengths. For everything else, we have to make up mental models and see if they match up to the tiny shreds of hard evidence that actually feel real.\"",
            "title_similarity": "0.5702056"
        },
        {
            "id": "ht24vz7",
            "score": 1,
            "text": "The human eye is adapted exclusively to this environment's atmosphere. Outside of it are things the eye hath ne'er perceived or would ne'er perceive had we not invented tools to relieve our curiosity.",
            "title_similarity": "0.55304945"
        },
        {
            "id": "ht25488",
            "score": 1,
            "text": "ELI500\n\nI have ALWAYS wondered about this!! NASA spends a fortune to take images that aren't even real?!",
            "title_similarity": "0.72026783"
        },
        {
            "id": "ht25uvj",
            "score": 1,
            "text": "If you prefer just look at an all black photo and that’s the universe and beyond and all the interesting phenomena you find in it.",
            "title_similarity": "0.5252146"
        },
        {
            "id": "ht2a0vu",
            "score": 1,
            "text": "In short, its because these happenings are still fascinating to see when enhanced to match our visual capabilities. On the other end of the spectrum, there are microcosmic happenings all around us that our human eye wouldn't be able to decipher without enhancement. We had some inkling these things were happening but we couldn't see it before Teleacopes, Microscopes, and the color enhancements that come with each.",
            "title_similarity": "0.6217116"
        },
        {
            "id": "ht2ain2",
            "score": 1,
            "text": "The ones of Venus ([actual](https://upload.wikimedia.org/wikipedia/commons/0/08/Venus_from_Mariner_10.jpg) [enhanced/surface](http://www.nasa.gov/sites/default/files/thumbnails/image/imagesvenus20191211venus20191211-16.jpeg)) and Pluto ([actual](https://cdn.mos.cms.futurecdn.net/QL25cXpGAT6XocQrjjqhMN.jpg) [enhanced](https://cdn.uanews.arizona.edu/s3fs-public/images/uanow/Pluto_UANow%20thmb.jpg)) drive me nuts...",
            "title_similarity": "0.5514518"
        },
        {
            "id": "ht2b7a8",
            "score": 1,
            "text": "Have you ever seen photos of landscapes or trees or vegitation that were taken in infrared but presented in weird colors where plants show up red? That is a false-color post processing. \n\nThe human eye cannot see infrared. But that information can be useful (tells scientists about the amount of vegetation in an area) and it can just be cool or interesting to the general public. The problem is the human eye can only see 3 color channels of information and every color we see is a mix of those 3 colors. So how we often show Infrared (or UV or other channels we cannot see) is by moving channels around to make space to put the \"invisible\" information into a channel we can see. \n\nEven B&W Infrared or Xray images are not how the eye would see things... we don't see IR or X-rays, so what they do for those is just replace all brightness with what is in the IR, Xray, or whatever \"invisible\" wavelengths we're recording.",
            "title_similarity": "0.6296686"
        },
        {
            "id": "ht2by1m",
            "score": 1,
            "text": "\nNot for a 5 year old, but a philosophical argument: \n\nThe human eye just sees what you see looking up.\n\nWe use big light buckets - called telescopes - to gather orders of magnitude more light than you can with the human eye.\n\nWe use integration over time to increase this light even more.\n\nWe stack the images to provide sharpness that the atmosphere doesn't allow for otherwise.\n\nWe select colors by spectrum for contrast and to knock down light pollution.\n\n\nWhich if those steps is the offensive one or the one that seems like cheating? \n\nI would argue that even what you see with the human eye isn't accurate to reality. Everything very far is mashed flat onto a 2D plane. We aren't in the right spot to see the best truth for most things in the universe. Our imaginations may be more accurate than the views we get from earth.",
            "title_similarity": "0.7206669"
        },
        {
            "id": "ht2cwg1",
            "score": 1,
            "text": "There's no reason to view humans as the objective interpreters of the universe. Just because we can't see something, doesn't mean it's not there.",
            "title_similarity": "0.55048174"
        },
        {
            "id": "ht2cwyj",
            "score": 1,
            "text": "You could literally ask the same question about images of microscopic organisms. Do you think there is no value in the information that exists outside our sensory capacity?",
            "title_similarity": "0.574519"
        },
        {
            "id": "ht2dgbx",
            "score": 1,
            "text": "Because you wouldn't be able to see most of it. They are changing the things you can't see for colors that you can.  Otherwise things mostly look like dim red blobs.",
            "title_similarity": "0.6385295"
        },
        {
            "id": "ht38out",
            "score": 1,
            "text": "I always hate when they tell you this is the sound of a quasar (or whatever celestial entity) and it's really some variable being measured that is completely unrelated to sound but then usedv to modulate an audible oscillator. I feel it's solely done for dramatic effect.",
            "title_similarity": "0.73003024"
        },
        {
            "id": "ht4x9ki",
            "score": 1,
            "text": "It's a bit like when an expecting couple go and get an ultrasound scan of their unborn child. It's an \"unreal\" image, but it's an accurate representation of \"what you would see if...\"\n\nhttps://www.fineartnewborns.com/3d-4d-ultrasound/",
            "title_similarity": "0.52302957"
        },
        {
            "id": "hv7tctu",
            "score": 1,
            "text": "Just as with the tiny range of sound frequencies our ears can detect, so too our vets can only detect a fraction of electromagnetic radiation.",
            "title_similarity": "0.42382112"
        },
        {
            "id": "hvg1eaw",
            "score": 2,
            "text": "I teach photography.   My students will photograph a kitchen,  for example,  and want to know why the under counter lights look green in the picture when they are \"really\" white. \n\nBecause they are green.   Your eyes and brain coordinate to \"correct\" the image when you see it. \n\nIn other words,  humans are incapable of seeing the world that actually exists.   Ultraviolet,  microwave,  gamma,  there are all kinds of things flying around that or eyes simply don't register.   Celestial bodies aren't exactly enhanced,  they are just altered so our limited eyesight can see them.",
            "title_similarity": "0.540273"
        }
    ]
}