{
    "ELI5: Why is it that not wearing a seat belt is unsafe and illegal, yet most (U.S.) school buses aren't even equipped with them?\n": [
        {
            "id": "hthhgad",
            "score": 5,
            "text": "This is a weirdo part of safety logic and is similar to why a lot of people don't understand why anyone worries about COVID.\n\nThe truth is we didn't make seat belts law because we're concerned about traffic fatalities or injuries. Or at least, not directly. What really motivated this change was that the injuries and fatalities were:\n\n* Causing numerous businesses to lose employees.\n    * ...often leading to families needing government assistance after losing breadwinners.\n* Costing auto/life/medical insurance companies millions of dollars.\n* Costing cities and states millions of dollars in cleanup costs.\n* Adding a burden to hospitals and ambulance services.\n\nAll of these groups got together and were angry because research showed seat belts could dramatically reduce all of these problems. In summary: we realized that the number of injuries and fatalities we had cost us so much money that we'd rather tell people they had to wear a seat belt than to keep paying other people to clean up their mess. \n\nBut school buses are different. If we separate them from other vehicles, they don't get in accidents much. They don't generally drive at high speeds, and a lot of traffic laws heavily encourage people to drive extra carefully around them. When they do get into accidents, it tends to do more damage to the vehicle that hit them and there are very few injuries (of the children). Every now and then something catastrophic happens, but when you really analyze those accidents it becomes questionable if seat belts would have prevented many injuries.\n\nThat last part's important. Wearing a seat belt PROPERLY is very crucial to yielding benefits. If we put seat belts in a bus but children don't wear them, we won't see a change in our injury or death statistics. If children are wearing them improperly, we might see an *uptick* in injuries. \n\nSo somewhere, at some point in time, someone asked if it was worth the money to equip buses with seat belts. Someone looked at the statistics and decided either that the number of deaths and injuries is more tolerable than the cost, or that when we've studied injury rates seat belts don't make as big of a difference for school buses as they do for other vehicles. \n\nFor comparison, I did some quick searches  for school bus accident statistics and the numbers are something like:\n\n* About 121 people die in \"school transportation related\" accidents per year.\n* 70% of those (about 85/year) are the passengers in the vehicles that hit the school buses.\n* About 20% (24) of those are bicyclists/pedestrians that were hit by the bus itself. \n\nSo by the numbers, installing seat belts in school buses would only be aiming to try to reduce the death of about 12 children per year. We decided there are bigger causes of child mortality we'd rather spend our money on. (Whether or not we're actually spending that money is a different question.)",
            "title_similarity": "0.68213665"
        },
        {
            "id": "htippxu",
            "score": 1,
            "text": "Because teachers/unions don't care enough to implement them. \n\nI live in Australia and am a teacher. Every school bus has them. Every kid wears them and it's not a big deal at all. What these other guys have said about buses being at lower risk of accident is of course true but bad accidents still do happen and while a bus smashing a car might not feel it too much a bus rolling could cause significantly more damage as there is more room to bounce around and more loose baggage. \n\nPeople that argue that it's too hard to make a student wear a seatbelt are just pulling your leg. If a teacher can make entire classes of kids wear masks all day, even during lunch breaks and sport then they can make them wear a seatbelt. \n\nNo seatbelt buses should be illegal, but it takes time and money to change and implement these things and anything that is difficult to change requires someone passionate enough to fight those battles and push it through parliament. Unfortunately people usually only develop that kind of passion once they become a victim of a tragedy, like their child dying in a bus crash when a seatbelt would have saved them.",
            "title_similarity": "0.72662264"
        },
        {
            "id": "htjlhi7",
            "score": 0,
            "text": "Because America sucks. Ask someone who has responded to a bus accident. It rear ended a large truck.  Let me recount the injuries. Several broken necks, dead at scene. One kid seemed unconscious until you rolled him over and found he was in fact sliced longitudinally in half. This kills the child believe it or not. One had the seat in front of him crush his pelvis and genitals. One kid broke an arm, and of course a few chipped teeth, some concussions. Probably even some crying. And a truly huge amount of PTSD. Like ludicrous",
            "title_similarity": "0.6128917"
        },
        {
            "id": "hti5le2",
            "score": -4,
            "text": "Money. As simple as that. Installing 100 seatbelts is expensive. It would be safer as people tend to fly out windows and smash into things, just the same as they do in car crashes. My school bus route used highways as well. \n\nI think the comment saying it's an inconvenience is wrong. I had assigned seats for many of my school busses. If we switched seats it would a disciplinary action.",
            "title_similarity": "0.62258244"
        },
        {
            "id": "htidox1",
            "score": 1,
            "text": "I swear these ELI5 are turning into \"why can't I use common sense/search into the internet before asking why water turns into ice when cooled\"",
            "title_similarity": "0.4708104"
        },
        {
            "id": "hthba6m",
            "score": 9,
            "text": "They dont need them. Busses are massive and not designed with crumple zones. Almost any other car is going to be crushed in an impact and the passengers in the bus will be fine. Watch some crash test footage of a school bus; it's like watching the Rock play red rover with second graders",
            "title_similarity": "0.6699779"
        },
        {
            "id": "hthmf44",
            "score": 2,
            "text": "Could you imagine trying to unbuckle 60 kids hanging upside down with the bus on fire?? And then get them all out safely..",
            "title_similarity": "0.56807065"
        },
        {
            "id": "htisdmp",
            "score": -3,
            "text": "The law isn't there so you can protect yourself.   Its there so that cops have an excuse when they pull you over.",
            "title_similarity": "0.54715645"
        },
        {
            "id": "htjcgaw",
            "score": 0,
            "text": "I actually just asked a superintendent of bus transportation this very question and she said it’s because of the speed with which fire will consume the bus all that diesel fuel.",
            "title_similarity": "0.5528922"
        },
        {
            "id": "htjdgav",
            "score": 0,
            "text": "The only thing that smacks a school bus hard enough is a train.  And then seat belts don’t matter.",
            "title_similarity": "0.635111"
        },
        {
            "id": "htjse3b",
            "score": 0,
            "text": "Because 40 kids are too hard to wrangle in a space as small as a school bus. \n\nThis is the correct answer.",
            "title_similarity": "0.62231266"
        },
        {
            "id": "htjwtqq",
            "score": 0,
            "text": "Buses are safe: brightly colored, special flashing lights, strict rules for other drivers.  AND, kids will use the belts as weapons against each other.",
            "title_similarity": "0.47226924"
        },
        {
            "id": "htk2x6r",
            "score": 0,
            "text": "Because in an emergency it would be really hard to get 30 6-year-olds out of their seatbelts and off the bus",
            "title_similarity": "0.778548"
        },
        {
            "id": "htkx6zq",
            "score": 0,
            "text": "Government makes laws but government doesn't want to spend money to follow those laws so exempts itself.",
            "title_similarity": "0.66228986"
        },
        {
            "id": "htkyxif",
            "score": 0,
            "text": "Money.\n\nSource: Got a ticket for no seat belt in CA by a CHP motorcycle cop. Who’s wearing no seat belt...",
            "title_similarity": "0.67212856"
        },
        {
            "id": "htl4v6e",
            "score": 0,
            "text": "It's 1000 percent to be able to pull you over. Motorcycle riders can wear no helmet. Back in the day seatbelt laws were secondary laws. Most states switched to primary law so they can have a reason to pull you over. It has nothing to do with our wellbeing.",
            "title_similarity": "0.64094514"
        },
        {
            "id": "htl6uki",
            "score": 0,
            "text": "Because busses usually operate under government rule and they don’t follow their own rules because it would cost them too much of your money out of their pocket.",
            "title_similarity": "0.71829796"
        },
        {
            "id": "htl6zkm",
            "score": 0,
            "text": "For the same reason you don't wear a life vest when taking a bath. sure you could still drown but it's very hard and requires extraordinary circumstances.",
            "title_similarity": "0.7026851"
        },
        {
            "id": "htlxsr0",
            "score": 0,
            "text": "U crash a civic it goes smush. U crash a bus it goes “Dumph” and probably just sits there confus.",
            "title_similarity": "0.5806492"
        },
        {
            "id": "htmaad7",
            "score": 0,
            "text": "Cuz it's really less about safety and more about revenue generating and reasons for contact for the police",
            "title_similarity": "0.5006131"
        },
        {
            "id": "htmch55",
            "score": 0,
            "text": "I went through bus driver training and we had to watch a real video of a bus catching on fire and the driver getting all the kids out of the bus. Seat belts would make it almost impossible for one adult to get 60 kids off the bus in time.",
            "title_similarity": "0.6262347"
        },
        {
            "id": "hthy3uf",
            "score": -1,
            "text": "Seems like no one put here real reason.        Seatbelt protects you from hitting airbag and broke your ribs. Cars without airbags often goes without seatbelt (hello 70-s and some modern semi's). Airbag protect you from breaking your neck, since in case of emergency your body stopping while neck and head not tied and continue to moves forward.         \nIt is 2 devices that do not goes separately in civil cars, and there is no point of standalone of each. \n         \n Second thing comes from statistic and weight of school bus. If it would be bad, people will make airbags + seatbelts in school buses and hire (or make driver check) someone to check for fastening, later be subdued with electronics (like todays alarms on untied belt).",
            "title_similarity": "0.77616954"
        },
        {
            "id": "htikh53",
            "score": -1,
            "text": "Also motorcycles.  Seat belt laws have more to do with collecting tickets than your safety.",
            "title_similarity": "0.5527347"
        },
        {
            "id": "htirndi",
            "score": -1,
            "text": "The government doesn’t actually care about your safety…seat belt laws are for writing tickets and generating revenue for corrupt politicians.",
            "title_similarity": "0.63023174"
        },
        {
            "id": "htkyi5e",
            "score": -1,
            "text": "Because seat belts on school buses is socialism! The metal bar at tooth-level will suffice just fine.",
            "title_similarity": "0.46210718"
        },
        {
            "id": "htlw9mn",
            "score": 1,
            "text": "It costs more money to fix than it costs to just give money to families when their kid dies",
            "title_similarity": "0.45287868"
        },
        {
            "id": "htlgryz",
            "score": -2,
            "text": "As long as a kid can ride on the back of a motorcycle I surely don't need to be made to wear a seat belt. That is one stupid law. Just a money grab and reasonable cause for a stop.",
            "title_similarity": "0.58135265"
        },
        {
            "id": "hthbbxx",
            "score": 41,
            "text": "Because they are massive.  If a bus gets hit by a car (which is most likely) the crash forces are spread out over an object of much larger mass (the bus) so each individual is going to feel less of an impact.  The kids just aren't going to move around in a bus accident like they would in a car accident.\n\nThat said, many new modern school busses _do_ have seatbelts.  It would just be cost-prohibitive to go back and retrofit all of the busses, so most laws mandate them for busses going forward.",
            "title_similarity": "0.7442356"
        },
        {
            "id": "hthtto5",
            "score": -3,
            "text": "because they cant give an entire bus full of kids  tickets. that law was only passed to produce revenue..it clearly shows that lawmakers dont give af about you or your kids,they just want your $.",
            "title_similarity": "0.77285546"
        },
        {
            "id": "htinnji",
            "score": -2,
            "text": "The government would rather spend money on more drones and F-35, then update their equipment and facilities to make your children safe. All other reasons are nonsense. \n\nEdit: typo",
            "title_similarity": "0.55025965"
        },
        {
            "id": "htiroet",
            "score": 1,
            "text": "It matters more to your citizens to pay less in tax than to save a child's life.  Your DOT places the value of a child's life at 9.2 Million.  the cost to retrofit seatbelts into a schoolbus is about 70K per vehicle.   That feels like a no-brainer - even a single fatality would cost more to settle   \na lawsuit, but it's not done... Here in the UK, we have a lower calculated value of a kid's life (around 2.4Million GBP), but we have seatbelts in all buses which carry school children.",
            "title_similarity": "0.67004997"
        },
        {
            "id": "hthdyia",
            "score": 31,
            "text": "This is actually an interesting story. There was a study done by Transport Canada in 1984 about seatbelts in school buses. It found that seat belts didn't prevent injuries in bus collisions, and suggested that they could even *cause* injuries in some circumstances.\n\nHOWEVER, there have been numerous criticisms of this study over the years. The study only looked at head-on collisions, not t-bone collisions or rollovers. The study only looked at lap belts, not shoulder belts. And there were apparently some issues with the crash test dummies not being properly monitored for injuries.\n\nSome more conspiracy-minded people have suggested that this study became widely cited because bus manufacturers and school bus operators didn't want to deal with the expense of installing seatbelts in school buses. Regardless, there has been mounting evidence for many years that school buses would probably be a lot safer with seat belts.\n\nhttps://www.cbc.ca/news/canada/school-bus-seatbelts-1.4826500",
            "title_similarity": "0.7758107"
        },
        {
            "id": "hti46za",
            "score": 28,
            "text": "1. The bus seats are designed to compartmentalize passengers during a front or rear end crash, which are statistically the most common form of crash. They do this with the design of the seats - inside the seat frame of the upright portion is a thin sheet of metal that is tack-welded to the seat frame. It provides support for seating, but is designed to break away during a crash, which absorbs the impact force of a human body and GREATLY reduces the instance of serious injury.\n2. The body of the bus sits up high enough to prevent direct impact in a side-collision from MOST other vehicles on the road, except for large trucks and similar vehicles. Since the vast majority of vehicles on the road are passengers vehicles whose bumpers would strike BELOW the floor of the passenger compartment in the bus, the only risk to bus passengers in a side-on collision with a passenger vehicle is from inertial forces, which are already going to be minimal due to the weight differences between a passenger vehicle and the bus. Think about every bus crash you've ever heard about on the national news involving serious injury or fatalities - they are almost, if not entirely, between a large truck/train and the bus, and rarely if ever a passenger vehicle. Yet, passenger vehicle/bus collisions are FAR AND AWAY more common.\n3. It can cost between $7,000 and $10,000 to add seat belts to a single school bus, which is already a \\~$100,000+ vehicle. To put belts on just 10 buses would cost around $100,000, and most large school districts have anywhere from 30-40 busses. Even if the funding were available, it is hard to justify based on the statistics...\n4. According to the NHTSA, [students are 70 TIMES more likely to arrive to school safely](https://www.nhtsa.gov/road-safety/school-bus-safety) when on a school bus than when riding in a small passenger vehicle.\n5. A single bus fire has, historically, been able to claim the lives of more children at once than died across ALL bus crashes in a given year.[In 1988, 24 school aged kids died in a fire resulting from a collision.](https://en.wikipedia.org/wiki/Carrollton_bus_collision) That's almost 4x the average number of student passengers who die in non-fire related bus accidents in an entire year. Remember, though fire may take time to spread, fire isn't the main concern as far as speed - it's the SMOKE. The smoke will fill the bus in seconds, suffocating and blinding all on board. Can you imagine trying to help small children unbuckle their belts when you can't see or breathe? \n6. The reason this is not a settled debate over the last 6 decades of automotive transportation is because the risk factor of death or serious injury in the normal course of student bussing simply does not justify the added cost or risk of installing seat belts. We weigh the risk to convenience ratio of everything in life. We could lower speed limits on ALL roads to 25mph and save \\~10,000 lives per year, but we will never do that because we have places to be and don't want to spend all day driving there.\n7. There are an estimated [10 billion student rides annually](https://tinyurl.com/j7dxbh9m) in the US alone. There are an [average of 131 school bus crash related fatalities](https://www.nhtsa.gov/sites/nhtsa.gov/files/documents/2015_school-transportation-related_crashes_traffic_safety_fact_sheet.pdf) per year.  Out of those, an average of 5 were passengers ON the bus - the majority were hit by the bus, another vehicle while boarding/exiting the bus, or in another vehicle. What percentage is 5 out of 10 billion?\n\nLong story short, the reason we don't mandate belts on school buses is because the statistics don't support the necessity.",
            "title_similarity": "0.50962996"
        },
        {
            "id": "hthd9g2",
            "score": 59,
            "text": "Seatbelts protect you in the event of a sudden change in speed (like going from \"driving\" to \"stopped\" in a split second when your car smashes into something).\n\nBuses are *so massive* that this simply isn't as much of an issue - if a bus hits something, it's not going to instantly go from \"driving\" to \"crashed\", it's *just going to keep going*.  This means the people in the bus will experience much, much less force.",
            "title_similarity": "0.5759945"
        },
        {
            "id": "htheaqo",
            "score": 5,
            "text": "\\>Why is it that not wearing a seat belt is unsafe and illegal, \n\nThis is true for cars.  Cars are light, and you often drive them at high speed and are close to the ground\n\nSchool busesare heavy and most of them travel at low speed in cities. You sit quite high. So if a car hit them the difference in mass will result in not a lot of motion in the bust and the car tends to go below the bus and it looks something like https://s.hdnux.com/photos/01/20/31/31/21075530/3/rawImage.jpg\n\nThe speed is often low and that has a huge impact on the injuries in any vehicle. So the difference in size and where the passes result in that it is quite safe even if there is an accident.\n\nYou can look at statistics for accidents like that on \nhttps://injuryfacts.nsc.org/motor-vehicle/road-users/school-bus/\n\nIt is not just school busses but busses in general that tend not to have seatbelts. In newer busses designed for longer distance travel on highways you will see seatbelts but seldom for use in a city where the speed than to be a lot lower.",
            "title_similarity": "0.6435907"
        },
        {
            "id": "htim1ti",
            "score": 6,
            "text": "This is a US school bus issue.\n\nI. Europe, or at least Scandinavia, busses and school busses have belts and you're supposed to use them. With the possibility of a fine (for the driver i think). \n\nAnd while someone used an example of the bus being hit by a car, and they felt nothing. They're they're for then the bus drives off the road, he a hit by another busnor truck, storms, or whatever.",
            "title_similarity": "0.6764705"
        },
        {
            "id": "hthplft",
            "score": 42,
            "text": "I can speak on that, simply because I was on a committee involving school bus safety about 20 years ago.\n\nSchool buses, with their high backs and small space between rows, have what is called, compartmentalization.  Unless a bus is hit by a tractor trailer, dump truck or train (or other massive vehicle), the kiddies are usually safe(r).  It has been shown (I have no stats for this) that kids are safer without seat belts in school buses, though some school buses still mandate seat belts.\n\nThat's all I've got.",
            "title_similarity": "0.6740558"
        },
        {
            "id": "hthmtdd",
            "score": 91,
            "text": "[removed]",
            "title_similarity": "0.21365257"
        },
        {
            "id": "hthcfkj",
            "score": 448,
            "text": "A few reasons.\n\nFirst off (this is the most important btw) the point of a seatbelt is to stop you from flying out of your car in an accident because of the massive deceleration a car will experience. A huge school bus isn't going to experience that unless they run directly into a wall, and even that depends on the wall. It will just plow through and crush whatever it hits. In addition instead of like...a windshield like a car in a school bus you will go flying into the padded seat in front of you.\n\nSecondly there just the pragmatic argument, it would be really difficult to get some 50 kids to wear their seatbelts and considering how long school buses are in service you can bet kids will just end up cutting them eventually anyway.\n\nThirdly, school buses are in accidents in the first play soooo much less often than regular cars. Like if you drive a normal car you are basically guaranteed to end up in an accident of some kind in your life (I basically get rear ended once per winter). School bus drivers easily go their entire career spanning decades without getting into an accident. So seatbelts are just less needed because of that too.",
            "title_similarity": "0.66736734"
        },
        {
            "id": "hthj48t",
            "score": 13,
            "text": "I'm a bus driver! a lot of people are pointing out that the size of the bus compared to a personal vehicle plays a major role in the transfer of momentum, which is absolutely correct. it also has to do with the placement of the seats themselves. they're much higher than what a car can normally reach; if you were t-boned it wouldn't have the same leverage (I think that's the right phrasing? im not great with words). the seats are also close together and padded- that shitty leathery seat is meant to protect against blunt force trauma, but as others have pointed out, the smaller vehicle takes the brunt of the damage. seatbelts are only used for students on the special ed busses, as well as preschoolers, who get a carseat",
            "title_similarity": "0.57807606"
        },
        {
            "id": "hthp0ks",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.21365257"
        },
        {
            "id": "hthnlay",
            "score": 68,
            "text": "Oh that's actually a really good question. \n\nFirst of all the purpose of a seat belt in a car is to hold you in place in the event that the car is thrown, spinning or something violent and quick. The seat belt also prevents you from hitting the dashboard when the car stops suddenly. \n\nNow school buses aren't cars, They have completely different structures than most automobiles. \n\nImagine a school bus, remember how you had to walk upstairs to get into it? \n\nThat's because the deck of the school bus is much higher above the street than the average automobile. This is critically important to safety. \n\nIf another vehicle hits a school bus, The majority of the force goes directly into the deck. This combined with the fact that the school bus is massive and heavy, means that It's very rare that the school bus will be jerked or thrown. \n\nIn the event that the school bus stops suddenly, The tiny little compartments that the seats create are designed to absorb impact.\n\nIt sounds pretty brutal but the engineers know what they're doing, The United States moves hundreds of millions of children with school buses, And they have very few fatalities.",
            "title_similarity": "0.652109"
        },
        {
            "id": "hthctts",
            "score": 5767,
            "text": "When it comes to implementing safety policy, there's always a balance between what's optimal for safety vs. what's practical to enforce. Race cars use a 6-point harness that keeps the drivers safe even at collision speeds of 300+ kph, but they are so restrictive that another person is required to fasten the driver in. It's unlikely that the general public would adopt such a device, despite it being the safest option, and so mandating them would be ineffective (and probably overkill).\n\nSchool busses are huge both in size and mass and, generally speaking, travel at low speeds in residential areas. If a bus were to collide with an average passenger vehicle, the momentum transfer would largely be imparted on the passenger vehicle due to the mass differential between the two, meaning the bus will decelerate less violently than the passenger vehicle would. This, in combination with the large seat in front of the students, means that a seatbelt is not necessary to keep the kids in their seats during a collision (provided that the bus doesn't roll over or isn't travelling at statistically rare speeds). Trying to enforce a bus full of children to wear their seatbelt when it's largely not necessary is the motivation for not requiring them.\n\nEdit: A few people have pointed out that in the event the bus needs to be evacuated quickly, kids being trapped in seatbelts is sub-optimal for safety. I hadn't thought of that when I wrote this out.",
            "title_similarity": "0.6692134"
        },
        {
            "id": "hths37b",
            "score": 10897,
            "text": "School busses are designed in a compartmentalized fashion, that is the seats are close together with high backs, which keeps passengers relatively restrained in a crash, even without seatbelts. The NHTSA has spent a fortune studying this, and has found that adding seatbelts doesn't increase the safety of school busses enough to warrant a full refurbishment or re-design of busses.\n\nSchool busses also have a much lower center of gravity, so in a crash with a normal vehicle, the passengers are much higher up, and less likely to be affected by any damage. Of course, this doesn't take into account rollovers of busses, which is thankfully pretty rare, also because of the design.\n\nYou also have to take into account to the young age of children who are on the bus. Enforcing the seatbelts would be impractical, but even worse, many younger children may struggle to get themselves out of the belt in the rare event of a serious crash, meaning they are unable to escape through an emergency exit without additional help.\n\nThere is only an average of 6-10 deaths of school children in school busses each year, and while that's tragic, it would be impossible to get that number to 0, even with seat belts. Statistically, school busses are 70% safer than a car in terms of getting your child to/from school, and full-size busses are literally the safest vehicles on the road.\n\nIt should be mentioned that smaller busses do have, and are supposed to require, seatbelt use in most places in the US.",
            "title_similarity": "0.6616631"
        },
        {
            "id": "hthhe57",
            "score": 2,
            "text": "Another point I'd like to make is that in many places the penalties for causing an accident with a school bus are exorbitantly massive and as a result most drivers have enough sense to stay the hell away from them when on the road",
            "title_similarity": "0.6976805"
        },
        {
            "id": "hthkeh9",
            "score": 1,
            "text": "Due to buses size/mass, height, and other safety features like high, padded seats they aren't as necessary and the practicality of having to stop and check/assist 50 kids with belts on and off a bus would require so much additional time/resources",
            "title_similarity": "0.69015163"
        },
        {
            "id": "hthlqv7",
            "score": 1,
            "text": "Buses would need to have a monitor to make sure every kid is buckled, stays buckled in and doesn't start swinging the seat belt around hitting the student next to them.\n\nNewer buses were suppose to by law come with seatblets 2018 and up I think. I'm not sure where that went however. I know rural districts were having a problem with that due to having to pay a monitor as well as the driver.",
            "title_similarity": "0.68400526"
        },
        {
            "id": "hthmnl6",
            "score": 3,
            "text": "I drive city buses that have no seat belts for passengers.  Even we drivers only have a lap belt.    When the bus is full, 3/4 of the passengers are standing up.  \n\nSome bus lines in our city regularly drive on the highway, at 100 km/h . \n\nLet that sink in.",
            "title_similarity": "0.5719917"
        },
        {
            "id": "hthnf2a",
            "score": 3,
            "text": "Aside from the physics that others have pointed out, we need to understand that busses are built with child safety in mind. From the padding in the seat back in front of you, to the angle of the seats to how the body is mounted to the frame... it's all taken into account. The bus body mount is very important. Instead of being bolted to the steel frame, they're clamped. In case of an accident, the body will slide on the frame rail which expends a lot of energy.",
            "title_similarity": "0.52845293"
        },
        {
            "id": "htho2wj",
            "score": 2,
            "text": "I was just looking in to RV seatbelt laws and had similar questions. In a lot of states, only the front seat folks and usually children have to be in seatbelts. So in a lot of places you could be going down the interstate at 75 mph taking a shower, cooking dinner, doing aerobics, etc. Seems so unsafe.",
            "title_similarity": "0.6863249"
        },
        {
            "id": "hthtktn",
            "score": 5,
            "text": "A car weighs relatively little and travels at high speeds.  An impact results in significant kinetic energy going into the driver.\n\nA school bus is heavy, tends to go slow, and is very sturdy.  An impact will be converted to far less kinetic input on a rider than a one seater vehicle.\n\nFurther, a schoolbus is most likely to be rolled over in which case you want children spending less time trying to get out of locked seat belts and more time actually getting out of the vehicle.",
            "title_similarity": "0.6311136"
        },
        {
            "id": "hthypt8",
            "score": 1,
            "text": "The size of the bus protects the passengers. It’s driven by a professional and is bright yellow. There are also laws that protect buses and culturally we are more careful when we drive near school buses. They also rarely travel far distances and have predictable routes and barely use highways.",
            "title_similarity": "0.5473365"
        },
        {
            "id": "hthz2ff",
            "score": 1,
            "text": "Some of the school busses I’ve been in have had lap belts, then normal yellow kind of busses even",
            "title_similarity": "0.4980968"
        },
        {
            "id": "hti1fx9",
            "score": 2,
            "text": "When you add together:\n\n1. How unlikely a large bus is to flip in an accident (compared to how likely it is for a car)\n2. How much ability small children have to take their own seatbelts off in the event of a fire or bus going into water (much less ability than adults, and at most 1 adult available to help the whole busload of kids)\n\nyou save more lives overall by not having the small kids in seatbelts. If a bus hits a single car, the bus doesn't slam its passengers around like what happens to car passengers, because the bus is 10x heavier than what it's hitting.  Small kids are more likely to get stuck in their seatbelt and burn/drown than the odds of a truck-on-bus accident where a seatbelt would even possibly help.",
            "title_similarity": "0.70546937"
        },
        {
            "id": "hti26yk",
            "score": 1,
            "text": "Just to add to some of these great answers, the caveat is school buses for smaller kids.  My 3 year old rides a bus and she gets put in a 5-point harness.",
            "title_similarity": "0.45199588"
        },
        {
            "id": "hti28du",
            "score": 1,
            "text": "I was once on a bus that crashed at high speed. It went 50mph into the side of a car that pulled out directly across its path. The drunk driver was somehow unharmed but the car was completely destroyed.\n\nAnyway, back to the question. The collision sounded like a bomb going off but we felt nothing on the bus. Like, absolutely nothing. Didn’t even flinch in our seats and we’d hit a stationary object at 50mph. The bus was hardly even marked and the car looked like it had fallen off a cliff.\n\nTurns out a large object hitting a much smaller one doesn’t affect the large one that much.",
            "title_similarity": "0.6520734"
        },
        {
            "id": "hti2c0v",
            "score": 1,
            "text": "There were seatbelts on at least one school bus I was in as a kid.  They were consistently used as weapons to hurt girls, smaller children, and some teachers.",
            "title_similarity": "0.5629481"
        },
        {
            "id": "hti2u7z",
            "score": 1,
            "text": "The \"compartmental\" seating in a school bus is often compared to an egg carton. This design concept provides a “protective envelope” around students by placing strong, high energy-absorbing, padded seats close together, according to the National Highway Traffic Safety Administration. Not to mention that several school buses in the past that experimented with safety belts found that students rarely buckled up, but they did use the heavy belt-ends as weapons to smack their seatmates in the face.",
            "title_similarity": "0.6427494"
        },
        {
            "id": "hti2yts",
            "score": 1,
            "text": "The school buses in our twin do have seat belts. According to my daughter, no one uses them. It's un cool to use them.",
            "title_similarity": "0.7155516"
        },
        {
            "id": "hti32wm",
            "score": 1,
            "text": "The biggest one is the driver. In a car accident, the driver wearing a seatbelt will hold them in their seat and they can maintain some control of the vehicle and maybe avoid running over that group of kids on the sidewalk. Someone thrown from their seat has no chance of control at all. I believe that bus drivers are required to wear seatbelts but not 100% sure.",
            "title_similarity": "0.6993482"
        },
        {
            "id": "hti3ptt",
            "score": 3,
            "text": "I used to work at Facebook and rode their shuttle buses. Around 2018 there was a new CA law requiring seatbelts to be worn on the buses (they were already installed, but not required). The bus driver would make an announcement asking everyone to put them on, saying the rider (not the driver) could be ticketed by CHP.\n\n[https://www.capitolcorridor.org/whats-new/bus-passengers-required-to-wear-seatbelts/](https://www.capitolcorridor.org/whats-new/bus-passengers-required-to-wear-seatbelts/)",
            "title_similarity": "0.5903164"
        },
        {
            "id": "hti426a",
            "score": 1,
            "text": "I find it very strange you single out US school buses. Have you never taken or seen public transportation?",
            "title_similarity": "0.8151393"
        },
        {
            "id": "hti4hpr",
            "score": 2,
            "text": "They a aren't? We had seatbelts by the late 80s. Nobody used them though",
            "title_similarity": "0.5847813"
        },
        {
            "id": "hti6jv3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.21365257"
        },
        {
            "id": "hti9ld8",
            "score": 5,
            "text": "I enjoy learning but sometimes I scroll through looking for an answer that an actual child would understand, I rarely see it",
            "title_similarity": "0.36409768"
        },
        {
            "id": "htiamt6",
            "score": 1,
            "text": "I think it has something to do with extrication of kids in case of an accident.  We used to have a guy in Plymouth MA on local cable whose mission was to put seatbelts on school buses.  He was also bat shit crazy.  Once he came to the (alt) school I worked at b/c he had somehow come up with the notion that we had cameras in the bathrooms and ranted about it for a couple of weeks until the cool, sandal-wearing principal simply invited him to come and check it out for himself.",
            "title_similarity": "0.5780908"
        },
        {
            "id": "htibcav",
            "score": 1,
            "text": "I don’t know the official stance but I always insist that people in cars need to wear seatbelts because it improves the drivers ability to maintain control of their private vehicle on a public roads. Let’s say the driver has to break hard to avoid a crash but then slams their head on the steering wheel, they could lose control of their own vehicle and end up hurting someone (hitting another car, going off the road while dizzy or unconscious etc).\n\nAlso why everyone on motorcycles should wear a helmet. Let’s say a rock or gravel kicks up and blinds you, you lose control of your vehicle on a public road.\n\nAll this to say, drivers of busses do wear a seatbelt, someone else already answered for the rest I think.",
            "title_similarity": "0.5802257"
        },
        {
            "id": "htida3f",
            "score": 1,
            "text": "There many reasons. So I will just add one that I didn't see, school busses are driven by professionals while normal cars generally are not. That's also one of the reasons why you rarely see school buses in accidents.",
            "title_similarity": "0.7151029"
        },
        {
            "id": "htidbnz",
            "score": 1,
            "text": "I was on a city transit bus when it was rear-ended, and all we felt was a light lurch forward, and the bus went back to a resting position.",
            "title_similarity": "0.47334042"
        },
        {
            "id": "htidnyx",
            "score": 1,
            "text": "If there where to be a fire or other emergency like that it would take to long to evacuate the busses by cutting all the seat belts that’s why the bus seats are high enough and filled with soft padding",
            "title_similarity": "0.61395353"
        },
        {
            "id": "htig0dz",
            "score": 1,
            "text": "Busses are large, obvious, and generally move slower than other vehicles, so they are in fewer accidents and those they are in are less fatal.  Plus with all the seats there's padding in front of and behind people sitting in the seats.  Ultimately it's a matter of cost vs benefit - it would be very expensive to retrofit all schoolbuses with seatbelts, and the gain in safety would be relatively small.",
            "title_similarity": "0.58786166"
        },
        {
            "id": "htihbnw",
            "score": 1,
            "text": "*(If I were actually explaining this to a 5 year old, I'd explain it differently - kiddos have a harder time with abstraction and careful discrimination, this would put the wrong idea into their heads)*\n\nMost rules aren't true all of the time - \"not wearing a seat belt is unsafe and illegal\" is a good one. Is it unsafe to not wear a seat belt in a parked car in your driveway? Of course not!\n\nIn a *car* you should wear a seat belt - most of the time you don't need it, but in the 1/10000 chance that you do, it will save your life. It's not hard to wear one, so it's worth doing anyways just in case.\n\nThe times where you'd need one are when the car suddenly stops going very fast, like if you hit another car or a tree or something. The car will stop moving, and you need a seat belt to stop *you* from moving too - otherwise you fly forward and bang your head against broken glass, ouch!\n\nA bus usually never gets fast enough to have that problem - and when a bus hits something, it's so big and heavy that it usually takes longer to slow down than a car would, so you get pushed forward less.\n\nYou're also not flying forward into glass on a bus, you're flying forward into the next rows of padded seats - the only person that isn't true for is the bus driver, and you'll see that they ARE wearing a seat belt!",
            "title_similarity": "0.7848389"
        },
        {
            "id": "htiiase",
            "score": 4,
            "text": "In my country all buses (build after 2004) need ti have seatbelts on all seats . And all people over 3 years need to use the seatbelt, its the law. Otherwise you might get fined.",
            "title_similarity": "0.55971277"
        },
        {
            "id": "htiie80",
            "score": 2,
            "text": "And why don't the seats face backwards? In most hard crashes, it's the bus hitting something. I'd rather be thrown back into my seat than forward. Only the driver needs to be paying attention to the road anyway.",
            "title_similarity": "0.640224"
        },
        {
            "id": "htijnlp",
            "score": 1,
            "text": "Loaded question slightly...the back seat in school buses (from my observation years ago) has a seatbelt.",
            "title_similarity": "0.5374105"
        },
        {
            "id": "htijsur",
            "score": 1,
            "text": "School buses don't have seatbelts for the exclusive reason of \"Kids will beat each other with them\"",
            "title_similarity": "0.86274517"
        },
        {
            "id": "htijtat",
            "score": 3,
            "text": "I’d like to point out that some places in the US do require seat belts on school buses. When I rode the school bus growing up, we were required to use them.",
            "title_similarity": "0.58559376"
        },
        {
            "id": "htikucl",
            "score": 1,
            "text": "I’ve always wondered that myself.\n\nOn a slightly random, but related note, I was flipping the channels the other night and an episode of that new show American Auto was on. A group from the head office was visiting one of their plants in a small town and they were being driven around in a mini-bus, one of those ones that shuttle people around between airport terminals - you know the kind - and it was kind of funny because they were all wearing seatbelts. I’ve never seen seatbelts in those kinds of buses before. Maybe it’s a new thing. I support it, but it was just strange to see. They were pretty heavy duty belts too. They’d definitely survive a crash if it happened.",
            "title_similarity": "0.57553005"
        },
        {
            "id": "htikzls",
            "score": 1,
            "text": "What I want to know is why are motorcycles allowed?  I understand that wearing a seatbelt is more dangerous than no seatbelt for motorcycles, but a motorcycle with no seatbelt is more dangerous than being in a car with no seatbelt right?",
            "title_similarity": "0.6984129"
        },
        {
            "id": "htilu7w",
            "score": 2,
            "text": "Let’s say the fully loaded school bus (50ish kids) is in an accident. Let’s say the crash causes a fire. Those 50 kids being strapped in is suddenly a big fucking problem.",
            "title_similarity": "0.6059858"
        },
        {
            "id": "htilyca",
            "score": 1,
            "text": "Most buses don't have seatbelts in Europe either. Newer ones do, but nobody really uses them and nobody enforces it - besides the front row.\n\nThe explanation for this is simple, a bus is at least an 8-9t and above. It's very heavy, and heavy means it has a lot of inertia. 99% of things you may hit or that may hit you will be demolished with little damage to the bus and passengers alike. I have spent a considerable amount of time in buses in my life, and have experienced a few shunts and accidents, and you just feel a nudge. You aren't violently dashed forward, just a nudge. As such, it's widely regarded that a bus is generally fairly safe even without seatbelts.",
            "title_similarity": "0.7880781"
        },
        {
            "id": "htilzco",
            "score": 1,
            "text": "Kinda related... Nebraska band bus accident 2001. very sad story that devastated everyone from my hometown. Just makes you think about the fragility of life.",
            "title_similarity": "0.6108846"
        },
        {
            "id": "htimg9b",
            "score": 1,
            "text": "School buses are kinda overbuilt as well. Lots of interior ribbing make the bodies very strong for a vehicle that size. But the reason I’ve always heard was the “egg carton theory…” that is, each seat is kinda like it’s own, slightly padded compartment., just like a carton of eggs.  When you take into consideration all the other posts here about slower deceleration rates if in an accident with a soccer mom’s minivan, even without seatbelts  the kids in each little compartment don’t have far to bounce.",
            "title_similarity": "0.63009775"
        },
        {
            "id": "htimije",
            "score": 1,
            "text": "Also wanted to point out that the general mandatory seat belt laws are only applicable to people in the front seats. In some states wearing a seatbelt is optional in the rear seats, maybe it is better to say it is not mandatory to wear in the rear seats. In Michigan wearing a seat belt in the rear seats is not mandatory for anyone over 16.",
            "title_similarity": "0.67472005"
        },
        {
            "id": "htimjhn",
            "score": 1,
            "text": "It is illegal to not wear a seat belt in a car in the United States because it is unsafe. A seat belt keeps you in your seat in a car in the event of a collision, which reduces the likelihood of you being seriously injured. School buses are not usually equipped with seat belts because students are not usually in danger of being seriously injured in the event of a collision. The bus will usually stop very quickly if there is a problem, and the students are typically seated towards the rear of the bus where they are less likely to be injured.",
            "title_similarity": "0.75150037"
        },
        {
            "id": "htin6um",
            "score": 1,
            "text": "California, New York, Texas, Florida, New Jersey and Nevada all have laws requiring school buses have seat belts. That's not quite half the population of the US, but it's close. So quite.a few people do think school buses need seat belts.",
            "title_similarity": "0.6850456"
        },
        {
            "id": "htiqnpc",
            "score": 3,
            "text": "Guess it's a US thing. All buses have seatbelts here in Spain (all made since 2007 I think, so pretty much all that are still around). But it really isn't that important because like other people here mentioned already, buses are very safe, so seatbelts rarely help. Hell, buses are so safe they are comparable to aircraft in fatalities per passenger-km.",
            "title_similarity": "0.5722995"
        },
        {
            "id": "htis1lk",
            "score": 1,
            "text": "FWIW after my school had a school bus rip over, the school started only renting school buses with seatbelts.",
            "title_similarity": "0.683436"
        },
        {
            "id": "htitgz7",
            "score": 1,
            "text": "Something about the weight of the bus, we had this issue come up in a preschool program with parents, who had jobs in county as prosecutors.  unhappy that their child would not have a seatbelt",
            "title_similarity": "0.68871397"
        },
        {
            "id": "htitur1",
            "score": 1,
            "text": "Sometimes quickly escaping the aftermath of the collision is more important that protecting against the impact of the collision.",
            "title_similarity": "0.35943934"
        },
        {
            "id": "htiu7ls",
            "score": 1,
            "text": "Did you know that they actually do have them they’re just tucked into the seat where you can’t see them ?",
            "title_similarity": "0.32088006"
        },
        {
            "id": "htiuc6k",
            "score": 1,
            "text": "The design of a school bus is such the backs of the seats and it’s height helps protect students. Unfortunately, there have been several bad accidents where students were killed and this has led to legislation requiring buses made past 2010 to have seatbelts. Drivers literally have to say to students,” make sure you put your belt on.” When they get in the bus or else they can be found liable in the event of an accident. I don’t even what to think about trying to evacuate 40-70 kids wearing seatbelts or what would happen when Joey realizes the thumper bar holding the belts to the seats makes a nice bat.",
            "title_similarity": "0.7078429"
        },
        {
            "id": "htiuljv",
            "score": 1,
            "text": "Hijacking some of the more long winded comments for a hopefully simple answer: busses usually move really slow, so that removes a lot of the danger in an actual accident. It’s not moving fast enough to cause damage, like whiplash. In that case, the danger is from other cars. But busses are so big and the color easy to notice that even fast moving cars don’t typically get into accidents with them!",
            "title_similarity": "0.5831531"
        },
        {
            "id": "htiun40",
            "score": 1,
            "text": "School buses are build like tank. Don't break test or fuck with a school bus. In my state, bus drivers have to prioritize their passengers. This means they will ram before swerving off the road. Most passenger vehicles will not win that battle.",
            "title_similarity": "0.7750158"
        },
        {
            "id": "htiuyb8",
            "score": 1,
            "text": "I would like to mention that in many places it is *not* illegal for certain occupations to forgo seat belts. Where I live mail carriers, delivery drivers in commercial vehicles, taxicab drivers (real taxis, not ride share), and cops are all exempt from the seat belt rule for various reasons. Also there are no seat belts on the regular bus everyone uses, and you aren't even required to sit down.",
            "title_similarity": "0.7777754"
        },
        {
            "id": "htivnyn",
            "score": 1,
            "text": "Typally ony those in the front row are legally required to wear a seatbelt.  So there’s the loophole, only the bus driver is in the front row.",
            "title_similarity": "0.64456415"
        },
        {
            "id": "htiwomu",
            "score": 1,
            "text": "pretty sure they do. when i was a toddler, which was many years ago, they had seat belts. doesn't mean we wore them, though lol",
            "title_similarity": "0.47214195"
        },
        {
            "id": "htix0bg",
            "score": 1,
            "text": "For what it's worth my school district did put seat belts in school busses.\n\nKids beat the hell out of eachother with them, cut them, or otherwise sabotaged them (Cramming food into the buckles, etc).  It was impossible to keep up with the maintenance and injuries.",
            "title_similarity": "0.7432445"
        },
        {
            "id": "htixd6v",
            "score": 1,
            "text": "A bus driver explained to me that one of the reasons is that if there is ever a fire on the bus that he doesn't want to be in the position where he has to pick which children he has to help unbuckle if the children are very small and can't undo it themselves.",
            "title_similarity": "0.6767671"
        },
        {
            "id": "htixeqg",
            "score": 2,
            "text": "While we’re on this subject, why do school buses stop at railroad tracks to check the train traffic whereas cars can simply run through the railroad intersections?",
            "title_similarity": "0.5762458"
        },
        {
            "id": "htiydld",
            "score": 1,
            "text": "School bus is usually only travel on side roads and even if they’re on the highway there are 55 or less on like in real vehicles the seats that are directly in front of them are padded so if an impact way to occur it’s definitely let’s just use the word softer than a traditional vehicle.  The other problem which is most likely the real reason is how are you going to enforce it to the bus driver can’t exactly stop every five minutes to force a kid to put it on it’s easier to have them get on and off without a seatbelt.",
            "title_similarity": "0.72346485"
        },
        {
            "id": "htiz9tv",
            "score": 2,
            "text": "I posed this question to a co-worker whose husband ran the local school bus company. Her reply as to why school buses don’t have seatbelts was “because the little suckers would cut them off.” Prob more true than all the other responses;)",
            "title_similarity": "0.68831515"
        },
        {
            "id": "htizkz7",
            "score": 1,
            "text": "In MN it boils down to the height of the seats, the seat backs were made higher to keep kids “safer” and less likely to bounce around in an accident. Thats how it was explained to me in a class for a transportation certification.",
            "title_similarity": "0.4460995"
        },
        {
            "id": "htj08dd",
            "score": 3,
            "text": "As someone who hit the ceiling and landed in the next seat when the bus hit a huge pothole, I can assure you that you don’t need to be in an accident for seatbelts to help.",
            "title_similarity": "0.54959476"
        },
        {
            "id": "htj0jl1",
            "score": 1,
            "text": "To add to all the other excellent points, as a former school bus driver who had one of the new, fancy, seatbelt equipped buses, it was the biggest pain in the ass to enforce. I can only see the tops of most students’ heads, so unless they popped up like gophers, I couldn’t tell if they were wearing a seatbelt or not. \n\nThe only way I could see seatbelts being reasonably implemented and enforced is if regular bus routes staffed paraprofessionals (usually Special Ed buses have extra staff to ensure students are safe and manage behavior issues) for student management and seatbelt enforcement. On my bus we had upwards of 60 kids on an elementary route, so to staff effectively for this, you’d need at least 4 paraprofessionals, optimistically more like 6-8.\n\nAnd I’m not sure if you know this, but school districts hate paying money, especially for staffing. \n\nTLDR; if seatbelts were going to work on buses, you would need more staff on the bus and unless there was a serious shift in safety legislation, there is no way in hell administration would pay for that.",
            "title_similarity": "0.69718736"
        },
        {
            "id": "htj1k0c",
            "score": 1,
            "text": "Besides the logistical nightmare of getting all kids to even have them on, you need to have them on *correctly* or they are causing as many injuries as they prevent.  \n\nAlso bus is massive.  Massive bus filled with mass (people).  It is extremely likely that bus is on the \"winning\" end of a collision physics-wise.  Speedy thing becomes slightly less speedy when hit.  A small coupe with a single person is like a gnat on the windshield figuratively speaking.",
            "title_similarity": "0.65120107"
        },
        {
            "id": "htj2dyg",
            "score": 1,
            "text": "Let’s be real, though… all other very valid points aside, it doesn’t do the city any good to ticket a school bus. \n\nBut that might be more “why individuals have to wear seat belts” and less “why don’t kids on busses have to wear them.”",
            "title_similarity": "0.8056818"
        },
        {
            "id": "htj2i5n",
            "score": 1,
            "text": "I’m not even that young, but our busses always had seat belts. Maybe it was a district budget thing, though.",
            "title_similarity": "0.5998182"
        },
        {
            "id": "htj356y",
            "score": 1,
            "text": "Here is a proper ELI5:\n\nGrab a parent, friend, or sibling, a tennis ball, and a basketball.  Sit several feet apart, one of you with the tennis ball and one of you with the basketball.  Roll the balls toward each other at about the same speed. The tennis ball will move much more after the two balls collide because it weighs less.  The tennis ball is the car, and the basketball is the bus. Since the basketball (bus) hardly moved, the passengers do not need seatbelts.",
            "title_similarity": "0.5293366"
        },
        {
            "id": "htj376o",
            "score": 1,
            "text": "Answer:  The children of wealthy people don't use public school buses. The government is made up almost entirely of wealthy people.\n\nThey don't actually care if your kid gets killed, and the evidence is all around you.",
            "title_similarity": "0.6694391"
        },
        {
            "id": "htj5pwo",
            "score": 1,
            "text": "A big part of this is the issue of getting (often young children) to wear the seat belts properly. School buses also don't drive fast, other drivers tend to give them room exactly because it's a school bus and the size and mass of the school bus along with it's low speed makes seat belt not as necessary.\n\nThe potential safety that seat belts would provide may not be enough to make up for the downsides of having and using them.",
            "title_similarity": "0.7591231"
        },
        {
            "id": "htj5pzk",
            "score": 1,
            "text": "Statistically, school busses are among the safest vehicles on the road with only 0.2 fatalities for every 100m vehicle miles traveled (compared to cars which have 1.5 fatalities for every 100m vehicle miles traveled).\n\nSchool busses tend to prefer compartmentalization as their main safety benefit. This is why the seats are so tall & close together. Think of it like an egg crate.\n\nSource:\nhttps://www.nhtsa.gov/crashworthiness/school-bus-crashworthiness-research\n\nIn addition, with the size range of people that use a bus (from small kindergardeners to full grown adults), how do you design a seatbelt that accommodates all of them?\nIn cars, the solution is booster seats, which is impractical for a bus filled with 50 kids.",
            "title_similarity": "0.53780603"
        },
        {
            "id": "htj5vzq",
            "score": 1,
            "text": "School buses are designed with the tall seat backs to act as protection. If a bus drives by water and there is an accident, do you want one driver desperately trying to unbuckle 30 kids as it sinks? Or if it’s on fire? There are dangers to having the kids buckled in and the seat backs do a good job protecting the kids from impact.",
            "title_similarity": "0.6360302"
        },
        {
            "id": "htj63qc",
            "score": 1,
            "text": "Encapsulation. The seats in front act as barriers. As u/notnorthwest mentioned, the average speeds are much lower so impacts are usually also much lower. \nBuses are actually the safest form of land transport. \n\nAlso, as someone who drives school buses and seatbelted coaches, there is absolutely zero chance that all the kids will keep their seatbelts on for the entire journey. The drivers are busy, and if you happen to have teachers on board (during an excursion or similar), they sit at the front (they don’t wear the seatbelts themselves), and they’re too busy gossiping amongst themselves to pay any attention to what the kids are doing up the back. So it’s usual to hear the belts being undone as you drive along.",
            "title_similarity": "0.7206423"
        },
        {
            "id": "htj6gf3",
            "score": 1,
            "text": "I was always under the impression there were no seatbelts so kids couldn’t use them as weapons against each other. Probably just a Canadian thing since kids in the US just bring guns to school instead.",
            "title_similarity": "0.79007304"
        },
        {
            "id": "htj7fzw",
            "score": 1,
            "text": "The large school busses that seat like 65 people, being that it takes three or four steps to get to the floor level of the bus most passenger vehicles would impact the bottom of the bus and/or slide under it. Any injury to the passengers of the bus would be minimal from any angle. In a collision where the bus was hit head on or rear ended the seatback behind you provides impact protection and the seatback in front of you prevents you from being thrown forward. \n\nAs a bus passenger in a large standardized school bus the only way youre going to get thrown around in the bus, is if you get T-boned and rolled over and to do that to a 65 passenger school bus would require something roughly the same size traveling at a high rate of speed. \n\nTLDR: A school bus is designed to be as safe as possible for passengers if the vehicle is hit by a passenger vehicle which is the kind of accident it is most likely to be involved in.",
            "title_similarity": "0.6646936"
        },
        {
            "id": "htj8wmq",
            "score": 1,
            "text": "The two biggest reasons are that buses are really big, so that of they were to get in a crash, they won't really feel it; (but the other car will be completely demolished)\n\nThe other reason is that the people driving the bus have to get a CDL license (maybe with a couple extra caveats, but I'm unsure).\n\nAdditional safety measures are usually weighted against the additional cost of implementing them versus the benefit. School buses don't need safety belts because there never get into crashes, because the petite driving them are very good, safe drivers, and even if they do, it's statistically unlikely someone's going to get hurt.",
            "title_similarity": "0.7457193"
        },
        {
            "id": "htjbigi",
            "score": 1,
            "text": "I got in a lot of trouble for arguing a seat belt ticket with a judge under the premise that motorcycle riders don’t have to wear a helmet, so why should I have to wear a seatbelt. I wouldn’t back down and got a contempt charge. \n\nI still to this day refuse to admit I’m wrong about, and before you ask I do wear my seatbelt all the time but I had forgotten one time and my car didn’t have a sensor.",
            "title_similarity": "0.70602936"
        },
        {
            "id": "htjer0z",
            "score": 2,
            "text": "What about seatbelts on airplanes???",
            "title_similarity": "0.24414247"
        },
        {
            "id": "htjfo2o",
            "score": 1,
            "text": "My neighbor was a school bus driver and I asked this very question. He told me it was because kids were hitting each other with them.",
            "title_similarity": "0.5547122"
        },
        {
            "id": "htjhfhu",
            "score": 1,
            "text": "The next generation of new school buses that came out when I was in middle school over a decade ago all had seatbelts. I assume the newer models that I started seeing 2ish years ago also have them",
            "title_similarity": "0.4642514"
        },
        {
            "id": "htjhyaq",
            "score": 2,
            "text": "ALWAYS wondered the same thing every field trip … I assume it’s to prevent kids from getting trapped, but if they are already dead from a collision what’s it gonna matter if they are free of the vehicle?",
            "title_similarity": "0.627614"
        },
        {
            "id": "htjitbs",
            "score": 1,
            "text": "The issue there turns from impact protection, to evacuating 150 small children all tangled up in various seatbelts and bag straps.",
            "title_similarity": "0.5123306"
        },
        {
            "id": "htjiyi4",
            "score": 1,
            "text": "The biggest reason is fire safety. The risk of injury due to an accident is very low; though if a bus catches fire, the time it would take the driver to remove 70 children, all wearing seatbelts, would be catastrophic.",
            "title_similarity": "0.64847016"
        },
        {
            "id": "htjjsnj",
            "score": 1,
            "text": "I think you can’t have it both ways. Either school buses are so safe that In case of a crash the bus always comes out on top or in case of a crash you need to evacuate without unbuckling. The only reason they don’t have it is cost not because they would make the bus less safe.  \n\nThere are school districts in the states and Canada that mandate seat belts.",
            "title_similarity": "0.721762"
        },
        {
            "id": "htjkozv",
            "score": 1,
            "text": "In NYS all school buses are mandatory to have 3 seatbelts in each regular size seat and will not pass inspection of not presented to the inspector. Although it is not enforced for the passengers to buckle up the driver is required... So yes",
            "title_similarity": "0.7697258"
        },
        {
            "id": "htjlcac",
            "score": 1,
            "text": "What I wanna know is why are motorcycles legal but you can't import cars from other countries if they don't meet US crash testing guidelines",
            "title_similarity": "0.65140635"
        },
        {
            "id": "htjm782",
            "score": 1,
            "text": "Interesting side note, in 2018 a law went into effect in Texas requiring 3 point seat belts for all new school buses. However, the law only states that they have to be present and the district has the ability to enforce the wearing of seat belts. Existing buses were not mandated to be retrofitted. If the price delta of a new bus with belts versus a new bus without belts is more than the district's budget allows for, the purchase can be exempted.  \n\n\nSome of the local districts did some cost-analysis of retrofitting existing buses (the did pledge to buy new buses with belts) and found it simply wasn't cost effective to retrofit buses that were more than 40% through their service life.",
            "title_similarity": "0.67886615"
        },
        {
            "id": "htjmczy",
            "score": 3,
            "text": "Sneak up behind the 5yo and yell *Boo!*, then demand they tie their shoes in the next 10 seconds. People get clumsy when they are startled, especially children.",
            "title_similarity": "0.48350582"
        },
        {
            "id": "htjmxqx",
            "score": 1,
            "text": "New school buses for California, Florida, Louisiana, New Jersey, New York, and Texas require school bus seat belts.  \n\nThey're coming slowly as older buses are phased out \n\nhttps://www.cga.ct.gov/2016/rpt/2016-R-0318.htm#:~:text=ON%20SCHOOL%20BUSES-,California%2C%20Florida%2C%20Louisiana%2C%20New%20Jersey%2C%20New%20York%2C,require%20school%20bus%20seat%20belts.&text=California%20law%20requires%20three%2Dpoint,and%20after%20July%201%2C%202004.",
            "title_similarity": "0.5979654"
        },
        {
            "id": "htjnzzq",
            "score": 2,
            "text": "I was on a bus going to summer camp when I was five. It flipped and rolled eight times. Sliced my head open on something. Not 100% seat belts would have helped us much lol, but we wouldn't have been thrown around quite as bad. Several kids were way worse off than me.",
            "title_similarity": "0.68950355"
        },
        {
            "id": "htjoeml",
            "score": 1,
            "text": "Seat belts are only required in front seats in most states with seat belt laws. Bus seats are legally back seats.",
            "title_similarity": "0.615628"
        },
        {
            "id": "htjrvhl",
            "score": 1,
            "text": "The black lines down the outside of a school bus are where the bus is reinforced. If you look you’ll see 3 black lines. Busses are out together extremely well. I bought one at an auction this past July and the amount of time it took is to remove all of the seats and wheelchair rails etc was incredible. There were many of the seats that had 4 point harnesses for special needs and we had a special seatbelt cutter on the bus. The seats are also solid steel frames with like a “pillow case” of high density foam slid over it. (I disassembled every single seat)",
            "title_similarity": "0.62524873"
        },
        {
            "id": "htjs2mn",
            "score": 1,
            "text": "When two bikers crash into each other, they can both get hurt pretty badly. When two cars crash into each other, it’s the same. But think about if a biker hits a car. The car might have a dent, but the person in the car will most likely be fine. Since school buses are much bigger and heavier than most other vehicles, even if a car were to crash into one, the passengers would be fine for the most part.",
            "title_similarity": "0.5542644"
        },
        {
            "id": "htjsn0p",
            "score": 1,
            "text": "Officially?  Because school buses rarely get in accidents and when they do, they are usually bigger than the other vehicle, so very few people get hurt on a bus.\n\nUnofficially?  Seatbelts cost money, and the number of kids harmed, being so low, doesn’t provide enough return on investment to make it a good use of taxpayer dollars.",
            "title_similarity": "0.72570884"
        },
        {
            "id": "htjtrsg",
            "score": 1,
            "text": "A school bus is so big, that anything it is likely to crash into less likely to have a major impact compared to a small car. Also, due to flashing safety lights and stop sign s and even general public awareness of busses, they are less risky modes of transportation.",
            "title_similarity": "0.57865727"
        },
        {
            "id": "htjui7z",
            "score": 1,
            "text": "We had seatbelts on my school bus in Tucson, Az back in the 90s. Always weirded me out when we moved to KY and the seatbelts were either non existent or had been cut out of the school buses…",
            "title_similarity": "0.75199676"
        },
        {
            "id": "htjwwjl",
            "score": 2,
            "text": "the bus company will tell it's because in the event of an accident(fire)they wouldnt be able to free all the incapacitated children fast enough.  the real reason is they can fit more kids on the bus with no seat belts.  you can easily fit like four small kids on a bus seat but they only put two maybe three seat belts per seat.",
            "title_similarity": "0.7432192"
        },
        {
            "id": "htjylsp",
            "score": 1,
            "text": "Also, the back of the seat backs are highly cushioned and designed to safely absorb a child slamming into it.",
            "title_similarity": "0.1345197"
        },
        {
            "id": "htk06gn",
            "score": 1,
            "text": "Cause kids wack each other with seat belts and there is only one adult in the bus and they gotta drive da bus",
            "title_similarity": "0.63624525"
        },
        {
            "id": "htk0okw",
            "score": 3,
            "text": "Inertia (“that’s the way they’ve always been”) plus rationalizing (“there are so many buses without them, it would be impossible and expensive to retrofit) plus flawed research supporting the lack of seatbelts and suppressed studies pointing out that the lack of restraints makes bush’s less safe…\n\nFor instance, see this article:\nhttps://www.cbc.ca/news/canada/school-bus-seatbelts-1.4826500\n\nWhich mentions:\n\n“Yet, for more than 35 years, Transport Canada has been at the forefront of a North American-wide campaign against the use of seatbelts on school buses, based largely on a 1984 study that asserted they are not only unhelpful — they may also cause injuries.\n\n“Now, the four-month Fifth Estate investigation has exposed serious problems with that study and reveals that government officials have known for years that seatbelts save lives and prevent injuries on school buses — information the department has kept hidden from the public.”\n\nAnd also\n\n“Tylko also authored an internal 2010 Transport Canada test crash study that was not released publicly until The Fifth Estate asked for it last month. In it, Tylko said current school bus safety is \"not effective in side impacts\" and that more needed to be done \"to reduce or eliminate the serious injuries.\" “",
            "title_similarity": "0.7626486"
        },
        {
            "id": "htk1dg7",
            "score": 1,
            "text": "The cynic in me says it's because adults drive cars, can be seen wearing or not wearing them, and can pay fines. The seats are higher in a school bus, and kids aren't able to pay fines.\n\nThis is not to say that seat belts are a bad idea.",
            "title_similarity": "0.66955936"
        },
        {
            "id": "htk3ldr",
            "score": 1,
            "text": "insurance companies did not pay to have laws passed making seatbelts mandatory on bus to keep cost down.",
            "title_similarity": "0.72692555"
        },
        {
            "id": "htk40we",
            "score": 1,
            "text": "School busses are tanks. Watch a few videos of cars crashing into school busses and you will see why",
            "title_similarity": "0.49765497"
        },
        {
            "id": "htk6c04",
            "score": 1,
            "text": "Because school buses have so much mass that they generally dont \"stop\" with enough sudden force to cause injury.  Also by design, a child will be stopped by the seat in front of them during a head on collision, and due to lower mass, will not generate enough force to receive any injury.\n\nTldr:  bus big, smash through thing.  Kids small, they bounce.",
            "title_similarity": "0.7402657"
        },
        {
            "id": "htk6q8p",
            "score": 1,
            "text": "You don't have a glass windshield or a steering column in the way of your face/chest. You have the back of a wall of a chair. \n\nAlso school busses don't really have much of a crumple zone. They stay rigid and kind of follow through during crashes. \n\nKey take away is be very careful around school busses. They will drive right through your aluminum car/truck",
            "title_similarity": "0.74211335"
        },
        {
            "id": "htk77fh",
            "score": 3,
            "text": "Former school bus driver here! Some excellent points have already been made, but I'll add my own take here. The only school buses I've ever driven were for preschooler-kindergartener sized children, and that is because of their tiny size. Generally in those situations you have to keep a certain ratio of children to adults, so I generally had another person with me to help with seatbelts.\n\nFor children larger than that, though, school bus seats are designed so that it's a child's chest and shoulders that take any impact in the event of collision or hard braking. Putting a seatbelt on them means they're going to knock their head, instead. Additionally I believe that seatbelts would prove to be a tripping hazard in all situations, typical or otherwise. And, let's be serious, the seatbelts will wind up cut and vandalized just as the seats often are because teenagers are wild animals.\n\nAs mentioned in other comments, school buses are the literal safest way to ride. Don't fix what isn't broken! I think A/C units being standard on buses in the south would be more beneficial, because it can get damn hot in there.",
            "title_similarity": "0.65014637"
        },
        {
            "id": "htk80lu",
            "score": 1,
            "text": "I've always assumed that busses are very safe because they have a very high mass compared to any vehicle they might hit or be hit by.  Therefore they will experience low acceleration in a crash relative to another vehicle due to conservation of momentum.  This is the same reason SUVs are safer than cars.  They are likely to be the heavier vehicle.",
            "title_similarity": "0.47359195"
        },
        {
            "id": "htk82ub",
            "score": 3,
            "text": "Basically they came up with a relatively safe design a long time ago, and instead of updating it or changing it in any meaningful way, we just have all the other drivers be SUPER careful when that are near by.\n\nLuckily they (usually) don’t have to go on any busy highways or anything like that, so it’s pretty safe for the most part. A lot of people try to argue that it’s “impossible” to get kids to wear seatbelts, but that’s obviously bullshit, most kids will wear them in every other vertical (and yes, the kids do realize how hypocritical that is)",
            "title_similarity": "0.67145544"
        },
        {
            "id": "htk82zj",
            "score": 1,
            "text": "The school buses in our area have 3 to 4 children per seat. I'm not sure how you design seatbelts for that. Would you have 2 seatbelts per seat and then require school districts to buy twice as many buses and hire twice as many bus drivers?",
            "title_similarity": "0.59645057"
        },
        {
            "id": "htk8jxm",
            "score": 1,
            "text": "I see a lot of answers here are saying why it's safe to not have a seat belt so I'm going to answer this from another angle.\n\nIf you read any laws what you'll normally find is that they have more allowable exceptions to the law than requirements to follow it.\n\nThese exceptions can be for a huge variety of reasons.  They can be because it falls outside of what the law is about (say requiring a seat belt to be safe), or that they decide that seatbelts only have to be standard on certain types of vehicles after a certain date (this could be because it'd be too expensive for most people to modify already bought vehicles) and so on and so forth.\n\nAs said you find this with quite a lot of laws.",
            "title_similarity": "0.6213021"
        },
        {
            "id": "htkap78",
            "score": 1,
            "text": "Good question but I bet it has to do with crash physics… a bus is more massive than most vehicles and that energy (from a collision) has to transfer over a lot more space. So a big flat school bus seat will stop most with minimal injuries in a traffic accident. Now if the bus goes over a hill all bets are off",
            "title_similarity": "0.6287617"
        },
        {
            "id": "htkdiox",
            "score": 2,
            "text": "My question about busses: in my neighborhood they always stop and open a door on railroad tracks (not before them- literally on them). Doesn’t that mean they are spending MORE time on the tracks and are therefore more likely to get hit by a train than a car that drives quickly through? What good does it do to stop on the tracks?",
            "title_similarity": "0.554987"
        },
        {
            "id": "htkhzqq",
            "score": 1,
            "text": "Buses have much more **mass** than cars, so very little impact force is applied to occupants. School Buses can't travel more than 55 mph so they dont have to deal with excessive speed forces.  \n\n\nOf course, seatbelts could absolutely help in exceptional situations like highway rollovers, impacts with other massive objects like trucks, trains, buildings etc. so it is essentially a statistical sacrifice deemed acceptable.",
            "title_similarity": "0.66453195"
        },
        {
            "id": "htki2qk",
            "score": 1,
            "text": "Busses are massive. If they are involved in a crash, the biggest problem the passengers will face is evacuation against the risk of fire. In the event of panic, it's easier to carry an injured child than to unbuckle their seatbelt while you are yourself panicking.",
            "title_similarity": "0.5508169"
        },
        {
            "id": "htkje59",
            "score": 1,
            "text": "School busses are steel reinforced, sit higher than most cars, and have a fafo demeanor. Coming from someone who used to work on them.",
            "title_similarity": "0.44666612"
        },
        {
            "id": "htkppd8",
            "score": 1,
            "text": "I had to sit through a school bus safety brief as punishment for fighting on a bus once. They used to have seatbelts on busses, but the kids were injuring each other with them and had difficulty getting out of them in the event of a crash, so they ended up removing them and being safer for it.",
            "title_similarity": "0.71587354"
        },
        {
            "id": "htkvv2e",
            "score": 1,
            "text": "Because if physics. Bodies in motion. Impacts are felt inversely based on mass. A bus is heavy so cars feel almost all of the impact.",
            "title_similarity": "0.46485293"
        },
        {
            "id": "htky1uv",
            "score": 2,
            "text": "True story that will get buried.\n\nIn the 1960s in parts of the US there were mini school buses with 2 seats, well, 2 plus the driver's seat. They were long benches that ran along the side of the bus, and those benches had seatbelts at intervals. However, the ones my school used, the seat belts were always broken and the drivers never checked to see if the kids were using them.\n\nBecause the center of the bus was a wide open space, in an accident, unrestrained children could bounce around like human ping pong balls. Should one hit the crashbar for the rear door, they could then bounce right out of the bus.\n\nAnd that's why you've probably never seen a mini school bus like that.",
            "title_similarity": "0.7307842"
        },
        {
            "id": "htl0wqb",
            "score": 1,
            "text": "France here, we do have belts in our long trip buses, but absolutely no one uses them, literally. despite having a sign post saying that it is totally illegal not using it next to your seat, no one ever checks it, no one ever gets punished, I've been taking those for nearly 2 years, I haven't seen a single person amongst thousands using it.",
            "title_similarity": "0.73532254"
        },
        {
            "id": "htl2y3k",
            "score": 3,
            "text": "The trend is going towards belts in busses. Manufacturers are actively participating in making retrofit kits for older busses and current products have them. Districts that have belts in their busses actually report very few issues with belt compliance simply because the current generation of parents grew up using seat belts. Bus drivers report fewer discipline issues since students are belted in vs roaming around. Bus evacuation drills have shown no significant increase in times for busses with belts. Due to lobbying this hasn't become a nationwide standard yet, but the trend is changing, much too slow for my taste. Having participated in remote controlled bus crashes for accident reconstruction work, some of the misinformation in the comments I've seen here make me sick.",
            "title_similarity": "0.68068606"
        },
        {
            "id": "htl33jt",
            "score": 1,
            "text": "Building on other comments. School buses also don't go 100kph, so the amount of damage potential relative to a normal car is significantly less",
            "title_similarity": "0.68852305"
        },
        {
            "id": "htl46q4",
            "score": 2,
            "text": "The single biggest factor that I was told for this is fire. The additional time it can take for students, especially really young ones, to unbuckle their belts could have catastrophic results in escaping a bus on fire. The specific example used is the Carrollton incident in 1988. There were 27 fatalities in that wreck, and the majority (if not all) of them were the result of the fire, and not the collision and crash of the bus. This incident resulted in an overhaul of emergency exits in school busses in the US, and further upheld the decision to omit seatbelts in large busses.\n\nSmaller van-type busses do have seatbelts, however, and students are required to wear them. These busses don't have many of the safety advantages inherent in the design of a full sized bus, as well as having far fewer students, making the seatbelts much more of a benefit in comparison.",
            "title_similarity": "0.69383013"
        },
        {
            "id": "htl7e9p",
            "score": 3,
            "text": "Very good explanations, now to explain it to a five-year-old. \n\nCars aren’t as safe as buses, so they need seatbelts. Buses are so safe that seatbelts don’t help, and instead make it harder to get out of a bus if it does crash.",
            "title_similarity": "0.6716597"
        },
        {
            "id": "htla19j",
            "score": 1,
            "text": "There was a report in Canada that school bus manufacturers coordinated with corrupt regulators to falsify safety data when seat belt laws were being enacted, and that children are in fact meaningfully safer when wearing a seat belt and a number of deaths could have prevented by having seat belt laws also apply to school buses, but it would have cost millions to implement.\n\nI think it was a CBC marketplace investigation or something but I’m going from memory, I’m sure its out there. Knowing that lobbying in the USA is even more well-developed and corrupt I’d be shocked if it wasn’t even more the case down there.",
            "title_similarity": "0.6101651"
        },
        {
            "id": "htlie6n",
            "score": 2,
            "text": "Partly because in most traffic collision scenarios, it won’t be the bus taking the brunt of the impact. People in smaller cars without seatbelts would be fucked though",
            "title_similarity": "0.6946871"
        },
        {
            "id": "htlmh13",
            "score": 3,
            "text": "I’ve been in an actual, honest to god, school bus accident. It’s been a long while but as a passenger it didn’t feel like more than a very large jostle. We were side swiped by another vehicle and due to the sheer size of the bus it didn’t cause much outward damage to us. It did however cause quite a bit of internal damage to a few unlucky ones like myself. My back was fucked up for a good week after that.",
            "title_similarity": "0.71005964"
        },
        {
            "id": "htltyf9",
            "score": 2,
            "text": "The short and simple answer is this: busses are big and heavy so when another vehicle impacts them the bus is relatively unaffected, the seat design does a rather good job of protecting the passengers like a restraint, most busses don't go very fast, and all busses are supposed to be driven by professional (CDL certified) drivers. All of these things together make them as safe, or often safer, that most standard passenger vehicles with restraints.",
            "title_similarity": "0.53054655"
        },
        {
            "id": "htlu8fw",
            "score": 1,
            "text": "My school bus had seatbelts? I remember when they started adding them in the mid nineties. Have they stopped?",
            "title_similarity": "0.4942058"
        },
        {
            "id": "htluj3b",
            "score": 2,
            "text": "Many Americans still view children as property, not as people, like back when that lazy cheap designed was created. Why would you belt in property?",
            "title_similarity": "0.55851763"
        },
        {
            "id": "htlx3ol",
            "score": 2,
            "text": "A bus needs more energy to do more damage, due to its size, weight and limited speed. A small car, like a 2 seat mini can kill everyone inside if it hits said bus, provided they aren’t wearing seatbelts. The seatbelts are also a restriction if the bus does tip, as it can make getting out harder",
            "title_similarity": "0.6813768"
        },
        {
            "id": "htm4stb",
            "score": 2,
            "text": "Multiple reasons.\n\nObviously the reason we have seatbelts is to restrain the occupants in the event of a crash. If you're not restrained, you flop around and bump into hard objects.\n\nTo better understand the forces in a collision, check out this neat [impact force calculator](https://www.omnicalculator.com/physics/car-crash-force). By inputting vehicle speed, your body weight, and whether you're wearing a seatbelt it spits out an estimated stopping time (for your body) and then calculates the impact forces exerted. There's some good explanations and analogies on that page you might like.\n\nIt takes the liberty of assuming things like stopping time as if you're in a car. You'll notice that by increasing vehicle speed, stopping time decreases. That's because at a fast speed, the crumple zones in a vehicle collapse faster. You'll also notice that by not wearing a seatbelt, the impact time shortens quite a bit. That's because the seatbelt holds your body in place and the stop duration is a combination of you moving in the seat, stretching the seatbelt, and the seat itself flexing around. All of this allows you to stop slower than the frame of the car. Without a seatbelt, you hit the windshield/steering column/dash, and you stop at whatever speed the cab of the vehicle stops at, which hurts more.\n\nInto the specifics:\n\n1. Cars have small spaces. [You wouldn't think about it, but there's actually a number of safety regulations about the spaces in and around a headrest](https://tc.canada.ca/sites/default/files/migrated/202_tsd_rev_1r.pdf). Gaps in the steering wheel where your arm can get caught, door handles, anything you could get caught on or punch. When your body ragdolls in the cabin, you don't want your arm stuck in the steering wheel. A seatbelt restrains you to prevent you from ragdolling and snapping your arm and tearing it apart. Busses don't have these kinds of tight spaces. Big flat seats to whap your face on but that's it.\n\n2. Hard components in the travel path of a body. Steering wheel, dash, windshield, etc. All of these will mess you up when you hit them. Bus seats aren't exactly cushiony, but they're better than a windshield. The metal parts are padded unless they're really worn. The seats are designed at an angle where you're hitting the broad side and they can flex forward enough to absorb some of the body's momentum.\n\n3. The possibility of being thrown clear of the vehicle. The car windshield is large, and if you don't wear a seatbelt you can get tossed right through it (not cleanly I might add). As much as the car just got totaled, it still has more structural integrity than your squishy meat bag of a body. In a car accident, particularly on a highway, there's more danger incoming. What would suck is getting tossed forward only for your own car to roll onto you. You can survive a rollover from inside the cabin. You can't if you're under the car. Same reason you shouldn't blindly get out of your car during a highway pileup. In your car you're at least protected by what's left of your chassis. Outside you're a couple of balloons waiting to get popped by the next driver to slide on the ice.\n\n4. Airbags. You might not realize it, but air bags and seatbelts work *together*. Without a seatbelt, an airbag could kill you. With a seatbelt, the airbag is a second measure that saves your life. Airbags deploy hella fast so that they can be fully inflated and just barely starting to deflate *before* you hit them. This way they act like a pillow. If you're going super fast and get in a collision, while the airbag is deploying, your seatbelt is slowing your body down so that your body doesn't get in the way of the airbag too soon. Without that seatbelt slowing your body down, you beat the airbag to the punch, and instead of feeling like a pillow the airbag feels like a cannon. For this reason, airbags deploy on a complicated function. Above a certain speed without a seatbelt, the airbag will not deploy. This is because your body will get in the way and the airbag will certainly kill you. You have a better chance of living being tossed through the windshield and hoping nothing lands and you don't turn into a crayon. Because cars have airbags, they NEED seatbelts. The airbag is an amazing safety feature, but it's literally point-blank lethal cannon if you don't have a seatbelt. School busses don't have airbags, so there's no related requirement for a seatbelt.\n\n5. As alluded to in the airbag point, the impact time matters. In a car accident, you can stop very quickly. Hitting another car head on or hitting a wall will stop the car dead in a few milliseconds. In order to change an object's (your body's) momentum, it's a combination of force and time. You can stop a moving object with a small force over a long period of time - e.g. light on the brakes for a hundred meters, or with a lot of force over a short period of time - slam into a wall. In a car accident, the collision happens quickly so there's a ton of force all at once called \"impulse\". There are designs like crumple zones which try to extend that time by a few milliseconds. If you can go from 1 millisecond to 2 milliseconds of collision time by including a crumple zone, only half of the force is exerted all at once, so the occupants have a better chance of living. That's in a car. In a bus there are still some crumple zones, but there's a more important design feature called \"it's a fucking bus\". Busses don't stop on a dime, and in this case that's good. By being built high up and with heavy steel construction, most school bus collisions are able to happen over a long period of time. We're talking 10x as long or more, meaning the forces felt by the occupants having to slow down are far lower. A car can hit a brick wall and the seat belt and airbag will slow your body down over 20 ms. A bus will plow through the wall and stop among the debris over 1000 ms. The impact force is far more manageable for the occupants this way. Even on public transit busses, the impact time for the bus is going to be far longer than for the multiple vehicles it's able to plow through simply because of the weight difference.\n\n6. Children are bendy and can take a hit.\n\n7. Likelihood of a multiple rollover. City busses pretty much *cannot* roll over at all, and while school busses can it's not as likely as a small vehicle. The reason is because busses have a long wheel base and lots of mass. A single rollover for a bus sucks, but it's a big tin can with a bunch of backpacks and see point 6 - children are bendy. Same with seatbelts. A turnover isn't game over even without a seatbelt. A multiple rollover though is. Multiple rollovers occur when a vehicle that's moving forward ends up turning slideways. Tire traction or obstacles can then turn that sideways momentum into angular momentum quite easily.  Pick up a pen and see how easy it is to turn end over end. You can do it quickly with your fingers. What about something larger like a broom handle? On an open surface, push a pen from the back end across the table  as if sending across to a friend. It'll probably end up turning sideways and rolling. Do the same for a broomhandle and it's less likely to turn sideways unless you give it an extra sideways push. This is the difference between a car and a bus. When a car looses control, it's easy for it to turn sideways, and then even easier for it to start rolling. A bus is less likely to turn sideways at all, and if it did it wouldn't have as much energy left to roll over more than a quarter turn. The boxy shape of busses also helps prevent them from continuing to roll. \n\nAll of these design features, whether intended or coincidental, make busses stupidly safe even without seatbelts.",
            "title_similarity": "0.45755982"
        },
        {
            "id": "htm7xeu",
            "score": 1,
            "text": "You’ll hit the seat in front of you on a school bus but in a car you will fly through the windshield",
            "title_similarity": "0.5036391"
        },
        {
            "id": "htm96me",
            "score": 1,
            "text": "Mass. Big heavy thing decelerates a lot slower than small not heavy thing. If a bus and a car collide, it’s the car that’s getting punted the other way, the bus will not be deflected much.\n\nGiven that most crashes are into things smaller than a bus, the bus has built in “safety”. At that point it’s just an economics and numbers game. They would be even safer with seatbelts. But economically and behaviourally does it make sense. Most safe thing is to not ever leave the house. Where is the right balance.",
            "title_similarity": "0.67938685"
        },
        {
            "id": "htm9yxm",
            "score": 1,
            "text": "I witnessed a rollover once and it took a lot of effort to get the one person wearing a belt out of the bus while everyone else was able to get to safety. They were handicapped, and handicapped seats had belts in the seat directly behind the driver, presumably because there wasn't a bus seat in front of it to allow for a wheelchair based on other comments. It took a long time for fire and rescue to arrive and during that time people were trying to remove this person from the bus, which could have seriously injured them worse (especially considering they had a condition that is not necessarily well understood by the general masses). Even after fire and rescue arrived it still took a minute because they had to brace and prepare. \n\nNow imagine if every single person on that bus was buckled in, and the bus is on fire and full of smoke or something. Especially with children who panic and don't yet have the faculties to remain calm and alert during emergencies.",
            "title_similarity": "0.7680618"
        },
        {
            "id": "htmmvp0",
            "score": 1,
            "text": "Is it just the US though? I've ridden school buses in both Denmark and Germany and there weren't any seatbelts either",
            "title_similarity": "0.74859136"
        },
        {
            "id": "htmqpnu",
            "score": 1,
            "text": "Ticketing drivers for not wearing a seatbelt makes the government money.\n\nPutting seatbelts in school buses costs the government money.",
            "title_similarity": "0.7023375"
        },
        {
            "id": "htmwaaa",
            "score": 1,
            "text": "I remember some buses having seatbelts when I was a kid/teenager. Anyone else?",
            "title_similarity": "0.49629775"
        }
    ]
}