{
    "ELI5: Why exactly is “Jewish” classified as both a race and a religion?\n": [
        {
            "id": "hv90ev2",
            "score": -4,
            "text": "There's a lot of insanity around this topic.\n\nA Polish Jew is white. A Sammy Davis Jew is a black. A Moorish Jew is white (Spain) and black (northern Africa). A Chinese Jew is Chinese. This conversation is making me insane. Whoopi's definition of \"racism\" is identifiable by skin color. Her experience is that people are racist based on color. Jew is not a color. You CANNOT tell a Jew by skin color. Jews are EVERY skin color. Whoopi's black and she has every reason to say that if the Klan came down the street she'd run faster than her white Jewish friend. I am stunned at people being mad at that.",
            "title_similarity": "0.5571234"
        },
        {
            "id": "hv87pd6",
            "score": 1,
            "text": "It all depends on whom one asks. Judaism is a little different than other religions, because one is Jewish if his/her mother is Jewish, but can also become Jewish by converting to the Jewish faith. People are literally born into the religion. Because if this, there are many Jewish people who do not practice the religion, but are Jewish by birth. \nJewish people come in all races, and there is technically no Jewish “race”, but it is a unique identity that does not come from a nationality, a skin colour, or other factors. Being Jewish is either voluntary or by birth. Judaism is a religion, but not all Jews practice. It’s very confusing, and no great term to use to describe it, so the generic “race” has been used for a very long time, even if, by definition, “Jewish” is not an actual race.",
            "title_similarity": "0.7037489"
        },
        {
            "id": "hv8cyxl",
            "score": 8,
            "text": "You’re either born Jewish because your mother is Jewish, or you converted to Judaism. Conversion is hard, and takes a while, so you won’t find too many converts. In both cases you can follow the Jewish religion, or not. You can even be an atheist, but because your mom is Jewish you’ll be a Jew no matter what. The door is always open for you as long as your mom is Jewish (and you can prove it).",
            "title_similarity": "0.5180934"
        },
        {
            "id": "hv8e0dq",
            "score": -9,
            "text": "jews aren't a race. hitler tried looking for biological differences between jews and non jews and 80 years later this is still regarded as garbage pseudoscience.",
            "title_similarity": "0.5794452"
        },
        {
            "id": "hv8ga3v",
            "score": 18,
            "text": "Race is a social construct. It doesn't actually exist. Not from a biological sense.  \n\n\nIn reality, there is only a single race. The human race. However, there are different traits in humans based on, in part, by ancestral origins.  \n\n\nBut in the 1700s, the term race was invented and rationalized and the word has stuck ever since.  \n\n\nThe ancestral origins of people with Jewish descent would be from civilizations that began in the middle east, more specifically Israel today.  \n\n\nSo when people talk about race, they're really talking about ancestral heritage.   \n\n\nWith that said, racism does exists. Because although scientifically, race is a social construct, humans still believe in the concept of races, and thus discriminate each other based on that.",
            "title_similarity": "0.73245674"
        },
        {
            "id": "hv88vgr",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.16429879"
        },
        {
            "id": "hv8ap3f",
            "score": 63,
            "text": "[removed]",
            "title_similarity": "0.16429879"
        },
        {
            "id": "hv8bs95",
            "score": 8,
            "text": "sociologically speaking, race denotes *physical* characteristics, while ethnicity denotes *cultural* characteristics.  [There are biological differences between Jews and others](https://www.haaretz.com/jewish/dna-links-prove-jews-are-a-race-says-genetics-expert-1.5220113), though because talking about \"race\" is very freighted people don't like to talk about this\\*.  Being Jewish is also a *religion*\\-- a set of beliefs and practices concerning ideas about the supernatural.\n\nSo, the bio differences demonstrate racial characteristics (but biological, not social or psychological traits) but they are also a religion (beliefs and practices).\n\n&#x200B;\n\n* The problem is not race \"per se,\" it's when we ascribe characteristics of humans to those racial differences that we have problems (racism).\n\nEDIT: This is my \"educated\" belief based on being both a sociologist and a Jew.",
            "title_similarity": "0.72129875"
        },
        {
            "id": "hv8lrai",
            "score": 54,
            "text": "Whenever Jews are in the news, this question gets posted all over Reddit. It seems innocent, just someone asking questions, but you'll notice patterns of how it's subtly used to discredit that Jews could be a race or ethnicity and therefore not deserving of consideration for help or support in the face of whatever right wing or left wing challenge is in the news that day.",
            "title_similarity": "0.5571727"
        },
        {
            "id": "hv8afvx",
            "score": 12,
            "text": "All religions used to be tied to your family and your nationality. In the ancient world, different gods sponsored different people and you worshipped the one connected to your people. Even today, there are other ethnoreligious groups than the Jews. Druze, Samaritans, Yazidi, etc. Jews are just famous because they have lived alongside the most famous proselytizing religion, Christianity. Christians have hated them and respected them at the same time for two thousand years. The Jewish religion is the foundation of Christianity, but most contemporary Jews refused to accept it.",
            "title_similarity": "0.5514296"
        },
        {
            "id": "hv8fika",
            "score": 72,
            "text": "It's not a race, but it it an ethnicity. Race is also a terrible thing to try and pin down genetically and is more or less archaic terminology these days. Using the old framework Jewish people are most closely related to others from the Levant, particularly Palestinians, Lebanese and Syrians with whom they are more or less genetically indistinguishable for the most part.",
            "title_similarity": "0.6121627"
        },
        {
            "id": "hv8i90i",
            "score": 4,
            "text": "I dunno y’all. Maybe it’s my hippie parents coming through but I’m pretty sure there’s only one race of humanoids currently existing on Earth. \n\nRace is bullshit and anyone who believes physical differences are a defining factor of a persons identity are actually bigots. That includes all my super liberal social justice friends. You all have it wrong. The only way to move past “racial” barriers is to forget “race”.",
            "title_similarity": "0.45181113"
        },
        {
            "id": "hv8fk6x",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.16429879"
        },
        {
            "id": "hv8gjt7",
            "score": 26,
            "text": "Woof there are some truly bad answers here. And what is the phrasing of this question, do you not regard Jews as people?\n\nThe Jewish people are one of the worlds oldest surviving cultural traditions. Since Jews usually stayed together before being sent somewhere else that means Jews have genetic markers that are specific.\n\nThe difference between ashkenazi (European) and Sephardic (middle eastern) Jews can be discerned with a dna test. In fact certain genes are either only found in Jews or are rarely found outside of Jewish families. Taysachs disease, tasting cilantro as bitter etc.\n\nThen there is the religious and cultural tradition which has also survived for a very long time.\n\nWhat you end up with is a group of people that are a culture, religion and ethnic group. Not really a “race” not really not related somehow, maybe just a bit more than others.\n\nIf you’re interested in this topic a good way to learn about it is by learning about the diaspora. That’s a term that references the sprawl of Jews and Jewish culture around the world. But it also references the reasons for it.\n\nRemember also that you can convert into Judaism. You can be born a Jew but not practice and still be Jewish by identity. You can marry into Judaism you can even practice some other religions and still be a Jew. It’s somewhat subjective.\n\nThere are also disagreements about what makes a Jew within Judaism of course.\n\nSo there’s a lot to it. There’s also the hitler stuff but pretty much everyone loves to talk about that so I’m skipping it. You gotta understand, it’s thousands of years of history that you have to think of within the context of anti semitism. People hate jews. \n\nThere’s a lot to it.",
            "title_similarity": "0.6630986"
        },
        {
            "id": "hv8f78n",
            "score": 1,
            "text": "Judaism is a religion, but also because Jews were often forced to live in certain areas, not allowed to marry non-Jews, had to regular flee countries and find new communities in which to live, Jews are more closely connected genetically to Jews from other countries than they are to others within that country.",
            "title_similarity": "0.5715542"
        },
        {
            "id": "hv8bccp",
            "score": -10,
            "text": "Because the jewish people (like many non diverse ancient cultures) used to be a religious ethnostate so every jew was jewish and every jewish person was a jew",
            "title_similarity": "0.6909045"
        },
        {
            "id": "hv8e39s",
            "score": 32,
            "text": "[removed]",
            "title_similarity": "0.16429879"
        },
        {
            "id": "hv95kbk",
            "score": 0,
            "text": "They aren't. Science only supports one race of us, and that is the human race. Skin colors and ethnicities are not, by definition, races. There is not enough biological difference to support classing us into separate races. So, on this (very technical) point, Whoopi was correct. The Holocaust was about humans being horrible to other humans based on societal class, religion, and prejudice.",
            "title_similarity": "0.5372739"
        },
        {
            "id": "hvbbll5",
            "score": -4,
            "text": "Judaism is a religion. It is not an ethnicity.\n\nIsraelis have promoted the idea that it is an ethnicity because it is in their political interest to do so.\n\nThe vast majority of Israelis who currently live in Israel do not have Canaanite DNA. Canaanite DNA is the single largest indicator of someone who lived in ancient Judea. There never was an ancient Israel; Israelites--who were followers of the Religion of Israel--lived in the 12 Kingdoms, which were systematically eliminated by Babylon and Assyria, and then (after being enslaved for a long time) were allowed to reinhabit their old lands as the \"Kingdom Judea\" and \"Kingdom of Samaria\" (i.e.: the \"Samaritans\", of the bible). \n\nContrary to Wikipedia, there was never a \"Kingdom of Israel.\" That is an outright fiction which Wikipedia propagandizes, and which it acknowledges by admitting that the name of the kingdom north of Judea was \"Samaria\"--not \"Israel.\"\n\nThe Israelites, in ancient times, were strictly a religious group that enthusiastically sought out converts (which scared the Roman empire)--not a racial group. There are Black-African Jews (check out how Ethiopian Jews are treated in modern-day Israel: forcibly neutered without their knowledge, deported at every opportunity, and generally ostracized), East Asian Jews (yes, that means racially Han Jews), Sephardic Jews (that means North African / Berber Jews), and of course West European and Slavic Jews. \n\nWhat generally gets neglected in the discourse about \"What is a Jew?\" is the idea that all of the Palestinians who are currently being systematically raped, murdered, and stolen from were the original Canaanites who made up the core of the original Israelites (as attested in The Bible), and who are the genuine genetic (if not spiritual) ancestors of all \"Israelites\", which is what today's Jewish adherents would call themselves if they were the genuine descendants of the ancient religion of Israelism, which they are not.\n\nThey are, instead, Jews--and there's nothing wrong with being a Jew, but let's not pretend like they're actual Israelites.",
            "title_similarity": "0.5595125"
        },
        {
            "id": "hv8fqnl",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8af5g",
            "score": 133,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8qiu1",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8gift",
            "score": 3,
            "text": "I honestly think collective marginalization and bigotry is a significant part of the reason they're so entangled today. When people decide to start exterminating a religion, and connect it with a heritage, then literally commit a Holocaust on them based on any combination of the two...\n\nWhen something like that happens it muddies the waters been ethnicity and faith.\n\nThere's plenty of secular Jews who observe practices and rituals just because of tradition without feeling any religious attachment to it in America. \n\nI have a close friend who's family is very Jewish, her mother converted, and her father is an Israeli Jew. In many ways they're very traditional, they observe all the holidays in full. But they're also very accepting people. They threw a Passover celebration I was invited to, and tossed a yarmulke on my head and coached me through the motions so I'd feel like part of the celebration. They don't mind that their daughter is a lesbian and is married to a wonderful woman now - I performed the ceremony myself, it was pretty sweet actually. I'm a secular reverend, BTW.\n\nSo while it's actually super complicated, it's also something you can learn a sense of.",
            "title_similarity": "0.59549975"
        },
        {
            "id": "hv8nysc",
            "score": 2,
            "text": "I thought the whole reason for the holocaust was because Hitler thought they were a race. I'm pretty sure they don't want to be called a race, I think it's called racial antisenitism.",
            "title_similarity": "0.5226642"
        },
        {
            "id": "hv91bav",
            "score": 2,
            "text": "It's not a race. Is \"Persian\" a race? Is \"Zulu\" a race? No, they are ethnic groups and they historically had their own religions that were open only to them, before Islam and Christianity came over. \n\nIt's the same situation with us, except we do accept converts under certain conditions, even though it was much less commonplace in the past.",
            "title_similarity": "0.50583845"
        },
        {
            "id": "hv95ezy",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.18333346"
        },
        {
            "id": "hvb2zsa",
            "score": -2,
            "text": "Because people are ignorant. They should be properly named Israelis.\n\nNobody calls Buddhists a race.\n\nIt's also annoying when people say anti-semitic when it's actually anti-jewish because Semitic is a language family which also includes Arabic.",
            "title_similarity": "0.53360355"
        },
        {
            "id": "hv8ndue",
            "score": 138,
            "text": "Jews are an ethnoreligious group. Race is a colonial pseudoscience taxonomy. There's no Jewish \"race\" because race isn't a thing that exists outside of racism and its social ramifications. Ethnicities are people who share common cultural traditions. Ethnoreligious groups are groups where those traditions feature religion prominently. \"Races\" can be reified into ethnicities, as happened with African slaves in America who were largely robbed of their national and cultural heritage and forged new ones, but Jews predate settler-colonial pseudoscience and the whole concept of race by, oh, a few thousand years, I reckon.",
            "title_similarity": "0.6584798"
        },
        {
            "id": "hv8ryfk",
            "score": -3,
            "text": "Because they’re not white, they are not black, they are not middle eastern. There some combination or genesis of all of the above depending on your belief system. You can be Jewish and Christian, But you can’t be white and be Jewish… You can only practice Judaism. Practicing their religion doesn’t change a race.",
            "title_similarity": "0.58094853"
        },
        {
            "id": "hv90tjz",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8h9fr",
            "score": -8,
            "text": "Three races exist. Caucasoid, Mongoloid, and Negroid. Everything else is ethnicity. If we are following science that is.",
            "title_similarity": "0.5486779"
        },
        {
            "id": "hv8djt8",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8r1c8",
            "score": 6,
            "text": "There is only one 'race' and that's the human race. \n\nThere are no separate 'races'. It is just a made-up idea used by governments to cause division amongst their people so that they can get on with maintaing their power over others and lining their own pockets.",
            "title_similarity": "0.35451657"
        },
        {
            "id": "hv8dnjg",
            "score": -1,
            "text": "Race = human\nEthnicity = regional name (American, Japanese, Italian, etc)\n\nRace only denotes humans on planet earth. It is imo incorrect to use race to speak about humans, this is called bigotry.",
            "title_similarity": "0.48862636"
        },
        {
            "id": "hv9coe9",
            "score": 2,
            "text": "What I really don't get is how they are considered a race when there are so many different groups of Jewish people that at least appear to be different ethnicities. The ones in Israel look very different from the ones in eastern Europe, for example. If they are the same race, then clearly I don't understand what a race is.",
            "title_similarity": "0.71437883"
        },
        {
            "id": "hv93zcd",
            "score": 10,
            "text": "Races in human do not exist.. it's an awful decription of a group of people because it mirrors the biological terminology of races which split species into diferent groups given their physical traits.\n\nTalk about ethnicities, cultures, nationalities, etc.. but race is a concept that spawned in the 17th century.. right there when there were human zoos..",
            "title_similarity": "0.52403456"
        },
        {
            "id": "hv8djkh",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8h4ha",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.18333346"
        },
        {
            "id": "hv9fzve",
            "score": -4,
            "text": "Racial Jews are black, all of them, and lived in the middle east and now Ethiopia. Religious Jews come from Europe, who adopted the religion.",
            "title_similarity": "0.6300022"
        },
        {
            "id": "hv9gda2",
            "score": -4,
            "text": "Absolutely ridiculous, as there are legitimately Jewish tribes of different  'real, anthropological races.   Though Israel is busy trying to wipe out black Jews.  Black Jews that claim their right to be a citizen of Israel have to agree to be sterilised before the Israeli government issues their citizenship.\n\n This is true, but you never hear organisations such as the UN, amnesty or any country complain about this.\n\n\nSo no Judaism is a religion and a culture.  There are a multitude of Jew ethnicities..",
            "title_similarity": "0.52927876"
        },
        {
            "id": "hvaqe7i",
            "score": -3,
            "text": "Its bullshit. Whoopi is entirely correct. Most Jews are European based. There are sephardic jews from Portugal, Spain, north africa. But most if not all of the persecuted jews were ashkenazi and identify as white. Dont really care what Hitlers definition of white is. It wasn't just jews that Hitler wanted to purge to create a pure race. Think about that",
            "title_similarity": "0.5525588"
        },
        {
            "id": "hv8r6fd",
            "score": -9,
            "text": "Jewish people are white. It’s part of the reason they had to wear a star. They were indistinguishable from Germans apart from that",
            "title_similarity": "0.56570995"
        },
        {
            "id": "hv8j7lz",
            "score": 0,
            "text": "For the longest time I thought Jewish was only reffed to as a religion. So whenever someone said they were Jewish, I just thought they were staying what religion they were. Like when Jerry Seinfeld would or some other actor in a movie. And it wasn't till later that I realized they were probably referring to thier race rather than their religion. Given the context.",
            "title_similarity": "0.63993657"
        },
        {
            "id": "hv8nwel",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8rl7b",
            "score": 0,
            "text": "Race and ethnicity are different, so I'm still waiting for someone to answer the question. They are not a different race are they?",
            "title_similarity": "0.5268613"
        },
        {
            "id": "hv8wpdp",
            "score": 0,
            "text": "Judaism is both because it can be your race (down to your dna) but not your religion.\nMy husband is 1% Jewish based on his DNA but it's not his religion. \nYou can also be Jewish in faith but have zero Jewish DNA.",
            "title_similarity": "0.59289706"
        },
        {
            "id": "hv91a82",
            "score": 0,
            "text": "I've always wondered \"why does it matter how they are classified?\" If we treat everybody the same, like we should, then nobody should care how themselves or others are classified.",
            "title_similarity": "0.36129907"
        },
        {
            "id": "hv99f1m",
            "score": 0,
            "text": "Race is a bullshit classification. We're all the human race and have vast varied ancestry. Jewish people only bred with other Jewish for a while .. but that is not how it's been for many years. Imo they are a religion not a race. You can find a black Jewish guy now. Is his race now Jewish?\n\nThis is like saying baptism is a race because a lot of baptists marry other baptists.\n\nOr Amish. Is Amish a race?  They certainly only breed with eachother.  \n\nThis is why race in general is a stupid thing to use to classify people.  It's a vaugue classification that doesn't have clear boundaries.  We are the human race. That's it.",
            "title_similarity": "0.6477374"
        },
        {
            "id": "hv99uco",
            "score": 0,
            "text": "In America, most Jews are white. But this is culturally dependent, and they weren't always white in America. My parents are from the Soviet Union. In the USSR, they were NOT white. Their passport said they were \"Hebrew\" and the universities had quotas (they only let in a certain number of Jews each year). They had distinctive Jewish features, so even though they were not religious, all their neighbors and teachers knew they were Jewish. As a result, my parents faced systematic discrimination in the Soviet Union and were raced as \"other,\" not white. Here in America, though, they are white. It hasn't always been that way, though. In the early 20th century, Jews were subject to university quotas and redlining, just like Black people. But as culture evolves, so too do understandings of racial classifications. Jews were non-white in the USSR, but most Jews are white in the US today. To the Nazis, the Jews were an inferior and different race. To them, the Holocaust very much was a racial issue.",
            "title_similarity": "0.5234935"
        },
        {
            "id": "hv9aqp5",
            "score": 0,
            "text": "Common ancestry is what makes a race. People who call themselves Jewish can usually tell you who their Jewish ancestors are. Through history it's been a relatively segregated lineage and so that ancestry is quite clear. Anytime someone can tell you in detail who their specific ancestors were from thousands years ago, that's a race.",
            "title_similarity": "0.66473556"
        },
        {
            "id": "hv9chwa",
            "score": 0,
            "text": "Ancient Judaism is an older religion, more akin to that of the Assyrians than the other two major Abrahamic religions. The Babylonians, for example, had a god named Marduk, and this god was the patron of their citystate, in turn, their culture and their influence was directly tied to that of Marduk.These ancient religions were a familial tradition that linked practices to tradition, rather than more inclusive, growth based religions, like Buddhism, Christianity, or İslam.\n\nYawei was originally a creation like this, specifically the guardian of the Hebrews, though when the Achaemenid Persians conquered Babylon and the Levant, Cyrus the Great allowed the Jewish people to travel back to the Levant, and reestablish their city state. From there, the Persians' dualistic/monalatric religion, Zoroastrianism, began to heavily influence Judaism. Religious syncretism took place, and the outcome is the canon of Judaism that we have, for the most part.\n\nAfter the destruction of the second Jewish temple, Judaism splintered into several sects, one of them, a Greek influenced sect, Christianity, and another long lasting sect, the rabbinical Torah oriented group, that led to modern Judaism. \n\nThe Jewish religion, in essence, became a kind of nationalism in absentia. This allowed the people to prevent full assimilation in the cultures they lived in, and in turn, allowed the culture to reincarnate in modern form, as an enthnostate. \n\nThis is why today, someone can be an atheist or an agnostic, while still identifying as Jewish. Judaism is a collection of traditions and myths just as much, if not more so, than a collection of beliefs.",
            "title_similarity": "0.5791985"
        },
        {
            "id": "hv9feus",
            "score": 0,
            "text": "TL;DR - because Jews are a tribe, whose social order predates and exists outside of Western social models.\n\nLonger:\n\nJudaism is more of a tribal identity than it is anything else. While Europe comfortably sorts things into \"religion\", \"culture\", \"politics\", \"economy\", etc. these days, that only really works as a self-reflection of its own society. Jewish traditions begin in bronze age Canaanite hill clans, formalized in the iron age. This is, put in simple terms, a thousand years before the Late Antique phase of various groups codifying themselves as \"religions\" (Christianity, Islam, Manichaeism) which had some sort of universal truth that *everyone* just absolutely *had* to follow. This sort of idea tended to be the result of a mixing of West and East, when Iranian salvationist dualism met with Greco-Roman universalism - though, as one might suspect, the Greeks and Romans did awfully like to force themselves on other groups - just through what they deemed their respective value systems (*Hellenismos* and *Romanitas*) instead of the concept of \"religion\" later on. Judaism was originally coined in opposition to *Hellenismos*, Greek civilization, and by its coinage simply means \"Judean customs\".\n\nThe internal phrase which has been since the 19th century treated in many groups as a calque of \"Judaism\" in the English sense - using outside definitions, notions, and worldview, to strictly refer to what one would consider the spiritual aspect of Jewish philosophy - is *\"Yahadut.*\" This is formed from \"yehud-\", ie \"Jew-\", and \"-ut\", essence. It is the essence of being a Jew, and historically (and in other communities today), it was(/is) used in a fairly different sense. Historic Judaism used the term *Yahadut* to refer to principles of ethics, behavior, and identity. Understanding Yahadut is key to understanding Judaism and its self-image.\n\nYahadut, presented in the classical sense, shares much in common with *Romanipen* for the, well, Romani, just as it shares much in common with traditional tribal value systems across the world. One did not follow Yahadut, one *possessed* it. It was a degree of belonging, it was \"Jewishness\". If you *had* Yahadut, you were a Jew. If you were born Jewish, descended from the Israelite clans, you had it by default, but certain actions (like willing conversion to Christianity or Islam) would make you lose Yahadut, because you were effectively turning your back on your own people and traditions to adopt those of outsiders, and not just outsiders, but the specific outsiders seeking to oppress, eliminate, and replace the Jews. This is why, although the adage goes that once a Jew, always a Jew, the community tends to vehemently reject Jews who convert or abandon all traditions, even as it accepts atheistic \"cultural Jews\" who maintain traditions for their own sake.\n\nContrarily, the conversion process (*Giyur*) is drastically different from conversion to Islam or Christianity. It's not a matter of simply changing what you believe, because there are non-Jews who believe Jewish theology called Noahides, because Judaism doesn't *ask* you to be a Jew unless you were born one. Many rabbanim customarily reject people requesting conversion several times to test their sincerity, and make them consider whether it is truly what they want. The process to convert to Judaism takes several years, and involves learning a new culture from the ground up - language, history, philosophy, and immersion in the community, then being judged by a council of elders - a rabbinic court in more 'common' parlance - on their worthiness. If they are deemed worthy, they are made ritually pure, and then are ritually reborn with a new name as a son of Abraham or a daughter of Sarah.\n\nWhen someone describes Judaism as being like a big family, this is what they mean. Far more than just raw beliefs (Maimonides attempted to write a list of \"Jewish principles of faith\" once upon a time, under pressure from the outside world to make Judaism conform to its understandings, and they haven't stuck particularly well compared to things like ethics and tribal law), Judaism is defined by one's relation to the community, the people. It is defined by the passing of traditions and wisdom from one generation to the next. \n\nIf you analyze indigenous American tribes, you will find similar social and historical patterns to what Jews have. Attempting to strictly delineate culture from spirituality from politics and economy is near impossible - just as Jews have elders, storytellers, and diviners/spiritual leaders in the form of rabbanim, hazzanim, and kohenim, who define the laws of the people, who tell the histories and stories, who arbitrated and redistributed goods like grains and fruits and, in later times, other aspects of material wealth. Just as Jews have Giyur, many of these nations of the Americas had their own systems - Sam Houston lived among a Cherokee band for 3 years, and in that time, adopted a new Cherokee name, would become an enrolled tribal member, and would marry a half-Scottish woman also enrolled in the tribe according to Cherokee customs. He remained a lifelong advocate for them, and other indigenous nations, before the US government, and within the Republic of Texas too.\n\nSo, what's the reason for this big mess? Jews have some certain clear analogues to groups that demonstrate English has the proper terminology for this sort of stuff, so what's the big idea? Well, the key difference is *familiarity.* European and Islamic civilization, but for our purposes discussing English terminology mostly the European part, have a much stronger familiarity with Jews over time than they do with many other groups. As Europe evolved its self-image and how it defined itself, the Jews were there every step of the way, never really fitting the paradigm, but persistent in their existence regardless. By the time people were coming up with words like \"chief\" or \"tribe\" to describe systems they didn't understand in new continents they hadn't seen comprehensively before, they already had made up words for all the stuff about Jews, and had defined Jewish society in their own terms for centuries, millennia even. That didn't stop them from noticing the parallels though: early (pre-Mormon) theories about indigenous Americans being the Lost Tribes of Israel stem from how many similarities were noticed despite the oceanic gap, and many of the atrocities inflicted against indigenous Americans had practice runs on the Jews first (reservations similar to ghettos or dedicated quarters; missions and forced conversion similar to Jews being forced to attend church by local governments, being forced into show trials of their own traditions, and also just straight-up forced conversions; indian boarding schools similar to the kidnapping, forced conversion, and enslavement of Jewish children by both Muslim and Christian governments, so on and so forth). Jews are sometimes called \"Europe's first colonized people\", and there's good reason for that.\n\nAlthough since the late 18th century (through what Jews call the Haskalah, but is conventionally known as the Jewish Enlightenment, where Jewish communities in Central Europe had to figure their place in the world as Europe changed its views of itself once again) there has been trouble with terminology especially, as new people would step forth and try to rewrite the paradigm to make the Jews more 'civilized' in accordance with European expectations, or to define them in European terms with Euroepan understandings, the actual way in which Jews understand ourselves hasn't fundamentally changed. It was this process that redefined Yahadut in certain communities from \"Jewishness\", to just being a calque of \"Judaism\". It was this process that invented the idea that Jews were \"just\" a religion, and from which the old Judenhass eventually gave rise to the new Antisemitism to reinforce the racial character of the Jewish alien, the, to quote, \"Palestinians among us\", the \"Woeful Asiatics\", the \"Arab horde\", as various Europeans have described us at one point or another in the 18th or 19th centuries. While the language surrounding Jews tended to solidify into what was comfortable for outsiders to compare themselves to, the Jewish self-perception continued more or less as before, to the point that now even many Jews struggle to actually explain what makes someone a Jew, and why Judaism is different in a fundamental way - they have been robbed of the proper vocabulary by the past couple centuries of pressure to conform to comfortable definitions.\n\nPut simply, Judaism is defined by one possessing Yahadut. One can be born with Yahadut, being descended from the Israelites, and one can lose it by turning against the traditions they passed down, abandoning them or turning outright hostile. One can also gain it through behavior, adhering to those traditions and participating in the community, which is what allows those born outside of the Jewish nation to join it.\n\nI'm not sure how ELI5 this is, exactly, but that's what the TL;DR at the top was for.",
            "title_similarity": "0.64514536"
        },
        {
            "id": "hv9k493",
            "score": 0,
            "text": "The question is why has America created a division based on the color of skin as an identifier.",
            "title_similarity": "0.65111566"
        },
        {
            "id": "hv9k9yt",
            "score": 0,
            "text": "Because it’s the only religion that doesn’t just take anyone. You have to be born into it or spend A LOT of time and energy begging to be let in and maybe they might let you. But it’s a religion that’s been heavily kept “in the family” basically",
            "title_similarity": "0.42395046"
        },
        {
            "id": "hv9ltjo",
            "score": 0,
            "text": "Race is a social construct so it doesn't adhere to specific criteria or if it does that criteria can change. Though one of the easiest ways to identify a race is skin color that is not the only criteria and it may not be the criteria at all for certain races. Jewish people are sect of people with or without their religion or skin color. They have cultural properties that are distinct. At the end of the day Nazis wanted to eliminate Jews largely due to racism so the Jewish people are a race because they were constructed to be one and unless the concept of race is removed from consciousness and is never thought of again, they will remain one.",
            "title_similarity": "0.59031546"
        },
        {
            "id": "hv9n7ew",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hvb21kk",
            "score": 0,
            "text": "I always thought Judaism was the religion and being from Jerusalem was the race. I guess that's not incorrect but not the full answer?",
            "title_similarity": "0.6836692"
        },
        {
            "id": "hvb4f8m",
            "score": 0,
            "text": "No such thing as race. Scientifically non-existent. They’re a religion made up of several cultures and ethnicities",
            "title_similarity": "0.5603072"
        },
        {
            "id": "hvb727c",
            "score": 0,
            "text": "It is not. Jewish is nation. Judaism is religion. Jehudi is religious people. Semite is a race.\n\n Confusion only happens in usa and some random places in Europe mostly because of nazi mixing those up. It is the same as with Japanese and shinto. Most shinto are Japanese and some Japanese are shinto, but it is not the same.",
            "title_similarity": "0.6307026"
        },
        {
            "id": "hvbbkou",
            "score": 0,
            "text": "Hey Whoopi, loved you as Guinan.  Take my advice: skip Star Trek: Picard, or if you are already contracted, fire your agent and when the director asks you to pick up a flamethrower or perform a self-critical polemic on your identity as a fellow traveller of the federation, feign covid symptoms and then fake your death in a plane crash (maybe a medical evacuation plane, I don't know, I'm sure you've done improv).",
            "title_similarity": "0.26649165"
        },
        {
            "id": "hvbbvbq",
            "score": 0,
            "text": "Because people are too afraid of being seen as a racist or other sort of bigot by pointing out that Jewish isn't actually a race.\n\nThey are afraid of this because other people have poor communication and critical thinking skills and **will actually** see it as a slight toward a historically persecuted group and will form a mob against them.",
            "title_similarity": "0.40164277"
        },
        {
            "id": "hvbgndj",
            "score": 0,
            "text": "Race is a made up concept. They were othered, and the easiest way to do so is saying they're a different race.",
            "title_similarity": "0.40807995"
        },
        {
            "id": "hvblwzy",
            "score": 0,
            "text": "I'm Jewish, I have grandfather's who both survived and fought during the Holocaust. I mention that because I've learned a lot about that time from them. I want you to picture the characterization of Black and Hispanic people in the past few years, things like comics and memes mostly used by racist people. Much like that people projected cartoon-ish stereotypes to Jewish people, they've done it for a long time. The Holocaust wasn't even the first Holocaust targeting Jews. We are a race I think not just because our ancestry being distinctive but because our appearance has often been stereotyped and discriminated against. I would never want to compare another races discrimination and pain but if you have a hard time understanding the race/ religion aspect I would say you could compare the racial prejudice against Black's during the Civil War with its propaganda comics to the same ones Nazis put out against Jews...also most other religions aren't so persecuted and you're not considered a Catholic if you don't practice catholism, but if you look Jewish and have a Jewish name even if you don't practice the religion you are treated the same if approached by someone who stereotypes jews, even if they're friendly. I've heard I must be good with money, told Jewish jokes, told my nose isn't that big or that it's obviously Jewish, asked if I have sex through a sheet, and given lectures on Israel and Palestine, my friend is trying to join a country club because he loves golf and has to prove he's not Jewish because his last name ends in -owitz. It flies under the radar but is very pervasive and shouldn't be dismissed.",
            "title_similarity": "0.5342754"
        },
        {
            "id": "hvblxy1",
            "score": 0,
            "text": "Fantastic ELI5 for “race is a social construct” \n\nBasically you can go to any person and say - so what race are you, and what race are “they” - those other people? There are no universal, immutable or timeless answers. It is all very contextual to person, place, and time - i.e. the ideas of that particular society.",
            "title_similarity": "0.5330862"
        },
        {
            "id": "hvcez3t",
            "score": 0,
            "text": "What about Zorastrianism? I thought they were fairly inclusive but their numbers were decimated due to people converting to not pay the Jizya under the many Caliphs. To my knowledge there's only a few hundred thousand left.\n\nEdit: Just to clarify the converting process of Zorastrians wasn't unique, many Christians, Buddhist and Hindi also converted because at the end of the day a lot of people value their money over their faith or they're one in the same.",
            "title_similarity": "0.41694263"
        },
        {
            "id": "hvcl6q3",
            "score": 0,
            "text": "Because race isn’t a real thing so it can be anything you want it to be. Let’s be real- yes, we have different ad-group mixtures of genes that VERY loosely tie to appearance and geographic origin but race cannot be precisely defined because there is no objective genetic absolutes to define it. We’re simply too mixed up in too many ways we barely understand because we are ONE species. Race is an absurd, fictional, category entirely invented to rationalize the Transatlantic slave trade. Don’t get it twisted- like many stupid ideas humans have come up with the fictional concept of race has real world impact on peoples lives up to, and including, impacting how sick they get and when they die but race itself is a fiction.",
            "title_similarity": "0.5198181"
        },
        {
            "id": "hv8ytfz",
            "score": -5,
            "text": "Because they want to see themselves above the rest of us. They are human, like the rest of us, no different.",
            "title_similarity": "0.25285268"
        },
        {
            "id": "hv8qr71",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8fr4n",
            "score": -1,
            "text": "Race and ethnicity are all social constructs created by the powerful to suppress the weak. https://youtu.be/n8ysHnbDQ50",
            "title_similarity": "0.49414948"
        },
        {
            "id": "hv8nnzm",
            "score": -1,
            "text": "If your mom isn’t Jewish you aren’t really a “Jew” by many counts. Religiously you can be but the assumptions are that you “marry in” to the culture. If your dad is a Jew and your mom isn’t you aren’t really a “real” ethnic Jew by many calculations.",
            "title_similarity": "0.61344475"
        },
        {
            "id": "hv8wnl6",
            "score": -1,
            "text": "There’s no such thing as races of people.  There’s just cultures, and those cultures encourage certain ways of thinking, like american culture encourages splitting humans into races for offensive reasons, and jewish culture is fine with apartheid on people from Palestine and inbreeding.",
            "title_similarity": "0.5610023"
        },
        {
            "id": "hv92igf",
            "score": -1,
            "text": "These classifications (race and religion) are both man-made constructs. Neither exist outside of peoples personal (or learned) views and so they can be anything that you want them to be.\n\n99.9% of the human genome is common between people we currently say are from different \"races\". Do you consider a black labrador to be a different race to a golden lab? Nope! There are no subspecies of the domestic dog species (eg: poodle versus labrador) despite their significantly different morphology (shapes), so why would anyone think that humans have a classification based on colour and a few superficial differences. If you can accept that a white person born in USA who has a specific birth trait (such as Downs Syndrome, dwarfism,  etc - or one who simply looks like Zuckerburg) as a member of the one \"race\" of the human species, then why does colour even come into the equation?\n\nReligion is simply the same. But worse. According to this concept, you may be a Catholic christian, but according to the Christian Church of the Wonderful Blessed Be (eg) then you will be going to Hell and only those who can sing through their ass will be \"saved\"",
            "title_similarity": "0.4560508"
        },
        {
            "id": "hv92uno",
            "score": -1,
            "text": "Honestly the concept of race is ignorant to begin with, but based on the ideas that current define race within our society Jewish cannot be a race only because there are Jewish folks from multiple different backgrounds.",
            "title_similarity": "0.69547135"
        },
        {
            "id": "hv94cpe",
            "score": -1,
            "text": "That's not all. It's also classified as a political position, unfortunately.\n\nAnd the reason it's done like this is the deliberate intent to confuse the discourse.\n\nIf you aren't a fan of the Israeli government, you get accused of being a racist antisemite.\n\nIt's a rhetorical smokescreen.",
            "title_similarity": "0.55779564"
        },
        {
            "id": "hv94tci",
            "score": -1,
            "text": "Essentially you can be born Jewish and practice Judaism, or not practice the religion but still be the ethnicity. You can also convert to the religious practice without being born of Jewish descent, though this takes time and isn’t always approved by the religion.",
            "title_similarity": "0.5693066"
        },
        {
            "id": "hv9b53o",
            "score": -1,
            "text": "Race does not exist. Or I should say, there is the human race and that is it. \n\nThere is only one race of humanoids left on earth.",
            "title_similarity": "0.31041792"
        },
        {
            "id": "hv9gesh",
            "score": 1,
            "text": "The origin of your question really speaks to what Judaism is and who Jews are.\n\nThere are other responses here that explain things nicely, but let me frame things for you clearly here.\n\nThe Jewish people (tribe of Judea) existed BEFORE the Jewish religion. This means peoplehood predates the religion the people follow! Judaism is the religion that the Jewish PEOPLE follow, which came later in history (still a very long time ago). This means that Jews even today, 3000+ years later, still identify both as a religious group and as a \"people\". We have many words to describe what a \"people\" is, but it takes the form of many things ranging from nation, tribe, ethnicity...depends on the point in history and what words were fashionable at the time. If you can approach the OPs question with this perspective, you will find your annswers more easily.\n\nEDIT: Jews generally use the term \"people\" and not \"race\" or \"ethnicity\" or even \"religion\" (in many cases) to describe themselves. The word \"people\" is broader and encompasses all those terms in one. There is still a debate as to what the phrase in Hebrew \"Am Yisrael\" exactly referred to at the time it was written.",
            "title_similarity": "0.6913048"
        },
        {
            "id": "hv9iuk4",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv9orm8",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8h504",
            "score": -6,
            "text": "It shouldn’t be a race like any other religion.  Seems we have have revised a lot of terminology via revisionist that are false but support their narratives.",
            "title_similarity": "0.5382812"
        },
        {
            "id": "hv9p4ku",
            "score": 2,
            "text": "Any answer besides “It’s an arbitrary distinction” is just giggle gabble. There are lots of insular groups with distinct bloodlines that we don’t refer to as distinct races. \n\nHistorically the Jews viewed themselves as a race, and historically most people found that convenient, because “racism” is easier than “anticulturalism” or whatever you want to call it.\n\nIt gets really fraught when you end up with “ethnic” Jews who be aren’t religiously Jewish, and don’t fall in line with the majority of the cultural practices. \n\nSince the “race” is primarily typified *by* their cultural and religious practices, it’s not clear how that’s any different from someone identifying with their country of origin (e.g all the Americans who are “Irish” on Saint Patrick’s Day), and not clear how they’re  racially different when the only way anyone could tell is if they told you.",
            "title_similarity": "0.5804357"
        },
        {
            "id": "hvb44bp",
            "score": 2,
            "text": "The best answer is that Jewish religion has as a commandment that you should marry another jew. \n\nBecause of this, Jewish religion tends to preserve the ethnicity of its members. \n\nThere are 5 or six different related ethnicities under the umbrella of \"judaism\". Each ethnicity has a lightly different religious tradition.\n\nAs intermarriage has skyrocketed, there is a fracturing of what is \"Jewish\" in the sense that people are taking the part of the tradition that is important to them and still calling themselves \"Jewish\".\n\nEspecially in America, most people have only partial Ashkenazi ancestry and often have little to no religious upbringing.",
            "title_similarity": "0.63611484"
        },
        {
            "id": "hvbf1ek",
            "score": 2,
            "text": "You are going to get a bunch of answers that will try to make it sound nice but the bottom line is that to be a jew your mother has to be a jew. And the only way for your mother to be a jew is to have her mother be a jew. It's 100% about mitochondrial DNA line, not about your beliefs. If you don't follow the religion, you might be a bad or non-practicing jew but nobody will ever say you are not jewish. On the other hand most people will not consider you to be a jew if you are say an african convert to judaism.",
            "title_similarity": "0.5658426"
        },
        {
            "id": "hv9ivf7",
            "score": 3,
            "text": "Judaism is an ethno-religion, that is, both a nation/ethnicity and a religion. Unlike religions such as Islam and Christianity which seek to recruit new followers and are reliant solely on belief, the jewish people are a nation, relying on factors such as ancestry, shared history, and culture, and usually doesn't accept converts.\n\nThis is why, in the holocaust for example, people were oppressed and killed by Nazis just for having a jewish grandparent; you can be agnostic or atheist, and still be jewish.\n\nIf this sounds confusing, consider the fact that religion as we consider it today is a western term that was [coined only a few centuries ago](https://en.wikipedia.org/wiki/Religion#Religion_and_religions), and often fails to fit itself to or encapsulate non-western or ancient religions.\n\nFor other ethno-religions, look up the [Druze people](https://en.wikipedia.org/wiki/Druze), for example.\n\n------------\n\nThe term Jew isn't offensive at all! What can be offensive is the context. There's a big difference between \"He's a jew\" and \"He's a.. *jew.*\" In the same way like how certain people unfortunately use \"gay\" as an insult, even though the word itself is neutral.",
            "title_similarity": "0.6652195"
        },
        {
            "id": "hv9it5h",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8uzy1",
            "score": 66,
            "text": "The same way that English can be a nationality and a language - the same term referring to different categories. \n\nThe idea of a Jewish race in particular is a delicate matter - among Jews and others - for a variety of reasons.\n\nSome don't want to use the term because:\n\n* They don't believe race exists at all, therefore the term \"Jewish race\" is incoherent. \n\n* Regardless of whether it is coherent or not, the term can be used to justify prejudice against and persecution of people; therefore it should be avoided.\n\n* The term race has been used to persecute the Jewish people in the past; e.g. Hitler was evil, Hitler regarded the Jews as a race, regarding the Jews as a race is evil.\n\n* They believe it reduces a diverse, global population of loosely associated groups to a single monolith, with weak justification.\n\n* They don't believe the Jewish race has had experiences which justify treating them the same as other persecuted putative races in history.\n\n* It can lead to ideas about of Jewish racial supremacy or grand conspiracy.\n\nSome want to use the term because:\n\n* They believe denying that the Jewish people are a race is tantamount to denying their existence entirely, or reducing it to arbitrary distinctions. That is, they believe the genetic element of the population is non-trivial.\n\n* They believe avoidance of the term denies the reality that Jews are treated as a race, irrespective of the validity of the presuppositions which drive such behavior. i.e. to say Jews are not a race is to deny they are subject to racial prejudice. \n\n* They believe that by identifying the Jewish people as a race, they will receive the protections and considerations offered to other putative races.\n\n* They believe there is a vein of Jewish racial supremacy or a grand conspiracy, and wish to identify what they regard as a enemy.\n\nSome take up a lateral position, and prefer:\n\n* To use the term ethnicity as a euphemism for race, referring to mostly the same thing but focusing on heritage/lineage rather than outward appearances. \n\n* To use the term ethnicity as a euphemism for race+culture, without being too particular about either in order to avoid unnecessary conflict. \n\nSo whether they should be classified as a race is a point of debate. \n\nReligion, on the other hand, is self-explanatory. There is a Jewish religion; for most varieties of it, you can join regardless of whether you share a genetic link with Jewish populations or not.\n\n**E:** Formatting",
            "title_similarity": "0.6384967"
        },
        {
            "id": "hv8joj3",
            "score": 306,
            "text": "As other people stated, judaism is an ethnoreligion. It's not the only one but obviously the most well known.\nReasons it is an ethnoreligion: 1) Judaism is an ethnicity, so you are born Jewish if, depending on who you ask: either only your mother or either parent being Jewish. 2) it is a religion, Judaism follows a diety and has rules just like any other religion. You can convert and become Jewish, which according to Jewish laws, makes you fully Jewish and every other Jew should treat you the same as if you were born Jewish.3) Judaism doesn't really believe in converting to other religions, sure you can do it or just not believe, but you and your children will/are supposed to be very welcome and encouraged to come back to the faith. As even if you are practicing another religion, you are and always will be a Jew and can go back anytime without a need to convert",
            "title_similarity": "0.6583212"
        },
        {
            "id": "hv87g7n",
            "score": 13954,
            "text": "Jews are an ethnoreligious group, meaning that they are both an ethnicity (a group identified by common group identity and, usually, language and ancestry) *and* a religion (a group with the same beliefs about the supernatural). They're not the only one, but they're the most prominent in modern affairs because they happen to be the only one with a distinct (and relatively influential) world government [edit: see the section below on the use of \"world government\" here]. By contrast, Italian people are not an ethnoreligious group. They're an ethnic group (shared heritage, ancestry to some extent, and language), but their religion (Catholicism) isn't associated with their ethnic group (they share it with Hispanics, among others).\n\nThe reason for the difference is that, historically, Jews did not preach their religion to non-Jewish people, and largely intermarried with other Jews (or left the community as a whole when they didn't). So even though they lived in places where other ethnic groups lived too, they stayed a separate population both culturally and genetically. They certainly had some influence from their surrounding culture, which is why subgroups of Jewish culture exist today (Ashkenazi from Germany, Sephardi from Spain, Mizrahi from Asia and North Africa, and so on), but they stayed mostly separate from it and thus maintained their own identity for many thousands of years.\n\nChristians, Muslims, and Buddhists, on the other hand, *did* actively preach and teach their religions to other groups of people. So even though the original Christians were from what is now Turkey, Greece, Syria, and Israel, they preached their religion across the Roman Empire and eventually carried it to totally different groups of people (like much of modern Africa) through colonialism. Similarly, Muslims began with Arab populations in what is now Saudi Arabia, but the early Islamic empires carried Islam as far as Indonesia in the east and Spain in the west.\n\n-----\n\nEDITs:\n\n* I said \"much* of modern Africa. I'm aware that some Christians existed in Africa prior to the colonial era, but most African Christianity does descend from colonialism (particularly in West Africa).\n\n* A lot of people have asked why Jews didn't evangelize. The reason is that the Judaism preaches that the Jews, as an ethnic group, have a special relationship with Yahweh, the Jewish god (who Christians and Muslims identify as their god as well). That relationship is explicitly with the descendants of Abraham, believed to be the patriarch of the Jewish people through his son Isaac, his grandson Jacob, and ultimately his great-grandson Judah (whose name is the origin of the word \"Jew\" in the first place).\n\n* When I say \"world government\", I don't mean some illuminati \"Jews rule the world\" conspiracy. I just mean that Israel is an important state on the world stage. Israel is a \"world government\" in the same way that France or the US is.\n\n----\n\nThere's a lot of people asking about the term \"race\". The differentiating factor between \"race\" and \"ethnicity\" is that race is often applied from *outside* of a group and tends to be more about *features* than it is about group identity or how individuals think of themselves. \n\nFor example, a person descended from the Yoruba (a West African ethnic group found mostly in Nigeria) and a person descended from the Zulu (found thousands of miles away in South Africa) are from entirely different ethnic groups. They probably speak different languages, they have different worldviews and histories and ancestral religions and traditions, and they certainly would not (by default) have thought of each other as being part of the same group. But in American racial categorization, both would be categorized as \"black\" because both groups have dark skin. The same goes for, say, a Yamato person from Japan and a Miao person from southern China (both \"Asian\" in US categorization), despite the two sharing very little heritage aside from both having been influenced by Imperial China.\n\nOn the flip side, people of French descent are considered \"white\" in American categorization while people of Spanish descent are \"Hispanic\", despite speaking very similar languages and being relatively close to one another ancestrally. And that categorization shifts, too: French people get grouped with their much more distant cousins in Finland as \"white\", but that wasn't always so.\n\n*Some* racial groups are also ethnic groups (this is the case for most Jewish populations, who do tend to be genetically distinct from the surrounding population). But race is a social categorization that need not follow genetic lines, as we saw with the Yoruba and Zulu a moment ago. In some cases, racial ideas can be so influential that it wraps back around to being an ethnic categorization again, as (slave-descended) black Americans form a pseudo-ethnic group that largely *do* share a common cultural heritage as a result of their historical categorization and treatment within the US.\n\nMoreover, racial categorizations often differ between countries. A Japanese person would not consider a Korean person to be part of the same group as them and vice-versa, even though both are \"Asian\" in American categorization. Similarly, an American and a Frenchman don't think of themselves as part of the same group, but a Chinese person would probably not differentiate the two very strongly (except perhaps by language).\n\n-----\n\nEDIT2: A number of people are bringing up Jewish groups with non-Hebrew ancestry and claiming that this makes Jews not an ethnic group. This is not the case. An ethnic group often, but not always, has shared ancestry. To use Wikipedia's definition of the term:\n\n> An ethnic group or ethnicity is a grouping of people who identify with each other on the basis of shared attributes that distinguish them from other groups. Those attributes **can** include common sets of traditions, ancestry, language, history, society, culture, nation, religion, or social treatment within their residing area. Ethnicity is sometimes used interchangeably with the term nation, particularly in cases of ethnic nationalism, and is separate from the related concept of races.\n\n> Ethnicity may be construed as an inherited or as a societally imposed construct. Ethnic membership tends to be defined by a shared cultural heritage, ancestry, origin myth, history, homeland, language, or dialect, symbolic systems such as religion, mythology and ritual, cuisine, dressing style, art, or physical appearance. **Ethnic groups may share a narrow or broad spectrum of genetic ancestry, depending on group identification, with many groups having mixed genetic ancestry.** Ethnic groups often continue to speak related languages.\n\nJews around the world, regardless of their ancestry, identify with one another on the basis of shared traditions, culture, and religion (and to some extent language, since most Jewish communities use Hebrew in religious/cultural ceremonies even if they don't day to day). They are, therefore, members of a common ethnic group despite their distant ancestries.\n\n----\n\nEDIT3: Hi, people new to ELI5, I see this thread's got legs. Let me just direct you over to the sidebar:\n\n> LI5 means friendly, simplified and layperson-accessible explanations - **not responses aimed at literal five-year-olds.**\n\n----\n\nEDIT4: To be clear, this is a simplified, basic introduction to these ideas - you'd find this material covered over a couple of pages of any introduction to anthropology. Like most introductory material, this is not covering some of the weird exceptions, debate within the field, fuzziness in definitions, or the many ways in which these ideas interact with others. **This is not the whole story**, and please don't walk away from this (or any Reddit post) thinking so - go take a class if you want to know more.\n\n----\n\nEDIT5: A summary of \"race\" vs \"ethnicity\":\n\n* Ethnicity is about members of a group identifying with one another through some sort of shared cultural threads. Members of any culture (unless they disagree on the facts of how two people think of each other) will more-or-less agree on whether or not any two people are of the same ethnicity. \"Jewish\", \"Italian\", and \"Han Chinese\" (but not just \"Chinese\", which is a national group but **not** an ethnic one because there are non-Han Chinese people) are ethnic groups.\n\n* Race is groupings used within a large culture to subdivide people into groups based on appearance. It's based on appearance, not identity, and is often applied to a group of people by other groups of people. Members of different cultures often disagree on racial classifications.",
            "title_similarity": "0.5801173"
        },
        {
            "id": "hv8pyx2",
            "score": 99,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv961o8",
            "score": 86,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8nb7j",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv8g30l",
            "score": 1,
            "text": "If you have instagram there is a page called \"you don't look jewish\". I think its pretty educational and interesting in general.",
            "title_similarity": "0.41634256"
        },
        {
            "id": "hv8m1t7",
            "score": 1,
            "text": "Not knowing my natrual heratige, I had  a DNA test a few years ago and part of the results came back part  Ashkenazi Jewish and also part  Yemeni Jewish. While I can sort of  understand the region being localised within the DNA results ,I'm at loss to understand how a religious group would have specific/recognisable DNA?.",
            "title_similarity": "0.6394113"
        },
        {
            "id": "hv8nu3m",
            "score": 1,
            "text": "\"Race\"/ethnicity: your mum was a Jew. What religion you believe in, or don't, does not matter\n\nReligious: you've gone through the religious rituals required to be a Jew and believe in Judaism",
            "title_similarity": "0.6634402"
        },
        {
            "id": "hv8qeuf",
            "score": 1,
            "text": "And a culture!\n\nI was adopted by a non-observing family, and I still (somewhat) identify as Jewish. Israel accepts adopted children in their 'right to return' as well. \n\nSo I guess all it really takes to be Jewish is for your grandmother to yell at you in Yiddish.",
            "title_similarity": "0.5174551"
        },
        {
            "id": "hv8qrou",
            "score": 1,
            "text": " No contribution has managed to say why Jewishness is a race. Perhaps a culture arising from a common religion.\n\nRace arose  as a simplistic and lazy classification based on a single visible characteristic Skin color.\n(Dark, pale, yellow, red,).\nHow are Jewish people a race?",
            "title_similarity": "0.78382134"
        },
        {
            "id": "hv8rduo",
            "score": 1,
            "text": "“Is it better to be born Jewish, or to adopt such a religion through great effort?”\n\n-Parthurnaax probably",
            "title_similarity": "0.74457127"
        },
        {
            "id": "hv8rj4e",
            "score": 1,
            "text": "Because it's the word for belonging to that ethnicity and also the word for belonging to that faith.",
            "title_similarity": "0.5254064"
        },
        {
            "id": "hv8rwr5",
            "score": 1,
            "text": "It's just different things with the same name, no? 🤣",
            "title_similarity": "0.36240387"
        },
        {
            "id": "hv8te18",
            "score": 1,
            "text": "When I was in middle school my mom converted us to Judaism. We have no Jewish heritage. When I was 20 I left the religion. So now I'm zero percent Jew. Had I been born into it I would still technically be Jewish in the eyes of the Jewish community, but a non practicing or non believing one.",
            "title_similarity": "0.51743263"
        },
        {
            "id": "hv8thbn",
            "score": 2,
            "text": "OP, are you Whoopi Goldberg using an alias on Reddit because you have two weeks of free time on your hands?!?",
            "title_similarity": "0.40949225"
        },
        {
            "id": "hv8v15j",
            "score": 1,
            "text": "Jewish isn’t classified as a race. However, Jews can experience racism. This is because religion can be used to racialize people. In white-Christian America/ Europe, many Jews are often othered from the white race on the basis of their religion. A lot of the racial groups we have in the US at least can be traced back to dehumanization of indigenous/ black slaves due to the religious  superiority the white-Christian settlers. While racism today is often due to skin color/ facial features etc, that original form of racism via religion  still exists today.",
            "title_similarity": "0.6435901"
        },
        {
            "id": "hv8x0fl",
            "score": 1,
            "text": "Judaism views itself as a covenant with God (the other abrahamic religions have this view, theologically, but it is emphasized less) and the covenant is between God and Abraham and his descendants, so they are a religion, but also an ethnic group which describes the \"descendants of Abraham\" to whom the covenant should (theologically) apply.",
            "title_similarity": "0.6413386"
        },
        {
            "id": "hv8xmik",
            "score": 1,
            "text": "There are ethnic Jews; people who share a culture and ancestry.\n\nThere are also religious Jews; people who practice Judaism.\n\nA bunch of ethnic Jews are also religious Jews.\n\nNon-ethnic Jews can convert to Judaism if they want to. It happens.\n\nBiologically speaking, there's only one human race, but culturally speaking people use ethnicity and ancestry to assign \"races\" to people.",
            "title_similarity": "0.73601204"
        },
        {
            "id": "hv8z5u3",
            "score": 1,
            "text": "Why?  because as a species we are flat out terrible at defining and categorizing things.\n\nThe problem is we behave as if these definitions we come up with are perfect and the categories are faultless  but no they are sloppy. We get caught up on these ill fitting definitions because they are considered good enough.\n\nThis good enough mentality is all over the place\n\nUsing the  racial definition of a Jewish person inadvertently means that the Ethiopian Jews cannot be classified as Jewish due to their different racial background.\n\nMy point is take all with a grain of salt.",
            "title_similarity": "0.46674764"
        },
        {
            "id": "hv90nua",
            "score": 1,
            "text": "We lived only among our own for thousands of years, and therefore only really mixed genes with other jews, so over that time, most Jews ended up with a few distinct common features.",
            "title_similarity": "0.45250878"
        },
        {
            "id": "hv91445",
            "score": 1,
            "text": "Practicing Judaism: religion. Being from or having ancestry of Jerusalem: ethnically Jewish. (I think) you can be both or just one or the other.",
            "title_similarity": "0.7493102"
        },
        {
            "id": "hv93sc4",
            "score": 1,
            "text": "I think what matters most is that the Nazis considered the Jewish people as an inferior race, and used racism to justify genocide. And today, white supremacist groups in the U.S also consider Jewish people as a separate, inferior(but also rich and powerful) race, and are using racism to justify violence.",
            "title_similarity": "0.563948"
        },
        {
            "id": "hv99yrb",
            "score": 1,
            "text": "First off, let me start with the term \"race\", especially in the American context is bullshit and has no scientific background. \n\nSecondly, Jewish is not a \"race\", it's an ethnicity; while this ethnicity also has sub-groups like Ashkenazi, Radhanite, Sephardim etc. On the other hand, Judaism -mostly- is an ethno-religion followed by the ethnic Jewish people, therefore people who follow the religion also are called Jewish. However there are people who are not ethnicly Jewish, yet still follow the Judaist teachings and are called Jews in the broader sense: Krumchaks, Karaites, Khazars, Falasha, Igbo etc (at least two of these ethnicities are of Turkic descent, while others are from Ethiopia and Nigeria). \n\nIn the American context Jews have their \"seperate race\" probably mostly thanks to their influential position in the society, since they are ethnicly close relatives of Arabs (so they should be within the same group as Arabs, if this \"race\" term is really applied scientificly) while they have a variety of fenotypes which could fit in Middle Eastern, Caucasian, Hispanic, and even Asian if we consider the small groups I mentioned above (making this American \"race\" concept bullshit, again). \n\nIn short, who is called who:\n\n- Jewish: Member of the ethnic group, not necessarily following the religion\n- Jewish: Follower of an Abrahamic religion, not necessarily belonging to the ethnic group\n- Jewish: Citizen of State of Israel, not necessarily following the religion",
            "title_similarity": "0.71347016"
        },
        {
            "id": "hv9cfvb",
            "score": 1,
            "text": "Very simple answer: Because \"race\" is kinda bullshit anyway when you look at it from genetics. \n\n[Cavalli-Sforza](https://de.wikipedia.org/wiki/Luigi_Luca_Cavalli-Sforza) made a compelling argument against it, because essentially in simple terms because when a human with light skin and a dark skin one can be closer related then a dark skinned one and dark skinned one, the concept of race as it is, is bullshit.",
            "title_similarity": "0.50254464"
        },
        {
            "id": "hv9dxhw",
            "score": 1,
            "text": "One more thing to add. A criticism of the politics and polices of the Israeli government has nothing to do with racism or anti-Semitism. Not that there aren't racists and anti-Semites that also criticise the Israel. But one can also do it without any hate towards Jewish ethnoreligious group.",
            "title_similarity": "0.41962105"
        },
        {
            "id": "hv9f3g8",
            "score": 1,
            "text": "Judaism is largely a set of rules to live by. Jews formed seperate communities where they could follow those rules. In those communities, they only married other Jews. \n\nThese communities were so seperate that some areas had them collect their own taxes and do other governmental functions. \n\nThis formed an isolated ethnic group.\n\nThe Nazi standard is one Jewish grandparent. In reaction to the Holocaust, some areas still follow that standard in providing aid to Jews.",
            "title_similarity": "0.55137974"
        },
        {
            "id": "hv9fomx",
            "score": 2,
            "text": "Why are low intelligent people so obsessed with race?",
            "title_similarity": "0.4796623"
        },
        {
            "id": "hv9fona",
            "score": 1,
            "text": "It’s just a legal thing. Legally? They’re both, scientifically? It’s not a race. \n\nHowever, hitler and the nazi party viewed them as an inferior race anyway, so it was about race",
            "title_similarity": "0.51756287"
        },
        {
            "id": "hv9g87n",
            "score": 1,
            "text": "Thank you, OP for asking this. \nI literally went to bed last night asking myself this exact same question and now I just woke up to the answer on my home page. \nLife is wild sometimes.",
            "title_similarity": "0.16685331"
        },
        {
            "id": "hv9gjj4",
            "score": 1,
            "text": "It might be a good idea to ask why is anything considered a race. The divisions between races seem arbitrary.",
            "title_similarity": "0.58876884"
        },
        {
            "id": "hv9gq6e",
            "score": 2,
            "text": "The whole Nazi ideology was about the superiority of Arian race, which the Nazi identified with. So the inferior races - non-Arian ones - should be eliminated. This applied to the European space, the \"Lebensraum\" of the 3rd Reich, which Nazi had to clean from such \"Untermensch\" (subhuman) like Jews, Gypsies, gay, handicapped persons. So, yes, the Nazi was about race, even though it didn't include the current racial landscape from the US.",
            "title_similarity": "0.52555156"
        },
        {
            "id": "hv9k5nv",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hv9kmj5",
            "score": 1,
            "text": "I wouldn't think it is. I see it as there are Jewish people, there's no Jewish race. If someone was to convert from Judaism for Christianity would they still be considered Jewish?",
            "title_similarity": "0.69775784"
        },
        {
            "id": "hv9kond",
            "score": 1,
            "text": "I have a small question. How does the Jewish inheritance work. It’s a little bit confusing, because a girl I know in my class (she’s Jewish) told be that you can only inherit the “Jewish gene” from your mother. And that statement made me super confused. Is that really the case?",
            "title_similarity": "0.58467364"
        },
        {
            "id": "hv9ptoc",
            "score": 1,
            "text": "The same with Amish and Mennonite’s and Hutterites for the most part. Most, but not all are ethno religious",
            "title_similarity": "0.4385622"
        },
        {
            "id": "hv9ru18",
            "score": 7,
            "text": "Judaism is focused around the Jewish people - their history, and (in the religion) God's promises for their future.  In the religion, the Jews are God's \"chosen people.\"  Abraham is a key figure, with God making a covenant with him for his descendants, for a \"promised land.\"  The religion is inextricable with lineage.\n\nThis tight relation between religion and tribe may have been common among other tribes in the ancient world.  But most tribes would probably adopt the religion of any nation or empire that they joined or were incorporated into, possibly adding their own gods in a polytheistic practice.  (In Game of Thrones they often swear by \"the old gods and the new.\")  Judaism is a rare case in remaining distinct.  \n\nTribal / cultural religions also won't tend to spread and grow beyond the size of that tribe.  They won't preach to other groups and try to get them to join.  That kind of religion isn't intended for outsiders.  \n\nOther world religions tend to have a moral or philosophical basis that isn't tied to a race.  For Christianity, you have to believe in Jesus Christ to take away your sins.  For Buddhism, you have to follow the Buddha's teachings.",
            "title_similarity": "0.6160954"
        },
        {
            "id": "hv9x46s",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.16429877"
        },
        {
            "id": "hvalqgt",
            "score": 1,
            "text": "The Nazis did a lot of that, referring to the Jews as a race over and over again.\n\nRace is a social construct, so it's basically whatever who's in charge of society wants it to be.\n\nPretty much the same way Google chooses what comes up in your search results. It's all determined by a series of choices made by humans.",
            "title_similarity": "0.5872147"
        },
        {
            "id": "hvalxst",
            "score": 1,
            "text": "I find an easy analogy for gentiles is an indigenous tribe/nation like the Navajo. If you stop believing in Navajo religious beliefs, you're still Navajo. You're born Navajo/Jewish and you will die Navajo/Jewish.",
            "title_similarity": "0.5173138"
        },
        {
            "id": "hvamhad",
            "score": 1,
            "text": "I will add that ignoring the answer to this question is not a cause for reprimand or punishment. What happened to Goldberg is sad,, although she works in a position that she should know that very word she says counts. But people who have no clue about the answer for this question should not be punished.",
            "title_similarity": "0.26995265"
        },
        {
            "id": "hvao8cb",
            "score": 1,
            "text": "They’re like Mandalorians from Star Wars.\n\nMandalorians can come from the planet Mandalore. So, by birth, those people are Mandalorian.\n\nMandalorians can also be adopted into the Mandalorian creed, no matter their background, if they are willing their beliefs. So a guy from Corellia or Naboo could be a Mandalorian.\n\nIsraelites and Hebrews, and their descendants, are ethnically Jewish. A black guy from Fresno can convert and be Jewish. You can have ethnic Jews who don’t practice Judaism as well.",
            "title_similarity": "0.68357295"
        },
        {
            "id": "hvaq4i1",
            "score": 1,
            "text": "jewish in DNA is time in a location...regions. It actually makes jewish a bigger group than many do not realize. I learned what jewish is as my native american DNA gets mixed up with it. northeast usa... google it. I don't want to explain it. Anyone can be a race and religion.",
            "title_similarity": "0.7049722"
        },
        {
            "id": "hvatxyl",
            "score": 1,
            "text": "A giant group of people known as Israelites all had the same religion. The Israelites consisted of 12 tribes. Eventually their country split into two parts. One of those parts was predominantly from the tribe of Judah. Judah kept practicing the original religion. The other part didn’t and was gradually over time absorbed by surrounding cultures/religions. The kingdom of Judah became known as the kingdom of the Jews. Their religion also became known as the Jewish religion. Again because it was practiced primarily by the tribe of Judah.",
            "title_similarity": "0.61297524"
        },
        {
            "id": "hvax2e5",
            "score": 1,
            "text": "As the top poster points out, Jews are an ethnoreligious group. An ethnicity and a religion, and sometimes Jews as individuals choose one but not the other.\n\nHowever the idea that Jews are a race? That is an idea invented by anti-Semites.",
            "title_similarity": "0.7812127"
        },
        {
            "id": "hvaywtg",
            "score": 1,
            "text": "There’s some great explanations but people are not really explaining what they mean by ethnoreligious group. \n\nBasically, throughout several periods of time, Jews were kept in their own groups by either outside or inside forces.  This creates what is called an endogenous group.  \n\nThere are common genes that almost everyone in the group has.  Everyone in the group is, say, 14th cousins or closer.  Not close enough to be inbreeding, but close enough to share traits.\n\nConsider, every ethnic Jew alive today had a family member or family friend killed during the Holocaust.  Grandparents or great grandparents or a great uncle, etc who knew someone who did not make it out.\n\nNot all Jews are ethnic Jews.  People convert, marry into families, etc.  There’s been a lot of mixing with the general public in the diaspora.  \n\nBut it’s prevalent enough that you can find ethnic Jewish genes in DNA tests, and there are higher prevelences of some visual traits, skin quality, face shapes, hair types, etc.\n\nThe country of Israel as it is today has displaced most other ethnicities, and is not just prediminantly white, but prediminantly ethnic Jews because that’s where people escaped to, were lead to, pushed to, and then friends and family followed.\n\nThere are a few places in the US and other countries with high percentages of ethnic Jewish ancestry as well such as Chicago, New York, Boston, etc.  The US has as many people of this grouping as does Israel.\n\nNot everyone who’s ethnically Jewish practices the Jewish religion, and vice versa.",
            "title_similarity": "0.5017845"
        },
        {
            "id": "hvb67a9",
            "score": 1,
            "text": "Well you are not technically Jewish unless your mother was Jewish. You can technically convert to Judaism but I don’t think it is the same .",
            "title_similarity": "0.6286474"
        },
        {
            "id": "hvb7m0l",
            "score": 1,
            "text": "Ethnoreligious is a correct term sure, but couldn't you just say ethnicity since people identifying with a shared religion is technically an ethnic group? Although ethnoreligious is rather specific in it's ethnic highlight",
            "title_similarity": "0.63838637"
        },
        {
            "id": "hvb7xb1",
            "score": 1,
            "text": "Don't quote me on this, but I do believe Judaism is a culture and religion. The idea of it also being a race is often popularized by a group or individual attempting to distinguish Jews as \"the other\". You can leave a religion (conversion), a culture (disassociation), but you can't leave a race as you're born into it. This justified the Nazis persuit of people with Jewish descent in Germany, even though they were, for all intents and purposes, German.",
            "title_similarity": "0.656316"
        },
        {
            "id": "hvbdbpm",
            "score": 1,
            "text": "I am only going off the quote you grabbed.. sounds like you are conflating explanations of race/ethnicity, the how and why of that, and the fact that even jews born in germany, never lived anywhere else, were not seen as \"german\". Saying most Jews saw themselves as Jews first is a generalization that i am assuming holds under pressure, your example were the minority which really isnt helpful when taking the cultural temperature of groups of people. Of course there were Germans of Jewish heritage that saw themselves merely as Germans.",
            "title_similarity": "0.6142492"
        },
        {
            "id": "hvbdl4x",
            "score": 1,
            "text": "I’ll add one tiny point to the very excellent answers already posted here:\nIt is possible to be an “ethnic Jew” and to have converted to some other religion or atheism. By contrast, someone born from a completely separate heritage could convert to Judaism and therefore become a religious Jew (but not an ethnic Jew).",
            "title_similarity": "0.69448376"
        },
        {
            "id": "hvbh6kb",
            "score": 1,
            "text": "Most religions are actually specific to a culture. Christianity and it's close relative Islam are among the few exceptions, since they actively try to convert people. If you're a Christian or Muslim, chances are your ancestors also had a native religion, until someone \"convinced\" them to convert.",
            "title_similarity": "0.5208088"
        },
        {
            "id": "hvbi9nw",
            "score": 1,
            "text": "Somewhat related here - are Jewish people considered race-wise to be of middle eastern origin or is this no longer applicable given how long they’ve established in various parts of the world?   Well even white people who’ve been in the US or Canada or Australia still identify as “French” or “English” etc…. So does the geographical origin play any role in associating Jews to a place of origin?",
            "title_similarity": "0.73527074"
        },
        {
            "id": "hvblmec",
            "score": 1,
            "text": "As to why it is classified as a race sometimes, Jews were a nation prior to the Roman destruction of the second temple. As many Jews were taken as slaves to Rome or otherwise scattered, rabbinic Judaism became the way Jewish people retained their culture and cohesion. \n\nRome integrated christianity in their religion. They wanted to downplay the Roman role in the death of Jesus. So they amplified the \"Jewish endorsement\" of his execution (by Romans). Furthermore, the Jews kept revolting, so Roman historians started writing that they were inherently rebellious or disloyal. As the Western Roman Empire crumbled, the Catholic Church filled the role. So Jew hatred became largely religious as Jews also become more of a religion than nation.\n\n\nThe French Revolution led to some degree of emancipation for Jews, and this was spread by Naopleon's conquests. When Napoleon was defeated however, many of his reforms were rolled back. Jews were semi-emancipated. Some German intellectuals believed that Jews needed to stop being Jewish to gain political rights. This led to a lot of debate.\n\nAt the same time, orientalism was become very popular. In France and Britain, orientalism was focused on Egypt and India. In Germany, however, orientaism was sometimes focused on the Jews, \"the Palestinians among us\" as Kant said. \"Semitic peoples\" were defined based on language studies of Arabic and Hebrew, for example. \n\nReligion was declining, science was on the rise, so some German orientalists decided that it would be more scientific to call Jew-hatred antisemitism. They decided to call themselves antisemites, which is why the term refers to oppression of Jews, even though there are many semetic language speaking peoples.\n\nOne popular race theory suggested that Jews, Hebrews, were a separate race. Increasingly, the Jews were posited as being opposed to the Aryan or Indo-European race.\n\nRacialization of Jews, a social construct like any racialization, was essentially a way to continue oppressing Jews when religion was giving way to enlightenment ideals. The rise of nationalism is also a factor.\n\nThis was all more popular in Europe than America, where race was a way to oppress black people.\n\n\nThat's the quick and dirty",
            "title_similarity": "0.5870032"
        },
        {
            "id": "hvbm0q0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.16429879"
        },
        {
            "id": "hvbmjxl",
            "score": 1,
            "text": "Because there are people who are Jewish like people are Italian or Spanish and people who are Jewish like people are Catholic or Baptist.",
            "title_similarity": "0.6279333"
        },
        {
            "id": "hvbngi7",
            "score": 1,
            "text": "it is not both. It is the same word used to describe two things.\n\nJust like “light” can both be the opposite to “heavy” and “dark”.",
            "title_similarity": "0.35097605"
        },
        {
            "id": "hvbs895",
            "score": 1,
            "text": "I’ve been seeing a lot of people asking why Jews don’t convert people. Like other comments have said it has to do with how Jews were thought as the descendants of Abraham making them quite insular as a group. Basically if you want to convert to Judaism and you identify with the culture or religion than you are more than welcome to convert. Otherwise we ain’t gonna chase you. Basically it’s only on those who really want to convert instead of forcing our beliefs onto people like other groups might want to. I think this also has to do with how throughout history Jews have just been the minority so it kind of makes it hard to push you beliefs on others when you are.",
            "title_similarity": "0.6326743"
        },
        {
            "id": "hvbsayk",
            "score": 1,
            "text": "Because English is stupid sometimes. \n\nIn many other languages, for example Russian, Jew (by ethnicity) and Jew (by religion) are two different words, the second being basically \"Judaist\". Which makes total sense.",
            "title_similarity": "0.56541866"
        },
        {
            "id": "hvc6s3i",
            "score": 1,
            "text": "How about the Rumani, i.e. gypsies?",
            "title_similarity": "0.391963"
        },
        {
            "id": "hvcx8e3",
            "score": 1,
            "text": "What makes this odd is people who become Jewish - are they also adopting a new race with their newly adopted religion?",
            "title_similarity": "0.75239027"
        }
    ]
}