{
    "ELI5: Why do we put horseshoes on horses? Are wild horses running around with sore feet?\n": [
        {
            "id": "hvg43uu",
            "score": 4,
            "text": "**Obligatory Horse Copy Pasta...**\n\n\nIn the beginning, there was Eohippus. The proto-horse. It was a small hooved animal about the size of a dog, and it ate grass. It was a simple creature, and in my (factual) opinion it represents the last time that the Horse lineage was untainted by sin. Now, it is worth noting that life was not easy for this proto-horse, in fact life for early hooved mammals was so difficult, that some of them said \"fuck that\" and moonwalked back into the ocean to become cetaceans (Whales and Dolphins). That's right, The proto-horse had so stupid an existence, that hooved mammals went back into the ocean (lacking gills and flippers) and had more success than horses would have on land.\n  \n  \nOkay, So why was life so hard for Eohippus? Well, they are herbivores eating almost exclusively grasses. Grasses, as you may know, are not particularly nutritious. But more importantly, grasses are smarter than Horses. See, Grass does not want to be eaten, and evolutionary pressure caused the grasses to start incorporating silica (ie sand) into their structure. Silica is extremely hard. Hard enough to wear down Horse teeth. Now there is another evolutionary pressure acting on Eohippus; It's teeth wear down by the mere act of eating, to the point that it will starve to death. Eohippus teeth do not regrow, instead, Eohippus evolved bigger teeth. However, bigger teeth mean a bigger jaw, bigger head, and a bigger body to carry it.\nThese opposing evolutionary pressures started an arms race in which the grasses incorporated more and more silica, and Horses got bigger and bigger, just so they would have big enough teeth to grow and reproduce before finally starving to death. And eventually our cute dog-sized pony evolved into the 1,500-pound, dumb-as-rocks prey animal i loathe today.\nBut wait, there's more! See, Horses are extremely fragile. There is a reason why a \"horse doctor\" typically prescribes a dose of double-0 buckshot in the event of a leg injury. A horse is very heavy, and it has very thin legs to carry that weight. If any one leg gets fractured, it is exceptionally unlikely that it will heal well enough for the Horse to walk again, and is extremely likely to break again just carrying the weight of the horse. Remember, a human thigh bone is gigantic relative to the size of our bodies, a horse leg bone is absolutely minuscule relative to the weight it carries.\nAlso, Hooves: I want you to imagine that instead of feet, you have a giant toenail at the end of your leg. That is how the Horse do. That is what a hoof is. A giant toenail. It is extremely delicate, and joined to the leg by a vast network of very fine connective tissue, and oh yeah it also bears the weight of a fucking HORSE. If a hoof gets infected (which is quite common, because imagine how often shit would get stuck under your toenails if you walked on them), the Horse immune system responds in the typical way: via inflammation of the area. The problem is, a horse hoof is a rigid \"cup\". It cannot accomodate the swelling from inflammatory response. The Horse hoof will basically pop off the leg like a sock. On top of that, remember the Horse is putting 1,500 pounds of weight on it (because Horses can't redistribute their weight very well since all of their legs can BARELY support their share of the total weight).\n  \n  \n\nSo, Horse apologists will claim that Horses are good at one thing: Turning Grass into Fast. As the previous two paragraphs show, they can't even do that right. Locomotion is very dangerous for a Horse, and if the Fast doesn't kill them they'll starve to death just by eating.\nOn top of that, they are dumb as all fuck. Horses will often do something called \"Cribbing\", which is when they decide to bite down on something (literally anything) as hard as they can, and suck in air. They just keep sucking in air until they inflate like a balloon. Eventually, the vet will show up and literally deflate the Horse with a long needle to let the air out of them, and hopefully get them to just... stop...\n  \n  \n\nFirst off, horses are obligate nasal breathers. If our noses are stuffed up we can breathe through our mouths. If our pets' noses are stuffed up (except for rabbits, who are also really fragile but unlike horses aren't stuck having only one baby a year) they can breathe through their mouths. If a horse can't breathe through its nose, it will suffocate and die.\n  \n  \n\nHorse eyes are exquisitely sensitive to steroids. Most animal eyes are, except for cows because cows are tanks, but horses are extremely sensitive. Corneal ulcers won't heal. They'll probably get worse. They might rupture and cause eyeball fluid to leak out.\nIf you overexert a horse they can get exertional rhabodmyolysis. Basically you overwork their muscles and they break down and die and release their contents. Super painful, and then you get scarifying and necrosis. But that's not the problem. See, when muscles die hey release myoglobin, which goes into the blood and is filtered by the kidneys. If you dump a bucket of myoglobin into the blood then it shreds the kidneys, causing acutel renal failure. This kills the horse. People and other animals can get that too but in school we only talked about it in context of the horse.\n  \n  \n\nHorses can only have one foal at a time. Their uterus simply can't support two foals. If a pregnant horse has twins you have to abort one or they'll both die and possibly kill the mother with them. A lot of this has to do with the way horse placentas work.\nIf a horse rears up on its hind legs it can fall over, hit the back of its head, and get a traumatic brain injury.\n  \n  \n\nNow to their digestive system. Oh boy. First of all, they can't vomit. There's an incredibly tight sphincter in between the stomach and esophagus that simply won't open up. If a horse is vomiting it's literally about to die. In many cases their stomach will rupture before they vomit. When treating colic you need to reflux the horse, which means shoving a tube into their stomach and pumping out any material to decompress the stomach and proximal GI tract. Their small intestines are 70+ feet long (which is expected for a big herbivore) and can get strangulated, which is fatal without surgery.\n  \n  \nLet's go to the large intestine. Horses are hindgut fermenters, not ruminants. I'll spare you the diagram and extended anatomy lesson but here's what you need to know: Their cecum is large enough to shove a person into, and the path of digesta doubles back on itself. The large intestine is very long, has segments of various diameters, multiple flexures, and doubles back on itself several times. It's not anchored to the body wall with mesentery like it is in many other animals. The spleen can get trapped. Parts of the colon can get filled with gas or digested food and/or get displaced. Parts of the large intestine can twist on themselves, causing torsions or volvulus. These conditions can range from mildly painful to excruciating. Many require surgery or intense medical therapy for the horse to have any chance of surviving. Any part of the large intestine can fail at any time and potentially kill the horse. A change in feed can cause colic. Giving birth can cause I believe a large colon volvulus I don't know at the moment I'm going into small animal medicine. Infections can cause colic. Lots of things can cause colic and you better hope it's an impaction that can be treated on the farm and not enteritis or a volvulus.\n  \n  \n\nAnd now the legs. Before we start with bones and hooves let's talk about the skin. The skin on horse legs, particularly their lower legs, is under a lot of tension and has basically no subcutaneous tissue. If a horse lacerated its legs and has a dangling flap of skin that's a fucking nightmare. That skin is incredibly difficult to successfully suture back together because it's under so much tension. There's basically no subcutaneous tissue underneath. You need to use releasing incisions and all sorts of undermining techniques to even get the skin loose enough to close without tearing itself apart afterwards. Also horses like to get this thing called proud flesh where scar tissue just builds up into this giant ugly mass that restricts movement. If a horse severely lacerated a leg it will take months to heal and the prognosis is not great.\n  \n  \n\nI hope this information has enlightened you, and that you will join me in hating these stupid goddamn bastard animals.",
            "title_similarity": "0.5780956"
        },
        {
            "id": "hvgaf2s",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0011720248"
        },
        {
            "id": "hvh3zm6",
            "score": 7,
            "text": "Ummm it’s called fashion? Ever heard of it?",
            "title_similarity": "0.10650287"
        },
        {
            "id": "hvfza63",
            "score": 0,
            "text": "IMO, we use shoes far more than needed. While there's benefit to working horses that endure far more abrasion than they would naturally, many just do it 'cause \"That's what you do\". We run a mountain trail horse operation... none of our horses are shoed, and aside from a rare abscess, none have ever had a foot/hoof problem. For rocky trail rides, we boot the horses to avoid bruising, but other than that, they are barefoot and problem free.",
            "title_similarity": "0.5789193"
        },
        {
            "id": "hvg9a5a",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.0011720248"
        },
        {
            "id": "hvgejnu",
            "score": 0,
            "text": "Because they wear down if we ask horses for more than just chilling on the grass.\n\nHorse hoof is a bit like finger nail but the inside of the hoof is a very sensitive tissue with their middle finger dipped in it(pedal bone dipped in soft tissue called laminae). You know when you cut your nails way too short? Well that's something what a horse would experience. Additionally they can just get foot sore.\n\nProblems stem not only from wearing down the fingernail like part but also in occurrences like laminitis where pedal bone sinks in laminae and eventually rotates. Laminitis can happen for various reasons (like too much of young, sugary grass), including lack of farrier care and one of the ways to help laminitics is to put corrective shoes on. Bad case of laminitis will never be cured and the pain is so bad that the only humane way out is to put the horse to sleep. Milder cases will require ongoing farrier care as well as watching weight and diet too.",
            "title_similarity": "0.7074286"
        },
        {
            "id": "hvhb542",
            "score": 0,
            "text": "Why do you wear shoes? Same reason.",
            "title_similarity": "0.20219438"
        },
        {
            "id": "hvhr49y",
            "score": 0,
            "text": "I must answer your question with another question.  do you know what weighs over 11 pounds?",
            "title_similarity": "0.19721085"
        },
        {
            "id": "hvioqqz",
            "score": 0,
            "text": "Not trying to be funny, but are there actually WILD horses with no owners? I have never seen a wild horse in my life, wow, you learn something new everyday.",
            "title_similarity": "0.53846204"
        },
        {
            "id": "hvfcwme",
            "score": 15,
            "text": "Wild horses spend most of their time standing unburdened in a soft meadow grazing. However tame horses tend to spend a lot of time carrying people or cargo on their backs or pulling wagons through streets with hard surfaces feeding off high calorie grains instead of grass. So there is a huge difference in how much wear there is on the hooves of these animals. This means that wild horses do not need horseshoes. Tame horses can also be released onto pastures and the like without shoes without any ill effect.",
            "title_similarity": "0.62471724"
        },
        {
            "id": "hvgmmmj",
            "score": -2,
            "text": "It's mostly excuses for poor husbandry. A horse that has healthy hooves will adapt to almost everything. Pavement, rocks, ice. There are high ranking competition horses that are barefoot fulltime. Thé hoof plays a role in blood circulation and absorbing shock, nailing a shoe there robs it of its purpose. There are even places that rehabilitate \"incurable\" cases with just regular movement on different surfaces (see: Rockley Farm)",
            "title_similarity": "0.65690506"
        },
        {
            "id": "hvfc599",
            "score": 206,
            "text": "No, wild horses are running around naked on dirt.  When humans ask a horse to carry more weight, and travel on roads, then the horse needs shoes to deal with the unnatural conditions it's in.",
            "title_similarity": "0.8142555"
        },
        {
            "id": "hvfzil0",
            "score": 3,
            "text": "Wild horses aren't carrying people, gear or pulling carts, etc. Wild horses aren't walking on pavement, brick, hard packed dirt roads. Wild horses can stop and rest when they want.",
            "title_similarity": "0.59934986"
        },
        {
            "id": "hvfs4ir",
            "score": 25,
            "text": "Weird thought, are there \"wild horses\" nowadays anywhere?",
            "title_similarity": "0.5933123"
        },
        {
            "id": "hvfc9c1",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.0011720248"
        },
        {
            "id": "hvftf7x",
            "score": 4,
            "text": "Part of the problem is that we have spent hundreds to thousands of years modifying wild horses to be something else. We have not always prioritized sturdy feet in that process. If a wild horse has shitty feet, they become part of the cycle of life sooner than they intended. If a Thoroughbred that can run really fast and turn left well has shitty feet, we spend a lot of time and money giving them fancy shoes.",
            "title_similarity": "0.68729687"
        },
        {
            "id": "hvfw1j3",
            "score": 15,
            "text": "Wild horses don't carry humans and freight, nor do they have concrete/asphalt roads they are forced to walk on.",
            "title_similarity": "0.5103082"
        },
        {
            "id": "hvgui25",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.0011720248"
        },
        {
            "id": "hvfc9kq",
            "score": 16,
            "text": "Wild horses don't run around on stone roads. It's not fair to compare them. Stone roads will do a lot more wear on the horse's hooves than natural ground. So horse shoes honestly make sense for the horse.",
            "title_similarity": "0.685483"
        },
        {
            "id": "hvfj96a",
            "score": 42,
            "text": "It is true that the unnatural conditions (roads, carrying weight, etc) we put horses in contribute to a need for horse shoes. But what I rarely see discussed with topics like these is that sometimes wild horses do \"need\" shoes but can't get them because they're wild animals. Sometimes their hooves crack or they don't wear down enough. Or when it's unusually wet and they spend many days standing in mud their hooves can soften. These are all things that humans would prevent or fix with farrier work (because they care or because they want their horses to keep performing), but nature does not care. It's similar to dental care for older horses. Owners file down their back teeth because their teeth do not wear down as much as they would in the wild. But there are wild horses whose teeth don't wear down enough and they just have to suffer through it.",
            "title_similarity": "0.7139025"
        },
        {
            "id": "hvfhtej",
            "score": 1414,
            "text": "Very experienced horse person here. There are lots of reasons many domesticated horses need shoes.\n\nBreeding: In many breeds we have selected for other desirable traits ahead of hoof hardness and quality since the option of shoes is available to compensate. In many breeds larger size has also been selected for and this puts much more strain and wear on the hoof. Many more ponies are able to perform without shoes than larger heavier breeds and most wild horses are pony to very small horse sized.\n\nWorkload and terrain: Domestic horses are often asked to perform on surfaces that are quite damaging to the hoof - abrasive sand, hard or paved surfaces as others have mentioned. But there is sometimes the opposite issue where the surface is slick or slippery and certain types of shoes or additions to shoes (like studs or other grip enhancing add ons) allow better performance. We also ask them to perform in ways that wild horses rarely do - extended periods of work will cause more hoof wear. Wild horses may move quickly in short bursts but the majority of their travel is slow walking as they forage and that is less wearing.\n\nUnnatural living conditions: Wild horses are not confined to mucky paddocks or stalls filled with dry wood shavings. In fact, the worst thing is going repeatedly between the two. The hoof wall will expand and contract leading to cracks in much the same way wood would do if exposed to these conditions.\n\nWhile all of these things contribute, the first one is probably the most significant. Hoof quality is usually the biggest factor in determining whether a horse is comfortable working without shoes and that is largely genetic. And there is a reason few  highly bred horses , such as thoroughbreds are rarely able to do so.",
            "title_similarity": "0.69722915"
        },
        {
            "id": "hvftwmo",
            "score": 164,
            "text": "I made a post just a few days ago on this same topic:\n\nThe original wild type horse from long ago was much smaller - pony-sized - and had proportionately much bigger feet.  Currently there's only one wild horse - as in never domesticated (mustangs are feral - big difference) called the  [Przewalski](https://imgur.com/a/r7PwJWX).\n\nWild horses  are very active and all that activity wears down their hoof wall.  Mustangs and Brumbies (the Australian version of Mustangs) of a few generations often have larger, more robust feet but that's because any earlier ones with thinner, smaller, more fragile feet would more likely get injured and have a harder time to survive.  \n\nSince we domesticated them, we've bred horses to be bigger, much much bigger. We've asked them to carry weight sometimes 1/4 their body weight. We've asked them to pull - sometimes at speed (carriage horses), sometimes it's to haul something heavy (draft horses). We've asked them to do specialized tasks - endurance racing (Arabians), jumping (Warmbloods), racing (Thoroughbreds), roping, cutting & ranch work (Quarter Horses), or stepping extravagantly (saddle breds).\n\nA lot of breeding is concentrated on athletic ability and we ask horses to put out extreme effort. Much more than any wild horse would ever do.\n\nA horse in the wild is running on natural ground - some rocky, some soft. He can choose. Domesticated horses are often worked on harder ground, including concrete & asphalt which can be very slippery and hard on their feet and joints.\n\nWithout shoes, the sensitive frog (sole) of the feet are much closer to the ground.\n\nA horse in the wild can drop his head to look at the ground, he can adjust his pace and move this way and that and slow down and tip toe carefully if the ground is rocky. A horse in harness or being ridden can't do that. And thus he's at risk of step on something sharp or rocky or just hitting the ground too hard and his sole touches.  A bruised sole isn't a minor thing but can be a major issue.  Shoes bring the hoof and the sole up off the ground and away from anything that could damage it. \n\nHorse's vary in how well they move. Just like people, some pronate or over pronate or their limbs don't move straight and true. In the wild, a horse with crooked legs or who wears off the sides of his hoof unevenly is less likely to survive.  \n\n With domesticated horses, we own it to them to correct this as much as possible and so a farrier carefully fits the shoes to correct problems and help the horse stay sound.\n\nCarrying weight, doing athletic actions or on hard surfaces can cause concussive forces down the leg - making the hoof wall to spread wide which can lead to cracks and splits. Cracks and splits can lead to infection.  As well, concussive forces can traumatize the inside the hoof causing laminitis - an extremely painful situation and can be so bad that the entire hoof wall (the hard part) comes off.  The horse is often put down at this point.   \n\nSo another purpose of shoes is to hold the the walls of the hoof together and to spread out the forces.  \n\nWe bred horses to work for us and owe it to them to help them as much as possible to stay healthy, pain free and sound. We really can't compare them to non-domesticated horses.",
            "title_similarity": "0.62410676"
        },
        {
            "id": "hvfd4p2",
            "score": 18163,
            "text": "To make their hooves last longer on tough surfaces like pavement, bricks etc. \n\nHorses hooves are very similar to our fingernails. In fact, you can consider that horses are essentially walking on their fingertips and a hoof is just a really big thick fingernail at the end of essentially their middle finger. The hoof material grows somewhat quickly but in nature, the horse is constantly moving over dirt, rocks, sand etc. so their hooves get naturally abraded. \n\nFor working horses they're on roads, sidewalks, paved stable floors - those surfaces would wear down the hoof material a lot quicker than in nature so we put horseshoes on to protect them. The downside of course is since the hoof isn't being worn down naturally at all, every few months you have to have the farrier come out and re-shoe them. Basically, tear the old shoe out, trim, give the hoof a manicure/pedicure, put a new shoe back on.\n\nedit: yes yes, we've been putting shoes on horses outside of road or urban environments for centuries as well - it helps save wear on the hoof when you put riders or loads on the horse beyond what their own bodies weigh or in super rough duty, terrain etc. or just in general when the horse is gonna be doing a lot of work or travel beyond what they'd encounter normally in the wild. If their hooves are gonna wear faster than they've evolved to, put on shoes.",
            "title_similarity": "0.73917186"
        },
        {
            "id": "hvfyttv",
            "score": 6,
            "text": "Horse owner here!\n\nWe shoe mostly working horses or show horse. But why you ask? \n\nWell that’s because we are utilizing the hoses way more then they would be moving in the wild along with the surfaces we work them on. Hard packed arenas, Pavement, concrete etc. Wearing their hooves down and making them weaker. Hooves are like our fingernails. They are Hardy naturally but over time when working they can be come weaker and brittle. So like putting a hardener on our nails we put shoes on hooves.  Shoe help provide that support for those horses who need them. \n\nPlus we don’t see horses out in the wild with these weaker feet because of natural selection. If they have weak feet and become injured or slow they will die and become apart of the food chain whereas the harder hooved horses will thrive and be able to survive the elements! \n\nHope that helps!",
            "title_similarity": "0.7027453"
        },
        {
            "id": "hvg0vmr",
            "score": 1,
            "text": "Why are horseshoes metal and not rubberized?",
            "title_similarity": "0.39494842"
        },
        {
            "id": "hvg3v6f",
            "score": 1,
            "text": "Domesticated horses walk on harder surfaces, like pavement. If you have a horse that is too old for riding on you don’t have to put shoes on them.",
            "title_similarity": "0.5861418"
        },
        {
            "id": "hvg3z5g",
            "score": 1,
            "text": "Modern horses are treated very differently from the feral or wild relatives. Many are pets, not work animals. In the wild horses with bad genetics for hooves and feet become dinner for wolves. As pets we often breed for other traits such as appearance, hoof quality is not a trait breeders are highly concerned about.\n\nNext modern horses tend to spend a lot of time in irrigated pastures, or standing in barn stalls lined with straw that’s moistened with urine and feces. Just like finger nails out of the shower, they’re softener and wear at rates differently from their wild relatives. Wild and feral horses naturally live in arid plains and don’t walk on concrete or asphalt.\n\nFinally a wild horse doesn’t have an often overweight rider on their back, which also impacts hoof wear.\n\nThere is a lot of debate on if a horse shoe is needed for horses, generally the answer is it depends on the owners views, horse breed/individual and activities.",
            "title_similarity": "0.6691865"
        },
        {
            "id": "hvg4cf4",
            "score": 1,
            "text": "Does it hurt the horse when you take the shoes off of them?",
            "title_similarity": "0.6767253"
        },
        {
            "id": "hvg7rim",
            "score": 1,
            "text": "In the wild horses run on soft things and the horse hooves grow. Horses run on rocks or roads and the horse hooves grind down. Metal horseshoes help them walk wherever!",
            "title_similarity": "0.74914086"
        },
        {
            "id": "hvg7y41",
            "score": 1,
            "text": "2 things.\n\nDo you wear shoes?\n\nHooves weren't designed for pavement.",
            "title_similarity": "0.44792867"
        },
        {
            "id": "hvga2u8",
            "score": 1,
            "text": "Mustangs have some of the best natural feet since they run all over rocky ground and are preyed on by mountain lions. No hoof, no horse!",
            "title_similarity": "0.61053354"
        },
        {
            "id": "hvgaeln",
            "score": 1,
            "text": "I am a veterinary technician and my husband is a professional farrier. I can answer this! By selectively breeding horses for specific purposes (racing, pulling a plow, jumping, etc), humans have promoted certain traits (long legs, speed, heart girth, athleticism etc) at the expense of good feet. Horses in the wild walk upwards of 40 miles per day in search of food and water. They wear their feet down in the sandy and rocky terrain, whereas domesticated horses in captivity do not traverse the type of terrain needed to naturally wear their feet down as they grow. Also, in wild horse herds, natural selection is hard at work. Horses with weak feet often don’t survive to breed. They get picked off by predators or can’t keep up with the herd s they travel looking for food and water. Good strong feet allow a wild horse to survive and reproduce. In short, we have put domesticated horses in environments that are unnatural and allowed horses with weak feet to survive and breed. Some domesticated horses need “insoles” or support to keep their feet from cracking and going lame.",
            "title_similarity": "0.7507199"
        },
        {
            "id": "hvgagxl",
            "score": 1,
            "text": "I don't shoe my horses. I typically ride in softer surfaces and don't have to worry about crazy gravel, rocks, or long trips on pavement. Sometimes if a horses feet get Injured or something like an access or infection gets ahold of them, they will need to be shod either with conventional metal shoes or possibly with a poly resin composit. There's even treatments where they fill the inner sole or \"Frog\" of the foot to keep it clean/dry and spacers that they can place to lift the hoof in specific ways.",
            "title_similarity": "0.5484957"
        },
        {
            "id": "hvggbtb",
            "score": 1,
            "text": "The Swedish showjumping horses that won team gold didn't have shoes, and my own don't either.\n\nThere's a growing contingent of people realising that metal shoes are actually quite bad for the horse. You pick the foot up, a piece of biological material made to absorb shock, and nail metal to it in its most contracted state. This prevents the foot from expanding upon impact and affects the way impact forces are transferred up the leg and the way the Hoof grips the ground. It affects the circulation and general health of the Hoof.\n\nWhy did we start this? To grow a healthy Hoof a horse needs to eat a varied diet (they're really good at living on browsing scrub), and walk miles on varied terrain. Modern horses are kept confined (easier to hitch up a carriage or go for a ride if they're in a box), and their diets are too rich (wild horses don't eat grain, soy,wheat etc)...\n\nTo keep a horse \"barefoot\" you have to start by modifying their diet, and keeping them out of the stable as much as possible. Most recreational and competition horse owners struggle to do this, and feed marketing is trash (animal food is so unregulated, I won't even get started). I believe a lot of modern horses suffer from \"affluent malnutrition\"- too many calories and it's not as good for them as we want to believe. And we keep them confined because it's easier (they don't hurt themselves, they don't trash the fields, etc)\n\nEdit to add: lots of progress has been made in recent years with rubber/polymer shoes that inhibit the Hoof expansion mechanism less. Some use boots as removable protection (one of mine does roadwork in boots as she is flat footed and sensitive to stones on pavement, but fine on other surfaces). \n\nAdditionally \"back in the day\" horses were only shod for working seasons- a hunter would get shoes over winter during that season, pull them off all summer. I think that metal shoes used intermittently cause far less long term damage. But modern amateurs compete year round, and its the living 365 days a year that causes the most harm in my opinion...",
            "title_similarity": "0.7161329"
        },
        {
            "id": "hvghkt3",
            "score": 1,
            "text": "Seems to parallel the reason humans wear shoes. In our original subtropical habitat and lifestyle we got along just fine without them. But bare feet on the polished concrete at Walmart? Yuck!",
            "title_similarity": "0.32928315"
        },
        {
            "id": "hvgjeyv",
            "score": 1,
            "text": "Because horseshoes are cute and make horses look badass. Plus, they protect the horse's hooves from wear and tear.",
            "title_similarity": "0.6790483"
        },
        {
            "id": "hvgjw70",
            "score": 1,
            "text": "A lot of us don't. It is bad for horses feet and deforms them over time. Shoeing horses comes from olden day times when they used them for transport it allowed people to ride them for longer over rough terrain. Although if you condition the horses feet properly with a good trim, diet and exercise you can do that as well without. But in those days it was just easier to nail some shoes on and the horses never usually lived that long anyway. So it's just a mostly unecessary tradition nowadays.",
            "title_similarity": "0.597951"
        },
        {
            "id": "hvgkbkt",
            "score": 1,
            "text": "As someone who has dealt with horses and shoeing for many years as an owner (not a farrier or vet) ...\n\nFirst, a link to a diagram of a horse's foot. The hoof that we see is just an outer wall. There is all kinds of stuff inside that wall, including bones, tissue, and a complex structure that really starts from the big round joint above the foot (the fetlock). \n\nhttps://www.all-natural-horse-care.com/images/xhoof-diagram-lateral-view.jpg.pagespeed.ic.m9haprWJ_v.jpg \n\nHorses do have some feeling in their feet - probably in the inner matter, not the hoof wall - and are aware of the surface they are on, although overall their feet are very tough. If the hoof wall is too thin their feet will be more sensitive and prone to lameness.\n\nSo you aren't just dealing with the hoof wall, you are also taking care of the entire complex structure of a horse's foot. That's why horse people speak of the \"foot\" rather than just \"hoof\".\n\nWhat horses need on their feet, if anything, depends on the terrain on which they live and work , the type of work they are asked to do, the type of horse, and the sturdiness of the foot of the individual horse. There is no universal answer to a horse needing or not needing shoes. It depends, and it can change with changes in conditions.\n\nThe answers re \"pavement\" and \"bricks\" aren't true for most horses, who are not on pavement or bricks. Horse shoes are very slippery on pavement and not safe at all. Even crossing a road or parking lot with a shod horse has to be done with care to keep them from sliding like they are on ice. \n\nThe only horses regularly working on pavement or bricks or other hard surfaces have specialized jobs like police horses, parade horses and tourist carriage horses. They wear specialized shoes, as regular shoes are too slippery on pavement. Their shoes should include a bit of a cushion as the hard unyielding surface will cause damage over time to their feet and legs. People managing horses who are regularly on pavement are very well aware of the maintenance they have to do, as otherwise the horse will not be sound for long on pavement.\n\n-----------\n\nExamples of when and why horses may need shoes: \n\nMy current horse has thin hoof walls and soles (genetic) and in wet, rainy weather, his outer hoof tends to start loosing its shape. The change is marginal, visually, and you have to know what you are looking for to see it, but if you know, it's definite. These changes start to contribute to other problems inside the foot. This is a wet-ish climate and we've learned that he needs to keep shoes on all four feet to hold the foot in a healthy shape and avoid problems generally. For this horse, shoes have been the answer to no longer having many foot problems that he used to have in the past, before shoes.\n\nMy previous horse had excellent feet and went barefoot most of the time, even when he was in regular work over a combination of hard ground and soft arena (so the hard surface wasn't continuous). When he was doing more faster work and jumping, he wore shoes to help protect his feet from wear. At some level of harder, continuous work, most horses need some extra foot support. \n\nIt will be very apparent if a horse is getting footsore. There is an old saying, \"No foot, no horse\", meaning that a horse with sore feet cannot work. There are a lot of old sayings about horse's feet and soundness from pre-automotive days. There is the really old, really long one that starts with \"For the want of a nail, the shoe was lost (meaning: not enough nails were used so the shoe did not stay on the horse's hoof); for the want of a shoe, the horse was lost (meaning: can't work); for the want of a horse, a rider was lost; for the want of a rider, a message was lost ... \" and ends with - A king was lost, a war was lost ... \"all for the want of a horseshoe nail\".\n\n-------------------\n\nWild horses suffer from all kinds of ills that are, of course, untreated. Probably most have relatively healthy feet. Some unknown number are definitely running around on sore feet, depending on their foot genetics and the terrain. There are several answers here that give more information on their feet. \n\nMost American \"wild horses\" are really feral horses and their descendants, that got loose or were turned loose from ranches and random horse owners in the west. Most are a mix of different breeds and types of horse.\n\nOnly a handful of American wild horses are true descendants of the Spanish horses that were left behind by the earliest Spanish ships. Where those herds have been identified by mustang enthusiasts, they are carefully tracked and documented, as much as can be done. \n\nThere is a good bit of mustang information on the internet, for those interested in exploring it.",
            "title_similarity": "0.61121047"
        },
        {
            "id": "hvgp2li",
            "score": 1,
            "text": "agreed with the above statements, but also sometimes shoes are out on for corrective issues. just like some people can do with a flat slip on shoe and be fine, while others need arch support or heel support or something like that. it’s the same with horses. a balanced foot on a working horse may be fine with a basic steel shoe, while an unbalanced foot may need extra help with wedges, compression material, or even clogs in extreme cases",
            "title_similarity": "0.54690486"
        },
        {
            "id": "hvgpu6o",
            "score": 1,
            "text": "To add to other answerers, It is also possible to keep your horses barefoot.  In my opinion, for most horses, this leads to a healthier hoof and a happier horse.  If you are going for a longer ride, or traveling over rougher terrain you can put on easy boots, or similar product, to act as a temporary  shoe.  I have a draft horse so getting shoes for her is expensive.  she lives on a grass pasture and we ride on dirt trails or in a dirt arena.  on the rare occasion I ride her down  the road or on gravel the easy boots work well.  She has never has shoes and has very healthy hooves.",
            "title_similarity": "0.604769"
        },
        {
            "id": "hvgrld2",
            "score": 1,
            "text": "Same reason we wear shoes. Human feet are pretty good on grass and dirt, but pavement, gravel, and rocks make them sore and raw. Same thing with horse hooves. They work great on dirt and grass where they’re supposed to go, but they start to break down on pavement and gravel and rocks.",
            "title_similarity": "0.65740925"
        },
        {
            "id": "hvgsu9z",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0011720248"
        },
        {
            "id": "hvgu1l7",
            "score": 1,
            "text": "I handed my phone off to my wife, who is a professional horse trainer and has her own farm. \n\nThere is a lot of misinformation in this post. To answer your question- yes there are plenty of wild horses running around with sore feet, and unfortunately those are the first to be eaten by predators. Horses should have their feet trimmed by a “farrier” (basically a horse podiatrist) every 4-6 weeks no matter the conditions on which they are kept, or their work status. Horses feet grow just like our fingernails- now imagine walking around on that all day…they will become uneven and brittle. Natural wear is not sufficient for keeping a horse sound and comfortable. As far as shoes, it completely depends on the horse! Some horses are totally comfortable working barefoot (without shoes) and some horses are completely uncomfortable living in a field or stall barefoot. The best analogy is that some people are comfortable walking barefoot across gravel, and some aren’t even comfortable walking barefoot across grass. Farriers and shoes can also prevent ailments such as abscesses, bruises, and cracks, which in the wild would be cause for a horse to not be able to keep up with its herd. Not to mention, in the wild there is an evolution of horses being more sturdy and sound, because survival of the fittest.",
            "title_similarity": "0.7129533"
        },
        {
            "id": "hvgvse0",
            "score": 1,
            "text": "Because we moved horses from horse appendage-appropriate living environments to human appendage-preferred living environments. If we moved you to a horse appendage-appropriate living environment, you'd need shoes. Some really good shoes.",
            "title_similarity": "0.5499193"
        },
        {
            "id": "hvgx0cy",
            "score": 6,
            "text": "why do people wear shoes? because we live in a world where we no longer exclusively walk on grass, and so need protection from the artificial surfaces that we created. the same goes for horses",
            "title_similarity": "0.67301476"
        },
        {
            "id": "hvgxs87",
            "score": 26,
            "text": "The most important part of caring for a horse’s hooves is actually trimming, not shoeing. Shows become necessary when a horse is either a)being worked on hard/unnatural surfaces, b) being worked harder than the average wild horse would, or c) has weak or damaged hooves as a result of genetics or injury. Of the 20 odd horses we have on our place currently, only 3 wear shoes, and over half of them are in regular work.\n\nIn answer to the second part of your question, yes. They do have better genetics and their hooves are chipped off/trimmed by their movement, but there is a reason the lifespan of a mustang or brumby is about half of a domesticated horse.",
            "title_similarity": "0.6868262"
        },
        {
            "id": "hvgzy0l",
            "score": 1,
            "text": "Horse feet is naturally grown for soft soils. Domesticated horses often run around on solid concrete which breaks the nail like \"feet\", harming thr horse in the long run",
            "title_similarity": "0.720297"
        },
        {
            "id": "hvh0n1d",
            "score": 2,
            "text": "It's more because of what we want horses to do\n\nA horses hooves are easily kept up in the wild. They wear down, and grow back at a consistent rate. \n\nBut that's only when they're running on dirt. \n\nWe have horses running on gravel, and pavement. Comparatively, it tears through their hooves. \n\nSo we give em \"Metal Hooves\" so they can run on roads. Those \"Metal Hooves\" are Horseshoes",
            "title_similarity": "0.69994915"
        },
        {
            "id": "hvh2c4m",
            "score": 1,
            "text": "It started when domesticated horses were kept in stalls. Their feet were standing in urine soaked hay which was really bad for their feet. Horseshoes solved the problem.",
            "title_similarity": "0.73185515"
        },
        {
            "id": "hvh2whq",
            "score": 1,
            "text": "horse hooves are not gonna last if used on hard surfaces like pavements, they were made for softer surfaces.\n\nwhile the application of horseshoes might seem cruel, not only  is it painless for the animal(if performed properly) its for their own good, especially if they are gonna be ridden/be used as beasts of burden.",
            "title_similarity": "0.5669971"
        },
        {
            "id": "hvh734i",
            "score": 2,
            "text": "There's a few reasons to shoe your horse. My father is a farrier and has been been for over 40 years.  I've done some work with him but decided early on that it was too much work for too little money! \n\nAs user tezoatlipoca said, the uneven ground wears them down faster and uneven. It's also the extra weight of the rider or gear that wears the hoof faster, just like tires. There's different types of shoes for different uses, like racing shoes or adding more grip for muddy ground. Ideally, if the horse is being ridden often, it should be trimmed and shod every 6 weeks. There are several clients of his that only shoe the animal for rodeo season or the summer and let them go in the winter. They should still get a trim to maintain a good shape and hoof health, although they can go longer if not ridden. Shoeing should not hurt the horse, as the nails are going in the dead area of the hoof, FYI. \n\nAlso, it might be medically necessary. The vet might recommend a pad and shoe to protect a sensitive hoof with an abscess or other sore spot. A horse that paws the ground a lot may need more protection too; they might only need the front shoed.",
            "title_similarity": "0.6434901"
        },
        {
            "id": "hvhbv1l",
            "score": 2,
            "text": "Some horses don’t have tough feet, they crack or chip or wear away too much, leaving the sole exposed to hard/rough ground.  One of mine needs shoes or he can’t walk on rough surfaces. The other is fine without shoes on the same surfaces.",
            "title_similarity": "0.6027012"
        },
        {
            "id": "hvhevgt",
            "score": 2,
            "text": "Aside from the fact that domestic horses are encountering a whole lot more (and different types of surfaces) than a feral horse does, you also need to take into account the fact that domestic breeds in modern day are not bred to the standard that they were when horses were used heavily in everyday life. A modern day horses' hoof (and body structure) doesn't hold a candle to ancient War and work horses. Many breeds are notorious for poor hooves, skeletal structures and even hereditary diseases. ( I will never ever EVER own a Paso Fino.) My family owns a few Nakota Mustangs and they are so much more hardier than our other regular horses. The gelding has perfect feet at 10 years old, he's never seen a farrier in his life, the mare only gets shoes when it's endurance riding season.\n\nThink of the the dogs you see in international dog shows nowadays. Flat faces, bad hips, deformed feet. All to look trendy and sell well.",
            "title_similarity": "0.68197465"
        },
        {
            "id": "hvhjb0v",
            "score": 1,
            "text": "A horse should bear most of its weight on the wall of the hoof, which is the outside part, and some weight on the frog, the triangular softer area in the centre of the sole. This is why horseshoes as you probably know them are shaped in their characteristic shape. Many native breeds - think Highland/Shetland/Welsh type ponies - are able to work barefoot still as the quality of the horn that makes up their hoof wall and sole is strong and robust. \n\nDepending on the sort of work that is expected of a horse, owners may choose to shoe just the front feet, or all four. Usually horses that ride out on roads a lot will have a full set of four shoes as the road surfaces are abrasive and will wear down the hoof wall much quicker. A consequence of this is that the horse will then gradually start to bear more weight on the sole, which is not designed to be a weight bearing surface, and can become sensitive/painful.\n\nShoes can also be used as treatments for different conditions/injuries, and different types of shoes can affect the horse's foot placement and alignment of the bones in the leg. It's super important that shoes are made and fitted by people that are properly trained and understand the anatomy and biomechanics of horse limbs, otherwise they risk causing more harm than good. \n\nThere's a camp of people out there who believe all horses should be barefoot, but with the intensive breeding operations around these days, foot quality generally isn't high on the list of desired characteristics for competition horses. Thoroughbred racehorses are notorious for having poor horn quality which can make it difficult to keep the shoes on their feet.\n\nYou can also stick neat little studs into shoes for horses that are competing on grass so they don't slip!",
            "title_similarity": "0.6367805"
        },
        {
            "id": "hvhjrao",
            "score": 1,
            "text": "They just talked about this on an episode of the Hey Babe podcast. From what they gathered, the horses’ hooves do wear down after a while, but they regrow a certain amount every year. My guess is that we put horseshoes on horses because their hooves wear down faster doing juman adjacent things like carrying riders and cargo (back in the old days).",
            "title_similarity": "0.63062525"
        },
        {
            "id": "hvhnir1",
            "score": 1,
            "text": "Feral horses with bad feet die. So we rarely see them, and they don't pass on their bad feet. \n\nThe same goes for any wild animal. They suffer from the same ailments their domestic counter parts do, they just don't live with them- or die before the negative effects appear.",
            "title_similarity": "0.59725416"
        },
        {
            "id": "hvhnomo",
            "score": 2,
            "text": "An alternative POV: while it's true that we put shoes on because hooves can't cope with demands we place on them, either through the work we are asking, environment they are kept in or the feed we give them.\n\nOther than those that have genetic pathologies (and we shouldn't be breeding from these horses), the vast majority of domesticated horses don't need shoes. They need more time to adjust their growth rates to match the rate of wear and/or a change in environment or feed. \n\nBy shoeing we cause many issues which make transitioning back to unshod an often long and painful process. If we didn't shoe them to start with, trimmed their hooves correctly, provided appropriate feed (low sugar and starch forage) and ensured they had the time to adjust to work and surfaces, the overwhelming majority of domesticated horses wouldn't need shoes.\n\nVery few (in the UK or US) are working 12 hours a day on very abrasive surfaces.  Very few are competing at a level needing studs to improve grip (even then, hooves have evolved a great design for grip, and sliding often protects legs from harsh impacts, should we really please putting small spikes under their feet?). \n\nShoeing inhibits lots of natural processes needed for a healthy hoof. The action of the frog hitting the ground pushes blood back up the legs. Horses need good blood flow! Hooves are actually rather flexible, this helps horses understand the surfaces under their feet, with grip and protect all the structures sat of top of them (all the joints, tendons, ligaments etc). Shoes prevent much of this flexion.\n\nIt's kinda sad that are equine industries haven't got the money to give horses the time they need to adjust to the work we ask them to do. Simply put that time costs money. \n\nTldr: the reason we shoe horses is because we don't want to give them the time they need to adjust to work loads, keep them in an environment that is good for them or feed them appropriate feed. Its quicker and easier for us human to cover up the issues by banging shoes on their feet.",
            "title_similarity": "0.6494297"
        },
        {
            "id": "hvhp5bt",
            "score": 1,
            "text": "Horse shoes can also be used to correct conformation issues that, in the wild, would shorten their lives. Kind of like orthopedic inserts.\n\nMy mare has low heels which results in overextension of her front legs which leads to sprains and strains which, because horse legs are stupid and have fuck all blood flow below the knees takes months to heal, if at all. To prevent overextension she wears egg bar shoes on her front hooves. [Eggbars](https://thorobredinc.com/shop/vulcan-egg-bar-shoe/) are circular shoes (can be one solid piece, or regular horseshoe shaped horseshoes, with the ends bent inwards and a metal bar welded on.) The extra bit of metal extends beyond the back of her heel by a cm and stops overextension. It also raises her heels up, which also stops overextension. The extra support also stops all discomfort from her mild arthritis. Egg bars are used to treat issues as well as prevent injury, issues in general and issues from disease.\n\nThey do have a few downsides. The cm of shoe that extends beyond the hoof is likely to be stepped on by the back hooves and the shoe pulled off. (Bastard of a mare did this two minutes into my lesson with a fancy super expensive coach. Why do I love her?) They also have the same issues regular shoes have such as things getting trapped between the shoe and hoof and either dragging whatever they caught around (my girl brought a long piece of curly wire home, don't know where she found that), the horse getting stuck to the object, or the shoe being pulled off. \n\nHeart bar shoes are similar to eggbars but have a bit of metal running up the center. They look live hearts.  These shoes provide support to the frog (triangle shaped, sensitive bit of the hoof). They are commonly used on horses with flat feet or have had laminitis.",
            "title_similarity": "0.68977284"
        },
        {
            "id": "hvhq8te",
            "score": 1,
            "text": "Wild horses don't carry anything on their backs, and don't run on concrete, asphalt, etc. Domesticated horses on the other hand do, and therefore their feet are more exposed to abrasion and damage.",
            "title_similarity": "0.58278906"
        },
        {
            "id": "hvhriho",
            "score": 1,
            "text": "Wild animals .. mountain goat, big horn sheep, boar and feral pig, burro, mustangs RUN around.  These animals are always on the move and their hooves protect their feet.  These wild animals' hooves are ground down by moving constantly on the ground.  Domestics are paddock and stall prisoners moving around on soft dirt and wood shavings.  Domestics need hoof care.",
            "title_similarity": "0.7078849"
        },
        {
            "id": "hvhs98h",
            "score": 1,
            "text": "Horses with good sound feet do not need shoes. They do need their feet trimmed since they are no longer roaming miles of terrain each day wearing then down naturally like wild horses do. \n\nBut, through selective breeding for other traits, some foot problems have been created (or become more common) in individual horses and breeds. Such as the stereotype of bad thoroughbred feet with thin walls. This sometimes even requires corrective shoeing to help correct the foot angle (bad angles can create stress on the bones and soft tissue).\n\nWild horses that have terrible feet don't make it long, so to speak, so you don't get a lot of bad feet being propagated into future generations.",
            "title_similarity": "0.64350754"
        },
        {
            "id": "hvhtpk2",
            "score": 1,
            "text": "I had an appaloosa that had really hard hooves so the ferrier said not to shoe him. Said a lot of this breed had hard hooves.",
            "title_similarity": "0.6624656"
        },
        {
            "id": "hvhwv2y",
            "score": 3,
            "text": "No, most wild horses are not running around with sore feet.\n\nHorseshoes were put on domesticated horses due to the need of traveling across cobblestone and long gravel roads the whole day: their hooves couldnt grow fast enough so they had to put some kind of sturdy protection there.\n\nHowever the earliest forms of metal horseshoes similar to the ones today were first used around 1000 years ago. Did they have much information about how the horses' body worked back then? And did they care as much about welfare as we do today? Probably no.\n\nAs traditons were set and people experimented on how shoes should be put to make a horse last as long as possible there was still no evidence that these kinds of shoes were needed, and dedinetly not any oroof that they weren't harmful. Traditional farriery is based around the skill of putting on shoes and they need great knowledge of the hoof itself, it is an impressive skill, however it is becoming outdated and here is why.\n\nThe hoof is a part of the horses' cardiovascular system, as there is very little backflow from the lower leg back to the heart the frog of the hoof pushes into the digital cushion upon contact with the ground  forcing blood up the horses leg. \n\nThe frog and sole of the hoof which is lifted above ground during shoeing are a big part of the dissipation of force during movement in the horse. Restricting force to only the hoof wall will put extra strain on tendons and joints, which is the leading causes of retirement in competing horses.\n\nAs we nail the hoof wall it looses its structural integrity, therefore if a nailed shoe falls of or the horse is newly transitioned out of shoes the hoof wall will be weak and not able to protect the inner structure of the hoof as well.\n\nAnd still after all of this many people claim that the hoof is \"bred out of the horse\", and that some horses can't manage barefoot. This is extremely rare,, a propely balanced diet, proper exercise and good living conditions are essential to perfect hoof health in a domesticated horse. \nThe horses living 22 hours per day in stalls have a much slimmer chance of having properly functioning hooves, but this stays well hidden when putting metal shoes on, thus the horse can continue doing work until there are more injuries down the line from compensation.\nThere are also great alternatives to metal shoes in the form of boots that are just put over the hoof and tightened around it, which can be used to remove the issue of exsessive wear/soreness.\n\nThis year the Swedish showjumping team were gold medalists in the olympics, where 2/3 riders were barefoot. World number 1, 3 and 12 have ALL their horses without metal shoes. There are more horses in the top 50's but the ones mentioned I know the most of. They are proving everything about large sportshorses having bad feet, as they have excellent hoof quality after not having good hoves at all in years prior to this switch.\nLater this year a huge study about barefoot performance and soundness will be published with the help of a swedish horse insurance company and many recignized vetrinarians and top riders from around the world.\n\nI have myself had shoed horses for about 7 years before I took them off to retire my oldest horse, only for them to be better than ever and go back out competing. After this all of mine have been barefoot, even the hopeless thoroughbred that could not keep shoes, and there is yet to be one that hasn't managed excellently with proper diet and trimming management.\nFor the sake of longewity in the horse indistry I hope the results of the studies mentioned are as promising as my own.",
            "title_similarity": "0.70992875"
        },
        {
            "id": "hvi19rg",
            "score": 1,
            "text": "Horseshoes are one of those things where you can’t really see how they were invented.\n\nThe idea that someone one day looked at their horse and thought “what this animal needs is a piece of metal hammered into its feet”.",
            "title_similarity": "0.67216444"
        },
        {
            "id": "hvi2ov9",
            "score": 1,
            "text": "Growth rates vary depending on the substrate the animal has evolved to compensate for.\n\nI was involved in a zebra project 3 decades ago that transplanted zebras from a mountainous rocky area to a sandy one and they had to be put down due to overgrowth of the hooves.",
            "title_similarity": "0.54593"
        },
        {
            "id": "hvi2q1p",
            "score": 2,
            "text": "In the wild a horses hooves wear down at the same rate they grow so they maintain themselves. They don’t have to carry any extra weight from a rider or cargo and they just run on grass.\n\nDomesticated horses hooves wear down faster while they carry the extra weight of a rider, cargo, and walk on rougher surfaces like stone, brick, and paved roads. So they have shoes to protect their hooves and prevent them from wearing down so fast.",
            "title_similarity": "0.61648357"
        },
        {
            "id": "hvi3206",
            "score": 1,
            "text": "Look up horse hoof capsule removal. Hooves are basically fingernails. Shoes are used to prevent damage to the hooves themselves.",
            "title_similarity": "0.5963608"
        },
        {
            "id": "hvi5anj",
            "score": 1,
            "text": "Wild horses are much more active than hobby horses, but they don't walk on cement or pavement or bricks like hobby horses.  \n\n\nAlso, some hobby breeds have more brittle hooves that can chip or crack and turn into an infection or make them lame, so they get shoes to reinforce the hoof wall.",
            "title_similarity": "0.68966913"
        },
        {
            "id": "hvi6w79",
            "score": 8,
            "text": "Pretty funny copypasta that seems relevant here :\n\n\nIn the beginning, there was Eohippus. The proto-horse. It was a small hooved animal about the size of a dog, and it ate grass. It was a simple creature, and in my (factual) opinion it represents the last time that the Horse lineage was untainted by sin. Now, it is worth noting that life was not easy for this proto-horse, in fact life for early hooved mammals was so difficult, that some of them said \"fuck that\" and moonwalked back into the ocean to become cetaceans (Whales and Dolphins). That's right, The proto-horse had so stupid an existence, that hooved mammals went back into the ocean (lacking gills and flippers) and had more success than horses would have on land. \n\nOkay, So why was life so hard for Eohippus? Well, they are herbivores eating almost exclusively grasses. Grasses, as you may know, are not particularly nutritious. But more importantly, grasses are smarter than Horses. See, Grass does not want to be eaten, and evolutionary pressure caused the grasses to start incorporating silica (ie sand) into their structure. Silica is extremely hard. Hard enough to wear down Horse teeth. Now there is another evolutionary pressure acting on Eohippus; It's teeth wear down by the mere act of eating, to the point that it will starve to death. Eohippus teeth do not regrow, instead, Eohippus evolved bigger teeth. However, bigger teeth mean a bigger jaw, bigger head, and a bigger body to carry it. \n\nThese opposing evolutionary pressures started an arms race in which the grasses incorporated more and more silica, and Horses got bigger and bigger, just so they would have big enough teeth to grow and reproduce before finally starving to death. And eventually our cute dog-sized pony evolved into the 1,500-pound, dumb-as-rocks prey animal i loathe today. \n\nBut wait, there's more! See, Horses are extremely fragile. There is a reason why a \"horse doctor\" typically prescribes a dose of double-0 buckshot in the event of a leg injury. A horse is very heavy, and it has very thin legs to carry that weight. If any one leg gets fractured, it is exceptionally unlikely that it will heal well enough for the Horse to walk again, and is extremely likely to break again just carrying the weight of the horse. Remember, a human thigh bone is gigantic relative to the size of our bodies, a horse leg bone is absolutely minuscule relative to the weight it carries. \n\nAlso, Hooves: I want you to imagine that instead of feet, you have a giant toenail at the end of your leg. That is how the Horse do. That is what a hoof is. A giant toenail. It is extremely delicate, and joined to the leg by a vast network of very fine connective tissue, and oh yeah it also bears the weight of a fucking HORSE. If a hoof gets infected (which is quite common, because imagine how often shit would get stuck under your toenails if you walked on them), the Horse immune system responds in the typical way: via inflammation of the area. The problem is, a horse hoof is a rigid \"cup\". It cannot accomodate the swelling from inflammatory response. The Horse hoof will basically pop off the leg like a sock. On top of that, remember the Horse is putting 1,500 pounds of weight on it (because Horses can't redistribute their weight very well since all of their legs can BARELY support their share of the total weight). \n\nSo, Horse apologists will claim that Horses are good at one thing: Turning Grass into Fast. As the previous two paragraphs show, they can't even do that right. Locomotion is very dangerous for a Horse, and if the Fast doesn't kill them they'll starve to death just by eating. \n\nOn top of that, they are dumb as all fuck. Horses will often do something called \"Cribbing\", which is when they decide to bite down on something (literally anything) as hard as they can, and suck in air. They just keep sucking in air until they inflate like a balloon. Eventually, the vet will show up and literally deflate the Horse with a long needle to let the air out of them, and hopefully get them to just... stop... \n\nFirst off, horses are obligate nasal breathers. If our noses are stuffed up we can breathe through our mouths. If our pets' noses are stuffed up (except for rabbits, who are also really fragile but unlike horses aren't stuck having only one baby a year) they can breathe through their mouths. If a horse can't breathe through its nose, it will suffocate and die. \n\nHorse eyes are exquisitely sensitive to steroids. Most animal eyes are, except for cows because cows are tanks, but horses are extremely sensitive. Corneal ulcers won't heal. They'll probably get worse. They might rupture and cause eyeball fluid to leak out. \n\nIf you overexert a horse they can get exertional rhabodmyolysis. Basically you overwork their muscles and they break down and die and release their contents. Super painful, and then you get scarifying and necrosis. But that's not the problem. See, when muscles die hey release myoglobin, which goes into the blood and is filtered by the kidneys. If you dump a bucket of myoglobin into the blood then it shreds the kidneys, causing acutel renal failure. This kills the horse. People and other animals can get that too but in school we only talked about it in context of the horse. \n\nHorses can only have one foal at a time. Their uterus simply can't support two foals. If a pregnant horse has twins you have to abort one or they'll both die and possibly kill the mother with them. A lot of this has to do with the way horse placentas work. \n\nIf a horse rears up on its hind legs it can fall over, hit the back of its head, and get a traumatic brain injury. \n\nNow to their digestive system. Oh boy. First of all, they can't vomit. There's an incredibly tight sphincter in between the stomach and esophagus that simply won't open up. If a horse is vomiting it's literally about to die. In many cases their stomach will rupture before they vomit. When treating colic you need to reflux the horse, which means shoving a tube into their stomach and pumping out any material to decompress the stomach and proximal GI tract. Their small intestines are 70+ feet long (which is expected for a big herbivore) and can get strangulated, which is fatal without surgery. \n\nLet's go to the large intestine. Horses are hindgut fermenters, not ruminants. I'll spare you the diagram and extended anatomy lesson but here's what you need to know: Their cecum is large enough to shove a person into, and the path of digesta doubles back on itself. The large intestine is very long, has segments of various diameters, multiple flexures, and doubles back on itself several times. It's not anchored to the body wall with mesentery like it is in many other animals. The spleen can get trapped. Parts of the colon can get filled with gas or digested food and/or get displaced. Parts of the large intestine can twist on themselves, causing torsions or volvulus. These conditions can range from mildly painful to excruciating. Many require surgery or intense medical therapy for the horse to have any chance of surviving. Any part of the large intestine can fail at any time and potentially kill the horse. A change in feed can cause colic. Giving birth can cause I believe a large colon volvulus I don't know at the moment I'm going into small animal medicine. Infections can cause colic. Lots of things can cause colic and you better hope it's an impaction that can be treated on the farm and not enteritis or a volvulus. \n\nAnd now the legs. Before we start with bones and hooves let's talk about the skin. The skin on horse legs, particularly their lower legs, is under a lot of tension and has basically no subcutaneous tissue. If a horse lacerated its legs and has a dangling flap of skin that's a fucking nightmare. That skin is incredibly difficult to successfully suture back together because it's under so much tension. There's basically no subcutaneous tissue underneath. You need to use releasing incisions and all sorts of undermining techniques to even get the skin loose enough to close without tearing itself apart afterwards. Also horses like to get this thing called proud flesh where scar tissue just builds up into this giant ugly mass that restricts movement. If a horse severely lacerated a leg it will take months to heal and the prognosis is not great. \n\nI hope this information has enlightened you, and that you will join me in hating these stupid goddamn bastard animals.",
            "title_similarity": "0.56191707"
        },
        {
            "id": "hvicohu",
            "score": 1,
            "text": "Think of trimming dog nails. If a dog is mostly indoors, you need to trim their nails. If they are mostly outside, usual wear and tear keeps them shorter. Walking a dog on concrete sidewalks helps to keep their nails trimmed.\nSame with horses. If they get to run all day the hooves break naturally and a ferrier isn't necessary needed.\nAs someone said before, if the are walking or working on hard, worn surfaces the hooves wear faster. That's what the shoe is for. Protecting the hooves from wearing too fast.",
            "title_similarity": "0.5623108"
        },
        {
            "id": "hviebxb",
            "score": 1,
            "text": "Wild horses don't need to protect their feet because they are in nature? Free to roam, on what would be all natural surfaces in nature? \n\nVs farmed horses? Around more wood, concrete? Other unnatural ( to them) man made structures? \nPlus glass?",
            "title_similarity": "0.58416384"
        },
        {
            "id": "hvig2le",
            "score": 1,
            "text": "If theyre running on dirt all day, the horses don't need to be shoed. However, if the horse will be on stone, pavement, or other hard surfaces, then yes. The horse will get sore feet. That's the purpose of the shoe.",
            "title_similarity": "0.5912452"
        },
        {
            "id": "hvikuv6",
            "score": 1,
            "text": "Do you see wild horses with people on their backs or packing a load? \n\nWild humans used to not have shoes either but it's nice to have them and to get your toe nails clipped.",
            "title_similarity": "0.7244668"
        },
        {
            "id": "hvin2rd",
            "score": 1,
            "text": "Why do sports players wear cleats?  Same principle, better traction.  But also adds protection to hoofs.",
            "title_similarity": "0.47228736"
        },
        {
            "id": "hvink9x",
            "score": 1,
            "text": "Would your feet hurt if never using shoe's?",
            "title_similarity": "0.39688587"
        },
        {
            "id": "hviqwxm",
            "score": 2,
            "text": "The most basic of explanations:\nWild horses: only weight they carry is their own = no shoes.\nHorses that are ridden: carrying an extra 100-200 pounds on their back = could use some extra support in the form of shoes.",
            "title_similarity": "0.68443984"
        },
        {
            "id": "hvitw38",
            "score": 3,
            "text": "Anatomically, horses are walking around on the tips of their middle fingers.   Their legs and hooves are sensitive and an injury can turn an athlete into a pasture pet in an instant.   Shoes provide protection and support, help to keep the angle of the hoof one that best supports the mechanics of the rest of the leg.  There’s a triangular softer area on the bottom of the foot to help cushion, it’s called a ‘frog’”, helping that, and the rest of the sole keep from getting bruised or chipped can help to prevent very painful abscesses.   Mustangs do have stronger feet than a lot of the more “domestic” breeds but hoof health is something that horse people monitor constantly.  We say “no hoof, no horse” for a reason! \n\nPrimitive humans also walked around barefoot all of the time, it didn’t work out super well for all of them.",
            "title_similarity": "0.6520014"
        },
        {
            "id": "hvj56b3",
            "score": 1,
            "text": "Horses evolved to run on dirt soil / natural surfaces. Large portions of the planet's land surface are now covered by asphalt.",
            "title_similarity": "0.49804062"
        },
        {
            "id": "hvjbppi",
            "score": 1,
            "text": "I think horses that walk on pavement and working horses need them and since while horses are generally in fields and pastures they don’t need them",
            "title_similarity": "0.47729814"
        },
        {
            "id": "hvje56p",
            "score": 1,
            "text": "Another reason we shoe horses is due to selective breeding. Basically we’ve taken the Arabian horse (it was basically the paragon of horses and is the root horse for most breeds developed in the hot blood varieties although the Arabian of today looks VERY different than the Arabian ridden into battle in medieval times) through the last few thousand years and as we selectively bred for visually attractive traits horses also sometimes lost their hoof hardness. Some horses now have tender feet and limp or gimp along when walking barefoot over pebbled/rocky ground. Back to Arabians, most have super tough hooves and can be run barefoot over hard/pebbles ground just fine without much risk of a thing called stone bruises. Many other horses like the majority of quarter horses and paint horses descended from show stock need shoes just to be ridden in anything more than a soft pasture or a well-tilled arena. In the equestrian world a good rule of thumb about whether or not a horse’s hoof is dense and hard naturally without using cosmetics like hoof hardnerncan be seen In the color of the hoof wall. A dark hoof is going to be harder. A pale or multicolored hoof will usually be softer.\n\nAdditionally cold blooded draft horses have been so selectively bred for size and muscle their hooves literally cannot support their great weight. Their hooves will collapse outward around the bone column without the support of a shoe. Shoes ok big drafts like Clydesdales and Percherons keep the hoof properly shaped and prevent lameness. \n\nShoes in general also help a horse carrying a rider often keep their hooves in the same oval-ish shape for optimal balance and gait. For some horses with white lime disease or other hoof issues a shoe can keep their crumbling foot together so they can survive. \n\nBack to selective breeding, wild horses quickly revert back to optimal horse shapes, kind of a dumpy short quarter horse look with supremely hard hooves after just a few generations of Darwinian evolution. Soft footed horses can’t outrun predators and will get stone bruises which lead to abscesses in the hoof which lead to lameness and then predation or death. So wild horses do not need shoes because they’re the right size and weight for their hooves and their hooves are genetically tougher than the standard domestic horse. Also they’re not carrying a fat human around that would cause further wear and tear.",
            "title_similarity": "0.7202807"
        },
        {
            "id": "hvjrwm9",
            "score": 1,
            "text": "When did we as humans start putting horse shoes on horses?",
            "title_similarity": "0.5886189"
        },
        {
            "id": "hvjs5ln",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0011720248"
        },
        {
            "id": "hvjy5i1",
            "score": 1,
            "text": "I live where wild horses roam.  Usually they walk in the dirt, seldom on roads. They evolved without shoes for millions of years.  They didn't need shoes then and walking in the dirt is normal.",
            "title_similarity": "0.55649513"
        },
        {
            "id": "hvk3264",
            "score": 1,
            "text": "One point that gets seriously overlooked with horses is how much selective-breeding we have done with them. Basically, humans have selectively bred horses that can stand up to the work we put them through, by being fitted with metal shoes under the regular care and maintenance of a farrier. If the horses feet were not up to being reinforced with shoes so that they can tolerate ‘work’, then they were not used as breeding stock and, thus, the genetic line becomes removed. There are hardly any examples of equids in the wild that don’t, in some part of their recent ancestry, have heavy influence from selective breeding.",
            "title_similarity": "0.66652036"
        },
        {
            "id": "hvk3qnt",
            "score": 2,
            "text": "Horses don’t need shoes. It’s a common thing to do but they actually don’t need them. \n\nWhen a horse is properly housed (24/7 free to roam outside, with enough space, with other horses and with constant available food) it doesn’t need shoes. Their hooves will be healthy from the constant walking around. \n\nShoes are an easy way to keep hooves ‘healthy’. But it fucks with their blood flow in their legs, so they are not that healthy. \n\n\nBut this opinion of mine isn’t the most common so most of the so said ‘Horse people’ will tell you that horses need shoes and a bit.",
            "title_similarity": "0.5083087"
        },
        {
            "id": "hvk6lhd",
            "score": 2,
            "text": "Of the many reasons listed one not mentioned yet. We have a rescued off track thouroughbred ( ex race horse ) and his feet are so sensitive from all the work on the track and the fact that he has worn shoes his hole life that he basically has to wear them. Which sucks because it's much cheaper to not have to switch out shoes every few months.",
            "title_similarity": "0.56369066"
        },
        {
            "id": "hw1uuzz",
            "score": 1,
            "text": "To alleviate problems from worn hooves, horseshoes were invented. Thin, metal horseshoes attached to hooves help to slow down the rate at which the hooves wear down. They also provide additional shock absorbency, as well as added traction to help horses to walk, run, and work with more confidence.",
            "title_similarity": "0.6364985"
        },
        {
            "id": "hw2qun0",
            "score": 1,
            "text": "Paved roads, concrete, etc. These things do not exist in the wild. Work horses that pull things don't exist in the wild.",
            "title_similarity": "0.47989592"
        }
    ]
}