{
    "ELI5: Why do European trucks have their engine below the driver compared to US trucks which have the engine in front of the driver?\n": [
        {
            "id": "hvxn75e",
            "score": -1,
            "text": "Never mind ferries, American engine out front chasis are safer and ride 1000 percent better. The shittiest ride ever are cab overs.",
            "title_similarity": "0.4683193"
        },
        {
            "id": "hvxv6ot",
            "score": 0,
            "text": "Its so the driver can see whats infront of his truck. The american nose design blocks the view of the driver from what is direvtly infront of his truck",
            "title_similarity": "0.61425155"
        },
        {
            "id": "hvxkith",
            "score": -2,
            "text": "Usa = Cargo -> max length.\nEurope = Cab & Cargo -> max length \nEuropean truck can carry more because they don’t have a big cab",
            "title_similarity": "0.69603354"
        },
        {
            "id": "hvxeqce",
            "score": 2,
            "text": "Streets are narrower so lenght limiter are shorter, in Effect needing trucka to be shorter to. Placing engine Bellow cabin safes space",
            "title_similarity": "0.6302923"
        },
        {
            "id": "hvxw8s7",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.16001825"
        },
        {
            "id": "hvybpka",
            "score": -3,
            "text": "The European trucks give the driver a much better view of the road due to the lack of a hood. Euro trucks are more maneuverable and fuel efficient where as American trucks are more about looks over functionality so the truck makers can charge more money for their trucks. Good products barely ever make it to market in America !",
            "title_similarity": "0.691811"
        },
        {
            "id": "hvxl1z6",
            "score": 16,
            "text": "It’s an interesting question. I’ve always found the American configuration odd because you have more blind spots(up front) in comparison with the “European” configuration\n\nEdit: as a non-trucker thanks for the interesting discussion",
            "title_similarity": "0.5215516"
        },
        {
            "id": "hvym7m2",
            "score": 0,
            "text": "It comes down to road infrastructure as well as laws. Our highways are built to accommodate large tractor trailers.",
            "title_similarity": "0.5053483"
        },
        {
            "id": "hvynov6",
            "score": 0,
            "text": "To make the change from Euro Truck Simulator to American Truck Simulator more exciting and different",
            "title_similarity": "0.5340881"
        },
        {
            "id": "hvyse0c",
            "score": 0,
            "text": "It's because the Europeans know that if they put the engine in front of the driver, they'll get a lot of complaints from the American drivers about the noise and fumes.",
            "title_similarity": "0.5705559"
        },
        {
            "id": "hw196y9",
            "score": 0,
            "text": "Choosing between ETS2 and ATS?",
            "title_similarity": "0.2604762"
        },
        {
            "id": "hw19rhu",
            "score": 0,
            "text": "In Europe the drivers drive their trucks, much like Cowboys riding their horses. \nIn America the Trucks drive their drivers. Like a sled dog team.",
            "title_similarity": "0.60271174"
        },
        {
            "id": "hw1os27",
            "score": 0,
            "text": "It's mainly a safety issue. Having the engine in front increases the chance of surviving a head on crash into a wall.",
            "title_similarity": "0.501734"
        },
        {
            "id": "hw1p1j4",
            "score": 0,
            "text": "I am surprised that the most important thing isn’t mentioned.  \n\nThe shorter cabs, cabovers aka engine underneath, versus conventional, engines in front isn’t mentioned.  \n\nThe maneuverability of the cabover is much better in the city and tighter streets and delivery locations.  The cabover is far more noisier and rough riding versus the conventional.  Larger delivery lots make the conventional cab easier to back in, swing around and such. \n\nThe biggest is the huge amounts of highway they travel. The conventional cab is smoother and less noisy for the hundreds and thousands of miles they traverse.  \n\nRemember, Texas is the size of Europe.  American truckers travel a bit further for longer periods of time.",
            "title_similarity": "0.64523196"
        },
        {
            "id": "hw1ph28",
            "score": 0,
            "text": "Older the roads are the smaller they are.   Nice roads are striated east to west with the oldest being east because we moved westward across the globe. Europe has the oldest smallest roads compared to the US.  Especially all the way out west.",
            "title_similarity": "0.50455606"
        },
        {
            "id": "hvxu4dh",
            "score": 1,
            "text": "Aha! But why are all the world's trucks still 100% flat and square at the end?\nIt's so anti-aerodynamic!\nWhat about a tiny movable spoiler?",
            "title_similarity": "0.4793137"
        },
        {
            "id": "hvy0pni",
            "score": 1,
            "text": "Another reason I heard is because truck drivers in the US generally spend more time away from home so their living space needs to be bigger and more comfortable",
            "title_similarity": "0.5412117"
        },
        {
            "id": "hvy1ojq",
            "score": 1,
            "text": "In the US, you never know when you’ll need to use the engine block as cover from gunfire.",
            "title_similarity": "0.43950626"
        },
        {
            "id": "hvyrpun",
            "score": 1,
            "text": "There are some over cab trucks in the USA. Source: I used to drive one into Boston and it sucked",
            "title_similarity": "0.5189954"
        },
        {
            "id": "hvxe4yv",
            "score": 35,
            "text": "At high speeds (greater than 136 kmph) and on long American expanses, cabovers offer a shorter wheelbase with reduced stability.  Cabovers are far more maneuverable in the city though.",
            "title_similarity": "0.5498327"
        },
        {
            "id": "hvxqesn",
            "score": -8,
            "text": "Traditionally, US vehicles have always been bigger than European ones. Or rather, more poorly packaged. Looking at pics of Walmart shoppers, no real surprise.",
            "title_similarity": "0.42560965"
        },
        {
            "id": "hvxme6d",
            "score": 2,
            "text": "Overlooked fact, is most comments focus on the narrow roads and infrastructure in Europe: in the 1950s the German minister of transportation Hans Seebohm tried to make rail based transport more competitive. As part of the seebohm-laws (Seebohmsche Gesetze)the weight and length allowed for trucks was severely limited. While the laws were relaxed and harmonized across Europe in later years, at least the influential German truck makers reacted by focusing on cab-over type designs.",
            "title_similarity": "0.7161748"
        },
        {
            "id": "hvxq5iq",
            "score": 2,
            "text": "In Europe, they protect the driver from landmines. In America, they protect them from cannonfire.",
            "title_similarity": "0.55419016"
        },
        {
            "id": "hvy49xg",
            "score": 2,
            "text": "Cab-overs (the EU kind) were thought to be more energy efficient in like the 80s so everyone adopted it. Truck makers in the 90s found new aerodynamic ways to exploit designs to get more energy efficiency from being aerodynamically designed. So the US truckers switched back for MPG. EU truckers stuck with the cab-over due to size limitations in EU countries, and because EU city roads are much smaller and more condensed so space is limited.",
            "title_similarity": "0.65860593"
        },
        {
            "id": "hvy8afl",
            "score": 2,
            "text": "I dont remember where I saw this, but a video I saw a while back mentioned that the US trucks are like this now because of safety regulations. I think the american trucks might be safer in a crash",
            "title_similarity": "0.5350159"
        },
        {
            "id": "hvzeek8",
            "score": -2,
            "text": "hello i am home just drove on the autobahn 130 mph with no hazzle. european trucks are fu\\*\\*ing engineering marvels. they have 12 gears at least. their length ist restricted (20m) but this will hopefully change in the future. and then artificial driving will kick in few years from now.",
            "title_similarity": "0.5315111"
        },
        {
            "id": "hvxmrt6",
            "score": -11,
            "text": "Because America always have to have the 'biggest' as they associate that with being 'better' than everyone else. Other countries design stuff to suit their needs without the massive ego.",
            "title_similarity": "0.43642962"
        },
        {
            "id": "hvxezfg",
            "score": 30,
            "text": "You get both in the U.S. Remember cabover Pete from the song Convoy?  \n\n\n...anybody? He had a reefer on? Hello?",
            "title_similarity": "0.3407821"
        },
        {
            "id": "hvxn4ab",
            "score": 2,
            "text": "Short answer: Because roads and delivery sites are usually smaller in Europe than in the US since they were built before trucks were invented",
            "title_similarity": "0.63687646"
        },
        {
            "id": "hvy3xkp",
            "score": 3,
            "text": "Multiple reasons. The first one is that Europe limits the entire length of the truck whilst America only limits the cargo length. The second reason is that Europe's streets are generally way smaller so having a truck the size of Ben Shapiro's ego would be one expensive joke. Another reason is that trucks in America have to travel a lot further than European ones before reaching their destination. And lastly America has no special speed limits for trucks whereas Europe does so we really don't need that much power on this side of the Pond when the fastest you're allowed to go is like 90 km/h.",
            "title_similarity": "0.6960681"
        },
        {
            "id": "hvy5qvg",
            "score": -2,
            "text": "Ain't it obvious? Medical treatment is cheaper in Europe as compared to USA.\n\nEdit - I guess #sarcasm should be mandatory.",
            "title_similarity": "0.5459937"
        },
        {
            "id": "hvxd23u",
            "score": 46,
            "text": "In Europe the maximum length of the truck is  truck+the trailer while in USA the maximum length is defined by the length of the thing being pulled so they can be longer.",
            "title_similarity": "0.6226339"
        },
        {
            "id": "hvxnfx2",
            "score": 25,
            "text": "For Germany there is a simple reason:\n\nThere were many trucks with front engines until the 1950's. \n\nAt the end of the 1950's the former minister of transport, Mr. Seebohm, passed a regulation, whereby trucks are just allowed to be 14 meters long and 24 tons heavy. He wanted to boost the German Railroad, which then was a public enterprise. \n\nBefore that regulation, trucks could be 20 meters long and up to 40 tons heavy. They simply were too efficient and nobody used trains, because trucks were simply better - faster, cheaper and roads are everywhere. Furthermore you don't need to load the cargo from truck to train to truck again.\n\nSo to get more space for loading, the front engine needed to move under the driver, so you gain about 2 meters extra space for cargo.\n\nBy the time the drivers loved the new trucks more and more, because of better sight and manoeuvrability. These advantages replaced the front engine style in Europe. \n\nNowadays the regulation allows 18,75 meters at 40 tons maximum weight (truck + trailer + cargo).\n\n\ntl:dr: A regulation from a former Minister of transport in Germany restricted the total length of trucks to 14 meters to boost German Railroad. Therefore the engine of trucks moved under the driver to gain extra space for cargo.",
            "title_similarity": "0.5712949"
        },
        {
            "id": "hvxct8h",
            "score": 143,
            "text": "Its related to the roads they drive on. While US Trucks basically drive exclusively on highways and wide roads in cities, that were designed with car and truck traffic in mind. European and Japanese trucks have to drive through cities that have older, narrow street layouts. Therefore the length and maneuverability are critical. With a long front end, and therefore a longer wheelbase, that becomes a disadvantage.",
            "title_similarity": "0.6935749"
        },
        {
            "id": "hvxtd9m",
            "score": 5,
            "text": "Aerodynamics play a role as well. Cabovers are very flat nosed whereas conventional cabs are a little more Aerodynamic and US trucks tend to spend more time on the interstate at higher speeds than European trucks just due to the size of the country.",
            "title_similarity": "0.621813"
        },
        {
            "id": "hvy8m55",
            "score": 5,
            "text": "I'm seeing a lot of bullshit answers so  here it goes:\n\n\\- in the EU the length of the entire truck is regulated and it includes truck+trailer, while in the USA only the length of the trailer is regulated, so they had to be shorter due to EU laws/taxes.",
            "title_similarity": "0.72192013"
        },
        {
            "id": "hvxilw5",
            "score": 23,
            "text": "This is Jack Burton in the Pork Chop Express, and I’m talkin’ to whoever’s listenin’ out there.",
            "title_similarity": "0.44850835"
        },
        {
            "id": "hvxncrg",
            "score": 10,
            "text": "Simply because of space. Europe is cramped. America and Australia are wide open. The longer your wheel base is, the smoother the ride is. If there's no need to worry about space then the best option is to extend the wheel base for comfort and reducing driving fatigue. Putting the engine out front is also safer for the driver in the event of a collision. It also allows for better aerodynamics for better fuel efficiency.",
            "title_similarity": "0.53748906"
        },
        {
            "id": "hvxd4a4",
            "score": 89,
            "text": "I drive a truck in Australia, and basically trucks with the engine in Front I built for the highway, cabovers are built for the city.",
            "title_similarity": "0.5571746"
        },
        {
            "id": "hvxh9vi",
            "score": 592,
            "text": "I'm seeing lots of reasons why European trucks have the engine below the driver, but I'm not seeing anything explaining why US trucks don't.\n\nSo what's the advantage of the engine being in front of the driver?  Is it just aesthetics?",
            "title_similarity": "0.8043039"
        },
        {
            "id": "hvxfki0",
            "score": 984,
            "text": "Australia has both.\n\nIn the early days, American trucks were the only things that could deal with the shit roads (or no roads) and crushing heat.\n\nVolvo changed that image, and opened the door to euro trucks.\n\nIn the end it comes down to usage.\nAmericans still rule the outback, while the compact euros dominate the cities.",
            "title_similarity": "0.6187402"
        },
        {
            "id": "hvxw2tq",
            "score": 115,
            "text": "To reduce length. As trailers got bigger, governments passed length limits, including North America. In the 70s, Cabovers were very popular on the interstate, especially east coast. However around 1980, the US government lifted such limits. American cabovers were not that great, so conventionals won the market. [Disadvantages of American cabovers](https://youtu.be/Nd_ZbyjT1LE) . However Europe still has smaller roads, so they still need cabover",
            "title_similarity": "0.57853454"
        },
        {
            "id": "hvxd3o4",
            "score": 3601,
            "text": "It is due to the way countries regulate how long a truck can be.\n\nIn Europe it is usually the entire length of the truck and trailer and in the US it is just the trailer.\n\nSince you want to maximize cargo space and make the trailers as long as possible, they usually shorten the truck in Europe by putting the engines underneath the cab.\n\nThis may sound like a stupid regulation until you have seen just how small and narrow and devoid of space cities in Europe can be. Every centimeter counts.",
            "title_similarity": "0.70012325"
        },
        {
            "id": "hvxd0fq",
            "score": 11745,
            "text": "The length of European trucks is limited as a whole.\nTo maximise load capacity, the engine is under the cab to save 2 metres of length.\nAmerica did have cabovers, but as there are less restrictions of the cab in America, the conventional won over.",
            "title_similarity": "0.71293133"
        },
        {
            "id": "hvxd6gt",
            "score": 3,
            "text": "We use to have a lot more Cab Over engine semis in the US, it was a overall length thing, the trailer could be a bit longer if the truck was shorter, but the regulations loosened and COE fell out of favor for cheaper and slightly more aerodynamic designs. Idk but I'm guessing the EU has more stringent size restrictions.",
            "title_similarity": "0.64181787"
        },
        {
            "id": "hvxjjff",
            "score": 2,
            "text": "I’ve read the comments below about space regulations in Europe being the reason for the engines under the hood.\n\nFollow up question- is there any performance advantage of engine location in North American vs European trucks?",
            "title_similarity": "0.72832364"
        },
        {
            "id": "hvxnk7j",
            "score": 3,
            "text": "I once saw a funny way of an explanation for that, they described the trucks like they were dog breeds. \nIn that explanation, the main argument was that because european truck drivers only need a bunk and some basic stuff like a mini fridge for snacks or similar. In western europe the driver very likely has a highway station to eat, shower, and park the truck to sleep when needed. And if not every night, at least the next day they'll get to one. So the cab can be smaller and more compact. \nAn american trucker driving across country can find themself in absolutely buttfuck nowhere, with the next gas station being 300 km away (I guess, I'm not american, just reciting the post). So he'll have to be able to basically camp in the wilderness for the night, and the truck has to support that. Therefore the cabs bigger, maybe has a small kitchen, bigger gas tanks etc. Fitting that on top would not be feasible, so the motors placed in front. \n\nI can't vouch that this is correct, never drove a truck. It's just what I remember the post said.",
            "title_similarity": "0.6371519"
        },
        {
            "id": "hvxo9pp",
            "score": 2,
            "text": "i think one part in addition to length etc is also that the European trucks are also better to maneuver through tight european roads. especially in the villages there is not too much space at times, and having engine and wheels directly beneath makes it easier to turn and get through these tight spaces as opposed to having 2 meters of truck in front of you.",
            "title_similarity": "0.6146825"
        },
        {
            "id": "hvxoc8z",
            "score": 18,
            "text": "We used to use cab over trucks in America when we still had length laws. Ohio limited the overall length of a tractor trailer to 60 feet. With a 45 foot trailer (standard at the time), you could only have 15 feet of the tractor extended beyond the trailer. That required those short cab overs, (I hated those btw). If you got caught over length in Ohio, they would fine you and you had to hire someone to pull your trailer out of state, (or to the next exit). When the 48 foot trailers came along, a lot of states wanted to ban them but the federal government overruled them and allowed them on interstate and US highways. The states have in and that pretty much did away with the length laws. That pretty much did away with cab overs and I, like most drivers was glad to see those pieces of shit go.",
            "title_similarity": "0.60979384"
        },
        {
            "id": "hvxohvz",
            "score": 62,
            "text": "If you are talking Cab overs, they're in North America too. HINO is usually synonymous with cab over trucks. It gives you a tighter turning radius. They can be articulated too I think.",
            "title_similarity": "0.6030554"
        },
        {
            "id": "hvxrhlc",
            "score": 2,
            "text": "Generally speaking,  Fitting in the infrastructure is more important for truckers in Europe because of the age old cities while space to sleep in your cab is a more important for truckers in North America because of the long haul distances. As an aside, Trucks can and do use car ferries every day in North America.",
            "title_similarity": "0.61793065"
        },
        {
            "id": "hvxtdm7",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.16001825"
        },
        {
            "id": "hvxtksr",
            "score": 2,
            "text": "Interesting. \n\nHere in SA we have more cabovers (cab above engine) than the longer ones. If you see a truck/lorry with the engine in front, it is a very rare sight, but you do get to see them.",
            "title_similarity": "0.5683149"
        },
        {
            "id": "hvxvn1i",
            "score": 2,
            "text": "25 year old Canadian ignorant here, there might be laws in the EU for truck lengths, but there is also trucks with their motors below the driver here, I drove several of them.\n\nI think it comes from design choices, but \"flat nose\" trucks are way easier to drive as they turn easier (less length) and you get a better field of view and vertical viewing angle to be sure you're not hitting anything in tight spots in crowded cities. Flat noses are the best.",
            "title_similarity": "0.6481982"
        },
        {
            "id": "hvxwy8y",
            "score": 2,
            "text": "Also, cabover trucks tend to be more maneuverable, but less comfortable.  Shorter wheelbase makes the ride rougher, and the engine noise is generally going to be louder in a cabover, and noise is a stressor that makes the ride more miserable.   \n\nIn general, my understanding is that streets in European cities tend to be older and smaller which makes more maneuverable trucks an advantage.   \n\nUSA built out a lot of their road infrastructure in much more modern times and there tends to be a lot more space for big trucks to maneuver.",
            "title_similarity": "0.64795625"
        },
        {
            "id": "hvxx22n",
            "score": 2,
            "text": "In America, the standard trailer is limited to 53 feet but there are no such restrictions on the cab. Since many truckers in Murica sleep in their cabs on the road, there is usually living space behind the cockpit as well. It can get very elaborate.",
            "title_similarity": "0.50551796"
        },
        {
            "id": "hvxxcoh",
            "score": 2,
            "text": "I thought it was safety, to avoid the engine crushing the driver?\n\nAnyone confirm?",
            "title_similarity": "0.4431579"
        },
        {
            "id": "hvxxo72",
            "score": 2,
            "text": "interesting to see the answers here - seems to be to do with length regulations and the likelihood of being on a ferry.\n\nare there any truck drivers out there who have tried both styles and can offer an educated opinion on which style is best from a driver's point of view?",
            "title_similarity": "0.5511888"
        },
        {
            "id": "hvxxwj1",
            "score": 2,
            "text": "Space.  Many European cities were build long before trucks or even motor vehicles so the roads are much smaller and unforgiving to large vehicles.",
            "title_similarity": "0.56310177"
        },
        {
            "id": "hvxzdbs",
            "score": 2,
            "text": "These are commonly referred to as \"cab over\" or COE (Cab Over Engine). Back in the 1970s and 1980s they were common in the US. The reason was because regulations limited the overall length of the truck and trailer and shortening the truck allowed them to pull longer trailers which translated to larger loads.\n\nIn 1975 the regulations changed to limit the length if the load (i.e. trailer) and did not include the truck in the limit. With this change, fewer fewer cab over trucks were used because they are limited on horsepower, harder to maintain, and many drivers don't like the way they handle with the front wheels directly under the cab.",
            "title_similarity": "0.610497"
        },
        {
            "id": "hvy0qvm",
            "score": 2,
            "text": "European trucks have limited dimensions and better visibility.\n\nAmerican trucks are alot more comfortable and are more likely to travel long distances.",
            "title_similarity": "0.5620026"
        },
        {
            "id": "hvy1ayx",
            "score": 2,
            "text": "Also... City centers have smaller roads in Europe. That's why cabovers are seen making deliveries in city centers, even in the US.",
            "title_similarity": "0.69579464"
        },
        {
            "id": "hvy2fjh",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.16001825"
        },
        {
            "id": "hvy2gzb",
            "score": 2,
            "text": "A cab over truck is shorter but also much more maneuverable. It has a much tighter turning radius.",
            "title_similarity": "0.5357255"
        },
        {
            "id": "hvy2os7",
            "score": 2,
            "text": "Infrastructure is also less accommodating than in the US . Its easier to navigate a British country town with no engine reaching out.",
            "title_similarity": "0.45390886"
        },
        {
            "id": "hvy2tr9",
            "score": 2,
            "text": "European drivers like to speed balls-first into traffic. It's a fetish of sorts. Also, smaller streets.",
            "title_similarity": "0.52499163"
        },
        {
            "id": "hvy56va",
            "score": 2,
            "text": "I just happened to read this article recently if you would like a little more detail:  https://nodum.org/why-semi-trucks-in-us-and-europe-are-so-different/",
            "title_similarity": "0.5680896"
        },
        {
            "id": "hvy5bcy",
            "score": 2,
            "text": "There used to be many “cab over” semi trucks on the road in the US.  I still see some on a rare occasion.  They used to be used often based on overall length when attached to trailers. When hauling longer trailers (53’ foot trailer) using a long nose semi would put them over the legal length to be driven on the road.   \n\nRegulations have been changed so now there’s no need for them.",
            "title_similarity": "0.59359807"
        },
        {
            "id": "hvy5nrk",
            "score": 2,
            "text": "Is it true in the usa they dont really do much interstate trucking? I heard stuff is loaded on trains if it is going from eg la to new york?",
            "title_similarity": "0.5988213"
        },
        {
            "id": "hvy5o39",
            "score": 2,
            "text": "As well as maximising length use there's also visibility reasons. There's generally a greater duty on motorists not to crush vulnerable road users in European countries where the motor lobby has been much less successful in avoiding responsibility for such matters (e.g. jay-walking isn't a concept in many countries). As such, being able to see you're not going to crush a pedestrian when you set off from a set of lights is considered useful.\r  \n\r  \nThis is even more so in some cases such as in London where HGVs must conform to TfL's ever stricter Direct Vision Standard.",
            "title_similarity": "0.5638194"
        },
        {
            "id": "hvy5oap",
            "score": 2,
            "text": "One reason I can personally think of in addition to what others have said about limits, is that many main roads in the UK and Europe have much sharper turns and more roundabouts than North America, both of which are much easier to navigate with a shorter wheelbase and a better view of the ground below.",
            "title_similarity": "0.5397601"
        },
        {
            "id": "hvy649a",
            "score": 2,
            "text": "In Australia we have both. Apparantly We tow a lot more tonnage than americans though sometimes 100+ tonne. But gross weight of 60t is pretty standard . The bigger bonnet trucks eg kenworth can fit larger engines to tow massive loads, some kenworths have 900hp from the factory here. Look up t900 and w900",
            "title_similarity": "0.5376961"
        },
        {
            "id": "hvy7m2z",
            "score": 2,
            "text": "European cities are very old and tight, they need to be able to navigate around very old street patterns.  I don't think you'd even get a US tractor unit around let alone the trailer",
            "title_similarity": "0.5479495"
        },
        {
            "id": "hvy7o82",
            "score": 43,
            "text": "In addition to the length restrictions, a cabover truck that dominates Europe is significantly more maneuverable in tight spaces. The shorter wheelbase and small overhang mean it's easier to know exactly where the front of the truck is. \n\nThe US long haul trucks are much better at driving long distance on the highway. The longer wheelbase is going to be more stable at speed. It's also much easier to improve aerodynamics if you have some length to spread your frontal area out compared to smashing through the air with a brick.",
            "title_similarity": "0.58803976"
        },
        {
            "id": "hvy9i2n",
            "score": 2,
            "text": "Overtime, “the large carriers that purchased cabovers, switched over to the conventional style rig, and the bottom rapidly fell out of the market for them in North America”. This led to the eventual halt of all COE manufacturing in North America.",
            "title_similarity": "0.4834369"
        },
        {
            "id": "hvya6ni",
            "score": 2,
            "text": "U.S. used to have them 60s - 70s. \"Cabover semis\" .. believe they were phased out because of safety concerns and lack of interest by the public,  \n\nFire trucks and some construction equipment are still cabover or mid engine systems.",
            "title_similarity": "0.56664294"
        },
        {
            "id": "hvyal6m",
            "score": 2,
            "text": "Diesel Tech here. The US style of truck is known as the Conventional Truck, while the EU style is known as a “Cab-Over-Engine” or “COE”. The reasoning is simply because the roads are too small and narrow in the EU to support a Conventional, whereas the US has much larger roads and highways. The Conventional Truck does a lot better on MPG, but the roads are so small in the EU that the have to use these flat nose COEs. On the bright side, because of this need for smaller, flat nose trucks, the EU is leading the way in aerodynamics research for large land vehicles.\n\nOn top of all of these, the EU regulates how long a truck is allowed to be as a whole, whereas the US only regulates how long a trailer has to be.\n\nEdit: The US did have COEs at one point, but we changed to using Conventional Cab Trucks because regulations changed to the way they are now, and COE trucks and really, really uncomfortable. If a pothole will cause a feeling of jumping 1 foot in a COE, it will only cause a feeling of jumping half that in a conventional cab.",
            "title_similarity": "0.7356926"
        },
        {
            "id": "hvybv9j",
            "score": 2,
            "text": "Like many has wrote before european countries have maximum length set to trucks + trailers. At least in EU countries it is 25,25meters or if you have HCT (high capacity transport) then it is 34,5 meters.\n\nAs far as i know in America the maximum length is also regulated but the truck is not counted to it but only the trailers. I could be very wrong in this one though.\n\nThat being sayed as i have driven both models (long nose and snub nose) trucks, the snub nose has so much more advantage in terms of visibility and turning circle or the space it requires to turn and manuver which is why it suits much better in europe and cities and smaller roads.",
            "title_similarity": "0.6684294"
        },
        {
            "id": "hvyc3n3",
            "score": 2,
            "text": "Something people fail to mention is the benefit of having the engine in front of the cabin.\n\nThe most impactful feature of a cabovwrs is the fact that the driver sits directly over the steering axle. This makes for a much rougher ride on the driver.\n\nThe longer wheelbase and suspension sepersted from the driver in a conventional makes for a much easier and smoother ride.",
            "title_similarity": "0.5966542"
        },
        {
            "id": "hvyd1rk",
            "score": 3,
            "text": "In the US we use to have length limitations so cabovers were popular to maximize freight capacity (amount of stuff you can haul/carry). When trucking was deregulated the length a truck and trailer could be was made longer and standardized across the US. So manufacturers starting making conventional trucks (engine in front of cab). A conventional truck rides better, has more visibility, easier access for maintenance, and probably the biggest reason is fuel economy. Making the truck more aerodynamic increases fuel economy which is very important when transporting freight long distances.",
            "title_similarity": "0.59977907"
        },
        {
            "id": "hvydyj1",
            "score": 2,
            "text": "Cab-over-engine designs were popular in the US in the 1970s. Then they went out of fashion. I don’t know why. \n\nHonestly, I just think it is because the long nose design looks cooler.",
            "title_similarity": "0.50222063"
        },
        {
            "id": "hvyhawy",
            "score": 2,
            "text": "Haul distances are WAYYYYY shorter too generally speaking. A sleeper works better conventionally than a cabover.",
            "title_similarity": "0.47699603"
        },
        {
            "id": "hvyhj9z",
            "score": 2,
            "text": "I wish all American trucks were cab overs. Not only are they more maneuverable, but the driver has an unobscured view. When I was truck driving, I always wanted a cab over if I managed to become an O/O. Sadly, my health didn't let me.",
            "title_similarity": "0.5680194"
        },
        {
            "id": "hvyi7xc",
            "score": 2,
            "text": "I'm surprised no one has brought this up, atleast in the comments I skimmed...\n\nBut I always heard the reason why Cab overs lost popularity it America was that their safety ratings were shitty. I've heard them called suicide cabs. They lose that huge bulk infront of them for crumple/impacts and anything that hits them practically smashes the driver.",
            "title_similarity": "0.5206724"
        },
        {
            "id": "hvyie3v",
            "score": 3,
            "text": "Length laws. Cab overs used to be common in the US as well when different states had different laws about total vehicle length. With the institution of the Interstate system and lawsuits against states by large trucking companies like Consolidated Freightways, length restrictions in the US changed and are typically much more forgiving now.",
            "title_similarity": "0.588102"
        },
        {
            "id": "hvyj491",
            "score": 1,
            "text": "In addition to the saving of space, the cab with engine in front in the US is much more comfortable as the engine is not vibrating below your seat. In the US there is less restrictions on length but more restrictions on weight than in Europe. \n\nOf course there are cabover designs in the US for specific purposes such as fire trucks as the turning circle is better and can get your in and out of tight spaces. \n\nSource: Recently did a deep dive of the trucking sector",
            "title_similarity": "0.6056713"
        },
        {
            "id": "hvyj8v0",
            "score": 1,
            "text": "How do euro trucks manage to fit the engine under the cab? Is there just more empty space under a US truck since it doesn’t need to fit the engine?",
            "title_similarity": "0.7472054"
        },
        {
            "id": "hvyjodh",
            "score": 1,
            "text": "I didn't known that the front axle can be at the very front or a bit back under the engine compartment. set-forward vs set-back front axles.",
            "title_similarity": "0.6559926"
        },
        {
            "id": "hvyjr8a",
            "score": 1,
            "text": "My dad who did some ride-alongs as a buyer with long haul cattle haulers many many years ago used to say that cab-over engines styles were super hard on the driver’s body vs long nose trucks. More shaking and vibrating. For the kind of long hauls that are common in North America, I can see how perhaps drivers prefer the long nose trucks for that reason",
            "title_similarity": "0.56585014"
        },
        {
            "id": "hvylcza",
            "score": 1,
            "text": "European cities with a long mediaeval history have many small streets with tight corners, that just \"happened\" over a thousand years.  There are also ferries that limit length and parking spaces are smaller.\n\nShorter trucks can handle all of those cases far more easily.  America, with its wide open roads, and cities that were built and planned hundreds of years later didn't have as much of a need for compactness.   Boston in an example of a more \"it evolved that way\" city, but most other American cities have much better planned streets.  New York is an example.",
            "title_similarity": "0.55341005"
        },
        {
            "id": "hvymukj",
            "score": 1,
            "text": "We have COE trucks (cab over engine) here in the US. I've driven them before, I believe they were made by Isuzu.",
            "title_similarity": "0.5527467"
        },
        {
            "id": "hvyo6yz",
            "score": 1,
            "text": "Fuel efficiency is a big factor. Cab over trucks for long haul suffer significantly with fuel mileage compared to the longer nose trucks. Combined with all of the other things mentioned about road sizes, and regulations are true but in the US the majority of trucks are longer haul and gaining even 5 to 20 percent in fuel efficiency makes long nose trucks way more competitive.",
            "title_similarity": "0.6197263"
        },
        {
            "id": "hvypa0f",
            "score": 1,
            "text": "A lot has already been mentioned but a big thing is COMFORT. A truck driver taking a load across the US is like taking a load across Europe. I am an over the road trucker and the trucks with the engine in front can be designed to be more aerodynamic for less wind resistance. There is also more room to work on the engines. If you idle the truck, the cab shakes less. The sleeper section is bigger, you must remember I spend ~43 weeks out of the year on the road, I basically live in that truck, and spend most of the time on the interstate, there is no need for a flat nose, im not making tight turns like a cabover driver would in a European city. \n\nLastly, the wheel base makes a huge difference in how smooth these trucks ride, especially when I'm running 80,000 pbs gross. Having more distance between the front and rear truck axles makes bumps less violent on the road.\n\nThe size of the US and difference in how our  drivers run ultimately lead to the conventional cabs winning over here in the US.",
            "title_similarity": "0.7158159"
        },
        {
            "id": "hvyprq7",
            "score": 1,
            "text": "There are many cab/engine formats for commercial trucks in the US. \n\nThe required functionality is why. \n\nCab-over as we call them is really only needed for when the truck will be making tight and vision restricted turns such as on narrow streets and alleys in a city. It’s not needed for highway/truck yard use. \n\nEngine forward tractors provide better aerodynamic and efficiencies better suited to open roads and long distance hauling.   Cab-overs are much less safe in front end impact, and much less aerodynamic. \n\nThere’s also engine behind tractors for HEAVY loads. Pretty rare though.",
            "title_similarity": "0.6333896"
        },
        {
            "id": "hvysmle",
            "score": 1,
            "text": "I've personally driven both cab-overs and nose-trucks in Canada, as we have no truck length restrictions, so it's just a matter of preference / availability here.\n\nMany saying that Europe's entire truck *and* trailer length is restricted, almost certainly due to much more dense population and infrastructure, as well as winding roads due to geography, making it considerably harder to navigate narrower roads with tighter corners,\n\nIn NA the roads are typically wider with shallower corners, so *only* the trailer length is restricted, and even that varies widely from province to province, and state to state, due to geography and local particularities.",
            "title_similarity": "0.6351397"
        },
        {
            "id": "hvyt5se",
            "score": 1,
            "text": "When I was in trucking school, I was told that most American semis have their engines in front as it's safer. It acts like a crumple zone, and the engine gets pushed under the driver. Sort of like an airbag for the entire semi in a way? Instead of the driver just smacking windshield first into a wall.",
            "title_similarity": "0.65838325"
        },
        {
            "id": "hvyvw9e",
            "score": 1,
            "text": "Think it has to do with physical size. The wheelbase is better on the European trucks especially since they have much older and smaller roads in places where the American truck would simply not be able to maneuver. I have seem some American trucks in videos of Big Truck meetings and events so I guess they do exist just very few.",
            "title_similarity": "0.66985565"
        },
        {
            "id": "hvyxwj1",
            "score": 1,
            "text": "The size of the roads in Europe are more narrow compared with roads in the states. Definite need for a smaller cab.",
            "title_similarity": "0.67265856"
        },
        {
            "id": "hvyy5oa",
            "score": 1,
            "text": "Roads wouldnt work for the american one with the length of trailers. So either trailer is shorter or truck is.",
            "title_similarity": "0.5880646"
        },
        {
            "id": "hvyzf2k",
            "score": 1,
            "text": "Don't forget that many European cities have extremely narrow roads (with regard to minimum acceptable distance from a roadway to, say, a stone wall/retaining wall). Plenty of \"last mile\" trucks (box trucks, not tractor-trailers/18wheelers) actually have 4 wheel steering (both axles/sets of wheels help turn) to allow for a significantly tighter turning radius when squeezing down alleys and to loading docks and whatnot.",
            "title_similarity": "0.6841235"
        },
        {
            "id": "hvyzkru",
            "score": 1,
            "text": "The question had a false premise. The US has both. The reason is regional vs long haul trucking. There is pretty much no long haul trucking in Europe. Anything within your own country or neighboring country is a very short trip to us truckers and would be considered local or state. We have box trucks with similar design(in fact we design them many times and you use them). It's more economical to use a larger truck with out front engine once city driving is less useful. Those are long haul pushing the weights up and distance up over relatively straight roads.",
            "title_similarity": "0.64677894"
        },
        {
            "id": "hvz1fsi",
            "score": 1,
            "text": "[What Happened to Cabovers?](https://www.roadprobrands.com/blog-posts/what-happened-to-cabovers)\n\nTL;DR - increases in total length limits caused them to lose consumer popularity. \n\nThere were design limits with sleepers, ride comfort, etc that made them less popular - but most of those complaints are based on trucks made in the 1970's.",
            "title_similarity": "0.610343"
        },
        {
            "id": "hvz2fyf",
            "score": 1,
            "text": "It also had to do with the size of the European roads too, roads in America are gigantic, some roads here would be impossible for an American truck to go through",
            "title_similarity": "0.59140646"
        },
        {
            "id": "hvz36it",
            "score": 1,
            "text": "Cabover commercial trucks are common here. They aren't all Peterbilt style trucks where the cabin sits behind the engine.   \n\n\nI'm sure there are engineering benefits to both designs, probably specifically in access to the engine to do repairs. The sides of what you're calling a \"US style\" truck tend to accordion up to give access to the engine bay, while the \"European style\" cabover, the entire cab typically tilts forward. I assume this has an impact on sleeper cabs in the US too - although I've seen cabover style trucks with sleeper cabs as well as the regular variety. My assumption there is that only the cabover part, not the sleeper, tilts forward when you need engine access...   \n\n\nI suppose that sleeper cabins with the engine in front of the cabin are probably safer too, than sleeping directly above the diesel engine. Do truckers regularly sleep on the side of the road in their rigs in Europe? Because once you get into the interior of the US - it is super common.",
            "title_similarity": "0.728934"
        },
        {
            "id": "hvz3pn7",
            "score": 1,
            "text": "A bit off topic, but Bill Murray’s larger than life has an excellent gag based around a cab over truck.",
            "title_similarity": "0.56501234"
        },
        {
            "id": "hvz4imu",
            "score": 1,
            "text": "Cabovers maximize cargo space but present the least aerodynamic face. Conventionals are more aerodynamic, but that only matters at higher, sustained speeds like US highways. (In the days of cheap fuel the US had a lot of cabovers but now they’re fading away).",
            "title_similarity": "0.5826205"
        },
        {
            "id": "hvz4ov5",
            "score": 1,
            "text": "Truckers hated cabovers too. They just don’t ride as well as a conventional. I can’t remember the last time I saw one. (US).",
            "title_similarity": "0.5132045"
        },
        {
            "id": "hvz6og8",
            "score": 1,
            "text": "European truck company's don't care if the driver takes the brunt force of a head on collision! \n\nAnd the fact that we Americans can't bother to drive like decent people anymore!",
            "title_similarity": "0.6085579"
        },
        {
            "id": "hvz7gvn",
            "score": 1,
            "text": "Another reason i havent seen mentioned is, in Europe a lot of lorries use ferries to move around so the slightly shorter and less aerodynamic design allows more of them to be put into one ferry. While in America they usually travel by road so the more aerodynamic design of the American truck is favoured because of the fuel efficiency benefits.",
            "title_similarity": "0.6660167"
        },
        {
            "id": "hvz8dqw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.16001825"
        },
        {
            "id": "hvz8fsl",
            "score": 1,
            "text": "They are called \"COE\" or \"Cab over Engine\" and this is because European roads and streets can be sometimes be very narrow with thousands of years old buildings and monuments around. So, you need a vehicle with very low turning circle to navigate European towns and cities.\n\nCOEs reduce overall length of lorries and make turning circle low, on the downside they are extremely, I mean really uncomfortable to ride, and nightmarish to get access to engine in an emergency. Luckily, Western Europe has very good roads, so you won't feel that uncomfortable while driving.",
            "title_similarity": "0.67100316"
        },
        {
            "id": "hvz8s65",
            "score": 1,
            "text": "I was going to say cabover design allows for tighter turning, especially in towns or cities that have tight corners.",
            "title_similarity": "0.453932"
        },
        {
            "id": "hvzbv02",
            "score": 1,
            "text": "The Optimus Prime action figure back in the day must have been European and the film version of Prime is American.",
            "title_similarity": "0.4697991"
        },
        {
            "id": "hvzci0g",
            "score": 1,
            "text": "The cab over trucks are better for maneuverability but have a rougher ride. The conventional trucks have a nicer ride. Maneuverability doesn't matter so much when you're driving on mostly highways from loading dock to loading dock.",
            "title_similarity": "0.58241177"
        },
        {
            "id": "hvzdrzj",
            "score": 1,
            "text": "The European truck you're referring to is called a \"cab-over\" because the cab is directly over the engine. Im not exactly sure why they're used so much in Europe, but I do know that they were popular in the US in the 70s and 80s. Ultimately the biggest reason why they're not as common in the US anymore is because they're very uncomfortable if you are driving for long periods of time. Which makes sense because you're literally sitting on top of a running diesel engine. And with the long distance truckers have to travel in the US, comfortably and driver fatigue is a big deal. I have always heard that one of the reasons Europe has so many cab-overs is because the need the turn radius this style of truck offers to get around in the narrow city streets. I don't know how true that is though.",
            "title_similarity": "0.71398926"
        },
        {
            "id": "hvzerag",
            "score": 1,
            "text": "At least one iconic American truck model is built this way, the Peterbilt Cabover aka \"Cabover Pete\" aka Generation 1 Optimus Prime.",
            "title_similarity": "0.5683459"
        },
        {
            "id": "hvzgfq1",
            "score": 2,
            "text": "Ease of repair vs need for space.\n\nFront engined cabs are much easier to fix as they have an actual hood, euro trucks are better for tight spaces but you have to lift the whole cab to do repairs.",
            "title_similarity": "0.57795435"
        },
        {
            "id": "hvzhiyo",
            "score": 1,
            "text": "You can find both in the US. It's just easier to get in and out of truck if the engine isnt under the cab. \n\nIt's also easier to work on trucks if you don't have the move move whole cab to get to the engine.",
            "title_similarity": "0.5775937"
        },
        {
            "id": "hvzigtv",
            "score": 1,
            "text": "The \"European\" trucks you're talking about have what's called a \"cab over\" configuration.  With the cab over the engine overall length is saved which makes the truck more maneuverable and able to make tighter turns.  This is important in European cities were typically built before the introduction of the automobile with smaller streets.  In the US, most of the country was built with cars in mind and the extra maneuverability is not required.  It's easier to access the engine compartment in a standard configuration so they are more popular in the US.",
            "title_similarity": "0.63299286"
        },
        {
            "id": "hvzilx6",
            "score": 1,
            "text": "While this has been answered, I have always wondered if the aerodynamics of an American-style rig are better than that of a cab-over.",
            "title_similarity": "0.52887"
        },
        {
            "id": "hvzjw8o",
            "score": 1,
            "text": "Because European roads were designed for horses and American roads were designed for Cadillacs",
            "title_similarity": "0.5836416"
        },
        {
            "id": "hvzk610",
            "score": 1,
            "text": "So then which design fares better when driving over an open gap in the road with just one side of its wheels touching the ground?\n\n(I believe the road I'm thinking of was a washed out mountain in India)",
            "title_similarity": "0.593932"
        },
        {
            "id": "hvzpqsy",
            "score": 1,
            "text": "We don’t have anything to try and prove. Works just as well without having to have its cock out.",
            "title_similarity": "0.15142593"
        },
        {
            "id": "hvzqygk",
            "score": 1,
            "text": "As for Germany I can tell you it derives back to protectionist laws, so American truck companies couldn’t grab a hold of the market. We started to produce the still known format then, which applied to the then applicable rules.",
            "title_similarity": "0.5811697"
        },
        {
            "id": "hvzr1r5",
            "score": 1,
            "text": "I understand why cab-over is more popular in Europe - but what is the huge benefit of longer, American-Style trucks?",
            "title_similarity": "0.5705779"
        },
        {
            "id": "hvzsllb",
            "score": 1,
            "text": "We had a lot of forward-cab everything in the 60s and early 70s but then when we began crash testing and speed limits began to go up, it was decided that having no mass out in front of the driver (and space for crumple zones) was more deadly, so we tend to not have FC types of any vehicle now.\n\nBut also like others said, not trying to save linear space either, because we usually don't need to.\n\nWe do have FC on busses (actually rear or mid engine, not technically cab-over) but they are in denser cities and never go highway speeds.  Also some delivery vehicles that similarly aren't high-speed.  Anything that is on the highways (OTR trucking) has a long nose, unless it's antique like a 70s Peterbilt flat-nose.\n\nWe have so much space most OTR trucks have not only the long nose but also 8 feet or more of sleeper cabin.",
            "title_similarity": "0.54476035"
        },
        {
            "id": "hvztu8y",
            "score": 1,
            "text": "I'm not sure how accurate this is. Are you talking semi truck/freight liner chassis? Because in the US they are for the most part under the driver/cab",
            "title_similarity": "0.67880625"
        },
        {
            "id": "hvzu0th",
            "score": 1,
            "text": "I believe the Freightliner Argosy was the last cabover truck sold in the US, it was discontinued after 2006.",
            "title_similarity": "0.48586383"
        },
        {
            "id": "hvzybzo",
            "score": 1,
            "text": "My question is: why do American trailers still not have side protection, and why do trucks have their lights on the middle between the wheels and not near the edges?",
            "title_similarity": "0.56781834"
        },
        {
            "id": "hw01bgi",
            "score": 1,
            "text": "Regulation. The EU has different length regs, so they put the engine under the driver to carry more cargo because the overall length is shorter. Cabovers used to be very popular in the states, but they fell out of favor after trucking was deregulated because cabovers are less comfortable for the driver and more dangerous in a crash as there is no crumple zone in front of the driver",
            "title_similarity": "0.6997976"
        },
        {
            "id": "hw01rmu",
            "score": 2,
            "text": "America big, America big and wide streets\n\n\nEurope dense, Europe streets smoll, Europe streets tight",
            "title_similarity": "0.43075475"
        },
        {
            "id": "hw04pcz",
            "score": 2,
            "text": "Space and distance.  The USA has lots of open space so drivers choose the more comfortable ride of the longer truck on long hauls.  Shorter distances in smaller countries with cities and towns with older and much more narrow street in Europe.",
            "title_similarity": "0.5743282"
        },
        {
            "id": "hw06fmv",
            "score": 1,
            "text": "Europe has tighter streets generally, more ferries stuff like that. Here you can move the engine out and make a safer more aerodynamic vehicle. It’s just not as practical there.",
            "title_similarity": "0.61827666"
        },
        {
            "id": "hw070fv",
            "score": 1,
            "text": "The definitive answer to this:\n\nhttps://nodum.org/why-semi-trucks-in-us-and-europe-are-so-different/\n\nTL;DR: Engine-below is better for maneuverability, and shortens the overall load, but worse for high speeds and driver comfort. Turns out that suits the European market much better than the US market.",
            "title_similarity": "0.7015363"
        },
        {
            "id": "hw07ctg",
            "score": 1,
            "text": "There’s no good reason beyond American style preference.  In my experience, cab-overs are nicer in every way.  Nobody would choose a conventional cab over one.",
            "title_similarity": "0.47017664"
        },
        {
            "id": "hw087aj",
            "score": 1,
            "text": "Better for safety, in case of collision damage mitigation cause less chance of engine failure and more protective layer if it exploded",
            "title_similarity": "0.37505043"
        },
        {
            "id": "hw08nt0",
            "score": 2,
            "text": "A bigger question is why do European trucks trucks have their exhaust at street level and not a pipe that points up into the sky? I mean it's funny to see some rich snooty chick in a Cabrio get exhausted with black diesel smoke. But that's still weird.",
            "title_similarity": "0.68893653"
        },
        {
            "id": "hw093z7",
            "score": 1,
            "text": "length in europe is limited and it makes sense due to the roads being smaller and americans use to have cabovers but drivers preffered the ones with a nose for comfort.",
            "title_similarity": "0.6752726"
        },
        {
            "id": "hw09x24",
            "score": 2,
            "text": "It was the 1982 Surface Transportation Assistance Act in the US that changed length regulations and was the beginning of the end to cabovers in the US.\n\nIt just works out under the newer [federal] regulations it's generally not advantageous to have a cabover. Specific applications will still use them in the US to meet certain length requirements, but its pretty abnormal now.  \n\n[I believe states can set maximum overall lengths for a unit off of the \"National Network\" (NN)] (https://coast2coasttruckingpermits.com/state-province-legal-limits/)\n\nThe US is generally just a lot bigger, wide open, and newer development that permitted bigger vehciles to operate.  Some localities in the US definitely impose weight and length restrictions that are much shorter and lighter than your average interstate truck. However those areas are going to be served using smaller delivery trucks coming from regional warehouses where big trucks unload.\n\nI've never been to Europe, but what I see is a lot of \"old-world\" small streets and generally more congested (not in a traffic sense necessarily)  areas.  Just tighter networks without as much room to maneuver.",
            "title_similarity": "0.46826276"
        },
        {
            "id": "hw0bm3d",
            "score": 1,
            "text": "Huh I never knew they were different cause one is American the other European. We have both here in Australia",
            "title_similarity": "0.37294197"
        },
        {
            "id": "hw0bnv5",
            "score": 2,
            "text": "I always assumed is was for safety regulations, no crumple zone to absorb the impact of you are in front the the axel.",
            "title_similarity": "0.34971738"
        },
        {
            "id": "hw0bw8v",
            "score": 2,
            "text": "No room to drive in Europe. When I visited the UK I was terrified for our bus driver, surely these roads are too small for a coach.\n\nHe was fine.",
            "title_similarity": "0.49417338"
        },
        {
            "id": "hw0i4jc",
            "score": 1,
            "text": "Cab overs flip the whole cab to work on the engine. It's easier to work on engine forward trucks. So if length isn't an option. That is the default.",
            "title_similarity": "0.62326473"
        },
        {
            "id": "hw0k744",
            "score": 1,
            "text": "It's not just a European design, cabover trucks exist in North America too, Europe though has far tighter roads making the cabover a much easier to maneuver truck.",
            "title_similarity": "0.6389018"
        },
        {
            "id": "hw0kyin",
            "score": 1,
            "text": " The American semi manufacturers started designing more for the comfort styling of the cab. Long haul truckers wanted more comforts of home, so to speak, not just somewhere to sleep. Placing the engine forward of passenger compartment allowed for more space to be utilized for that purpose. American semi's are not restricted by length but the are restricted by total weight which I believe is still 80,000 lbs. I read in another answer that European \"lories?\" are restricted by length.",
            "title_similarity": "0.6929156"
        },
        {
            "id": "hw0maqd",
            "score": 1,
            "text": "The US does have cabovers but we also don't have length restrictions. Typically we use cabovers for local city routes as they're more maneuverable.",
            "title_similarity": "0.44235998"
        },
        {
            "id": "hw0o5yy",
            "score": 1,
            "text": "While we're on the topic, how come wheels and tires (tyres for those who have left the EU) are smaller diameters in Europe than in North America?",
            "title_similarity": "0.71116805"
        },
        {
            "id": "hw0ocm0",
            "score": 1,
            "text": "I don't know, but they're pretty scary to drive.\n\nI used to drive a 20ft box truck for habitat for humanity to pick up donations. Every once in awhile the truck would be down and we'd rent from this place that only had cabover box trucks. I felt like I was on the road. But, it does provide a significantly better view of the road, which is nice.",
            "title_similarity": "0.5786341"
        },
        {
            "id": "hw0rcm9",
            "score": 1,
            "text": "Legislation and greedy companies.\n\nBasically there is a maximum length the hole truck can be. Add that to greedy people and you have maximum cargo capacity within length limits.\n\nRemove all that and you get those Australian road trains.",
            "title_similarity": "0.508152"
        },
        {
            "id": "hw0sek8",
            "score": 1,
            "text": "Most of the roads in Europe are older and smaller. Some are mountainous and have a lot of tight turns and sharp corners. You wouldn't be able to drive a lot of the larger trucks from North America there.\n\nAlso there are tight restrictions regarding size,  weight and speed.",
            "title_similarity": "0.6421887"
        },
        {
            "id": "hw0t2cl",
            "score": 2,
            "text": "Decades of breeding for flat noses. The American truck is actually what the cargo truck looked like before breeding specimens specifically started being selected for their flat noses. The American truck suffers fewer genetic health and breathing problems thanks to its more natural shape.",
            "title_similarity": "0.504171"
        },
        {
            "id": "hw0uf15",
            "score": 1,
            "text": "Narrow streets in Europe , that's why. You can manuevever those narrow streets easier with a below cab engine.",
            "title_similarity": "0.6250912"
        },
        {
            "id": "hw0w8du",
            "score": 1,
            "text": "Isn't that easier to drive European trucks since your view is not blocked by the engine and frontal hood?\n\nLess likely to hit pedastrian since you can see them better?",
            "title_similarity": "0.681236"
        },
        {
            "id": "hw0whg7",
            "score": 1,
            "text": "I see regulations and law but I don't see the fertilization issue that lower engine have. Men become sterile because of the excessive heat.",
            "title_similarity": "0.4385326"
        },
        {
            "id": "hw0yayb",
            "score": 2,
            "text": "Kenworth k200 series trucks are American cab over still produced today. So are freightliner argosys. Pretty much all Euro trucks are cab over, as other have said, its about length restrictions. However, America has more open roads than a lot of places in Europe, and shorter cabs have an advantage in tighter conditions.",
            "title_similarity": "0.653205"
        },
        {
            "id": "hw0z8rg",
            "score": 1,
            "text": "This is also due to being easier to work on standard vs cab over trucks and cab overs are still seen in the US in mainly tighter quarters where the shorter nose and wheelbase means tight maneuvering. A longer wheelbase vehicle tows more stable so when doing long distance and open highway it has advantages. (this is why dually pickups etc are only sold in long bed configuration)",
            "title_similarity": "0.57831955"
        },
        {
            "id": "hw105q1",
            "score": 1,
            "text": "Tighter turn radius.  I have seen stubble rigs make crazy tight turns in small Italian towns.",
            "title_similarity": "0.5109035"
        },
        {
            "id": "hw15fq8",
            "score": 1,
            "text": "My GF is born and bread NYC. Me, been all over my whole life (US, that is). Living in NYC, my brother living in Destin Beach, FL, and her best friend in New Orleans.\n\nThe fact that drive took like 4-5 hours and there was no New Haven, Boston, Providence, Albany, Philadelphia, just swamp, blew her mind.\n\nOn the way back we passed Biloxi, she was offended. I tried to defend with the riverboats. Still trying to go for a pit stop at least.\n\nI-10 rant done! Cheers",
            "title_similarity": "0.4092645"
        },
        {
            "id": "hw17ujj",
            "score": 1,
            "text": "We used to. In the ‘30’s to the ‘50’s,we had Cab over trucks. I guess because they looked different. They were more efficient and easier to work on.",
            "title_similarity": "0.6053761"
        },
        {
            "id": "hw1essq",
            "score": 1,
            "text": "COE (cab over engine) trucks, on the other hand, require tilting the entire cabin to reach the engine. So, before accessing the engine, the driver has to fasten and secure all loose items in the cab, making the process rather time-consuming and arduous. \n\n\nhttps://autowise.com/coe-trucks/",
            "title_similarity": "0.57349277"
        },
        {
            "id": "hw1i3ih",
            "score": 1,
            "text": "Improved turning radius and easier to back up the trailer.  European cities are older with secondary roads being smaller, so easier access with a cabover.",
            "title_similarity": "0.5580439"
        },
        {
            "id": "hw1k0wy",
            "score": 1,
            "text": "The difference I would consider would be space on the road and engineering manufacture being whoever over there in Europe.",
            "title_similarity": "0.6056031"
        },
        {
            "id": "hw1l4kf",
            "score": 1,
            "text": "Something I’m not seeing mentioned: cabovers (COEs) have extra mechanical problems because of the mechanisms to get at the engine. In Europe, saving space turned out to be important enough to deal with the mechanical problems. Without the need to save every bit of space, we put the engine in front of the cab to avoid those mechanisms.",
            "title_similarity": "0.6594111"
        },
        {
            "id": "hw1lma4",
            "score": 3,
            "text": "American trucks are decades behind European, both in technology, pollution, and drive time tracking",
            "title_similarity": "0.5941992"
        },
        {
            "id": "hw1qvic",
            "score": 1,
            "text": "You can totally have cab-overs in the US. Europe has smaller and more narrow streets so putting the engine under makes the truck shorter and more agile. \nThe US trucks have bigger roads to use, longer distances to travel and bigger payloads. You can have more powerful engine with the ending in front.",
            "title_similarity": "0.69334054"
        },
        {
            "id": "hw1vvlh",
            "score": 2,
            "text": "I can't comment for all of America, but I have spent some time on the East Cost (Massachusetts and Maine) and West Coast (California and Florida).\n\nCompared to every other country I have been to, the roads and road infrastructure are massively bigger.\n\nBigger lanes, wider roadside areas, bigger parking spaces. \n\nThere is no way you can practically daily drive a Ram or F150 in Australia because it is as wide as the road.\n\nSimilar with trucks we have both bonneted and cab-over. Bonneted are really only for long haul, and then once you start looking at B-Double (two trailers on specific routes for long haul) they tend to be cab-over because of total length and turning circle.",
            "title_similarity": "0.51763475"
        },
        {
            "id": "hw1yvii",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.16001825"
        },
        {
            "id": "hw4vz0m",
            "score": 1,
            "text": "It’s cheaper to manufacture a conventional cab truck in the USA. So the people who buy trucks stopped buying over cab trucks because they cost more to purchase so the truck manufacturers stopped making them because no one wanted to buy them. In Europe they tend to only have conventional engine in front trucks in the smaller class of trucks.",
            "title_similarity": "0.6312377"
        },
        {
            "id": "hw53fnt",
            "score": 1,
            "text": "There are [American Cab-Over-Engine(COE) trucks](https://i.pinimg.com/originals/cf/a7/13/cfa7132ec33016b2577f4326e998f7b0.jpg); always have been. Some of the coolest [antique trucks are COE](https://c.pxhere.com/images/0a/b4/170a2626f8be11a19abc47b4caa5-1454563.jpg!d)s. Here's a [2022 American-made Freightliner COE](https://cdn.dealerspike.com/imglib/v1/800x600/imglib/trimsdb/16959061-0-108195621.jpg). Here's a [Ford COE](https://www.ttnews.com/sites/default/files/images/articles/iaa-ford-fmax.jpg) that's intended for the international market. While there are pluses to a COE,like fuel efficiency and maneuverability, there are also minuses. \n\n1.Inconvenience -  To get to the sleeper bunk, “the driver of the rig must crawl through a hole. The trucker must stand up on the seat of the truck and crawl over the engine, which is positioned between the seats.Anytime the driver wants anything from the bunk, the process is the same …. there is no reaching into the sleeper to grab something, when sitting in the driver’s seat”, Smart-Trucking.                                                                       \n\n2.Safety– Cab-overs are said to be less safe than a long hood rig. This is based on accidents, and the fact that the driver has less protection. Although “modern cab-overs are built with more structural safety features to protect the driver, the conventional long hood vehicle still fairs better in an accident”, Smart-Trucking. \n\n3.Discomfort – Many drivers of COEs “complained that the ride was pretty rough, mostly due to the shortened wheelbase. Comfort is a big issue especially for long haul trucking”.\n\nEdited to correct formatting and links (points 1, 2 & 3 were copypasta from https://www.roadprobrands.com/blog-posts/what-happened-to-cabovers)",
            "title_similarity": "0.471645"
        },
        {
            "id": "hwddi6k",
            "score": 1,
            "text": "I'm late, but as someone who has driven these trucks, cab overs have a big downside noone is talking either.\n\nThey are higher up, so you have to climb into them. If you have mobility / weight / age issues, this is a pain to a lot of people. Or if you have to get in and out of truck a lot. \n\nCab overs can also be more of a chore to work on.\n\nHaving a shorter trucker makes turning easier, essentially too.",
            "title_similarity": "0.58632714"
        }
    ]
}