{
    "ELI5: What is the purpose of prison bail? If somebody should or shouldn’t be jailed, why make it contingent on an amount of money that they can buy themselves out with?\nEdit:  Thank you all for the explanations and perspectives so far.  What a fascinating element of the justice system.\n\nEdit:  Thank you to those who clarified the “prison” vs. “jail” terms.  As the majority of replies correctly assumed, I was using the two words interchangeably to mean pre-trial jail (United States), not post-sentencing prison.  I apologize for the confusion.": [
        {
            "id": "hxc4hos",
            "score": 1,
            "text": "Hi Everyone,\n\nI wanted to put a friendly reminder about rule 5: no soapboxing. That means you can't use your response to make a point about how you feel about either bail, capitalism, or wealth inequality. Please keep responses objective.\n\nAs a side note our mod team is recruiting: [https://www.reddit.com/r/explainlikeimfive/comments/stbxuj/recruiting\\_moderators\\_for\\_eli5/](https://www.reddit.com/r/explainlikeimfive/comments/stbxuj/recruiting_moderators_for_eli5/) Take a look and sign up to get a green name.\n\nLet me know if you have any questions",
            "title_similarity": "0.66800165"
        },
        {
            "id": "hxbtwdq",
            "score": -1,
            "text": "I am glad this does not exist in my country. It's just another way to help rich people get away with their crimes.",
            "title_similarity": "0.67997754"
        },
        {
            "id": "hxc6ht5",
            "score": 0,
            "text": "Profit. \n\nMost of the really problematic elements of our society can be traced back to pure profit driven motives. \n\nThe concept of bail created a bunch of private profitable businesses and added money to the justice system giving them another stream of it when tax funding ebbs and flows. This allows for higher pay for those working in the justice system witch just justifies higher and higher bail money so it gets more.",
            "title_similarity": "0.70913094"
        },
        {
            "id": "hxblyem",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.058632586"
        },
        {
            "id": "hxbhi44",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.058632586"
        },
        {
            "id": "hxbl47k",
            "score": 3,
            "text": "You want a system to allow rich people to pay their way out until trial, to give time for their highly paid lawyers to make the problem go away.",
            "title_similarity": "0.69880116"
        },
        {
            "id": "hxby51t",
            "score": -2,
            "text": "This is the argument behind bail reform, which has been enacted in NYS. Either keep them in jail for a reason (violence, etc), or let them go with no bail.\n\nI personally really love NYS bail reform. It needs to be tweaked a bit, but overall, it's working well. You no longer have to worry about being thrown in jail for something stupid, most people go through the system, get booked, arraigned, and let go...\n\nAgain, it needs a bit of tweaking for some situations (multiple re-offenders in the matter of weeks, one dude kept drunk driving and got let go 3 times in two weeks), but as a whole, it's done a lot to stop the income-based inequity of the bail system...",
            "title_similarity": "0.83015335"
        },
        {
            "id": "hxcuwk1",
            "score": 0,
            "text": "Your instinct is correct. One has nothing to do with the other and it creates a two tiered system: one for the wealthy and one for the poor.",
            "title_similarity": "0.54505247"
        },
        {
            "id": "hxeoqbr",
            "score": 0,
            "text": "Because we live in a society where money determines whether you get treated like a person or an animal",
            "title_similarity": "0.4311152"
        },
        {
            "id": "hxcqpag",
            "score": 2,
            "text": "Bail is one of the many, many things that we’ve implemented to help rich people avoid being treated like normal people",
            "title_similarity": "0.6877023"
        },
        {
            "id": "hxcyn1v",
            "score": -1,
            "text": "Because Pay to win.\nBe rich or go home.\nEquality is a legend we tell to poors to make them feel less bad if they are dumbs enough to belive it",
            "title_similarity": "0.6466392"
        },
        {
            "id": "hxbnxnc",
            "score": 0,
            "text": "So I get bail for $2000 and I jump bail and Dog the.bounty hunter comes and gets me...does he now get the $2000?",
            "title_similarity": "0.5450845"
        },
        {
            "id": "hxcbque",
            "score": -2,
            "text": "Wait... What do you think bail is??",
            "title_similarity": "0.46416745"
        },
        {
            "id": "hxd6wk4",
            "score": 4,
            "text": "It's a poverty tax.  Many states are now getting rid of it because it \\*of course\\* disproportionately affects poor BIPOC.",
            "title_similarity": "0.6210835"
        },
        {
            "id": "hxc062c",
            "score": 1,
            "text": "New Jersey got rid of the cash bail system entirely in 2017 and it seems to be working out. If you're a flight risk or a danger to the community you're remanded until trial otherwise you're automatically bailed for free and released until your trial.",
            "title_similarity": "0.6746567"
        },
        {
            "id": "hxbq2eu",
            "score": 19,
            "text": "The theory is that by having cash bail, you ensure they will show up to trial.\n\nHowever, data indicates that cash bail doesn't do much of anything to ensure people show up to trial.  Turns out, threats of punishment for failing to show up to trial works just fine.  All cash bail manages to really do is keep people who are too poor to afford bail in jail while they await trial.  \n\n\nIMO, whether or not you are released prior to trial should be dependent on two things flight risk and reasonable risk to others.  If you are a flight risk, cash bail isn't going to do much to convince you to stick around, and you shouldn't be released.  If you are a reasonable risk to others, cash bail isn't going to do much to keep you from hurting people while out on bail and you shouldn't be released.  Edge cases can be dealt with via various means like check ins and other sort of monitoring.",
            "title_similarity": "0.79652774"
        },
        {
            "id": "hxbmrui",
            "score": 2,
            "text": "Bail is for people who are arrested but not tried in court yet, so they technically aren’t guilty. Bail is essentially a deposit… you pay it ~~(usually 10%)~~ and are released, and then you get your deposit back when you show up to court. If you run away you lose your money and get an arrest warrant. It’s an incentive to make sure people show up to their trial.\n\nBut like you mentioned, it’s a controversial practice and not used everywhere. For one it hurts poor people more harshly. For another, the law may hamper judges from setting reasonable amounts. But generally if the suspect is known to be dangerous or a flight risk, they can deny bail.\n\nEdit: the 10% part was wrong.",
            "title_similarity": "0.80822265"
        },
        {
            "id": "hxbr9p5",
            "score": 2,
            "text": "The theory is that you’re going to want that money back. If you post bail and show up for your hearing and follow through with whatever punishment you’re handed, you will get the bail money back. However, bail makes it easy for the wealthy to continue enjoying their lives while the poor are forced to stay behind bars.",
            "title_similarity": "0.7986226"
        },
        {
            "id": "hxctpk1",
            "score": -3,
            "text": "Lols. It’s so that rich people can do whatever they want without consequence. Same with fines.",
            "title_similarity": "0.58833027"
        },
        {
            "id": "hxbukt2",
            "score": 0,
            "text": "It’s collateral. They are on a type of probation, and what keeps them from running away is the fact that they just put $100,000 in the court. \n\nIf they show up for trial they get 100% of the money back, but if they run? Tyne court keeps the money",
            "title_similarity": "0.67487156"
        },
        {
            "id": "hxbylzp",
            "score": 0,
            "text": "Read Malcolm Gladwell's Talking to Strangers, very insightful into how messed up the bail system is",
            "title_similarity": "0.6835773"
        },
        {
            "id": "hxc2z3t",
            "score": 0,
            "text": "How does this work in countries other than US? France, for example",
            "title_similarity": "0.42261937"
        },
        {
            "id": "hxckmzs",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.07345093"
        },
        {
            "id": "hxcracj",
            "score": 0,
            "text": "All of these are what bail is supposed to mean. But now, it means nothing. Everyone is released on bail now. Look up crimes in NY where you can be released on bail. It’s insane. It’s getting much worse too, people who have sexually assaulted, raped, stalking, they all get released now. Until their trial, if they show up. Had someone steal a car, crash it after a pursuit, chased his son with a metal bar saying he was going to kill him and he was released on bail. Nobody stays in jail anymore. Bail/bail laws are an absolute joke.",
            "title_similarity": "0.63933253"
        },
        {
            "id": "hxctd4w",
            "score": 0,
            "text": "Just a note, prison and jail are not the same thing, at least not in all contexts. Jail is where you're held before a trial, and prison is where you're sent if you're found guilty.\n\nI could be totally wrong, but that's what I've been told.",
            "title_similarity": "0.7323457"
        },
        {
            "id": "hxd6wli",
            "score": 0,
            "text": "Its a tricky subject. If you are accused of a crime, do we just hold you in jail regardless of future conviction or not or do we let you go free and just hope you come back. \n\nBail is that middle ground. The court will access whether you can do bail or if you are a flight risk, then bail is supposed to anchor you so you stay for trial by tying up your assets or the assets of those willing to front the money for you. \n\nGenerally whether you are guilty or not it you get the money back.",
            "title_similarity": "0.8154669"
        },
        {
            "id": "hxdc90y",
            "score": 0,
            "text": "Capitalism. Plain and simple. Bail is 100% intended to be a monetary value for your freedom, dependent on the crime committed.",
            "title_similarity": "0.6519836"
        },
        {
            "id": "hxe18cw",
            "score": 0,
            "text": "I haven't read any of the answers you've gotten, but the Bill of Rights says that we have the right to an affordable bond (or some similar wording), and what has always bothered me about that is that they don't give people affordable bond, even though it's their right.  What actually happens is the DA or Prosecutor decide how egregious your crime is, and then sets it based on that.  As I recall reading it, that is NOT what the law actually allows, but they do it anyway. I'm open to all comments.  If I'm wrong, let me know and why you think so, but I'm pretty sure it doesn't say an affordable bond will be set, oh, in parenthesis, unless the crime is bad, then we just make it too expensive to possibly bond out. That is NOT how it's supposed to work...",
            "title_similarity": "0.78355634"
        },
        {
            "id": "hxew107",
            "score": 0,
            "text": "For profit. Why else? Pay the bail bondsman, he gets his cut. Then if u do pay your bail to the jail and you don't come back they get their cut too. \n\nSo yeah profit, just like everything else.",
            "title_similarity": "0.75521255"
        },
        {
            "id": "hxf2nrb",
            "score": 0,
            "text": "Back in the day, mediaeval knights captured in battle would be ransomed to their families.\nGiven the tyranny of distance etc, the captors would offer bail to the captured so they'd agree to come back to complete the ransom months later.\n\nAnd they WOULD !",
            "title_similarity": "0.6638406"
        },
        {
            "id": "hxfv2go",
            "score": 0,
            "text": "Bail is to be clear about the judicial system being based and biased on money. If you can spend money on bail and an attorney, you probably get away with what you did. If you are innocent, but poor or dumb or a combination, you better plea guilty and take the deal of probation or time served, unless you want to be institutionalized.\nAfter that, move to another state or be on target to be in trouble.",
            "title_similarity": "0.79881716"
        },
        {
            "id": "hxcqeyq",
            "score": 1,
            "text": "To extract money from poor people for middlemen. US is basically the only country where it's a matter of course. Bail is not an issue for the wealthy.",
            "title_similarity": "0.60055304"
        },
        {
            "id": "hxcs1zo",
            "score": 1,
            "text": "The cash bail system is supposed to ensure people who’ve been arrested show up to trial.   Unfortunately, people who can’t afford bail get thrown in jail.  There was a case in CA where a court set bail at $350,000 for a guy accused of stealing a $7 bottle of cologne.  Thankfully, cash bail is being outlawed in a lot of states.",
            "title_similarity": "0.6491473"
        },
        {
            "id": "hxdiqde",
            "score": -1,
            "text": "Answer: The government will do anything they possibly can to take your money and make it theirs.",
            "title_similarity": "0.57059073"
        },
        {
            "id": "hxdo4oc",
            "score": -1,
            "text": "Because the penal system is more for punishing poor people for being poor than it is about maintaining justice. Always remember, if the penalty for a crime is a fine, that law only exists for poor people",
            "title_similarity": "0.66721725"
        },
        {
            "id": "hxdwcrb",
            "score": -1,
            "text": "Most laws are made for poor people, you can get away with just about anything for the right price...",
            "title_similarity": "0.5390986"
        },
        {
            "id": "hxdxljw",
            "score": -1,
            "text": "It really punishes those who are too poor to afford the bail, and puts bail bondsmen in a spot where they feel like they are police when they're just normal people lending money.  Realistically bail bondsmen should not exist if the person has accused of a crime to such a degree that they need kept in jail then they should remain in jail otherwise they should be free until their court date.  If anything we should have financial punishments/property punishments for not showing up to the court but even that is debatable but it for sure shouldn't be an up front cost.",
            "title_similarity": "0.79072964"
        },
        {
            "id": "hxe44t1",
            "score": -1,
            "text": "It’s wealth based Justice and should be eliminated.  $50 for some may be as impossible to post as $50,000 for others. It’s all relative. A wealthy person doesn’t deserve to get out because they have money anymore than a poor person.",
            "title_similarity": "0.65979135"
        },
        {
            "id": "hxe4z1i",
            "score": -1,
            "text": "TL;dr: it keeps poor people in jail and rich people can walk until court. The reasoning given is it prevents people skipping court and funds bounty hunters.",
            "title_similarity": "0.71224725"
        },
        {
            "id": "hxeiz71",
            "score": -1,
            "text": "This is kind of like the Prince Andrew pay out.  He basically had a ton of money to pay off that girl so he could avoid criminal charges.",
            "title_similarity": "0.673769"
        },
        {
            "id": "hxeri0b",
            "score": -1,
            "text": "Bail is to prevent shit judges from letting just anyone out. The question is valid,  unfortunately corrupt judges let the worst serial felons run free which is why they want to get rid of it so they don't have to count on the judge and the off chance he might remand pending bail.",
            "title_similarity": "0.7389184"
        },
        {
            "id": "hxezy70",
            "score": 1,
            "text": "Jail is where people go before they are tried, to stop them running away.\n\nPrison is where people go after they have been tried and sentenced to jail.\n\nBail is when it could be a long time before they get to be tried, so keeping them in jail seems unfair, but you really need to stop them running away. Making it so if they run away they lose a lot of money is a way of doing that.",
            "title_similarity": "0.7388637"
        },
        {
            "id": "hxfeegd",
            "score": 1,
            "text": "Browsing through answers, it's a little disheartening that most answers are clearly about the US (as one of the very few countries that have cash bail), but I have yet to see a single mention of the original, racist purpose of cash bail in the US.",
            "title_similarity": "0.7293301"
        },
        {
            "id": "hxbj4bp",
            "score": 9,
            "text": "It comes from the concept of not necessarily wanting to imprison everyone accused of a crime until their trial, but also wanting to impose an incentive for them to actually show up later.\n\nThe idea of bail is that the accused would surrender to the court something of a great enough value that they probably wouldn't just flee without it. If they show up to trial they get everything back, if they don't they lose it. The more serious a crime the more willing someone would be to just ditch the surrendered wealth, up to the point of the most serious crimes not offering bail because any price would be worth the escape. Also bail is supposed to be scaled based somewhat on the wealth of the accused in order to keep it an incentive but not unattainable.\n\nHowever there is a problem with this: Loans exist. Someone might borrow the money required to post bail. This of course grew into its own industry. The deal is usually as follows: You pay 10% of the total bail to a lender and they post the whole bail for you. You don't ever get the 10% back but the lender gets the whole amount returned if you show up to court. If you don't show the lender doesn't get their money back either, but now you owe the lender that money too and they will send people to find you (bounty hunters).",
            "title_similarity": "0.7905196"
        },
        {
            "id": "hxbwzsr",
            "score": 9,
            "text": "TLDR at the bottom.\n\nJail =/= Prison\n\nA jail is a place where a person who may or may not have commited a crime is detained for a \"short\" period of time before a trial can be scheduled.\n\nA prison is a long term detebtion faculty for people who have been found guilty in a court of law and are serving a sentence.\n\nNow for minor crimes like a speeding ticket there is no reason to detain a defended for the month or so it takes to schedule a trial for a $200 fine. For severe crimes like murder though, your likely going to spend your wait time in a jail cell. \n\nBut what do you do about more intermediate crimes, say armed robbery of a liqueur store. Nobody was harmed but you did bring a deadly weapon and stole some money. The defend isn't exactly a menace to society but its important to make sure they show up for there trial.\n\nWhat many places have come up with is bail. Basicly a defended will post an amount of money (usually quite large) as insurance for them to spend the time before there trial out of a jail cell. If the defended shows up the money is returned, if not the money is then posted as a bounty to any bounty hunters who want to bring them to the court house. \n\nThis is actually how Bail Bondsmen businesses run. They'll offer a bond (basicly a loan) to a defended wishing to post bail but is unable to afford the up front cost. If they arrive at court, the defended returns there bail money to the bondsmen with *some* interest (a lot of intrest actually). If the defendent fails to show up at court, the bondsman will track the defendent are... Force them... To go to court, and collect the bail bounty.\n\n\n\nTLDR: Prisons are not Jails. Jails hold people before they go to trial. Bail is money a person can pay to avoid waiting for trial in jail and to pay for bounty hunters to bring them to court if they fail to arrive. Bail Bondsman run a tighty business as loan sharks for people looking to avoid spending time in jail.",
            "title_similarity": "0.6745548"
        },
        {
            "id": "hxbxhqg",
            "score": -2,
            "text": "This can't be a serious question. If you murder someone, you should be arraigned and trusted to come back to court to answer for your alleged crime? That's being tried all over the nation, and is an abysmal failure.\n\nAlso, they are not \"buying\" themselves out. Bail money is returned whether innocent or guilty, at the discharge of the case against you.",
            "title_similarity": "0.7101848"
        },
        {
            "id": "hxbyhjd",
            "score": 2,
            "text": "By definition, until conviction the person is innocent. Jailing innocent people is against most people's definition of justice.",
            "title_similarity": "0.6693755"
        },
        {
            "id": "hxc5nse",
            "score": 2,
            "text": "[What if we ended the injustice of bail?](https://www.youtube.com/watch?v=3B24RaqA33k)\n\nEveryone should watch this.",
            "title_similarity": "0.5767592"
        },
        {
            "id": "hxcb17n",
            "score": 2,
            "text": "There are many technically correct answers here but they lack some practical aspects.\n\nBail is collateral put up to ensure you return for your court date on paper, but it is somewhat more than that in practice.\n\nIf you get arrested for something silly and not terribly harmful you can get \"own recognizance\" which is effectively zero bail and zero paperwork.  You get arraigned, you go home and return for the trial.\n\nIf you get arrested for something particularly awful you get a large bail set, this not only makes you risk serious capital if you fail to comply with the directions of the court but also often requires that you enlist a bail bondsman to come up with that much liquidity, this has several advantages for the legal system:\n\n* bondsman can set conditions and require more documentation than the court can in some circumstances\n* bondsman are motivated to have the fugitive retrieved out of their own pocket if they skip a court appearance\n* the court does not need to maintain their own system for dealing with less liquid assets while still allowing people to post bond without cash on hand.\n* the court can maintain a much more reasonable workload and work more efficiently by allowing time between arraignment and trial and to do that without legal challenges to the duration between the two they need to release the bulk of those arrested.\n\nBail cannot work as it currently does if it is directly proportional to a person's income or personal wealth.  That is taken into consideration along with their flight risk and the severity of the crime, but it cannot be so low as to fall outside the prevue of a felony nor can it go so high as to be a dollar figure that no bondsman can produce in cash or cashier check, so there is effectively a minimum and at some point a maximum for practical reasons.  On the high end you usually get held without bail, on the low end you get a few thousand dollars set as bail and you need 5-10% in collateral to go to the bondsman (numbers will vary regionally and by situation).\n\nBail reform (as in things that have been tried, not the concept itself necessarily) has been wildly unpopular in many communities.  If you run a poll asking \"should there be bail reform\" you get 70-90% of the population saying yes.  If you go to a location that has implemented some form of bail reform and ask \"has this been a positive change\" you get 60-70% saying no.\n\nBail is not always fair, but it does serve a purpose.  The general public recognises that purpose and typically accepts a certain degree on unfair outcomes.  The alternatives would be massively more spending to start, trials sooner, but allow them to drag out even longer or to just stop releasing people prior to trial - both of those result in more people spending more time in jail before going free or turning more people lose on no bail or minimal bail, which is what has been popular recently, but it is also the source of significant preventable crime and the reason that the polling numbers swing so dramatically against bail reform when it has been tried.\n\nThe general public is on average more ok with someone spending their wait for trial in jail than they are in letting more people commit additional crimes after they have already been arrested.  The more crime you have in  an area the more the public thinks that way.",
            "title_similarity": "0.8240999"
        },
        {
            "id": "hxcxttw",
            "score": 2,
            "text": "Bail is a way for the court to make sure accused criminals show up for their trials - it is not a way for rich people to buy their way out of prison sentences.\n\nThe idea behind bail is simple.  You agree to let the court hold onto a large amount of your money until the trial, and you only get the money back if you show up.\n\nFor most people, the risk of losing your life savings is a good incentive to come back to court.  For minor crimes, like a traffic ticket, having people forfeit their bail is a good way for the court to efficiently collect fines without having to hold an expensive trial for every little thing.\n\n&#x200B;\n\nImagine you were accused of a crime, you have a trial in two weeks, and if convicted, you will be sent to prison for ten years - and you're scared.  Well, naturally, you might decide you'd rather not go the trial at all.  It's hard to escape from the sheriff if you're already in a courtroom.  But if you run away, they might never catch you!\n\nOf course, the most obvious way to make sure accused criminals don't run away before their trials is to just lock them in jail until their trials start.\n\nBut locking an accused person in jail is expensive for the government.  It also uses up a jail cell for a person who has merely been accused of a crime, but not convicted.  Bail is a useful alternative that makes sure accused criminals show up for their trials without the sheriff having to drag them there.\n\n&#x200B;\n\nNow, bail is not without its problems.  First, if you don't have much in the way of savings, the risk of losing all your money might not be very compelling to you - so very poor people typically have to be locked up until their trials.  Similarly, if you are very wealthy, you might be willing to risk losing huge amounts of money to run away, making it hard for bail to be persuasive.  Wealthy people are typically easier to track though, making ankle monitors and house arrest better solutions.\n\nFinally, if you have moderate means, you might out a loan to pay for bail - called a \"bail bond.\"  But since that loan isn't really *your* money, you might not mind letting the court keep it and going on the run - especially if you got your mom or your girlfriend to take out the loan, as often happens.  This is why bail bondsmen employ bounty hunters, to track down people who take out loans and make sure they show up for court.  You might not care about they money, but you probably don't want Bubba to break your legs.",
            "title_similarity": "0.8119556"
        },
        {
            "id": "hxbhiis",
            "score": 22,
            "text": "Bail is money put up so that the person can be released pending trial. The idea is that the person is not yet innocent or guilty, so if there is no reason for them to flee, the court can allow them to put up some money (or have someone put up some money) that is used as a guarantee they will show up for court when it happens. \n\nNot everyone is offered bail.",
            "title_similarity": "0.7892525"
        },
        {
            "id": "hxbhuy2",
            "score": 2,
            "text": "If someone can post bail, they haven't been convicted, so it hasn't been determined if they should be imprisoned. They're typically jailed so the law knows they'll show up to trial. If they pay bail, they're putting down money to promise they'll show up and, when they do, they get their money back (or the bail bond company they paid to post bail for them does). That's why bail is denied for particularly dangerous suspects or flight risks. If they don't show up, a new warrant is drawn up for their arrest (and if they used a bail bond company, a bounty hunter may be hired to track them down, since the company wants its money back).",
            "title_similarity": "0.77511656"
        },
        {
            "id": "hxbx6pd",
            "score": 3,
            "text": "I think no one mentioned this, but bail also exists because there isn't unlimited space in jail. That and keeping someone in jail costs $$$ to the taxpayer.",
            "title_similarity": "0.7159809"
        },
        {
            "id": "hxcvg6c",
            "score": 4,
            "text": "I'm a bit disturbed by the amount of people in this thread who do not know that bail is collateral for the accused to show up for their court date and not a fee to get off scott-free.",
            "title_similarity": "0.73443294"
        },
        {
            "id": "hxdtuxg",
            "score": 4,
            "text": "The fact that bail incentivizes the defendant to show up has been well established by now.\n\nSo I would like to add an important reason that we let people be free until their court date: it allows you to form a defense.\n\nForming an adequate defense is tricky as it is. It's even harder when you are stuck in jail with essentially no communication out. Even more so before modern communications. How are you supposed to find your witnesses, evidence, work with lawyers, etc from jail?",
            "title_similarity": "0.84128237"
        },
        {
            "id": "hxe2bog",
            "score": 5,
            "text": "Bail is like a bond. It's not a get out of jail card. Such a huge misconception. People literally think 'criminals' are buying themselves a ticket out of jail.",
            "title_similarity": "0.7769356"
        },
        {
            "id": "hxcpyca",
            "score": 104,
            "text": "A lot of people here conflating cash bail with bail generally\n\nThe US is one of 3 countries globally (afaik) that use a cash bail system. And i'm pretty sure the other 2 two (Philippines and Canada in some cases) got it from us.\n\nIn a fair criminal justice system, you are innocent until proven guilty. You can't be proven guilty until you've gone to trial, evidence for and against your conviction is weighed up, and a judge determines your fate. The point of bail then, is to determine if you should go free or be held until your court date. \n\nI'm sure if you've been falsely accused of a crime, you wouldn't want to sit in jail until the trial date would you? This would effectively be serving a sentence for a crime you didn't commit. You have a constitutional right to a speedy trial, but the criminal justice system in the US is extremely backed up, so in practice most states are probably violating the constitution in this regard (edit: maybe? it's complicated, either way, expect to wait a good while until your trial) \n\nIn NY for instance, waits can be over a year. In the Bronx specifically, they are closer to 2 years. This is pre-trial, pre-conviction. A situation like this happened to [Kalief Browder](https://en.wikipedia.org/wiki/Kalief_Browder), and eventually led to bail reform in NYC\n\nThe question then is how to determine if someone should be free to go until the trial date, or if they represent an active threat to their community and should be held? This is bail. In the US system, you pay _cash_ bail, which is a dollar amount that is _supposed_ to have some rational basis related to your income, the crime you committed, etc. It should be high enough that you want to get it back, but not so high that you can't pay it at all. Unfortunately, this is not the case, and large amounts of people rot in jail pre-trial due to not being able to afford cash bail\n\nIf you can't pay, you sit in jail until your trial date. Often you will be pressured to take a plea bargain and admit guilt, in order to get out. Again, you haven't been convicted of anything at this point. It could be as simple as a cop accuses you of a crime, and that's it\n\nThis has led to the bail bondsman industry that other folks here have gotten into. A whole predatory industry that revolves around extorting poor people who can't pay their cash bail\n\nIn other countries, there is no money involved with bail. The judge determines if you qualify for bail based on your record, the type of crime you've been accused of, etc. Usually you have to check-in regularly, or wear an ankle monitor, etc, but at least your financial wealth does not impact the outcome. Some more progressive jurisdictions in the US do this, but it's not super widespread. \n\nThe downsides of course are that a shitty or lazy judge could just let someone go out on bail who should not be (such as a repeat offender, or a potential flight risk), but the alternative is jailing tons of innocent people or people with minor offenses\n\nI'm no expert, but a lot of people in this thread clearly don't understand the basics of the justice system and seem to just assume anyone caught up in it is automatically guilty. I have a feeling these people would change their tune awfully quick if it was them or someone close to them who had to deal with this\n\nedit: fixed some grammar, minor corrections. also, while i was a bit snippy, i am no lawyer, just a regular person who works somewhat adjacent to this space. the lack of basic knowledge revealed in this thread is pretty crazy to me and is why I made the comment in the first place",
            "title_similarity": "0.78416574"
        },
        {
            "id": "hxbxcxr",
            "score": 58,
            "text": "You misunderstand what bail is. It's not 'pay this money to avoid your sentence.'\n\nThere's a very long process that takes place before there is an actual trial and (possible) conviction. They need to figure out what to do with you until you have your opportunity to have a trial. At this point you are still **innocent until proven guilty**. One option is to hold you in jail until your trial, but this can be problematic. What happens if you're eventually found innocent? \n\nThe other option is to pay bail. When you pay bail, you don't have to stay in jail from the period you're arrested until you actually have trial. But, if you 'skip bail' and run away before your trial, the court keeps the money. The bail money you paid is incentive for you to actually show up for your trial, because if you don't you lose it. Say for example you paid $100,000 bail. Getting your $100K back is a pretty strong incentive for you to show up to your trial.\n\nThe timeline looks something like this: (1) Arrested (and charged) --> (2) Period of time before you have a trial --> (3) Trial (found guilty or innocent) --> (4) Sentence if found guilty.\n\nBail comes into play at that second stage. They'll either hold you in jail until your trial, or let you pay bail to live 'normally' until your trial. Once you have your actual trial, there is no more bail. You're either innocent and set free,  or you're guilty and serve your jail/prison sentence.",
            "title_similarity": "0.7737669"
        },
        {
            "id": "hxc3b3u",
            "score": 341,
            "text": "ELI5: You do something bad. Your Big Sister catches you and tells you to stay in your room until your Dad comes home and decides if you should be punished or not. You don't want to stay in your room. Big Sis says \"OK, you can leave the room, but I'm going to take your Xbox and if you don't come back at dinner time and tell your Dad what you did, I'm going to give keep your XBox.  \n\n\nSo in this case \"Jail\" is your room. \"Bail\" is your XBox. Your \"Trial\" is when your Dad gets home.\n\nYou can either stay in your room, or you can let Big Sis hold your XBox hostage promise to come back to face Dad. If you don't she keeps the XBox.",
            "title_similarity": "0.52153385"
        },
        {
            "id": "hxbysa5",
            "score": 476,
            "text": "It's worth pointing out that America is one of only two nations that practices cash bail as a standard thing, it's basically unheard of for most people.\n\nIn the UK for example you have conditions set on your bail, such as needing to regularly check in or in extreme cases wear some sort of tracker.\n\nIf you do abscond and get caught well you just won't be given bail a second time.",
            "title_similarity": "0.75230986"
        },
        {
            "id": "hxbhdfv",
            "score": 4590,
            "text": "It's not about whether they should or shouldn't be in jail, it's about making sure they stick around so that we can determine whether they should or shouldn't be in jail. It's quite hard to prosecute someone if they don't stick around.\n\nSo we have two solutions: just keep them in a jail until their court date. Or honor system.\n\nBoth of those are problematic, so we have a bail system. Basically you put up collateral that is incentive for you to come back on your court date. If you come back, you get your money back, otherwise the court keeps the money.\n\nEDIT: [While details can vary, if you pay the bail yourself (cash bail) you get that money back regardless of guilt or innocence.](https://www.themarshallproject.org/2020/10/28/the-ins-and-outs-of-bail)",
            "title_similarity": "0.80436313"
        },
        {
            "id": "hxbil3d",
            "score": 1521,
            "text": "I’ll add on, bail is often set high, so they have the option of putting up a bond. A bondsman will basically pay your bail and make someone co-sign for you. So now Mom’s house might be on the line if you don’t show up for court. We also have a bondsman who is very motivated to find you to get their money back, they probably have a list of your relatives, friends, past addresses, and a few dozen pictures of you so they can put up a nice wanted poster and offer a reward.",
            "title_similarity": "0.73314905"
        },
        {
            "id": "hxbhhgn",
            "score": 9869,
            "text": "Bail is for when a person has not been tried or convicted yet. It's basically collateral to ensure that the person shows up for trial. If they fail to appear, the bail money is forfeit. If the court decides that a person is likely to flee or just not show up, they will deny bail and hold them until trial.",
            "title_similarity": "0.70111704"
        },
        {
            "id": "hxbiq62",
            "score": 1,
            "text": "Bail is to get out of jail for the time between their arrest and trial -- the money is basically a deposit to insure your show up to trial. People accused of crimes are presumed innocent until proven guilty, so it's letting somebody that's not yet convicted of a crime remain free until they are proven guilty. The worse the crime, the higher the bail is since the likelihood of running is presumably higher. For particularly heinous crimes, they may refuse to offer bail to keep somebody in jail until trial. There is also the expense factor to keep somebody incarcerated... say somebody was arrested for shoplifting, is it better to let them out on $10k bail or keep them in jail, and have to spend $20k to feed, house, provide medical care, etc. for 6 months until their trial? And if it turns out they didn't actually steal anything at all, but were accused of stealing a candy bar from a grocery store they'd bought earlier at 7-Eleven and fell out of their pocket, but you've not cost them their job, 6 months of income, etc?",
            "title_similarity": "0.8053446"
        },
        {
            "id": "hxbtc7r",
            "score": 1,
            "text": "Bail isn't buying your way out of a crime, it's buying comfort, and the ability to get affairs things in order.\n\nBail is for when a person has not been tried or convicted yet. For all intents and purposes, they're innocent at this point. \n\nIt's a form of collateral to make sure that the person shows up for trial, and bail isn't afforded to everyone.",
            "title_similarity": "0.7626282"
        },
        {
            "id": "hxc0ykj",
            "score": 1,
            "text": "It's a chance for rich people to spend a few extra days of freedom in case they break the law and are caught.",
            "title_similarity": "0.68185496"
        },
        {
            "id": "hxc0zri",
            "score": 1,
            "text": "TIL you get your bail money back if you show up to everything you’re supposed to. I always just thought it was like Monopoly - if you have the funds, you can get out of jail but you’ll never get it back.",
            "title_similarity": "0.7232542"
        },
        {
            "id": "hxc10ty",
            "score": 1,
            "text": "In theory, bail is basically like the deposit on an apartment.  It is a financial incentive meant to ensure good behavior.  If you know you will get your deposit back, you are more likely to clean the apartment and use it more gently.  If you know you will get your bail back if you show up to your trial, you are more likely to show up at your trial.\n\nMeanwhile it saves the state the expense of imprisoning a person.  \n\nUnfortunately bail systems only really work well in an environment in which everyone is middle class with significant savings or property.  For the working class and poor it just serves to impoverish them more since they don't have the money and can't borrow it.  Also humans don't always act perfectly rationally.  Loved ones are often blind the flight risk of their loved ones in prison.  And people accused of a crime can panic or don't care who they hurt to escape justice.  The end result is people will lose homes over bail.  \n\nGiven modern technology, bail is an obsolete institution.   A computer program can monitor ankle bracelets, allowing everyone to work.  And the  computer program could instantly just down debit and credit cards, and shut down vehicles owned by the wearer.",
            "title_similarity": "0.7709849"
        },
        {
            "id": "hxc155h",
            "score": 1,
            "text": "Dictionary: \"Jail and prison are often used interchangeably as places of confinement. If you want to be specific jail can be used to describe a place for those awaiting trial or held for minor crimes, whereas prison describes a place for convicted criminals of serious crimes.\"\n\nPeople who have been charged with a crime but not yet convicted are offered bail so that they can continue to \"live their lives\" while waiting for a determination of innocence/guilt. This offering is usually based on the seriousness of the charges and if they are deemed likely to return for their hearing/trial. Sometimes the period between charges being brought and the actual hearing/trial is quite lengthy and, since people are presumed innocent until proven guilty, bail is seen as a mercy because it is the least disruptive option.\n\nThose convicted of a crime are not offered bail. Those accused of serious crimes and those determined to be unlikely to return for a hearing/trial are also not offered bail.",
            "title_similarity": "0.78834945"
        },
        {
            "id": "hxc1hj7",
            "score": 1,
            "text": "Check out pretrial systems. John Oliver did a pretty good piece on it a few years back. It’s not the best system, but it’s a step in the right direction.",
            "title_similarity": "0.5954658"
        },
        {
            "id": "hxc20jn",
            "score": 1,
            "text": "In my humble opinion, release should be contingent on risk. Someone isn't safe on the streets just because they can afford bail. Money should never enter into it.",
            "title_similarity": "0.64595"
        },
        {
            "id": "hxc2m9u",
            "score": 1,
            "text": "There is a difference between \"jail\" and \"prison\". Jail is like in those old westerns. The Sherriff captures a bank robber.... so what do we do with him? Put him in jail until the judge comes by so he can have his day in court and go to trial.   \n\n\nJail is where you put people while they wait for their trial. Prison is where you go if you are convicted of your crime and sentanced to serve prison time. However, people generically call prison \"jail\".  \n\n\nSo what is bail? Well, if you're not a violent offender, meaning that instead of robbing at gunpoint, you shoplifted a TV, and you don't seem the type to run away and never come back, then your lawyer may ask the judge to \"grant you bail\". What this means is that if you give the court a large monetary deposit (the bail amount), then you can go free. You GET THE MONEY BACK when you show up for court. If you DON'T show up for court, then the court keeps that money and you are now wanted and the police will arrest you when they find you and haul you back to jail without bail. Your money is gone, you don't get it back even after the cops catch you.  \n\n\nSo OK, you did something and you're in jail and the bail amount is $50,000. Well that's enough to make anyone come back to court but...you don't have it. So you go to a guy (bail bondsman) who lends you the money for bail, but in return, you have to pay a percentage of it to him. So he'll lend you $50,000, and you pay him $5000 for it. Now you go free until your court date. If you show up in court, the bail bondsman gets the $50,000 back, and you owe him $5,000. If you skip the court date and run away, the bail bondsman can hire a bounty hunter to track you down because you now owe him money. The part I'm not clear about is if he gets the bail back if he brings you to court ??  \n\n\nTLDR: Jail is where they hold people who are arrested until their trial. Bail is money you let the court hold hostage until you show up for your trial in exchange for being let out of jail, if you qualify for it.",
            "title_similarity": "0.695599"
        },
        {
            "id": "hxc3wg9",
            "score": 1,
            "text": "One thing worth pointing out that I have not seen mentioned yet, is that if your record is clean they will often set bail very low, and if you have zero previous arrests, even allow \"pre-trial release\" which means no bail, just sign an agreement to come back for trial and show up with a pre-trial officer once in awhile.   \n\n\nSo everyone stating that \"they shouldn't set a high bail for folks unlikely to recommit crimes or skip trial\" they often set it to 0 essentially.",
            "title_similarity": "0.75659466"
        },
        {
            "id": "hxc40nl",
            "score": 1,
            "text": "You don’t get bailed from prison. You get bailed from jail, which only before you have your day in court. The bail is refunded when you show up to court. Once you are convicted of a crime and sentenced you cannot pay any amount of money to get out. \n In the USA the right of a fair and speedy trial as well as the right to non excessive bail is in bill of rights.",
            "title_similarity": "0.7531383"
        },
        {
            "id": "hxc468o",
            "score": 1,
            "text": "Different jurisdictions have different systems of course. In the UK no money is involved. You are released on bail (subject to the Bail Act) with a requirement to present yourself at court on the specified date.",
            "title_similarity": "0.5812007"
        },
        {
            "id": "hxc48bj",
            "score": 1,
            "text": "Ideally, in our \"justice\" system, a suspect has presumed innocence until guilt is proven in court by the prosecuting jurisdiction.\n\nWhen you are suspected of a felony crime and are arrested, they hold you in jail until your trial because they would like you to \\*be\\* at court for your trial so they don't have to go find you and drag your ass back in there. \n\nThis is one of the reasons why there are \\*MANY\\* people in jail in the US who have not been convicted of any crime. If you are poor and get arrested for something because you 'fit the description' you are in a pretty bad situation if you weren't planning on spending some time behind bars.\n\nBail is a promise to attend court in exchange for you being able to not sleep in a cell every night, and the bond money required to do so is supposed to be your incentive to not skip town and forfeit your cash.",
            "title_similarity": "0.7679638"
        },
        {
            "id": "hxc4iqu",
            "score": 1,
            "text": "There are lots of people who are only in jail because they or their family can't afford bail, people who haven't even been convicted of a crime, just guilty of being poor.  Rich folks just pay the bail and live their lives, poor folks go to jail despite no actual conviction.  I forget the kids name but there was a young man \"accused\" of stealing a backpack, spent 3 years in prison awaiting trial and died in jail awaiting trial, hadn't even been found guilty, just couldn't afford bail.",
            "title_similarity": "0.59825504"
        },
        {
            "id": "hxc51ah",
            "score": 1,
            "text": "Government likes money and laws are written by rich people. Everybody wins (except the poor people, but nobody cares about it)",
            "title_similarity": "0.65294135"
        },
        {
            "id": "hxc55a6",
            "score": 1,
            "text": "Ah right ok ..thanks..strange system ..so basically if u can afford the loss financially u can post bail then split the country .",
            "title_similarity": "0.7159829"
        },
        {
            "id": "hxc58gt",
            "score": 1,
            "text": "I think the basic idea is that it provide some sort of guarantee that the person will show up on his/her court day and they get the money back if they show up. (Or the bail bond place does if they had to take out a loan to make bail.)",
            "title_similarity": "0.6825865"
        },
        {
            "id": "hxc63wd",
            "score": 1,
            "text": "Y'all people need more TV, it abounds with shows explaining the bail system. Dog the Bounty Hunter, The Fall Guy, Sneaky Pete... Pick your poison.",
            "title_similarity": "0.55413115"
        },
        {
            "id": "hxc6ymx",
            "score": 1,
            "text": "First, it's not \"prison\" bail. It's jail bail. Prison is where you go after you are convicted if a felony. \nSecond,  you are eligible for bail because you have NOT been convicted of anything.  We are all presumed INNOCENT until PROVEN guilty.  The bail is to ensure court appearance.",
            "title_similarity": "0.7800926"
        },
        {
            "id": "hxc70eo",
            "score": 1,
            "text": "Bail is not a buyout. It's a security deposit, that is returned to you when you show up to court or when the process ends. The only time you pay is when you use the services of a bail bondsman who essentially charges you a percentage of bail to loan you the money.\n\nThe reason why release is contingent on money amount is because a large enough bail supposedly guarantees that you won't try to run and will show up for your scheduled course dates. If you don't show up, you will forfeit the bail amount\n\nThe reason why bail exists in the first place is because it's taxing on the prison system and also morally ambiguous to hold a person in jail who hasn't been convicted or sentenced. The only purpose of jail in that case is to ensure they won't flee. Large enough bail can do that just as well. And if they think you will run no matter what - bail can be denied",
            "title_similarity": "0.7786614"
        },
        {
            "id": "hxc7sqk",
            "score": 1,
            "text": "Another piece that I haven’t seen mentioned yet, being arrested & held until charges are filed is not seen as a “punishment” by the justice system.  As long as they had probable cause to arrest you, they can’t be sued even if you’re proven innocent.  That’s the only time bail really comes into play; you’ve been arrested, charged, & arraigned for a crime but get released until the trial is completed, otherwise you sat in jail.\n\nI don’t know the backstory on why bail was created but I would assume one reason it has persisted is that as the courts became backlogged, there were a lot of middle & upper class stuck waiting for their dates.  For that group, bail was/is a good workaround.  It’s expensive but how many crimes is that group really committing?\n\nThe problem is, we didn’t address the underlying issue of the courts being backlogged so poor people are left without the money to get out & without the public will to decrease the backlog.\n\nI think bail should be ended & everyone gets released until their trial date *unless* the court thinks they’re a threat to society, just playing some devil’s advocate above.",
            "title_similarity": "0.7620349"
        },
        {
            "id": "hxca7a7",
            "score": 1,
            "text": "The purpose of prison bail is to make the feds easy money.\n\nIt is made contingent on money because poor people can't afford it and end up stuck in prison working for corporations for free while tons of Leo's feast off of taxpayers. Aka greedy sociopaths get paid, everyone else gets screwed.",
            "title_similarity": "0.6897782"
        },
        {
            "id": "hxcabzf",
            "score": 1,
            "text": "It is \"a security\". A \"deposit\". \n\nHow do we know you won't run away before the trial? Well, at least give us a large sum of money which you won't get back unless you return. \n\nIt's pretty basic.",
            "title_similarity": "0.7104134"
        },
        {
            "id": "hxcd3hd",
            "score": 1,
            "text": "TV misrepresnts this: Joe is arrested, family bails him out, never hear about again.\n\nReality: Joe is arrested, family bails him out, 1 year later Joe has to show up for trial, be convicted, then go to jail for the duration of his sentence.\n\nThe only thing bail does it determine which side of the bars you are on until your trial completes.",
            "title_similarity": "0.59050405"
        },
        {
            "id": "hxcdbjw",
            "score": 1,
            "text": "Bail is typically imposed in two circumstances, both of which require judicial findings.  The first, most common instance is if a defendant poses a risk of flight or some other attempt to evade prosecution.  If you're going to run then the thought is that money will keep you tethered to the area.  There are other ways to prove to a court you will stick around, but bail is an option.\n\nThe other is in cases where the defendant poses some risk of harm to a member of the community.  Those cases are typically significantly higher bail amounts, usually designed to keep a person incarcerated.\n\nCourts also have the option of holding people without bail but that usually only happens in the most serious of cases.",
            "title_similarity": "0.79243314"
        },
        {
            "id": "hxce16x",
            "score": 1,
            "text": "Jail and prisons aren't the same thing (generally), jail is where you go where they kind of figure out what to do with you, including while you await trial. Prison is where you go once you're sentenced. You can get bailed out of jail because you're not convicted yet (and innocent until proven guilty etc), but not prison (though you can make parole). Posting bail helps reduce demand on the jail system, saving money, in a way that reduces flight risk.",
            "title_similarity": "0.8330941"
        },
        {
            "id": "hxce6eh",
            "score": 1,
            "text": "If you are allowed to post bail, that means you haven’t been convicted yet. By default, if you haven’t been convicted, you should be walking around free. Innocent until proven guilty.\n\nThat said, not everybody shows up to court when they are supposed to. Cash bail is meant to ensure you show up to court for your trial. It is supposed to be sized to balance the financial pain it would cause if you skipped against your motivation for avoiding the court room. If you are facing a life sentence, you probably don’t mind leaving $1,000 on the table to skip the country and avoid jail. $1 million might be better. When you show up to court, you get your money back.\n\nIn real life, many people cannot come up with the cash in a short time. Instead, they ask a bail bondsman to put up 90% of the cash, and they put up only 10%. If they show up to court, the bondsman keeps the 10%, and gets their 90% back. If they don’t show up to court, the bondsman is out a lot of money, tries to find the accused to bring them to court and get their money back. This is called bounty hunting.\n\nBail is meant to be a temporary transfer of cash that is 100% refunded. Because many people don’t have the cash, they end up actually paying 10% of the bond amount out-of-pocket. This cost disproportionately affects poor people. For this reason, many jurisdictions and states are moving away from cash bail.",
            "title_similarity": "0.8054409"
        },
        {
            "id": "hxcejjy",
            "score": 1,
            "text": "Under the Bail Sentencing Reform Act, liberty became the norm.  However, the legislature and courts cannot ignore the accusation nor the temptation to flee the jurisdiction.  So, society attached a dollar amount to the freedom as an inducement to return to court.\n\nHowever, it's been pretty heavily bastardized by the bail industry.  However, they hire bounty hunters at their expense rather than at society's expense.",
            "title_similarity": "0.8153641"
        },
        {
            "id": "hxcfp9c",
            "score": 1,
            "text": "Bail is set up so the system can pretend that people aren't being locked up without being convicted of a crime. In a just system, people would get a speedy trial, and the small amount of time spent in jail awaiting trial would not be harmful. Or, bail would be low enough that they can pay while being high enough to motivate them to come back. That is the fantasy idea, and we use it to pretend that the system is working as intended.\n\nHowever. For people with limited money, it means that they will be locked up for several years without a trial. Or, they can take a plea deal (which happens very very frequently), even when they are not guilty, in order to just get back to their lives. It is a way for the justice system to punish people, by threatening them with lengthy pre-trial detainment. \n\nMeanwhile, rich people can easily get bail. And push back their trials, living their lives like normal. And fancy lawyers pull out all of the tricks so that they can get reduced sentences, or get charges dropped (many never go to trial, but if they do, they will now often be not guilty, or get slaps on the wrist). If they do get denied bail, their fancy lawyers will get them a speedy trial so that they can get their wrist-slap faster.\n\nBail reform is tricky, because if somebody is out on bail for  (bad crime), and they then commit (other bad crime), then people call for blood and insist people should never be out on bond for (bad crime).  However, if somebody is out on bail, they have just been arrested and not convicted of a crime. The better way to handle it is to speed up the process for trials.",
            "title_similarity": "0.81950366"
        },
        {
            "id": "hxcfy8a",
            "score": 1,
            "text": "I don't have any personal experience, but sometimes your court date can be a year out from the day you're arrested. The system is set up that we presume your innocence, and it wouldn't be very fair for you to be imprisoned for an entire year only to get to trial and prove that it was actually your evil twin brother that committed the crime.\n\nBased on those two things, there's a motivation to let people out and about while awaiting trial.",
            "title_similarity": "0.7013787"
        },
        {
            "id": "hxcg591",
            "score": 1,
            "text": "Bail isn't a punishment. It's purpose is to make sure you show up to court so it can be determined if there even will be a punishment. You get bail back if you show up to court. It isn't like you are buying your way out of a punishment. Bail is just a guarantee you will show up to get your money back, and for some people that value needs to be very high, and others not so much. Bail is different for every person because it's specifically chosen to be an amount they can pay, but would not want to lose. The alternative is just sitting in jail waiting for your court date. But you haven't been convicted of anything at that point.",
            "title_similarity": "0.8132646"
        },
        {
            "id": "hxcgo36",
            "score": 1,
            "text": "It's a separate question actually. \n\nA lot of defendants are held on a NO BOND condition- ie they previously violated pretrial release conditions or they're being held for something super serious and the judge is worried they will flee before trial or commit further horrible offenses.",
            "title_similarity": "0.6888155"
        },
        {
            "id": "hxcgxsj",
            "score": 1,
            "text": "Edit: to directly answer your question: innocent until proven guilty. Being in jail without conviction and without the right to jail is, essentially, punishing the innocent. Bail is away to give something as a promise you'll return. If I let you borrow a pencil, you may never give it back; if I let you borrow a pencil but ask that you let me hold onto a $5bill until you give the pencil back, you'll likely give me the pencil back.\n\n&#x200B;\n\n(original text)\n\nSomething I've seen missed here is ROR. Released on Own Recognizance, this is what happened when I was arrested, I asked the judge for ROR in lieu of bail. I had strong ties to the community, it was my first alleged crime, and I was an otherwise upstanding citizen. Basically, the honor system. The judge determines that you're not going to flee and that you'll return to the court system on your scheduled dates and if you don't return, you've not likely left the area so you'll be quick to track down and arrest.\n\nThis does happen often but not nearly as often as bail. The prosecution will usually argue against it because they want to ensure you show up for trial or whatever hearing is scheduled next but a good defense lawyer will try to argue for it. You will typically need a home in the area, have a family, children in school in the area, family in the area, and be involved in the community in one way or another. Prosecution will require you surrender your passport and may demand pre-trial house arrest (as was my case).",
            "title_similarity": "0.77118975"
        },
        {
            "id": "hxchdy2",
            "score": 1,
            "text": "You do realize that we here are having a discussion about America right? \nIn this country you’re innocent until proven guilty. \nNot guilty by arrest & convicted by “public opinion”but the general public assumes that if you’re in any situation & you are arrested you must be morally bankrupt. It’s terrible people who have this elitist, better than attitude are the fundamental problem in general. Society would rather society be found guilty until proven innocent UNLESS it seems to be somehow going to negatively affect or impact they or someone they love’s life. That about right for how you feel uxoandy?",
            "title_similarity": "0.717082"
        },
        {
            "id": "hxci1z0",
            "score": 1,
            "text": "I'm thinking a presumption of innocence balanced by the fact they may potentially be guilty.  The potential for guilt is where the money comes in.",
            "title_similarity": "0.6745479"
        },
        {
            "id": "hxcj336",
            "score": 1,
            "text": "Innocent until proven guilty means that ideally no one should be in jail until they're convicted. But the reality is that many people won't show up for their court date, so in many cases some kind of collateral is needed to make sure they do.\n\nBut they're is some backlash, because the bail system means that many people without the means to pay, must stay in jail, which isn't really just.",
            "title_similarity": "0.74385285"
        },
        {
            "id": "hxcmcp7",
            "score": 1,
            "text": "This goes back many centuries to when criminals were able to pay their way completely out of jail time (same as today, depending on the crime). As the justice systems evolved in various countries, the tolerances and allowances for such things changed as well - forcing jail time for what society deems the worst offenses. This eventually evolved into a bail/bond system, particularly as the wait times for \"justice\" grew. You arent guilty until proven so, so if the charge isn't that bad should you have to wait in a jail?\n\nYou can say it's to stop them from fleeing, but people with money have the money, and people who don't - don't. In most countries, there is not a sliding scale/percentage of what you make in relation to what you have to pay. For the rich, most forms of bail are essentially laughable.",
            "title_similarity": "0.8258982"
        },
        {
            "id": "hxco7aa",
            "score": 1,
            "text": "The super short answer is that if you put up the bail money and you show up to court and engage with the justice system, you will get most of the money back. It's your pledge that \"you can let me out and I won't run away, because if I do you get all this money of mine.\"\n\nThe longer answer is that bail isn't just money and there's a whole bunch of law on when bail is needed, when other conditions are needed, what will cause you to forfeit the money, etc etc. But at the end of the day you put up the money to say\" if I mess up, the government gets all of this.\"",
            "title_similarity": "0.8146586"
        },
        {
            "id": "hxcopap",
            "score": 1,
            "text": "You get your bail back after all the court stuff is done. \n\nBail is an incentive for the system to allow some non-dangerous offenders back in the street so as to not overload the jails all while giving the offender an incentive to keep going to court after being released - to get their bail money back.  \n\nVery dangerous offenders are usually denied bail - so as to not even give them the option of being back in the street. \n\nOver 25 percent of Americans have been to jail - we have one of the highest incarceration rates in the world.  We would completely overflow the system if we actually denied bail to everyone and made them wait for trial in jail.",
            "title_similarity": "0.7897678"
        },
        {
            "id": "hxcoqr0",
            "score": 1,
            "text": "It's basically why your ability to win or lose a trial in court is directly related to your bank account. It's also basically the same as standard fines for civil infractions which allow those with lots of money to simply not care about them. It's because in the US your value as a person is directly related to the value of your bank account.",
            "title_similarity": "0.7516244"
        },
        {
            "id": "hxcp8rn",
            "score": 1,
            "text": "The real question is why do we allow settlements in criminal trials? I get it for civil trials but for criminal cases it essentially means money > justice.",
            "title_similarity": "0.81293"
        },
        {
            "id": "hxcpj0b",
            "score": 1,
            "text": "While we are on the topic :   If you have AAA, it is a $ 1000 bond card ( I think it used to be $5000)\n\nStory Time :  I am in PA and we do not have Bond / surety for regular traffic stops, so bond cards are not a thing here.  I had heard of Bond Cards before ; basically a card you can hand to the police as if you had paid the bond)    One day with a new AAA card - I flipped it over to sign it and noticed that it was a bond card... Hmpf ---interesting, I'll never use that feature.\n\nLiterally 2 weeks later I am in Indiana and heading to Davenport Rt 80 ( I believe) -- this was \\~ 2002?  -- anyway I had a visitor to my driver side window, whom opened the conversation with \" Do you have any idea how long it took me to catch up to you?\"  -- this was not a good sign.\n\nSo she asks - \"Do you have a bond card ? \" ( !? ) \"Does AAA work?\",   \"That'll do.\" She replied.    If I had not read the back of the card - I probably would have been hauled into the local station and had to pay a cash bond to go on my way.\n\nWrites the ticket - and literally takes the AAA card.   When I paid the fine, they mailed my card back to me.\n\nI just looked and the card no longer says this - but when I googled it, the AAA site says it is good for $1000.",
            "title_similarity": "0.6304997"
        },
        {
            "id": "hxctkuh",
            "score": 1,
            "text": "Quick question, what does a bounty hunter do?",
            "title_similarity": "0.43632284"
        },
        {
            "id": "hxcxobj",
            "score": 1,
            "text": "Without getting into any personal thoughts on its use, implementation, or effectiveness, the purpose is to ensure the person who is released on bail / bond is going to show up to court. \n\nWhen a person is arrested for a crime, they haven't been found guilty of any crimes. They need to go through the legal process in court for that. Courts have a lot of things they do, so court dates for cases are set in advance, sometimes several months or more. If a person is eligible for bail, it is set to an amount determined by several factors including how likely that lesson is to not show up to that court date and how severe the crime they are accused of committing is. If they are eligible for bail they can make that payment, which is held until the court date, at which time that money is returned. \n\nAny conjecture beyond this point regarding how effective this method is or whether it applies equally to all people is outside the scope of this definition.",
            "title_similarity": "0.7196477"
        },
        {
            "id": "hxcysch",
            "score": 1,
            "text": "Under the bill of rights, everyone has the right of due process.  One cannot be jailed based on suspicion.  In light of that, the court system must offer bail as an option in place of jail time while waiting for one's court date, to be returned upon the end of trial, regardless of convictions. \n\nThe most important factor behind the amount of bail is how likely a person is to return for their court date.  Additionally the court must use the severity of the crime as well as an individual's net worth or liquidity to determine the total possible bail.\n\nBail must be offered and reasonable except in the rarest of cases.\n\nThere are times, though, where it may be considered that no amount of bail will prevent an individual from running.  Additionally, rich people have an easier time procuring bail, as they are generally a much lower flight risk and will be an almost guarantee they will show for court.\n\nBail is a very hard subject.  It does negatively affect the poor and people from disproportionate neighborhoods, but it's better than denying everyone's right to due process or letting serial criminals or high flight risks get away with their crimes.",
            "title_similarity": "0.7858923"
        },
        {
            "id": "hxcyxjc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.058632586"
        },
        {
            "id": "hxd16x6",
            "score": 1,
            "text": "Lots of answers here already, but I feel I can give another one. This is mostly focused on the US system, and it works similarly in Canada but not the same.\n\nWhen someone is arrested and charged with a crime, they are held in something called \"pre-trial detention\". This is usually at a *jail* (short-term holding) versus a *prison* (long-term).\n\nMost court systems move fairly slowly. So let's take an \"average\" crime, say a robbery of a jewelry store.\n\nThe accused will be arrested and charged with the crime of \"theft over $5000\" or whatever have you. They are held in a jail for a short period until a quick court hearing called an \"arraignment\".\n\nAt the arraignment, the charges are read, and the prosecution and defense have a chance to make arguments in favour and against holding the accused until their trial.\n\nArguments for holding: they are a high flight risk (likely to run), the crime is especially heinous and they pose a threat to the community (multiple murders, etc.), other similar factors.\n\nArguments against holding: the trial may take a long time (over a year in some cases) to start, depriving the accused of liberty during that time, they have strong roots and aren't likely to run/not show up, etc.\n\nThe judge at the arraignment has the capability to decide this and order where the accused will go.\n\nNow, bail is a tool the courts can use that allows a half-way between the two extremes of \"keep them in jail until the trial\" and \"just let them walk out and hope they show up to their trial date\".\n\nWith bail, the court holds in escrow some amount of money or other collateral from the accused. This gives them some strong incentive to actually show up to the court date: if they don't, the court keeps the money; if they do, they get it back.\n\nHow bail is set depends on a number of factors, and how much is demanded, is set by the judge based on these factors. For example, a person worth millions of dollars with private jets facing a very heinous charge will probably be forced to turn over a very very large amount of money for bail (think, like, $1,000,000 or more). A relatively small crime with a relatively poor person may only require a small amount of money. It's entirely up to the judge's discretion (after hearing arguments from the attorneys) how much to demand, based on their judgement of how much is \"enough\" to ensure the defendant keeps their court date.\n\nSo back to our example, the judge might decide that the perp is fairly poor, and this crime is relatively severe, so they might set bail to \"$20,000 cash or bond\". Thus the defendant must give the court $20,000 in exchange for their freedom until the trial, or they will be held in jail instead. If they pay, they get the money back when the trial eventually starts and they appear; if they don't, they lose the money and then come the warrants and potentially manhunts.\n\nAnother aspect is the idea of \"bail bonds\". Since courts demand a fixed, often very large amount of money, poorer people often don't have liquidity (free cash sitting around) to just hand it over and wait. So they get a \"bail bondsman\" to pay for them, in exchange for other conditions on their freedom. \"Bounty hunters\" are used if the accused skips on the bail (and thus deprives the bondsman of their money) to bring them in, and then they keep some or most of the money they get back and pay the bounty hunter out of that money. How exactly they make money I'm not an expert on, but there must be some sort of balance to ensure they can stay in business. Thus the defendant might choose the \"bond\" option over the \"cash\" option and get out with more restrictions (from the bondsman) in exchange to not having to give up $20,000 of their own money until the trial starts.\n\nAll-in-all, the idea, in theory, is that bail provides an incentive for the defendant to actually show up if they are released pending trial, rather than having to work entirely on the honour system, or keeping someone locked up for months or even years waiting for a trial that might acquit them.\n\nEdit: One other aspect, sometimes you'll hear about \"time served\" in sentencing. If someone is held for, say, 1 year pending trial, and they're convicted, usually that 1 year is treated as part of the sentence. Not so if they were out free during that time though. Happens occasionally but how often I'm not sure.",
            "title_similarity": "0.6707897"
        },
        {
            "id": "hxd27qm",
            "score": 1,
            "text": "Maybe someone can answer this, if as we've seen in recent instances, where go fund me has collected bail for people, I have 2 questions. \n\n1. If the point of bail is collateral as an incentive to turn up for your court date, then how is using charitably collected money from other people an incentive? If it's not that person's money then they have nothing to lose by just skipping court.\n\n2. Will the funds be returned to the people if the individual shows up to court and the bail money returned?",
            "title_similarity": "0.80548465"
        },
        {
            "id": "hxd2r1h",
            "score": 1,
            "text": "When you’re first arrested for a crime the state has to make a decision as to whether to detain you or set you free pending trial. Most states have a presumption of pretrial release to keep the jail population as low as possible and to avoid violating a defendants rights. During the bail hearing or detention hearing the prosecutor and defense attorney will argue about whether the defendant is a danger to the community or a flight risk. This can be based on the defendants criminal history and record of failure to appear to various court proceedings. I should add that the default is that a defendant gets released and the state has to file a motion for pretrial detention. That’s at least the way it works in New Jersey. Interestingly, New Jersey is a non-monetary bail state. This illuminates wealth as a factor affecting someone’s release, but it also creates less flexibility because once you are detained there’s no amount of money you can put up to secure your release. The purpose of the pretrial detention is to keep you from running away or from causing more harm to the victim of the crime, which is particularly important in a domestic violence situation for example. Like others have said, when you post bail you are basically offering to forfeit a certain sum of money if you fail to appear or reoffend while you are waiting for your trial. This offers a good incentive to defendants against committing further criminal acts. It’s not a perfect system, and places like New Jersey are experimenting with non-monetary systems, but some sort of pretrial release conditions are always going to be necessary to deter criminals from reoffending. The alternative would be that everybody gets detained until trial which I’m sure nobody wants.\n\nEdit - I dictated this so please excuse any spelling errors lol",
            "title_similarity": "0.75746536"
        },
        {
            "id": "hxd4q15",
            "score": 3,
            "text": "Bail is not for prison, it's for jail. Prison is when you serve a lengthy sentence. Jail is for short term arrests.",
            "title_similarity": "0.69006807"
        },
        {
            "id": "hxd7dun",
            "score": 1,
            "text": "It's a corrupt component of the justice system that was originally well intentioned but is now used against the underprivileged to ensure that their defenses are difficult to mount, likely confirming that they either plead out or fail to produce a competent lawyer due to lack of means.\n\nWhat's interesting is that there are bail hearings on top of that to even prove you should be able to post bail.",
            "title_similarity": "0.76931703"
        },
        {
            "id": "hxd7ff3",
            "score": 1,
            "text": "Just wanted to add that I had no idea how it worked until my brother got arrested and I had to bail him out. It was an interesting experience to say the least. I had to put my ass on the line to get him out.",
            "title_similarity": "0.68915474"
        },
        {
            "id": "hxd9frf",
            "score": 1,
            "text": "It's to keep all those yucky poor people in jail. And, obviously, you can't have rich people in jail, am I right",
            "title_similarity": "0.6173227"
        },
        {
            "id": "hxd9hxu",
            "score": 1,
            "text": "The bail system is quite flawed. As you say, bail is often unaffordable for many people and therefore they languish in a horrible county jails, as they lose their jobs, credit, relationships and are treated like criminals often on the word of one cop.\n\nThere's also a whole element to this that is pretty horrific in that because many people can't afford bail, so their attorneys (often overworked public defenders) advise them to plead guilty, even if they are factually innocent of the crime they are charged with, as the options are essentially to plead guilty and get out today (eg plea bargain for time served) or languish in jail a few more months until a trial can be scheduled to fight their case. This kind of thing happens every day and it saddles people with criminal records, making them unemployable creating a high rate of recidivism because they can't make ends meet. \n\nThe American justice system is deeply, deeply flawed.",
            "title_similarity": "0.65008456"
        },
        {
            "id": "hxd9kts",
            "score": 1,
            "text": "It's for petite who haven't been convicted yet. It's supposed to be incentive to show up at your court date. You pay $xxxx now and when you finish the court process, we give that money back to you.",
            "title_similarity": "0.6810095"
        },
        {
            "id": "hxd9tj0",
            "score": 1,
            "text": "Prison bail isn’t a thing. I’ve been a bail agent for 15 years now (damn time flys). What you are describing would indeed be very fucked. While money can help you avoid jail time in the way of good attorneys but once you’ve been sentenced thats it, you can’t be bailed out. \n\nBail is so that you can be out of jail during the trial is all. It helps you fight your case being able to go do stuff like hiring a lawyer and getting proof of an alibi which is hard to do in a cell. The bail is an insurance policy that states “yes, I will show up to court every time they ask me and if I don’t I’ll be thrown back in jail”. \n\nAnother thing to remember. Let’s say you committed a crime that has a sentence of 2 years, and your trial takes 6 months from start to finish. If you bail out you still have 2 years left to serve. If you don’t bail out, you’ve already got 6 months worth of time served. \n\nThe bail system is mostly designed so that people who are innocent of crimes they are accused of can continue their life while they fight their charges without losing their job or home.",
            "title_similarity": "0.7585428"
        },
        {
            "id": "hxdbe18",
            "score": 2,
            "text": "Bail is not a 'get out of jail free' card. Its money you pay, so you can stay outside prison while you await trial. Its a way of making sure people appear in court, because as long as they do, they'll get their money back.",
            "title_similarity": "0.75320584"
        },
        {
            "id": "hxdbnjc",
            "score": 1,
            "text": "Jail /= prison.   Jail is imprisonment before the trial.  \n  \nA bond is a financial instrument that will allow the person to stay at home instead of in jail, at the cost of losing the bond money if they don't show up to trial. \n  \nGetting \"bailed out\" does not mean you are innocent or replace prison time.  It means you can spend your pretrial time at home.",
            "title_similarity": "0.6836047"
        },
        {
            "id": "hxdca5f",
            "score": 1,
            "text": "Good question, I was also under a similar assumption. One of the things I hate about it is how long they hold people before their trial. Does the time served waiting for trial at least count as part of their sentence? Sometimes people are stuck in there for years and the idea of being in jail before being told you should officially go to jail is fucking bonkers to me. \n\nAt least bail is kind of an insurance depending on the reliability of the person. However, if you don't have bail do you have to go to prison to wait for a trial? That really is disguising for anyone living paycheck to paycheck.",
            "title_similarity": "0.7226131"
        },
        {
            "id": "hxdcpgt",
            "score": 1,
            "text": "Bail gives a person and/or their loved ones enough fiscal incentive to show up at the trial, so that the courts can be functional and prisons don't get overcrowded with people awaiting trial.",
            "title_similarity": "0.70295966"
        },
        {
            "id": "hxddzh6",
            "score": 1,
            "text": "The bail bond will also be used to pay all lawyer fees (including public defender), court costs, and fines if you plead or are found guilty. You are entitled to any remainder that is left, but you owe if the bail amount is less than your fees/fines.",
            "title_similarity": "0.71027386"
        },
        {
            "id": "hxdf6b7",
            "score": 1,
            "text": "Well, in the UK it’s got nothing to do with money. Bail is granted free of charge, entirely contingent on whether the risk of letting the suspect free is greater than their right to freedom. Generally it takes quite a strong case to prevent bail - the assumption is to let them go free, because of how much jail will ruin someone’s life and the presumption of innocence. Found it strange that in the US, money has to change hands - that the state can hold you to ransom effectively.",
            "title_similarity": "0.80783075"
        },
        {
            "id": "hxdg4n2",
            "score": 1,
            "text": "It’s to give extra incentive for someone to return to court by making them put up collateral that they can only get back when they show up to the assigned court date. If they don’t show up they lose the money and get a warrant for their arrest.\n\nIf the person gets a bail bond then they won’t get any money back but are still incentivized to show up to court as if the bond is big enough the company issuing the bond will hire a bounty hunter to track the person skipping court and bring them to jail.",
            "title_similarity": "0.74200064"
        },
        {
            "id": "hxdgmkd",
            "score": 1,
            "text": "Reading through some responses I wonder why it is considered bad to just keep the People jailed for the investigation? If they are innocent they can get some reimbursement for the missed income. If they are guilty they already are in the right place.",
            "title_similarity": "0.78998566"
        },
        {
            "id": "hxdi5h2",
            "score": 1,
            "text": "I cannot comment without knowing more details?  Are you in the US?   Prison in the US is for people who have been convicted and there is no bail other than an appeal bond which is denied 99% of the time. Mail is for people awaiting trial. Most jurisdictions in the US have alternate forms of bond other than cash except for serious allegations of violent crimes, repeat offenders, or danger to the community issues.",
            "title_similarity": "0.7149606"
        },
        {
            "id": "hxdjlt5",
            "score": 2,
            "text": "Here is the deal, when you are arrested for a crime, you are simply being accused of the crime. Your arrest is there to make sure of two things, first off that the accused will be there if/when the accused is brought to trial, second is for protection of EVERYONE involved.  If it is an accusal of a violent crime then it is to prevent them from further harming anyone, sometimes the is the danger of vigilante actions and the person is arrested to get them off the street.  Once you are arrested, you are then given chance to be given bail.  The prosecutor will often present evidence the person might be a flight risk or danger to the community, and request no bail or suggest a specific amount.  The defendant will claim otherwise, and the judge will make a decision.  When you show up for your trial and it is completed, you get this bail money back regardless of you have been convicted or not.",
            "title_similarity": "0.6775751"
        },
        {
            "id": "hxdkml4",
            "score": 3,
            "text": "When I was arrested in Ireland, I was given a small bail of a few hundred euro, but the way it worked is that it was only enforced if I missed or skipped my court date and the gardaí had to come looking for me; I was otherwise free to go.\n\nEdit: clarification",
            "title_similarity": "0.7638657"
        },
        {
            "id": "hxdkwbx",
            "score": 2,
            "text": "Hello,\n\nYou are innocent until proven guilty - “proven” being key word. According to the Justice system in the United States, it would then be reasonable to offer bail. Since you are simply waiting for your trial date and putting up collateral to guarantee your presence.",
            "title_similarity": "0.7899265"
        },
        {
            "id": "hxdopl1",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.058632586"
        },
        {
            "id": "hxdq840",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.058632586"
        },
        {
            "id": "hxdt4hi",
            "score": 1,
            "text": "The problem with the Bail Bondsmen is that the court factors in the use of a bondsman as part of the \"what can you afford\" equation. So, if you are poor they know that, if they set the bond at 5k, you are probably not going to have 5k laying around, but you, your friends or your family can probably scrape together 500. So they set the bail at 5k. For a poor person on a minor charge, 5k might as well be 100k if they had to come up with it themselves. So why not set the bail at 500 and get rid of bail bondsmen for misdemeanors?",
            "title_similarity": "0.6981895"
        },
        {
            "id": "hxdutw8",
            "score": 1,
            "text": "Man, A LOT of misinformation here. Cash Bail scales with the severity and nature of the crime FAR more than someone’s resources to pay it. That said, eliminating that (under the guise of or even with the sincere desire to make things more equitable) has many other externalities. \n\nI’ve commented a variation of this before:\n\nThe nature and seriousness of the charged crime is the primary concern. A judge would then consider factors like a defendant’s past criminal record (including bail jumping), whether the defendant is employed, and whether a defendant has close ties to relatives and the community, etc.\n\nIn general, Violent, dangerous, and large-scale felonies carry higher bail amounts than misdemeanors or non-violent crimes. Crimes committed with weapons, or under the influence of narcotics also play a role.\n\nI think Cash bail is pretty awful. I wish more people were willing to have a discussion about potential alternatives though, because right now all the ones I’m familiar worth end up being (IMO) worse.\n\nfor example, bail *“algorithms use “science” and statistical probability to deprive individuals of due process. These algorithms have no transparency, no accountability, and no recourse for challenging one’s risk score once it is calculated. But don’t worry: the risk algorithms are tooootally not racist—but they do rely on racist inputs like arrest history, employment history, residential stability, and education levels. They also include fuzzy metrics like “risk of re-arrest” and include unproven accusations. They place people into risk categories with no clear definitions and no limits as to what factors they can consider, allowing secretive risk-profiling companies to peddle algorithmic profiling that LA county estimates would double their pre-trial prison population.”* - source: theleaguesf.org\n\nThere quite obviously needs to be an overhaul within our criminal justice system in this regard, and I hope more smart people starting thinking and developing more equitable and humane solutions.",
            "title_similarity": "0.7876419"
        },
        {
            "id": "hxdvm35",
            "score": 1,
            "text": "For example, my significant other was arrested and her bond was set at $6000. I paid a bail bondsman 10% of that to get my SO out of jail where everything could be sorted out. If she hadn't dealt with the issue, I would have been on the hook for the rest of the $6000 plus whatever penalties I agreed to when I paid for my SO's release. The 10% was a fee so I didn't get that back.\n\nNote: The $6000 was over a financial dispute. Others there at the same time for various assault and battery charges had bond set at around $1000. \n\nIn neighboring counties, you can just sign a bit of paper at the jail that says you'll come back. Signature bond it's called in some places. Basically, it covers honest people who probably don't get arrested in the first place. Others drive their SUVs through Christmas parades.",
            "title_similarity": "0.6606803"
        },
        {
            "id": "hxe7kmi",
            "score": 2,
            "text": "You get your bail money back when you show up for court. But if you flee, then you forfeit the money. \n\nBasically, the justice system understands, you have a life going on, you can't miss it just because you did a bad thing. So... they won't hold you in prison until your punishment is decided. However, they need assurances that you wont just skip town as soon as they let you out. So how do they do that? With either bail or bond. \n\nBail is when the defendant pays their own money, and then they're let out of jail. The money is then returned to the defendant when they show up to court. This is their incentive to show up and not just skip town. If you could just peace out, why bother showing up to court? Make it to the next state over and start a new life, easy peasy. However if you have to sacrifice your life savings to do that, well maybe a year in jail isn't too bad.\n\nBond is a little different. Bond is when the defendant doesn't have the cash. A bondsman will agree to pay bail for you, for a small fee. However, they will demand something as collateral, your house, your car, whatever. Typically in the range of 10x the value of the bail. But since most people don't have 10x the bail value, the bondsman will basically take everything you own if you skip town. Bondsmen are typically very interested in making sure you show up to court, because they don't want to lose the bail money. Best case for them is that you violate the contract, but they still catch you trying to leave town and haul your ass to court, because then they get their money back, and get your shit. But most often, they just keep a close eye on you and bring you to court when it's time.",
            "title_similarity": "0.7757585"
        },
        {
            "id": "hxedxzs",
            "score": 1,
            "text": "Bail reform could be simple, why do laws have to be so messy? Here’s my idea for bail reform, please tear it apart so I can sharpen my ideas. \n\nBail for non violent crimes is abolished except for crimes involving monetary gain. \n\nIn events of monetary gain, bail is set to the amount claimed to have been stolen\n\nViolent crimes have bail set prohibitively high but anyone is able to put property up as bail without having to liquidate it, based on last assessed value",
            "title_similarity": "0.83273476"
        },
        {
            "id": "hxeeqqh",
            "score": 1,
            "text": "The Australian system is slightly different and in my mind, somewhat fairer to the poorer defendants.  Generally speaking, in most cases the presumption for bail is 'for' meaning that Prosecutions have to come up with very good reasons why the defendant must be remanded in custody.  Only for very serious offences such as Murder, is the presumption 'against'.\n\nMost bail in Australia is on the defendant's own recognizance.  They don't have to pay any money up front, but they *may* have to if they don't show up for Court.  Even this is rare.  Most defendants get granted bail with certain conditions - such as to report daily to a police station, undergo random drug testing or have restrictions on travel etc.  If they don't show up for Court, a warrant is issued and bail might be  a little bit harder to get in the future.\n\nSometimes for high-profile defendants or where the defendant poses a flight risk, then someone can be nominated to be 'surety' - normally a family member who agrees to forfeit a certain sum if the defendant fails to show.  Cash bails are generally pretty rare.\n\nThe bail system only disadvantages defendants who are homeless or have severe mental health issues as normally there needs to be a steady abode for them to stay at and be checked upon if need be, and those with mental health issues will not be in a position to remember future dates and times.\n\nNever heard of bail bondsman existing here and frankly it sounds as shonky as shit.",
            "title_similarity": "0.7664029"
        },
        {
            "id": "hxeggcn",
            "score": 1,
            "text": "The purpose of bail is to show that if you are poor you will be punished in a more harsh way than if you are rich. It’s made contingent to demonstrate corruption.",
            "title_similarity": "0.66452235"
        },
        {
            "id": "hxeglp2",
            "score": 1,
            "text": "I posted $1000 bail, cash, for my son a while back. I did not use a bail bondsman.\n\nThe court kept $100 anyway. I wasn't going to argue about it but I didn't realize the courts get to keep part of that money no matter what happens.",
            "title_similarity": "0.61387753"
        },
        {
            "id": "hxei2p1",
            "score": 1,
            "text": "Bail is to give incentive to show up for trial. It’s like collateral. You sit in jail until trial if you can’t post bail.",
            "title_similarity": "0.74634695"
        },
        {
            "id": "hxeirv4",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07345093"
        },
        {
            "id": "hxeit37",
            "score": 2,
            "text": "Assurance to return. If youve got a big chunk of change or a house, like they do in Federal court, youre gonna come back. Unless youre really rich.",
            "title_similarity": "0.63174427"
        },
        {
            "id": "hxej94p",
            "score": 1,
            "text": "When I was 5, I’d occasionally venture to the juice bar for a couple Caprisuns. And when I started a tab, they’d hold onto my credit card or ID to make sure I’d come back and close out the tab. The card or ID is collateral so I don’t just walk out.\n\nBail functions the same as collateral. Unconvicted accused need to have a method to get out of jail while awaiting trial, and the courts need a way to get the accused to show up. So they take some dollars from them as collateral. You get it back once you show up to your future court date. Now functionally, for a lot of people, there’s a cost to posting bail, but that’s a whole other issue.",
            "title_similarity": "0.7137158"
        },
        {
            "id": "hxek6lk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.058632586"
        },
        {
            "id": "hxem5q0",
            "score": 2,
            "text": "In Canada, bail is a little different. Cash bail is not as common here. Basic test for bail is whether you’re flight risk or not likely to attend court, whether you’re likely to commit further offences, and whether release would bring the administration of justice into disrepute. Basically, criminal record will determine a lot of this. If you have a record of similar offences or failing to appear in court or breaching release conditions or probation conditions in the past, you may not get bail. If the judge determines that the person can be managed in the community such as where a person doesn’t have a record or the offence is nonviolent, a person may be released on conditions like live at a certain address, abide by a curfew, report to the police on certain days of the week, not drink alcohol, things like that. If you breach any of those, you go back to jail  and are unlikely to get released a second time and will likely remain in pretrial custody. Sometimes you may have live with a certain person like a relative who agrees to supervise you (this person is called a surety). You or your supervisor may pledge to pay a certain amount of money if you breach your conditions and if you do, the prosecutor may take you to court to get a judgment that you owe this money. For many offences especially if a person has no record or it is an offence with a lower sentence or a very minor offence, a police officer may release you on a promise to appear in court or an undertaking, and there may be certain conditions you have to agree to as part of this. Impaired driving is one offence where there is very rarely a bail hearing and generally a person will be released by the police.",
            "title_similarity": "0.68001807"
        },
        {
            "id": "hxest32",
            "score": 2,
            "text": "Bail exists to ensure that the person will show up for court. The whole point of holding a person before trial is to eliminate flight risk. Bail also does this. A person who gets out on bail hasn't been convicted of any crime yet. They're innocent as far as the law is concerned.",
            "title_similarity": "0.73066413"
        },
        {
            "id": "hxew14u",
            "score": 2,
            "text": "In France there's no bail. If you committed a crime that could send you to jail for more than 3 years, you're locked up until your trial, if it's less than 3 years you're free to go",
            "title_similarity": "0.54388034"
        },
        {
            "id": "hxey7dj",
            "score": 2,
            "text": "In most countries the bail system with a lot of money hardly ever gets used. Most cases it’s either a formality for misdemeanors where they just need to sign the papers and promise to come back, or just deny bail for felons. A lot of countries have very high conviction rates(close to 100% in some Asian countries) meaning the situation of a person sitting in prison/holding places but in the end is innocent is basically nonexistent. The only issue for most of them is that sometimes they serve more time than they should because the trial happens after they serve the entire would be term.",
            "title_similarity": "0.73870754"
        },
        {
            "id": "hxf3c9w",
            "score": 1,
            "text": "We don't like making rich people uncomfortable for too long while their lawyers make the problem go away",
            "title_similarity": "0.60668314"
        },
        {
            "id": "hxf3og4",
            "score": 2,
            "text": "This is going to be more of an argument in all honesty, as I am personally against the bail system where it stands in the US. If any of this is against the rules here, I apologize, but I feel strongly about this topic.\n\nThe most common argument I know is that you want to provide an incentive for the person to return for their day in court. Personally I'm against it, because while it may do that for some, and it may provide revenue for the state, its outcome is more of a straight poor tax and a way to keep the most vulnerable people in society in jail and in debt.\n\nI believe that the decision whether a person remains in jail and whether they are released should not be dependent upon what they have in their wallet. It provides an extremely predatory environment to take advantage of the least fortunate, and in the end a judge already has the authority and should be able to determine whether or not they believe that a defendant will return for court. Either you trust they will appear or you don't, so either they can be released or they should be held. \n\nI believe there is very little evidence that a financial incentive to return for court is necessary or effective at ensuring people return for their court appearances. Plenty of people will not return regardless of the amount of money they owe, and in the end not only do the negatives outweigh the positives, it would seem unconstitutional to me for someone to be in prison and someone else to be free for the same crime solely because of the amounts of money in their wallets.",
            "title_similarity": "0.79894865"
        },
        {
            "id": "hxf48mw",
            "score": 1,
            "text": "The idea is that it makes sure someone doesn't run away. If someone gets accused of doing something, it takes a while for the court dates and legal procedures to get set up. During this time, you don't want to throw people in jail unnecessarily, but you also don't want to let them go and say \"come back to find out if you get in trouble or not.\" The solution is to say \"give us a bunch of money, we will hold on to it, then you will get it back after you show up.\"  Kind of like how a teacher might require you to give her something in exchange when you borrow a pencil, then give it back when you return the pencil. \n\nThis system made sense when it was designed, because for most of history, people were almost impossible to track down. The only documents that existed might be birth certificates, if you were lucky, and those don't exactly show residence. If you released someone, there's a good chance they just wouldn't come back, and there would be very little you could do about it. They also recognized that it was really inefficient (and ethically questionable) to throw everyone in jail without a trial first. \n\nSadly, it has now morphed into a tool that makes it difficult to impossible for a poor person to defend themselves. Imagine you live paycheck to paycheck, will be fired if you miss work, and can't afford bail. An officer arrests you for something minor you didn't do. The prosecutor will come to you with a \"plea agreement,\" where if you agree to plead guilty (in other words, don't try to defend yourself and skip the trial), you get to go home (and keep your job). If you try to fight them, then they will keep you in jail until the trial (it can be days to even weeks), unless you can afford bail. \n\nBasically, your choices are trying to defend yourself, which will get you thrown in jail and unemployed (possibly homeless), or just plead guilty. Even if you do try to defend yourself, your public defender will tell you to take the deal, because they are so overworked that a trial is a guaranteed loss. It's not hard to see why this system isn't very conducive to justice, the presumption of innocence, the right to counsel, or the right to a free trial (things we are all supposed to be entitled to). Effectively, bail has been changed into a price tag for a fair trial.",
            "title_similarity": "0.73693013"
        },
        {
            "id": "hxf7h5r",
            "score": 1,
            "text": "Bail is for people who have not been convicted yet.  They are not guilty of anything so really should not be in jail.  The whole standing up money for bail is a US thing.  In other countries you don't pay bail money they just trust you to show up.",
            "title_similarity": "0.77005917"
        },
        {
            "id": "hxf7spx",
            "score": 2,
            "text": "I get this is largely an American thread, but for most western societies, 'bail' just means abiding by certain conditions, which if breached, can result in being held in custody untill trial. Its very weird (  from a New Zealand perspective anyway ) to see the situation where physical money has to exchange hands , even weirder if its actual ....what do you call it.....cash....? But then , there is nowhere to hide in NZ, we all know each other.",
            "title_similarity": "0.789729"
        },
        {
            "id": "hxf8128",
            "score": 2,
            "text": "Bail is just collateral. You're saying \"i promise ill show up on my court date, here is X amount of money you can hold to ensure that i do\"\n\n&#x200B;\n\nIf you skip your court date, the court keeps your bail and a warrant is issued for your arrest.",
            "title_similarity": "0.7384625"
        },
        {
            "id": "hxf8ois",
            "score": 2,
            "text": "Because America is built for the rich \n\nIf you're innocent but can't afford bail then you must be guilty so they'll keep you until your trial\n\nInnocent until proven guilty unless you're poor\nWatch the Khalif Bowder story\nOne of the saddest but realest docs",
            "title_similarity": "0.7760582"
        },
        {
            "id": "hxf8pmh",
            "score": 3,
            "text": "(Dont know much so forgive me if this isnt perfect but) Bail doesnt actually get them out of jail or prison. If someone has been arrested and is awaiting trial and conviction, they are usually kept in a cell or something like that to make sure they go to their trial and dont try to escape. Buuuutt a \"bail\" is set which is an amount of money that can be offered as collateral to let them out of that temporary cell. When they eventually do get tried, if they dont show up that money is kept, but if they do im pretty sure it gets returned to whoever bailed them out? The amount is usually based on severity of the charges, sometimes other things like income or fame.",
            "title_similarity": "0.7843667"
        },
        {
            "id": "hxfazrc",
            "score": 2,
            "text": "I have a law degree. There are two reasons:\n\n1. Why do we have bail? I'm not just being silly and repeating your question. We have bail because the court system is really busy, and if you charged with a crime, you have to wait until the court is free to hear your case. \n\n2. But, it's not really fair or practical to keep everyone on that waiting list in jail, when they are still considered innocent. At the same time, there is an obvious motive to escape if you are charged with a crime. So we rely on the self interest involved in not losing your bail money, and not having Dog the Bounty Hunter take you down on TV to keep you around town for the process.\n\nOf course bail is highly discretionary, plenty of people don't need that penalty to show up to court, and plenty of people are in the \"no way in hell are you getting out before trial\" category.",
            "title_similarity": "0.8316603"
        },
        {
            "id": "hxfvk3o",
            "score": 1,
            "text": "our justice system is a business,the people are the customers. crime isnt banned,its just limited to what you can afford..(i.e...if youre gonna speed,pick the speed you can afford).",
            "title_similarity": "0.6577924"
        },
        {
            "id": "hxfwdir",
            "score": 1,
            "text": "From what i understand, \"Any person is innocent until proven guilty\". And it is only a court that can deem a person guilty post trial. It is not humane to subject a person to imprisonment based on a speculation(which is what it is unless the court declares it otherwise).\nBased on this notion, An \"accused\" is given a chance to get out of remand by paying a certain amount of money as collateral. \nThough they get back a certain amount of freedom, they still have restrictions like not being able to leave the town or having to visit the police station for constant check-ins etc.(depending on the country).",
            "title_similarity": "0.79856163"
        },
        {
            "id": "hxg035i",
            "score": 1,
            "text": "You are usually only required to put 10% down for a bail bond but you need collateral too. You need another person to bail you out. If the person skips court, whatever was put on as collateral is repossessed. This encourages people to only bail out people they can reasonably trust to show up for court.",
            "title_similarity": "0.7506809"
        },
        {
            "id": "hxg0hzj",
            "score": 1,
            "text": "Bail has nothing to do if people shoud be in jail or not. It CAN be set if the defendant doesn't show risk of fleeing, as a means to make sure he'll show up to trial. People around him, who may have lent some money for the bail to be paid, will be interested on the defendant attejding every step of the trial.\n\nIt still exists because it works, basically. Temporary holding of non threatening individuals is bad for the citizens and bad for the State.",
            "title_similarity": "0.7647065"
        },
        {
            "id": "hxg16hn",
            "score": 1,
            "text": "Bail was created to put money in the pockets of the city or county. It has nothing to do with morality or humanity.",
            "title_similarity": "0.5079813"
        },
        {
            "id": "hxg1jvy",
            "score": 1,
            "text": "Tbqh it is a revenue source for law enforcement. Those who can afford bail typically aren't hurt by it, but those who can't afford bail rot in prison when they may not even be guilty. Minor crimes should have no bail set, and if the crime is serious or the accused likely to run or keep offending then they should be held in custody except in specific circumstances.",
            "title_similarity": "0.77973896"
        },
        {
            "id": "hxg3kpj",
            "score": 1,
            "text": ">be charged with a crime\n>You want freedom? \n>Pay for it \n>you pay 10% of it \n>don’t show up to court? Violate terms/conditions of release?\n>now pay 100% \n>get put back into jail.",
            "title_similarity": "0.65376747"
        },
        {
            "id": "hxg3smy",
            "score": 2,
            "text": "Bail isn't getting you out of prison if you're convicted, its fronting money to say you can be trusted to show up for your trial. You're legally considered innocent until convicted. Its collateral to not have to spend the time between your arrest and judgment (which can be a considerable amount of time, years even) out of prison, saying \"here is this financially onerous burden I would forfeit if I don't show up\". \n\nThe misconception that posting bail is just being off the hook largely comes from media, where getting the character out of lockup lets the plot continue. There's the unstated fact the character will have to return to stand trial, but that's largely ignored.",
            "title_similarity": "0.8367025"
        },
        {
            "id": "hxg5xt9",
            "score": 1,
            "text": "It's also an easy way to jail minorities (i.e. black people) without explicitly saying that's what you're trying to do. Because black american's tend to be poorer, you can make getting out of bail contingent on money as a means to exert, indirectly, more authority on them.",
            "title_similarity": "0.7620662"
        },
        {
            "id": "hxg5yww",
            "score": 1,
            "text": "It was meant and designed to give the inmates time to get their affairs in order in case they get a large prison sentence.",
            "title_similarity": "0.69170105"
        },
        {
            "id": "hxg7qtf",
            "score": 1,
            "text": "The worst part of bail, imo, is that the victim of said crime doesn’t even see any of that bail money.  It’s just a way for the government to monetize the criminal “justice” system.  Say you are raped and the rapist goes to jail but posts bail.  The government just took $10k worth of money that you could’ve used for a lawyer and instead unleashed a literal danger to you and says “well you have a protection order in place, right?”  Nevermind you are more statistically likely to be assaulted when you have a protection order and there’s commonly no reprisal for violating protection orders unless it’s caught on camera and most of us don’t wear body cams.\n\nAnyways, going through this bs right now",
            "title_similarity": "0.7325103"
        },
        {
            "id": "hxg99t5",
            "score": 1,
            "text": "Simply put, Bail exists because you are innocent until proven guilty.  Frame this from the perspective of an innocent person being charged with a crime.",
            "title_similarity": "0.666911"
        },
        {
            "id": "hxg9n2v",
            "score": 1,
            "text": "Ok so I'm naive here but according to the comments the answer is to keep the person accountable to have to show up to court.  My question is, don't a lot of rich people end up just paying their bail and not giving a fuck?  Like, am I wrong to walk away thinking that the bail system as implemented in our current system disproportionately affects working and middle-class people?  Shouldn't bail be made to be more proportionate to the person's wealth?  Or like I said in the beginning, am I just naive and the system already currently works something like that?",
            "title_similarity": "0.83698905"
        },
        {
            "id": "hxgb7gl",
            "score": 1,
            "text": "Most people put up their homes or cars as collateral and that covers the bail. The state gets no money, but if you decide to skip town, they can take what you out up as collateral. So it's just a method to inventivise you to stay put and not jump country.\n\n\nAll these people saying it's to make the rich richer are no older than 15 and are talking completely out of their reddit brained ass.",
            "title_similarity": "0.6907785"
        },
        {
            "id": "hxgd2sz",
            "score": 1,
            "text": "Bail is a way to fuck with poor people and make it less serious for the rich. \n\nFor years. Cops could randomly arrest minorities. Mostly black Americans, for no damn reason or for stuff like j walking or littering and possible some weed possession. \n\nPoor people can’t afford bail and some time court take forever to get your trial. So in the mean time. You lose your job, lose everything if you can’t afford bail. \n\nBail is design to make the poor to stay poor.",
            "title_similarity": "0.6573888"
        },
        {
            "id": "hxgemo6",
            "score": 1,
            "text": "I'm surprised I didn't see it mentioned but: We hardly have room to hold prisoners who have been *convicted* of a crime. Where would we stash all the people awaiting trial?",
            "title_similarity": "0.67163193"
        },
        {
            "id": "hxgfbqr",
            "score": 1,
            "text": "Especially fun when \"JailATM\" charges 10 bucks for a transaction, treats it as debit only, then your bank charges you for a cash advance because the deputy taking your payment never once mentioned any of this and happily swiped your credit card instead of your debit card. \n\n&#x200B;\n\nLike it or not, this system is far more harsh on those without a lot of income.",
            "title_similarity": "0.6933335"
        },
        {
            "id": "hxims5a",
            "score": 1,
            "text": "Was a bounty hunter for like 2 months (taking people to jail wasn't morally for me to have an effect over)\n\nBounty Hunters work for insurance companies. These companies usually take 10% of the total bail amount as collateral for alleged criminals to get out of jail instead of being in limbo before the trial. \n\nSo let's say your bond was $20,000. Someone you know who cares about you could pay $2,000 for you to get out before court. Once you go to court, your friend/family member is no longer under obligation of the insurance company. \n\nIf you were to skip/evade court for your trial, the bonding agent is in major jerprody, because they put up the entire $20,000 for you to get out. (Which is usually why who ever put up the $2k for you, is under contract to give up some collateral to cover the $20,000) usually a house or a car. \n\nThis is not a system against poor people. It's a system to stopping guilty criminals from avoiding their trials. It creates the incentive to go through the process without causing someone you care about any hardship. \n\nIf you do skip bail, the insurance company hires bounty hunters to find you, secure you, and take you to jail, so they font have to take the collateral away from your family. If they have to pay the bounty hunters, they essentially make nothing on helping you out, meanwhile assuming all the risk of you not being trustworthy.",
            "title_similarity": "0.6456026"
        }
    ]
}