{
    "ELI5: Why does the US need to import oil if we have enough to be exporting, as well\nSee title.": [
        {
            "id": "hz8a9my",
            "score": 1,
            "text": "Hi Everyone,\n\nWe've had to lock this post, which I know everyone hates. I did just want to leave a note explaining why. \n\nWe lock posts on this sub when they've been thoroughly answered and 90+% of incoming comments, typically from our dear friends on r/all, are rule breaking. ELI5 is a very strict sub when it comes to what we allow at top level, and we do get that those coming from the front page might not check the rules before commenting, but they still break them.\n\nFor this one its mainly rule 5, no soapboxing, we don't allow any top level comments (replies to the post itself) that aren't objective explanations, that means no sharing your opinion on US energy policy or side comments about the state of things. I know that is frustrating, but this isn't the place for it.\n\nFeel free to let us know in mod mail if you have any questions, and please do enjoy the wonderful answers that are already here",
            "title_similarity": "0.38139027"
        },
        {
            "id": "hz74lx0",
            "score": 14,
            "text": "[deleted]",
            "title_similarity": "0.110794015"
        },
        {
            "id": "hz751c7",
            "score": -3,
            "text": "our oil is expensive to get out of the ground. especially the west texas shale oil.  its not really profitable unless the price of oil is above 85$ a barrel.  which it is now.",
            "title_similarity": "0.5923655"
        },
        {
            "id": "hz78fxg",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.11900225"
        },
        {
            "id": "hz6v722",
            "score": -13,
            "text": "The oil that we produce in abundance here isn't the oil that is used to produce gasoline, its too impure, but they can use it for other things overseas.  Just because we produce enough volume, doesn't mean it's the right kind.  Think of it like this. I have 100 gallons of water, I should be able to have enough to drink for months.... But it's dirty creek water, not technically drinking water",
            "title_similarity": "0.6293527"
        },
        {
            "id": "hz766fe",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.11900225"
        },
        {
            "id": "hz7gefx",
            "score": 2,
            "text": "Because quite simply, it’s easier to flush our country down the drain without energy independence. \n\nLooking at our presidents former dealings in Ukraine, you can see that nothing in geopolitics is independent",
            "title_similarity": "0.47822827"
        },
        {
            "id": "hz6winr",
            "score": -3,
            "text": "Watch the movie 'Syriana'...it's a master-class on the power dynamics of the oil industrial complex and it's hold over our lives.  Case in point...Clara Ford, the wife of Henry Ford, drove an electric car in the early 1900's and loved it.  It was the Detroit Electric Model 47 Brougham, and she did not want to give it up for a gas-powered car, which were loud, smelled horrible, and difficult to start & drive.  Her electric car started with no crank, and had no gears to shift through, and emitted no exhaust.  So....if Henry Ford had electric cars over 100 years ago, and they were good enough for his own wife to drive, why didn't we continue with that technology?  WWI happened...that's why.  And once WWI concluded, Middle East/European oil was the new power/profit dynamic in the world (can you say \"BP\"?), and American innovation died at its altar.",
            "title_similarity": "0.4366973"
        },
        {
            "id": "hz6yadm",
            "score": -9,
            "text": "The US is interested in reducing greenhouse gas emissions, to save the planet.  The COVID pandemic reduced demand, because people were sheltering at home, and the US Government saw a significant opportunity.  Cut US oil & gas production by forbidding fracking on federal land (the US Government owns about half of the land west of the Mississippi River).  Leases would be reduced and oil companies were told that the future of energy in the US is not them.  The Keystone XL pipeline, which mostly aided Canada, was cancelled.\n\nThis dropped oil/coal stock prices, and reduced their investment.  People were focused on COVID, so prices didn't immediately go up.  People forgot the government did this.\n\nAs the economy recovered, more oil was needed, so it was imported (including a bunch from Russia).  Rising prices caused fuel prices to rise, which the government saw as a good sign.  It makes electric cars more cost effective, and the infrastructure bill is full of electric car spending.  Higher prices do more to reduce fuel usage than anything.  What's better about this than an increase in the gas tax is that it looks like it's not the government's fault.\n\nWhat's worse is that almost everything is moved by truck in the US.  While spending remains focused on stuff, rather than entertainment or services, this causes inflation because higher transportation costs for goods raises the cost of everything.  The government hoped people would stop buying stuff, and go back to spending their money on non-tangible things.  If we spent more on crypto and NFTs there wouldn't be as much truck-caused inflation.\n\nOver the next couple of years the government hopes oil prices will stay above $100/b, maybe up to $150/b, which would make their green energy investment ideas much more cost effective.  Higher prices for fuel are good for the Green New Deal.",
            "title_similarity": "0.553215"
        },
        {
            "id": "hz7bgq0",
            "score": 14,
            "text": "At the moment we are forced to import oil due to restrictions on domestic extraction and exploration, and canceled projects for petroleum infrastructure. Most of these restrictions stem from ignorant \"green energy\" efforts. The current stance is that its better for the US to pay more for another country, where environmental and worker protection measures are largely non-existant, to extact, sell, and export it to us. Rather than extract it closer to home under tighter environmental protection measures. So instead of getting a glass of water from your sink for $0.05 you pay your friend across town $5 to drive one over to you from their house.\n\nAPI (American Petroleum Institute) estimates in the US alone there is enough gas, oil, and coal to support domestic consumption for well over 300 years and still maintain a net export position. And we can do it a whole lot cleaner than the places we are currently paying more to import from. Which is what we had been doing up until the last year or so. Apparently its better to pay more for dirtier production now while we develope alternatives, rather than pay less for cleaner oil production while we develope alternatives.\n\nIf this sounds ridiculous, it's because it is. Unfortunately this is the reality because it lets a few people shout \"HEY LOOK WE'RE HELPING\", because it shifts the real work to places without the cameras and regulations. All it costs is domestic jobs, environmental health (but not here right? It doesnt have global implications right?), and extra money from working people for all things tied to transportation and energy costs (so basically everything).",
            "title_similarity": "0.6717193"
        },
        {
            "id": "hz75nwx",
            "score": 7,
            "text": "All this environmental protection stuff will drop the second that foreign oil ceases to be profitable, and the USA will massively ramp up domestic production and supply foreign markets at a MASSIVE up charge. No need to tap our own reservoirs when we can drain others and make a profit at the same time.",
            "title_similarity": "0.666415"
        },
        {
            "id": "hz74m5o",
            "score": 6,
            "text": "Probably because when everyone else will be out of oil, US will still have strategic reserves.\n\nI don't know if will matter in 100 years from now.",
            "title_similarity": "0.5888934"
        },
        {
            "id": "hz86bkq",
            "score": 0,
            "text": "The prosperity of the American 20th Century was made possible by essentially borrowing money in today's dollars to buy foreign oil paid back with tomorrow's  less valuable dollars- while saving our domestic oil for later.  So it was like a Buy One Get One sale. \n\nOne of the prevailing principles of American foreign policy was to be the last man standing with oil. This is why exporting oil was commercially forbidden for the past 100 years in the USA. To save it for later.",
            "title_similarity": "0.7233006"
        },
        {
            "id": "hz86fpx",
            "score": 0,
            "text": "National security reasons. We will hit peak oil eventually, and when we do we want to be the people who still have oil. That means using everyone else’s first",
            "title_similarity": "0.6745353"
        },
        {
            "id": "hz778fr",
            "score": 3,
            "text": "From the perspective of oil not being an renewable energy source it makes more sense for us to use other countries resources and keep ours in reserve.",
            "title_similarity": "0.70833135"
        },
        {
            "id": "hz7yo1a",
            "score": 9,
            "text": "Everyone is giving answers to processing and cost.\n\nThe real answer is that it's just politics.\n\nwhen all you have to do is turn on any news channel and hear the current President talking about going green and renewable, and shutting down domestic oil.\n\nBut then they turn around and import it to consume it from someone else instead.\n\nExample: \"I didn't kill the elephant for the ivory, so I'm not bad, but I'll keep buying it from that guy who kills elephants for ivory. He is bad, I'm not\"",
            "title_similarity": "0.5539335"
        },
        {
            "id": "hz6v11d",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.11900225"
        },
        {
            "id": "hz76djq",
            "score": 1,
            "text": "I’ve read before it is estimated Alaska by itself has more remaining oil in the state itself than the rest of the world combined all of which is untapped.",
            "title_similarity": "0.52884436"
        },
        {
            "id": "hz7bnw7",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.11900225"
        },
        {
            "id": "hz77eay",
            "score": 11,
            "text": "Some of the crude drilled here in the US goes to the strategic oil reserve. This is crude set aside to be processed when imports run slow or other nations tighten the spicket on export",
            "title_similarity": "0.7490679"
        },
        {
            "id": "hz87yuw",
            "score": -5,
            "text": "Because a stated goal of the US government strategic plan is to use other peoples oil until they run out. The military runs on oil. You need to always have enough ~~gas in the tank~~ oil in the reserve to make a quick trip to the ~~gas station and fill up~~ middle East or south america to install a puppet government that will sell oil at the price you like",
            "title_similarity": "0.7574028"
        },
        {
            "id": "hz7phvz",
            "score": -1,
            "text": "So the US doesn't control our oil supply. The government controls some reserves but the vast majority is owned by private companies. \n\nThose companies decide where the oil they produce goes. They will sell to the highest bidder and they often have long term contracts to provide that they aren't willing to break.",
            "title_similarity": "0.6651432"
        },
        {
            "id": "hz78x3e",
            "score": 22,
            "text": "Oil needs to be moved. In Canada, we have more than enough oil in Alberta to supply the entire country, but the only pipeline gets as far east as Sarnia, Ontario (just north of Detroit). So that bottle neck means we need to import oil in eastern Canada. The people in Quebec and the Maritime provinces now import oil from nice people like the murdering Saudis, instead of using Canadian oil, because \"pipelines bad\" and \"it's a few bucks cheaper\".",
            "title_similarity": "0.6198544"
        },
        {
            "id": "hz7d6nd",
            "score": 4,
            "text": "The US oil production is done by private companies, they have no obligation to keep it in America, they can make much more money by selling it else where and in the US",
            "title_similarity": "0.636329"
        },
        {
            "id": "hz7kmhk",
            "score": 4,
            "text": "Unfortunately, with the way the world is today and all the environmental stuff, it is hard to get new project going and approved. The gulf of Mexico produces A LOT of oil, but the Permian Basin is actually the biggest oil reserve in the world, but just like the Keystone XL pipeline from Canada, new exploration is very limited by environmental groups that make the process a living hell...",
            "title_similarity": "0.61965513"
        },
        {
            "id": "hz78qyo",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.11900225"
        },
        {
            "id": "hz7om5u",
            "score": 8,
            "text": "First, the US doesn't produce enough oil for our consumption.  The US consumes 19 million barrels of crude oil a day, and the US produces only 12 million barrels of crude oil a day.  So the US has to import 7 million barrels of crude oil a day to make up for that difference.  The US has a lot of refineries that convert crude oil into refined petroleum products, like gasoline, diesel, jet fuel, and others.  The US uses a lot of those refined petroleum products, but makes more than it needs, so it exports what it doesn't use.  It actually exports around 8 million barrels of petroleum related products a day, so the US is a net producer of oil, although just barely.",
            "title_similarity": "0.62115467"
        },
        {
            "id": "hz7s2cm",
            "score": 0,
            "text": "I'm going to ignore the refining process and focus on crude oil because I think that's what most people understand \"oil\" to be.  Otherwise they wouldn't be worried about \"gas prices\" changing because the price of oil changed.\n\nAnyway, the US has a lot of unharvested oil in the ground.  The government also keeps stockpiles in huge underground tanks.  So in short we COULD be producing enough oil export, we're choosing not to.\n\nThe main reason is that we want to be the last one with oil.  We need fuel for all those military aircraft carriers, and for all the cars that allow transportation into spread out rural of the country.  If we use OUR oil, we could run into a situation where we don't have enough fuel for the military but a foreign power still has oil for its army.  \n\nThe other reason is that wealthy oil companies in the US have bribed the government, in particular the state governments, to allow them to extract oil without paying any significant taxes.  Natural oil deposits have value even if they just sit in the ground.  They represent the ability to make money in the future.  Since the oil companies in the US effectively don't pay taxes, the government doesn't get richer when oil gets taken out of the ground, but the value of the oil as a natural resource gets lost.  As a result the state government, the US federal government, and the US population effectively gets POORER for every gallon of oil extracted here.\n\nOther oil exporting nations have a \"national\" or \"state\" oil company, which is a company owned by the government.  This means they effectively get 100% of the profits from oil extraction.  So of course they're excited to be export oiling as fast as possible.  Meanwhile US government officials would probably prefer oil not be harvested at all.  Setting up a national oil company in the US isn't practical for political reasons.\n\nThink about it: internationally, oil exporting nations are among the richest of countries.  Yet in the USA, states that extract oil tend to be the most impoverished.  How does that make sense?",
            "title_similarity": "0.7065643"
        },
        {
            "id": "hz84yld",
            "score": -10,
            "text": "Because you are thieves , you steal oil and make the countries you steal from terrorists. Just like iraq",
            "title_similarity": "0.5917953"
        },
        {
            "id": "hz7996r",
            "score": -5,
            "text": "I'm also wondering why. I heard some opinions on the net that it's because Greta Thunberg was pushing for the climate change actions and somehow, this ended up with the US having to rely on others for oil.",
            "title_similarity": "0.6921522"
        },
        {
            "id": "hz76cho",
            "score": -1,
            "text": "Why spend your’s when you can spend someone else’s?",
            "title_similarity": "0.4580849"
        },
        {
            "id": "hz7cn2q",
            "score": -1,
            "text": "Why use ours when we can buy theirs?",
            "title_similarity": "0.5538709"
        },
        {
            "id": "hz7fpii",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.11900227"
        },
        {
            "id": "hz7jz36",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.11900225"
        },
        {
            "id": "hz7ltxu",
            "score": 1,
            "text": "Neither oil nor oil companies are patriotic.\n\nOil, just like everything else with a price tag, is an international commodity.\n\nFollow the money.",
            "title_similarity": "0.6472353"
        },
        {
            "id": "hz7ztt7",
            "score": 1,
            "text": "Because military needs enough oil in case of World War 3. Pretty normal for a country which uses 75% of its taxes to fuel its military.",
            "title_similarity": "0.6497141"
        },
        {
            "id": "hz81prp",
            "score": 1,
            "text": "I have candy, you have candy.\nYou get candy for chores, i got candy for doing nothing.\nI will get another candy for nothing in short time, and i happy to give you candy.\nBut i'm often change my mind about how many and who get my candies.\n\nSo, you ask me ten candies, i'll give them to you.\nThan you got one candy and store it in bag(or more).\n...\nThan I stopping export of candies.\nBut you anyway eat candies, which was cheap.\n...",
            "title_similarity": "0.3705021"
        },
        {
            "id": "hz84i3z",
            "score": -1,
            "text": "the usa is playing the long game. we are currently rich enough to not use our oil and buy it from others. witch means we can stock pile our oil for when oil reserve start to dwindle we then sell our oil for big profit. or keep for ourselves so we can keep running our country.",
            "title_similarity": "0.7050528"
        },
        {
            "id": "hz84z9s",
            "score": -1,
            "text": "one argument I have heard, use other countries resources while saving yours. Then when shit hits the fan or those resources run out you can use your own / sell at much higher profits.",
            "title_similarity": "0.5818471"
        },
        {
            "id": "hz7h6sx",
            "score": 2,
            "text": "Protectionism is also a problem.\n\nThere's a law that requires [interstate shipments take place on US-built ships](https://en.wikipedia.org/wiki/Merchant_Marine_Act_of_1920). Massachusetts imports natural gas from Russia, even though there's plenty of it in Pennsylvania.  This is because [America doesn't make boats that can carry natural gas](https://www.chron.com/business/energy/article/Comment-In-maintaining-Jones-Act-the-winner-14016151.php). It would violate the Jones act to ship LNG from PA, so instead, they import it from Russia.\n\n(I realize LNG and oil are different fossil fuels.  I don't know the details about American-made oil tankers, but still thought the Jones act was an interesting and relevant wrinkle to the conversation.  I only learned about it because of the current war.)",
            "title_similarity": "0.6543424"
        },
        {
            "id": "hz78h97",
            "score": 3,
            "text": "Local regulations on extraction and processing, and not all oil is the same ( different salinity levels and ease of refining processes for end use ).",
            "title_similarity": "0.57481897"
        },
        {
            "id": "hz7u3fl",
            "score": 2,
            "text": "A few years ago, foreign sources lowered their prices so substantially that they closed down most operations in North Dakota. They tried to wait it out, but the price kept dropping, eventually getting down to around $27/barrel. At that point we needed to make $80/barrel to make it worth the cost of the fracking operations. It’s more now, with inflation, so it’s all about the oil prices matching what we need to justify operations in the states, with oil workers making pretty darn good money. They kept some operations going, such as pump manufacturers and what not, so they don’t have to completely start over from scratch, but at the same time there’s lots of legislators agains fracking and pushing for clean energy, so by the time the price is worth opening up operations, it may not be needed",
            "title_similarity": "0.55771947"
        },
        {
            "id": "hz7fo30",
            "score": 39,
            "text": "Seeing a lot of technical answers that are overlooking one of the obvious bits here. Oil and gas are commodities that are part of the global market. For the most part (in the US anyway) oil and gas production is controlled by private interests which are beholden to shareholders who demand an ever increasing return on their investments. That is to say, even if the oil/gas is needed locally, it will instead be shipped wherever they can maximize profits. Unless (government) regulations require otherwise, the oil/gas produced/extracted in one location will always be moved around somewhere else if there are profits to be made.",
            "title_similarity": "0.73204285"
        },
        {
            "id": "hz79m7d",
            "score": 34,
            "text": "American refineries require different types of oil and sometimes this might be cheaper to get from foreign sources. Furthermore, there is no oil pipeline between the Permian Basin in the Southwest (which is filled with oil) and the Western coast of the United States, which consumes a lot of oil. The best way to transfer the oil would be by ship. However, the Jones Act \"requires goods shipped between U.S. ports to be transported on ships that are built, owned, and operated by United States citizens or permanent residents.\" (Wikipedia.) Ships that meet those criteria are smaller and more expensive than ships that do not, which makes it easier and cheaper to just get oil from foreign sources.",
            "title_similarity": "0.66804147"
        },
        {
            "id": "hz7jc76",
            "score": 8,
            "text": "The US exports processed oil. It imports crude oil. \n\nThey have a lot of oil refineries and processing plants. \n\nWhile the US does have crude oil of its own, there are many different types (or \"grades\") of crude oil, and some are easier to work with than others. \n\nThink of it like this: \"Why do pizza shops need to buy a bunch of cheese if they have enough to be selling it\". They're selling a different product. They buy blocks of cheese, \"process\" (shred) it, and then sell it with some added ingredients \n\nBasically, the US is typically just the middle man for most products",
            "title_similarity": "0.56846035"
        },
        {
            "id": "hz70gsj",
            "score": 211,
            "text": "The majority of our exported oil related products are petroleum liquids and refined products.  Oil requires a very large infrastructure to ship and store.\n\nAs one example ue to geography it may be more profitable for gulf refiners to sell refined products to Mexico versus transport it to all location in the US.\n\nAs a result it is a very dynamic market where localized conditions may make more sense to export or import oil versus only deal with domestic sources or domestic customers.",
            "title_similarity": "0.71283185"
        },
        {
            "id": "hz75z5j",
            "score": 993,
            "text": "TLDR: \"oil\" is not a singular product.\n\nThere are different grades of it as it can be crude to fully refined. Different sources of oil are \"dirtier\" and require different levels of refinement. Its a large supply chain - and some nations are better/more optimized than others at different parts of its extraction/transportation/refinement/storage orocesses.",
            "title_similarity": "0.6808344"
        },
        {
            "id": "hz7ck9b",
            "score": 396,
            "text": "I think some context is missing from the top voted answers so I’m going to explain further. I’m a facilities (mechanical/chemical) engineer in the O&G industry that’s worked in upstream (get oil&gas out of ground), midstream (get oil&gas to plants/refineries/consumers), and downstream (turn oil & NGLs into things) so I have a pretty good grasp on the technical side of the question your asking and an above average grasp on the business side.\n\n1.\tThe US is currently projected to do something like 11.85 million barrels of *crude*oil per day [source](https://www.cnbc.com/2021/12/30/us-oil-production-to-increase-further-in-2022-oil-expert-dan-yergin.html). (Projections might be up from the writing of that article). \n\n2.\tIn 2020 USA exported 8.5 million barrels of *petroleum* per day of which only about 3.21MMbbl/d or 38% was *crude* oil. [source](https://www.eia.gov/tools/faqs/faq.php?id=727&t=6).\n\n3.\tIn December 2021 the USA had an operable refinery capacity of 17.4 million of barrels per day of which 91% was being used (16.28). [source](https://www.eia.gov/dnav/pet/pet_pnp_unc_dcu_nus_m.htm).\n\n\nSo even if the US didn’t export any of its crude production and was at current refining utilization you would need 16.28 - 11.85 = 4.43 million barrels of imports per day.\n\n\nSo why is *some* crude imported while others are exported. Could have to do with a lot of things. The biggest one was already explained in a comment I believe not all crude oil is the same. A lot of US refining capacity is optimized for heavy oil but the shale boom in the Permian (TX/NM) made most domestic production a lighter crude called WTI. So some refinery capacity is better utilized/more profitable with imported oil. Heavy oil is generally cheaper per barrel than lighter crude because the refining process is more difficult to yield equal returns. But if 35 years ago you already built a refinery really good at processing heavy oil than you might be leaving money on the table paying $10/bbl more for WTI or Brent. \n\nThe other big factor I would guess is that lots of refineries and producers sign long term supply agreements. So some refiners might have made a deal to take X bbl/d from a foreign entity for 5 years 3 years ago. Those kind of commitments can yield better pricing than day/month contracts for the purchaser. They’ll often be negotiated at a decrement to the month contracts so you might commit to taking a bunch of Brent at $1/bbl below market rate. Not sure how common this kind of thing is because my exposure to trading is limited.\n\n\n**Why don’t we ramp up production to meet more of our capacity with the whole Russia thing?**\n\nI actually answered this yesterday on another sub. [Link here](https://www.reddit.com/r/oilandgasworkers/comments/t543y3/why_is_the_us_not_producing_more_oil_political/hz2sk8l/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)",
            "title_similarity": "0.67344"
        },
        {
            "id": "hz7rtgz",
            "score": 19,
            "text": "The location of the Oil also plays a role what is exported and imported.  A lot of oil from Alaska is more profitable to sell to China than to transport it to the major refineries in Gulf Region.",
            "title_similarity": "0.6642027"
        },
        {
            "id": "hz84d5c",
            "score": 24,
            "text": "Extraction, processing, and end-use locations are all different. We import to do the refining and then export the refined product. We also import and refine for domestic use. We also extract and export. Different types of crude are useful for different purposes. For example, West Texas Intermediate crude is often used for diesel and gasoline. It is often refined in the Middle East or US Gulf Coast for use domestically and around the world. Sunset Midway crude, from Central California, is much heavier. It CAN be refined into gasoline, but the energy inputs, technology inputs, and resulting emissions are high. Often, it is refined into petcoke, an industrial fuel too dirt to be used the US but frequently used in India and other parts of Asia.\n\ntl;dr - Oil isn't just oil. It is many different grades of similar substance. Different grades are better for different end products. Different end products have different end markets. Refining capacity that turns certain crude grades into certain end products exists in specific locations.",
            "title_similarity": "0.69243324"
        },
        {
            "id": "hz71fui",
            "score": 9045,
            "text": "The US is a big oil *processor*, we have massive refineries along the gulf coast plus a few big ones in northern states like Minnesota and Washington\n\nThe US imports crude oil and exports processed oil.  We export slightly less volume because there are losses in processing.  Of the oil that the US imports, 61% comes from Canada, 11% comes from Mexico, 3% comes from ~~Columbia~~ Colombia.  That's 75% of the crude imports coming from countries either adjacent or a short boat ride away.\n\nA similar thing happens with a lot of materials.  When crossing a border is cheap/free then why would you spend extra on transport to avoid that?  If the US has refineries close to Canadian oil fields and Canada has refineries close to US oil fields then it makes more sense to ship the crude across the border for *local* processing than to ship it across the country just to avoid an import/export\n\nEdit - I get it, I'm bad at speeling",
            "title_similarity": "0.6732565"
        },
        {
            "id": "hz7b2qe",
            "score": 1,
            "text": "Oil is moving around the world all the time. It is not necessarily economically efficient to store large amounts when it can be bought quickly and easily every day. As has been said before, our refineries want to be running at full capacity all the time. Any storage capacity is better used holding the finished products (gasoline, diesel, etc) than the raw material.",
            "title_similarity": "0.6149024"
        },
        {
            "id": "hz7bhfb",
            "score": 1,
            "text": "I remember hearing that if we didn't export so much gasoline, we wouldn't have to import oil. Apparently the US is the champagne of gasoline.",
            "title_similarity": "0.7274842"
        },
        {
            "id": "hz7c24l",
            "score": 1,
            "text": "US sits on domestic reserves ( notice the number of idle wells in Texas?). When imported oil is used up, they’ll start pumping domestic and price gouging at the same time.",
            "title_similarity": "0.6916944"
        },
        {
            "id": "hz7hmx6",
            "score": 1,
            "text": "Crude have types just like human blood have.\n\nUSA refineries are geared towards specific kinds of Crude, but USA do not extract all that much of such Crude itself.\n\nTherefore USA export its own Crude that is incompatible to those that have correct refineries, while it imports compatible Crude for their own refineries.",
            "title_similarity": "0.6574961"
        },
        {
            "id": "hz7i54z",
            "score": 1,
            "text": "I think it’s more of price demand. If Oil company A is offer so much per oil and another country offers to purchase it at a higher rate. Who do you think Oil Company A is going to sell it?",
            "title_similarity": "0.8199887"
        },
        {
            "id": "hz7im5p",
            "score": 1,
            "text": "We do not really export oil. We export refined petroleum products, primarily fuels of various kinds. We are the worlds top refiner of petroleum products and we refine them for other countries. \n\nIf we stopped all exports we produce more than enough domestically to supply our own needs, but doing so would cripple our allies and neighbors. As such we refine fuel for them and that at a certain point requires us to import crude to cover the amount we do not produce domestically.",
            "title_similarity": "0.7633406"
        },
        {
            "id": "hz7kbmj",
            "score": 1,
            "text": "Oil exports include any products made of a petroleum product. So many things like plastics, waxes, and jellies, asphalt, various refined fuels, and a whole long list.",
            "title_similarity": "0.5389143"
        },
        {
            "id": "hz7ls79",
            "score": 1,
            "text": "As I’ve always understood it, there are different grades of oil and the light sweet crude from the Middle East is a more preferred form of raw material than what we pump in North America.",
            "title_similarity": "0.6097281"
        },
        {
            "id": "hz7sjhl",
            "score": 1,
            "text": "We always import oil for processing. However we are no longer a net exporter of oil.  \n\nAccording to EIA's February 2022 Short-Term Energy Outlook (STEO), net crude oil imports will increase, making the United States a net importer of petroleum in 2022. A country is a net importer if it imports more of a commodity than it exports.Feb 20, 2022\nhttps://www.greencarcongress.com › ...\nEIA expects US petroleum trade to shift toward net imports during 2022",
            "title_similarity": "0.7625982"
        },
        {
            "id": "hz7skqb",
            "score": 1,
            "text": "I’m pretty sure exporting allows to buy back more mature US Treasuries that countries hold as foreign exchange. \n\nPlus the stuff others have said",
            "title_similarity": "0.6197351"
        },
        {
            "id": "hz7uj1h",
            "score": 1,
            "text": "There are two main types of oil sold on the market. They are Brent and West Texas oil. They are different because they have different sulphur contents. They are similar but there are certain products that require high sulphur oil and some that don’t. There are also market mechanics that make it advantageous to sell to one party who may need oil, and replace from another party whom you could benefit through the relationships created by buying from them.",
            "title_similarity": "0.6716316"
        },
        {
            "id": "hz7wwkc",
            "score": 1,
            "text": "It’s the type of oil- we don’t have the processing facilities for our oil- we ship that dirty stuff out and bring in that sweet sweet Saudi stuff that works in our refineries.",
            "title_similarity": "0.63516974"
        },
        {
            "id": "hz7xobe",
            "score": 1,
            "text": "Since I haven't seen anything for a five-year-old:  \n\nIt's largely the same oil.  Oil doesn't come out of the ground ready to use.  We import it and process it in refineries to clean it up.  Some of that oil then gets exported.",
            "title_similarity": "0.57531106"
        },
        {
            "id": "hz7znqs",
            "score": 1,
            "text": "Bc if we just buy oil from everywhere else until everywhere else dries up, then we hold the power and can charge whatever price we want for our own. Basically the US is playing the long game with this one.",
            "title_similarity": "0.69494"
        },
        {
            "id": "hz7zxs2",
            "score": 1,
            "text": "Why use your stockpile when you can use others? Once others are used up, you control the game with yours",
            "title_similarity": "0.45215207"
        },
        {
            "id": "hz81ir5",
            "score": 1,
            "text": "It's a global marketplace. Private refineries look for cheap crude available on the marketplace so they can make more money.",
            "title_similarity": "0.6351026"
        },
        {
            "id": "hz829vj",
            "score": 1,
            "text": "One factor is that much of the oil trade is not direct producer to consumer. We buy oil from one country that we then sell to another. Sometimes, this goes through multiple buyers. This globalized market keeps oil prices standardized. If it were 1-to-1 purchasing, cheaper resources would be sold out, and more expensive resources would become more so due to demand. \n\nAs it is, a barrel of oil costs what it costs, regardless of where it comes from.  Normally, this helps keep prices low, but we are currently in the middle of a confluence of events causing the prices to go up. \n\nAnd if we were to primarily use our own oil resources for our own consumption; which had been a policy over recent years, until it was changed back to the previous method under the current administration; we would drain our reserves very quickly. In decades, possibly. For a short period of time, big oil companies would achieve record profits and consumers would see low prices, but that bubble would burst once the supplies got low and demand shot the prices back up without any mechanism to deal with the inflation. Ultimately, the next generation would be in an energy crisis of one sort or another.",
            "title_similarity": "0.73022044"
        },
        {
            "id": "hz82ms7",
            "score": 1,
            "text": "iran has shown it can't develop those nuclear weapons without some more capital and after all the sanctions, the russian people need some oil money too",
            "title_similarity": "0.6831492"
        },
        {
            "id": "hz83r1t",
            "score": 1,
            "text": "True Eli5: USA brings dirty oil, pass them in washing machine, and sell back cleaner oil for more $!",
            "title_similarity": "0.62574875"
        }
    ]
}