{
    "ELI5: Can you give me an understandable example of money laundering? So say it’s a storefront that sells art but is actually money laundering. How does that work? What is actually happening?\n": [
        {
            "id": "i0kzihv",
            "score": -3,
            "text": "Hypothetically, let's say the president has a drug addict son,  and this son gets into \"art\" upon his father becoming president,  this artwork is sold for outrageous prices to anonymous people bc of \"security \"",
            "title_similarity": "0.6404143"
        },
        {
            "id": "i0jmetc",
            "score": 6,
            "text": "Money laundering is more like an art than a science. As long as the whole process looks logical, reasonable and realistic, it is only limited by a criminals creativity!\n\nThere are multiple ways to use art to clean money, below is one.\n\n1. You start with a sum of dirty money. Or clean money is ok too.\n\n2.You visit some not-so-famous but have-good-potential artists. Buy up their paintings at cheap prices. Sign a long term contract to buy up all their future paintings. Sponsor these artists to showcase their work frequently and build their reputation. Pay these individuals with dirty money. Or clean money is ok too.\n\n3.  Send a few piece of paintings to auction houses. Make arrangement to bid them at sky high prices! To make things not too obvious, you need to raise the bid price gradually over some time. Long term plan, remember?\n\n4., now that these not so famous artists are made famous by you and their art pieces made expensive by you you can now start selling their art pieces at much higher prices you know if clean money made from selling expensive art pieces.\n\n5.  Or you can take up a loan with the bank and use the expensive art pieces as collateral that is also clean money from the bank.",
            "title_similarity": "0.7344609"
        },
        {
            "id": "i0ka1va",
            "score": -3,
            "text": "Don’t forget laundering **bribery** using art exist! \n\nHunter Biden’s paintings being bought by foreign dignitaries for absurd amounts doesn’t count tho 😉 \n\nThere’s zero connection to the Biden administrations choices and who buys Hunters paintings. No way special consideration is given to those that pay Biden’s kid hundreds of thousands per mediocre painting",
            "title_similarity": "0.64919937"
        },
        {
            "id": "i0jwy02",
            "score": 38,
            "text": "Or you can build a condo tower with your branded name, say Dump towers, then sell million dollar units to guys from places that are cold, and their money is hot. You get a big commission, your kids are the sales agent. Then those rich people sell it to their friends, at inflated price. Oli #1 now has clean money. Oli #2, raises the price and sells it to Oli 3 , rinse repeat. Note, always use a shell corporation, not your real name. Meanwhile you kids get their commission on the sales and never notice the money laundering. Works in the US and all your towers in places who don't watch real close, for a price.",
            "title_similarity": "0.586517"
        },
        {
            "id": "i0jvlee",
            "score": 4,
            "text": "You rob a bank.\n\nYou get thousands in cash for it.  The notes aren't marked, but you can't just drop that amount in your bank account without an explanation for it.\n\nSo you buy some art from me, not necessarily at face value.  I take the cash.  Use it for other transactions it.  Break it up.  Wash it round different places.  Use it to buy different things.  Trying to hide the origin of the money, knowing full well that it was stolen.\n\nNow you have a piece of art worth an amount of money.  You sell it.  Someone gives you legitimate money for it.  Your hands are now \"clean\" and you have a receipt to prove it.\n\nYou \"spent $200\" to buy the painting, I'll give you a receipt to say that.  You \"sold it for $2000\".  You get a receipt to say that.  We have legitimised the source of your income, by working in co-operation to obscure its origins.\n\nNow involve dozens of companies, transactions, artefacts, different businesses, different industry, different people, different buyers until it's all almost untraceable but you come out of it with almost the same amount of money and now you have receipts.  Obviously, I keep a bit because it's not without risk.  But better for you to have $2000 clean money and a receipt, than $2500 in cash from a bank robbery.\n\nAnd it doesn't even need to be a robbery - any undeclared money, any source of income, anything you don't want to declare, anything you want to avoid paying tax on, any asset you don't want to sell directly in case it comes back to you that it was worth something, etc. etc. etc.",
            "title_similarity": "0.8037936"
        },
        {
            "id": "i0jo9p9",
            "score": 8,
            "text": "Best explanation is from breaking bad when Saul instructs Jessie on how to do it.  Excellent video on you know where...",
            "title_similarity": "0.4097885"
        },
        {
            "id": "i0k9h9e",
            "score": 5,
            "text": "TIL that 100% of the people who respond in r/EIL5 would be caught for money laundering. And a good percent would actually lose money while doing it.",
            "title_similarity": "0.5578081"
        },
        {
            "id": "i0ktkhj",
            "score": 0,
            "text": "I used to be a Casino dealer. Dealt to actual Mafia members. \n\nJimmy (not his name, I'm not that dumb lol) would play craps almost every day. Big bets, but not crazy big. But usually some of if not the biggest action at the table. \n\nHis play was mostly normal shit that wouldn't raise eyes. He'd win big and lose big. At face value and normally day to day he would look like an average player. Winning, losing more often than he won. \n\nI was a supervisor sometimes too and could see their player status details. \n\nOf his yearly buy ins and what we tracked (which with him always having a big buy in and either big loss or win, we did), of the million+ he bought in for every year, his win/loss amount was almost even (he never won or lost any money) \n\nSo buying in with dirty cash, he wins and cashes out his chips at the cage, trading that in for clean cash that he now has a legitimate way to say he obtained. \n\nBefore if he had a million dollars and no explanation for it, it's suspicious. But if he won it playing craps...\n\nThat's not all though. Most of their business is in legitimate business ventures these days, but sprinkled among those are also a few bars and strip clubs. Perfect laundering sites.",
            "title_similarity": "0.4826103"
        },
        {
            "id": "i0l5vc7",
            "score": 0,
            "text": "Buy art for supplies cost. Sell art for supplies cost. Report selling art for $9999.99. Taxed 38%. Washed money.\n\nCost of doing business. Crystal shops where i live.",
            "title_similarity": "0.598251"
        },
        {
            "id": "i0l95be",
            "score": 0,
            "text": "I'm not sure if this was mentioned but watch the show Breaking Bad. Not only is it the best show ever made (IMO), but money laundering is absolutely central to the plot!",
            "title_similarity": "0.6579393"
        },
        {
            "id": "i0l9w80",
            "score": 5,
            "text": "This means you make dirty money become clean. You \"wash\" money. Dirty money is illegal money. Stolen, smuggling, trafficking, drugs, whatever.\n\nPretend you have $5,000 dirty money. You launder this money through a real business to make it legal. Or appear legal and legit.\n\nChoose any legal business. Could be anything. Selling cake! Each cake is $50. This year you report selling 100 extra cake! A lot of job promotions and birthday parties this year because lockdown is over!\n\nYou deposit the $5,000 you originally got from selling meth or stolen from your toxic aunt but it's disguised as selling 100 cake through your business.\n\nYour $5,000 went from \"I made it from selling drugs\"\n\nTo \n\n\"I made it selling cake\" \n\nTADA!",
            "title_similarity": "0.5350355"
        },
        {
            "id": "i0lad9u",
            "score": 0,
            "text": "There is deli near me. The guy working there say they only take in sixty bucks a day. He gets paid more then that. The owners are from Ireland. They pay the bills. They must funneling money from illegal source through the store.",
            "title_similarity": "0.47892234"
        },
        {
            "id": "i0ln1h7",
            "score": 0,
            "text": "I've seen the organised version of money laundering a few times. It is very easy to spot if you know what you are looking for. As an example, I went to buy some electronic supplies, and the cashier rung up a price that was 10 dollars higher than the item, then did the same at the correct price to make a receipt that showed the correct price.\n\nSo now the books say 80, when the actual price was 70, and that extra 10 is the cash that is laundered.\n\nRepeat hundred times at dozens of locations, and ta da, you have laundered tens of thousands in a matter of a day. In reality, the actual amount is much more, but the businesses are different, such as payday loans or construction.",
            "title_similarity": "0.50663793"
        },
        {
            "id": "i0lowgi",
            "score": 0,
            "text": "Like when you donate money to the Clinton Foundation to help some Haitians (snicker) and it winds up invested in a hedge fund that coincidentally backs the contractors who receive billions in federal aid for Haiti.",
            "title_similarity": "0.52164996"
        },
        {
            "id": "i0m83bl",
            "score": 0,
            "text": "Hunter Biden's paintings potentially.  We do a shady deal for another country, they agree to \"buy\" a painting for egregious sums of money.  Innocent artwork transaction on paper with plausible deniability, actually sketchy af.",
            "title_similarity": "0.7596772"
        },
        {
            "id": "i0nxpnf",
            "score": 0,
            "text": "U open a 50 locations of a phone repair shop, employ real employees who can do the work, then deposit cash (money that needs to be laundered) thru all locations and deposit via bank. What so hard to understand",
            "title_similarity": "0.45593184"
        },
        {
            "id": "i0jwe3z",
            "score": 8,
            "text": "A great example is how they run the car wash in Breaking Bad. It doesn’t really go into a lot of detail. But when skyler figures it out, it kind of spells out the basic gist. Also, I think I remember Saul breaking it down for Jesse at one point. It’s a mostly cash business. You’re not doing anything for the money, it’s a lot and it comes easily. So, if you have a business like a bar or a laundromat, something that’s mostly cash-based, you can claim that the “illicit” cash is revenue from the business, you say you sold $100 worth when in actuality it’s drug money, you pay a little on taxes, deduct a lot, and keep the rest free and clear. Make sense? Also, there’s a good scene in a movie with Christopher Walken called ‘At Close Range”, where he and Sean Penn have some crime money to launder. They pull up to a dealership, this is back in the mid-80’s mind you, and spot a clean ford fairmont sedan. Walken exclaims to the salesman “you’ve got 5,500 on that car. I’ll give you 5, cash. Do I drive her out?” He buys the car at 5, then drives directly across the street to the car dealership there. He says to the approaching salesman “I just bought this car. $5,500, it’s a CHERRY. Gimme 46 ($4,600) for her”. The salesman asks “why you sellin it” to which Walken asserts “I don’t like the radio”. Now, at the cost of only $400, Walken has “laundered” $4,600 of his crime proceeds, with a paper trail of the sale to that dealership, so the money is his free and clear. Now, this may obviously not work today, it would be a bit more complicated and involved so the govt. makes sure to steal their share, but that’s basically how it’s done. You have “free” money. You buy something with it and then re-sell it, claiming a loss or whatever, that way, you have a receipt and the money, which MAY have been marked or with recorded serial numbers even, is now “washed” or laundered.",
            "title_similarity": "0.6742412"
        },
        {
            "id": "i0jmgtx",
            "score": -5,
            "text": "Lets say you have a magical money printer that prints new dollar bills that no one can tell are fake - they have the little foil strip inside, the watermarks, the holographic verification that you shine a lazer through and it has a convincingly official pattern.\n\nExcept banks and similar kinds of money officials are going to notice the bills aren't real because they have serial numbers - and they can verify them in a system that would compare the counterfeit serials to what serials are legitimate.\n\nSo you'll need to find some way to exchange your fake dollars for real ones.  That's what money laundering is - and in your chosen example, you'd start up an art store, and you could probably mix in one or two of your counterfeits when buying new art from people, or if making the art yourself, the supplies & resources for it.  Then when you also go to sell the art, you could mix in a couple counterfeits when making change for people (though art is usually going to be the realm of checks and credit purchase, not cash) - while they are presumably giving you real legitimate money.\n\nThat's money laundering - it's \"cleaning\" counterfeit money by exchanging it for \"legitimate\" money.\n\nBecause obviously if you're trying to pay off a $10,000 purchase in cash, and all of the bills turn out to be counterfeit, it's going to be pretty easy to trace it back to you - it's why the mobsters and counterfeiters need a way to get legitimate money for it, because if they don't it's too easy to figure out the crime and get you arrested for it.",
            "title_similarity": "0.69675344"
        },
        {
            "id": "i0jox1z",
            "score": 1,
            "text": "I knew a person who would have other people buy things with his drug money.  His cars and houses etc were purchased by and tited to other people.",
            "title_similarity": "0.6596927"
        },
        {
            "id": "i0ksw1f",
            "score": -1,
            "text": "I have a Millie in crypto I’ve gotten by selling Fentanyl on TOR. I make an ape NFT. I sell said NFT to myself for a millie using one shell company to sell to another. These shell companies are based in a country that doesn’t give a shit where the money to buy said NFT comes from. To be specific: Ireland, Cayman Islands etc, if you’re really good: Delaware. My goal is to integrate this money into the U.S. banking system. Not only is that money now laundered, that NFT can now be sold for 2 mil because on its ledger it has been sold for 1mil previously so it implies value to potential buyers. Not only that, but potential buyers can launder their own I’ll-gotten money by buying and selling the NFT I made. Once I’ve sold my NFT to another Fentanyl manufacturer I use that money to open an account in the U.S. using money I’ve made from investing in NFT/Crypto. It’s surprisingly stupid and easy any the only reason it’s allowed is because no one gives a shit. It would take 30 minutes of inspection to unearth the scam but, as a bank employee, when someone comes to you with millions in on-paper legit funds and you will get a commission for opening their account and you know damn well they’ll go down the street to another huge bank and easily open an account there if you say no, then might as fuckin well, right?",
            "title_similarity": "0.63120246"
        },
        {
            "id": "i0l2im3",
            "score": 2,
            "text": "Take your illegal, traceable money to vegas.\n\nVisit many casinos, spending money at each. Heaps of it. You will lose most of it.\n\nBut the rest will come back as legitimately won money, and clean too. You will even have provenance - proof of how you got it.\n\nYour money has been \"cleaned\". It is now legally obtained with proof.",
            "title_similarity": "0.6357913"
        },
        {
            "id": "i0l5fs0",
            "score": 2,
            "text": "Nice try fbi. \n\nOn a serious note, and this is from experience(a family friend fights cases for those who have laundered money. )\n\nSo say you have a company that has a 25 mil revenue an year. Say you have to pay 20% tax so that would be 5 mil. \n\nNow you make a dummy company in a tax haven country or one with favourable laws, say cayman island. Now this company sells whatever u want. Say they sell pens, and they charge 24 million for a box of pens, and since they can charge how much ever do they want to for their products, it’s believable. Now since the pens are a business expense, they would be non taxable hence u save money that way, and in my country even will give u a subsidy. \n\nNow your revenue in the first company is only 1 million bucks cuz u bought a box of pens for the rest. \n\nNow since you would have actually had more expenses than revenue then it’s a loss for your company and hence u pay no taxes. \n\nIn fact, u can go a step ahead, take a loan, do the same and declare bankruptcy. Obv it’s not this simple but that way u don’t repay the loan and not only keep all the laundered money but also the money from the bank. It’s actually quite simple. There is this guy, who now in jail for a completely unrelated cause, made about 130 million in 4 years this way. His family is still doing really well even after teh 52 mil he had to pay as fines. \n\nI’d write more but I’m tired now.",
            "title_similarity": "0.50390005"
        },
        {
            "id": "i0lteds",
            "score": 2,
            "text": "There are two types of money laundering:\n\nThe first is exemplified in *Breaking Bad* and numerous other crime shows. You end up with a pallet of bills, used $10, $20, and $100 bills.  You want to be able to use it as regular money in the bank to buy stuff. But the government requires any deposit of *cash* of $10,000 or more to be reported - exactly so they can trace people who earn a lot of money in illegal ways, as cash - like selling drugs. \n\nIf you buy a Porsche or a house with cash, it's well over $10,000 so the seller will have to deposit the cash and explain where they got it - which would lead the feds back to you. The trick is to make it look legit. \n\nThe trick is to pretend it came from legitimate business. You own a pizza parlour, or a car wash, or bar, or strip club, or (in *Weeds* ) a bakery; some business that receives a lot of cash. For every dollar you make in that business, you deposit two and claim it was from the business. Now you are a very successful pizza businessman, and you have money in the bank to buy that Porsche no questions asked. \n\nOF course, if the feds get curious they can do things like watch how many customers. Or determine \"you sell too much for cash vs credit compared to other businesses in the area.\"  You can't get too greedy or attract attention.  Often this \"laundering\" is farmed out to many businesses, in return for a share.  For the rich drug lord, $1M in legitimate bank deposits they can spend is worth more than $2M in small bills that are hard to spend on big items.\n\nThe second \"laundering\" is the other half. The money is in the bank system, but you as an enterprising politician or drug lord need to receive it as legitimate income without it looking like illegal income or a direct bribe - i.e. *why* did Joe Whoeverevich of the Russian mob give you $1M? This is where art, real estate, yachts, etc come in. You open an art gallery, you sell a painting to Joe for $1M (or one to him and several others to his \"friends\" for a total of $1M). They are real art, but not worth anywhere near that. Or you buy a mansion in Florida for $17M and sell it to that Russian with lotsa dough for $85M like Trump did.  Sometimes if the person is a legit consultant, they get excessive fees for doing a consulting job - is it real, or an inflated price to slip them money? \n\nNow you are suddenly richer, and as far as any investigator can tell, you earned the money fair and square. You can buy *two* Porsches, and a yacht.",
            "title_similarity": "0.6798872"
        },
        {
            "id": "i0k1be0",
            "score": 25,
            "text": "you cut grass in the neighborhood and you sell some drugs at school.\n\nyour mom sees a stack of cash in your room and wonders where it came from.\n\ngrass cutting, mom… what do you think?",
            "title_similarity": "0.4663598"
        },
        {
            "id": "i0jxp2z",
            "score": 3,
            "text": "Any high cash business. Car wash. Laundromat. Strip club. What ever. Especially if there is not a tangible product going out the door. Anything where alot of people pay in cash. Mix the dirty cash with the clean cash from the ligit business. Deposit mixed cash in the bank. Make sure it is a believable amount. Like a car wash cant make 2mm a week. But have a chain of car washes and they all make an extra 10k a month. Sure.",
            "title_similarity": "0.54537433"
        },
        {
            "id": "i0k6m7e",
            "score": 3,
            "text": " The easiest way I can explain it is with a restaurant. Let’s say they charge $20 for a steak and $5 for a drink, but on their financial records and documentation they‘re saying they charge $40 for a steak and $10 for a drink, thus taking $25 dollars of illegally obtained money and „cleaning“ it",
            "title_similarity": "0.44893748"
        },
        {
            "id": "i0kaw9t",
            "score": 4,
            "text": "You start a barber shop. You don’t get any customers, but you say you get 100 per day. You charge 50 dollars per haircut. Everybody pays cash. You are laundering 5000 dollars per day. You pay your taxes and all that and you lose some money on that, but it’s clean now.",
            "title_similarity": "0.46051294"
        },
        {
            "id": "i0ko8im",
            "score": 3,
            "text": "You as a middle man make a painting, 'someone' values it at 250.000$, someone buys it at that price, you keep a percentage and buy or transfer the rest to a third party that the original buyer has connections with and that third part either provides services to the original 'art' buyer or the reverse is claimed and the now cleaned money is handed back to the original buyer(minus the handling fees for the go between's).\n\nIt really is that simple and there are many variations of this.\n\nA particular relatives 'art', consulting services, paying someone for a public speech, the list goes on, what it boils down to is paying for an imagined service or value through a few intermediaries-\n\nCorruption and money laundering is easy when people you are a part of controls the news and what is mentioned in them, if something isn't spoken about it will happen without any problems because not enough people notice that there is a problem.\n\nStart looking at politicians and their relatives....\n\nIt's also not for nothing that virtually all celebrities have a 'foundation', charity is another easy way of transferring and laundering money as well as paying for of-book services...",
            "title_similarity": "0.5981113"
        },
        {
            "id": "i0jlfdn",
            "score": 71,
            "text": "Art is a bad storefront example. The easiest to understand is well... a laundrymat.\n\nLet's say you sell a ton of drugs, but don't want the government to start wondering why someone with no income is able to afford a fancy car and house. What could you do? \n\nWell, you could open a laundrymat and create fake transactions to funnel your drug money (illegal, not reported) into a \"legitimate\" business. So you'd take your $100,000/year drug money, write up $100,000 in fake receipts for your laundrymat and from the government's perspective, that illegally obtained money would look like it was legitimately obtained. Sure, you'd need to pay taxes on it but the objective is to avoid Uncle Sam throwing you in prison for decades for tax evasion and related offenses.\n\nFor the art example, you could for example \"sell\" paintings to friends for a combined $100,000, when in reality those \"sales\" just exist to make the $100,000 you made by drug sales look legitimate.\n\nIn reality, the IRS tends to not be stupid and has seen just about every scam and money laundering scheme in the book, and if you think you've found a smart way to avoid reporting income you're likely in for a world of hurt. For example, they'd know if your utility bills or other expenses looked suspiciously low for the amount of transactions you're reporting or if you're making significantly more money than competitors. And in general, businesses that are more common fronts for money laundering or other fraud tend to be much more likely to be flagged for audits.",
            "title_similarity": "0.7124773"
        },
        {
            "id": "i0jy1wz",
            "score": 6,
            "text": "I made $100,000 selling illegal drugs. I can't spend that money. But if I sell a painting at an 'art gallery' for $100,000, I can. So Tony Soprano hires some guy to paint 20 canvases for him, and sells them at his art gallery for $100,000 a piece to a member of his gang. Each piece is bought for $100,000 by another member of the gang, and then they just buy and sell them between each other. When it's all over, every one has the same amount of money as when they started, but now it's all legal.\n\nTo the IRS and authorities, Tony and friends have made capital gains by trading in art. They'll pay the taxes and have the money all nice and squeaky clean.",
            "title_similarity": "0.51202905"
        },
        {
            "id": "i0jo00a",
            "score": 185,
            "text": "You have a cash business such as a tea shop, restaurant or a laundromat. \n\nYour sales is $5,000 a month but you tell the taxman that you made $100,000 a month and pay income tax accordingly. At the end of the month, you deposit $100,000 and since everything ties out, next year when you buy a million dollar house, you can prove to the bank that said million comes from a legitimate business and not from selling drug to teenagers.\n\nThis works because no one can really verify how much your restaurant makes. Your sales is whatever you say it is unless you're on a radar and police sends over someone to verify foot traffic or audit your book.",
            "title_similarity": "0.45579705"
        },
        {
            "id": "i0k6ht2",
            "score": 84,
            "text": "Money laundering has 3 phases: placement, layering, and integration. \n\nArt often falls into the layering and integration phase. \n\nFirst step, placement - that means you need to get illegal money, often cash, into the financial system. Common ways to do this: cash intensive businesses (laundromats) and selling illegal money to someone at a discount. \n\nSecond - layering. Now you do a bunch of legit transactions to confuse the trail of money in the hopes of getting it out as legit funds. Let’s say you, a mobster,  own an art gallery. You sell a piece of art worth garbage for $1 million and buy it with your newly “placement”ed money. Now you have legit art you can turn around and sell at some point for likely even more legit money. \n\nLast - Integration: now you sell that art, you get money that’s absolutely legit and you pop it into your Schwab account. \n\nThis is a simplified version, but should help. \n\nSource: I’m in finance.",
            "title_similarity": "0.87129086"
        },
        {
            "id": "i0jroae",
            "score": 237,
            "text": "\"Always be wary of a cash only business\"\n\nWhy do you thin the Mob owns so many restaurants?\n\nLet's say you own a pizza place, and in a typical week you sell 1000 pizza's.\n\nYou then cook the books to say you sold 1500 pizza's, and the extra 500 were paid for in cash.\n\nThat extra 500 pizza's were paid for with illegal money, that has now been laundered. You may need to pay taxes etc on it, but it now appears to come from a legit source.\n\nYou can then go further and own a supplier, now you can buy flour, sauce, and peroration that only exists on paper.\n\nYou still have a legit business, and you DO sell pizzas, but the paper work says you sell a lot more pizza than you actually do. That's how you hide the illegal money.\n\nSo why cash? Because it's a lot harder to trace than debit transactions and credit cards.",
            "title_similarity": "0.49184525"
        },
        {
            "id": "i0l0i2n",
            "score": 17,
            "text": "What most people don’t understand is that **you lose money when you launder it**.  This is viewed as a cost of doing business.  After all, would you rather have $100 million you can’t spend, or $20 million you can?\n\nOnce you understand this, understanding money laundering becomes a lot easier.",
            "title_similarity": "0.6379834"
        },
        {
            "id": "i0jxk3t",
            "score": 50,
            "text": "Actually, a lawn care business or a “high-end” detail shop would be better than a car wash and laundromat combined. A good professional detailer can charge close to $150 an hour or more. Chemicals can easily vacillate in price and there’s no way to really account for labor hours. One car can be charged $3,000 for a detail with paint correction, and that’s not even with PPF. You could use $20 ceramic coating and claim it’s the $200-300 stuff, who would know, that wasn’t an industry professional? If the agents use chemists to determine you were lying about the quality of your products, you could just say “yea, I was, I was ripping off my customers, so what?”. Which would work, because you’re making up customers and services anyway, but you’re still going through products, you’re just marking them up. Plus, with that sort of money, you could buy or rent exotics to bring through regularly, to appear legit. I would rent them, couple hundred a day to make thousands, that’s good laundry ;)",
            "title_similarity": "0.51627487"
        },
        {
            "id": "i0jpv5z",
            "score": 717,
            "text": "I have 100 dollars from illegal activities that I can’t put in a bank or spend without the IRS catching on. So I buy a painting for $2 and “sell” it to someone for $100 dollars, except that $100 is my illegally gained money. Well that money is now “legitimate income”. I have on the books I sold a painting for $100 and that’s how I got this money. Usually the businesses are real and generate some legitimate income and are supplemented with illegal gains, that way if there is suspicion it passes as legitimate. \n\nObviously they do way bigger numbers though. There’s also a seen in Breaking Bad that shows it simply. She owns a car wash and to wash the money or launder it she just processes a bunch of car washes that aren’t actually happening. Turning illegal money into seemingly legitimate income.",
            "title_similarity": "0.5887128"
        },
        {
            "id": "i0jkmu6",
            "score": 6500,
            "text": "\n\nLet's say they sell a piece of art, they sold it for $100, on their accounts they write it as sold for $500. The other $400 could have been gained through illegal means.\nBut now they can explain how they obtained the money",
            "title_similarity": "0.5895201"
        },
        {
            "id": "i0joyd2",
            "score": 3570,
            "text": "The simple version is think everything in CASH. Cold hard cash.\n\nLets say I'm a mobster, dealing drugs, doing shit. I have tons of cash from illegal stuff.  But I can't really spend it too much. If I buy a house or car or start living extravagantly, people will notice, and wonder, \"how did you get the money?\". So I need to find a way to make it so my illegal money looks like it comes from a legitimate business and no one knows its true source.\n\nSo, I open a bar.  Bars operate in cash mostly. Lets say my bar is an OK bar, I have real customers, and I make $2000 in sales a day. Cool. Now what if I \"buy\" some extra drinks with my illegal cash. Say a $1000 a day. I never serve those drinks at the bar, I just get paid for it. Now my bar makes $3000 a day. Totally normal, and for bars, people paying in cash with no receipts is normal. Nothing seems strange. Each day, I just take $1000 of my illegal money and give it to the bar, that I happen to also own. I just put it in the register.\n\nPretty soon, my business is doing well, nothing seems strange, I have a good business, I operate a successful bar. I can take out loans, show people my books, pay taxes, I'm just a good businessman who runs a bar. Everything seems fine. Little do they know, my bar isn't a good businesses, I just lie and take money from my other business and say we sold drinks that never existed.\n\nThere's a reasons a lot of mob people often operated bars/restaurants/strip clubs/casinos and such. Cash businesses where its easy to launder money and nothing seems off.\n\nFor art, you just take this to an extreme, instead of say $1000 in drinks a day I'm fudging on the books, what if I instead \"buy\" a $1M piece of art? Same thing.",
            "title_similarity": "0.70814097"
        },
        {
            "id": "i0jroo2",
            "score": 203,
            "text": "[removed]",
            "title_similarity": "0.15451548"
        },
        {
            "id": "i0k2rkc",
            "score": 206,
            "text": "I worked in an arcade that I suspect was laundering money. The key point is that (as an employee) there was no, zero, way to know how much the store made in any given time. Most businesses want to know EXACTLY how much they made and when. This place had policies that completely stopped anyone from “accounting” for the money that came in the door. Tokens were used in the machines. When we ran out, we opened the machines and used them again. There was no register, just a “cash drawer” used to make change. Tokens were never counted and money was never counted by the employees. All money was added to a drop safe, uncounted, at the end of the shift. Here is the important bit: if the owner DOESN’T WANT TO KNOW how much he made, it might be because they didn’t want ANYONE to know their take. Could be any number, completely untracked. That was hokey and highly suspicious. If nobody knows how much you make, you can add to the stack of “income” at any time and there would be no practical way to discover it.",
            "title_similarity": "0.53278863"
        },
        {
            "id": "i0jsso3",
            "score": 211,
            "text": "You record more in transactions than you actually make, creating the documentation that allows you to add your illegal revenue into the legitimate stream and pay taxes on it.  After that, you can spend it as you wish.  \n  \nWhen I was in college, there were a few music stores on the shopping strip near college.  One sold CDs for $10-12 while all the others were $15-18, so I spent a good bit more time in that one.  They seemed really big on preventing shoplifters, though, since they always had someone in a high booth in the back watching the store.  \n  \nAnyway, they were shut down for being a money laundering front the next year.  The cheap CDs kept people coming into the store to have high turnover, and they could pad either the unit cost or number of units sold as ways to feed illegally-obtained funds into the legal sales data.",
            "title_similarity": "0.562645"
        },
        {
            "id": "i0kpm9i",
            "score": 34656,
            "text": "You've been stealing $20 notes from your father's wallet for a few weeks, and now have quite a stash ($100) to spend at the toy shop. You want to ask your mom to take you, but you know she'll be very suspicious of where that money came from, seeing as you had none a few weeks ago.\n\nSo you open a lemonade stand on the front lawn. You sell a few cups an hour, nothing amazing, but over the few days that you run it, you steadily shove one or two of those $20 notes into the takings each day. Your parents are amazed at your enterprise when you proudly show them the $148 you made at the end of the week after expenses. Of course, $100 of that is your stolen money, only $48 is \"real\" profits. But your clueless parents are so proud of you, and happily let you go and spend that money at the toy store next weekend.\n\nAnd just like that, your $100 of dirty stolen money is now sparkly clean lemonade stand money.",
            "title_similarity": "0.38567677"
        },
        {
            "id": "i0jv5j4",
            "score": 1,
            "text": "There are three huge tunnel car washes going in at a local community of 18,000 population …. I figure at least one is a money laundering front … so long as they don’t get greedy and balance their water & soap expenses with their income tax, nobody will notice.",
            "title_similarity": "0.5775095"
        },
        {
            "id": "i0jvtxo",
            "score": 1,
            "text": "Lets use your example of an art store. I open an art store to launder money. I have some friends who are mediocre artists paint some paintings, or buy some cheap ones off ebay. \"Beauty is in the eye of the beholder,\" as they say, so I can set the value on these paintings at whatever I want and the IRS can't call me out on it.\n\nHere's where it becomes laundering: I don't actually have to be honest on how I report my sales. I can buy my own paintings (or have friends do it) with my illegally gained cash, I can then say that the painting was bought by a customer, and ring it up through the cash-register to make it official. I can now tell the IRS that I sold a painting for $100 and to them that seems legitimate, even though most of that was actually drug money or whatever. The money is now \"clean,\" and I can put it in my bank account and use it without the IRS wondering where those thousands of mystery dollars are coming from.\n\nStrip clubs and similar businesses are also good for this. Made $1000 last night, and $800 the night before? Sounds legit since nobody from the IRS is actually counting the money in the strippers bras. Basically any business that deals in cash and doesn't keep a traceable record of customers.",
            "title_similarity": "0.7899116"
        },
        {
            "id": "i0jwtf8",
            "score": 1,
            "text": "Say I make $500 a week from selling X illegal substance. I can’t just deposit this money into an account over and over nor can I use this income for loans or such. \n\nThankfully, I also run a business that deals mainly in cash. Maybe I make $400 a week from my business. I include some of the money I make from selling X. I over report my earnings. I say that my business brings in $800 a week instead. Now I’ve “cleaned” $400 a week. Now the paperwork looks right and I can explain where I got this money from.\n\nNow when I apply for a car loan or a mortgage, I can show that I’m getting this money from my business. I don’t make $1600 a month, I make $3200 a month. \n\nI still have $100 a week in “dirty” cash that I can’t really “use” so it stays as cash and becomes gas money or whatever else.",
            "title_similarity": "0.5092845"
        },
        {
            "id": "i0jwvm4",
            "score": 1,
            "text": "Say you have some money that you acquired dubiously. This business has a painting that it says is worth $1k dollars. You use the \"dirty\" money to buy the painting. You then turn around and sell the painting to another collector. You have just cleaned the $1k dollars, since the money was now from the art work. Usually you take something that has an intrinsic value and trade the dirty money for it. You can then resell the item and voila the money came from a traceable and legal transaction.",
            "title_similarity": "0.74667656"
        },
        {
            "id": "i0jxdsd",
            "score": 1,
            "text": "Reading the replies explains why I didn't get rich by putting my wallet through the wash...",
            "title_similarity": "0.68790853"
        },
        {
            "id": "i0jxu56",
            "score": 1,
            "text": "Pretty much every postcard and candy store in central London (Oxford St) is some how selling millions in merchandise to people who only pay with briefcases of cash. \n(If the merchandise is actually taken away, it can be bought back for a tiny fraction of the value and “sold” again).\nThis would explain how a shop selling Nerdz can pay rent of $250,000+ per year.",
            "title_similarity": "0.5608678"
        },
        {
            "id": "i0jxzu1",
            "score": 1,
            "text": "Art is actually how a lot of money trade actually happens lol. Price of art is what the artist sets it as. Ever wonder how someone can draw a straight line and sell it for 250k - _-",
            "title_similarity": "0.6899532"
        },
        {
            "id": "i0jyda4",
            "score": 1,
            "text": "I feel the most unreported currently is video/mobile games with mtx stores.   \nMoney man: buys virtual currency  \nGame dev: gets money  \nGame dev: takes some of money minus taxes  gives rest to money man  \nNo physical goods or services need to be rendered. Any random audit would show \"x number of random obscure accounts purchased x dollars worth\"",
            "title_similarity": "0.5635363"
        },
        {
            "id": "i0jz9w5",
            "score": 1,
            "text": "A currently easy way is selling e-books.\n\nSay you have some accounts with illicit money, and you get some VISA gift cards or something with said funds. Fairly untraceable.\n\nThen you post a book containing some seemingly-relevant text on Smashwords or similar platform, for $10,000 per copy.\n\nBuy a few dozen copies with the VISA gift cards, and you now have most of it as legitimate income from book sales.",
            "title_similarity": "0.5137181"
        },
        {
            "id": "i0k0u10",
            "score": 1,
            "text": "Casinos!  I'd like someone ask me to launder at a casino. Would be fun!  Only fooling RCMP people, you know i'm too scared.",
            "title_similarity": "0.57723475"
        },
        {
            "id": "i0k0zr7",
            "score": 1,
            "text": "Merge dirty money with clean money and then do the accounting as though all of it is clean. Pay taxes. Done.\n\nOzark, the netflix series, paints a clear picture for cash businesses such as casinos.  The off-book dirty money is secretly placed in each table's cash drop lockbox to start each shift. At the end of a shift the money is counted and put on the books.  The launderers need to use some finesse in the percentage of dirty money added in that it should appear to be a reasonable volume increase over time.",
            "title_similarity": "0.611285"
        },
        {
            "id": "i0k1qsx",
            "score": 1,
            "text": "Okay.\n\nThere's a lot of details and it's not my specialty, considering I'm not enforcement, but art is useful to clean money between criminal agents.\n\nSo, let's say Criminal A wants to give money to Criminal B in regards to an illegitimate transaction.\n\nOne way to do it is to have Criminal A, probably through a shell company or an international account, buy from Criminal B or any related party, an art piece.\n\nArt being by nature of a volatile nature, comparatively to gold or real estate, Criminal A buys the Art Piece for $1M. It's actually worth $100k, but it will be difficult to demonstrate that. The idea is that, for the tax authorities, this money transfer seems to be in exchange of legitimate good, when it's actually 90% in exchange of illegitimate services \n\nSimilarly, you can use this property of Art, the fact it's value is unclear, to wash money at the end of an operation. So it is not the same than, let's say, a bar: the money got to be coming from somewhere relatively clean. This is a way to move clean money in regards of dirty business and still keeping it clean.\n\nNow, are you thinking \"What about NFTs?\"\nSame concept, cranked to eleven billion. Because if you can evaluate a reasonable value in a fair market a piece of art with the right experts, it is completely impossible with NFTs because there's still no historic on their value. So, when you see a crazy story about NFTs, remember that it may be crazy speculation of a deregulated market, but it's probably just crazy high-tech money laundering.",
            "title_similarity": "0.7269174"
        },
        {
            "id": "i0k1rhm",
            "score": 2,
            "text": "A lot of people have this dead on in explanation, but I'll also offer the additional idea which is where you own the entire supply chain and wash repeatedly to magnify the effect.\n\nOne company sells \"products/services\" to another company, and again, and again, of course marking each step up with a healthy profit. Of course every company is owned by the same person/people, but since each step is 'legit' it's a lot harder to follow the cash trail.",
            "title_similarity": "0.52386314"
        },
        {
            "id": "i0k1uvl",
            "score": 1,
            "text": "If I have $100,000 in cash from drug dealing I could put a piece of artwork that is worthless on sale in a gallery on consignment for $100,000.  Then buy it from the gallery as a secret buyer. The gallery banks the $100,000 and transfers me $90,000.  They just made $10,000 to launder my money, I just got $90,000 that I can now spend.  I drop some of this of speculation on a new bit of art to sell on consignment via the same means in a year's time.  People start questioning how I am driving a Ferrari and I am an art collector not a drug dealer.",
            "title_similarity": "0.6172625"
        },
        {
            "id": "i0k2fak",
            "score": 1,
            "text": "Money laundering is simply when “dirty money” (illegally gained or fake) is exchanged for actual money. \n\nI used to work in high end retail and it was not uncommon to see someone buy something of thousands of dollars of value in cash and then return it later (sometimes hours) at a different location. Which is why we had the policy if it was more than $750 we had to mail them a check (so there was a paper trail). But say they did it over abs over with items of $500 and the person taking the money didn’t check it (which was rarely done) that is money laundering. \n\nAny time business work in a lot of cash (especially if only cash) it is a red flag. Taking in actual money and then giving dirty money as change.",
            "title_similarity": "0.68019915"
        },
        {
            "id": "i0k2mwx",
            "score": 1,
            "text": "Owner of the bagel sandwich shop my wife worked in when she was pregnant with my son used to ring in \"bulk bagel sales.\"\n\nThey didn't sell bulk bagels...",
            "title_similarity": "0.33767283"
        },
        {
            "id": "i0k31bc",
            "score": 2,
            "text": "Your allowance is 20 bucks a week, but you start to make money by steeling candy from the grocery store.  Soon you have a lot of money and want to buy yourself a ps5, but mom will know you didn't get that much money from your allowance.  So you open a lemonade stand.  Maybe it makes 5 bucks a day, but you stuff 20 in there and say you had more sales than you really had. Now your money from steeling candy is being cleaned.  \n For the art store example, it's easy to make big ticket items to sell to a fake buyer since arts value is subjective.  So say you make a crayon drawing, and tell mom some guy at the lemonade stand liked it so much he gave you 100 bucks for it, and you slip a Benjamin into the cash box.  Maybe there was no guy, or maybe a guy really did buy it for a dollar.",
            "title_similarity": "0.47974753"
        },
        {
            "id": "i0k3464",
            "score": 1,
            "text": "The most common example in real life is a restaurant. Say you've got $100,000 worth of payments you want to get rid of on a monthly basis without getting caught by the IRS. So you open up a few deliberately crappy restaurants and pay a few guys to sit around pretending to work.\n\nNow you can give that money to the restaurants and they'll write it all into their books as some form of income: like meals sold and tips to wait staff. Then they deposit that money into the company bank account (owned by you ofc) and bam, suddenly that money is legit.\n\nNormally not producing anything real would be a huge tip off to investigators. Like a construction company that never builds anything or a factory that makes nothing. But a restaurant?  How can you prove nobody actually bought and ate that food? There's no evidence after all, right? People eat food and now it's gone. Unless you're going to pump the stomachs of every customer as soon as they leave, how can you tell they didn't just eat $700 worth of food?\n\nMake sense?",
            "title_similarity": "0.48345125"
        },
        {
            "id": "i0k3g9x",
            "score": 1,
            "text": "Legitimate casino, here the province runs the casinos, plenty of «wifes » of knows mobsters play each night tins of money and when they win, they always ask to be pay by chèques… it made the newspaper a few years back but it’s a casino, they won’t ask you were your money is from…",
            "title_similarity": "0.49654084"
        },
        {
            "id": "i0k4554",
            "score": 1,
            "text": "You're a criminal with crime money.  You use some non-crime money to honestly rent a storefront.  You put up signs that indicate the store is a barber shop, but you're never open.  Despite never being open, the 'business' reports an amount of cash income reasonable for a barber shop.  You take your crime money, which is paper cash, and pretend it's money people paid for haircuts.\n\nThat income is now legitimate non-crime money.",
            "title_similarity": "0.6569826"
        },
        {
            "id": "i0k48gz",
            "score": 1,
            "text": "Laundering = “laundry” = cleaning something dirty.\n\nIf you obtain money illegally, you’re sitting there holding a pile of illegal criminal money.\n\n**If you “spend” that money on something**..now the person who has the money has clean legal money that they obtained for a legal legitimate reason.  *They received the money for legitimate services/products!*  The money is now **clean**.  AKA, laundered.\n\nSo, you just set up your own legitimate business where you pretend that all the illegal cash came in legally.  That's why businesses that use cash and random untraceable transactions are used, like laundry shop, casino, or \"art dealer.\"",
            "title_similarity": "0.7608937"
        },
        {
            "id": "i0k4dog",
            "score": 5,
            "text": "So reading this - I've now learned that money laundering is really a cash based business.  However; what I'm sort of curious about is - the legal pot businesses.  They can only accept cash and prices are subjective for different (I don't know the correct term here is, sorry) blends / kinds....Couldn't I say that I have a kind that is vastly superior to anything else on the market...say I charge $40 for that when I'm actually just tossing out the same old stuff everyone else is.  Except I'm tossing the extra (I really don't know here, sorry again) $20 of illegally gotten money in per sale and really claiming profit?  \n\nThe legal weed thing just fascinates me as it's all just so new....the only thing I was aware of was the cheap ditch weed that some of my associates (in their youth mind you) used.",
            "title_similarity": "0.66214"
        },
        {
            "id": "i0k4h14",
            "score": 1,
            "text": "When you earn money from an illegal business, eventually you'll want to spend it on big ticket items or invest it. In order to do that, you need to put it in the bank, but to put it in the bank, you have to prove the money has a legitimate source. \n\nTo this end, a criminal decides they would rather pay taxes on their illegal earnings and increase their lifestyle, instead of burying the money in their backyard.\n\nSo they start a \"business\" that they put no effort into, stuff the money they earned from their crimes into the register, and tell the IRS that the business is the source of their cash. Their dirty money has been \"laundered\" because it now appears to be coming from a legitimate business.\n\nThe criminal is free to deposit the laundered money in the bank, and then use it to buy anything they want.",
            "title_similarity": "0.7308706"
        },
        {
            "id": "i0k4hok",
            "score": 1,
            "text": "Watch Ozark on Netflix. Great show that really shows how money laundering works, washing cash, etc.",
            "title_similarity": "0.6029878"
        },
        {
            "id": "i0k4kua",
            "score": 1,
            "text": "Isn't there a breaking bad scene which eli5?",
            "title_similarity": "0.49181652"
        },
        {
            "id": "i0k4lyz",
            "score": 1,
            "text": "How about a real world example?\n\nI grew up near a hot springs that turned out to be used as a money laundering scheme for drug sales. The hot spring was fully functional, you could go and by a day pass for about $20 per person, you could pay cash or card. That part of it was a totally legitimate business. However, the owners also had a side gig selling drugs, to launder their money they would come by sometimes, drop $100 that they got from the sales of drugs into the register, and they would log in there point of sale system that a (fictitious) group of 5 had come by and paid cash for a day pass. This concealed the sale of drugs by pretending it was just the sale of day passes to the hot springs.",
            "title_similarity": "0.5655179"
        },
        {
            "id": "i0k5x2h",
            "score": 1,
            "text": "Breaking Bad season 4 when Walt buys a car wash is a great example. It’s a legit business and while there were real customers, Skylar (his wife) is in an office punching in “sales” at a register to create real receipts that they could give to the bank to back up all of the cash deposits they are making, which of course is actually coming from drugs.",
            "title_similarity": "0.56169766"
        },
        {
            "id": "i0k63q1",
            "score": 1,
            "text": "I’d use another example;\n\nLet’s say armed robbers rob a bank and steal tens of millions in cash 💵 and escape, they can’t immediately cash the money into their account because they would look suspicious. So what they do is to employ the help of a betting company (or another type of company that handles huge transactions daily) , they then conspire with the betting company; they transfer all the stolen cash into the betting company the the betting company further transfers the money into the robbers’ account making it look like they won a huge lottery so as not to raise any flag and make the earnings look legitimate. So by receiving the stolen funds from the betting company disguised as lottery winnings they’ve laundered (cleaned) the illegal part of making the money away and made it look like it was earned through legal means (winning the lottery).",
            "title_similarity": "0.6660193"
        },
        {
            "id": "i0k65lw",
            "score": 1,
            "text": "Breaking Bad had a good example with the car wash. For every couple customers who came through she would write out a receipt for a non-existent customer and put the drug money for it in the register. On paper it just looks like a very popular car wash, and they will pay taxes on that fake income so the IRS isn’t likely to come snooping around. The lawyer in the show tried to get them to use a nail salon to do the same thing. This can be done with most businesses that usually have cash transactions.",
            "title_similarity": "0.5789921"
        },
        {
            "id": "i0k6eng",
            "score": 1,
            "text": "So basically, they steal some money (or otherwise get it illegally, like smuggling and selling drugs), and then they buy something high priced (like original art pieces), and then they resell the high priced items. It goes from being \"dirty\" money to \"clean\" money because they can explain it as just them being art dealers or whatever.",
            "title_similarity": "0.8527724"
        },
        {
            "id": "i0k6iq8",
            "score": 1,
            "text": "I'll just add that if you want to see what money laundering is like, watch the series called Ozark\n\nMarty Bird all the way",
            "title_similarity": "0.55103195"
        },
        {
            "id": "i0k7e8a",
            "score": 1,
            "text": "You simply exaggerate the amount of cash revenues. You say that a large number of people pay you in cash. Which is a large part of the reason that specific businesses are associated with money laundering. (Laundromats, mattress stores, car washes [lol]).",
            "title_similarity": "0.7825308"
        },
        {
            "id": "i0k7ph7",
            "score": 1,
            "text": "Let's say a high-visibility yet-shady real-estate developer - one who will soon inhabit the highest office in the land - buys a south Florida waterfront property for $40 million, and sells it to a Russian mobster two years later for $100 million cash, and then knocks down the building on the property.     Did the property magically increase 150% in value in those two years?    Of course not.     The $60 million difference is Russian mob money that is now laundered, with the help of said shady developer other shady operations like Duetsche Bank.    And this also explains why so many properties in Trump Tower are owned by Russian oligarchs (aka, mobsters).    The added crime here is why have these obvious money laundering schemes have never been prosecuted.    Could it be lots of politicians and law-enforcement people have been on the take for years?     Maybe Alvin Bragg has something to say ...",
            "title_similarity": "0.4811355"
        },
        {
            "id": "i0k8606",
            "score": 1,
            "text": "You're from out of town. You write a check. I cash it from my illegal cash. I deposit your legal check to my bank. Squeaky clean.",
            "title_similarity": "0.6480013"
        },
        {
            "id": "i0k8a9i",
            "score": 1,
            "text": "How do escorts “clear” their money?",
            "title_similarity": "0.6751735"
        },
        {
            "id": "i0k8drr",
            "score": 1,
            "text": "I feel like the best example of this was demonstrated in Breaking Bad. Skyler White basically logs car washes that never happened, and since they’re cash transactions, it’s hard to disprove.\n\nhttps://youtu.be/HTWPU0Ore_k",
            "title_similarity": "0.6420414"
        },
        {
            "id": "i0k8zqo",
            "score": 1,
            "text": "I bring a duffel bag of 10's and 20's, bundled in groups of $1000 with elastic bands to a British Columbia Casino. I play for a bit myself and then cash out with a Bank draft, or with my money returned to me in $100 bills, bundled the same way the bank does it.\n\nAlternatively, I lend that money to gambling addicts who own property in Vancouver. When they lose and can not pay, I kill one of their children, and tell the addict to sign their property over to me.\n\nSource: Willful Blindness by Sam Cooper",
            "title_similarity": "0.49883327"
        },
        {
            "id": "i0k9do8",
            "score": 1,
            "text": "Say I have $100 to clean - A customer pays me $10 for something, I would then log that purchase as being $20 ($10 from the customer + $10 from the dirty $100). I'd then do that for the next 9 customers and boom, that dirty $100 is now seen as being legal tender. The larger the amount or the faster it needs cleaning, the harder it is to stay discreet.",
            "title_similarity": "0.46689734"
        },
        {
            "id": "i0k9ind",
            "score": 1,
            "text": "Here are some good articles:\n\n[https://brettpodolsky.com/white-collar-crime/3-stages-of-money-laundering](https://brettpodolsky.com/white-collar-crime/3-stages-of-money-laundering) \n\n[https://www.moneylaundering.ca/public/law/3\\_stages\\_ML.php](https://www.moneylaundering.ca/public/law/3_stages_ML.php) \n\nLuxury Cars: [https://www.thestar.com/vancouver/2019/05/07/british-columbias-luxury-car-market-the-largest-in-north-america-is-being-used-to-launder-money-report.html](https://www.thestar.com/vancouver/2019/05/07/british-columbias-luxury-car-market-the-largest-in-north-america-is-being-used-to-launder-money-report.html)\n\nLuxury Real Estate: [https://themobmuseum.org/blog/chinese-triads-launder-billions-through-vancouver-buying-luxury-real-estate-cars/](https://themobmuseum.org/blog/chinese-triads-launder-billions-through-vancouver-buying-luxury-real-estate-cars/)",
            "title_similarity": "0.68366456"
        },
        {
            "id": "i0k9n8s",
            "score": 3,
            "text": "Is this Michael Bolton from Office Space?",
            "title_similarity": "0.47015443"
        },
        {
            "id": "i0k9q7z",
            "score": 1,
            "text": "I have a real life example, that someone I know did, but because you might be the IRS, I am keeping it to myself",
            "title_similarity": "0.5282258"
        },
        {
            "id": "i0k9wkc",
            "score": 1,
            "text": "There are a few small businesses in my area that offer a discount for cash purchases including a garage and a Chinese takeout. There's a chain carwash that makes debit inconvenient so you are better off bringing cash. I assumed it was because it's cheaper for them not dealing with banks but I've often wondered.",
            "title_similarity": "0.6247282"
        },
        {
            "id": "i0ka1c8",
            "score": 1,
            "text": "The first comment by *Kidpyro* is pretty on point, so I'll just quote that here and expand for you.\n\n>Let's say they sell a piece of art, they sold it for $100, on their accounts they write it as sold for $500. The other $400 could have been gained through illegal means.\n\n>But now they can explain how they obtained the money\n\nSo essentially when you launder money, you earn, *in this case* $100 in legitimate sales and you record $500 in gross income. Ergo, you don't pay tax on $100, you pay tax on $500. So you're not just making free money per se, as many people think, you are taking dirty money and recording it as legitimate business and then paying tax on it to make it clean.\n\nSo you pay your taxes on your $400 of dirty money and now it's legit. Just like you go to a laundromat and *pay* someone to make your dirty clothes clean, *money laundering* is specifically a process of falsifying business records to state that you have earned far more than you have, therefore you pay (taxes) to have your dirty money cleaned (laundered) and made legitimate.\n\nAnd this goes for any business where you can easily falsify sales/income rentals. Art is a great example because the price of art is highly subjective and it's easy to point at a piece and claim that it's equally valid to value it at $100 or $500. Typically however, money laundering is often through cash businesses such as barber shops, car washes, coin laundries etc.",
            "title_similarity": "0.5887774"
        },
        {
            "id": "i0ka97y",
            "score": 1,
            "text": "Here's a scenario at a casino:\n\n\nYou will be asked for ID anything over a 10,000 buy in or 10,000 cash out. So John gets three of his friends  to cash out 3 000 each , while John cashes out 1000. John then pays his three friends a $100 each for doing so. All the drug money is now laundered into the casino while John and his three friends get back 10k in chips . They then cash out and get a receipt for 10k (3k each and John with his 1k)\n\nExample 2\n\nJohn  cashes in at a blackjack table for 10 000. He bets one single 100$ bet and loses. He takes his chips and cashes out below the 10k threshold hold.\n\n\nNow these are seriously stupid individuals who at some point will.get caught. There are much smarter ways , but I hope this shows you the point.\n\n\nEdit: casino dealer/supervisor/pit  for a mix of 12 years, surveillance opealrater for 1 year , cash and cage personal for under a year , and slot tech for 1 year, all across the country.",
            "title_similarity": "0.4473714"
        },
        {
            "id": "i0kaeso",
            "score": 1,
            "text": "Watch Ozark on Netflix. \n\nLiterally an entire show about it...doesn't hurt that it's a great show.",
            "title_similarity": "0.29668367"
        },
        {
            "id": "i0kaknn",
            "score": 1,
            "text": "I’m the simplest of terms, you receive money illegally, not traceable means but then place that same money in a legal institution like investments or s bank. This gives the illusion that the money was earned legally with taxes being paid when they in fact haven’t.",
            "title_similarity": "0.6739917"
        },
        {
            "id": "i0kb32q",
            "score": 1,
            "text": "There are a few angles.\n\nThe reason the mob loved legal casinos so much was for this very reason- shit-tons of unaccounted for cash flowing in, which would be commingled with illegally obtained \"black market\" funds that were then available to use for white hat uses, having claimed they were proceeds from casino income. \n\nAnother example would be,  lets say you wanted to bribe or otherwise influence a foreign official, but everyone knows better than to deal in brown paper bags full of cash. His son is an 'artist', you buy one of his 'modern art' paintings for $500,000 and get your inlfluence that way. \n\nLets say that you needed to move $39,000 from your illegal operation in (Country X) to your friend in (Country Y). Have your friend sell you an 'internet domain name' he registered a few years ago and viola. Money, laundered.",
            "title_similarity": "0.6359864"
        },
        {
            "id": "i0kc257",
            "score": 1,
            "text": "Quite simple. Dirty money made elsewhere is combined with the clean money from daily operations of the art store. Total money comes out washed clean together with the legal money from the art gallery. I believe Saul Goodman explains it better.",
            "title_similarity": "0.5860331"
        },
        {
            "id": "i0kccqv",
            "score": 1,
            "text": "Money laundering hides where the money came from.\n\nBAD CRIMINALS: \"I would like to use this money to buy expensive things.\"\n\nGOVERNMENT: \"We've noticed you are spending a lot more money than you have reported earning on your tax returns. Where is this extra money coming from?:\n\nBAD CRIMINALS: \"Uhhhhhhhh\"\n\n\nMeanwhile, good criminals have a reason.\n\nGOVERNMENT: \"Where is this extra money coming from?\"\n\nGOOD CRIMINALS: \"I sold some art for a lot of money. Here are the receipts.\"\n\nTypically, the criminal gives someone else the money, and then the item is bought from the criminal using their own money. But now there's a paper trail showing a legal way in which the money was obtained",
            "title_similarity": "0.7548709"
        },
        {
            "id": "i0kco9a",
            "score": 1,
            "text": "Go watch breaking bad. You take money as cash for services that were never given. Now its taxable and placed in an account",
            "title_similarity": "0.67311347"
        },
        {
            "id": "i0kcogs",
            "score": 1,
            "text": "How does money laundering works with buying selling expensive art? I often hear people saying that someone is laundering money when they \"buy\" an expensive painting/art?",
            "title_similarity": "0.85020196"
        },
        {
            "id": "i0kcz51",
            "score": 1,
            "text": "In the show Ozark, marty hosts an REO Speedwagon show but asks the band to overcharge them. It leads to the funny moment where the guy calls his manager and says \"yeah, so they want us to help them launder money\".\n\nHow would this have worked?",
            "title_similarity": "0.5251434"
        },
        {
            "id": "i0kczqv",
            "score": 1,
            "text": "Let’s say you sell drugs and have a lot of cash.  You can’t put it in a bank, or buy a house with it… because the government would want to know where you got the money.  \n\nSo you need a legitimate way to have earned that money. So you start up a little cash business. Something small at first. Say a corner ice cream shop.  A business that deals in cash.  You actually open the store, and employ people there. You stock the shelves and everything.  But if you sell $100 worth of product, you claim you sold $1000 and put $900 of your drug money in the business account.  \n\nThis ice cream shop is, on paper, doing amazing… so you open another and another and funnel more of your cash through that business.  Maybe you even step it up and open a strip club, bar, or something else that would have more cash flowing in so it is less suspicious. \n\nSo you take your dirty money, and you make it clean through a legitimate business. You pay taxes on that revenue, and put it in your bank…. Now you can use it to buy whatever you want without any unanswerable questions. \n\nWith art, the most logical use would be buying artwork from someone at a way higher price than the value, to legally pay them for another illegal service.  Say your drug supplier is an art buyer/ seller.  He sells you 50lbs of cocaine, and a really nice framed artwork.  You buy the artwork only, and get the cocaine for free…. But it is a pricey piece of art.  That’s ok, because you have a very good income from your ice cream stores which do amazing, but never seem to have any customers.   \n\nOr, art can be used to transfer money from a money laundering business, to the person who wants some money laundered.  The idea here being a single business whose sole actual purpose is to launder money, needs a way to actually give back the money to the client. Client gives them 1mil to launder through their scam businesses, and they get to keep 20%.  They now need to give 800k back to the client…. Could be through art, property, or overpaying something else.",
            "title_similarity": "0.6009067"
        },
        {
            "id": "i0kdez3",
            "score": 1,
            "text": "Even if the business is unprofitable, the accounting should say it does and the profit (dirty money) should always overcome the loss of the business + extra so that money can be declared clean.\n\nI guess there's a movie about it, and it was a laundry shop that does money laundering (no pun intended).",
            "title_similarity": "0.7080704"
        },
        {
            "id": "i0kdgar",
            "score": 1,
            "text": "A carwash is an easy example.\n\nThe person laundering money may make only 10 dollars with the carwash, but then claim to have made 100 dollars. This allows them to claim 90 dollars of \"dirty\" money as \"clean\" money.\n\nThis is a very simple explanation, and there are many ways for agencies to detect discrepancies so most laundering schemes are much more elegant and elaborate. The best method is probably still unknown to most people.",
            "title_similarity": "0.49692184"
        },
        {
            "id": "i0ke1o6",
            "score": 1,
            "text": "I am not affirming, but a former Brazilian president (or any other corrupt politic, btw) could charge $100,000.00 for \"inspirational keynote speaking\". Who knows what does his gibberish cost? If you want to send money out to save for your future, just make international loans to your dictator friend's a.k.a. Cuba, African \"socialist\" countries, Venezuela and so, or build damns, airports, ports and roads abroad.",
            "title_similarity": "0.4821245"
        },
        {
            "id": "i0ke7bz",
            "score": 1,
            "text": "A bar I did bookkeeping for did \"check cashing.\" All sorts of deposits that were not declared as revenue, then they would just immediately withdraw the cash right out of the bank. Presumably to have cash available for check cashing, right?\n\nAlso a great way to deposit lots of checks payments (back when those were popular) and take all the money out without reporting it as income.",
            "title_similarity": "0.60957956"
        },
        {
            "id": "i0kema8",
            "score": 1,
            "text": "Our local bar changed hands and beer prices went down.  Unheard of, and a mystery, until it came out that the buyers were big time pot growers, and were laundering their cash through the bar.  After a few years, they defaulted on the note and disappeared.",
            "title_similarity": "0.5069245"
        },
        {
            "id": "i0keycf",
            "score": 1,
            "text": "Some will do it with dog breeding.\n\nFor example french bulldog sell for 3k each.\nSell some drugs say you sold a few dogs more than you did. You can have one litter and claim you had many.\n\nTake that extra that you supposedly sold and now you can claim it as clean income from selling dogs not drugs.",
            "title_similarity": "0.44553608"
        },
        {
            "id": "i0kf1rn",
            "score": 1,
            "text": "Nothing helpful to add here , just want to mention . Probably around the exact time of this post , I was wondering what money laundry  was exactly . My brain is kind of blown after stumbling upon this post 😅",
            "title_similarity": "0.60362154"
        },
        {
            "id": "i0kf2lp",
            "score": 1,
            "text": "Lots of answers but I don't think any of them are really clear.\n\nMoney Laundering is the practice of taking some amount of illegally-gained cash (think theft, drug sales, other illegal businesses, etc.) and making it appear to the rest of the world (government, banks, etc.) that the money is legitimate.\n\nThere are three parts: placement, layering, and integration.\n\nDuring \"placement\", you take your illegal money and put it into a legitimate business.\n\nUsually, this business is a \"front\", which is what the art storefront in your question would be. It's a business that typically operates exclusively or mostly in cash and who's *actual* performance beyond the till is very hard to gauge accurately. Some good examples include car washes, laundromats, restaurants, bars, and clubs. Places where most people just pay cash, and where the thing you did can be easily faked.\n\nSo let's say you have $1000 you need to make legit. You have a restaurant. So you \"serve\" 10 $100 plates to your \"good friends\", when the actual food only costs $1 per plate. They pay you with that illegal $1000. Now that money is \"placed\" into your business. It cost you $10 total, but that $1000 now looks like it was a legitimate earning from your business. Or at a car wash or laundromat, you could write fake receipts (ringing up \"ghosts\") for small transactions over and over, paying in the illegal cash. Since there's nothing really traceable going out (pennies of solvent/cleaner maybe), no one can really challenge the receipts.\n\nNext up is \"layering\". If your entire business was just these illegal transactions, it would become really obvious really quickly. So you have to \"layer\" the illegal money with *legitimate* money. In the restaurant example, you can't just exclusively serve the 100x markup plates to your friends; you have to have legitimate customers too, to help disguise the illegal cash.\n\nThe final step then, is integration. With your money layered, you take your sweet profit out of *the restaurant* rather than directly from the illegal operations. If anyone asks - for instance, the taxman when you file your taxes, this was all legitimate earnings from your restaurant, and you have the receipts! And this is where the \"cash-heavy\" business comes in. You have *fake* receipts, but no one can really confirm one way or another. No one can go trace a credit card or something to see that it's illegitimate.\n\nThus, you've laundered the money - made it \"clean\".\n\nNow a lot of this used to be a lot \"easier\", back in the eras where cash was king everywhere. Now, in the era of bank/credit cards/chequing accounts, it's harder and harder to launder money through \"cash-heavy\" businesses since there are so few of those left. So illegal accountants are starting to come up with new methods, for instance cryptocurrency, to do the same thing.",
            "title_similarity": "0.8480202"
        },
        {
            "id": "i0kf4pe",
            "score": 1,
            "text": "If you deal in a business that is primarily cash, you can lie about the cash, claim you got more of it from the business then you actually did, thus legitimizing the illegal additional income. Think car wash, laundry mat, strip club, taxi service, even restaurants.",
            "title_similarity": "0.7593241"
        },
        {
            "id": "i0kf5gl",
            "score": 1,
            "text": "Let's say:\n\nA. I have a ton of money from selling drugs \nB. I want to buy a house\n\n  The problem here is, I could buy dinners, small things but buying a house would raise income questions.\n\nTo solve this:\n\nA. Establish a cash business such as a moving or residential painting company.\nB. Create documents or a paper trail showing you did work that you actually never did put money in the bank and pay taxes just like a normal business \n\nThe trick is to really get creative depending on the amount of income you are trying to launder.\n\nNote: this is not me telling you to do anything illegal I'm only answering the question",
            "title_similarity": "0.66454816"
        },
        {
            "id": "i0kf9g6",
            "score": 1,
            "text": "Say you and your friends (5 people total) made $100k illicitly. You can’t go and deposit that in your bank account, and spend it, as the bank will want to know where it came from, and the revenue service/taxman will want to know if you paid taxes on it.\n\nSo you all decide to put together a 2500-people concert, suppose for a fancy band. Hire a band and everything, put 2500 tickets for sale “officially”, plus another 500 “off-the-counter”. These last 500,  you say you’ve sold them (for $200 each x 500 tickets = $100k), but you just threw them away and say “those people never showed up”.\n\nAt the end of the concert, you made this $100k “appear” legally, meaning you “cleaned it” (or, laundered). Now you each pay yourselves $20k each as promoters, as if you were contractors, and pay taxes legally on it, and it’s your money to go into your bank account, because if anyone asks, you got it from your “job” and paid taxes on it.",
            "title_similarity": "0.48573712"
        },
        {
            "id": "i0kfni8",
            "score": 1,
            "text": "Sell a million dollars of drugs.\n\nBuy Bitcoin with it.\n\nMake a stupid picture of a monkey and an NFT for it.\n\nSell the monkey for $1M to an anonymous buyer, but you are actually the anonymous buyer.",
            "title_similarity": "0.56774026"
        },
        {
            "id": "i0kfogz",
            "score": 1,
            "text": "Let's use your art store example, say i sell drugs enough were i can cover my cost and make a profit. But that money is not legal, so i cant invest or do much with it, so i ''clean it''. In this case i have a 3rd part come in with $10,000 for a piece i sell. The sale is registered and the money is taxed and after everything is said and done i have say $8,000. You say well you lost $2,000, but that is part of the cost of legalizing the income. Now i have a record of the income and tax records to back that up. I can invest this money, buy a house, buy a car whatever. The problem is it takes time to clean money and people get impatient and greedy and get caught",
            "title_similarity": "0.63751227"
        },
        {
            "id": "i0kfvu4",
            "score": 1,
            "text": "There's different kinds. \n\nHere's one, some guy owns some random ass painting, not really worth anything. Same guy just made $50,000 selling drugs in cash. \n\nGuy wants a way to make the deposit legal. Guy sets up some random auction for $50k and sells his own painting to some anonymous buyer, but really he just sold it to himself. \n\nNow the guy technically has 100k. The 50k he paid himself for the painting and the 50k painting he just randomly made worth 50k.",
            "title_similarity": "0.5955047"
        },
        {
            "id": "i0kg37z",
            "score": 1,
            "text": "Instead of art, let's say you're a drug dealer and own a hotel to launder money (this is still very common in some countries).  On paper you'll have every room fully booked, when in reality only 10% of your rooms have paying guests.  The other 90% of rooms, which are physically empty but booked in the reservation system, will get paid for with your drug money.  As soon as the hotel has the money, it becomes \"clean\".  In other words, your dirty drug money has been \"laundered\" and is now clean money.  Since you own the hotel, it hasn't cost you anything.  If you don't own the hotel, maybe you pay the hotel owner a 5% fee for their trouble.\n\nThis is literally what built cities like Las Vegas and Panama City.  \n\nIt's also why many hotels are now required to physically collect passports when you check in (so the authorities can audit booked rooms versus actual real customers).\n\nSimilar methods include taxi companies (big in Colombia), nail salons, auto body shops, used car dealerships, or any service based business.",
            "title_similarity": "0.55691564"
        },
        {
            "id": "i0kgg6e",
            "score": 1,
            "text": "ELI5 - Payrolls and real estate are common ways to launder money.\n\n* Payrolls -a business registers a bunch of phony employees or fake payrolls for real employees.  The \"dirty money\" has taxes paid and it appears to have a \"clean\" origin.  Due to the volume, the taxes paid are a drop in the bucket compared to the amount of money. Fake invoices for \"expenses\" and such can be added.  By the time law enforcement catches on, millions have been wired around.\n* Real Estate - between paying for real estate and all the fees, it's great to have a legit physical investment to hide behind.  Either buying a property outright with illegal funds, \"loaning\" money to a company (where the loan comes from a front company) to hide the source of the funds or paying more than the property s worth.\n\nThe end result is that \"dirty\" money comes out \"clean\" and now can be invested or wired to a legitimate bank.",
            "title_similarity": "0.69224596"
        },
        {
            "id": "i0kgov7",
            "score": 1,
            "text": "Breaking Bad had an excellent example of this. We are going to assume this is all done with cash, so nothing traceable like debit cards or services like CashApp. This is all about cash business.  At a car wash, who is to say how many car washes you did that day? You could say you did an extra 20 each day, and that is where this $400 came from. Even though it was drug money. It is easy to fake receipts. The only way you could get caught is if someone rats on you to law enforcement. And even then, they aren't going to move on you right away. They are going to watch you for an extended period of time, with video. Then they serve you with a search warrant after a few months and compare the days' receipts to the cars on the video. And even then, if you change a $20 receipt to a $40 receipt after the customer leaves, then it just gets harder. Who is to say that car didn't buy $50 of products and services, versus $20? If you are smart and don't get greedy, it is pretty easy. You just have to make sure you pay taxes on the laundered money. They normally get you for not paying taxes. Of course, a large criminal enterprise is going to need a lot of fronts for money laundering. Usually, if they feel that law enforcement is closing in on them, then the business will be destroyed in a mysterious fire that just so happens to destroy all records and evidence. They will cash in on the insurance policy and split.",
            "title_similarity": "0.5655144"
        },
        {
            "id": "i0kgsn4",
            "score": 1,
            "text": "Imagine that you grow weed. You produced something worth money basically out of cheap raw materials. If you spend a lot of that money on something like a house or a car the government will want to know where you got it. Because of this, you have to fake a way to show that you're making money. Services are easier to fake than gooods because there is no product to show. Have you seen all those nail salons that charge outrageous prices, never have customers, and never go out of business? It could be a front for a money laundering outfit. Same with massage parlors and dvd rental stores. \n\nFor more information, read the book \"The Laundrymen\".",
            "title_similarity": "0.6773439"
        },
        {
            "id": "i0kgsz0",
            "score": 1,
            "text": "Money laundering is taking illegally gained money and processing it so it appears to be money gained legally, and then taxed just like any other income.\n\nSay you need to explain where a million dollars came from that someone gave you to peddle influence in Washington DC. If you just put the million in the bank it would look suspicious and people might know you were doing illegal things.\n\nBut if you painted a bunch of amateur paintings and sold them through a completely legal blind auction you could buy the paintings for thousands of dollars each. This way you can show where the million dollars that you got came from.\n\nYou then pay taxes on it and treat it as if the money was all legitimate.\n\nBonus points if your father is President Trump and you have the White House assist in the sales of your artwork claiming it has nothing to do with influence peddling and that people just really like your artwork.",
            "title_similarity": "0.7802008"
        },
        {
            "id": "i0kh1e5",
            "score": 1,
            "text": "You wouldn't do it with art. Breaking Bad has by far the best depiction of money laundering in popular media. You're looking for high volume, highly likely to be cash transactions when you're money laundering. Think a doughnut shop. If you record some fake transactions and actually get rid of a doughnut+coffee for said fake transaction, who is to say that you actually had 10 customers instead of the 15 you recorded? Yes, it loses you money, but money laundering is about paying taxes on money making it clean. Not about keeping your efficiencies as high as possible.",
            "title_similarity": "0.6937765"
        },
        {
            "id": "i0kha1z",
            "score": 1,
            "text": "Say I have 10,000 dollars that I - ah - acquired somehow. I can't spend it without explaining how I got it. So, I give it to my good friend over there and tell him to take it to the art gallery down the street, (*which I just so happen to own*) and buy a specific painting for me. The art gallery now shows a sale in the amount of $10,000. Since it's my art gallery, it's now my money. I make sure the employee gets his/her commission for the sale, I pay taxes on the income, and at first glance, it looks legal. I know my very good friend won't squeal, because I cut him in on everything he helps me with.",
            "title_similarity": "0.56346273"
        },
        {
            "id": "i0khcnr",
            "score": 1,
            "text": "Sure. Say I sell drugs and I own a restaurant. My guy Al places a $5000 catering order with the restaurant.  The restaurant pretends to fill the order and pockets the cash. Now, yes, that's taxable income, but it's also income that can be spent without questions about where it came from.",
            "title_similarity": "0.5188314"
        },
        {
            "id": "i0khp11",
            "score": 1,
            "text": "Money laundering doesn't exist. It only happens to prevent money from being taken in the first place. \n\nYou can't steal from a thief.",
            "title_similarity": "0.53985226"
        },
        {
            "id": "i0khvrd",
            "score": 1,
            "text": "Suppose you sellin crack right…you sell me $1000 of crack. And you also bring me a sandwich. It’s a real good sandwich so I’ll pay you $1000 for the “sandwich” and get a receipt for “sandwich”. Now because I’m more interested in smoking crack I throw out the sandwich and just smoke the crack. But the government sees that you sold me a sandwich instead of crack.\n\nThat receipt accounts for my loss of $1000, and your gain of $1000. Bam money laundered and crack been sold.\n\nDon’t sell crack.",
            "title_similarity": "0.48759502"
        },
        {
            "id": "i0kim7n",
            "score": 1,
            "text": "It's called layering It's basically moving the money around until it's untraceable. They do this with large transactions like cars, art, money orders or even gift cards. By the time people realise it's dirty money the trail is too long to catch the perps.",
            "title_similarity": "0.71615946"
        },
        {
            "id": "i0kisip",
            "score": 1,
            "text": "You buy a painting for 20 dollars. The company write in the book that they sold it for 40 dollars. They report the 40 dollars to the irs and then can put that 40 dollars in the bank and pay taxes on it and not have people coming after them for depositing money without an origin. They deposited your 20 and 20 they got illegally. Now that they have it in the bank and paid taxes they can use it to buy stuff. You could just buy that stuff with cash but too much cash will get attention from the alphabet people.",
            "title_similarity": "0.6269407"
        },
        {
            "id": "i0kixkf",
            "score": 1,
            "text": "Just check out  Breaking Bad. The episodes where Walt buys and operates a carwash. This will give a better understanding of Laundering.",
            "title_similarity": "0.640369"
        },
        {
            "id": "i0kiyyw",
            "score": 1,
            "text": "So I make 500k selling drugs. If I go deposit this money in the bank I will have the feds at my door the next day. They will want to know where the money came from, why there's so much, and why I don't usually have deposits that big etc. \n\nOkay so instead I use my money to buy a 500k painting. This seller doesn't question where my money comes from. They have a receipt for a sale justifying the deposit and this will satisfy the feds. \n\nSo basically we're gonna do the same thing now. We sell the painting and now we have a legitimate reason to deposit 500k into our bank. \n\nThat's it, dirty hands clean money.\n\nI used to do this with cars in the 2000s. Don't ask 🤣",
            "title_similarity": "0.6133216"
        },
        {
            "id": "i0kjgqy",
            "score": 1,
            "text": "Buy something with cash that you want to launder, and sell via an online auction or similar.\n\nLeasing or rental of non-existent items, to a related company.\n\nBuying easily transferable /transportable assets like gold, diamonds, cryptocurrency, art, property.\n\nOne place where this a problem, is London, UK\n\nhttps://www.theguardian.com/business/2022/feb/17/london-laundromat-how-golden-visa-scheme-created-uk-haven-for-dirty-money",
            "title_similarity": "0.7450732"
        },
        {
            "id": "i0kjunq",
            "score": 1,
            "text": "Say the person who owns the store makes their **real** living doing crimes.\n\nThey can't spend that money directly, because the IRS will ask \"Where did all this money come from? We want our taxes!\" and the only legitimate income they'll have will be an art business that doesn't make nearly enough to explain it. He'll get locked up for the crimes he committed if he confesses, or for tax evasion if he doesn't. Either way, not good.\n\nThe solution? To somehow make that money look like it came from his legitimate art business. So, he fudges the sale price of one painting by making his receipt show it was purchased for $50 more than it really was, then puts $50 of his dirty crime money into his business's ledger and cash register.\n\nBoom! He has now taken $50 he couldn't spend without risking legal trouble, and turned it into $50 of taxable, legally sourced income. If he repeats this daily, he'll have an extra $18,250 in spendable income. If he opens a new art gallery, he can double his output, and so on.\n\nIt is a risky thing to do, since there are still ways to identify flagrant laundering (especially if you're laundering too much too quickly), but it's certainly less risky than spending the dirty money directly.\n\nTl;Dr Criminals lie on the income reports/receipts/etc of their legitimate businesses so they can sneak some of their dirty crime money into that business and make it look like legitimate, legally acquired revenue.",
            "title_similarity": "0.78552663"
        },
        {
            "id": "i0kk2mi",
            "score": 1,
            "text": "The premise behind money laundering and tax evasion is that you need to be able to prove where the money came from and that it was a legal source of income. Normally for you to gain money, somebody else has to lose an identical amount, whether that's a salary or a sale at your business.   \n\n\nBut with art, the value is entirely subjective and there is no objective way to value it. A car of a certain condition should sell for a certain amount with little variation involved in the price, if one was sold way over that price and this occured enough times, that could become evidence of tax evasion. But a unique picture of a cat eating donut? Who can possibly say how much that SHOULD be sold for?  \n\n\nSo you buy a cheap piece of art, then 'sell' it someone who needs to give you that illegal income. That income has now become legal. The best part? If that worthless piece of art keeps being traded between people as part of a money laundering scheme, it eventually gains a transactions history that 'proves' it's worth that much and could potentially be sold for a high value at some point.",
            "title_similarity": "0.7332406"
        },
        {
            "id": "i0kk8mp",
            "score": 1,
            "text": "Criminals have a lot of cash they've gained through illegal means. However, if they try to spend a large amount of it the government will want to know where it came from.\n\nThey therefore set up a business they can pretend they earned the money through. For instance, they may set up a store that sells art for cash. They then either lie about how much they charged for the art or about how many pieces of art they sold, making it look like the business made a lot more money than it did.\n\nSince art supplies are difficult to track and the value of art is difficult to judge, the government cannot say for sure whether they actually earned that money through selling art or illegal means. This allows them to spend their money in any way they want without raising questions.\n\nParticularly large criminal organisations will then put that money into a bank as profit of that art store - along with many other fronts such as bars, laundromats or barbers. They then spend it legitimately in several other businesses they control to make it difficult for the government to track where the money came from and where it's going.\n\nThis is also often used by the wealthy as a way of avoiding tax. If they buy a painting for $100 but records show it was $500, they can then donate it to charity, saving $500 in tax by spending $100.",
            "title_similarity": "0.7921382"
        },
        {
            "id": "i0kknf3",
            "score": 1,
            "text": "So there are many ways to do money laundering.\n\nThe broad definition is “Moving money around as a means of hiding it”.\n\nHere are some examples:\n\nPurchasing an expensive item with dirty cash, then selling it to provide a paper trail for the remainder.\n\nLying about how much your company made. You can say you made way more than you actually made, hiding dirty money in the profit margins of a company.\n\nDonating a piece of art you bought at a cheap price, but then having an art museum appraise it far higher as a “Newly discovered genius”. Now you just technically donated 5 million dollars worth of property, which you can write off on your taxes, even though you may have paid much less. In classic rich people fashion, this is pretty much legal.",
            "title_similarity": "0.7685273"
        },
        {
            "id": "i0kkv97",
            "score": 1,
            "text": "Any service or speculative purchase can be used to clean money. The goal is to take undocumented money and document it without disclosing where the money came from. \n\nUsually it’s cash deposits. Because there is no transaction record. High volume services ( massage, strip clubs, laundromats, gambling, barbershops, etc.) inflated costs, consulting fees, construction, art, investments, property development. \n\nWatch the Ozarks for an enjoyable look at a variety of money laundering ideas.",
            "title_similarity": "0.7032943"
        },
        {
            "id": "i0klxl3",
            "score": 1,
            "text": "Say you want to get paid $1m for delivery of cocaine by a mob boss\n\n1. He pays you in Ethereum (400 $ETH) to go outside the financial system\n\nNow you have 400 $ETH in an anon wallet nobody knows is yours maybe from a mob boss\n\n2. Next thing you do is send the $ETH to a mixer that splits it up, mixes it with other $ETH and sends it to another wallet that is not registered to anyone\n\nNow you have 400 $ETH in an anon wallet and no one can pin down where it came from\n\n3. The next thing you do it list a bunch of NFTs (jpegs) in your name and sell them to the anonymous wallet (you, but no one knows that).\n\nNow you have 400 $ETH that were entirely the product of your artistic talents.",
            "title_similarity": "0.6504609"
        },
        {
            "id": "i0km88q",
            "score": 1,
            "text": "I used to DJ at a bar back in the early 1990s. They had a Thursday night special, a 32oz beer for $1. When you watched them ring it in, it rang for $6. \n\nThat bar also had a back room where they sold cocaine. \n\nThe bar covered their cost on the beer, and brought in $5 to be \"legal\" money.\n\nThis bar would have 500-800 people in it every Thursday, each probably drinking 2-5 beers. They could easily launder $5000-20,000 per night.",
            "title_similarity": "0.3648562"
        },
        {
            "id": "i0kmeyh",
            "score": 1,
            "text": "Foreign money is laundered into US bank accounts via real estate. Properties are selling for way over value.",
            "title_similarity": "0.7336495"
        },
        {
            "id": "i0kmus0",
            "score": 1,
            "text": "Breaking bad did the best at explaining it through the car wash. \n\nI run a car wash I want to use to launder money, it is fully operational and anyone can go to it and have their car washed. I also ring up car washes that never  happened and pay for it using the money I want to launder, thus making a transaction history of the Money coming into my possession. \n\nThe extent I go to cover this can vary, if somebody where to look they could audit how much raw materials such as soap I ordered and see if there was a gross mismatch. This is why the perfect method is something service based with no materials to consume and account for.",
            "title_similarity": "0.567197"
        },
        {
            "id": "i0kn04z",
            "score": 1,
            "text": "You have money that you made selling drugs. You also have a restaurant that charges a cover fee. You tell the government that 300 people came into your bar when only 200 did. You can now explain where 100 of your suspicious $5 bills came from. Lots of other more complex ways to do it but there’s one",
            "title_similarity": "0.51919764"
        },
        {
            "id": "i0kntpq",
            "score": 1,
            "text": "Let's say if you have a lot of crypto, but you don't want to cash out, because you will have to pay taxes on it. \n\nSo you see that your friend is really really into nfts, and they are terrible. But you have a business idea that will help both people. \n\nSo you decided to bid higher and higher on this nft. And you have had this crypto when it was pennies, but now it is worth a lot. \n\nIn exchange for this, the artist with the nft will start creating actual terrible artwork that people want to buy. Because said artist sold an nft for the most amount of money ever. Oh, in exchange for this the artist will start promoting your wacky business model. \n\nI did a terrible job at this. Sorry.",
            "title_similarity": "0.6802583"
        },
        {
            "id": "i0knz5h",
            "score": 1,
            "text": "It's simple - imagine if you had a store that sold art, but instead of selling the art to make money, you used the art to launder money. In other words, you'd buy the art with dirty money, and then sell it for clean money. This is how money laundering works - it's basically a way to hide or disguise illegal money as legal money.",
            "title_similarity": "0.89279324"
        },
        {
            "id": "i0koexv",
            "score": 1,
            "text": "Do you work at Innotech?",
            "title_similarity": "0.392678"
        },
        {
            "id": "i0koibm",
            "score": 1,
            "text": "another way to do this is buy something and then resell it. Yachts, for example... order one, get it paid for and then resell shortly afterwards for a \"bargain\" price. Or get a car and get it restored, paid for in cash and then resell. All that money is now clean. \n\nLots harder in a society that doesn't really use cash, which is one of the reasons why Sweden is pushing away from physical money. Also: €500 notes are no longer being printed, partly to make carrying large sums harder.",
            "title_similarity": "0.6038712"
        },
        {
            "id": "i0kpjgp",
            "score": 1,
            "text": "If I explain exactly how to do it, will you promise not to?",
            "title_similarity": "0.3078611"
        },
        {
            "id": "i0kpzxj",
            "score": 6,
            "text": "First, to understand money laundering, people need to know that most money laundering is done not by top criminals, but rather street and middle level criminals. And having a big account is just *one* of the means one can use to live a more expensive life. \n\nThe easiest one is to simply use cash for everyday transactions and if needed, even pay people to pay bills in your behalf. Grocery store? Paid in cash. Gas? Paid in cash. Rent? Paid in cash. Since there are a lot of tech averse people and old people that are consistently scammed, there is plausible reason to pay a lot of bills in cash. I remember a time me and my colleagues/room mates paid our 6 dorm house rent with cash because that was the due date of payment and we were in a mistrust issue. The estate agents simply accepted it despite being around $2500 and asked us zero questions and no police/income agents have visited the house for it. As most criminals gain their money through cash, they can simply pay most of their bills with cash and that is it. \n\nThe second one is through construction/house selling/house repairs. Buy some piece of land with bank transaction to not trigger obvious alarms, and hire people for building/repairing a house, and pay all their daily fees/materials through cash. In most cases they need to disclose minimum information about their clients (on day X we received Y money in cash from John Doe Smith. We have no fucking idea what is his ID, his social security number, etc) and even if they do, the income agency does not have the means to cross-check the information in every case. Some years pass and boom, a small house is built. Some extra years pass and boom, the small house has become a 2-story house. In most places, property tax is done by a municipality and they care little about tagging you as a suspect for federal income agents as long as you pay the fucking property tax. Even if they do, the federal agency has tons of suspicious \"new\" or \"improved\" houses to audit and they need to physically audit your house to charge you on tax evasion, which of couse takes time for driving, taking pictures, etc to prove that the big house is indeed big and above the means of the owner ; they can't audit every single house in the country that has been built or repaired or improved. Depending on jurisdiction, they need a warrant for physically entering the property to take pics that prove their case; nowadays this can be bypassed with drone pictures but not only is tge tech relatively new and not fully incorporated but also potentially liable for class lawsuits as it is in a blurred line of \"easiest option we have\" and \"indiscriminate spying on own citizen\" ; some countries don't even allow Google Street Maps to operate under the idea of expected privacy.\n\nThird, do sequential mortgages/loans and pay in cash. Buy a old used car in cash (not that triggering), use it as collateral for a loan for a bigger car, which you'll pay in cash monthly until you liquidate it. Use the bigger car (now paid) as a collateral for another car ;  your girlfriend/wife **needs** a car too, right? With two cars now and no debts, shouldn't be hard to sell cars and use the money to pay part of loan outright or use them as collateral to get a mortgage for a nice house (which, again, you are paying monthly in cash). Now you are living in a 300-400 sqm house, even though mortgage will only be paid in 15-30 years and you are theoretically a bartender in a dirty pub.\n\nFourth, own a business in downtown that you can cook the books. Car washing, parking lot, restaurant, pub, it doesn't matter. Schedule with your romantic partner a week day where you won't do your crime work and you'll help her instead and be sure that regular employees don't see anything near the cashier ; use this day to cook the books and put some extra money on the business, make fake receipts, etc. A business that rolls legitimately 2000 a week can certainly have some **lucky days* where they have extra clients and rolled $1000 extra. Do it three times a month and you made $3000 extra per month and thus $36,000 money laundered per year. After a time, roll an extra business and you are laundering $72000 per year. This, as long as paying most bills in cash only, means that you are perfectly able to have upper quartile income without triggering major flags. Of course, why throwing extra pizzas to the trash and throwing materials away and charging full prices of your employees if they want to buy your goods/services? You need at least some extra stuff to cook receipts anyway, why not making some giveaways to employees? Happy employees that are paid a bit extra and that receive giveaways are unlikely to report you for suspicious activity if they only saw a sliver of \"weird business model\" and unlikely to quit on the own.\n\nFifty, pay insurances in cash and get paid on some eventually. Simple chance already makes that some insurance can get paid for car robbing for example. The monthly payments were paid with dirty money but the premium paid by the insurance company is totally legit. Of course, some criminals find ways to fraud insurance.\n\nIt's only when a criminal is rolling too much money and had no prior belongings that money laundering starts having exquisite/creative ways. Most money laundering is done by criminals who don't earn that much from criminal activities and can simply reschedule their life to make regular payment in cash instead of trying to have a super big account full of legit money which can pay a full vacation on Ibiza beaches.",
            "title_similarity": "0.654602"
        },
        {
            "id": "i0kqcjq",
            "score": 1,
            "text": "Lets say you make a shit ton of fentanyl in China then you transport it and sell it in North America.  Because people's lives are so shitty they buy A LOT of fentanyl laced drugs to feel better about feeling bad even though everyone tells you how great their country is.  The problem is tractor trailers filled with $20 bills are very hard to ship back to China.  But China needs cash in China to make more Fentanyl and buy women and guns and other small dick energy things.  So when some rich Asian guy wants to come to North America to gamble or immigrate because some gang he fucked over wants to slowly kill him with machetes he needs to move money.  So he contacts an underground bank that gives his money to the Fentanyl guys in China in exchange for picking up those twenties (Which have been changed into bigger denominations at casinos etc.) for 60 to 80 cents on the dollar in North America.  Now he can take that illegal drug money and donate it to politicians to keep immigration and money laundering policies at Casinos lenient and also buy a few homes and totally fuck up the real estate market.    Rinse and repeat for Mexico bad guys, Iranian bad guys etc etc. Just one example...you can substitute Guns, sex workers and so on for the drugs and other cash businesses for the Casinos.",
            "title_similarity": "0.55657744"
        },
        {
            "id": "i0kqdsk",
            "score": 1,
            "text": "Lawyers do it all the time using their mandatory trust account.\n\nClient does crime. Gets paid cash. Hires lawyer who deposits cash in trust account. Voila - clean cash.\n\nYes, over 10k in cash gets reported to the IRS, but it’s NOT income. A trust account only holds client property. Bam.",
            "title_similarity": "0.5978937"
        },
        {
            "id": "i0kqfjt",
            "score": 1,
            "text": "I feel like most of these replies explain how to launder money, but don't get into the ELI5 why you launder money.\n\nImagine you're a bad guy that sells a million dollars worth of drugs. You don't have a day job. You want to buy a big house and fancy car. Spend your million dollars. But if you spend your million dollars, everyone wonders where that loser without a job got a million dollars to spend on a fancy car and big house. IRS also a little curious. So, you set up a con to explain where your million dollars comes from... a cash heavy business. Restaurant, laundromat, antiques, art... Now you can take the illegal dollars you earned selling drugs and deposit it into your bank account and say it's from selling sandwiches or whatnot. You don't have to actually sell a single sandwich as long as on paper you say all your money came from\n sandwiches. Which is hard to disprove. \n\nSo now you are a legitimate business man spending your sandwich (drug) money.",
            "title_similarity": "0.66897887"
        },
        {
            "id": "i0ks7sa",
            "score": 1,
            "text": "An art gallery is not always a very profitable business. But if you have a pile of cash at home from selling drugs, you can be your own customer and buy art from your own art gallery. You pretend that your art gallery is successful and people just love your art. In reality, you are just buying all the art yourself. Now if you want to buy a house or an expensive car, it won’t be suspicious that some poor person can afford such expensive things. The bank and the IRS will just assume that you’re a successful artist who makes money selling art.",
            "title_similarity": "0.75355554"
        },
        {
            "id": "i0ksdw4",
            "score": 1,
            "text": "I make an extreme amount of money. Something unfathomable for someone to make in a year. \n\nWhat can I buy that won't lose value fast? I can buy a bugatti but the dealer will want to know how I made that money? \nI could buy an apartment, but a lot of them don't accept cash anymore. \n\nSo what do I do? I start a small business, use only cash, and play the books over the year to say I made 1/10th of the real money I made. I do this 10 times. Then I hire a good lawyer to write off all of my expenses as deductable so I pay almost nothing in taxes.",
            "title_similarity": "0.48953107"
        },
        {
            "id": "i0ktgzh",
            "score": 1,
            "text": "Are you a cop? You’d have to tell us if you were",
            "title_similarity": "0.45979282"
        },
        {
            "id": "i0ktkk1",
            "score": 1,
            "text": "Its all about getting the dirty cash into the banking system. Simplest example I can give is lets say Dealer has $2,000 cash of drug money and they need to pay their bills. Give the $2,000 to a bar (cash intensive business) and they report it as income. The bar sends Dealer $2,000 for some made up expense. Ultimately you lose a % due to taxes or \"fees\" paid to your partner business. There are other ways to launder money that have less overhead, but ultimately paying the taxes on the money makes it nearly impossible to tell its not legit. Larger volumes of money require more complicated schemes, but they all share the same components. Get the money into the system, move it around, extract the money.\n\nYou mentioned art in the OP which works differently. Art is subjective in price/value. Let's say a piece is worth $20k and I owe you $30k for drugs or some other illicit deal. I buy the art from you for $50k and effectively transfer you the owed value. Because the value is subjective its hard to say the art isn't worth that $50k. Trade based money laundering works on the same principal. Sell a cargo load of jeans or either half or double it's actual value and you can transfer illicit funds mixed into a seemingly legitimate transaction.",
            "title_similarity": "0.6403841"
        },
        {
            "id": "i0ktouq",
            "score": 3,
            "text": "We have 35 new rocket car washes being built in my town. It screams money laundering to me every time I see it, and I see it all the time because they’re EVERYWHERE!  Thanks breaking bad.",
            "title_similarity": "0.3922325"
        },
        {
            "id": "i0ktv0k",
            "score": 1,
            "text": "Let's say you own a business... a car wash perhaps. Lets say you also have a bunch of cash you need to be able to launder, let's say from meth sales. Take the cash to the business, and ring up a bunch of car washes. Put the cash you brought into the till, toss out the \"customer\" part of the receipt. Now you have a paper trail of how you legally received the money. Pay your taxes. Boom.\n\nhttps://youtu.be/RhsUHDJ0BFM\n\nhttps://youtu.be/HTWPU0Ore_k\n\nhttps://youtu.be/3eDnKct5XAw",
            "title_similarity": "0.6499462"
        },
        {
            "id": "i0ku2vj",
            "score": 5,
            "text": "Money laundering is simply how to take money that was earned through illegal activity and turn it into money that is seen as earned through legal activity.\n\nIn geberal, how much money you have access to is tracked. As a tax paying individual, how much money you have and how much you can spend is known within a general range. If you report that you earn 2000 a month, all of a sudden buying a 2 million dollar house is going to raise eyebrows if the police is, say, looking for someone whole stole a lot of money recently or if they are looking for drug activity. \n\nSo as the bad guy, you want to make your huge amount of illegal money explainable in a way that is legal. The best way is to start small. Open a small business like a laundromat or a dry cleaner, or a pizza store. Add your illegal money to the stores earnings slowly so it appears to be part of your business doing well. Once you've shown in your taxes that you are doing pretty good for yourself then you can launder larger amounts of money. \n\nThis is when bigger ticket items like art and real-estate come into the picture. When you have a good excuse to have a lot of money, now you can clean dirty money through expensive things and appear legit. Spend dirty money to acquire art and land. Then sell it. Sometimes at a loss. This gives that money a reason to exist.",
            "title_similarity": "0.70086133"
        },
        {
            "id": "i0kud22",
            "score": 1,
            "text": "Step 1: Engage in corrupt behavior\n\n[Step 2: Receive payment through a pretext like auctioning your amateur watercolors for $500k each.](https://www.desmoinesregister.com/story/opinion/columnists/iowa-view/2021/07/19/hunter-biden-art-sales-reveal-white-house-ethics-problems/7992741002/)",
            "title_similarity": "0.6076541"
        },
        {
            "id": "i0kul02",
            "score": 1,
            "text": "Let the fine lads of Better Call Saul walk you through the finer points of money laundering with this [video.](https://youtu.be/RhsUHDJ0BFM)",
            "title_similarity": "0.66065174"
        },
        {
            "id": "i0kum8g",
            "score": 1,
            "text": "It’s a thing that you do when through your illegal activities you have more money than you can ever spend on your day to day expenses in cash, and you may as well lie about how you earned it so you can pay taxes on it and use it to make legitimate purchases of property and investments to build generational wealth.",
            "title_similarity": "0.7279874"
        },
        {
            "id": "i0kv6ok",
            "score": 1,
            "text": "It’s the placement, layering and integration of funds from an illegal activity. So let’s say you are a run-of-the-mill drug dealer…you sell your drugs and have $25,000 in cash. You now take the cash (dirty money - proceeds of crime) and deposit it into your bank account (placement). You then decide to transfer those funds to your bank account at another financial institution (layering). Then once the funds are in that account, you request a draft to go buy a new car (integration). That’s one of the easiest explanations of how it works. A storefront that sells art but is actually ML - it could be dozens of things. The art store could be a front for another operation, the art could have been purchased with illegal funds, etc.",
            "title_similarity": "0.7080582"
        },
        {
            "id": "i0kvi48",
            "score": 1,
            "text": "Money laundering is the act of taking illegally made money and making it look like it was legally made.\n\nE.g. if you sold $100,000 worth of drugs, you can't exactly deposit it without your bank asking questions. Very unlikely for someone to suddenly get that money without it coming from crime/corruption. \n\nNow if you secretly gave the 100k to a rich friend of yours, then sold them a canvas you've painted on for 100k - on paper your money is legally obtained. You now have a legitimate reason for 100k entering your bank account.\n\nWhat's happening is the origin of the funds is obscured through layers of transactions, all to mislead banks and government authorities from tracing the real origin of the funds.",
            "title_similarity": "0.72112656"
        },
        {
            "id": "i0kw6m9",
            "score": 1,
            "text": "You know NFT? NFT is money laundering.",
            "title_similarity": "0.8200154"
        },
        {
            "id": "i0kw8ve",
            "score": 1,
            "text": "Example from lawyers : client brings in a pile of money as a down payment on some real estate and needs the lawyer to place the funds in a trust account until the deal goes through.  The lawyer deposits the money and credits the trust account.  The deal, of course, fails and the client needs their money back. The lawyer issues the client a cheque from the firm's trust account:  voila! Dirty cash has now been converted into one of the most trustworthy financial instruments. The client can take that trust account cheque to anyone without raising suspicion.\n\nThis is why the cash economy has been choked off as much as possible by the powers that be : it's much harder to launder money when it isn't cash.",
            "title_similarity": "0.7127608"
        },
        {
            "id": "i0kwila",
            "score": 1,
            "text": "I own the shop.\n\nI have dirty cash from illegal activity.\n\nI give the cash to someone and ask them to come my shop to buy something with really high margins for me. Like overpriced bottled water or something.\n\nThey buy the water. After all the proper taxes and whatever are paid for, I am left with clean cash from legitimate business activity mixed with cleaned cash from illegal activity. It is really, almost impossibly difficult trying to tell each cleaned and clean dollar apart from each other. It is possible with some high level forensic accounting, however you'd need to be able to figure out the amount of cash cleaned.\n\nBest laundering front is a business that is otherwise also legitimately successful.",
            "title_similarity": "0.70930743"
        },
        {
            "id": "i0kwq8n",
            "score": 1,
            "text": "Art laundering is one of more complicated but really all laundering is at its core the same. Pretending like profit from \"criminal/illicit\" activitys. Is part of your regular business. \n\nBecause if you only make 60k a year and live in million dollar mansion irs will have some questions. The basic concept is this you 20 things you pretend like 25. You charge 4 dollars pretend like you were paid 5. You use \"illicit\" money to make up the difference.And now illicit money is considered regular income. \n\nWith art how its complicated is prices are subjective anonymously buy million dollar painting sell it to your business for 800k. Or paint it yourself have buddy \"buy\" it for 20k you give to him for free/steep discount but on paper your 20k richer. He can resell later date and make money himself. You can also bounce it around aka friend one buys for 10k second 20k third 30k you and first 2 friends are 10k richer on paper. While on paper he spent money if he got it for \"free\" or discount when he resells he will have more money just less on paper. \n\nThe multitude of schemes and scams with art is alot. The real trick is not getting greedy making it believable aka if you say you sell 200 pizzas and only buy ingredients for 100 then \"proof\" becomes apparent. \n\nWhich is why art is very good one as price is very subjective you get six seven figures for what most people think a blank canvas or \"stained\" canvas etc. With pizza place if it makes 100k you can't say oh we did 10 million in sales. The price just doesnt flux that much.",
            "title_similarity": "0.60645634"
        },
        {
            "id": "i0kwq9t",
            "score": 1,
            "text": "You need to explain where illegal money is coming from. You have a legitimate business on paper, say a car wash, and you start claiming cars are being washed which actually haven't. On paper this looks like legitimate income even though the reality of it is it is not.",
            "title_similarity": "0.6949024"
        },
        {
            "id": "i0kwv1i",
            "score": 1,
            "text": "In Breaking Bad, they ran a car wash to launder the money he received from selling drugs.  Between actual customers, they would ring up sales that never actually occurred, and pay for them with the drug money.  Now that it's on the books as a sale to a customer, they can deposit it in the car wash's bank accounts, and pay themselves a salary out of it.  If they are ever audited, they can show receipts for where the money came from. A prosecutor would have to prove that those transactions never occurred. \n\nArtwork is theoretically a good one, because there are no tangible assets to worry about.  With the car wash, if the FBI got access to their books, they would compare the amount of detergent used in a typical wash to the amount of detergent they purchase.  When their soap purchases are 1/10th the amount of a competing car wash, investigators would know that something was up. \n\nArtwork doesn't have an equivalent consumable to investigate, so theoretically, it's easier to launder money through an art dealer.",
            "title_similarity": "0.67238593"
        },
        {
            "id": "i0kx0c4",
            "score": 1,
            "text": "You have a lemonade stand where you sell lemonade for $1/glass. It's completely legitimate. You pay all of the appropriate taxes, and have the necessary certifications to legally sell lemonade. Your parents also sell meth, and have $100,000 in illegally obtained funds that they want to be able to spend without raising any red flags with the IRS or law enforcement. \n\nYou hire your parents as employees of the lemonade stand, and pay them a salary of $5,000 per week for 20 weeks. In return, they \"buy\" 5,000 cups of lemonade per week. Their illegal money is recorded as a cash sale which goes into the business account. The business account then pays their salary, takes out the appropriate taxes, and turns that illegally obtained, unaccounted for, tax-free money into a legitimate taxed salary with a paper trail.",
            "title_similarity": "0.34333825"
        },
        {
            "id": "i0kxj4y",
            "score": 1,
            "text": "The only thing that made me understand money laundering was the scene from breaking bad, when Skyler is ringing up customers for the car wash. Then after everybody leaves she starts talking to herself \"oh a deluxe car wash? Sure!\" and ringing through customers and putting cash from her pockets into the till. Even though there's nobody standing in front of her. \n\nI was like OOOOOOOHHHHHHHH that's how it works. You ever see a restaurant that's always dead but still in business? They're probably doing pretty well on the books. Lots of customers that don't exist coming through.",
            "title_similarity": "0.55516803"
        },
        {
            "id": "i0kxma5",
            "score": 1,
            "text": "The point of laundering money is making it appear clean.\n\nIf I earn $20,000 a month in some criminal enterprise, I can't put that in my ban account consistently without raising some red flags.  I need something that makes my money appear to cone from a legitimate source.  The Art store would sell paintings.  They may sell $1000 worth of paintings.  Since painting and the production of paintings wouldn't likely be tracked, I can say I sold $21,000 worth of paintings every month, and deposit the money with an explaination. \n\nI can also buy $1000 worth of paintings from the art store, but pay you in paper $21,000.  The Art store keeps $1000, I could then deposit 20k in my account.",
            "title_similarity": "0.60524684"
        },
        {
            "id": "i0kxumn",
            "score": 1,
            "text": "Someone bids ten times it's value, nobody argues, money changes hands as agreed upon before hand.",
            "title_similarity": "0.31774658"
        },
        {
            "id": "i0ky2hd",
            "score": 1,
            "text": "I can’t believe what a bunch of nerds we are, looking up ‘money laundering’ in a dictionary.",
            "title_similarity": "0.62845075"
        },
        {
            "id": "i0kyjof",
            "score": 1,
            "text": "The reason you need money laundering is the IRS, so if you work a normal job and make 50k a year, but you buy a million dollar house the IRS is going to want to know where you got the money because they want their cut. But let's say you have a business, like a laundry mat, the IRS isn't going to check on your month to month profits unless they seem sketchy or you don't pay your taxes, so paying your self let's say 20k profit a month, the IRS wouldn't question it, since they don't know how often or how much you charge for people watching clothes. Unless, you make 100k a month instead of 20k then they might do an audit. TLDR, you take big illegal money and turn it into small legal money ever month through a business.",
            "title_similarity": "0.5771115"
        },
        {
            "id": "i0kyn1f",
            "score": 1,
            "text": "Art is subjective making it hard to quantify that it is worth the amount people are paying. If I needed to explain $10k in cash, all I have to do is buy some canvasas and paint. Dispose of them and said they sold for a total of 10k.\nI can now claim it on my taxes. Without the above process I would not be able to claim it. Unclaimed money is illegal in most countries. It is how they got Al Capone.",
            "title_similarity": "0.6329103"
        },
        {
            "id": "i0kytu9",
            "score": 1,
            "text": "5 yesr olds should not be laundering money. \n\n\nSo a 5 year old has a lemonade stand. They sell 1 cup of lemonade for 1$ the entire day.\n\n\nBut in the books they sold 100 cups. For 100$\n\nThe person laundering the other 99$ generally pays a fee, and the taxes for the business and gets back say 60 cents on the dollar. The ill gotten gains are washed by the business and are now legal gains.",
            "title_similarity": "0.3855173"
        },
        {
            "id": "i0kz99n",
            "score": 1,
            "text": "I’m a chef. Say I’m making my money illegally by selling drugs on the side. I have 20,000 in dirty money. I can’t just go spending it on sprees, I can’t put it right into the bank, eventually the bank will look into my accounts and the gov’t will catch onto me and my assets and wonder where it’s come from and why I haven’t paid taxes on it. \n\nSo as a chef, I create a shell company. My company? I do caterings and cook the food. I get an actual DBA, my company on paper is legit. However, I don’t cook damn near anything. Maybe every once and awhile to keep up the facade. But now at my company I write fake invoices for jobs I’ve done.\n\nI cooked x food for Joe Schmoe, they paid x amount. I deposit the money, pay taxes on it. I keep filtering my money in this way, but keep up appearances for actual clients who may use their credit card so I’m not strictly a cash only business and raise flags. \n\nThat’s how I would do it, and I’m sure there are holes someone else could explain.",
            "title_similarity": "0.59683514"
        },
        {
            "id": "i0kzcga",
            "score": 1,
            "text": "Easy way to understand it. You have a garbage bag of cash. If you are audited, how are you going to explain where you got it? Open a store, buy stuff from your store with the cash, now you have receipts, cash flow, etc.\nYou have unreportable unexplainable money before, now you have reportable explainable money.",
            "title_similarity": "0.7464313"
        },
        {
            "id": "i0l03op",
            "score": 1,
            "text": "One of the methods used in Vancouver - called \"the Vancouver model\" utilized casinos.   As it was described in the eventual investigation, wealthy Chinese individuals would deposit money (Yaun) in China into the off shore bank accounts of Chinese gangsters operating in Vancouver.   They would then fly to Vancouver and the gangsters would repay their funds in Canadian dollars (taking a cut). This cash generally came from loan sharking, prostitution and drug trade, much of it fueling the Fentanyl crisis here in BC.    The wealthy individuals would go directly to a casino and exchange duffle bags of cash for chips.  They would make a few low value bets and then cash out their chips - having the funds deposited into a Canadian bank account.\n\nFor the wealthy Chinese billionaires, they got their money out of China avoiding currency export / import controls.  For the gangsters, they turned their illegally gained cash into deposits in a Chinese bank.\n\nIn the \"Layering\" phase they bought real estate in Vancouver with their \"winnings\" from the casino often without mortgage financing.  Then they put a mortgage on the property and recovered their cash through an equity take out.  The Gangsters also used the real estate market to bring the money back into Canada.",
            "title_similarity": "0.61080384"
        },
        {
            "id": "i0l08z9",
            "score": 2,
            "text": "start a business where many customers spend cash rather than use cards or electronic funds.\n\nstrip club, cheap restaurant, laundromat, car wash.\n\nThen let's say your business does $10,000 in legitimate business each month. you put an additional $5000 a month of illegal money (that you obtained from things like prostitution or drug dealing) into the business and pretend customers bought an extra $5000 a month in items in cash. if your restaurant has 1000 paying customers a month each spending $10, pretend you had 1500 customers. \n\nnow it looks like your business did 15k on business a month. you pay taxes on the full 15k and can now spend it legally.\n\nFwiw, the phrase 'money laundering' supposedly started from Al capone using laundromats to do this process.",
            "title_similarity": "0.4020196"
        },
        {
            "id": "i0l0bmv",
            "score": 1,
            "text": "Your first mistake is asking Reddit about money laundering. They think everything is money laundering.",
            "title_similarity": "0.7711446"
        },
        {
            "id": "i0l0l2r",
            "score": 1,
            "text": "\"What am I gonna do with 40 subscriptions to Vibe?\"",
            "title_similarity": "0.30909544"
        },
        {
            "id": "i0l0pl2",
            "score": 1,
            "text": "Money laundering? I can explain that in simple easy to understand terms. \n\nLet's say a group of rich people, and bankers all meet up in a room. And let's say they form something called, \"the federal reserve\". (Nothing federal about it, just like fed ex for example)\n\nAnd let's say they all agree to loan the American government money, at interest, as much as they want. And they get something called the \"federal reserve act\" passed in 1913 that nobody had time to read because Congress and or the Senate was either coming home from Christmas vacation, or waiting to go on vacation, and because the bill was so massive and so many pages, they couldn't possibly read it all in time, and a bunch of weak sad easily bribeable men passed such an act. \n\nAnd nobody except jfk had the balls to try to end it and let the actual government issue and print its own money. And we all know what happened to him, (and his brother)\n\nThat would be an example of money laundering.\n\nYou wanted to know.",
            "title_similarity": "0.5347067"
        },
        {
            "id": "i0l1g78",
            "score": 2,
            "text": "Hint hint those news that say a splash of red paint has been sold for 2.5 Million USD might be involving this. \n\nRed paint/canvas isn’t that expensive.",
            "title_similarity": "0.5080123"
        },
        {
            "id": "i0l1k4u",
            "score": 2,
            "text": "Money can’t just appear, that’s not possible for it to magically pop up in your possession. You need a reason for getting that money and now you need a reason for receiving that money and a system that can’t trace who deposited the money.  so you will be looking for places that take money in regularly from people like casino’s, laundromats, hotels and other places where there’s a lack strings leading back to the one who deposited it.",
            "title_similarity": "0.6659328"
        },
        {
            "id": "i0l1n4k",
            "score": 1,
            "text": "Suppose You have $1m of illegal cash lying in the tiles of your bathroom\nYou sell the painting for that amount, have an inward bank transaction from your customer and simultaneously handing him over the illegal cash say $0.9m keeping 1% cut",
            "title_similarity": "0.61704624"
        },
        {
            "id": "i0l1xhy",
            "score": 6,
            "text": "One day you start taking your dad's porn magazines to school, you sell them at like 2 dollars a pop. Your dad is an avid collector with a boxes full of them stashed away, so he's not noticing that you're taking them. You've started to save a fair bit of money from this so you decide you want to buy a new bike with the money. \n\nBut you realized something, won't your parents wonder where you got the money? You can't tell them what you are really doing cause you'll get in trouble. You aren't doing any work or making money from chores or anything and suddenly you've got enough money for a bike? You need to show them that you're a good boy and earned your money fair and square. \n\nYou get an idea that you'll start mowing some lawns for pocket money. You ask your parents if you can use the mower and they say yes. Now mowing lawns is hard work so you decide to fake it a little bit. You mow 1 lawn a day but say you did 3. You're only getting 10 bucks for the 1 lawn so you make up for the other 2 with your porn magazine money. \n\nOver a few weeks you've moved all your bad money through the lawn mowing business. You can now buy your bike because you earned it by being a good boy and your parents are so proud.",
            "title_similarity": "0.5313705"
        },
        {
            "id": "i0l1y0b",
            "score": 2,
            "text": "Let's say I make 1 million dollars selling crack. I want to spend it but the IRS will catch on. So I become an artist. I make a painting and sell it for 5 bucks. But I tell the IRS I sold it for 1 million and 5 bucks. I pay my taxes and now my money is clean to spend.\n\nArt makes it easy because there is no discernable difference between a 5 dollar piece of art and a 1 million dollar piece of art.",
            "title_similarity": "0.5665303"
        },
        {
            "id": "i0l250g",
            "score": 1,
            "text": "thanks for asking this question, i've always been curious myself. and i work at a bank and have taken a short course in AML (anti-money-laundering). but they dont actually explain what it is. and i even went on a first date with someone who works in AML and she couldnt explain it to me either. but the top level answer here makes it clear, so thanks OP!",
            "title_similarity": "0.52134913"
        },
        {
            "id": "i0l25gu",
            "score": 1,
            "text": "You go to a car dealer and buy a brand new car,fully loaded with all fancy stuff added. You pay cash for the car. A few days later, you bring the car back to the dealer, “unhappy” about the car. The dealer agrees to buy the car back but at the used car trade in price. Dealer gives you a check from their bank, clean money. Rinse and repeat. A dealer in San Jose ca was caught doing this.",
            "title_similarity": "0.5477395"
        },
        {
            "id": "i0l3b9k",
            "score": 3,
            "text": "Any buffet style restaurant.\nHow much food did you really put on the buffet line? Enough for \"lots\" of people.  At least that's what the books say.",
            "title_similarity": "0.31616646"
        },
        {
            "id": "i0l3yoh",
            "score": 1,
            "text": "Money gained from drug sales, is recorded as funding for finea art.\n\nBuying drugs is illegal, but spending $3.5M on a framed fart, is totally fucking fine. Culture etc.",
            "title_similarity": "0.64456975"
        },
        {
            "id": "i0l49xu",
            "score": 1,
            "text": "Okay, you’re playing Skyrim right? You steal some silver ingots from an npc. They’re still marked “stolen” and until you join the thieve’s guild, no merchant will buy them. What do you do? You melt them down at a forge and make jewelry with them, that’s what you do. Now they’re not stolen ingots, they’re a whole new item, they’re rings and necklaces, the person you robbed didn’t even have any jewelry in their house, and the “stolen” marker is gone now. You can sell that silver to anyone now, maybe even the person you stole from, because now, it’s clean.",
            "title_similarity": "0.5633008"
        },
        {
            "id": "i0l4aus",
            "score": 1,
            "text": "[Top 10 Money Laundering Schemes in Movies and TV Shows](https://www.youtube.com/watch?v=ijV50pOx_cw)",
            "title_similarity": "0.43785807"
        },
        {
            "id": "i0l4y4x",
            "score": 1,
            "text": "Read about Walter white on Wikipedia and practice screaming “I’m the one who knocks” to your toxic ex",
            "title_similarity": "0.42889625"
        },
        {
            "id": "i0l5jbj",
            "score": 2,
            "text": "One thing that a lot of commenters are missing is that money laundering has a cost associated with it. So oftentimes the laundering business operates at a loss or let's say you go to a casino in Macau and you lose some percent of the dirty money you put down. \n\nBut usually you're making that dirty money at such a high margin (e.g. drugs, financial crime, bribes etc.) that you don't care as long as you get like 70-80% of it cleaned.",
            "title_similarity": "0.62163687"
        },
        {
            "id": "i0l6w7v",
            "score": 4,
            "text": "So imagine that Timmy got $100 at school from his classmate Bob by selling, say, his playstation.\nNow Timmy could not possibly say to his parents that he got $100 by selling his playstation, they would be furious!\n\nInstead Timmy starts mowing the neighbors lawns for $5 each, and then each time he does it he takes $1 from his $100 and tells his parents he earned $6 from mowing lawns. The parents will think all of the $6 is \"clean\" and if Timmy repeats the process 100 times he has successfully cleaned all the money he got from selling his playstation.",
            "title_similarity": "0.3437882"
        },
        {
            "id": "i0l7eox",
            "score": 2,
            "text": "There are two goals when you launder: not be suspicious and pay taxes on your stolen money.\n\nFirst, you want a business that lets people buy things with cash. So you can mix in the \"stolen\" money with the real money and it doesn't look suspicious. \n\nSecond, you want to pay taxes on \"stolen\" money so you don't go to jail. There is a famous bad guy named Al Capone that stole a lot, but they never caught him in the act. But they could prove that he had millions of dollars and didn't pay taxes. So they put him in jail for not paying taxes. So, having a business lets you pay taxes on stolen money, so you can't go to jail for not paying taxes.",
            "title_similarity": "0.72931594"
        },
        {
            "id": "i0l7ghx",
            "score": 1,
            "text": "Second hand clothes are perfect for money laundering. Buy clothes in weight, sell in detail. You can sell one pound for 10$ or 1000$, whatever fits you.",
            "title_similarity": "0.51905817"
        },
        {
            "id": "i0l7i5n",
            "score": 39,
            "text": "People have the wrong idea about money. They tend to think if money can't be proven to be from illegal activities, it's totally fine. \n\nBut that's backwards. Money is assumed suspicious unless you can prove you got it legitimately. \n\nMost people never have to worry about that because their employer submits a statement that says \"yeah, I paid them X in 2021\" and the IRS says \"aight\" and it's never an issue. That's your W-2. Independent contractors know it can get a little more complicated than that, but they still have receipts which should add up to their total income for that year. \n\nIf things *don't* add up, you can't just say something like \"I found it\", there's actual laws for reporting \"found\" money officially. If you don't use them, it's tax fraud, and if you use them repeatedly for huge sums of money, well, it doesn't take a genius. \n\nThat's where money laundering comes into play. You're not actually doing anything to the money itself, you're falsifying a plausible \"backstory\" for how you got the money legitimately.",
            "title_similarity": "0.61510336"
        },
        {
            "id": "i0l8qic",
            "score": 2,
            "text": "The best ones are the Mexican restaurants in Indio and Inland Empire. Cartel run places with phantom 10 tops throughout the day always paid in cash. Hmmm",
            "title_similarity": "0.4038202"
        },
        {
            "id": "i0l9nwu",
            "score": 1,
            "text": "This is my speculation.   \n\nThe art shop accepts dirty money for the sale of a painting and is able to claim it’s an honest buck meanwhile the buyer resells it after their buddy appraises it.     \n\nIn the world of taxes, I imagine that you could make a donation for a charity in exchange for a painting or some shit then resell the painting quietly for cash. Write off the donation as part of your taxes. Keep your money and pay less overall. This is just a hypothetical and hasn’t been tested so idk",
            "title_similarity": "0.738118"
        },
        {
            "id": "i0la7yj",
            "score": 3,
            "text": "A little town I lived in had a random Mexican bakery in an abandoned strip mall, with Maybe a few cakes on display, never any customers… I always wondered about them",
            "title_similarity": "0.32707518"
        },
        {
            "id": "i0la8p8",
            "score": 1,
            "text": "Businesses with very little physical costs are good for laundering. Barber shops for example, usually only take cash and who knows if you did 10 cuts or 100 that day. No matter how many cuts you do, the fixed and variable costs remain fairly constant so really hard to prove that the money in the till isn’t legit",
            "title_similarity": "0.45500886"
        },
        {
            "id": "i0lb43m",
            "score": 2,
            "text": "Many years ago I went into a store that had a very eclectic inventory. I found a highly collectible graphic novel for half of its original price. At that point it regularly sell for around 1 1/2 times its original cost. It closed down after a major marijuana bust and I found out it was part of their money laundering operation, reporting sales at five+ times what they actually sold the stuff for. Turns out the guy I was buying weed from worked for the organization that was busted but was low level so the cops never came for him. Turns out he occasionally worked in the store.",
            "title_similarity": "0.5222234"
        },
        {
            "id": "i0lc781",
            "score": 1,
            "text": "Depends on how you gained the money and at what point the money becomes dirty. \n\nSay you don’t have the money yet. Say the money is clean now but the other party which officially is a legitimate business cannot give it  to you directly because that would attract scrutiny. \n\nSay you are a son of a very prominent politician. Let’s call you Gamekeeper B. You act as an intermediary between your powerful father and business interests both foreign and domestic. \n\nBusiness interests want favors from your father, father wants money for said favors, but if he meets them directly or accepts money from them, that would be easily noticed as he is so high up that he has permanent government funded security. So instead you meet with them and talk to them in his name, then talk to him and so on until a deal is made. You are not a politician, you can meet whoever you want and you are your father’s son, you can meet whim 1 on 1 whenever you want too and it stays legal.\n\nBut how do you get paid? Well, what if you started making shitty paintings and put them up for sale? They are worthless, they cost you zero money to make, but the people who know that they owe you money, they know how much they owe you and they just might show up to your sales gallery and spend hundreds of thousands with you to buy a painting. You see, art is subjective, people are allowed to spend whatever sum of money they want on any painting, even if it’s shit. So now the bribe is not a bribe, because legally the money belongs to a completely above board art sale.\n\nAnd it’s also perfectly legal for you to be managing you father’s personal finances, I mean, he is a high ranking politician so he is super busy. It’s also perfectly legal for you to simply give him stuff like pay for your father’s house renovation and generally just fund his well above his government pay lifestyle.\n\n\n(This is also why so many politicians write shitty books or get public speaking deals, corporate board seats or movie deals after they retire.)\n\nIf on the other hand you already have the money and you got it in secret, then you will run the store as normal, maybe even make some real sales and real profits, but while doing it you will be spending your legitimate money to buy new stock for your store, then get rid of it and put (much higher sums of) your secret money in as cash payments for merchandise from pretend customers, on which you can now pay tax and stick it in your bank account and use it on noticeable and traceable purchases like cars, a house etc.",
            "title_similarity": "0.6237192"
        },
        {
            "id": "i0lcgma",
            "score": 1,
            "text": "*asking for a friend?",
            "title_similarity": "0.27491304"
        },
        {
            "id": "i0lclp1",
            "score": 1,
            "text": "Don't confuse it with your step sister getting stuck in the washing machine.  Different kind of laundering.",
            "title_similarity": "0.48004374"
        },
        {
            "id": "i0ld0u8",
            "score": 1,
            "text": "OP:\n\nActive laundering\n\nSay my job is to do illegal gambling. That is a cool 10k a week, pure profit.\n\nGreat, now how do I deposit it? How do I justify it to a bank? What about taxes? Cops are dangerous but the IRS is deadly.\n\nI need to open a business that will justify it, AND that has no \"indicators\" that will denounce me. A simple grocery is a problem, because I can't say I sold 10k a week if my produce purchases are 1k a week. You need something harder to control like a laundromat or gambling machines. Since people come in and place coins on it there is really no record, long as you keep that stuff going 24/7 and buy enough soap and stuff and spend water and electricity (can't be cheap here or you'll get caught) nobody will know. You'll also hire yourself as manager to justify your own salary.\n\nSo the machines actually make 3k a week, and your expenses are also 3k a week - and you add in the illegal 10k. Now it seems as if you're making 13k a week, great business.\n\nTake off expenses, your salary, pay your taxes, and the remainder is fully legal and clean. Laundered if you will. Now make sure you put it where it can't be taken away if the cops ever get on you.\n\nPassive laundering\n\nLets say I find a case full of bills, say 1 million that some druggie lost running away. Look around, see no cameras, put something over it and scoot off.\n\nOk, now if I go to the bank, I'm nailed. So what do I do? The long game. Get a decent 2nd hand vehicle, paid cash. Sell my old one and deposit the money. Hide the case well and use it to pay my expenses, in cash. Fuel and food? Cash. Keep basic living expenses on my regular account.\n\nGet my parents to give me a \"gift\" within the legal limit per year (say I've made the money up working a side job, whatever). Improve the house bit by bit paying cash.\n\nIn the meantime, my salary is accumulating like mad because I'm not spending most of it. Just a bit. Then I can use it to buy some cheap property, pay hard cash to renovate it, then sell it for a nice legal profit. Reinvest.\n\nPay your taxes and don't complain, do NOT be greedy and draw attention.\n\nAfter a while, it'll appear as if I made some nice cash by being frugal and a great manager, and it'll trigger no warnings in the system.",
            "title_similarity": "0.6339935"
        },
        {
            "id": "i0ldu4r",
            "score": 1,
            "text": "Real case: \"Fashion\" stores that bring in knockoff clothing from China in bulk. They're selling at barely above cost in the store but the owner is doubling the income with illegal funds. This is all extra money to the main guy and this all goes into buying up property which then keeps on cranking out legitimate income. To add to the empire some of the properties are for things like night clubs and the boss runs a protection racket with the clubs having to use his bouncers.\n\nEverything above I know as a fact (and the police and the taxman too) - This part is supposition: The clothing containers are also used to hide drug shipments and the drugs are sold by dealers being policed by the bouncers. And so the clubs are forced through the protection racket to turn a blind eye to these dealers operating in their clubs.",
            "title_similarity": "0.6565578"
        },
        {
            "id": "i0letkg",
            "score": 1,
            "text": "Nowadays fewer and fewer businesses are cash businesses. But I guess laundering will find a way.",
            "title_similarity": "0.51173407"
        },
        {
            "id": "i0lev29",
            "score": 1,
            "text": "Here’s another random example of a different form of money laundering. Say that your father was the President of the United States, and foreign countries needed a way to buy influence. They can’t just give him a boat load of cash. That’d be illegal, dirty money. So, you become a painter, and sell your paintings to foreign oligarchs for boat loads of cash and give it to your Dad. Now it’s legal, clean money. You’ve just laundered money.",
            "title_similarity": "0.7025025"
        },
        {
            "id": "i0leyqt",
            "score": 1,
            "text": "The explanations here are too long.\n\nBasically you open a business for the purpose of owning your illegal money without suspicion.",
            "title_similarity": "0.67262334"
        },
        {
            "id": "i0lf26o",
            "score": 1,
            "text": "Sell art for $ 5,-. Bookkeeping says you sold it for $ 505,-. You now have washed $500,- of your drugmoney.",
            "title_similarity": "0.4536218"
        },
        {
            "id": "i0lfqic",
            "score": 1,
            "text": "Lets say you are a drug selling criminal and... oh wait.. let my man, Saul Goodman explain it to you.\n\n\nhttps://www.youtube.com/watch?v=RhsUHDJ0BFM",
            "title_similarity": "0.6089507"
        },
        {
            "id": "i0lfwde",
            "score": 2,
            "text": "dirty money = no source, money from 'nothing', no paper trail\n\nclean money = able to track flow back to source\n\nwashing = injecting dirty money into a clean money flow to avoid questions or audits",
            "title_similarity": "0.5184238"
        },
        {
            "id": "i0lfxur",
            "score": 1,
            "text": "The version where art is used is probably like 1% of it.\n\n\nIt's much easier in reality.\n\n\nTake the city of cologne for example. There is a Kebap store and a gambling place every like 500 meters. Sometimes the gambling places are next to each other even. And who the fuck even goes to a super small \"casino\" to gamble? And why would there be two next to each other?\n\n\nThe answer is: they don't rely on customers. They bring the money themselves. \n\n\nImagine you sell a bunch of drugs and made a bunch of money from it. You can't put it into your account because the bank will ask where it comes from. \n\n\nBut if you own a mini casino or sports bet thingy, you can just throw all of the money in it and keep the profits. You can show the government that all these vets were made and all these machines were played and suddenly it's clean money. Sure, you have to pay taxes on it but who cares? It was unusable before the laundering so it doesn't matter that a big chunk of it gets lost.\n\n\nI just don't understand why no one cares. It's so obvious here in Cologne that even i can clearly see it but nothing is done about it. And it's all Arab families. Probably only a handful of big Arab families as well.",
            "title_similarity": "0.5601361"
        },
        {
            "id": "i0lglqb",
            "score": 1,
            "text": "You have $5000 in cash that you made from illegal activities such as selling drugs or killing people.  You open a store that sells mattress that takes cash.  You buy your own mattress from the factory for $100.  You sell the mattress for $5000 cash to yourself.  After tax and cost, you make $4000 as profit which you deposit in bank.  Now you have just turned $5000 of illegally made money into $4000 legal money after you paid the government their tax.  You can use that $4000 to do whatever you want b/c you can write checks or use credit card b/c the money came from the bank a “legitimate” financial entity",
            "title_similarity": "0.5780816"
        },
        {
            "id": "i0lhcgd",
            "score": 1,
            "text": "Scenario - You live in a country where bribery is outlawed. \n\nBut you want to get rich, but have no marketable skills and/or you don't want to do any real work. So somehow you become a career politician.\n\nThen the lobbyists for foreign governments, weapons manufacturers etc etc \"donate\"  to your \"foundation\", or invite you to deliver a speech for $x thousand dollars. Sometimes they give you money to \"write\" a book or feature you in a Netflix special. All of these are technically legal.  But the source of these monies are likely not.\n\nSometimes the foreign governments get toppled and a friendly leader gets installed. You offer and vote towards \"aid\" with taxpayer money to such corrupt entities. And they channel that money back towards \"lobbying\" you etc. \n\nTLDR; Ill gotten money gets brought into the open as payments towards foundations, book/Netflix deals etc. That's money  laundering.",
            "title_similarity": "0.58717674"
        },
        {
            "id": "i0lhncd",
            "score": 1,
            "text": "One of the easiest money launder schemes, albeit for lower values, is a car park that doesn't really work but fills revenue. It has all the paperwork in order, it has a couple of (fake non-existent) employees with huge salaries, it registers 24/7 huge movement of paying cars, it has to pay a huge rent for the place. So basically you have huge profits plus the huge costs (that you get deductibles).\n\nExcept the car park doesn't exist, its your own lot that is empty, and nobody will go check. Each month you are making big bucks, except you aren't, its all \"laundered money\" that you stole somewhere, or someone paid you to launder.\n\nAlso, where I live, when there is a tiny store that sells some crap but nobody ever sees a customer (and it is closed most of the time) and the thing is going on for years, everybody kind of knows its money launder for the same reason.",
            "title_similarity": "0.49194947"
        },
        {
            "id": "i0lhs74",
            "score": 1,
            "text": "So lets say you stole 300 dollars from the school bake sale. You really want to buy a Nintendo Switch but your parents will notice that you suddenly got a good bit of money out of seemingly no where. \n\nThat money is dirty and needs to be cleaned before you can use it without your parents finding out that you stole it.\n\nIn order to make sure you don't get in trouble for stealing this money and that you can buy your new switch you need to make it look like you didn't get this money in a bad way by lying about how you got it.\n\nA simple lie isn't going to be enough though because parents are smart, they look into stuff like this. You need to start a lemonade stand and tell your parents that for every 5 dollars you sell that you're actually making 8.50 and sometimes receiving a generous tip.\n\nWith every new day, so long as you are careful to not go overboard with what you tell them, you can slowly clean that dirty money and when you go to buy your Switch your parents won't think a thing about it outside of how well you ran that lemonade stand.",
            "title_similarity": "0.5922936"
        },
        {
            "id": "i0lircw",
            "score": 1,
            "text": "Isn't drug money all cash?  You get so much of it that deposit institutions get suspicious?  I think this is what is happening in Mexico.  After they buy guns with the cash they look around at where they can put it to use-  Bingo - go to the Caribbean and build a resort.  They would gladly accept your money and construction spending, and employment.  Mean while the drugs you sold killed many people.  I think this above scenario happens a lot.",
            "title_similarity": "0.64958525"
        },
        {
            "id": "i0liscw",
            "score": 1,
            "text": "The goal of money laundering is to take illegal money and pay taxes on it. No really.\n\nYou can't do a lot with illegal money, you can't explain where it's from, you didn't pay taxes and that all can cause issues when you use it.\n\nThe way you fix that is by putting up a sham buisness, the storefront in your idea. You say it's making 10k a month for example. While in reality it only does 1k... And you then insert your illegal money into the business as \"profits\".\n\nLike that you just made 9k illegal money into 9k legal taxed money with a clear source.\n\nThe sham has to be something that has high and low days, nothing to predictable. Like that Unless someone litteraly checks weeks of activity or gets a deep dive in the books the scheme doesn't look to obvious",
            "title_similarity": "0.6289879"
        },
        {
            "id": "i0ljisc",
            "score": 1,
            "text": "You are a professional criminal.  You do crimes to make money.  Because you are a very successful criminal, you make a lot of money!\n\nHowever, you have a problem.  All your money is cash.  When you sell drugs or shakedown businesses or fence stolen goods or whatever it is you do, most of the time you get paid in cash (these days, you might also get paid in cryptocurrency, but that has a lot of the same issues).  People generally don't pay their drug dealer with a personal check, nor would you accept it, cause, well, that'd be evidence of your crimes!  You can't really have a business that openly admits to committing crimes or selling illegal products, right?\n\nAt first you don't see why that's a problem.  Cash buys stuff, right?  Well, yeah, you can go buy an xbox or a nice dinner and pay cash and no one will bat an eye.  But you'll soon discover that buying big stuff in cash is hard.  Cars, houses, planes, boats, your kids tuition, etc are all purchases that will be difficult or impossible to execute by handing over a bag of crumpled up cash; plus modern commerce is kinda based on the idea that you have a bank account, it'd be hard to buy plane tickets and stuff on Amazon otherwise.  Any time you need to send money anywhere, you'd need to transport a bag of cash somewhere; you also need to figure out how to *secure* all your cash.  And even if you can deal with all of that, eventually there's a good chance you come under suspicion (since you are, in fact, a criminal); when investigators discover you live in a $5m house and drive a $200,000 car and that last year you reported an income of $30,000 to the IRS, they've got an easy case of tax evasion to send you to prison on!  If you try to deposit all your cash in a bank, the bank will 1) ask you where you got this bag of cash from and 2) file a report with law enforcement.  Which has a good chance of resulting in you going to jail!\n\nSo the fundamental problem here is how do we take this \"dirty\" money, money we got from criminal enterprises, into \"clean\" money, aka money that looks like it comes from legitimate sources?  Well, that process is money laundering!\n\nSo, a simple example (this can get a lot more sophisticated but this is the basic gist).  As we said before, you are a criminal with a lot of cash from your illegal businesses, which you want to disguise as cash from a legitimate source.  Because you have a sense of irony, you decide to open a laundromat because it's a simple business that mostly works in cash.  The laundromat makes $20,000 this year after expenses on its actual business.  You throw $80,000 of your \"dirty\" money in along with that $80,000.  You tell the bank and the IRS that the laundromat made $100,000 this year.  You pay tax on your $100,000 and voila, suddenly you have $100,000 (minus taxes) in your bank account that appears to have come from legitimate business activities!  Ah, but you've got to be careful.  If you try to tell the bank that your podunk little laundromat made $1,000,000 last year, they may get suspicious.  Maybe you need to open more cash-intensive businesses to launder more money, like a car wash, laundromat, restaurant, or an art gallery!\n\nSidenote, why an art gallery?  Because art is difficult to value.  If you tell the bank that you sold $1,000,000 worth of laundry cycles last year, they'll be suspicious right away.  But if you tell the bank that you sold $1m worth of art, well, who's to say what a piece of art that is rarely bought/sold on the market is actually worth?",
            "title_similarity": "0.68461454"
        },
        {
            "id": "i0ljm96",
            "score": 3,
            "text": "Let’s say you sell Meth and make tones of cash money doing that. Now, if you take it to the bank, the bank will have to report it as your income and the Feds will investigate you because there is no apparent explanation for you to be legally making that money. They could never guess that you have a Meth Lab in a Winnebago. \n\nNow, you could buy a cash heavy business like a car-wash. And let’s say you have 30 cars come in for a car wash, giving you $300 per day at $10/wash. You could then, in your books, state that you had 90 cars come in, giving you $900 for the day at $10/car. But the $600 difference is supplied by your dirty money. \n\nWhen you deposit the $900 at the bank, the $600 you added is now clean because you can say that the money came from washing cars.",
            "title_similarity": "0.6038979"
        },
        {
            "id": "i0lle8x",
            "score": 1,
            "text": "Open a casino. Launder a bunch of money through it. Casino goes digital(making money tracked easier). Casino goes bankrupt not long after.",
            "title_similarity": "0.6165679"
        },
        {
            "id": "i0lmifv",
            "score": 1,
            "text": "Watch a show named \"This giant beats that is the global economy\" on Amazon Prime to gain a better insight on money laundering and all the other aspects of global economics",
            "title_similarity": "0.61426944"
        },
        {
            "id": "i0lotwu",
            "score": 1,
            "text": "Okay i get it, great answers and all but doesnt it seems a bit suspicious question? In the sense that OP is really trying to learn how to launder money :D",
            "title_similarity": "0.6971714"
        },
        {
            "id": "i0lqb40",
            "score": 1,
            "text": "I understand the concept thanks to the above comments, but just wondering something for anyone who’s seen Ozark:\n\nWhen marty offers to subcontract out some of the audio equipment for the band and offers 100k compensation, how does it his benefit Marty in his attempt at to launder? This is in episode 3 of season 3",
            "title_similarity": "0.46731228"
        },
        {
            "id": "i0lr12s",
            "score": 1,
            "text": "Money laundering was it originally done through laundromats because it's a business that deals with cash and doesn't have receipts",
            "title_similarity": "0.6710255"
        },
        {
            "id": "i0lr7ne",
            "score": 1,
            "text": "I think Breaking Bad did a great job depicting money laundering with the car wash business… the dude made hundreds of thousands of dollars from selling meth and they were an average family so if they just bought a Ferrari or something crazy everyone would suspect they are doing something shady and blow their cover. \n\nI don’t want to butcher the process, but they basically took certain amounts of meth money each day and the wife, who is an accountant, made it look like that money came from the car wash in the books. So lets say the car wash was making $1000 a day in reality but they also took $2000 of the meth money and so it looked like they were making $3000 legally.\n\nAnd the Los Pollos Hermanos food chain business is an even better example from the show. the car wash bit went much deeper into the actual process but the food chain was insane imo, ran by this well respected dude who absolutely nobody suspected. The food chain was just a cover up for transporting insane amounts of meth across the country while laundering insane amounts of money through the big food chain at the same time. That show is so insane",
            "title_similarity": "0.55561566"
        },
        {
            "id": "i0lsmml",
            "score": 1,
            "text": "I’m not 100% sure but this is my understanding:\n\nYou own a shop.\n\nYou sell £10 worth of groceries.\nYou also throw in £10 of ‘dirty’ (illegal) money\nYou input £20 in the cash register\n\nYou have now laundered £10",
            "title_similarity": "0.6255688"
        },
        {
            "id": "i0ltyod",
            "score": 7,
            "text": "Breaking Bad did a pretty good job at this. Walter made a lot of drug money he couldn't spend, so he bought a car wash to launder the money. He created fake receipts and put the drug money in the till to claim it as taxable income. That way the illegal drug money became legal income, to make it less suspicious. You could do the same thing with a restaurant or with a nail salon, especially places where cash tips are common.\n\nVery illegal to do, but if you're already making and selling meth, it's just another charge to add to your list.",
            "title_similarity": "0.6697602"
        },
        {
            "id": "i0lx56v",
            "score": 2,
            "text": "Its not that it the storefront is “actually money laundering”. The store will actually be selling the art and is a legitimate business. The money laundering is when the business owner claims larger revenues than they actually have which is actually their illegally earned money.\n\nThis process is turning their “dirty” money that they earned illegally into “clean” money brought in through the legitimate storefront. \n\nHence the term “money laundering” as it is turning dirty money into clean money.",
            "title_similarity": "0.8304524"
        },
        {
            "id": "i0lxego",
            "score": 1,
            "text": "it's quite easy to launder money if your front company accepts mainly cash, like a church...",
            "title_similarity": "0.46427009"
        },
        {
            "id": "i0lxt13",
            "score": 1,
            "text": "There are three steps, placement, layering, and integration. First you use many innocent ways of putting money into an account, then you move money around between accounts in complex ways to hide the source, then you withdraw in complex ways and spend it.",
            "title_similarity": "0.6952389"
        },
        {
            "id": "i0lzaol",
            "score": 1,
            "text": "Okay, so the TV show Ozark actually has an amazing explanation for how money laundering works at a very basic level.\n\nHere's a link to the clip\n\nhttps://youtu.be/KXTaksJxO90",
            "title_similarity": "0.62275225"
        },
        {
            "id": "i0lzy5h",
            "score": 1,
            "text": "I sell drugs.\n\nI also own a massage business.\n\nThing is, I don't advertise my massage business, so I don't actually get any clients. However, I only accept cash.\n\nI lie and say I've been crazy busy for the last year, and we've been charging £30 for a 30 minute massage. As I have 3 employees + a receptionist. This means that, including time to clean down between bookings, I can say I've done 12 per masseuse, so 36, a day.\n\n5 days a week, for 52 weeks, that's a shot load of \"extra\" money I can add to the business from my drugs.\n\nTo the authorities it just looks like I have  a very successful massage business, and therefore the money is legitimate.\n\nWith art, they will buy art cheap, fake the sales, then dispose of the art. Or on cash payments inflate the actual price a lot.",
            "title_similarity": "0.40445685"
        },
        {
            "id": "i0m1rti",
            "score": 1,
            "text": "Casinos are good for this. Put a few hundred in the machine, cash out. Keep it under 10k per day, no paperwork.",
            "title_similarity": "0.35768434"
        },
        {
            "id": "i0m3a19",
            "score": 1,
            "text": "Have you seen Breaking Bad? Because they show how Skyler launders the money into the carwash. She pretends to make sales that she’s not actually making & the money from those “sales” is actually Walt’s drug money.",
            "title_similarity": "0.7320702"
        },
        {
            "id": "i0m3onk",
            "score": 1,
            "text": "But then, your sister comes up with a really good lemonade recipe that she wants to try. You figure \"why not? It adds to my legitimacy\". But then, your sales actually go through the roof. Now you're pulling $200 in legit money a month. You have to hire more people to keep it running. It's too risky to launder the rest of your dirty money, but that's fine, because you're making a ton of money anyway. \n\nTime to start a second business to launder the rest of the money, and keep the first one going. \n\nAnd this is how WAY more of the legitimate businesses around you were started than you'd like to believe, and why it's hard to compete when you're honest and law-abiding.",
            "title_similarity": "0.44720843"
        },
        {
            "id": "i0m6upm",
            "score": 1,
            "text": "Why did i think that money laundering involves a laundrymat? I always thought it was because stolen money from the bank have that ink in them and it gets stained so they have to “clean” the bills… in the washing machine…..\n\nmy life is a lie.",
            "title_similarity": "0.6979167"
        },
        {
            "id": "i0m7chg",
            "score": 1,
            "text": "Basically paying taxes on money you earned but did not declare or cannot say where you got it from (typically criminal gain).    \n\n\nRestaurant are great because its not weird to be payed in cash.  At the end of every day you add a stack of your own illegally gained money to the cash registered and pass it off as \"pizza\". Plus it is hard to say how many pizza you can make with a can of tomato and a five pounder of flour, how many salads with a head of lettuce etc.  \n\n\nA great one are massage parlors, cash business, no expenses, and while you can see 8 clients a day, you can easily say you saw 50 and fill the register with cash for the 42 you didn't do.  You pay the taxes on those 42 and keep the balance that is now \"clean\"",
            "title_similarity": "0.4652939"
        },
        {
            "id": "i0m7kwf",
            "score": 2,
            "text": "This also works as “ELI5: how the hell does the tropical fish store in my town stay in business?”",
            "title_similarity": "0.34314293"
        },
        {
            "id": "i0m7twb",
            "score": 1,
            "text": "Basically, hiding your real profit in something, that is completely legal. For example, you sell drugs. But you also have a small business. Technically, your business, can give you a lot of profit (nowhere near drugs though). So, you hide your \"real\" income in that business, completing contracts, that otherwise no one will complete. Either coz of low profit  or something else",
            "title_similarity": "0.64501727"
        },
        {
            "id": "i0m8kdj",
            "score": 1,
            "text": "Came here for the Breaking Bad description from Saul Goodman.\n\n[Here you go.](https://www.youtube.com/watch?v=RhsUHDJ0BFM)",
            "title_similarity": "0.4321701"
        },
        {
            "id": "i0m8ne5",
            "score": 1,
            "text": "Money laundering is the art of having an item and registering it with a price thats way above usual and standard asking price in order to start a trace for money that has been obtained by illegal means. Imagine if you would rob a bank and manage to take a large sum of money. That money now is being searched by the authorities. The search has an expiry date. If you were to register an official transaction you would legitimise that money after the authorities have finished searching for it.",
            "title_similarity": "0.80772936"
        },
        {
            "id": "i0m8rny",
            "score": 2,
            "text": "As you already know how this work with business we can talk about art. Lots of artists that make millions are actually on it.\n\nIdea is that you can purchase high value product anonymously just like when you but banana in store for cash.\n\nSo to make your money legit, you just sent art piece for 100,000$. Or you can but legit art and then sell it to anonymous collector for twice as much. Nobody cares. Idea is to transfer money to you so they look legit.\n\nNobody knows who seller is or where the money is coming from but once yours - it's legit.\n\nTo show you how big of a problem it was - Mexico once passed a law that require art gallery to gather info about buyer. \n\nEntire art marked dropped like 70% right after that. Because cartels were buying most art in the country :-)\n\nThis is why people say NFT are no different. Some shitty worthless monkey image suddently goes for like 200k :-)",
            "title_similarity": "0.67924947"
        },
        {
            "id": "i0m9qtq",
            "score": 1,
            "text": "Come into some cash have you? 😉",
            "title_similarity": "0.5039891"
        },
        {
            "id": "i0m9y5j",
            "score": 1,
            "text": "The easiest way to put it is you have 10,000$ of drug money. You own a store that sells paintings for 100$. You sell a painting for 100$ cash, take the customers 100, add in 100 of your own and lie in your books that the painting was a 200$ sale. As far as anyone can tell you earned 200$ but really you just earned 100$ and washed 100$ of your own. Rinse and repeat until all the money is \"clean\" pun intended",
            "title_similarity": "0.52286077"
        },
        {
            "id": "i0ma8k5",
            "score": 1,
            "text": "You can also launder money through a bank loan. I remember when I was working as a teller there was a customer who used to come to the bank every week in either a Porsche or nice Cadillac. He had a personal loan for I forget how much, maybe $80K. He would always make his payments in $100s and always under $10k. He was later arrested on OC charges but I don’t know what happened after. So basically, if you have a lot of cash you need to wash, you can try to get a personal loan and spend the loan money as you would spend the dirty money and just pay back the loan with the dirty money. Sorry if that was long winded.",
            "title_similarity": "0.4907773"
        },
        {
            "id": "i0mah48",
            "score": 1,
            "text": "Big tony makes a painting. Little tony buys the painting. Little tony had to make a payment from his legit money to big tony for some illegitimate task. Big tony has sold the art and big tony shows that income on his tax return. Since its the only painting he sold that year and hia expenses to get it in the gallery are more than his earnings from the painting, he paya no taxes. Also, some days later, fat tony is found dead in a back of a taxi shoved into a lake",
            "title_similarity": "0.5414322"
        },
        {
            "id": "i0mattt",
            "score": 1,
            "text": "Bob delivers a cargo container of underage girls to your private island, Bob needs a way to explain the $1,000,000 showing up in his bank account so you simply purchase his wifes shitty painting for a stupid $1,000,000 and the gallery calls it high art.",
            "title_similarity": "0.50575006"
        },
        {
            "id": "i0mbofn",
            "score": 1,
            "text": "So let's say you have a million dollars in illegal income (say, through robbing banks and slinging meth). It is important to know, first of all, that corporations and \"real\" people are two different things for tax purposes (this is called corporate personhood).\n\nSo you set up a corporation, call it Trevor Philips Enterprises, in the Virgin Islands, with yourself (Trevor Philips) as the only shareholder.  You put the meth money into the corporate account, and then you write out a loan... to Trevor Philips, in Los Angeles.  Then you don't pay it back.  Presto, change-o, the money is now **laundered**.\n\nOf course, to confuse the IRS further, you can set up a loan to a **separate** corporation that you control through a trust... and then that corporation loans half of it to Trevor Philips the person and half of it to **another** corporation, which sells a piece of \"art\" to Trevor Philips the person.\n\nOf course, you never pay the loan back. Why would you? It's **yours**.",
            "title_similarity": "0.6453823"
        },
        {
            "id": "i0mbwlv",
            "score": 1,
            "text": "Medical marijuana was legal in WA state, any money made from weed was/is federally illegal and in a weird place so far as taxes are concerned.\n\nPull out a business loan from a local bank to start a cash heavy business (like a coffee shop)\n\nReport higher levels of cash sales from said business and that money from your illegal business is now taxed and you can use it to buy things without drawing attention from the IRS or banks.\n\nSpending/depositing money you shouldn't have puts you on SO MANY watchlists including homeland security.\n\nIf you're paying taxes on it, literally nobody in the government cares. They just want their slice.\n\nObviously you don't want a corner coffee shack generating $100k a week so you scale it up and eventually use your \"legitimate\" earnings to purchase assets like rentals, franchises, and profitable businesses.",
            "title_similarity": "0.6214476"
        },
        {
            "id": "i0mc1t6",
            "score": 1,
            "text": "You put the dirty money in you take the clean cash out, you put the dirty money in and you shake it all about. You take the clean money and you turn yourself around, that’s what it’s all about!",
            "title_similarity": "0.6894002"
        },
        {
            "id": "i0mc7sq",
            "score": 1,
            "text": "Criminals find a business that can be cash intensive (mostly cash transactions as opposed to credit).\n\nCriminals \"buy\" things from the business using \"criminal\" cash (say, drug money) - lots of cash - and the cash is recorded as a sale.\n\nThe money is now \"clean\" and can go into bank accounts where it may be redistributed to people as payments, or consignments, etc.",
            "title_similarity": "0.78321844"
        },
        {
            "id": "i0mev9f",
            "score": 1,
            "text": "You robbed $100,000,000 from a bank. You want to spend it but the government knows roughly how much money you  earn legally, so they're going to get suspicious of you buy a yacht or something.\n\nMoney laundering is the process of justifying why you might have that money so nobody will get suspicious when you spend it.\n\nIf you're selling art, to use your example, whenever someone pays in cash, you record that they paid $10 more than they actually paid. That way, every time you make a sale, you can claim $10 of your illegal bank robbing money is actually legal art selling money.",
            "title_similarity": "0.67571366"
        },
        {
            "id": "i0mf1aa",
            "score": 1,
            "text": "Lived in NYC in the good old days, lots of fronts. I went to get juice drink in east village one time squeezing by six gangbangers sitting on the stoop. Looked good inside and pointed at a drink, he said they don't have, pointed at several others, said they didn't have, finally walked to the cooler and handed him a bunch of fruit and said make me something with this... He stepped out of the room then a huge man 6'7\" over four hundred pounds sucked through the doorway and came out, looked me up and down and said we are closed. I didn't make a fuss and left. Went to the park and told a buddy of mine named Evil what happened he laughed and said he better introduce me so they don't think I'm a cop, he went in told them I'm and artist and bought himself some weed. All the time this giant staring me up and down. I have many of these stories actually, got to know some queens dons the same way as well but that's another story.",
            "title_similarity": "0.40104926"
        },
        {
            "id": "i0mf5ya",
            "score": 1,
            "text": "Breaking Bad did a good job explaining it. He had pallets of cash that he couldn’t spend so he bought a cash based business - a car wash. Each time a customer came through he’d charge that customer then five more sales were entered essentially making it look like they were 6x as busy as they actually were and freeing up 5x the cost of one car wash. Of course they had to pay taxes on those fake sales but keeping 70% of ill gotten funds is better than being able to spend 0% of it.",
            "title_similarity": "0.5831936"
        },
        {
            "id": "i0mfg92",
            "score": 1,
            "text": "This scene from Ozark explains it pretty well\nhttps://www.youtube.com/watch?v=KXTaksJxO90",
            "title_similarity": "0.2184108"
        },
        {
            "id": "i0mfym5",
            "score": 1,
            "text": "Disregard anything someone says about money laundering that has to do with art valuations. It's always how a child thinks it might work and completely unrealistic.",
            "title_similarity": "0.6743146"
        },
        {
            "id": "i0mgi66",
            "score": 1,
            "text": "The top answer gives you a great example of how it works so I'll include a follow-up point:  Why artwork?\n\nThe reason why art is used so frequently in money laundering is because art's value is almost entirely arbitrary. That lets you \"clean\" a lot of money very fast compared to other forms of legitimate business.  e.g. a lemonade stand can only make a few bucks because you can't charge 1,000 a cup without someone noticing that doesn't make sense.\n\nBut art? Who's to say your drawing isn't worth 4 mil?",
            "title_similarity": "0.6675105"
        },
        {
            "id": "i0mgj31",
            "score": 1,
            "text": "Do you need instructions or are you just interested?",
            "title_similarity": "0.35069337"
        },
        {
            "id": "i0mhzmb",
            "score": 1,
            "text": "You’re simply trying to allow taxation to happen with the least loss.  \nAlso:  tell me you’re trying to shed crypto without telling me you’re trying to shed crypto. :)",
            "title_similarity": "0.6355825"
        },
        {
            "id": "i0mior0",
            "score": 1,
            "text": "When people say art is money laundering it's a bit different.  The top comment already described store front laundering pretty well. Art laundering is a bit more complex and big ticket.\n\nEssentially you buy a bunch of art from one artist the use some connections to hype it. The guy buying your illegal goods buys art from auction slowly increasing the price over time through various shell entities in countries that turn a blind eye to that sort of thing. He's paying millions for what is just a few hundred dollars worth of art, because he's not really buying art he's paying you for last months shipment. \n\nThen you take one or two of the paintings from this now supposedly valuable artist, get an expert to value  them for millions and then donate them to a museum and score a huge tax write off.",
            "title_similarity": "0.73066986"
        },
        {
            "id": "i0misrc",
            "score": 1,
            "text": "Nice try OP. Where's the money coming from?",
            "title_similarity": "0.6556967"
        },
        {
            "id": "i0mjf6r",
            "score": 1,
            "text": "The best money laundering explanation I saw was first season Sneaky Pete. \n\nHad to do with real estate. Buy low sell high and now your money is clean.",
            "title_similarity": "0.65815043"
        },
        {
            "id": "i0mjp6v",
            "score": 1,
            "text": "The cliffs notes version is you are taking currency, cash and coins, earned illegally say robbery or drug selling, funnelling them through a legal high cash business (a tavern or strip club or small casino) as revenue, depositing said money as if it were truly the earnings of the legal business.  As the money is now legitimized and counted, one can now pay oneself cleanly.",
            "title_similarity": "0.73303795"
        },
        {
            "id": "i0mjqq1",
            "score": 1,
            "text": "I learned a lot about money laundering from Ozark.  It really opened my eyes to how certain businesses in town managed to stay open for years when nobody is ever there.",
            "title_similarity": "0.38302213"
        },
        {
            "id": "i0mjvic",
            "score": 1,
            "text": "My understanding is that you can use cash only type business to deposit Ill-gotten gains. Businesses like laundromats are good vehicles for this because there is no inventory for an audit to detect discrepancies, but I wouldn’t know first hand. It just sounds logical.",
            "title_similarity": "0.5848676"
        },
        {
            "id": "i0mk500",
            "score": 1,
            "text": "Can I add to this question?  If I sell roses and spend all the cash I make on everyday items like gas, food, etc. and deposit my paycheck into a shared bank account with my rose supplier. My rose supplier can then withdrawal that money to harvest more roses to send to me. Is this money laundering?",
            "title_similarity": "0.6555569"
        },
        {
            "id": "i0mk53b",
            "score": 1,
            "text": "Nobody is mentioning the purpose, in that you don't need to worry about cleaning your money until it reaches a certain scale.\n\nAny cash transaction over $10,000 requires you file form 8300 with the IRS within 15 business days. The penalty for not doing so is nominal, but will get you a red flag that may trigger an audit, which could go anywhere.\n\nIf it gets to a size that you worry about robbery, people start to want a bank. If you don't have a legitimate source of income and wish to use credit you'll need it clean.\n\nBasically if you have illegal cash income it's useless for anything expensive until you get it laundered, but that's expensive. You may have to pay 30-50%, even more.\n\nSo you figure at about 40% nobody is going to bother unless they have at least $50,000 to have $30,000 back clean.",
            "title_similarity": "0.56270134"
        },
        {
            "id": "i0mko8z",
            "score": 1,
            "text": "Art can be more efficient in terms of volume vs suspicion than a business that sells goods of known value.\n\nArt has no established value.  So if you put a $50K price tag on your wife's watercolors, that may be \"normal\".\n\nSo say you want to collect money for a drug deal or a bribe.  You can't just take a $50K check without laundering the money.  Could you take an actual briefcase of cash or bitcoin?  Well, moving a large amount of cash is harder than you may think.  It's bulky and very suspicious. \n\nAnd you have to then pay people with cash to spend it down, which may be harder than you think too.  You can cash-pay your utility bills, but really, how much is that on this scale??  You can't pay your mortgage off with cash on the sly.  They'll report the cash, so you might as well have deposited it in the bank.  You can't easily buy a boat with a false \"cheap\" value paid and banknotes transferred under the table, it's super-shady and risky.  And living beyond your obvious means is high exposure.\n\nBut if you sell your wife's watercolors for all this money, well, that does appear to be legit income.  And likewise you can pay people the same way, buy their stuff.\n\nDoesn't need to be your wife's watercolors, that plays out too quickly.  OK, baseball cards or other antique thing.  Is it really worth $50,000?  Maybe it wouldn't sell for that on ebay, but that's beside the point.  It's been sold and there's a bill of sale and the income appears legit and once you bought it you can use it to get $60,000 from the person who owes you an illicit payment.",
            "title_similarity": "0.71488595"
        },
        {
            "id": "i0mlsa0",
            "score": 1,
            "text": "The lemonade stand is OK for reasonably small amounts but what if your trying to do 10s of millions. Then you have to find a crooked banker who will lend you your own money and then charge high interest rates as their cut",
            "title_similarity": "0.6202727"
        },
        {
            "id": "i0mmxu3",
            "score": 1,
            "text": "Real estate is pretty useful for laundering offshore cash. You can bring a suitcase with dollars to Vancouver, for example, and buy a $5m house no questions asked. \n\nAnother place is a casino. Bring some money, play a bit, then cash out.",
            "title_similarity": "0.64446276"
        },
        {
            "id": "i0mo24z",
            "score": 1,
            "text": "Just look into the stock market. Not just money laundering. It's synthetic naked shorting, money laundering, manipulating stocks, cellar boxing, God the lsit goes on. Too many people are blind to what's happening to our lives. You want to understand why inflations high and wages all time LOWS? Stock market.",
            "title_similarity": "0.6805396"
        },
        {
            "id": "i0moi7u",
            "score": 1,
            "text": "Search on YouTube the money laundering explanation Leo Getz gives to Murtaugh and Riggs from Lethal Weapon 2 movie. He even talks about taxes.",
            "title_similarity": "0.65384394"
        },
        {
            "id": "i0motok",
            "score": 1,
            "text": "The think to understand is that a normal business can show stuff coming in and going out and the two balance.\n\nSay a bakers. If they buy in flour, milk, sugar, eggs etc they write all down. \nThen the baker is paid to work. \nThey make 10 cakes and sell them. \n\nIf they sell the cakes for more than the ingredients + baker cost, they made a profit. And they can prove each step.\n\nIf you have illegal money you can't explain where it came from and it'll be easy to spot . So you need to fake making money somehow. Sell 10 cakes but write down you sold 11 then you can add some illegal money into your profits",
            "title_similarity": "0.5619031"
        },
        {
            "id": "i0mp0rq",
            "score": 2,
            "text": "Money laundering is pretty difficult in the real world. Large sums of money in one lump sum automatically trigger bank interference and investigation now. And more recently, large sums of money deposited in small sums over time draw the same investigations.\n\nWith most modern banks, this means you can't possible deposit dirty money at the same rate you made it, which makes spending it nearly impossible.\n\nBut find a dirty bank, likely a credit union... Now you can do whatever you need to do.",
            "title_similarity": "0.6414683"
        },
        {
            "id": "i0mqh64",
            "score": 1,
            "text": "Where is Saul Goodman with his box of jelly beans and tin of paper clips when you need him?",
            "title_similarity": "0.3193713"
        },
        {
            "id": "i0mqvo4",
            "score": 1,
            "text": "Say, where does one, get dirty laundry? Asking for a friend",
            "title_similarity": "0.5606073"
        },
        {
            "id": "i0mr1uc",
            "score": 1,
            "text": "Let me guess, watching Good Girls?",
            "title_similarity": "0.2672186"
        },
        {
            "id": "i0mrc1w",
            "score": 2,
            "text": "Say you're Mr Beast, a client comes to you wanting to 'fund' your next million+ dollar video, you take 5-10% and use some to fund the video.\nYou set up one of the clients henchmen or a niece or a nephew to win the money and badabing badaboom, he may have 1.8mill instead of 2mill but he can actually spend it now or legally put it in a bank.\n\nNot saying Mr Beast does it buy he could very easily if he wanted to.",
            "title_similarity": "0.5677632"
        },
        {
            "id": "i0ms1sz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.15451548"
        },
        {
            "id": "i0mu9b1",
            "score": 1,
            "text": "So while the storefront is selling art (or whatever the ‘store’ is supposed to be) the back of the store, the part you’re not seeing, and this is the illegal part, is actually a laundromat. So when customers come and ‘buys’ art, they pay with money right. The money isn’t actually used to buy the art, it’s actually taken to the back to be washed -I.e. laundered. This is how people actually wash their money and they’re not actually buying art. Hope this helps.",
            "title_similarity": "0.71240795"
        },
        {
            "id": "i0muab3",
            "score": 1,
            "text": "It mostly comes down to the shop pretending to be more successful at selling things than they are, in order to account for the money they earned from illegal activities such as selling drugs somewhere else.",
            "title_similarity": "0.73056614"
        },
        {
            "id": "i0muni0",
            "score": 1,
            "text": "I had a friend growing up that had all the coolest gadgets (early 90s). He had a very advanced laser printer before they were widely available. He was printing counterfeit $20 bills and using them to buy his school lunch every day. School lunch cost around $3, so he was receiving around $17 of legitimate cash each day as change.\n\nHe ended up getting caught when the banks noticed the steady flow of counterfeit 20's being deposited by the school. Apparently he was one of very few students who always payed for lunch with a $20, so it didn't take them long to narrow it down.  It went on for close to a year, though. He ended up going to a juvenile penitentiary, and I think he did a few years as an adult too. I think this counts as money laundering, although the people doing the laundering were unaware.",
            "title_similarity": "0.37757486"
        },
        {
            "id": "i0muqau",
            "score": 3,
            "text": "Real-world examples:\n\nI  own a hotel, and am also a politician. People donate money for my political campaign; but I want to turn that into money I can use for anything. So my political campaign rents rooms at my hotel that nobody actually stays in, and after a small fee, I keep the rest.\n\n&#x200B;\n\nI run a charity, and am also a business-owner. My business donates money to the charity, and gets a tax break for doing so. I am on the board of that charity, and paid a consulting fee equal to the amount my business donates. I pay myself more, my business pays less taxes, and I can look good by saying A: I work for a charity, and B: My company donated to charity.\n\n&#x200B;\n\nI sell drugs, or otherwise have undisclosed labor. I go to a casino, and use one of the more even routes where I only lose a small percent to gamble all of my money, and thus end up with only slightly less money; and receipts showing it as gambling winnings for the IRS.",
            "title_similarity": "0.49939188"
        },
        {
            "id": "i0muqb6",
            "score": 1,
            "text": "Billy could offer Samantha’s Lemonade stand Protection. \n\nBilly - Nice lemonade stand ya got here. Shame if a big wheel crashed into it. \n\nSamantha - (looking confused)\n\nBilly- I’m just saying a lot of big wheels use this sidewalk.",
            "title_similarity": "0.4143899"
        },
        {
            "id": "i0mv0yi",
            "score": 1,
            "text": "I have money I can't spend because it's not legitimate. So I buy art with it, because art value is subjective. I can buy the art with cash, then donate the art to a museum, and have the sum of money donated, removed from taxable income, since it was a donation. Boom. I changed my illegal cash into tax money I don't have to spend later.",
            "title_similarity": "0.76803696"
        },
        {
            "id": "i0mv2n6",
            "score": 2,
            "text": "My friend's father did a decade in prison.  He owned a video store and constantly showed  large profits even in a small town. He split those profits with his business partner who happened to run a biker gang.",
            "title_similarity": "0.39768687"
        },
        {
            "id": "i0mvnsk",
            "score": 1,
            "text": "So imagine that you are influential American politician and Russian president comes to you and say\n\n \"Hey, dude. I want to make oil cost more but failed to fuck up middle east so here is my new plan. You shut down oil production in your country and pipelines from Canada under green premise and i pay you 1mln dollars. I already paid to others who will vote for it, but it will be too sudden, so I need you to cover for me like you came up with this idea\". \n\nAnd you are like \"cool, dude, let's do it\". So you shut down oil production and get paid 1 mln for making lecture in Moscow University. That is money laundering - you get paid for illegal corrupt action via non existing lecture.\n\nSo time passes and your friend evil Russian president comes again and says\n\n\"Hey, dude. My nuclear weapon is totally fucked up. Out of 6000 warheads only 1 is working. I need to put new nuclear stuff into it. But my facilities that can do it is too shit so I need your help. I sell you some nuclear unrefined stuff, you refine it for me , but pretend it is only refined to the level of nuclear station, not nuclear weapon. So noone notice and I will pay you 10 mln for that\".\n\nAnd you like \"cool dude, but some people already see me as your agent. No way they will believe any my lecture is worth 10 mln\". And he is like \"no problem, your son is making paintings, yes? They are total shit,  but you know art is worth as much as it is paid for. So I buy few of his paintings for few mln each\". That is money laundering - you are paid for you very corrupt action by \"buying your (son's) art for shit tons of money\".\n\nSo time passes and your best friend extremely evil Russian president comes to you and says\n\n\"Hey dude. Here is the thing. I want to conquer this nearby country and when I do - there is a lot of oil and gas in it. So I'm gonna sell it give you share. You just need to make sure I'm not ducked for that\"\n\nAnd you are like \"cool dude,  but you are crazy. There is no way I can pretend that it is fine. I have to react to it\". And he is like \"sure, no problem. Just give me and those random oligarchs personal sanctions, just do bare minimum so noone suspect we work together\". That is money laundering  - you are paid for extremely corrupt and evil action by getting anonymous share in company which have rights for gas and oil extraction.\n\nWell after that it turns out that every other country and half companies are very trigger happy to give unprecedented sanctions you never thought possible. And then it turns out that your dearest friend army is actually total shit and is destroyed by random peasants. So in the end your share worth nothing and a lot of people suspect you now and you are in risk of being convicted and eventually executed, but such is life of criminal. And also it is a bit of off-topic.\n\n\nSo here you are, 3 examples of money laundering of illegal money received from corruption.",
            "title_similarity": "0.5042187"
        },
        {
            "id": "i0mxh0l",
            "score": 1,
            "text": "Laundromat is the best analogy, still. You get 10MM dollars from illegitimate/illegal revenue sources so you can’t deposit it into a legitimate account. Instead you need a business that earns money and can account for the amount through its business deposits. You might make in reality 1M annually through your amazing laundromat. And 9M shows on the deposits. You account for it all through fake receipts and paper trails in the business and pay taxes on it.",
            "title_similarity": "0.64183"
        },
        {
            "id": "i0mxutx",
            "score": 1,
            "text": "What everyone here is leaving out is one word…taxes.\n\nBreaking Bad illustrated this best when Walt was shocked to find he had to pay taxes on his illegal money. As long as you’re doing that, Uncle Sam dgaf where you got it.",
            "title_similarity": "0.6242236"
        },
        {
            "id": "i0myxbx",
            "score": 1,
            "text": "Not any better than the explanations you've already received, but [there's a scene in Breaking Bad that explains it](https://youtu.be/RhsUHDJ0BFM)",
            "title_similarity": "0.5386071"
        },
        {
            "id": "i0n0bye",
            "score": 1,
            "text": "Art is the perfect thing to use as an example of money laundering. So lets say I am a rich guy, very rich.  I go to the artist and I buy a banana taped to a canvas for $10k.  My rich art appraiser friend comes in and values it at $4m. I donate the art to my other friends' endowment.  I now write off $10m for my charitable donation.  I pocket $3,990,000.00.  Rinse, repeat.\n\nThe mafia likes to use parking lots or parking garages.  Something that is set up with minimal or no cost of goods sold.  Unlike a coffee shop where you would have cups, cream and sugar, stir sticks straws and labor costs that would be in line with your coffee sales...with parking there is no COGS to gauge actual revenue flow.  So you can take your gambling, drug and prostitution profits and funnel them through a parking garage and outside of the Feds camping out and tracking your car traffic, there is really no way to catch the perpetrator unless they get way too greedy...which they don't do.",
            "title_similarity": "0.5174519"
        },
        {
            "id": "i0n0fmf",
            "score": 1,
            "text": "No really an answer but when I was a Mormon missionary I played basketball with one of the most famous singers in Mexico (Julion Alvarez) who got banned from the US for money laundering a week later. He was nice to me though, thought it was cool some white dude was in his hometown in the middle of nowhere",
            "title_similarity": "0.31368303"
        },
        {
            "id": "i0n0pob",
            "score": 1,
            "text": "Look no further than hunter Biden and the big guy. Once you’ve solved that novice case you can move on to the Clinton foundation which is the biggest money laundering entity in the world! Why have both not been prosecuted? Well, that’s for you to figure out.",
            "title_similarity": "0.5586374"
        },
        {
            "id": "i0n0tbr",
            "score": 1,
            "text": "Breaking bad has the best explanation: \n\nhttps://www.youtube.com/watch?v=RhsUHDJ0BFM\n\nThe thing most people miss is that the point is to pay taxes - not avoid them. The big reason for this is that tax fraud is way easier to prove than drug trafficking's. Busting someone for running a drug ring requires proving that they knew what was going on and a whole bunch of other stuff. Busting them for tax fraud just sending them a letter asking for documents. Not to mention once you are subpoenaing someone for tax documents you can start asking for emails and such that prove your drug case.",
            "title_similarity": "0.6583414"
        },
        {
            "id": "i0n1st1",
            "score": 1,
            "text": "So, I \"found\" this big pile of money, and don't like the questions the tax man may have if I put it in the bank. If I set up a small business, perhaps a farm stand, I can slip some of my found money into the till and just tell the tax man my farm stand was more successful than it was.\n\nI've now had to pay some taxes, but I can use my \"found\" money to buy things like houses, planes, fancy cars and what not.",
            "title_similarity": "0.6342863"
        },
        {
            "id": "i0n1tsm",
            "score": 1,
            "text": "Are you ron livingston in Office Space?",
            "title_similarity": "0.29487905"
        },
        {
            "id": "i0n2eg3",
            "score": 1,
            "text": "So the concept of clean and dirty money is just a way to express how recently funds have been tied to illegal activity. Right so if I get change for a 100 at any convenience store the chances of one of the changes bills having been used for something illegal is high, but that money is clean because that information can’t be traced. Money laundering is essentially cleverly mixing money acquired illegally into legal sources of money so that the two can’t be distinguished. So I go into the art store with the intention of buying this art with illegally acquired funds, say drug money, and I give my art dealer / money launderer the dirty money in exchange for an artwork that will act as a store of value until I need to sell it for clean money. He now deals with the dirty money for me at the cost of a fee and I walk away with my art (so maybe I pay him 105% of the value of the art and he pockets the 5%. Instead of me having a few suitcases of bloody money I have just received a painting to hang on my wall. \n\nMost money laundering schemes are more complex than that but you get the general idea",
            "title_similarity": "0.8076458"
        },
        {
            "id": "i0n2rev",
            "score": 1,
            "text": "Not sure anyone mentioned, but art is good for transferring money too, not just laundering it. Art has no fixed value, it's worth whatever people think it's worth. You want to give your mate Vinny $100k for some drugs? Can't do that as the bank/government will get curious, so you buy an otherwise worthless painting for $100k with an invoice to go with it. Bank/government can't prove you're not an art collector, you get drugs and some decoration. You sell the drugs on? Sell your painting on too.",
            "title_similarity": "0.6770912"
        },
        {
            "id": "i0n3k5i",
            "score": 1,
            "text": "Serious question, I have a friend that has a bunch of cash from legitimate tips, most of it was reported but some was not, they might be getting to the point where they need to use that cash to pay the bills while they are job hunting.  Will those deposits be sus to the IRS or banks?  How much is safe to deposit 🤔",
            "title_similarity": "0.67516357"
        },
        {
            "id": "i0n3m2r",
            "score": 1,
            "text": "For an art store you could do multiple different things since you’re selling individual pieces of property. You could sell one painting at 100k and then have 9 other paintings valued at 100k because that’s what the first one sold for. Now you can say you’re at a loss of 900k on your taxes or 900k cash could just appear. Up to you",
            "title_similarity": "0.558963"
        },
        {
            "id": "i0n5lua",
            "score": 1,
            "text": "Your company made X amount of money\nYour business  ;) made Y amount of money\nYou claim your company made X+Y amount of money so you can pay your taxes on it, and deposit it into the bank without anyone looking into it too much, and you destroy enough stock so every looks about right in the end of an audit does come around.",
            "title_similarity": "0.6547268"
        },
        {
            "id": "i0n5tbw",
            "score": 1,
            "text": "Laundromat is an actual brick and mortar store. Overnight while they are close individuals who have cash money made from illegal means wash the money. The washed money is reported as business income to the government. Business pays taxes on that income. Money is now clean.",
            "title_similarity": "0.6477195"
        },
        {
            "id": "i0n6fu2",
            "score": 1,
            "text": "Generally speaking you report fictional earnings.\n\nThe inefficiency of the business is usually where you hide the earnings.\n\nLaundrymats have almost no lasting evidence of customers, so they were an ideal haven for awhile.\n\nPut dirty money in, then get clean money out.\n\nRestaurants work really well too since you need to buy food and other stuff, but you falsely report profits and wages, expenses.\n\nSo record sales of $50000, when in reality you barely had $10000 in profit.",
            "title_similarity": "0.5342069"
        },
        {
            "id": "i0n72z1",
            "score": 1,
            "text": "What is an NFT? Wait...is this not jeopardy?",
            "title_similarity": "0.32448962"
        },
        {
            "id": "i0n775j",
            "score": 1,
            "text": "a big thing with art specifically, artists, will have art verified and quality certifiers that are in kahoots with the whole system. \n\nan artist might have a deal with the inspector or the purchaser to sell the paint WAY beyond what its actually worth as a means to shift large sums of money around or to funnel dirty money into liquid equity in their estate.",
            "title_similarity": "0.7636733"
        },
        {
            "id": "i0n7iqd",
            "score": 3,
            "text": "As many have given money laundering examples, but I didn't see any specifically about art. So here we go...\n\n&#x200B;\n\nSometimes it's to launder sometimes it's to get out of taxes, but person X made 100 million last year. They owe taxes on that (but can write off expense, donations, etc) 100 million. They have their friend artist Y \"paint\" a famous piece. They get a giant white canvas and just sign it. They finally have their friend appraiser Z come and say oh this is an artist Y piece? 50 million. They now donate that 50 million dollar piece to a museum and write off 50 million on their taxes.  \n\n\nThis is why so often people are blown away by pieces being millions for a line or sometimes even nothing on a page.",
            "title_similarity": "0.4850793"
        },
        {
            "id": "i0n7p7w",
            "score": 1,
            "text": "Massage parlors and nail n hair salons are rampant chinese mob laundering ops in our hood. One street, in an area of 7 blocks, has 13 chinese massage joints. An out of town buddy demanded we go patronize one, it was awful. You buzz to get in and their reaction was as if theyd forgotten they were even in business.",
            "title_similarity": "0.5084746"
        },
        {
            "id": "i0n7yff",
            "score": 3,
            "text": "Trump sells a home in Florida to the Russians. Trump needed to be paid for the work he did for Putin. Russian dude buys Trumps home for over 70% of real value. \nPutin just cleaned blood money by investing in America real estate. Trump facilitated the cleaning of the blood money and was paid well. The same home will never be able to sell for the same dollar amount unless it's sold to another terrorist.",
            "title_similarity": "0.5047519"
        },
        {
            "id": "i0n8mkx",
            "score": 2,
            "text": "Art typically isn’t a good way to launder money but it can be used to help settle accounts without having to use cash. \n\nFor example say you are my supplier and I owe you $100K. Instead of giving you $100,000 cash which will raise suspicion I “sell” you some art my dumb nephew made for $5k. I then pay that $5k to an art appraiser whom I have known for years and he says that piece of art is really worth $100k. You can now sell the art with the appraised value and pay taxes on the gains, or you can donate it to a museum and get a tax break.",
            "title_similarity": "0.55951774"
        },
        {
            "id": "i0nc2u4",
            "score": 1,
            "text": "Laundrymats are the best places for money laundering, low cost and low overhead and very few receipts.",
            "title_similarity": "0.45087457"
        },
        {
            "id": "i0nclq9",
            "score": 2,
            "text": "First off, money laundering comes originally comes from laundromat businesses hence the name. Basically you are \"washing\" the money. Money is either clean, ie obtained legally via a job or tax return or lottery or whatever; or money is dirty, ie. obtained illegally often via drugs or fraud. However, you can't just go around using dirty money willy nilly because people (read: The IRS) will ask questions on how you got all that money. So, you need to clean it.\n\nFor your example, the store would sell art in cash only business. Say someone buys a monkey painting for $500. They pay in cash--that is legal, clean money. For the business ledger however, the store would record that the monkey painting was sold for $1,000. The other $500 is the dirty, illegal money. It is mixed in with the clean money. Now that $500 dirty money is cleaned and can be used. So when people (read: The IRS) asks where did you get this money, the store can cite the painting they sold.\n\nIt gets a little trickier with independent contractors but that is a story for another time.\n\nThe most important part, however, is to pay taxes on the money that is now cleaned. Not doing so will draw too much attention.\n\nSource: I did laundry",
            "title_similarity": "0.7192528"
        },
        {
            "id": "i0ncyyt",
            "score": 1,
            "text": "They sell a painting that never existed to a customer that was never there and get paid in cash. Now they can claim it as income for the business and pay taxes on it so it’s now “legit” money",
            "title_similarity": "0.69890803"
        },
        {
            "id": "i0nei5w",
            "score": 1,
            "text": "in one of those real world is messed up situations ...a lot of criminals WANT to be taxed.\n\nBecause if they make piles of moneys and there is no tax record and the gov sees them buying lots of nice expensive stuff the gov comes crashing down on them. If they are taxed the gov things they are clean and doesn't ask questions.\n\n&#x200B;\n\nSo someone makes a ton of money tax free.   Then put it into a  business where they can lie about the income .   They lose 30% or what ever it is to tax but no one ever questions the other 70% of money they have . \n\nCash business are best cause they can't track every penny.  Laundry matts, Clubs  , ART ESPECIALLY .\n\nGive an artist $2000 to make something sell it to yourself for 100,000k   the business makes 70k after taxes you put in your pocket as clear real money.",
            "title_similarity": "0.6211345"
        },
        {
            "id": "i0ng6h3",
            "score": 1,
            "text": "Who do you sell to? What's the best time to call them? And where do you get the little baggies from?",
            "title_similarity": "0.516683"
        },
        {
            "id": "i0ngp2w",
            "score": 2,
            "text": "The reason money laundering works so great with art galleries / artists, is because art can *easily* be sold for values well beyond its innate value (it's just canvas and paint), and people generally expect that as reasonable.\n\nThink about \"modern art\", like **No. 5, 1948 – Jackson Pollock** that sold for $140 million.  An extreme example of some canvas with paint that was angrily thrown at it to create what most would say looks like a mess.\n\nLet's say you and a partner rob a series of liquor stores, and end up with $10,000 in cash.  You can create something like No. 5, and have your partner \"anonymously purchase using cash\" your painting.  You now have $10,000 of legitimate income from an art sale.  (It works better if you claim that it's a series of sales from art booths at craft fairs across the country, but you get the general idea.)",
            "title_similarity": "0.6775122"
        },
        {
            "id": "i0nl24t",
            "score": 1,
            "text": "Most answers deal with money laundering, but I see little about the relation to the sale of arts. \nNot my area of expertise but as I understand it arts are seldom used as a money laundering scheme but more so as a vehicle to disguise illicit transactions. \n\nLets say Bob provides you with a not-so-legitimate service and demands payment in “clean” money. \n\nYou have a couple of options to pay, like (A) Bob billing one of your money launching companies for services rendered. The problem is the government asking “What services? Where is the proof that services were rendered?” \n\nAnd even if you can prove a certain legitimate service rendered, it needs to be at market value, or the government will smell trouble and audit both of you. \n(A) seems a bad option. \n\nAnother option (B) is to disguise the transfer as a sale of a piece of art by Bob to you for a heftily increased price. \nSince arts is subjective, it’s a lot harder for the government to prove you payed above market value (as there really isn’t one). \nAnother bonus is that in most jurisdictions you need to disclose the people you provide services for and receive services from, so (A) would provide a direct link between you as the owner of the business and Bob. The sale of a piece of arts on the other hand might get registered on the provenance, but isn’t normally directly disclosed to the government, so unless the government is really looking, they won’t notice a direct link between you and Bob. \nExtra bonus: the increased value of the piece of art is often not taxed or taxed very little. \n\nTLDR: The sale of art isn’t usually used to launder money, but to transfer “clean” money between 2 parties ik order go pay for illegal services or goods.",
            "title_similarity": "0.70253843"
        },
        {
            "id": "i0nm66w",
            "score": 1,
            "text": "Your school buddy Aaron regularly finds money money in his parents room. But his parents would notice if he suddenly had an extra $20 a week to spend on games instead of his $5 allowance. You run a lemonade stand and you and Aaron come up with a plan. Aaron picks lemons from his yard which you buy for $20. Aaron then buys a $10 lemonade from you.\n\nAaron's running a booming lemon business and your lemonade recipe is clearly the best. Both your parents are proud of your grasp of modern business.\n\nFrom here the rest of the complication is just making it harder for the parents to figure out the fraud.\n\nIn the real, Art is especially enticing as a laundry as there is lots around and the price is subjective. A $20 lemon is obviously scetchy but buying a $1,000,000 painting for $1,200,000 then selling another for $1,100,000 is much easier to justify to the authorities.",
            "title_similarity": "0.35984555"
        },
        {
            "id": "i0nqqyz",
            "score": 1,
            "text": "Okay so I'm just going to add, that historically the best ways to launder money is with services not products. Art is a decent method because the value is subjective but the point is to launder your own money via fraudulent transactions. So giving your money to someone who will then buy a relatively worthless piece of art from you can still raise red flags even if there is a \"paper trail\" on how you earned that money (by selling the artwork). \n\nIf I give Johnny Nobody 1 million dollars I made from selling drugs and he then buys a piece of art from a business I own for that 1 million dollars, then that's still a big red flag. How did Johnny Nobody get 1 million dollars why did he spend so much on this art work? You need transactions that can't be easily investigated. \n\nThis is why strip clubs have been very effective. Men already spend too much of their own money there, and they don't receive a product. How can the IRS check to see if people are actually getting 2000 dollars private dances? They'd have to send someone there to watch and try to calculate how often people are getting private dances and how much everyone is throwing on the show floor and strip clubs are not known for being well lit.\n\nThis is why the consipiracies about mattress stores being money laundering fronts is ridiculous. Every transaction has a fucking mattress tied to it. You'd either have to fake every step in the process of acquiring a mattress from a wholesaler and then also selling it to a fake person. Or you'd have to actually acquire the mattresses, ship them out to an army of Johnny Nobodies. Have those Johnny Nobodies send them to a company that \"recycles\" them in China or Mexico. Slap a new shipping label on them and send them back as a shipment of new mattresses. All while keeping your sales low enough that the IRS or FBI doesn't investigate who is buying all these mattresses. \n\n&#x200B;\n\nGolf course driving ranges are a being slept on for laundering money IMO. Patrons don't receive anything, they're just paying you to let them hit the balls. And there is very little upkeep you basically only need 2 people working for minimum wage or very close to it.",
            "title_similarity": "0.731946"
        },
        {
            "id": "i0ntu2m",
            "score": 2,
            "text": "Let's say you make meth for the cartel.  You get paid hundreds of thousands of dollars for it.\n\nYou buy a car wash that you used to work at as your second job because the current owner is an asshole and it makes complete sense that you'd want to buy your asshole boss' car wash.\n\nYou ring up fake receipts for 20s all day while you are doing regular business with customers.  Busy times of day means you can ring in more fake car washes around that time too.  You make it look consistent so that these receipts fit what customers actually do (some want wax while some don't).\n\nAt the end of each day you have your regular income from actual customers mixed in nicely with the fake business funded by your money your meth production.",
            "title_similarity": "0.52982235"
        },
        {
            "id": "i0nw8yn",
            "score": 2,
            "text": "Money laundering is simply using some mechanism to legitimize money from the IRS’s perspective.\n\nIn this example people are using art as a currency by buying art for more than they declare and selling it for more than they declared they bought it for.",
            "title_similarity": "0.8862155"
        },
        {
            "id": "i0nyefi",
            "score": 2,
            "text": "So you have a local Go-kart track and you lease the karts from the local organized crime group, you also lease the arcade machines from the organized crime group, so.\n\nYou receive 12.000 dollars a month of dirty money, 2000 is your end and the rest is payed as lease and profit sharing according to the lease agreement. On the side you have a café, you lease the kitchen equipment, tables and chairs, magazine display racks at a little higher rate than average. On paper it's a ongoing business and this is what launders a volume as it's every month.",
            "title_similarity": "0.4630016"
        },
        {
            "id": "i0o1v4g",
            "score": 2,
            "text": "I keep re-reading these comments and trying to figure which one of you is Marty Byrde.  Or maybe Jonah Byrde is here.  He seems more likely to be on Reddit.",
            "title_similarity": "0.3860502"
        },
        {
            "id": "i0o49pn",
            "score": 1,
            "text": "Money laundering got it’s title, according to author Gus Russo (Supermob, The Outfit), when Chicago Outfit figure Murray Humphreys used Chicago area laundries to handle money generated from illegal activity through them. Humphreys may have inspired the ‘Tom Hagen’ character in The Godfather books and films. Russo’s books are well worth a read..",
            "title_similarity": "0.6417878"
        },
        {
            "id": "i0ogv30",
            "score": 1,
            "text": "You own a car wash but secretly run a meth business. You have tons of cash from selling meth that you need to turn into legitimate money that can be deposited in a bank. You overreport your earnings and that over-reported amount is the meth money that you claim as profits from the car wash. You can now deposit some of that meth money in the bank because it has been taxed and the bank presumes that it is car wash money.",
            "title_similarity": "0.67560595"
        },
        {
            "id": "i0ovtvd",
            "score": 1,
            "text": "I've always thought opening an ad agency would be a great way to launder. You charge tens of thousands of dollars for planning, strategy, design, internal and external reviews, and have a large team working on campaigns. $150k spent on a single mid-level 30sec commercial. In reality you have no-show jobs, a freelance designer spending four hours on something you claim took 20, and bill your \"client\" $200 an hour. The commercial? Anyone with an iphone can cobble something \"edgy\" together. Every piece of advertising has a ton of hours in analytics, project management, strategy, client services, and more. It can all look very legit, as like with art, quality is subjective. Even better, buy an outdoor media company to post those \"ads\" and move even more money through them. You can set up a legit agency with real employees and launder through a small segment of fake jobs.",
            "title_similarity": "0.38945848"
        },
        {
            "id": "i0un403",
            "score": 1,
            "text": "One example would be a casino owned by organized crime.  After each lucrative shipment of illegal contraband is sold, a couple of mid-level criminals come in and buy a large number of chips in cash.  They spend some time on the floor drinking, flirting, and playing badly - by the end of the night all of the money from the contraband is now legitimate earnings for the casino.\n\nThe gangsters can make this work better if instead of owning one casino outright, they instead own a small stake in a whole bunch of casinos - with the agreement from the other owners to keep the clean money available for the gangsters as needed.  The other owners would commonly be family members or friends who are able to live above their means from the legitimate position but are otherwise unqualified for the role.  Stepping out of line and attempting to mess with the money would be a quick way to end up murdered.",
            "title_similarity": "0.6120665"
        },
        {
            "id": "i0xol3z",
            "score": 1,
            "text": "Laundering: To conceal the source of money as by channeling it through an intermediary… to conc… um…",
            "title_similarity": "0.7992076"
        },
        {
            "id": "i3w9vsm",
            "score": 1,
            "text": "I remember my husband had given me $100.00 on our Honeymoon in Las Vegas & I only spent $20.00 on the penny slot machines and food (while I pocketed the other $80.00) and it's a good thing that I did pocket that $80.00 bcuz that was our gas money, to get back home. He gave me more money, after seeing what I did with it!",
            "title_similarity": "0.38311428"
        }
    ]
}