{
    "ELI5: Why are password managers considered good security practice when they provide a single entry for an attacker to get all of your credentials?\n": [
        {
            "id": "i13e9nx",
            "score": 5,
            "text": "A lot of the problems talked about in this thread could be alleviated if places would stop putting a million contradictory constraints on passwords. If you make it be exactly 10 characters, must rhyme with orange, must use 3 symbols with prime ascii codes, and every letters in an odd spot be the first letter in an Edgar Allen Poe work. Im gonna write that shit on a sticky note, use the same one as many places as I can (because it takes 3 hours to generate), and update it (when forced every 17 days) by iterating the last number. \n\nObviously an exaggeration, but I hate security IT people. They have no understanding of how people actually use computers.",
            "title_similarity": "0.5257424"
        },
        {
            "id": "i12w34e",
            "score": 1,
            "text": "The managers are very cryptographically secure. They use a lot of hashing and other methods to protect your passwords so that they become near impossible to brute force or crack. They are incredibly secure and should be used whenever possible.",
            "title_similarity": "0.7256342"
        },
        {
            "id": "i13d0co",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.030960476"
        },
        {
            "id": "i12zisd",
            "score": -2,
            "text": "Imagine the following:\n\nYou use a password manager. Your password manager is secured with what you'd call a master password - your master password is your a quote from your favourite show where you add one to every letter and then do some leet-speech. Say, the quote was \"May the force be with you\", then your password would be Nb2u!f9p$dfcfxju|2pv. Replace a few lower case with upper case letters.\n\nThe strength of a password is determined by a few things.\n\nOne, how many permutations are there for that length of password with the selected symbols. In this case, you'd have (number of possibilities per symbol) to the power of (number of symbols), so here 65 ^ 20, and that's only assuming the three special characters I used, in reality there's a lot more options because you can also use things like underscores, dashes, slashes, and so on. That takes a *really* long time to crack. Like, heat-death-of-the-universe-long. And no amount of improvement to our technology will really change that... Doubling the speed of our computers will mean that instead of millions of years, it'll take half that. We'd have to use entirely new technology (i.e. quantum computers) to crack this in a feasible time.\n\nThe second thing is that generally, the easier a password is to just guess, the less secure it is. Kinda obvious, I know, but that's why the length of a password alone doesn't matter. If your password is just a random chain of words, it doesn't really matter that it's 50 symbols long because a so called dictionary attack can easily crack it.\n\nNow, and that's the reason why password managers are considered good practice: no human can remember a dozen or three of such passwords. If you want them all to be unique and unguessable, that just won't work. So instead having one really secure password that you need to remember is a lot safer, and the passwords that you can then store in the manager can be even more secure - because you don't need to remember them! You could literally have Romeo and Juliet, randomly changed by some algorithm, as a password, as long as whatever you use it for allows that many symbols.",
            "title_similarity": "0.75026953"
        },
        {
            "id": "i12wkjy",
            "score": 7,
            "text": "It’s a good question.  You are betting everything on it being secure and that the business havnt cut corners/ left back doors/ got a disgruntled employee.\n\nSo they should be seriously encrypted.  But you are buying a black box.",
            "title_similarity": "0.63851666"
        },
        {
            "id": "i13mbo1",
            "score": 2,
            "text": "Well y'know why buy a notebook for 2.00 when you could pay a yearly subscription to a website managing service?",
            "title_similarity": "0.4137147"
        },
        {
            "id": "i136ge5",
            "score": 0,
            "text": "I have a text document with truncated/abbreviated user names and passwords. Like if my password is BradDawson2000!, I'll write down BD2k!. Let's me use a variety of passwords without explicitly writing them down. If you aren't in my head, you probably won't figure it out. \n\nAlways enable 2 factor authentication on every website you use though. And if it doesn't have 2fa, consider not using it.",
            "title_similarity": "0.7349274"
        },
        {
            "id": "i139h3n",
            "score": 0,
            "text": "Short passwords can be brute forced easily. A password manager allows you to give everything a long password and you don't have to remember it.  Here is a chart;\n\n[https://www.komando.com/security-privacy/check-your-password-strength/783192/](https://www.komando.com/security-privacy/check-your-password-strength/783192/)\n\nBasically anything that isn't at least alphanumeric and over a dozen characters is pointless.",
            "title_similarity": "0.77443755"
        },
        {
            "id": "i139qv1",
            "score": 0,
            "text": "If you set a bad & weak password for your password manager, you would indeed be making yourself _way_ less secure.\n\nBut you can (and should) set a **very** strong password for your password manager. A diceware passphrase consisting of six or more entirely random words makes for a very secure password. The entropy is thru the roof and even if somebody knows exactly that it's a diceware passphrase with 6 words separated by spaces, the combinatorial explosion of which 6 words in what order would still take the best computers hundreds if not thousands of years to crack by brute force.\n\nA password like this is very strong, and not terribly hard to memorize after a few days or a week of regular practice. But it's too much to have complex passwords like this for _everything_. You should never reuse the same passwords multiple places, so you'd have a long diceware password for your computer's disk encryption, your logon password, your Reddit password, your banking password, and all of these would need to be different passwords for security. That's a lot! And so it's no wonder that people don't use a bunch of strong passwords everywhere, they might come up with two or three common passwords they use for various sites but they're reusing them multiple places. When one of those sites gets hacked, and if a hacker figures out your password by brute forcing against the stolen hashes, and that password is also used on 20 other websites that you log into with that same email address or username.. they hack all your stuff.\n\nAnyway, with a password manager, you only need a long & strong password for **one** thing now. Your password manager. You don't use that password on anything else, and it's not too much of a burden to memorize a long diceware password if you only need one of them. So you have one _really good_ password for your vault, and with your password manager you give every site you sign up on an _even better_ utterly random password. Like every site password is random letters, numbers, every symbol on your keyboard, every password looks like opaque noise that a human being could never memorize. And that's good! You don't need to worry about those passwords, your password manager stores them, you only worry about your master diceware password.\n\nCombine that with 2FA and other things your password manager supports, and ain't nobody getting in.\n\nJust don't use \"hunter2\" as your password manager's password, or else it doesn't matter _what_ passwords you use on all the sites you use, if the hacker gets into your weakly protected password manager it's game over as you predicted.",
            "title_similarity": "0.7453827"
        },
        {
            "id": "i13gf9h",
            "score": 0,
            "text": "The Eli5 answer is that the single point of entry as you call it is virtually impenetrable due to password encryption\n\nIt's not completely impenetrable, obviously, but the amount of resources needed times the likelihood of cracking it means that the person or software with ill intent is going to have better luck guessing your password than actually deciphering it\n\nTrying to crack it would literally be a giant waste of time for hackers",
            "title_similarity": "0.7590163"
        },
        {
            "id": "i13j1oh",
            "score": 0,
            "text": "In addition to the other replies, one point I haven't seen mentioned is some(?) password manager does not store your passwords at all. Instead they are what's called a hash function, which produces a random text for some amount of input. That input usually includes site name, username, master password, length, whether to use symbols etc. And the key is, for the same input, and only for the same input, it will always produce the exact same output. So as long as you input the same master password, site name, username etc., you will have your correct password generated on the fly, hence that password never has to be stored anywhere. And better yet, the output does not contain the information necessary to reconstruct the input without brute force, so even if someone manage to get your password for a specific site, they can't feasibly guess your master password in any reasonable amount of time.\n\nDownside to this kind of system is it is a very clear tradeoff between convenience and security for your master password - if you don't want it stored anywhere for the best security, you would have to type it out every time. You also want the longest and most complex master password that you are willing to memorize and use.\n\nOne thing to note is that hash collision, where different input produces the same output, is technically possible. But the chance get exponentially lower the longer you make the password. And for most password managers the default makes that chance virtually impossible.",
            "title_similarity": "0.7388866"
        },
        {
            "id": "i13mzco",
            "score": 0,
            "text": "They are not a good security practice, they are good business continuity / documentation practice.  \n\n\nGood security practice is implementing MFA enterprise-wide, including with the password store.",
            "title_similarity": "0.7246926"
        },
        {
            "id": "i14gyph",
            "score": 0,
            "text": "“They are locked up so nobody can see them except you.  Passwords are like underwear….change them often and dont share them and dont let anyone else see it.”",
            "title_similarity": "0.5426773"
        },
        {
            "id": "i14pko8",
            "score": 0,
            "text": "Password manager locked behind multiple factors of authentication such as a physical key isn't going to get cracked, so it let's ya store very complex and random passwords for other sites and systems.\n\nIt's eggs in one basket kinda thing but it won't be gotten into without physically having the key and knowing the password, easier target would be your average Joe using the same password based off their dogs name for everywhere.",
            "title_similarity": "0.7692584"
        },
        {
            "id": "i14q2oe",
            "score": 0,
            "text": "You still need to protect your password manager. Use a *very* strong password and make sure it is not written down anywhere near your computer devices. And use a secondary method of authentication if you can as well, such as a private encryption key, passcode, etc",
            "title_similarity": "0.7204684"
        },
        {
            "id": "i14q3wt",
            "score": 0,
            "text": "You raise a good point but the sad truth is that most people use the same username and password for all their accounts.  Hacking often involves getting into the account with the worst security and using that information to get into another more secure account, and so on and so forth.  I would say that password managers are generally more secure than the least secure service that you have.  I'd guess they're pretty good.\n\nThat being said, if a password manager service is not financially solvent, it might be highly profitable to release the stored passwords that it has, while going bankrupt and claiming that it was merely hacked.  I'm a bit worried now actually.  \n\nThinking too hard about security can get you in trouble.  At the end of the day, it's pretty hard to guarantee security, unless you understand all the source code that's involved.  And that's quite a tall order, frankly.",
            "title_similarity": "0.794946"
        },
        {
            "id": "i14qjen",
            "score": 0,
            "text": "If your password manager is online that's certainly a risk. Personally I don't like cloud based ones.\n\nIf you have your password manager on your local machine, a bad guy has to hack into the machine first, which is less likely than hacking a website with bad password storage tech.\n\nThe main reason password managers are good is because you can have a different, long, random password for everything and not have to memorize them. You do still have to memorize a long password for the password manager, but that's easier than memorising hundreds.\n\nI feel like neither my ir anyone else's aswers would actually help a 5 year old though.\n\nFor that, think of it like putting all your money in a single bank account vs giving everyone you know $100 of your money to look after it for you. So long as the security of the bank is good, you'd much rather have it in the bank",
            "title_similarity": "0.76318634"
        },
        {
            "id": "i162ki5",
            "score": 0,
            "text": "What happens if there is a war at BitWarden country?",
            "title_similarity": "0.28613245"
        },
        {
            "id": "i16p6sw",
            "score": 0,
            "text": "They aren't.     \n\nLoose the device or access to your password manager; welcome to the FRESH HELL of trying to access all your accounts.\n\nOnline Password Managers == someone else know your password.  LOL",
            "title_similarity": "0.76877964"
        },
        {
            "id": "i16q39n",
            "score": 0,
            "text": "Because compared to regular websites, password manager services should have their databases salted, hashed and encrypted with a super long complex password behind it.\n\nSo even if a hacker steals their database, they will not be able to hack it and get the username and passes of users in their lifetime.\n\nThis assumption is taken on pure faith of course.\n\nUnfortunately, the majority of people use the same exact same username and password on all websites.\n\nSo when a weak forum gets hacked and the user details are stolen, the hackers usually gain access to all the other major services for that user.\n\nNow if a user does this and uses their master password (for the password service), on other websites, well, that's a special kind of stupid.",
            "title_similarity": "0.8183701"
        },
        {
            "id": "i134bri",
            "score": 1,
            "text": "On top of the other responses, my password database only exists on devices I control. There's no public access.  To get to it requires infiltrating a number of devices.  Once you have it, it's also using a cryptographically secure hashing function that's more difficult to crack via brute force.",
            "title_similarity": "0.76734424"
        },
        {
            "id": "i138p17",
            "score": 1,
            "text": "What is a good password manager app?",
            "title_similarity": "0.6580945"
        },
        {
            "id": "i13zfku",
            "score": 1,
            "text": "There's a lot of downsides to not using a password manager:\n\n* People tend to make bad passwords. This is an inherent side effect of making passwords memorable.\n* People tend to reuse passwords. This is an inherent side effect of needing to remember all your passwords.\n* Or if the above two don't apply to you, then you're likely forgetting your less-used passwords.\n\nIf the first point applies to you, you're increasing the number of weak spots that you have. Now instead of having to crack a specific strong password, they can crack _any_ of your dozens of garbage passwords. From there it's a lot easier to gain access to your other account by impersonating you.\n\nIf the second point applies, you're just one database leak away from getting destroyed. One obscure service that you don't even remember signing up for will get hacked one day, and the username and password that you used there will become public knowledge. And now the bots will get to work, trying to gain access to other services with that username and password combination. And they will succeed eventually.\n\nIf the third point applies to you, well, you're forgetting your passwords. The downside is self-explanatory.\n\nUsing a password manager is like placing all your eggs in one basket, an extremely secure basket that has shock absorbing properties and nicely cradles the eggs. Not using a password manager is like carrying all your eggs in dozens of flimsy straw baskets, and then trying to juggle the baskets.",
            "title_similarity": "0.6429492"
        },
        {
            "id": "i139wr4",
            "score": 10,
            "text": "A password manager does provide a single entry point, but for someone to breach your password manager they first need access to a device you use, which implies that you are someone worth hacking.\n\nAre you really so interesting that that's likely?",
            "title_similarity": "0.865837"
        },
        {
            "id": "i137vr1",
            "score": 12,
            "text": "Two main reasons:\n\n1) Each website and service you sign up for will get a randomly generated and practically impossible to hack password. So if shittypizzaplace.ru has a little data leak accident, none of your other online accounts are in danger because that stolen password is useless for all your other online accounts.\n\nOkay, so the solution is to just use different passwords on different sites, right? Exactly! But they are difficult to come up with and remember. \n\n2) Using a password manager allows you to use one, long, good, strong password for the password manager itself. You don't have to worry about creating many different strong passwords - just one. The password manager itself handles all these different strong passwords for you, and it can be combined with biometrics on your phone as a 2-factor verification. \n\nAnd of course, there are some other reasons. It's more likely that your password gets leaked from one of the hundreds of sites you've signed up for, compared to your personal device's password manager getting hacked. So in the more likely scenario that your password is leaked, you want that information to be useless to the bad guys. In that very unlikely scenario that they are already \"in your device\" and able to use your password manager, they've probably got full control of your entire device anyway and it",
            "title_similarity": "0.8147168"
        },
        {
            "id": "i13btt6",
            "score": 2,
            "text": "Incorrect premise.  Most password managers are not single entry.  If yours is, you are doing it wrong.\n\nMost password managers require that you a) have physical access, and b) know a secret (such as a master password).  Many also require additional access such as biometrics.  So that means that an attacker has to simultaneously defeat 2 or more different defenses.\n\nMeanwhile, on the web, your account for Reddit might only require a password.  That is much easier to attack.  If having a password manager makes it possible for you to set a maximally difficult password for your Reddit account, then it's worth it, because it means that directly attacking your Reddit account is hard, *and* getting into your password manager is hard.\n\nOf course you can also make it even more secure by using multi-factor auth for Reddit.\n\nAt that point, you have now shifted password-based attacks so far into the realm of high difficulty that they just aren't going to happen.  You have made it much more comparatively easy for your account to be compromised through an attack on Reddit itself.",
            "title_similarity": "0.8084235"
        },
        {
            "id": "i13g71x",
            "score": 2,
            "text": "Also consider that passwords can be obtained through keyloggers. Hackers can determine your password if they recognise a certain string being keyed in frequently. Password managers remove the input.",
            "title_similarity": "0.81392777"
        },
        {
            "id": "i13zbe5",
            "score": 4,
            "text": "You can use lots of very complex auto-generated passwords everywhere, the type that you couldn’t possibly remember, so all your accounts are very secure\n\nAnd then you only have to remember *one* really complex password, and secure that account with 2 factor authentication (possibly more than one form)\n\nIt’s easy-ish to remember one long complex password, but there’s no way you’d remember 50 of them\n\nEg my password manager requires me not only to enter a password, but also to confirm via email, an Authenticator app, and possession of another device of mine logged into the same password manager.\n\nThe chances of someone being able to access those things simultaneously are very low\n\nThat would be a complete hassle if I had to do it for every account, but if I just log into a password manager once and then that logs into everything else, that’s not too much bother",
            "title_similarity": "0.7977979"
        },
        {
            "id": "i14jewm",
            "score": 8,
            "text": "There’s an old saying, don’t put all of your eggs in one basket.  \n\nWhile true for many things, the corollary is also true, put all your eggs in one basket and watch that basket like your life depended on it.   \n\nUnlike most websites, password managers, at least most of the good ones, allow you to have multiple layers of protection.  \n\nFor instance, you can protect the password manager with a very secure password AND require a second form of authentication.  \n\nPersonally, I used a hardware token by Yubikey (Google and others make them as well) so you have to physically have this key plugged into your USB in order to login.  \n\nSo someone would have to crack my password AND have my physical Yubikey to get access to my password manager.",
            "title_similarity": "0.76204515"
        },
        {
            "id": "i14fivu",
            "score": 10,
            "text": "TLDR at bottom.\n\n1Password (and some other tools) use a system that ALSO involves a secret key.  This key is **entirely unrecoverable** since 1Password doesn't even have that information on their servers.\n\nTo get into your 1 password on a device you have used before, you just use your password.  But to get into it on a NEW device (or browser or application), you must also provide the secret key.\n\nSo your passwords are effectively **also** protected by a very long \"password\" with the secret key, on top of being a good password to start with.\n\n\nAlso, if you _aren't_ using a password manager, you are probably reusing passwords or writing them down.  Both of those options are **extremely** exploitable.  Either by finding your passwords IRL, or by finding your reused password in a password dump.\n\nPassword managers make it easy to create complex and unique passwords which solves this issue, and 1Password will also tell you if a given password is in a known, leaked database.\n\n\nOn top of all of that, they also make it super easy to set up 2FA on many sites.  Which further means that even if your complex, unique password is compromised somehow.... They would still need to generate a valid 2FA code.\n\n\n**And on top of that**, 1Password remembers what sites you have set up for filling that password.  Which means when you're being phished (shown a lookalike page with a slightly different URL) and you're being asked to enter your login, 1Password won't automatically offer to fill it (unlike it would on the regular site.  This can give you the extra opportunity to notice the phishing and avoid it.\n\n\n_And the value keeps coming_.\nInevitably, you will find that you need to share passwords with people occasionally. 1Password provides family plan options that let you have separate accounts that can have their own private vaults of passwords, and a shared vault that all of the family can access. So you can have shared passwords that are complex and unique and easy to use.  And even for people who aren't in your family, you can send them private links to view a password you want to share with them for a limited number of days or for even a single visit.\n\n\n\n\nAnd, it is just $4/month for a single user.\n\n\nTLDR: Password managers are extremely easy to use.  Almost easier than using a single good password across every login (but without being a disaster). They help you avoid bad habits, and make good habits way easier. I will never go back to living without one. 1Password gets a 10 out of 10 recommendation from me.\n\nI shill for password managers at every opportunity.",
            "title_similarity": "0.78351665"
        },
        {
            "id": "i13ysdz",
            "score": 13,
            "text": "I work in tech support.  One day a lady calls in because after a phone update, her third-party password manager app stopped working.  The app developer decided to stop supporting the app after the phone software update, and there is no option to roll back the phone software.  Needless to say, she lost all her logins and passwords that she entrusted to this app, and there was nothing anyone could do about it.",
            "title_similarity": "0.45945376"
        },
        {
            "id": "i12zi6m",
            "score": 272,
            "text": "Have a look at this chart:\n\nhttps://www.weforum.org/agenda/2021/12/passwords-safety-cybercrime/\n\n1 super strong password on your password manager and it's next to impossible to crack with current technology.\n\nUsing a password manager and changing your passwords easily and regularly would be the answer. \n\nIt's very rare for a password manager company to have a leak of details, because they would be more likely to have it under heavy encryption, unlike most websites where passwords are leaked from.\n\nSince you would be using different strings of letters and numbers for passwords with a password manager, not the same one on every site, it makes it very secure, especially when there is more than 1 method used to enter your password manager.",
            "title_similarity": "0.7870157"
        },
        {
            "id": "i13e4ft",
            "score": 31,
            "text": "Hackers usually work off of leaked information from specific sites.  \n\nIt takes a lot more effort to send out viruses to get into other people's computers to try to get directly into their password managers.  \n\nFor every person that uses a password manager and multi-factor authentication there are probably 10 people whose password for some random website like a forum with no real security is the same as their email and bank accounts.  \n\nIt's just like thieves breaking into a house.  They usually move on from houses with cameras and a locked door because in the time it takes them to break in and steal stuff they could go down the block and find a few houses that didn't lock their door and steal twice as much stuff from those houses.",
            "title_similarity": "0.72360003"
        },
        {
            "id": "i136dr0",
            "score": 35,
            "text": "Something I didn't see mentioned by others is that you can use an arbitrarily long passphrase for you master password, easy to remember and very hard to break. \n\nYou can't do that in a lot of places that require a password as each have very different sets of security rules, including not allowing passwords over a certain length or with certain special characters.",
            "title_similarity": "0.66015106"
        },
        {
            "id": "i145aot",
            "score": 146,
            "text": "[removed]",
            "title_similarity": "0.030960439"
        },
        {
            "id": "i13ap47",
            "score": 96,
            "text": "Best recommendations for a good free password manager? I need one after reading the replies.",
            "title_similarity": "0.69183815"
        },
        {
            "id": "i1378jm",
            "score": 669,
            "text": "What are the chances that the average internet user can use a strong, completely unique password for every online account they create and remember all of them in their head? Literally zero.\n\nPeople will instead either use the same password everywhere or write them down on notes next to their computer or in their notes app, all of which are *very* insecure.\n\nA good password manager has a ton of advantages:\n\n* It encrypts all your passwords using a master password and other forms of authentication (like fingerprint) so leaking all of them is very unlikely\n* It has a built-in strong password generator\n* It has browser autofill which validates the URL of the page you are on, so you won't accidentally enter a password on a phishing site which resembles the real one\n* Services which store your passwords in the cloud still don't have access to them in plain text. The encryption key never leaves your device, so even if their databases get leaked your passwords won't be exposed.\n\nOverall, while keeping all your passwords in the same place does have some amount of risk, the advantages greatly outnumber it.",
            "title_similarity": "0.8352419"
        },
        {
            "id": "i12wfac",
            "score": 2093,
            "text": "Because they prevent you from doing worse things- like using bad passwords because they're easier for you to remember, or reusing the same password for everything, or writing down your passwords\n\nEdit: for those asking, writing down your password is particularly dangerous in shared spaces (like corporate offices). Imagine a scenario where a school teacher, who has access to all of the students grades and personal information, has their password written on a sticky note on their monitor",
            "title_similarity": "0.7020142"
        },
        {
            "id": "i13josh",
            "score": 246,
            "text": "before password managers people were reusing passwords everywhere and they were all short, often dictionary based passwords like:\n\n    Sherbet77\n\nthis password is easy to brute force as it is based on a dictionary word. this plus its length makes it have low entropy, meaning its easier to crack.\n\nmore importantly though, if you used it for your facebook you probably used it for your email too. and at that point people can get all your passwords via resets, even if they arent all the same or similar.\n\nwith a password manager you remember one password, ehich should be long but doesnt need to be hard to type or remember.\n\nxkcd's \"correct horse battery staple\" is a good example of a password that is fairly good even though it is made of  dictionary words and therefore easier to remember.\n\nbut more importantly your access is usually secured with two factor authentication, so you dont just need to put i nyour password, you also need to type in a code or accept a prompt on your phone with your fingerprint to allow a device to access your passwords. that severely decreases the ways people can access your passwords.\n\nand pasword managers are starting to go even further now. risk-assessments are made every time someone tries to log in and that changes how the login is handled. \n\nfor example a login might not be allowed over an unsecure connection or from a foreign country without extra steps being taken to confirm it really is you wanting to access your passwords.",
            "title_similarity": "0.71954924"
        },
        {
            "id": "i1316l6",
            "score": 12525,
            "text": "If you use the same password everywhere, you have *a lot* of single entries rather than just one. If any poorly designed site gets hacked and your password is leaked, the attacker can access your other accounts, even on better-secured sites.\n\nSo in this case, a single point of entry is a good thing. It reduces your *attack surface*--the amount of things that can go wrong. You only have to protect and remember one password, rather than one for every site.\n\nAlso, remember that there's another single point of failure: email. If an attacker can access your email, they can \"Forgot Password\" the other sites you use. That's why it's especially important to keep your email password secure.",
            "title_similarity": "0.8424741"
        },
        {
            "id": "i12y94f",
            "score": 444,
            "text": "[removed]",
            "title_similarity": "0.030960439"
        },
        {
            "id": "i134fls",
            "score": 1,
            "text": "One thing that hacks me off are the 'secure' sites that ask for random characters from your password.\n\nNot only does it mean that using a locker and random passwords is harder, it also means they ( and therefore others ) can decrypt your password.",
            "title_similarity": "0.77823013"
        },
        {
            "id": "i13a8js",
            "score": 1,
            "text": "Remembering 100 different passwords is hard, so we tend to use simple, easy to remember (read: easy to hack) passwords, as well as re-use those same crappy passwords over and over.\n\nUsing a password manager means your 1 \"master,\" password can be longer and more secure. It only takes most people a week or so to be able to recall a 12 character random password from memory, but it's very hard to hack. All the other passwords can be generated random passwords, but you don't need to remember any of them. \n\nAlso most password managers have 2FA (2 factor authentication), meaning the 12 character password + fingerprint is going to be incredibly hard to get into.",
            "title_similarity": "0.65340006"
        },
        {
            "id": "i13agi3",
            "score": 1,
            "text": "Something also not mentioned here. Passwords managers with proper domain detection auto fill also help prevent phishing attacks. A site might copy the web page of a service you use, a have a similar enough domain that you don’t notice, but the password manager will not auto fill it.",
            "title_similarity": "0.6996865"
        },
        {
            "id": "i13bupm",
            "score": 1,
            "text": "Two things:\n\n1. Think of a password manager like a safe deposit box. In order to get access, you need a key that only you have, along with a key that only the bank has. A well-designed password manager should *never* see your password in plain text. It should be encrypted with your master password before you send it to be stored. \n2. Passwords are keys. They provide access. It is convenient to have your house, car, office, and gym locker all use the same key, but it is also very unsafe. A password manager makes it easy to create passwords that are hard to decypher using common attacks (dictionary attacks, brute force, etc), and that are unique.",
            "title_similarity": "0.81538844"
        },
        {
            "id": "i13c9tz",
            "score": 1,
            "text": "Best practice is to have 2+ factor authentication on you pw manager.\n\nAlso compare to alternatives. Without a pw manager, realistically you will have to use same/similar login for multiple accounts. That’s even worse.",
            "title_similarity": "0.69578385"
        },
        {
            "id": "i13cjzl",
            "score": 1,
            "text": "Because it is a single point that is far more easy to secure.\n\nReally secure passwords should generally be super difficult for people to remember. So you're not going to remember a dozen different passwords. Which means every other password is either super easy to figure out, or you have them written down somewhere unsecured.\n\nWith a password manager, you get the best of both worlds. You can make the password SUPER hard to remember and then you only need one single password, so you don't right it down. But then all of your other passwords are just random collections of letters and numbers and symbols and spaces no one could remember, but they're all in one secure place.\n\nBasically your question assumes that any password is as easy to get past as any other, so a dozen different easy passwords means if they figure out one they only have access to one, when for the same effort they can get into your password manager and have access to all. But what makes a password manager more secure when used properly is that it allows you to upgrade the security of every single password you have. And the way passwords work we're not talking 3x as hard. We're talking, for someone to hack your password, instead of taking 7 weeks, it takes 3.2 billion years. I am not exaggerating. Yes, there's the fact that you must learn to use a password manager well to get the full benefit of it. But if used properly, which is not especially difficult to do, the increase in security is beyond compare.",
            "title_similarity": "0.7447048"
        },
        {
            "id": "i13d0al",
            "score": 1,
            "text": "While its true that password managers do provide a single point of failure, the benefits they provide create a much better environment for potentially better security, but it still depends on the user to make good choices.\n\nOne of the keys to making a more secure password is making it harder to guess.  Making it harder to guess also usually makes it harder to remember.  It is much much easier for a person to remember ONE hard to guess password for a password manager than MULTIPLE hard to guess passwords for each service they use.  So the primary goal of using a password manager is to get them to create one very good password and only have to remember that.\n\nAdditionally if people are required to use somewhat complex passwords (has upper and lower case letters, numbers, special characters, is a certain length, etc.) they will be more likely to reuse the same password for multiple sites.  This is a problem because if one site is compromised the hacker potentially has access to the other sites the person uses as well.  Using a password manager means that each site can have a unique and hard to guess password, you as the user don't need to even know what they are, so they won't be reused.\n\nA third factor is how likely you are to be targeted.  A service or company that has a database of passwords for hundreds to millions of users is a FAR more inviting target than just you alone sitting at home on your computer.  Why would a hacker try to target just your password manager and that one password rather than try and compromise Amazon or Google or Netflix and get ALL their users password data.  So the effort of just trying to get your individual password is usually not worth it.\n\nBut all of this is meaningless if you don't create a good, unique, hard to guess master password to begin with.  Or if you reuse that password elsewhere.  Or if you write it down somewhere other people could get to it.  A password manager doesn't guarantee security, it just provides you a tool to practice better security practices.  Ultimately the user, aka you, are the biggest security risk and single point of failure.",
            "title_similarity": "0.7148638"
        },
        {
            "id": "i13d1s5",
            "score": 1,
            "text": "A good password manager encrypts all your passwords. So, let’s say that an attacker manages to access the database in your password manager server or device. That attacker will now also have to decrypt those passwords. That will take time and resources; by the time the attacker may have decrypted one of your passwords, Incident Responders may have already patched the vulnerability.",
            "title_similarity": "0.8349139"
        },
        {
            "id": "i13dbfu",
            "score": 1,
            "text": "It’s must harder for them to hack that than to even try to hack each of your passwords individually. They don’t store the passwords as plain text for people to read if they just hack the manager either.",
            "title_similarity": "0.6931616"
        },
        {
            "id": "i13deqa",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.030960439"
        },
        {
            "id": "i13dmxa",
            "score": 1,
            "text": "It's much more secure if you have a different key for every lock in your house. That way, a thief can only get into one room at a time. But this is really cumbersome, and people will leave doors unlocked or change them all to the same lock to make things easier. \n\nBut what if you could have a different lock for every room, and the key magically appeared in your hand when you tried to unlock it? You could have that much more secure setting! The secret is, when those keys are being used, they're whisked away to a very secure vault. Sure, somebody could break into the vault, but what's more likely? That a vault designed for security is blown open, or a simple room in your house is broken into?",
            "title_similarity": "0.7210108"
        },
        {
            "id": "i13ds0f",
            "score": 1,
            "text": "Get an yubikey which is a physical 2fa for your password manager. Every 30 days I have to authenticate with my yubikey",
            "title_similarity": "0.49733394"
        },
        {
            "id": "i13eso4",
            "score": 1,
            "text": "If you are like most people in the digital age, you have a lot of places where you need to use a password, probably more than a hundred.  You aren't going to remember one hundred plus passwords, so you probably reuse them across services.  Not every service uses the same rules, so you probably have a few, maybe minor variations of the same one that are relatively easy for you to remember (this probably also means more easily guessable).\n\nIf you reuse an easy version of your password across, say, 30 of those hundred sites, and any one of those thirty get hacked, the hackers now have your one password for all 30. And chances are good at least one of those companies has really bad security.  Also, they now have your base password to guess variations against to find your more secure password.\n\nA password keeper usually comes from a company that is worried about security.  That doesn't mean they won't get hacked, but they are probably a little more secure than your budget dental office that outsources its IT to Moe down the street, or that off brand website you bought those imitation Nikes from.\n\nA single point of failure isn't a great solution, but it is much better than 30 points of failure where any one failing jeopardizes all 100+.\n\nIt is also a great way to clean up if you do get hacked anywhere, you can quickly change all of your passwords from one place. Most large breaches sit out there for a long time before the data gets actually used, so one of the best ways to keep your data safe is to periodically change your passwords and phase out older, stale passwords.\n\nEDIT - I should also mention that to make your password keeper effective, your passwords should be random, non-guessable passwords that aren't shared across your various services. Using a password keeper makes this practice practical.",
            "title_similarity": "0.71976364"
        },
        {
            "id": "i13ey3u",
            "score": 1,
            "text": "It may be a single point of entry, but it's the most fortified you can get. Password managers are prime attack targets, so they're pretty much forced to be very prudent about security, because their whole business would instantly go bust if they slipped up.\nIn the meantime, most people end  up reusing passwords sooner or later, which means that an attacker only needs to hack one unsecure site, or get the victim to enter their one and only password on a phishing site, and they have access to pretty much all of the victim's accounts.",
            "title_similarity": "0.7942053"
        },
        {
            "id": "i13fafb",
            "score": 1,
            "text": "- In the many years they've existed they've essentially never had a breach. (I know folks will bring up one or two secnarios of untoward ingress, but note those incidents did not leak passwords or private data.)\n- They're very, very good at the one thing they do: Secure your passwords\n- You don't even have to put your password manager online! Many, such as KeePass, give you an offline database file you can use. No Internet exposure = no-one gets in. Further, you can secure this offline database with things other than just a master password, such as a separate key file that you can keep off your PC altogether. (This means that even if your password DB got put online or shared, nobody gets in still.)\n- They are better at creating passwords than you. You don't even have to know what your password is (nor should you). A very random long string of characters (sometimes not easily typeable on a keyboard) will always beat out any correct horse battery stapling you try to do\n- They encourage good password practices, such as \"never re-use the same password across accounts\", since the default path is \"make a new password\"\n\nBasically, imagine you have gold to store. Now imagine you can either carry it with you, even if you have a portable safe, etc. (i.e. a written notebook of all your passwords). Or you can store your gold across multiple different locations, as opposed to just on your person / all in one spot.\n\nYou also have the option to store them at Fort Knox. Sure, all your gold's in one place. But it's Fort Knox.",
            "title_similarity": "0.70456016"
        },
        {
            "id": "i13fs3l",
            "score": 1,
            "text": "Imagine this: You have a 1000 houses and you need to to get into them whenever you want.\n\nThe first way to go about this would be to have the same key to every house. Now, the people working in those houses ALSO have a key to the house - so your housmaid from the first house could get into all other 999 houses. Also, if someone steals the key from your housmaid and copys it - the person can go to all of your houses! Now maybe you think you are smart and make tiny alterations to the key - like one house requiring the key to be red, and another to be blue - but the person who copied the key will try those colours, too.\n\n\\^- This is what happens when you don#t use a password manager - all websites will have similar passwords / passwords based on a pattern, and if you loose your password on one you loose it for all of them.\n\nNow a much better practice would be to have seperate keys for each house. However - how to keep them organized, and secure? Simply, with a big box of keys, that has one masterkey to unlock, that only you own. So if they break into one of your houses - it sucks, but all your other houses stay safe.\n\n\\^- This is a password manager.\n\nTo be extra safe I'd recommend to enable 2-step verification to all your important accounts, so even if you loose your passwords someone else can't get access to them.\n\n**never ever ever use your master passwords that you use for your password manager on any other website / device / whatever**\n\n&#x200B;\n\nAlso, curious WHERE you lost your data already? [haveibeenpwned.com](https://haveibeenpwned.com)\n\nTo give you some examples:\n\nWildstar lost passwords\n\nTwitch lost passwords\n\nLinkedin lost passwords\n\nClarna lost credit card information\n\nKreml lost passwords of their ~~employees~~ war criminals\n\nWebsite breaches are super common, and your passwords are likely to be exposed.",
            "title_similarity": "0.664469"
        },
        {
            "id": "i13fs6d",
            "score": 1,
            "text": "One point I'm seeing people miss, and I think this is what OP was asking, is that your single point of entry is only on your local computer. The server doesn't know the password for your account because it receives an encrypted version of it. This means that the only place your password is exposed is on your local internet.",
            "title_similarity": "0.73995805"
        },
        {
            "id": "i13g0wm",
            "score": 1,
            "text": "Well the idea is that one password is really fucking good. Mine is a random string of letters and numbers that isn't written down anywhere, I am the only person on earth who knows what it is, and it's like 20+ characters long. It's legitimately uncrackable.",
            "title_similarity": "0.57521147"
        },
        {
            "id": "i13h6hf",
            "score": 1,
            "text": "Because people have a hard time following good password rules (including myself, and i am a it-Security consultant). Using the same password in several places is a far bigger risk than having then stored by a password manager, given of course that the password manager actually encrypts the passwords and creates obscure passwords for you. \n\nThink of it like a big, locked safe; the same question can be asked here. Why would you store all of your money/jewelry etc. In a safe which provides a single point of entry to a burglar?",
            "title_similarity": "0.78879225"
        },
        {
            "id": "i13hxcs",
            "score": 1,
            "text": "I have been letting Google manage my passwords...how screwed am I?",
            "title_similarity": "0.6643051"
        },
        {
            "id": "i13jf0n",
            "score": 1,
            "text": "Most people cannot remember all their passwords and end up saving their logins into their browser, or having a 'cheat sheet' with their passwords written on them. If somebody were to gain access to your computer, it's open season. With a password manager there would still be a unique password for your manager to stop them.",
            "title_similarity": "0.7000781"
        },
        {
            "id": "i13jpxo",
            "score": 1,
            "text": "Because 95% of your passwords are useless. I truly don’t care about your social media or mobile gaming. What I want is your bank login and to replicate your Apple Pay.",
            "title_similarity": "0.6069479"
        },
        {
            "id": "i13k3sk",
            "score": 1,
            "text": "Setup your password manager to use a physical key, like a YubiKey. Someone would then not only need your master password to get into your password manager, but physical access to your YubiKey. In general, I would rather have each of my accounts containing a UNIQUE extremely long random password then have one password that I know, for everything.",
            "title_similarity": "0.8042832"
        },
        {
            "id": "i13kygx",
            "score": 7,
            "text": "If you only have to remember one password, it's far more likely that it's going to be a few orders of magnitude more secure than the hundreds of passwords you need to make and remember for every stupid account you need to make across the whole Internet.",
            "title_similarity": "0.786337"
        },
        {
            "id": "i13ngzj",
            "score": 1,
            "text": "If you use the same username/password at all sites, one of them will be hacked each year and those hackers will go around to every bank, every store, and every social media place the FBI agents pretend they are five years old on.  They will get logged into your account everywhere.\n\nUse a password manager like KeePass (when you're 10, you'll love calling it Keep Ass), and it encrypts a different password for every site.  As long as you pick a good main password, like \"IswearIam5notFBI!!!\" it will be hard for somebody to decrypt it.  When a website is hacked, you don't care because you only used that random gibberish password there, and nowhere else.\n\nYou also never have to type a password because it will Auto-fill the entries when you hit Control-V or shift+alt+A.  You won't even know your passwords and it will all work.  Just back up your file onto a USB drive every month or two, and store the USB drive in a drawer, not in plugged into the computer.",
            "title_similarity": "0.6588179"
        },
        {
            "id": "i13okvo",
            "score": 1,
            "text": "It's probably better to say a password manager *might* provide better security than assume it does. A password manager used incorrectly or poorly could be as bad as not using one.\n\nELI5:\n\nYou have 10 lockers, and a bully wants into them. You use same, or similar, code for each. One locker is old (poor security), and so the bully discovers that they can learn your code by trial-and-error. Getting the code, they get into every locker.\n\nYou generate some random codes and apply each to a locker, then file the codes into a folder. You then take the folder to your favorite teacher, who allows you to put the folder into a magic drawer - the drawer will automatically change your codes in the folder to gibberish when locked and back when unlocked (encryption/decryption). It also has two locks: you have one key and your teacher has a magical key that only exists when they see you - and only you - put your key into the lock (MFA, you acting as one factor).\n\nSo now, when the bully figures out the code for the older locker, they cannot get into the other 9. When the bully steals your key, they cannot get into the drawer, and your teacher cannot open the drawer alone. Even if the bully breaks the drawer open, the folder is still encrypted.\n\n&nbsp;\n\nGood password managers offer the ability to generate random passwords for you, will offer several multi-factor authentication (MFA) choices, and will store and transmit everything encrypted. However, if you create a weak master-passphrase, or don't use MFA, or you add a bunch of trusted devices to bypass MFA, or disable automatic time-out and leave yourself logged in on a shared computer, or do all of that but instead of generating passwords just store \"drAgon0!\", \"drAgon0@\", \"drAgon0#\"... well, that's using a password manager but disregarding good security and that's not going to make much of an impact.",
            "title_similarity": "0.71130824"
        },
        {
            "id": "i13opz3",
            "score": 1,
            "text": "Because password managers have one job: protect your passwords. And they're damn good at it.",
            "title_similarity": "0.7041402"
        },
        {
            "id": "i13ou7t",
            "score": 1,
            "text": "What if some bad actor, say a foreign country, decided to somehow “blow up” the password manager, so that didn’t exist, then you’d never have access to any of your accounts.",
            "title_similarity": "0.53537714"
        },
        {
            "id": "i13qioo",
            "score": 1,
            "text": "Imagine you're a James Bond-style spy, undercover in an enemy country! Every week, you need to meet a different contact and say a codephrase to them to get your new mission, but you need to be sure enemy spies don't know what that codephrase is.\n\nYou could try to use a different code word for each contact, so enemy spies can't know which one to use with which contact? But you might forget what the code word is, and then you won't get your mission. The fate of the country might be at stake, that's unacceptable!\n\nYou *could* use the same phrase each time, maybe \"swordfish\"? But there's a very good chance that an enemy spy will overhear it eventually. Even if you whisper it very quietly.\n\nNo, the best solution is something that will remember the code words for you. Say, some kind of smartwatch. Sure, technically it *could* get stolen, but it's literally designed to be hard to take from you, and even if they did steal it, they'd have to crack it. Now your codewords are all remembered for you so you can use a new and unpredictable one every single time, so enemy spies can't just guess what the next one will be. And you only have to remember one thing, the login to the watch, so you can afford to make it super secure, since it's the only one you have to remember.",
            "title_similarity": "0.57442576"
        },
        {
            "id": "i13rh0f",
            "score": 1,
            "text": "Websites get hacked all the time. Sometimes the hacker is able to see all the usernames and passwords for people that log in to the site. These usernames/passwords are added to huge lists that anyone can find online. Since a lot of people reuse usernames/passwords, bad people can just try information from those lists on any websites they can think of-- bank sites, for example. \n\nA good solution to this problem is to use different passwords for every site you log in to. Obviously, nobody can just remember more than a few strong passwords. This is the point of a password manager. You let it generate strong passwords for every site, and you only need to remember one, very strong password (or passphrase) to unlock it. I recommend looking into 'diceware' to create a strong, yet memorable passphrase.",
            "title_similarity": "0.72703385"
        },
        {
            "id": "i13s0py",
            "score": 1,
            "text": "They allow you to store many different passwords for various sites without having to remember each one and you have a single source of truth of your current password for any site, which is offline and not accessible to be attacked. \n\nMy favourite password manager is called “the filofax”",
            "title_similarity": "0.74752665"
        },
        {
            "id": "i13s65p",
            "score": 1,
            "text": "You can set up two factor authentication login for your password manager, and your bigger accounts like google, amazon, etc.",
            "title_similarity": "0.5695617"
        },
        {
            "id": "i13ueii",
            "score": 1,
            "text": "If someone who knows what they are doing has unrestricted access to your computer/phone\n\nThere is nothing for you that could stop him from getting everything",
            "title_similarity": "0.61761403"
        },
        {
            "id": "i13uyvg",
            "score": 1,
            "text": "Most password managers, or at least the good ones require a secondary secret key to login besides your password.  Now if someone manages to get remote access to your device and knows your password manager you have bigger problems….",
            "title_similarity": "0.7456572"
        },
        {
            "id": "i13vjc9",
            "score": 1,
            "text": "Additional question: If I want to start using a Password manager now where I have already practiced the bad habit of using identical or near identical passwords on many websites over the course say 8 -10 years, how do you recommend to start change/manage the old password?\n\nRight now, just thinking about seems like a daunting challenge.",
            "title_similarity": "0.64183164"
        },
        {
            "id": "i13vk0k",
            "score": 1,
            "text": "Using strong unique passwords for everything is essential because if one site is compromised somebody could go around signing into everything you have. That's what you're trying to prevent, but remembering them all can become almost impossible for many people (there are 100 in my pm) so you have to compromise and have one very secure place to hold the rest. You can change your passwords regularly, but never have to start remembering something new.",
            "title_similarity": "0.7429008"
        },
        {
            "id": "i13w2zt",
            "score": 1,
            "text": "just use a super complex and long password for the manager and keep it as a notepad or something named something random, then the rest of your passwords are gucci",
            "title_similarity": "0.6900302"
        },
        {
            "id": "i13xmmp",
            "score": 1,
            "text": "Because of the level of protection and encryption that the good password managers have. My master password is over 30 characters long, has no english words in it, and has a mix of cases, characters, and cases. It would take decades to brute force it. I also use multifactor authentication to get into it that requires a device be with me to get the code from.",
            "title_similarity": "0.689306"
        },
        {
            "id": "i13yjll",
            "score": 1,
            "text": "OK, I see what you are getting at but the attack scenario originally was mostly breaching weak sites with bad password handling practices then use those credentials everywhere else assuming that people use the same password in more than one place.\n\nSo the sites are many, single points if failure that expose users in bulk.\n\nWith a password manager users can store unique strong passwords for every site so breached credentials are useless to them.\n\nSo attackers would be forced to attack users directly & that is way harder, because with a p\nWell written password manager an attacker would need to have malware running on your machine to gain access & once they have that you have far bigger problems.\n\nPlus another major attack scenario is to socially engineer the user or Phish them into putting their credentials into a places they should not, like an attacker controlled clone of the users bank for example.\n\nA good password manager should refuse to supply credentials for a site if information about the site (domain, certificate fingerprint etc) does not match that in its database from prior times.\n\nAll that said, there are many different password managers out there & not all of them were well written.\n\nThere are even (for the more paranoid) offline password managers written in hardware that can only access your PC via Bluetooth or USB. These supposedly cannot be made to leak they password databases because they lack that feature in their API (APplication Interface). All they can do is provide a single password matching the requested site when unlocked by a user's manual pressing of keys on its hardware.",
            "title_similarity": "0.78943336"
        },
        {
            "id": "i13yzga",
            "score": 1,
            "text": "I use a password manager with email verification for all new devices used and I use 2FA for all logins. An attacker would need my password, access to my email and phone (or SMS) to get access to my passwords. Good luck to them.\n\nAlmost all of my passwords are are longer than 50 characters. My standard length is now 96. That length is practically uncrackable.\n\nThe alternative, if I didn't use a password manager, would be many, small, repeated passwords across many sites.",
            "title_similarity": "0.73807263"
        },
        {
            "id": "i1405dd",
            "score": 1,
            "text": "I just use post it notes, if you break into my house and steal my passwords instead of my tv or computer you can have them lol.",
            "title_similarity": "0.70696384"
        },
        {
            "id": "i140umw",
            "score": 1,
            "text": "Any good password manager will use your master as a private key and store your passwords encrypted and NOT store the private key. So you are the only vector.",
            "title_similarity": "0.79217994"
        },
        {
            "id": "i14170m",
            "score": 1,
            "text": "Same reason you keep money locked up in a vault rather than distributed across 20 shoeboxes.",
            "title_similarity": "0.5956095"
        },
        {
            "id": "i141hmm",
            "score": 1,
            "text": "So that the companies that offer them can consolidate your passwords and sell the data, like NordVPN",
            "title_similarity": "0.72632337"
        },
        {
            "id": "i141tr8",
            "score": 1,
            "text": "Your password for your manager should be unique and never used anywhere else. It should be as long as you can remember it. Mines between 16 and 64 characters long. With numbers, special characters, upper and lower case. It would take way too long to brute force.",
            "title_similarity": "0.6295558"
        },
        {
            "id": "i143itj",
            "score": 2,
            "text": "\"good\" or \"bad\" don't exist in a vacuum. You have to consider a password manager compared to an alternative. For many people the alternative is less complex and frequently reused passwords which is very likely worse.",
            "title_similarity": "0.61814475"
        },
        {
            "id": "i143r7o",
            "score": 1,
            "text": "Most of them store everything separately, so the attack would have to decrypt every file individually to get all the info. Think of it like trying to lockpick 1000 lockboxes at a bank.",
            "title_similarity": "0.69944656"
        },
        {
            "id": "i1445ry",
            "score": 1,
            "text": "So there are a lot of really good answers here, but I think something that hasn't really been touched on yet is that any good password manager is encrypting all your passwords inside it's \"vault\", and your one password that you enter as your master password is the decryption key. \n\nNow, if someone cracks your master password then they have that decryption key, but the main benefits of this besides only needing to remember a single password is that is someone brute forces their way into your password vault WITHOUT your master password, all they get is encrypted data. It's completely useless to them. \n\nIt's be like having a safe with all your important documents, but the only way they become readable is if you enter the code. If someone blows the door open with dynamite, they just get a bunch of gibberish on a piece of paper.",
            "title_similarity": "0.85174364"
        },
        {
            "id": "i145su3",
            "score": 1,
            "text": "What’s a good password manager I could use for ios?",
            "title_similarity": "0.6056046"
        },
        {
            "id": "i146rt3",
            "score": 1,
            "text": "It is good security practice for many people who usually have same password for different site or often using weak password.",
            "title_similarity": "0.6456678"
        },
        {
            "id": "i1470ek",
            "score": 1,
            "text": "If you have a physical yubi key as a 2fa nobody can steal all your passwords. They would physically have to find you, knock you out and take your yubi key and plug it in to gain access to your password manager. If you don’t have a yubi key then this question is quite valid.",
            "title_similarity": "0.83178645"
        },
        {
            "id": "i14769t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.030960476"
        },
        {
            "id": "i147bmk",
            "score": 1,
            "text": "Why are castles considered a good defensive position when they have a single gate you need to breach to get inside?",
            "title_similarity": "0.7145834"
        },
        {
            "id": "i147elo",
            "score": 1,
            "text": "Lots of great answers I'll add an analogy:\n\nA good security practice makes it really hard for an attacker to get, guess or use your passwords. \n\nSuppose every store you walked into required you tell them a password to enter. Every grocery store, cafe, them DMV, the gas station, everywhere you went, you had to give them a password before coming in.\n\nMost people would start reusing passwords, just using slight variations or maybe writing them down on some piece of paper because how else could you remember it all?\n\nNow suppose someone breaks into your favorite Coffee Bean store and steals ALL the passwords for everyone who goes into that store. If you are like most people, you've reused your Coffee Bean password for Starbucks, Dutch Bros, Human Bean, and a few more coffee shops.\n\nNow that \"hacker\" who stole the passwords can just goto those other stores and try your weak passwords.\n\nEven if you weren't re-using passwords, maybe you just carried your passwords around in a little book but didn't use very difficult passwords because that seemed crazy. So a hacker can just keep going to different stores and trying different passwords, short/standard passwords make that attack easier.\n\nA password manager would be like carrying around all your passwords on your password-protected phone **and** letting your phone generate those store passwords using high security techniques. Most password managers use some form of encryption so **yes** if someone stole your \"password phone\" and figured out your phone password, they'd have access to many things but because it's so important, you're going to keep it safe.\n\nGood password managers keep it very safe and cut off those far more common attacks.\n\nIf the bad guys are trying to make money, they want it to be super-easy. As of right now, it's just way more easy to use stolen credentials and \"guessing\" attacks. So we want to use a password manager to stop those easy, successful attacks.",
            "title_similarity": "0.72516966"
        },
        {
            "id": "i148hm6",
            "score": 1,
            "text": "Actual LI5 answer:\n\nImagine you have a lock and key. Pretty secure, one key one lock. Now imagine you have 200 locks. \n\nWhich is more secure - one key that opens all of them, or each lock has its own key?\n\nThe fact that you keep your keys on a single keyring is definitely not the best, but if the tradeoff is that all your locks have different keys, it's worth it.",
            "title_similarity": "0.72409064"
        },
        {
            "id": "i148rgq",
            "score": 1,
            "text": "Okay ignore most of this. Some advice here is good but overall the key reason a good password manager is superior is that you both need access to your device and your master password to crack it.",
            "title_similarity": "0.7855237"
        },
        {
            "id": "i1490k5",
            "score": 1,
            "text": "In my case, getting to my passwords (which are managed by password manager) would mean that the person would first have access to my device (phone or laptop), then they would have to crack the password if that device, and then they would have to crack the password on  my password manager.",
            "title_similarity": "0.77781177"
        },
        {
            "id": "i149850",
            "score": 1,
            "text": "The short of it is that most password compromises come from either really simple, crackable passwords or from being forced to have complicated passwords that you can't remember (and thus end up writing them down).\n\nA password manager with a single strong memorable password allows you to use a unique strong password for every other service.\n\nThe alternative is you trying to remember all your passwords, which as the number of services you use grows will cause you to do one of three things:\n\n1. Just use one password\n2. Write them down somewhere\n3. Start using a pattern of passwords\n\nNumber one in this scenario is the same attack vector as a password manager, but with a much larger exposure surface. Number two is basically an unsecured password manager. Number three is the least dangerous, but still may let an attacker infer passwords to other services.\n\nSo at the end of the day it's better to have one memorable, secure, and highly monitored password protecting all of your other passwords than it is to have either just one password or dozens of passwords you need to remember.",
            "title_similarity": "0.7515426"
        },
        {
            "id": "i14991e",
            "score": 1,
            "text": "It would be the best practice to memorize unique long complicated passwords for every service you use. \n\nHowever few of us can remember them all, so we tend to use the same few passwords for everything.\n\nA password manager does that for you.\n\nThis leaves you vulnerable in case the password manager is hacked. \n\nHowever if you use the same password for multiple things and one gets compromised they can now log into anything you use that password for.\n\nWhat's more likely to be compromised, the password manager that empthisises high security, or some random website that made you make an account?",
            "title_similarity": "0.8143522"
        },
        {
            "id": "i149abd",
            "score": 1,
            "text": "You are right, it provides a single entrance if you use a weak master password.. you cannot deal with the human element\n\nBut it prevents you from using same or similar passwords on every site. If the site stores your password unencrypted or weakly encrypted and it gets hacked your password leaks multiple logins are compromised\n\nHaving one vulnerable spot is better than many... granted that one spot is lethal, but it is still better\n\nYou can reduce the risk even further, there are password managers that could only allow you to use them if you have a certain pendrive put into your system or have a physical number generator only you have on your person or an app on a phone etc\n\n2 factor authentication works on password managers too... you can't really get any more secure than that\n\nI'm yearning for a time, when biometrics are gonna be a thing, thumb print to USB to login anywhere, or have an RFID chip in my hand that i could use to identify myself... unless someone chops off my hand nothing could really happen",
            "title_similarity": "0.79210156"
        },
        {
            "id": "i149du0",
            "score": 1,
            "text": "It's true that remembering strong and unique passwords for every service you ever use is technically better than using a password manager in terms of security. But it's also incredibly hard to manage so many - borderline impossible if you use a lot of services - so people compromise either on uniqueness or strength. Using a password manager is much more secure than half-assed manual password management, and only marginally less secure than manually remembering hundreds of unique strong passwords.\n\nWhile it's possible that a reputable password manager could fall victim to a major vulnerability, it's not likely (and they will probably respond quickly if it happens). Most attackers target weak links. Compromising a password manager service (which has much better security than the average website) is incredibly hard. Much easier to just download a leaked database of passwords from some random less-secure website and crack the easiest few. Or harvest passwords with a shitty shovelware app. Or trick you into giving your password away. Or get you to install a keylogger. Or get you to log into a phishing site. Most attacks are because of human error on the part of the victim, and password managers eliminate several of the most common mistakes you could make. And they also make your life easier.",
            "title_similarity": "0.708084"
        },
        {
            "id": "i14azjh",
            "score": 2,
            "text": "Everyone in here talking about increasing the difficulty of hacking your password... as though anyone ever had their password hacked.  Nobody brute forces passwords, they get them from the site you think is protecting your data, but actually has it all stored in an unsecured text file.  Seriously... who here as ever had their password brute forced, vs had your info hacked out of the website you trusted instead?",
            "title_similarity": "0.7898598"
        },
        {
            "id": "i14bb3s",
            "score": 1,
            "text": "Two factor authentication on your password manager basically means all your passwords have 2FA.",
            "title_similarity": "0.6799199"
        },
        {
            "id": "i14bhxd",
            "score": 1,
            "text": "Well for one things like keyloggers have a lot harder time grabbing your passwords if you're not entering them manually every time.\n\nAlso if one account on one website gets compromised your other accounts are still relatively secure since you won't have any reused passwords, and being random they won't be easily guessed either if you use a pattern when making passwords that you can actually remember.\n\nAnother thing, remembering every password is hard. It's actually better to have one password per account that you rarely change. Remembering that many passwords and you start writing them down physically or in plaintext, which could be compromising if someone gets their hands on it. \n\nYou do take the risk of a single point that could compromise everything else, but there are still some bonuses, like a password manager that uses encryption, being able to make one very tough password that you can memorize that'll be harder to crack (basically go for length of nothing else. A really long password is going to be more secure than a sort totally random password with special characters numbers, and upper/lower cases). Depending on how the password manager is setup it might be difficult to compromise since it requires having access to either a secure encrypted server, or if stored locally, they'd need to have already compromised your local machine.\n\nAre password managers flawless? No. And they can and have been broken. But they do reduce the attack surface of your online presence and make your life easier and less stressful.\n\nBut if you're security focused, using a password manager in conjunction with two factor authentication where possible is the best way to deter a wide variety of security pitfalls. Which two factor authentication is still vulnerable to social engineering attacks: \"ah yes this is your IT admin, I need you to tell me the code in your 2FA app to fix your account.\" Basically don't tell people over the phone or in person or whatever any 2FA codes or tap \"approve\" if they ask you to. If you personally didn't initiate the login, don't approve it. If you do that it'll be really hard to breach your accounts.\n\nWhich can't say much for the server side of things. If a hacker just compromises a server with your data there's really nothing you can do about that. Your data is out there. But you can choose to use services that use encryption so in the event of a beach your data will be protected. Another way to tell how good a system's security is, do a password reset. If the system sends you an email in plaintext with your exact password their security sucks and I wouldn't store any sensitive data with that organization. If the password reset prompts other methods of verification, two factor, etc. Then there's a good chance they only store encrypted passwords so in the event of a beach your password is in a hash at the very least. Which can still be figured out, and hash files is compromised passwords can be brute forced with dictionaries and smart algorithms. But that still takes time, and if you change your password immediately after a breach by the time they find out your password it'll have been changed.\n\nSo use password managers. Use two factor authentication. Use your head to avoid getting socially engineered, and know the tricks they use to gain your trust. Keep your system updated with the latest security patches. Do that and you'll be about as secure as you can be in the digital age. Technology does change, and security vs hackers is like a digital arms race. Every solid defense is constantly being attacked to find weak points. And new security is being explored all the time as well. But as of right now that's our best defense.",
            "title_similarity": "0.742001"
        },
        {
            "id": "i14bsl9",
            "score": 1,
            "text": "You need a password, secret phrase, and two factor authentication to log into a password manager. It's far more secure than any typical username/password authentication.",
            "title_similarity": "0.7830971"
        },
        {
            "id": "i14bv26",
            "score": 1,
            "text": "I would try to answer on why password manager is not technically a single point of failure. \n\nImagine you have a locker in a different kind of bank. You actually don't go to bank to store your items, you mail your identity card and bank mails the locker back to you. Then at your home, you've a separate key to unlock the locker and take back your valuables. The key to unlock the locker is always with you and you don't take it ever out of the house. \nYou want to store some jewellery? You send your id to bank and bank will send you locker. You unlock it, store stuff and lock it and send it back to bank to safely store for you. \nNow even if someone steals your identity, they can get locker from bank, but they can't unlock it since they don't have the key to unlock it.\n\nPassword managers work the same. They don't actually have your master password. What they do is generate a mathematical key using your master password and break the key into two parts. \nPart 1 is used to encrypt your passwords that you store with password manager and part 2 is used to validate that it's you when you log-in into password manager. \n\nIt's crucial to notice that part 1 never leaves your device (phone/desktop) and only part 2 actually leaves your device and goes to the server where passwords are stored. \n\nSo even if someone has your part 2 of key, they can get your encrypted passwords, but can't decrypt them. So you're safe! \n\nThe only way for someone to steal your password is to hack your device and steal the part 1 of the key or your master password. But if someone is able to hack into your device and log all the keys etc then they can steal passwords even if you're not using password manager.",
            "title_similarity": "0.6683618"
        },
        {
            "id": "i14deaq",
            "score": 1,
            "text": "Aside from avoiding password reuse (which is true), a good password manager is kept ON YOUR DEVICE, which means that an attacker would need to HAVE YOUR DEVICE to even try to access that single entry point.",
            "title_similarity": "0.7761621"
        },
        {
            "id": "i14dslc",
            "score": 1,
            "text": "Password managers perform a couple of functions.\n\nThey reduce the likelihood of you using the same password across multiple systems (systems that you don't control, and have no idea how the password is even stored - they could be unencrypted in a text file for all you know).\n\nThey also tend to increase the complexity of your passwords, making them less prone to a brute-force attack, as the password manager generates complex, non-dictionary based passwords for you.\n\nLastly, while you're right in that your password manager will give someone \"one password to rule them all\", you should be protecting your password manager by using a very long and secure password, and consider using MFA for it as well.",
            "title_similarity": "0.75753105"
        },
        {
            "id": "i14e0s5",
            "score": 1,
            "text": "Like everything it has pros and conts.\n\nIts far better to manage your passwords with specialized software then to write it down on a physical notebook.\nIt also helps to use “good” passwords instead of “password”, mypassword” or “1234567”.\n\nBut yes, if it gets compromised, you are f??ked.\nBut the the additional steps should step in: MFA. multi factor authentification.\n\nSo the use is still very recommended, but like everything, it’s not an absolute measure.",
            "title_similarity": "0.6744529"
        },
        {
            "id": "i14epnr",
            "score": 2,
            "text": "speaking for 1password you get your account, you need a long password to use it, and you get a unique server to log into (or atleast the professional accounts do, not sure about personal) and an extra password thats similar to a bit locker code, so you need:\n\n1. Username (email)\n2. Server for the data storage\n3. Unique pass code \n4. Password\n5. 2FA",
            "title_similarity": "0.7512797"
        },
        {
            "id": "i14g80m",
            "score": 1,
            "text": "In practice, your master password should be a passphrase, not a password (example: 5 non-descriptive random words separated with hyphens/symbols with a mix of upper and lowercase letters with numbers added).\n\nAnd as others are saying, never use the same password twice.",
            "title_similarity": "0.6927019"
        },
        {
            "id": "i14hcyc",
            "score": 1,
            "text": "ProTip: Instead of trying to create a one powerful complex password for your password manager, get a dice, roll it 2 times, multiply the numbers and open the dictionary, turn the page of the number and pick a random word. \n\nRepeat this until you have 7 or 8 words. Memorize them and use it as your master password. It's guaranteed that no one would be able to brute force it. Not a chance. Not with all of the computing power.\n\nAlso, use something with AES256 encryption, KeePassX my favorite.",
            "title_similarity": "0.74482954"
        },
        {
            "id": "i14hg37",
            "score": 1,
            "text": "How about an actual example.  \nHere is a unique password I use for a single website account. Every other account has its own unique password.  \n\nThe chances of it getting guessed are minimal, the chances of me giving it to someone are low, its not easily transferable, but it is easy to use with a password manager. (Granted I self host and don't trust cloud providers but that's its own conversation) \n\nPs here is the password good luck.\n\n!JxDJPY*LPyajG8nsUzpv$oYQ62mY$qFs!Vg6J$PoaEs2GVj6naN73jAq*5oAu7Z2uQw3@G9pg3!SncLNVW&4BvwinBqayzhCCx",
            "title_similarity": "0.7690689"
        },
        {
            "id": "i14i87m",
            "score": 1,
            "text": "A single good password on a manager is *significantly* more secure than a thousand shitty passwords without a manager. When you only have one password to remember, you can put more effort into memorizing a better, longer, more secure password.",
            "title_similarity": "0.6880759"
        },
        {
            "id": "i14io9y",
            "score": 1,
            "text": "Since everyone has like 100 websites they have to remember passwords to a lot of people end up using passwords like the following:\n\nPassword_1\n\nPassword_2\n\nPassword_3\n\nand so on.  That's incredibly easy for a hacker to get because it's 1 word, which is probably already in a hacking database and so doesn't even need to be cracked (they either crack one character at a time and hope that it gets the entire thing right or just uses a word dictionary and hopes yours is in it...... then it'll throw common numbers, etc on like the end because that's what 99% of passwords use). It's getting cracked in a snap of a finger.  \n\nIf you use a password manager then all the generated passwords are like (&*DF&*(SDF*(UYF*(SF&(SF&*(SDF& so good luck having that cracked but you probably use some stupidly hard to crack password for the password manager that is also easy to remember like - iwillneverforgetthispasswordforaslongasilive\n\nThat looks easy to remember but it's hard for a program to crack because it'd have to work out what each individual character is one at a time.  Even if all the words are individually in a dictionary that the cracking program uses it will still take a long time to crack because it's a sentence and all the words have to be in order.",
            "title_similarity": "0.77426064"
        },
        {
            "id": "i14iugs",
            "score": 1,
            "text": "To get all my passwords you would have to physically steal my phone AND guess the password, it's not something an hacker can do at home like guessing a password by bruteforce",
            "title_similarity": "0.7262333"
        },
        {
            "id": "i14jjb7",
            "score": 1,
            "text": "I haven’t seen it mentioned yet: Password managers also prevent some forms of phishing because the auto-fill only works on legitimate sites.\n\nIf someone creates a gmaiI.com that looks like gmail in every way (capital i instead of lower L) you might think it’s fine and enter your password, but the autofill of the password manager won’t because the URL doesn’t match.",
            "title_similarity": "0.7236507"
        },
        {
            "id": "i14juit",
            "score": 1,
            "text": "Without a password manager:\n\n`password1`, `password2`, `password3` and just to spice things up from time to time `passw0rd4`\n\nWith a password manager:\n\n`OneReallyLongImpossibleToBruteforcePasswordToRuleThemAllWithSomeRandomDigit1`\n\nand a large assortments of variations of\n\n`4q09pV1#SRKx$qQ6tYk7tULpB*Tf$QiuKh3JF9C@5rn98CJJiIPH#%F28mecKO9QMkF*5XK#yUcR@pxQ@RTAQ^RoAH74Bm^HJVP2hrfN3qJXdaocckST5%tNw*7^MB5S`s that are also impossible to bruteforce but are most definitely long AND unique.\n\nSo you would only need to remember one password, while ensuring that every other password is unique.",
            "title_similarity": "0.64726985"
        },
        {
            "id": "i14kmcy",
            "score": 3,
            "text": "Possibility of someone stealing your password database: possible, but slim\n\nPossibility of someone reversing the hash for \"username123\" as a password: virtual certainty",
            "title_similarity": "0.7980553"
        },
        {
            "id": "i14m68s",
            "score": 1,
            "text": "Security Analyst here, the time it takes to brute force (or even use a dictionary attack or rainbow table) increases exponentially based on length. Most people who use different passwords for everything use shorter passwords, usually 8-10 characters. These can take between a day and a year to crack using the most basic methods, and only get shorter when more advanced cracking methods are used. A password manager allows you to use long, complex passwords that are different for everything without you having to remember them, which makes it significantly harder for an attacker to crack. Any password that is 16+ characters is almost impossible to crack using brute force methods (although i would double check the number of characters rainbow tables are up to, it may be more than 16 for MD5 now)\n\nIt is worth noting though, if your password for your password manger is weak, then yes, it would be relatively easy to break all your passwords, but assuming you are using a 16+ character password for it, it is much more secure.\n\nYou can always go to howsecureismypassword.net to check the timescales I've given above (but i wouldn't recommend putting in your actual password)",
            "title_similarity": "0.59959376"
        },
        {
            "id": "i14mkcp",
            "score": 2,
            "text": "It basically works off the idea that your accounts are only as secure as the weekest link. An average person might be able to memorize 3-4 passwords at a time but on the internet, you are likely to sign up for tens of not hundreds accounts to all sorts of things. If you reuse your 2-3 passwords, this means that if one of those sites wasn't as secure as it should be, your password is now leaked for all the other sites that were doing a good job at security.\n\nSo best internet practice is to use different, strong passwords for each site but you enevitably would need to write each account down somewhere. A password manager is basically that. They are promising you that they will build the most secure site for you to store your passwords in. All you need to do is to give it a very secure password you can remember.",
            "title_similarity": "0.7684065"
        },
        {
            "id": "i14nlvd",
            "score": 1,
            "text": "It means your passwords are stored behind mfa if the sight it targets diesnt have mfa then it's a big win. But still, the password has to be strong.\n\nSo there is no real point, you should not use services without mfa, and you should not use password managers.",
            "title_similarity": "0.71465456"
        },
        {
            "id": "i14oc16",
            "score": 1,
            "text": "It's unlikely that the attacker gets hold of your master password. Passwords get cracked because the databases of services get leaked, and the password hashes containing them cracked.  \nTo obtain and crack your master pw, the hacker would have to access your personal device and probably do some fancy priviledge escalation to get access to the file. Then it has to be cracked, which is practically impossible for a good pw.  \nBut since we assume that the hacker has gained full root access to your personal device, that means that you're pretty much screwed anyway, wether you use a pw manager or not.  \n\n\ntldr: Personal device is less likely to get pwnd",
            "title_similarity": "0.784847"
        },
        {
            "id": "i14ohxk",
            "score": 1,
            "text": "I've heard that it's good to have a password manager, but is it practical? I'm just curious because I often use the accounts on apps on my phone so I'd have to type the password manually and only when I've got access to my desktop. that's the only thing I'm really worried about if I'd switch over to a password manager.",
            "title_similarity": "0.75106776"
        },
        {
            "id": "i14olqd",
            "score": 1,
            "text": "Does anyone here like Dashlane as a password locker?",
            "title_similarity": "0.7021216"
        },
        {
            "id": "i14qbae",
            "score": 1,
            "text": "Every device you own is starting to become. Passwordless. They are starting to use only your biometric data to unlock the device. Devices now stores your biometric data only on the physical device itself. And it is stored within encrypted hardware that is located only on your device. When you go to unlock your device the biometric data (face or fingerprint) gets checked by the encrypted hardware which stores that information, verifies that it is you, and then unlocks your device.\n\nMost devices that you own do this already. iPhone, Android, and most newer Windows devices have some form of dedicated system on chip (SOC) hardware encryption.\n\nFor iPhone users, Apple has a special SOC hardware called the [Secure Enclave](https://support.apple.com/guide/security/secure-enclave-sec59b0b31ff/web). For Android users their phone manufacturers use hardware based security called [Trusted Execution Environment](https://en.wikipedia.org/wiki/Trusted_execution_environment#TEE_Operating_Systems) or TEE. Google has [Trusty](https://source.android.com/security/trusty).\n\nMicrosoft has had its own challenges with securing windows but with their latest release of Windows 11, they have started to require hardware equipped with a Trusted Platform Module or TPM. Facial recognition data or fingerprint data (biometric data) is then stored on the hardware based TPM 2.0 or in software. More information on [Microsoft's passwordless strategy](https://docs.microsoft.com/en-us/windows/security/identity-protection/hello-for-business/hello-overview).\n\nThis is all part of the strategy for Apple, Android, and Windows users to no longer require passwords. And as others have mentioned above, the problem with passwords are that we reuse the same ones over and over again. Because it is very difficult to have multiple strong passwords. Another problem is that passwords get leaked and not every company that stores your password employs the best security practices.\n\nNewer password managers change this because they can suggest newer, harder, longer 20 string character, random passwords that no one can ever remember. In this way you will never leak a password again because it is now always unique.\n\nAnd most password managers are web browser based, that can store/memorize/enter in all your passwords conveniently for you when you need access to a web service. And to unlock the password manager or use your passwords, **all you have to do is be able to unlock your device with your biometric data.**\n\nAs long as you have access to your device (via your face, fingerprint, or pin) you will have access to your passwords. And the strength/good security practice is that now your biometric data never leaves your device. And so the hackers never have a chance to get your biometric data or decrypt it. Because it's all stored on your device via the different methods linked above. And the biometric data will never leak onto the inter webs or cyber net ever.\n\n**TLDR and ELI5;**\n\nA password manager is like visiting your mom for the holidays. When you go back to mom's house, you can go and visit any of your old rooms. Your parent's room, your sister's room, your brother's room, and of course your own room. You're able to do this because the second she opened the front door, she instantly recognized you! Her son/daughter. Of course you can visit any of those rooms because you've been verified!\n\nIn this way your mom is the Secure Enclave/TEE/Trusty/TPM. The second she unlocked her front door, the whole house was available to you. And every door in the house is now unlocked.\n\nThis is because she was the one who gave you your **biometric data**. And no matter how old or how much you've changed, she will always **recognize** you. It is **encrypted** in her physically (hardware) and mentally (software).\n\nBut eventually the holidays are over and you have to fly back to your apartment. But in order for you to open the garage gate, you need a key. To get through your elevator, you need another key. And to get into your own apartment, another key!\n\nInfact to get into someone else's apartment in your complex you would need another unique key. Because those people won't recognize you! They don't have your biometric data! \n\nSee how much harder it was in the past?\n\nToday at least for our devices we are heading toward a passwordless world. =)",
            "title_similarity": "0.7357081"
        },
        {
            "id": "i14rc4y",
            "score": 1,
            "text": "Because they provide a single entry for an attacker!\n\nThe idea is that if you provide only a single point of vulnerability, you can focus all of your effort on hardening that point of entry. Otherwise, you have to secure everything everywhere.",
            "title_similarity": "0.7264404"
        },
        {
            "id": "i14rjj0",
            "score": 1,
            "text": "The primary idea is that your “master password” used to access that single point only exists in your head. Never written down or given to anyone digitally. \n\nFurthermore, for someone to even attempt to guess your master password they would need to be physically holding your phone or on your laptop etc. \n\nIf they’re trying to breach your manager online, more credentials are required at that point. In 1Password’s case, an extra secret key, like a second password.",
            "title_similarity": "0.8096639"
        },
        {
            "id": "i14rs5p",
            "score": 1,
            "text": "I make a ridiculously complex password for my password protector and then remember that one rather than remembering 150 different passwords",
            "title_similarity": "0.77368546"
        },
        {
            "id": "i14ryc9",
            "score": 5,
            "text": "Most people assume that hackers get your password or guess it.\n\nThis is usually not true anymore.\n\nLet's say my password is horse-cockatoo-krisoykreme pretty much nothing will bruit force it, especially when I have a solid hard to run algorithm.\n\nNow how do hackers get your password... \n\nThey breach a site. Any site. That side may not follow best practices for password storage. Some are good some are bad. And say site www.supercoolwizywig.com sucked at security. So they go in and get all their password info. \n\nTurns out most people will have only a handful of passwords. Even if say 8. And even then it's usually variations of the same password. So the hackers will literally go to every site they can and try this exact password they found. With lots of people that may also be their bank password. And boom I hacked piece of shit random website and using it got access to your bank. \n\nWith password managers it's different. A complex unique password for the manager, and then auto generated passwords for all sites. Any site you compromise won't ever get you access to literally any other site. And that's it. Instant better security. \n\nAnd there are other advantages like password sharing so I don't just text people passwords. For example with my grandmother I share passwords with her. She can forget something, I go in to the site, fix it for her, and done. And if needed I can even change her password and she won't care because it's all in the manager. The convenience here is its like a browser remembering your password, but cross devices and even cross users. \n\nThere's a bit more but not as obviously useful as the above.",
            "title_similarity": "0.7451935"
        },
        {
            "id": "i14rzg3",
            "score": 1,
            "text": "On a partially related note, why is apple asking me the login passcode of my old mac when setting up a new Apple device? The new device will ask my apple id password, then the 2fa code, then the password I use to login into my existing Apple computer. I don't want that. I already have 2fa.",
            "title_similarity": "0.65489554"
        },
        {
            "id": "i14tdvq",
            "score": 1,
            "text": "so if I have all my accounts secured with physical security keys, can i just make all of the passwords \"suckmyass69\" without worry?",
            "title_similarity": "0.8117439"
        },
        {
            "id": "i14tnel",
            "score": 2,
            "text": "That single point of failure is very small though, if you use a password manager that works offline.",
            "title_similarity": "0.63501143"
        },
        {
            "id": "i14tntq",
            "score": 3,
            "text": "This is unrelated to the question but it might help some people interested in this topic: I once heard an amazing tip from someone how to keep a different password for any site but always remember them flawlessly.\n\nFirst you start with a very secure base password:\n\"THisIsMyBa5ePa55word!!?\" This should be something long but easily rememberable.\n\nThen add something at the beginning or end that reminds you of the site.\n\nAmazon -> AmazTHisIsMyBa5ePa55word!!?\nFacebook -> THisIsMyBa5ePa55word!!?Face\n\nOr something like that. Make sure to always use the same format for the site reminder and you have 18-20 character, un-bruteforceable passwords. And if you use something like FTHisIsMyBa5ePa55word!!?B, even if your password gets hacked, its not necessarily identifyable whether this works for different platforms so even if a service gets their entire passwords leaked you should be pretty fine.",
            "title_similarity": "0.73874074"
        },
        {
            "id": "i14ur86",
            "score": 1,
            "text": "Late to the party, but here goes:  \n1: Password managers GENERATE sufficiently secure passwords for each new account/website. This eliminates the risk of password re-use.  \n2: You only need to remember the MASTER password for the password-manager database. A hacker would need to get hold of the password-manager database, then get your MASTER PASSWORD, to access all the other passwords. This increases the level of effort required to get your passwords.  \n\n\nUsed correctly, password-managers work very well.\n\nUnless:  \n1: You are that small subset of users who manually create shitty passwords and use the password manager purely to store their shitty passwords.  \nReason? They need to be able to remember the password in case they don't have access to the password manager.  \n2: You use a shitty master password, you know, because it's easier to remember.  \nPeople who fall into one or both of these subsets are much more common than you'd think possible.",
            "title_similarity": "0.8447646"
        },
        {
            "id": "i14vznk",
            "score": 1,
            "text": "Managers shouldn't be a single point of entry for an attacker. \n\nI haven't seen a manager program which doesn't come with a master password to access the manager.\n\nI suspect, like millions of users dealing with passwords, this system isn't utilized as it should be, given most people dislike having to deal with them.\n\nIf the master lockout is activated, there's no way an attacker can gain access. Usernames and passwords are encrypted under the manager program.\n\nAs an aside: Firefox also has a master password option for its stored password manager, though I don't know if other browsers have this.\n\nIf you are using a password manager without the master password lockout, then the risk of an attacker gaining access to all information from a single breech point is possible.\n\nIf you're using a mobile device, both biometric security and a master password on a manager is highly recommended given how easy a device can be stolen.\n\nI will also advise information many of you have heard before: never use the same password across multiple sites. Annoying, yes, but if an attacker gains one of your passwords, it's only to the site that was breached.\n\nA conservative 70% of all breaches most people experience is due to a single point of failure at a site they rarely use, because the password to the second site was identical to the first.\n\nAs one hacker once said: \"If you're not going to manage security properly, just direct deposit your money directly into my account so I don't have to do this the hard way.\"\n\nPerfect words to remember when it comes to security.",
            "title_similarity": "0.66595733"
        },
        {
            "id": "i14w3c9",
            "score": 1,
            "text": "So is this the thread to ask for recommendations for good password management suggestions?",
            "title_similarity": "0.684872"
        },
        {
            "id": "i14x1co",
            "score": 1,
            "text": "1. If you're really concerned about this about this you can setup your password manager in a way where you need both a master password and a key file, to create something similar to 2fa.\n\n\n2. In my password manager 84 different login details are stored, remembering that many different passwords just isn't feasible for the average human being, especially when you create ones that are actually secure.\n\n3. Your password manager is stored and operated on your personal device which usually won't get attacked unless someone is targeting you specifically. Large servers on the other hand are way more profitable as targets because you can get millions of users data.\n\n4. A good password manager uses encryption algorithms like AES-256 which are extremely unlikely to be compromised.\nOn the other hand as soon as you enter your password into some website you have no control or knowledge what happens with it. Most will store it in a safe way some might not",
            "title_similarity": "0.767185"
        },
        {
            "id": "i14ycqe",
            "score": 1,
            "text": "You can remember one very long password. Length and complexity decrease the chances of having your password cracked.\n\nUntil you write it down on a post-it on the bottom of your keyboard.",
            "title_similarity": "0.59055126"
        },
        {
            "id": "i14zg94",
            "score": 1,
            "text": "Using a password manager, and using it correctly, outright eliminates a lot of attack vectors.  I'll pretend to be the bad guy a few times here.\n\nScenario 1:  You are an executive at a high rolling company, and I want to use your company account to get access to your company financials.  I'm going to attack YOU.  I'm going to try to figure out what you might think of as a password, try to guess what you might be thinking, do some social engineering.  Using a password manager that has two-factor authentication and a random password generator prevents those kinds of attacks.\n\nScenario 2:  You're one of the 3 million normies from whom I want to steal $3 each today.  I'm playing a numbers game, i want to take a small, unnoticeable amount from a large number of nobodies by writing some simple computer scripts that will do simple things like plug passwords from a database into various login forms thousands of times per second.  Where am I going to get all these millions of user credentials?  Well, maybe from hacking into corporate websites, maybe by setting up honeypots, probably by buying lists of credentials on the dark web from people who have already done this. In this case, a password manager will prevent the \"try his pornhub password in his email account and his bank.\" attacks, because you have different passwords for each website.\n\nThe password manager I use is called KeePass.  It runs locally on my computer.  So my actual password data is stored on hardware I own and have physical access to.  The master password used to open that device is never transmitted across the internet.  Even if you had my password and my database, you'd also have to have the key file.  One of the millions of files on my computer is part of the encryption key, you can't unlock the database without it.  Have fun figuring out which one.  Not paranoid enough for you?  You could store your password database on a thumb drive, and then unplug it.  Not many people are going to come into my house and root around in desk drawers for a thumb drive with a password manager on it.",
            "title_similarity": "0.79242873"
        },
        {
            "id": "i14zwl0",
            "score": 3,
            "text": "Lots of good answers here, but one that hasn't been mentioned:\n\nGood password managers will have a secret key that you need to add the account to a new device. They would also have 2-factor authentication for any unrecognised devices. \n\nThe secret key is usually a key that's randomly generated when you create the account and shouldn't be saved in the manager itself. A piece of paper and a flash drive with it on in your safe and a is a good location, for example. \n\nThis way to compromise your account from anything but one of your devices, attackers would need access to that key, which should theoretically be entirely impossible.",
            "title_similarity": "0.8259185"
        },
        {
            "id": "i150xho",
            "score": 1,
            "text": "I don't know a single one of my passwords. Including my password manager password. If I needed that password I'd be fucked because I just use FaceID. I should probably write that password down and put it in my safe...",
            "title_similarity": "0.6952633"
        },
        {
            "id": "i151lru",
            "score": 1,
            "text": "Because you only need to remember 1 long password (containing, upper & lover case, numbers and special symbol) to prevent it being cracked for a million years or more\n\nAnd use KeySrambler to prevent your keystrokes being logged and giving someone an easy entry",
            "title_similarity": "0.72263366"
        },
        {
            "id": "i152vg6",
            "score": 1,
            "text": "While they are a single point of entry and yes if LastPass dashlane etc get hacked you are in a whole host of trouble. However as security first companies the level of effort a hacker needs to go to hack these services as opposed to some random website is higher. \n\nSecondly password managers typically demand a harder password by default therefore more secure on an individual basis. \n\nNaturally the best solution would be to generate your own 14-20 character password for each site, alphanumeric plus symbols but realistically that’s not going to happen so it’s important to do what we can.",
            "title_similarity": "0.7158148"
        },
        {
            "id": "i153cl6",
            "score": 1,
            "text": "Password managers often have password generators, which really is the only thing that makes them \"better\". A random 15+ character long password with letters, number, and symbols is by all intents and purposes uncrackable using any brute force method.\n\nAnyone hacking you will likely be trying to get into your computer itself, where any good password manager only stores encrypted information. This means that even if you did get hacked, all the hacker would find is encrypted nonsense.\n\nThe \"main password\" you use to get into your password manager is the decryption key used to translate the random hashes into actual passwords.",
            "title_similarity": "0.79903626"
        },
        {
            "id": "i153ywb",
            "score": 1,
            "text": "Think of it like a door, your password is a door that needs one key to open up.\n\nThe password manager is a door with a security guard and a key, so it can really only be accessed by social engeneering.\n\nAlso, a password manager uses different and strong keys to each site, if the security of one of them gets compromised, the others will be perfectly safe.\n\nAnd worst of all, most people uses the same password for every site, so if one leaks your password, you can be hacked everywhere.",
            "title_similarity": "0.83974695"
        },
        {
            "id": "i15406g",
            "score": 1,
            "text": "Mostly because the vast majority of people only need security up to a certain level and also Because of multifactor authentication which by the way does not just have to be two factor. You can keep adding more factors!",
            "title_similarity": "0.61985326"
        },
        {
            "id": "i154mm9",
            "score": 1,
            "text": "I will add to this, that the best password managers (like Password Safe) are not cloud stored, or web site stored, they are local only. So, someone would have to have direct access to your computer, either thru a remote compromise like AnyDesk, or physical access, and *then* they have to break that password. So yes, you can consider it a single point of failure if someone breaks into your house, or your computer....",
            "title_similarity": "0.81504714"
        },
        {
            "id": "i154tv3",
            "score": 1,
            "text": ">Why are password managers considered good security practice when they provide a single entry for an attacker to get all of your credentials?\n\nBecause I don't use my password manager *password* on any website.\n\nHow can the hacker guess my 18 alpha-numeric password if it's never been used anywhere besides locally?\n\nFor example, 1Password cannot be hacked because it requires a master-key and a password and an login. You can't get my master key because it's on a physical piece of paper in my vault. So even if you guessed my password, it's not that simple and you still cannot gain access to my passwords.",
            "title_similarity": "0.81546855"
        },
        {
            "id": "i154u2z",
            "score": 1,
            "text": "The concentration of your passwords at one place is indeed a risk.Everything is a risk, and the art of risk management is to lower the risk to an acceptable level.\n\nIn general, the attacker is not attacking you personally, but the applications/websites that you use. That way, the attacker potentially gains access credentials of milions of users per successful attack.\n\nIf people use the same (or even similar) passwords on multiple sites, the credentials captured in one breach might be used to gain access to other sites, without noticeable attack on those. If such access is successful, it leeds to all sorts of negative effects for the legitimate account owner.\n\nThe attacker is not out to get \"you\", but to get \"anyone\".\n\nAs an account owner, it is therefore in your best interest to ensure you never re-use passwords and make them strong enough. (And use multifactor authentication.)\n\nPeople are using many, many sites that require access credentials and there is a limit on how many passwords you can remember, so re-use is natural if you rely on memory. A password manager enables you to store individual passwords for everything, without having to remember them.\n\nThe benefits of having random, distinct passwords everywhere, although stored in a password manager, outweights the drawbacks of re-using the same password in multiple places.",
            "title_similarity": "0.7851548"
        },
        {
            "id": "i155vev",
            "score": 1,
            "text": "I think your question has been answered several times over by now. So a quick protip here is to use a long, unique passphrase that you can easily remember. You hardly have to worry about mixing in special characters or anything fancy, just a LONG passphrase that's relatively unique to you and only used for your password manager. Also, use MFA, preferably hardware like yubikey. Or an authenticator app. SMS as a last resort but better than nothing. Hope this helps a little!",
            "title_similarity": "0.7150477"
        },
        {
            "id": "i156g15",
            "score": 1,
            "text": "Password databases are encrypted which means it's not practical to unlock that database without the password.  As long as you have a strong, unique password (so it can't be discovered when some website gets hacked or whatever) to unlock it the risk of someone capitalizing on that single point of entry is pretty low.  Meanwhile you have strong, unique passwords for everywhere else that you don't have to remember and having the password for one website that gets hacked exposed doesn't give them access to anything but that one site and you only need to change your password there rather than having to change them all over the place.  \n\n\nAlso there are offline password managers (I use KeePass) that store your password database locally (it's a good idea to keep it backed up though) so risk of it being breached is pretty low.",
            "title_similarity": "0.8062705"
        },
        {
            "id": "i158w0a",
            "score": 1,
            "text": "/u/flyingpimonster has a great reply. I'll add that if you use something like a yubico hardware key with an uber strong master password, it is essentially impossible for an attacker to gain access to your accounts.   \n\n\nI use Bitwarden and a Yubico hardware key to both unlock my Bitwarden and 2FA into most accounts.   \n\n\nIn effect, to \"hack\" my passwords, you would need my master password, my email, and my physical hardware key to get to any of my other passwords.",
            "title_similarity": "0.8364265"
        },
        {
            "id": "i158xcf",
            "score": 1,
            "text": "Much easier to remember one really complicated password than 10 really complicated passwords, especially when you have to change them 3 or 4 times per year. It becomes harder to create passwords that are secure and that you can memorize. If you have one, really long password with a good combination of letters, numbers and characters (&, %, $, #) cracking the password manager becomes a much more difficult task.",
            "title_similarity": "0.6107278"
        },
        {
            "id": "i15b4f9",
            "score": 2,
            "text": "Rather than remembering your own passwords, you can have something store them for you. Now you only have to remember one password to access that storage. \n\nThe upside is that one very difficult password is still quite easy to remember and this makes any attack a lot harder.",
            "title_similarity": "0.72199684"
        },
        {
            "id": "i15b80m",
            "score": 1,
            "text": "Sorry if the question is basic, but how do you know to trust a specific password manager?",
            "title_similarity": "0.7826203"
        },
        {
            "id": "i15bel5",
            "score": 2,
            "text": "Password managers create a heavily encrypted blob of data, that's what holds your passwords. \n\n**Only you know and hold the master password that decrypts that blob, it is a password that can't be recovered if lost**. \n\nThat means you can't \"social engineer\" a master password, and there's nothing to \"hack\" to get to master passwords - there is nowhere they are stored by the password manager company. \n\nThat's why when you set up a password manager, you need to be very careful to make offline (printed) backups of your password and/or account recovery codes.  It's also a good idea to use a physical key (like a YubiKey) to unlock your vault. \n\nPassword Managers, as long as you set up your recovery plan well ON DAY 1 - and use a long passphrase (not password) as your Master Password - are a great solution.  \n\nNote that as others have said, protecting your EMAIL account with Multi-factor authentication VIA AN AUTHENTICATOR APP (Not SMS)\n\nand your MOBILE PHONE ACCOUNT by adding an Account PIN  (How-to: [ATT](https://www.att.com/support/article/wireless/KM1051385/)  [VERIZON](https://www.verizon.com/support/account-pin-faqs/)  [TMOBILE](https://www.t-mobile.com/support/account/update-your-customer-pinpasscode)  ) are some of the most important things in personal online security. \n\nSources: \n\nBitwarden: Lost Master Password \"[Bitwarden has no knowledge of, way to retrieve, or way to reset your master password](https://bitwarden.com/help/forgot-master-password/).\" \n\nLastpass: [\"LastPass Support has no knowledge of a user's master password. It is not possible for LastPass Support to reset or change a user's master password if it is forgotten.\"](https://support.logmeininc.com/lastpass/help/why-cant-lastpass-customer-care-reset-the-masterpassword-for-my-account)\n\n1Password: is (in my opinion) more forgiving (and sloppy), but still you end up in the same place - \"[For your security, your account password is....only known to you...the only way to decrypt your data](https://support.1password.com/forgot-account-password/)\"",
            "title_similarity": "0.79461586"
        },
        {
            "id": "i15cvxu",
            "score": 1,
            "text": "Every reply assuming we use the same password for everything defeats the purpose of this post.. A few might be recycled, but no, we don't use the same for online bank as email etc.. I might use the same for online cooking as i do for this disposable Reddit account",
            "title_similarity": "0.6969367"
        },
        {
            "id": "i15d8g4",
            "score": 1,
            "text": "Having a bunch of very complex passwords for every site > A secure password manager with 1 very complex password > Reusing the same password for a bunch of sites > Reusing the same simple password for a bunch of sites  \n\n\nThe ideal is that you remember a bunch of complex passwords yourself. However lets be real, many of us reuse the same 3 or 4 passwords on a bunch of sites. If one of those sites gets hacked, you've now made a lot of your accounts vulnerable. The safest option for a lot of people is to use a password manager that's very secure to manage all your other passwords. Password managers should be encrypted to protect you and often have multi step authentication. This level of protection is about as good as it gets and is fairly secure for 99% of people.   \n\n\nI use a password manager for everything but my bank and my gmail which uses their own unique passwords. This is the safest realistic option for me.",
            "title_similarity": "0.8006317"
        },
        {
            "id": "i15dcd7",
            "score": 1,
            "text": "Passwords don't normally get broken into by guessing or brute forcing. While you should use complex passwords to avoid such basic strategies, the reality is, if you're account is going to be compromised, it's going to be from someone breaking into an unsecure server and stealing the entire password database. If you have an account with the hacked website, your best hope is to have a different password on every other website so that the damage is limited.\n\nA password manager will use encryption on your passwords, so even if someone did break into the password manager server, they couldn't actually read your password to do anything with it. (Theoretically they could also get the encryption key, but this is another level of difficulty for a hacker.)",
            "title_similarity": "0.789927"
        },
        {
            "id": "i15enic",
            "score": 1,
            "text": "In case you're wondering if your password is out there you can check it on https://haveibeenpwned.com...",
            "title_similarity": "0.64482117"
        },
        {
            "id": "i15esov",
            "score": 1,
            "text": "Its a different risk profile. When a person or group hack a service and steal all the passwords/hashes to crack; they get 100s of thousands of accounts at once. Then they sift through and find more.\n\nTo attack your password manager, they have to attack you. There are many managers you could use. This is a lot more work for a lot less benefit.\n\nIf you have serious access into juicy targets, or are a juicy target, then you might be targeted. Most people will never be specifically targeted and, for the most part, if you are specifically targeted, you have much bigger problems than any single piece of software is going to solve.\n\nYou are unlikely to have those problems in a real way.",
            "title_similarity": "0.68300265"
        },
        {
            "id": "i15fuqo",
            "score": 1,
            "text": "Everyone talking about bitwarden, what about microsoft authenticator password storage or saving passwords on drive with multifactor auth?",
            "title_similarity": "0.7080736"
        },
        {
            "id": "i15gwoy",
            "score": 1,
            "text": "Something I also do in my password manager is not add my username but use clues to it such as ( initials + fav number) etc etc. That way even an access to that password manager is still vague on what those accounts are actually named.",
            "title_similarity": "0.69068336"
        },
        {
            "id": "i15i0df",
            "score": 1,
            "text": "because you can create one good password that you can remember for the password manager and then use its random generator to create incredibly secure passwords for the other sites.\n\nThe main thing that matters for passwords is length, with numbers and symbols second. So a very good password is four or five words in a row that you can remember. You use that for the password manager and then it will generate random sequences of letters numbers and symbols for the other websites, which are all even more secure.\n\nPassword Manager: bicycle ring sang trouble\n\nOther sites:\n\nW\\_jT:}2ukx\\\\%b5X\\_\n\nHp@KEf\"g89a%U&\\]>\n\netc",
            "title_similarity": "0.7526374"
        },
        {
            "id": "i15i4ev",
            "score": 1,
            "text": "LPT: Use a relatively long passphrase for your password manager. Then just never forget that phrase.",
            "title_similarity": "0.6533824"
        },
        {
            "id": "i15ibuj",
            "score": 1,
            "text": "Its kind of like how a having all your keys on a key ring makes it more vulnerable to having them stolen all at once but having a bunch of keys scattered in your pockets makes it more likely to lose random ones and some people would just get one key to unlock everything.",
            "title_similarity": "0.66467655"
        },
        {
            "id": "i15je19",
            "score": 1,
            "text": "If you need to  remember lots of individual things you make them easier to remember and therefore easier to break. If you only need to remember one thing (password manager) you can make it complicated and still remember it making it much harder to get into.",
            "title_similarity": "0.61448866"
        },
        {
            "id": "i15jgdq",
            "score": 1,
            "text": "Why use a keychain or key ring to hold all your house keys, car keys, gym locker keys, the shed keys, etc? SURELY someone will have access to all your stuff and property if they keychain bundle was lost or stolen!!\n\nBut you’ve been carrying a keychain with all your keys your whole wether it be on your persons or in a purse or in your house hands or clipped to you.",
            "title_similarity": "0.59562993"
        },
        {
            "id": "i15kp2v",
            "score": 3,
            "text": "I would suggest instead of using a password manager or having to remember complicated passwords, instead remember a unique algorithm that will produce the same but different password for each site/service/os etc you have. That way you have a unique password each time and dont have to use a password manager\n\nIt could be something like\n\nYear a family remember was born \n+ Reversed First and last letter of website/service\n+ Variation based on service like wb for a web site, os for an operating system, ml for an email etc….\n+ other random meaningful string characters\n+ other things you might think of\n+ a number to increment if your password ever gets breached\n\nThrow in special characters between each sections too\n\nThis could produce some things like\n\n88_tr@wb!01Gener8#rtbw_01\n\nAnd you’ve got a unique complex password for everything without having to remember the password since you can reconstruct it each time.",
            "title_similarity": "0.7065963"
        },
        {
            "id": "i15mnpq",
            "score": 1,
            "text": "Your single point of access password manager should also be behind a pass phrase. So, a 16+ character sentence with numbers and special characters.",
            "title_similarity": "0.5545006"
        },
        {
            "id": "i15n4zi",
            "score": 1,
            "text": "The first thing to recognize is that security is full of compromises. Having a single database with all your passwords is not ideal, but it is the best solution that works in the current environment. Let's walk through a couple of scenarios, then dig into some more security topics.\n\n**No Password Manager**\n\nLet's say you have no password manager (this includes using your browser to save passwords). How do you choose passwords? Most relatively tech savvy people who do not use a password manager have two or three passwords. One super secret, super secure password that they only use for their most important accounts, like email and banking. Then they have a second password that they use for things like online shopping, social media, forums, and that can't be used to make purchases.\n\nConsider what happens if one of those passwords are compromised through a website leak (no fault of your own). The attacker now has access to all the sites that use that password. They could go online and make a bunch of purchases, or even worse, they could use your social media accounts to impersonate you and extort money from friends or family. A very common scam is to use stolen social media passwords to send DMs to family members claiming that you're in an emergency situation and need someone to send money immediately. So now the damage has extended beyond you; your family has suffered financial harm.\n\n**With Password Manager**\n\nNow let's say you use a password manager with strong, unique passwords on every website. Some random social media app that you don't even use any more leaks passwords on the internet. The attacker now has your password for that site.\n\nFortunately, a good password manager will actually alert you of the password disclosure, so you have an opportunity to immediately login and change your password or close your account. You still have some risk if you don't, but the attacker only has access to that single account. Your relative exposure is very small.\n\n**How Secure Are Password Managers?**\n\nSo that all sounds good, right, but how secure are password managers themselves? If websites get compromised, can't password managers be compromised too? These are valid questions, but hopefully the answers will bring you comfort.\n\nPassword managers are typically developed by security professionals. Security is their product. For most websites, security is just a component of their overall business, and many do not make it a priority. In fact, I would say that *most* don't make it a priority. Making security a priority means hiring dedicated security-focused staff, then giving them real power to enforce security related decisions. This is difficult for most companies.\n\nThe companies that make most password managers are actually run by security professionals. Without a security-focused environment, they have no product. Their product is under constant scrutiny from the infosec community.\n\n**So Why Do We Use Passwords Anyway?**\n\nUnderlying all of this is the very fact that we use passwords at all. Logging in to a website involves a process called authentication. The website has to authenticate (prove) that you are who you say you are. So how can we do this?\n\nIn the real world, we rely on trust networks and trust chains. If you want to open a bank account, you have to provide a state issued ID card. In order to obtain a state issued ID card, you have to provide paperwork proving who you are. This is called a network or chain of trust.\n\nWebsites actually use chains of trust too. When you visit a website using secure methods (HTTPS), the website tells your web browser, \"I really am [www.reddit.com](https://www.reddit.com), and to prove it here is a certificate.\" That certificate (called an SSL certificate) is provided by authorities that your web browser trusts. Your web browser and operating system maintain lists of trusted authorities. If your web browser encounters a certificate issued by an authority that it does not recognize, it presents a warning. You've probably seen it before. It's full of technical jargon that might make more sense now that you understand the basic process.\n\nSo why can't individuals get a certificate to prove who they are? We can! Some government agencies even require that you have a web ID certificate in order to access their website. The trouble is that obtaining, installing, and managing web ID certificates is a big hassle. Early in the development of the web, they weren't widely available and if they were they were expensive, so website operators went with another option: passwords.\n\nIn security parlance, passwords are called a \"shared secret\". When you first establish an account on a website, you provide the shared secret. Now, only you and the website know the secret. Any time you come back, you say, \"Hey, I'm bradland, and the shared secret is 'correct-horse-battery-stapler'.\" The website checks its records for bradland and sees that the shared secret provided is correct, so it lets me in.\n\n**So What's Next?**\n\nThe only thing between an attacker and your account is your password. That's why username & password authentication is called \"single factor\". Your username isn't a secret. Everyone knows it; hence, it is not a \"factor\" in authentication.\n\nYou might have heard of 2-factor authentication. This type of authentication uses a password *and* another factor. The second factor can be any number of things, but one of the more common is called a one-time-password, or OTP.\n\nOTP works by using a math algorithm to generate codes that expire after a certain amount of time. Both the website and the user's OTP generator (usually an application or a little hardware device that displays numbers) use a \"seed\" number that is fed to the math algorithm. If two generators use the same seed, they'll always out put the same number at the same time. So by comparing the number your OTP generator has to the website's own OTP generator, we can arrive at a second factor.\n\nOther second factors include biometrics like fingerprint scanners and facial recognition software. The trick to using these in practice is securing the link between the scanner and the website. For example, a fingerprint scanner is useless if an attacker can easily read information coming from the scanner and copy or alter it before sending it to a website. Newer phones and computers contain hardware that are specifically designed to secure this type of communication, so in the coming years, we should see more biometric factors used as second factors in authentication.",
            "title_similarity": "0.78402525"
        },
        {
            "id": "i15nlf8",
            "score": 1,
            "text": "you can remember the entire English alphabet, right? It’s 26 unique characters. You can also probably remember most English punctuation marks. Lets just add 14 to that 26 for an even 40. \n\nNow that’s one secure password. \n\nHow many other language’s alphabets can you learn and memorize and be able to spew perfectly when given a prompt? \n\nOnce you need to start keeping notes to remember, you’re just using a weaker password manager.",
            "title_similarity": "0.6074155"
        },
        {
            "id": "i15o4mr",
            "score": 1,
            "text": "I have no idea.  It makes no sense to me either.  I would trust nobody but myself with my passwords.\n\nMy method?  I smash my keyboard in notepad.  I then add and delete a few characters, adding in non-alphanumeric characters, and swapping in some capitals.  I then save it to a USB drive and copy it to a physical notebook.  I delete it off my computer and that is that.  My passwords are effectively immune to brute force attacks.  The USB is merely a backup of the original, in case I may have transcribed it incorrectly.\n\nI also have no problems generating new passwords in the case I lose everything, like in a house fire or something.  In order to get access you have to physically come to my house.\n\nAdditionally, I am well versed in methods people use to infiltrate the human mind, so it is unlikely I will be fished for information.  And lastly, I don't run free AV software, which is very weak, so while it is possible my computer could be a point of failure, it is the best one could ask/pay for.\n\nThings function here about as well as one could ever expect.  Beyond that, well, nobody is going to do better.\n\nEdit:  You want to know what is messed up?  Your bank has weaker security for your bank account than I have for my password for my Email account(s).  Wrap your brain around that.",
            "title_similarity": "0.7244115"
        },
        {
            "id": "i15oj8x",
            "score": 1,
            "text": "This reminds me, back in the days of MySpace. My profile was hacked somehow, they changed my password to devil666 or something like that, I was terrified at the time. Who and why would they change it to that.",
            "title_similarity": "0.5850942"
        },
        {
            "id": "i15on0o",
            "score": 1,
            "text": "When designing and choosing systems, you often have to make choices between two opposite variables.\n\n  \nSecurity often comes at the cost of ease of use. Many people want security, but they don't want to carry around a notebook with all their passwords.  \n\n\nA digital notebook with all their passwords is a bit less secure, but much more practical. And it is still more secure than reusing passwords.  \n\n\nIn short, removing password managers would be more secure, but the users would either have  too many passwords to remember, or they would compensate by reusing the same password.",
            "title_similarity": "0.6434194"
        },
        {
            "id": "i15p67a",
            "score": 1,
            "text": "It's because to many dumb people use the same password for everything. And it's usually a predictable password like God, sex, or the one I use most often \"hugepenis\"",
            "title_similarity": "0.67800236"
        },
        {
            "id": "i15p8sa",
            "score": 1,
            "text": "One thing I don't see people talking about is the fact that many password manager systems require a security code to set up their password manager on a particular computer. \n\nThis means that if you've only installed that password manager on one machine. That's the only machine that can access the password manager. No other machine on the internet will be able to get to your passwords. \n\nThat's an incredibly small footprint. \n\nEven if you install it on your phone and on your computer that's still just two devices. Compare that to the number of machines that can connect to Google and attempt to log in and it starts to become clear how powerful the password manager is.",
            "title_similarity": "0.7450006"
        },
        {
            "id": "i15ppva",
            "score": 1,
            "text": "That’s the nice thing about 2 Factor Authentication. Someone may have gotten my password, but without the having my phone as well, they can’t get in without the text message I got.",
            "title_similarity": "0.7222588"
        },
        {
            "id": "i15pxbs",
            "score": 1,
            "text": "Pretty much what people are saying about re-using passwords being the problem. When one system gets breached, those credentials are often shared. Anyway, your ELI5 is warranted and I believe that in most cases today in how people use password managers, they should not be considered good security practice unless they are offline and totally in your control on your devices. On the other hand, many people use cloud based password managers which is probably the foundation of your question. What if that cloud based service has a breach? Can you trust them that the master passwords or site passwords are encrypted or don't have reversible encryption? I don't. I recommend offline KeePass.",
            "title_similarity": "0.79729766"
        },
        {
            "id": "i15q38y",
            "score": 1,
            "text": "All your house locks, front door, garage, back door, outer fence, garbage bins, and your car keys and keys from work and keys from your parents house, etc are one from a set of 3 master keys.\nAnyone who finds a missing key from any of those places, like your desk in your workplace, has suddenly access to your parents house, or many of your house locks.\n\nInstead a password manager is just one key on your pocket attached to a string, that opens a box with a large set of different keys  for any of those locks.\n\nThat way if you go to the yard and your garbage bin key falls in the grass, whoever picks it just have access only to your trash.",
            "title_similarity": "0.6073428"
        },
        {
            "id": "i15rqk5",
            "score": 1,
            "text": "What is my password to my phone? Can't answer? That's why.",
            "title_similarity": "0.6491052"
        },
        {
            "id": "i15sb5f",
            "score": 1,
            "text": "What's the point in buying a laptop with a biometric opener when the it dude at work gets a hold of it and disables the biometric opener inputs a password that's something along the lines of \"get a password manager\"",
            "title_similarity": "0.76511884"
        },
        {
            "id": "i15sdu9",
            "score": 1,
            "text": "It creates very difficult passwords for every website/app.\n\nGenerally this is good, but true it creates one entry. That's the issue, regardless of how you store that random secure password, a hacker will have a single entry to it, even pen and paper.",
            "title_similarity": "0.82955503"
        },
        {
            "id": "i15t4rn",
            "score": 1,
            "text": "Two minutes ago, this was my password here on Reddit. It happens to be mixed with various numbers, letters, symbols, varying from uppercase and lowercase, and unique to this website not reused anywhere else. Additionally, this password is changed on occasion. Repeating this over multiple websites and apps, for the average person, this is not something you could remember everywhere. Added with two (2) step verification (or more) and the likelihood of anyone gaining access is unlikely.\n\n(@%dJm4n3&zO0wcbK8+vF1y5$\nA_t2G%)7:H#9vE'@q6LZu?ys8f;-\"*\n?pD0/SV, 9\\42=~7}2{e£M8€B>GF\n¢Q.iX69;]aj|21[7b^\n\nWhile it is true that your password manager then becomes the weak link in your security, the trick is to use something nearly as complex and remember it since now you only need to recall one single password. Additionally, this would be encrypted and require two (2) step verification (or more) to gain entry.",
            "title_similarity": "0.68504"
        },
        {
            "id": "i15t7me",
            "score": 1,
            "text": "So if you don't use a password manager then you remember all your individual passwords? Do you write them down on paper? Use the same password repeatedly?\n\nIf a data breach occurs your email and password can be exposed. If you're using the same combination for multiple websites then you are in trouble. A password manager will create random passwords for you each time and remember them. Many also focus on good security practices like 2 factor auth, etc. Overall it is not perfect but the amount of time and energy it saves you is insane.",
            "title_similarity": "0.78392047"
        },
        {
            "id": "i15tf17",
            "score": 1,
            "text": "Lot of good answers here, but I want to go a bit into the details that tend to get overlooked a lot. Let’s talk about threat modeling.\n\nThreat modeling is the concept that everyone has their own set of threats that apply to them, and their own set of risks that they apply to those threats (where “threat” is roughly “a bad thing that can happen” and “risk” is “the likelihood that a given bad thing will happen”). You can even have different threat models yourself, in different contexts—it’s why writing down all your passwords on sticky notes at work is a bad idea, but writing them all in a notebook labeled “passwords” that you keep at home may not be. The threat level of both is the same, but the risk is more significant at work; at home, if someone breaks in, they’re probably just gonna steal your TV and run, not look around for your password notebook.\n\nPassword managers come with their own set of threats, but they aim to address a very specific one: the threat that that random website you signed up for three years ago gets hacked, and they stored their passwords in plain text. When that happens, all the passwords get posted publicly on the internet, or sold on cracking forums. If that happens, and you’re not using a password manager, then you’re in trouble: if your password is the same everywhere then now anyone who knows where to look knows your password. Even if it isn’t the same everywhere, you’re probably using a pattern that someone might be able to notice and figure out just from the one password. And given how many data breaches happen (and how many of the breached sites store their passwords improperly), this is fairly high risk, so it’s worth addressing.\n\nPassword managers trade that threat, the threat that *any* of the sites you use could be compromised, for the threat that your password manager gets compromised. But let’s analyze the risk there, specifically for cloud-based password managers like Bitwarden or Lastpass. \n\nFirst off, you know that the company providing the password manager is likely to have a security team monitoring the environment for intrusions or other compromises. You know that they’ll be keeping up with the latest security patches for all their servers, and that they take potential bug reports in their software pretty seriously. Any reputable password manager will—they’re companies dedicated to security, so they’re probably not skimping on it. But on top of that, even if they *do* get compromised, the attacker still can’t get your passwords. All your information is stored in a way that ensures the servers never have access to it, only you. So rather than just dumping the database, an attacker would need to figure out another way to get that data, and while there *are* ways it’s pretty unlikely they’d succeed.\n\nThere are also other threats that are shared between password managers and other websites, like the threat of a man-in-the-middle attack, but they’re typically higher risks for random websites than for password managers. Some people’s threat models might include highly advanced state actors targeting them specifically, and those people may want to use a local password manager and never touch the cloud, but… for the average person’s threat model, you have a lot less risk from a password manager than from passwords you remember yourself. And at the end of the day, that’s what security is about: finding the option with the lowest risk given your own threat model.",
            "title_similarity": "0.6875496"
        },
        {
            "id": "i15u7hk",
            "score": 1,
            "text": "Because what the fuck else are we gonna do?  Fucking software developers have failed us, modern computer systems are completely fucking unusable, I spend more time logging in to shit to work that working.\n\n&#x200B;\n\nsource: Am a software developer",
            "title_similarity": "0.57639694"
        },
        {
            "id": "i15vt4o",
            "score": 1,
            "text": "I've seen a fair amount of password lists in my life, and they all have one thing in common: a common password. You would be surprised how many times a given string is used for people's passwords.\n\nThis is not entirely unexpected, since the growing complexity and aging rules for passwords has made it so that people simply cannot recall their passwords any more. Netflix, Amazon, Reddit, gmail, LinkedIn, banks, utilities, airlines, the list is literally endless.\n\nThe average number of site/password combinations in people's lives is approaching 300. This includes a lot of dormant passwords for long-ago site registrations that you needed to order a fucking pizza, for crying out loud. Where do you think those dormant passwords go?\n\nAnswer: nowhere. They sit on sites waiting for someone to come along and steal the hashes. And if your 2007 gym membership password is the same as your 2022 Bank of America password, you're done for. \n\nA password manager generates a unique password for each site. It does not clear your responsibility to guard the asset on which your password manager runs, but it does give you a chance when the next data breach occurs. If the password hashes to one site are published, you are vulnerable at that one site, and a manager can assist in closing that hole.",
            "title_similarity": "0.63025135"
        },
        {
            "id": "i15w8m2",
            "score": 1,
            "text": "I asked this same question the other day and it got removed for \"arguing for a point of view\" -.-",
            "title_similarity": "0.40534586"
        },
        {
            "id": "i15x344",
            "score": 1,
            "text": "It's a single catastrophic point of failure, but if that single point stays secure everything does.\n\nBy contrast, a single password used for 50 websites is 50 points of failure. All it takes is a breach at the weakest link and and everything is exposed. e.g. I don't have a ton of confidence that the self-hosted website of my local Mexican Restaurant is going to keep to the same cybersecurity standards as Google.",
            "title_similarity": "0.6288998"
        },
        {
            "id": "i15xvrr",
            "score": 1,
            "text": "My password manager is un-hackable. How is that possible? Everything is hackable?! I have a notepad and put it in a safe. If that safe is being attacked, we have bigger problems to worry about.",
            "title_similarity": "0.747439"
        },
        {
            "id": "i15yw9w",
            "score": 1,
            "text": "I think a bunch of people are missing the point, or at least my concern with it hasn't been answered. Yes, that manager makes much better and unique passwords everywhere, but it has a single point of failure - your master pw to log onto onepass/lastpass etc. What happens if that gets attacked or broken? Am I wrong in thinking that makes a weak point? Say someone hacks my pw manager account itself, wouldn't I basically be fucked?\n\nCan someone explain what I'm missing please?",
            "title_similarity": "0.7100635"
        },
        {
            "id": "i15z8vo",
            "score": 1,
            "text": "In reality is not THAT much of an improvement on security, however it can easily be boosted exponentially when coupled with a two factor authentication method, like tokens for example. It’s easier for the end user to manage one very secure password with a token than remembering several difficult passwords and one or more token.",
            "title_similarity": "0.63910615"
        },
        {
            "id": "i15z9b5",
            "score": 1,
            "text": "Let's say you live in a house with 10 doors, each requiring a key. If someone gets in, they get access to your entire house, regardless if they get one key or all 10. Having a password manager is like having a key ring with all your keys - it's easier to keep track of and secure than having 10 loose keys, and there's no chance that someone swipes that old key you don't use often at all.",
            "title_similarity": "0.6713093"
        },
        {
            "id": "i160sjj",
            "score": 1,
            "text": "Password managers allow you to set complex and unique passwords for every single account you own.  The password vault is encrypted and so it your complex password.  Services like 1Password don't even keep your plain text password. Just the encrypted hash.  So even if they had a company breach attackers still wouldn't see the contents of your password vault.",
            "title_similarity": "0.8284627"
        },
        {
            "id": "i1628nq",
            "score": 1,
            "text": "It's a great question. I'll tell you what I tell everyone - Don't write your password down. Anywhere. Ever. Everything has vulnerabilities and those password managers will get hacked. I use a password manager and I have a backup file with all my accounts - what I do is write down a hint. I have several complex passwords that I know by heart and so I'll just write down an abbreviation of what that password is or a hint that will jostle my memory. If it has special characters or numbers or CAPS I'll note that, where they are and how many. I never write down my password. Now things are becoming more complex I might have to write down that the password is a combination of these <insert hints>, followed by any special characters that may exist.\n\nThis is an important topic but password security is  only one of many digital security measures that we need to consider. I'll encourage you to look into knowbe4 created by Kevin Mitnick (a convicted hacker), he keeps us abreast of the most common and hottest threats we face on a daily basis.",
            "title_similarity": "0.78228974"
        },
        {
            "id": "i162fw2",
            "score": 1,
            "text": "Well make a complex password that is 18 characters and they will never break it. That controls access to all of your passwords, which can also be complex. Yet instead of remember 20 to 100 complex passwords, you just have to remember one.\n\nPassword managers primary benefit comes from having them store complex passwords that would otherwise be impossible for you to recall. If you store weak passwords then do not use one.",
            "title_similarity": "0.7370391"
        },
        {
            "id": "i162r59",
            "score": 1,
            "text": "Late to the party, but I'll add my 2 cents.  All of the stuff about using different, unique, strong passwords for every site that others have said is accurate, but the answers I read through didn't answer the other side of your question - aren't you in a terrible place if a hacker gets a hold of your password manager's password?  And you are, but most password managers allow you to put a lot of security in place to protect your account.\n\nFirst and foremost, enable multi-factor authentication (also called MFA, two-factor authentication, TFA, and a host of other terms because \"marketing\").  This means that when you try to log into your password manager, in addition to needing to know your password you will also need access to your \"second factor\", which is \"something you have\" which is typically your phone (while your \"first factor\" aka password is \"something you know\").  While a hacker might steal your password, they likely won't have access to your phone.\n\nIn addition to enabling MFA, you can put a nice long password onto your password manager.  The thinking around passwords have changed a lot in the last 10 years, with people realizing that \"long\" passwords are better than \"complex\" passwords.  So a password like \"correct-horse-battery-staple\" (from the XKCD strip) is actually better than something like P@ssW0rd.  In addition to being harder to crack, it is easier to remember.  So having a password manager password that is something like \"noreallythisisamuchbetterpasswordthanacomplexone\" adds some additional security.\n\nAnd as one last tangent, password managers often allow you to include notes on each entry.  This allows you to put in nonsense answers to the password recovery questions, which stops people who would just look up the answer on your social media.  \"What high school did you go to?\" gets an answer like \"123qweASDzxc\" instead of \"St. Mary's\".  The program doing the check doesn't care that you put in nonsense when you set it up - it only cares that you get the answer correct when you use it.",
            "title_similarity": "0.82703936"
        },
        {
            "id": "i162zce",
            "score": 1,
            "text": "I like to use a password manager called a pen and paper combo. Very useful. Easy to update, and I can duplicate pretty easily for backups.",
            "title_similarity": "0.5975948"
        },
        {
            "id": "i1631up",
            "score": 1,
            "text": "Just to add to the many answers, you're correct that it is a single entry but it is (or should be) a super, super, robust and strong door.\n\nThere are many things I like to self-host and/or self-make. But when it comes to passwords, I assume that the people who do this for a living will be much better at making it secure and robust.",
            "title_similarity": "0.68577576"
        },
        {
            "id": "i163nfb",
            "score": 1,
            "text": "The main part is it makes it convenient to access a large number of user accounts/passwords in one place so that you don't replicate passwords which is the main way hackers get in: they have one account succesfuly and then find where your email is used elsewhere and try it again.  \n\n\nThen, the data that your info is stored in is encrypted so it cant be copied and accessed conveniently.",
            "title_similarity": "0.81299186"
        },
        {
            "id": "i163v73",
            "score": 1,
            "text": "Example you have a laptop instead of a traditional computer. Someone gets a hold of it, which is what anybody needs. They install a Key Logger, and now know what you type in your main password vault. Yeah your screwed!",
            "title_similarity": "0.7728471"
        },
        {
            "id": "i164p2x",
            "score": 1,
            "text": "The main reason passwords managers are considered good security practice is because they can help to prevent phishing attacks. Phishing attacks are a type of attack where an attacker tries to trick you into giving them your login credentials (usually by sending you an email that looks like it's from a legitimate website). If you use the same password on multiple websites, then the attacker only needs to get your password from one of those sites in order to gain access to all of your accounts. However, if you use a different password for each site, then the attacker would need to get your password from each individual site in order to gain access to all of your accounts - which is much more difficult. Password managers make it easy to use different passwords for each site by automatically filling in your credentials when you visit a website.",
            "title_similarity": "0.87757355"
        },
        {
            "id": "i164ulf",
            "score": 1,
            "text": "Sure, it’s a single password you have to remember but that password alone isn’t enough to get into your password manager on a new device (at least for 1Password). You need an existing “trusted” device to set up a new one, or your secret backup code that you hopefully save offline/in a secure backup location.\n\nOverall I think it just reduces the attack vector significantly for most users, and just generally makes using good security practices easier for people",
            "title_similarity": "0.74671066"
        },
        {
            "id": "i164z81",
            "score": 1,
            "text": "Is there any password manager that’s recommended over others?",
            "title_similarity": "0.6572491"
        },
        {
            "id": "i165cc4",
            "score": 1,
            "text": "You can set up multiblrme data bases for credentials you want to be separate. I also belive you should be using key files so its locked to your device.",
            "title_similarity": "0.6720524"
        },
        {
            "id": "i165ex7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.030960439"
        },
        {
            "id": "i1661ux",
            "score": 1,
            "text": "I will also note beyond many comments here - password management companies don’t just have your passwords lying around.  Even if a hacker got into their database, your passwords are encrypted and they would have to decrypt them to be able to actually use them.  With modern encryption that’s just about as hard as just guessing your password directly.  \n\n\nPassword managers seem like juicy targets but in reality there are easier ways to gain access to someone accounts.",
            "title_similarity": "0.8265927"
        },
        {
            "id": "i166qsy",
            "score": 1,
            "text": "About a year ago I changed the passwords to every account I had. \n\nThey are all about 20 characters long with random letters /numbers /characters/caps. \n\nI wrote them all down one 2 pieces of paper and also on a thumb drive.  They are no where else so no one can find the passwords unless they broke into my house and found where I hide them . \n\nNow ..... I need to pull out my passwords everytime I need to login because there is no way even I can remember them lol. But I like it that way.",
            "title_similarity": "0.5755938"
        },
        {
            "id": "i166vm5",
            "score": 1,
            "text": "You are 10000x more likely to have a website hacked than to have your personal password manager hacked. And a password manager makes it much easier to use really long and **different** passwords for every website you use.\n\nThat makes it so if there is a website breach, you will only have that one website account become vulnerable, instead of many that might use the same password.",
            "title_similarity": "0.7594311"
        },
        {
            "id": "i1673tf",
            "score": 1,
            "text": "After reading this, could someone recommend me a good password manager?",
            "title_similarity": "0.68349195"
        },
        {
            "id": "i168e4v",
            "score": 1,
            "text": "If you're using a password manager correctly, then it's next to impossible for anyone to simply have access to everything. \n\nBecause password managers have MULTIPLE layers of security, an attacker would need to circumvent each one:\n\n1. The main password.\n2. Two-factor authentication\n3. Encryption.\n4. In some cases, a key file.\n\nThey might also need access to a physical device and/or credentials to your self-hosted or cloud hosted provider, which has additional layers of security in place.\n\nPlus, password managers can be secured using physical hardware for 2FA or kept offline/local, so no attacker from the outside can ever gain access to your database.",
            "title_similarity": "0.81916934"
        },
        {
            "id": "i1691fj",
            "score": 1,
            "text": "If it is an local one an attacker needs to get deep enough into your system to either steal the content while the manager is open or steal the file and password separately, either way I suspect a attacker that reaches that far can probably install a program that steals your passwords when you use them, instead. Granted with a keylogger you have to wait until a password is used so or rarely used things it is better than a manager but still when your system is that compromised your passwords are in danger with or without manager.\n\nOutside of that situation it allows having different strong password for each account.",
            "title_similarity": "0.7465132"
        },
        {
            "id": "i1692iw",
            "score": 1,
            "text": "I feel like people aren’t understanding this question. They’re explaining how Password Managers are good because they increase your password count so you don’t get all your accounts exposed by losing one password, but I think this post is about if the password manager *itself* gets broken into. Then the person has your username and password for everything",
            "title_similarity": "0.7592202"
        },
        {
            "id": "i169fa4",
            "score": 2,
            "text": "They ARE a bad thing.\n\nIt's just that they're 'less bad' than the alternative of everyone using the same damn password everywhere.",
            "title_similarity": "0.60603386"
        },
        {
            "id": "i16ckos",
            "score": 1,
            "text": "Generally most hacks are from password sledging (eg linkedin gif hacked and they use your email password for Facebook MySpace PayPal etc) which is why multi factor is encouraged.\n\nThat being said if someone hacks your laptop then they could keylog or dump saved credentials anyway. It’s less likely to be compromised directly than it is for a big server which by definition is always online and vulnerable to attempts.\n\nIf you’re really worried you can generate a random password but append a known only to you secret to it. Or use a Yubi key or similar",
            "title_similarity": "0.7822597"
        },
        {
            "id": "i16cr56",
            "score": 1,
            "text": "Every new device that tries to log into my manager account needs a secondary (non sms) 2fa prompt. Seeing as they wont have that, to get my stuff they would need to **physically** have one of my devices **ALREADY** logged in, and then know my master password to get into the manager itself (and is set to a 15 minute lock window). I’m not at a shared office, if i was that window would be much smaller.\n\n…versus my wife who just uses the same password everywhere (I’m working on it…)",
            "title_similarity": "0.6402987"
        },
        {
            "id": "i16d17o",
            "score": 1,
            "text": "Cyber security student and self declared TechWizars here.\n\nI would recommend most Peoples to use a passord manager, this despite me not having used it up until I started studying IT security, now I pay for one.\nLet me explain:\nFirst of, use a passord manager you have to pay for as the money you spend on their service is used to defend against attackers on their end while also having to take the blame if anyting were to happen.\nAlso, use 2FA on both the manager and your email. The email should be linked to your phone number.\nIf you do it this way, it's almost impossible to have your passwords leaked unless the hacker does a SIM swap, at that stage it's the tele Company that does not follow protocol. \n\nBut I do not like passord manager, what should I do?\nMake a story, Split the story up into segments of 18 characters. Have random symbols as part of the story, now you can make a pathern that only you know to indicate start and end of the passord.\nExample:\n \"FBhello,mynam3isJ0hn-2mith.\"\"Google+1Am28y3ars} Ld\" ect, ect... Every time a passord gets leaked, you add on to the story. This way you can always play the story in your head and all you have to remember the symbols.\n\nJust due to the fact a passord manager will inform you if your passord gets leaked is reason for me to advice against the story formula. \n\nHope this explaimed it.",
            "title_similarity": "0.7193545"
        },
        {
            "id": "i16gcgp",
            "score": 1,
            "text": "1Password user here. It seemed like *single point entry* for hackers but there are extra steps besides that single point entry. You're probably referring to the \"master password\".\n\nTake 1Password as an example, it requires you to have E-mail, secret key and master password all at once to login on a new setup. With the optional one-time-password(2FA OTP) that changes every 60 seconds as the final key for opening the vault. Think of it as several combination locks welded together and you have to get all of them right all at once. Now that's tough.\n\nAfter that you only have to use the master password to access the vault on your trusted PC. This should be your concern, right?\n\n* What if the hacker got your master password and email account?\n\nIt's no use to them as they still need to have the secret key,2FA OTP(if you did set that up) and vice versa. So it really wasn't \"single point of failure\" or \"single point entry\".\n\n* What if 1Password got hacked?\n\nhttps://blog.1password.com/what-if-1password-gets-hacked/\n\nTo put it simply, if somehow all data and sensitive information are exposed to hackers, it takes forever(looooonger than the existence of universe) trying to crack the encrypted data. Unless they got lucky and hit the jackpot in less than 2^128 tries.\n\n* The easiest way the hacker can get access to your password vault is by gaining full control of your computer/phone and using the master password to unlock your already logged in 1Password app. It's the only \"single point entry\" they can do.\n\nAt this point it doesn't matter if you're using conventional password memorizing methods or password managers because they can just plant key loggers or steal your password text file in plain text.\n\nTL;DR\n\n* There's no single point of failure because hackers need to know everything on a multi-multi-combination lock.\n\n* It takes forever to decrypt stolen data from the password manager vault.\n\n* Unless you got your PC/phone hacked and hackers have full control it. Doesn't matter if you have password managers or not at then.",
            "title_similarity": "0.7739401"
        },
        {
            "id": "i16h5gl",
            "score": 1,
            "text": "Adding one bonus I don't see here \n\nThey help you avoid falling for spoofed sites using URLs meant to trick you. For example you might get tricked into clicking faceb00k.com with zeros instead of the letter o, or swapping l for 1 etc. Then they just clone whatever site it is to make it look like what you expect to see. \n\nIt's easy for humans to miss that difference, but your password manager will never fall for that.",
            "title_similarity": "0.72718525"
        },
        {
            "id": "i16hul8",
            "score": 1,
            "text": "Because it removes the issue of \"same password everywhere\" since you can use far more complex passwords without needing to memorize them, it can also enforce two-factor authentication everywhere (since the password manager is 2FA and no one, including yourself, knows the user name and password to any other site but the password manager, and most importantly, it prevents certain phishing attacks since it won't recognize the phishing attempt as the actual site, so you won't accidentally type in your password on a spoofed web site.",
            "title_similarity": "0.750811"
        },
        {
            "id": "i16hxps",
            "score": 1,
            "text": "It's a form of two-factor authentication essentially. You have to have a password **and** knowledge that the person uses a specific password manager. If you don't have that second piece of knowledge, you will never crack their passwords.\n\nIt's also essentially impossible to brute force a password manager like someone might brute force a database credential via terminal. Typically you have to physically enter values, and those can only be tested so quickly. Also, there is more likely to be a scenario where failed attempts result in lock-outs.\n\nIf you use the same password everywhere, all it takes is 1 of those places failing on some security level to get all of your passwords.",
            "title_similarity": "0.8070954"
        },
        {
            "id": "i16i942",
            "score": 2,
            "text": "1) A single point of entry is actually highly valued in digital security. If you have an leak of information, then there is only one place it could have gone wrong. The more places you \"store\" that information, the more places you need to \"resecure\".\n\n2) Most password safes are encrypted. Encryption takes all the information in the database, and uses a math algorithm from your password, to shift the data into new information. Even if you know how the shifting algorithm works, you still need to have the password to shift it correctly. So, it adds a very difficult-to-bypass layer of security to whatever information you store -- even if someone some how gets a hold of your database, they can't access anything in there unless they know the correct unlock password to decrypt it.\n\n3) Almost all of the databases have some sort of 2FA and lock-out conditions that you can configure. With that added extra layer, even if they know your password, they still can't decrypt the data without the 2FA key. And if you have a lockout, then they also can't try \"guessing forever\" at the password.\n\n4) Most of these databases come with password generators that make passwords that would take *trillions* of years for a computer to guess. People with password safes are more likely to use these, making all of their accounts more secure with more complex passwords. They're also more likely to use *different* passwords meaning that if one account gets hacked, then only that account is compromised. Even better  people are more likely to use *different* usernames and information, meaning that the more common composite-information data dumps fail to expose information about you -- if you have your name and social exposed on one site and sold on the black market, then someone can't buy it, and then find out from the name and creditcard number they already have on you, what your social is as well. This kind of \"composite leak\" is a frequent way that hackers *and big data companies* get very clear information about you.\n\n5) Password managers are more secure, by far, than more common methods people use to store password information. People often save their data when signing in on a browser -- by default, that is stored in a plain text file that anyone can read. You have to actively configure it for password storage. And even then, those methods aren't encrypted.\n\n6) People using password managers are more likely to use alternative sign in than SSO. Many people use SSO to avoid the inconvenience of multiple passwords; however, if someone gets access to your Gmail or FB, then they have access to everything. In addition, GMail and FB are more likely to experience data leaks and hacks than you are at home behind your wifi. As well, many services that don't support SSO are often storing passwords in poorly secured and exposed databases, and users frequently use the same password as their SSO. This means it is fairly easy, after some company randomly leaks your sign-in information, for the hacker to gain access to your SSO account and therefore all other information.\n\n7) Unless you want to go through the hassel of translating your passwords you've written down on paper into some complex code that only you can decipher, then the password manager's encryption is far superior to just writing it down.\n\n8) Password Managers also come with alerting tools to set your passwords to expire, meaning you are more likely to frequently change your password, making it even more difficult to hack you.\n\n9) Password Managers, like KeePass, often allow for documents to also be stored. This allows you to store private key files, or other information securely.\n\n10) Password Managers, like KeePass, try to support as many platforms as possible. You are thus more likely to use it anywhere you need data security, circling back to point 1 that a single point of exposure is easier to guard and trying to protect than *many different types and points of exposure*.\n\nSuffice to say, I *highly* suggest you get [KeePass](https://keepass.info/help/base/terms.html), which brings me to point 11) The more you use a very secure and safe *and easy to use* data security method, the more likely you are to get other people to use it and protect their data!",
            "title_similarity": "0.8286142"
        },
        {
            "id": "i16ihko",
            "score": 1,
            "text": "Offhand security note from IT person: Use multi factor auth for any account that means something to you. MFA will save your ass if your passwords happen to be leaked or bruteforced.",
            "title_similarity": "0.7794725"
        },
        {
            "id": "i16kitf",
            "score": 1,
            "text": "Which house is easier to break into: one with a single door with a heavy lock, or one with lots of doors with weak locks?",
            "title_similarity": "0.60808814"
        },
        {
            "id": "i16lk3t",
            "score": 1,
            "text": "Think of your passwords as a dartboard. It’s easier to get the outside rings than inside. But harder to get in on the inside. A password manager is like the bullseye being the entire board. You’re fucked if they get in, but every character in your password for that app is another foot away from the bots to throw",
            "title_similarity": "0.73406506"
        },
        {
            "id": "i16lwxc",
            "score": 1,
            "text": "It looks like there are already good answers here for your question - but I had something to add. \n\nOne thing you can do in conjunction with using a password manager involves having a short password that you memorize and do not store in your password manager. \n\nFor instance, you always end your randomly generated / secure passwords with \"red4\".\n\nThat way, even if someone gets into your password manager (which they shouldn't, since you have a secure password and use two factor authentication for it) then they still don't have any of your passwords without this short password that you always append to what you have saved. \n\nYou don't have it stored anywhere, just memorized!",
            "title_similarity": "0.7905916"
        },
        {
            "id": "i16m9s2",
            "score": 1,
            "text": "Password managers can also be used offline only ex. KeePassDX which is also open source and works on all OS.",
            "title_similarity": "0.51976395"
        },
        {
            "id": "i16mirm",
            "score": 1,
            "text": "my two pennies worth.\n\n* As noted in several other comments, if you are using good unique passwords on all of your accounts, you end up with a large number of single entries.  A password manager helps organize these.\n* You do not have to and should not use a single password manager vault for all of your passwords.  Ideally, you should have separate vaults with unique passwords to enter them ie work, administration, finance, games, etc.\n* A good password manager will let you specify the rules for generating a password customized for the account.  This lets you use the maximum strength password for that account, and autogenerate the password for maximum randomness of the characters.  This is really useful since there are no standards for how many characters or what symbols are used.\n* Once you start using a password manager routinely, it becomes very easy to login to an account, go to the change password form, and generate a new, unique and random password for that account.   Get in the habit of doing this routinely, so if a breach does happen somewhere, the information that the attackers get is likely out of date anyways.\n* I do not trust online password managers and elect to use a local software where the vault is stored locally.  I accept the limits this imposes on me, ie no online banking when not at home with access to my vault.  I accept these limitations as part of my security strategy.\n* Speaking of security strategy, set up multifactor authentication on every account you can.  This creates another hurdle for an attacker to get through to impersonate you.\n\nData security is 100% about practicing good behaviors.  You have to work at it and be diligent.  There are other benefits such as organization, knowing where your information is and how to retrieve it, etc.",
            "title_similarity": "0.84017015"
        },
        {
            "id": "i16n6s7",
            "score": 1,
            "text": "In MY opinion, if you're going to use a password manager that does Cloud storage, why bother. All the successful attacks on Sony and a truckload of others has shown that no server is 100% secure.\n\nUse a different password for each and every site AND use a password manager that is local only. Back up that local-only database in a few different ways and be sure to update those backups as needed.\n\nConsider secure email providers, such as ProtonMail, to protect your email en route and change your passwords frequently.",
            "title_similarity": "0.8084779"
        },
        {
            "id": "i16nl76",
            "score": 1,
            "text": "not an answer but happend to me, i somehow got a virus that reads all my passwords i saved and he went on to log in my youtube and uploaded something that made me get banned perma. my blizzard account got hacked and my cod vanguard got hacked and the person gave me for some reason max level and nothing else like bruh give me all cameos too. At the end i got everything back but google/youtube was the hardest to get back they literally ask you so many question u dont even know lmao",
            "title_similarity": "0.634743"
        },
        {
            "id": "i16oexa",
            "score": 1,
            "text": "What about using a long-ish grammatically correct sentance or two as your password? Couple that with a spelling mistake, and BOOM! Bob's your uncle.",
            "title_similarity": "0.62472904"
        },
        {
            "id": "i16ouu6",
            "score": 1,
            "text": "You need to remember only one strong password and have all other access stored in an encrypted file. It is well organized security. Everything depends on the one strong password, plus access to the password manager db file.",
            "title_similarity": "0.79524225"
        },
        {
            "id": "i16q0sg",
            "score": 1,
            "text": "Really it’s the thought that creating a single point of failure and then making that single point very secure is safer than having 200 potential insecure surface areas.",
            "title_similarity": "0.56347644"
        },
        {
            "id": "i16qn47",
            "score": 1,
            "text": "They're generally stored locally which makes them pretty secure on top of having a complex master password.",
            "title_similarity": "0.6322539"
        },
        {
            "id": "i16t6ov",
            "score": 1,
            "text": "I have close to 100 online accounts. Each password consists of random letters, numbers, and symbols, though some combinations are limited by the type of characters each site allows. Most of them are 16 or 20 characters in length, but some are shorter - again, because of site limitations. There's no way I could remember all of that random garbage without a password manager.\n\nAlso, I use KeePassX, so my passwords are stored in an encrypted database on my computer - not some cloud server that could be hacked. KeePassX doesn't even keep the unencrypted database in memory. It decrypts login info only when you ask for it, and then forgets it until you ask for it again. The encrypted database gets backed up each time my system is backed up. My KeePassX password consists of several pieces of information few people know except me, but which I know I'll never forget.\n\nThe only exception to the above are two passwords which are kept in apps on my phone - my Google password (for an account I use only for the Google Play store), and my wireless carrier login credentials (their 2FA requires I confirm a login attempt on my desktop system using their app on my phone). There are entries for these accounts in my password manager, just in case I decide to buy a new phone.",
            "title_similarity": "0.6465552"
        },
        {
            "id": "i16uhdx",
            "score": 1,
            "text": "Same as why hotels have a security room with a master key that opens a locker for other unique room keys. All you have to secure is your security room and the master key which is with you at all times. And since all rooms have unique keys, no one can use it to open any other rooms.",
            "title_similarity": "0.6625862"
        },
        {
            "id": "i16vcqy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.030960439"
        },
        {
            "id": "i16xaj5",
            "score": 1,
            "text": "Because of observed practices.  If you look at the average person, they will try to use \"Password\" or \"Password1\" and \"Bestfriend'sname\" or \"Wife'sbirthday\".\n\nMost people also reuse passwords, so that they only need to remember one or 2 passwords.\n\nTogether, the average person will have a simple or generic password used across several platforms, which will increase the chance of being discovered and also be used in several areas.\n\nPassword managers are not more secure than proper security, but are more secure than what actually happens.  Now, you only NEED to remember 1 password, but it cant be generic.\n\nYes, you took all those separate keys, and made a master key,  If you get hacked, your stuff is gone.  However, if netflix gets hacked,  your bank isn't also hacked, because your password manager  weren't hacked.",
            "title_similarity": "0.75600815"
        },
        {
            "id": "i16zz2b",
            "score": 1,
            "text": "My pw manager is locked the f down. I log into other places with it that are not what so ever",
            "title_similarity": "0.45935535"
        },
        {
            "id": "i170t98",
            "score": 2,
            "text": "Attacking your home PC is relatively low value. All you get is one guy's password database.\n\nAttacking websites is far more valuable. You get everyone's password. Thousands of them. Usually with quite a lot of their personal information.\n\nA lot of people don't use a password manager, so they re-use passwords which means you get the one, then you can try it everywhere.",
            "title_similarity": "0.7596232"
        },
        {
            "id": "i171gm8",
            "score": 1,
            "text": "Password managers use a very good firewall that the company like Google runs, but doesn't save it to cloud service, it saves on your computer and comes with the search engine, so you basically get a firewall for free  with stuff like Google or  Firefox and such... real stuff.",
            "title_similarity": "0.69504726"
        },
        {
            "id": "i1760n8",
            "score": 1,
            "text": "The password manager I use is run locally. So they would need my computer, the password to my computer, and the password to the manager. \n\nBeyond that, I keep the database on a USB drive with a backup on my home server, so they would also need access to one of those.\n\nMaybe if you're leaving your shit open all the time with the same password you used on your email when you were 12, a password manager is the lease of your worries, but using a tool poorly doesn't make it a bad tool.",
            "title_similarity": "0.71690667"
        },
        {
            "id": "i18i7dw",
            "score": 1,
            "text": "People don’t hack your password, they guess your passwords. A single hard password is a billion times harder to guess than 500 dumb passwords.\n\nWhen you add a single character to your password you just multiplied the number of possibilities it could be by (at least) 256 (the number of available characters)",
            "title_similarity": "0.70802367"
        },
        {
            "id": "i19e2dh",
            "score": 1,
            "text": "I often think this about vpns. They are always advertised as a security feature.\n\nBut to me, centralising all my internet traffic through a single company for easy inspection is mental. Surely better to have multiple connections to interconnected networks (inter-net) and just use a combo of 4g/ public WiFi/broadband making it harder to track you. \n\nObviously all important traffic like banking / logged in services is end to end encrypted already with ssl.",
            "title_similarity": "0.7621075"
        },
        {
            "id": "i1azif7",
            "score": 1,
            "text": "To answer this I'll just explain my own setup with LastPass.\n\nMy master \"password\" is a full sentence that starts capitalized and includes punctuation. I do not use this password/sentence anywhere else.  But even if one somehow got a hold of the password, they would need the two factor authorization from the LastPass Authenticator App on my phone. So they would need to be able to get a hold of my phone itself. However, in order to get into my phone they would have to have my fingerprint. I will also have App Lock running which means they won't be able to open the Authenticator unless they have the unlock pattern for App Lock. And then the Authenticator itself has a four digit code.\n\nIn other words, for all intents and purposes it's impossible to get into my password manager.\n\nAll my other passwords are auto generated by LastPass and are always a minimum of 20 characters long, completely random using all letters numbers and symbols. Certain logins like my home router are 30 characters long.\n\nI trust this answers the question.",
            "title_similarity": "0.69979405"
        },
        {
            "id": "i1c2vnd",
            "score": 1,
            "text": "So in this case, a single point of entry is a good thing. It reduces your attack surface--the amount of things that can go wrong. You only have to protect and remember one password, rather than one for every site.",
            "title_similarity": "0.7397068"
        },
        {
            "id": "i1ce0nz",
            "score": 1,
            "text": "It's much easier to remember one single longer, secure password than it is to remember many of them. When you have to remember passwords for many different things, they either end up being very simple and easy to guess, or you start re-using them. Having one, secret, secure password is more secure than a practice like that.\n\nNow if you can remember a bunch of different secure passwords, then more power to you.\n\nIf you're especially paranoid about using a password manager, you could use a technique called peppering. This is where you choose a few extra characters that you remember that you add on to the end of the passwords generated by the manager when they're entered into the site, but not when saved in the manager. That way, if someone gets access to the manager they won't have the actual passwords without the \"pepper\" that only you know.",
            "title_similarity": "0.71153903"
        },
        {
            "id": "i1dzy60",
            "score": 1,
            "text": "You don’t have to store all your credentials in 1 password manager. You could store them in multiple password managers and use 2-factor authentication.",
            "title_similarity": "0.6902011"
        },
        {
            "id": "i36sim9",
            "score": 1,
            "text": "Another underrated benefit/pro is that these systems are built with security in mind. I trust my password manager to keep up to date and invest resources into it's security than I do Etsy or the tiny website I bought one thing from. I don't think it is as big a point of failure as others might think. Additionally, this means it is not an easy target for fraudsters who are looking for quick and easy means of getting a score. It could take them a lot of time and effort to even try to get into these places, let alone without getting caught. There are far easier targets out there for them to chase down, why spend so much time on these? Especially if the breach might be identified quickly and devalue the worth of score by a population of people who will change passwords quickly (this is assuming that people who use a password manager care about security and will act quickly in response to a breach, especially one that big).",
            "title_similarity": "0.75227946"
        },
        {
            "id": "i3hho48",
            "score": 1,
            "text": "Not if you have two. One for your passwords and one for the password to the other password manager. 😂",
            "title_similarity": "0.719987"
        },
        {
            "id": "i3ld65s",
            "score": 1,
            "text": "Most of the pros are valid points for regular people who might use weak, repeated passwords and have trouble remembering them.\n\nThe counterpoint is a person can certainly make secure unique passwords for difference sites. They can drive them with a nuanced pattern of their own. They can write them down somewhere with their own personal encryption.\n\nAll of that and not put every egg in one basket.",
            "title_similarity": "0.7814562"
        },
        {
            "id": "i4bgoqy",
            "score": 1,
            "text": "If you use password manager then \n\n* you end up having strong and unique passwords for every website\n* you data is being protected by a centralized provider who is good at what they do\n* Centralized provider may easily become a target for hackers but if your data is encrypted end to end and stored in a secure manner using AES-256 then any brute force attempt on decrypting data will be unsuccessful.\n\nSome of the reasons why your password manager (PM) may fail you:\n\n* your PM stores user keys or master password. If hacker manages to gain access to their centralized infrastructure then they will eventually get access to your decrypted data\n* your PM does not offer end to end encryption hence there are security gaps when data goes from transit to rest. \n* your PM owns your data / keys and if someday they restrict your access based on geography then you will loose access + data unless vpn works.\n* your PM requires you to login via email. If you loose access to email or second factor then you loose your data as well.\n\nBenefits of using a password manager (PM) are far greater then not using it. Web3 solutions offer more benefits then web2. The next generation of PM in web3 are decentralized and linked to non-custodial crypto wallets which offer the promise of data privacy, data ownership and decentralization. If you add zero knowledge encryption on top then it becomes a top notch option to protect and own your data. \"Not your keys Not your Data\"",
            "title_similarity": "0.8457043"
        },
        {
            "id": "i4ex9mm",
            "score": 1,
            "text": "Password managers have more security than Netflix for example. Also a lot of them use 2 factor from an unknown device. So if a random computer gets the right password it would text your phone or email you asking if this is you. A lot also generate random passwords for dif logins. Otherwise something could guess you weak password for Netflix and then run a bot that applies that weak password into thousands of common logins at once since folks reuse their passwords. It’s easier to try to crack Netflix and use that login to hack bank than actually hack the bank",
            "title_similarity": "0.7754538"
        },
        {
            "id": "i4xqn85",
            "score": 1,
            "text": "They ensure you use securely generated passwords. Most PW managers utilise Multi-factor authentication when login in on a new device, as well as a secret key that only you have access to.",
            "title_similarity": "0.8074475"
        }
    ]
}