{
    "ELI5: How do “hostile takeovers” work? Is there anything stopping Jeff Bezos from just buying everything?\n": [
        {
            "id": "i3j33fq",
            "score": 2,
            "text": "They use a trick called Cellar Boxing\n\nIt involves installing executives to help make bad company choices from the inside. Paired with bought and paid for media pressure to make it seem worse. Then a combination of naked shorting the company with Market Makers that are Hedgefunds, you can force the company’s stock into a penny stock to get it delisted.   \n\nThings to look up: \nToys R Us or Sears,\nCNBC and Jim Cramer,\nBoston Consultant Group or BGP,\nCitadel,\nAmazon",
            "title_similarity": "0.76970816"
        },
        {
            "id": "i3jhjfr",
            "score": 8,
            "text": "Many companies have gone bankrupt due to this.  Toys r us, circuit city, sears, k mart, etc. They also tried to takeover gamestop (previous  cfo and hiring BCG for consultanting). That is how this whole situation started. They tried to bankrupt gamestop and failed. Everyday gamestop remains open, the hedgefunds lose money. Through their influence in the media, BCG, and naked shorting, they cant shut down any company they want.. \n\nA part of this that ties in with op, is them (shorts/citadel) doing this in cahoots with Amazon to eliminate their competitors.  This has been the scenario in the market for the last 15-18 years. Amazon and been on a massive run ever since.",
            "title_similarity": "0.73171735"
        },
        {
            "id": "i3jo192",
            "score": 8,
            "text": "Jeff is already doing this through something called cellar boxing.  Jeff used to work at a short hedge fund and was very successful.  This is how he does it.  He finds a company that is a threat or is useful to his company.  He has his buds buy enough shares to have at least a 10% ownership in the company.  This will now give them a seat at the board or three.  The new board will slowly start replacing c suite management with folks that used to work for bigger hedge funds and market makers.  These new hires also hire very high dollar \"consulting firms\".  The new board, upper management, and consulting firm will all work together to milk every last cent out of the company.  All plans will be telegraphed to the hedge funds and market makers before big moves are announced.  This allows them to place a short positions against the stock.  The news released will bring the stock down.  The short positions will bring the stock down.   The hedge funds and brokers make money all the way down.  WHEN the companies stock goes to 0, those short positions never have to close. But get washed away.  The c suite management all takes hefty parachute severance packages and Jeff just got rid of a problem.   Their most recent targets were Sears, Radio Shack, and Toys R Us.\n\n\n\n\n\nWe are watching you Ken.  We are watching you Yassof.  We see you Point 72.  We know your game Jeff.  Your time is coming to an end.\n\n\n\n\n\n\n\n\nPower to the players",
            "title_similarity": "0.6053176"
        },
        {
            "id": "i3j1ggp",
            "score": 1,
            "text": "Musk just bought the ability to significantly influence the next presidential election, despite having used that platform more than once to arguably commit securities fraud.  Bezos bought the Washington Post with little to no resistance, which could have had a similar impact if newspapers were relevant anymore.  Murdoch, another billionare, already sets the agenda for much of what the american public hears as \"news\".  So no.  There aren't any real controls.   America is a plutocracy in practice.",
            "title_similarity": "0.71200794"
        },
        {
            "id": "i3jd5j3",
            "score": -1,
            "text": "Money, just because he's rich doesn't mean he can buy everything.... Wow do you really think he's got enough money to by everything?",
            "title_similarity": "0.6087675"
        },
        {
            "id": "i3iwvbk",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3k3t0n",
            "score": 0,
            "text": "Yes, running out of money. If everyone knows that Jeff is about to purchase everything, people will speculate on the next stocks he's about to buy, and therefore run up the price.",
            "title_similarity": "0.7223387"
        },
        {
            "id": "i3lajwl",
            "score": 0,
            "text": "Well you’re in for a treat, they’ve been doing this for years! A little known thing [called Bust Out Capital.](https://www.computerworld.com/article/2535189/opinion--bust-out-schemes-are-a-fraud-designed-to-make-you-go-bust.html) Bet you don’t know Jeff Bezos was a hedge fund manager before starting Amazon…\n\nTo didn’t think he became one of the wealthiest individuals ever by selling books did you?!\n\nI don’t want to get in trouble for cross posting so give reddit a search for:\n\nAmazon Bain Capital and Citadel Bust Out\n\nBet you also didn’t know amity Romney started Bain Capital and helped drive successful companies like Sears and Toys R Us out of business. Before you go on to say those businesses were failing please read up on how a not so public hostile takeover can happen when a company is looking for funding. These capital companies swoop in and appear to be a savior with their funding and helping with all the accounting and management. They acquire a certain number of shares for their investment with clauses stating they’ll get more shares if the business doesn’t do so well. The replace members on board with their own team. Slowly run the company into the ground with very subtle tactics like opening new locations under the guise of expanding but they’re actually bleeding the company from the inside. These insiders illegally leak information about how successful their next earnings are going to be and the stock price begins to rise. Sure enough the company starts to miss target goals. Capital company receives more shares while others buy up shares behind the scenes. All these people team up and pool their shares and take over the company. Then another one of their friends in a hedge fund starts shorting the company and more information is leaked in how the company is struggling. Stock price begins to plummet and the hedge funds racks in the dough. Once the company becomes almost worthless the original capital company magically has a clause in the contract you originally thought was ridiculous and 1:1,000,000 chance of happening with the new capital. Well that clause gives them control of the company, which they then shut down and sell off all the intellectual property. This IP might be a cure for cancer which is immediately hidden away as sick care pays way better than sick prevention. Or maybe you’re a competitor of Amazon and now your business is shutdown and Amazon doesn’t have a competitor and they didn’t need to buy out that company or merge, they just destroy the company grin the inside out and no one is the wiser. \n\nWant to see this happening in real time? Check out what Ryan Cohen is currently trying to fix with Bed Bath and Beyond ($BBBY) and has successfully removed all the bad eggs from the board and completely turned around GaneStop ($GME). There’s a reason you don’t see this in the news or you see articles stating GameStop is failing. The hedge funds have been caught with their hands, arms, and entire head caught in the cookie jar and they are going to lose everything if only the public was more aware.",
            "title_similarity": "0.71810484"
        },
        {
            "id": "i3lt12x",
            "score": 0,
            "text": "Could we as retail investors short the nestle stock the same way they were trying to do AMC/GME and drive them out of business...is that possible?",
            "title_similarity": "0.75446427"
        },
        {
            "id": "i3mrh0z",
            "score": 0,
            "text": " start by calling everything racist,then air the resulting riots for entertainment.find ways to disarm the good guys so the bad guys arent hindered.",
            "title_similarity": "0.64524853"
        },
        {
            "id": "i3n5p6c",
            "score": 0,
            "text": "This is plain and simply a monopoly carefully made so they won't get it from their friends in the govt, they have done more damage to our society than we know, but, that will be evident shortly. You see, they want a communistic approach, buy everything from China in one place, and put out small businesses. They don't want to \"bother\" with small businesses when they have places like this, they should be disbanded, but money talks, and everyone seems to be a legal pro when it comes to this matter. It's a MONOPOLY done very cleverly to stay away from the red tape, but with help from Uncle Scam.",
            "title_similarity": "0.69177204"
        },
        {
            "id": "i3jn3as",
            "score": 62,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3ivbni",
            "score": 11,
            "text": "If you want to buy a business, you need to buy it from the current owner, much like buying anything, the seller needs to agree to the sale.\n\nIf a company has \"gone public\", its ownership has been split into shares, and sold on the stock market. Now the \"owner\" is several thousand different people, shareholders.\n\nYou can still buy this company, you don't need to negotiate with all the thousands of shareholders individually. You negotiate with \"the board\", a few people who represent the shareholders (usually the people who own most shares) then your offer gets voted on by the rest of the shareholders.\n\nYou'll need to offer a good price, more than the shareholders would make from not selling to you, otherwise they'll never agree to sell. \n\nWith a hostile takeover, instead of negotiating, you try to (sneakily, so nobody can see what you're doing until it's been done), buy more than half of the company's shares, as cheap as possible. Once you own 51% of the company, you have more than half of the votes, you effectively own the company without ever having agreed to buy it from the current owners.",
            "title_similarity": "0.6951525"
        },
        {
            "id": "i3ixend",
            "score": 1,
            "text": "$$$. He doesn't have enough of it.\n\nInitially Bezos tried to buy out companies for his Amazon Marketplace but found it too costly. So he went back to his buddies on Wall Street (Bezos at one time worked on Wall Street) and targeted naked short-selling attacks and leveraged buy-outs on the companies he wanted.\n\nNaked short selling is selling shares you don't own. Like counterfeiting $$$, this dilution of shares will flood the market and eventually drive the price of the shares down. Furthermore, the counterfeit shares are sold in Dark Pools so none of this money gets back to the rightful company. Bezos found it cheaper to buy up controlling shares in companies trading at $2 rather than $40+. Jon Stewart did a wonderful explanation of this scam in one of his most recent shows.\n\nLeveraged buy-outs are when your Wall Street buddies use the credit of the target company to finance the purchase of said target company. Think Blockbuster, Sears, ToysRUs are perfect examples of this. It's like buying a house. You come up with the initial downpayment and then use the house itself as collateral for the rest of the mortgage. Except it's hard for the target company to pay off this new exorbitant loan in addition to the increased fees paid to over-priced consultants and executives deliberately inserted into the target company to make the company fail. At which point, Bezos would then begin buying up pieces of the company very cheap or just take over their share of the market. YouTube has many videos that would better explain this scam.\n\nSo no ... Bezos doesn't have enough $$$ to just go out and buy whatever he wants. He needs to continue to lie, cheat and steal his way to even more $billions.",
            "title_similarity": "0.7020391"
        },
        {
            "id": "i3k1il3",
            "score": 1,
            "text": "So three companies really do this already. Black rock, vanguard, and UBS.  Together they own over $20 trillion worth of assets. Coke and Pepsi, owned by the same people.  Android and Apple, again same company. The issue of a takeover is a little more complex.  In order to “take over” you need to gain a majority ownership or at least get the other major owners on your side. A lot of companies work very hard to make sure controlling ownership never leaves the primary owners hands. If they don’t sell, there is no takeover. For some companies the claim on controlling ownership is not that strong. Maybe there were three owners who owned 51% and one was forced or persuaded to sell some of their ownership.  Or, the company isn’t financially stable and the aggressive buyer gives an offer to the shareholders that is too good pass up.  Hostile takeovers need a lot of thing in place to work and they need to make sense.  When you are aggressively buying shares in a company, the price per share goes up. It might not make sense to buy more shares of overpriced stock.",
            "title_similarity": "0.642539"
        },
        {
            "id": "i3kh2m0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3iu2t1",
            "score": 23,
            "text": "Hostile takeovers are essentially a person or company, or entity with a lot of money, coming in and just buying all the shares/stock that another company has. They only need 51% of shares in order to take over the company.\n\nShares/stock of a company is essentially you saying 'I own this much of the company and therefore my say is worth this much.'\n\nIt's considered hostile because it happens rapidly and it's not how a person wants to lose their company.",
            "title_similarity": "0.69737947"
        },
        {
            "id": "i3ixpfm",
            "score": -2,
            "text": ">Is there anything stopping Jeff Bezos from just buying everything?\n\nUnfortunately, big government is the only thing thst can stop oligarchs.\n\nAlso unfortunately, much of america is in support of Bezos and Musk and cite their agregious, economy-ruining wealth as being examples of the American dream.",
            "title_similarity": "0.74779546"
        },
        {
            "id": "i3jeg8n",
            "score": 2,
            "text": ">Is there anything stopping Jeff Bezos from just buying everything?\n\nI mean, he's disgustingly incomprehensibly rich, but he's not *that* rich. I'm sure he'd like to be. But his net worth being at $180 billion or so, while, say for example, Microsoft's market cap (total value of stock) is like $2 *trillion*. And that's just one company. \n\nLord knows his greed is infinite, but he's got a ways to go before he can just buy \"everything.\"",
            "title_similarity": "0.7115083"
        },
        {
            "id": "i3jfoz5",
            "score": -2,
            "text": "No, he could buy every house in the city you live in. Let them sit un occupied and watch housing prices rise due to high demand.",
            "title_similarity": "0.56144077"
        },
        {
            "id": "i3iuxyd",
            "score": -3,
            "text": "The government would stop a billionaire from simply buying everything, due to monopoly oversight. This would basically be enacted by some regulatory agency (the securities and exchange commission, for example) blocking the sale.",
            "title_similarity": "0.73650813"
        },
        {
            "id": "i3j59w5",
            "score": 2,
            "text": "I'm not a corporate law expert but here is what I remember from law school.  I could be making all of this up so talk to a real lawyer.\n\nA public company like Google, Amazon, and Apple is controlled by a Board of Directors.  They don't actually do anything though except give advice and choose the CEO, the leader of the company.  The CEO is the one with all the power and hires people, tells the company what to do, etc.\n \nThe directors that sit on the Board of Directors are chosen by an election (like an election for President or Mayor or whatever) where the voters are the shareholders, the people who own the stock of a company.  The corporation usually sends out ballots to the shareholders giving them options on who the corporation recommends for selection to the board.  \n\nIn a hostile takeover, an outside person or entity comes in and nominates a competing board member that is loyal to the outside person or entity, usually with plans to replace the CEO or other board members.  If they own a majority of the shares in the corporation, that outside person or entity can just do this by using those shares to vote for the competing board member.  If not, they can still try by sending out competing ballots and information telling the other shareholders of the hostile takeover attempt and asking them to join.\n\nThat's it.  There are ways to prevent this like having the Board of Directors not come up for election all at once.  There is also the \"poison pill\" method of defense (https://en.wikipedia.org/wiki/Shareholder_rights_plan)\n\nAnd Bezos couldn't \"buy\" everything in the sense that the market cap for most of the top companies are in the trillions.  He could do what Elon is doing now with Twitter though and exert considerable force on specific public companies by buying a lot of shares.  He has bought distressed assets before though, like in the Washington Post.",
            "title_similarity": "0.58664465"
        },
        {
            "id": "i3jxj7a",
            "score": 2,
            "text": "Other people have answered the question of how hostile takeovers work. But the second half of your question hasn’t been addressed as thoroughly.\n\nThe primary force that stops Bezos from doing hostile takeovers is his own self-interest. In particular, there is a concept known as “slippage” which is relevant here. When you are making a large trade on a financial market, you will typically find that only a small part of the trade is executed at the market price as of the moment you placed the trade, while much of the trade will be executed at a worse price.\n\nIf Bezos wished to take over a business worth $30 billion, you might think he would only need to pay a little more than $15 billion to acquire half the ownership of the company. But that’s not actually what would happen.\n\nOnce Bezos began the process of buying up shares in the company, the share price would immediately begin rising. This is because stock prices are governed (in the short term) by the laws of supply and demand. This means that Bezos would pay more money per share as he bought up more and more of the company. So he might end up paying $20 billion (or more) to acquire half the company when the market had previously determined that half the company was only worth $15 billion. Unless Bezos had a good reason to think the market was wrong or that his leadership could significantly improve the company’s prospects, he would probably not be interested in making this trade.\n\nTo make matters worse for Bezos, his wealth is mostly concentrated in Amazon stock. If he wanted to use $20 billion to do a hostile takeover, he would need to raise that money somehow. If he decided to sell shares of Amazon, he would be selling enough shares of Amazon that he would be lowering the share price. So he would be selling some of his shares at a discount. Furthermore, he would get hit with a 23.8% federal tax on the sale of his Amazon stock.\n\nThe same problem could arise if he used a loan with his Amazon stock as collateral. If the value of Amazon dropped to the point where Bezos’s creditors feared he would be unable to repay the loan, they could force him to sell off massive amounts of his Amazon holdings. He would then get hit with the same tax and slippage we discussed earlier. So taking out a loan to finance his business venture doesn’t get around that problem.\n\nFinally, as some others have mentioned, Bezos just isn’t that rich in the grand scheme of things. His net worth is around $200 billion. But the US stock market is worth around $49 trillion as of March 2021 (probably more today). So his net worth is only 0.4% that of the US stock market. It’s still a ludicrous amount of money, but not nearly enough for him to take over everything.",
            "title_similarity": "0.76400363"
        },
        {
            "id": "i3ivi8b",
            "score": 584,
            "text": "You're wildly overestimating Bezos' wealth, and wildly *under* estimating the value of \"everything.\"\n\nJeff Bezos is currently worth $189.2 billion, and the total net worth of the New York Stock Exchange (one of many stock exchanges in the world) is $26.1 trillion. True, Bezos would only need half that stock to control all the publicly traded companies (and most companies are not publicly traded).\n\nBut that still means that, even if Bezos was able to liquidate all his assets without them devaluing (unlikely), he would only be able to buy enough stocks to control **1.4%** of the companies on the NYSE.\n\nSo no, Bezos most definitely **cannot** \"buy everything.\" Not even close.",
            "title_similarity": "0.63478005"
        },
        {
            "id": "i3iwnqz",
            "score": 100,
            "text": "This is a really hard ELI5 lol. \n\nBut basically you have a lemonade stand. You decide you want to upgrade your lemonade stand so you sell a % of the ownership of the stand to your friends and families. Though you're a smart business person and you only sell each of 6 people 10% so that you have 40% control left over. You also write in the selling agreement that whoever owns the biggest % gets to make decisions, and everyone else can only make suggestions. \n\nYour neighbor wants to buy your lemonade stand but you decline, you love your lemonade stand and its yours. So instead he starts going to the other people who own 10% and pays 5 of them to accumulate 50% in his name alone. Now because he owns 50% he has the biggest % and he now gets to make the decisions.",
            "title_similarity": "0.57522464"
        },
        {
            "id": "i3j882e",
            "score": 21,
            "text": "Something I'm actually knowledgeable about! (But might not be ELI5)\n\nI'm a European competition law masters student. Competition law, or I think more commonly referred to as antitrust law in the US, has one simple goal in mind: To ensure a sufficient level of competition between corporations. With these laws, monopolies are broken apart, and a merger or acquisition of a company will be scrutinized to see whether it will diminish competition to a significant degree.\n\nSo for example, in the EU, if a company has above a certain market share, or has a turnover of a certain amount, it must register each acquisition or merger to the European Commission. DG COMP (Diectorate General Competition) then takes a look and sees whether this will be permitted or not, based on whether there will be a restriction of competition.\n\nCompetition law especially deals with cartels: Companies who come together to fix prices. But that's not part of your question so I won't get in there.\n\nRegardless, Jeff Bezos cannot just buy every competitor because of competition/antitrust laws.",
            "title_similarity": "0.689701"
        },
        {
            "id": "i3it1kv",
            "score": 1604,
            "text": "Hostile takeovers mean that somebody buys majority of stock in a company, which gives them the voting rights to fire current management and set up their own chosen CEO. A company is a democracy with owners voting for CEO and his team. \n\nMany companies have tricks to avoid hostile takeover, such as the \"poison pill\" clause that dilutes the stock if somebody tries to buy too much of it. \n\nBezos does not have enough wealth to buy everything, and he does not want to, since he does not believe that whatever he buys will earn more money than Amazon. \n\nMost of his wealthy is Amazon stock, so if he wants to buy something, he will have to sell or trade his Amazon stock, so he will trade Amazon's earnings from these stocks for earnings from whatever he buys. And he does believe that Amazon has a bright future with high earnings.",
            "title_similarity": "0.71716285"
        },
        {
            "id": "i3it39s",
            "score": 169,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3izli5",
            "score": 1523,
            "text": "The number one thing from stopping someone from \"buying everything\" or more accurately, buying whatever they want, is that the purchase price has to be justified. Sure Jeff Bezos could buy a company valued at one billion dollars, but now instead of owning Amazon stock with that one billion dollars, he now owns a company valued at one billion dollars. Is that company growing faster than Amazon? If not, tomorrow his Amazon stock would be worth more than the company he bought instead, so that's a pretty big reason to not just buy up everything you can.\n\nDoes it offer something to Amazon that will make them more value than one billion dollars? If so, then it becomes a target for acquisition by Amazon, not Jeff Bezos personally.\n\nFor example, let's go back in time before Amazon built their own distribution network from scratch. Say they wanted a distribution network to stop relying on UPS, FedEx and USPS for their deliveries (which they obviously did). They could have bought ships/trucks/planes/vans, hired drivers and pilots, built warehouses, hired packers and dockworkers, etc. (This is what they did). Or, alternatively, they could have purchased a distribution network that already existed worth an amount, let's say one billion again, with the understanding that with distributing for Amazon that company would immediately be worth more to Amazon than one billion dollars (say two billion a year later) and provide room for growth, without all the startup costs of starting a new company from scratch.\n\nSo let's say Jeff and Amazon find this company, let's call it \"Shipping Co.\" They meet with the board and offer to purchase the company for 1.1 billion, slightly above a fair market value. The company believes that due to recent changes in their market, they have opportunity to grow separate from Amazon, so they decline. Let's say 60% of their stockholders don't want to sell, so they vote No and don't sell.\n\nAmazon really wants to own Shipping Co. though. So instead of playing nicely, they buy up as much stock as they can on the open market. Maybe they buy 51% so they would control enough votes to force the sale through. Or maybe, since 40% of the stockholders voted to Sell, they only buy 30% of the company. Now, maybe the other 70% is still split 60-40, but Amazon owns 30%, so they join with the yes votes and now it's a majority. Or maybe they buy little or no stock, and spend a bunch of money trying to convince enough stockholders to switch sides and install a board that will approve the sale. The company is sold to Amazon despite its original stockholders not wanting to sell (a hostile takeover).\n\nThere are several things that a company can do to prevent this, such as stock buybacks, not allowing more than 49% of it's stock to be traded publicly, bonus votes for certain classes of stock, poison pill clauses, supermajority voting requirements, selling or spinning off valuable assets to reduce value to the purchaser, \"golden parachute\" bonuses paid to executives in the event of acquisition to increase the purchase price, etc.\n\nSo because you have to have a reason to purchase a company more than \"because I can\" and there are plenty of ways a company can prevent hostile takeovers, they're not as common as you might think, and much less common than they were a few decades ago before companies got better at preventing them.",
            "title_similarity": "0.73898387"
        },
        {
            "id": "i3it2ik",
            "score": 11950,
            "text": "Normally, when one company wants to buy another, management approaches the target and they begin discussions. If the target does not want to sell for whatever reason, they can tell the acquirer to go pound sand. If the acquirer really wants to, they can do a hostile takeover if the target is publicly traded and get the financial backing in place and go to the public markets and just start buying large blocks of stock. Once they own enough, they can get a board seat and influence the target or just keep buying and force them to give in.",
            "title_similarity": "0.7578665"
        },
        {
            "id": "i3iwawl",
            "score": 1,
            "text": "Most companies hold votes to their share holders, you can think of it like 1 share = 1 vote. So if you hold >50% of the shares in a company, you can determine the outcome of any vote you want. In practice, if you own \\~30% of a company for example, you would need 71% of the remaining votes to vote against you, which isn't likely to happen. \n\nIf you hold enough shares you can force your way onto the board, and from there force your way to being CEO, and then do basically whatever you want with the company. (As a majority share holder, member of the board, and CEO, you hold a lot of power)\n\nIt's also possible to just run the business into the ground, which happens sometimes, like with competitors. An even more common practice is to just absorb the subsidiary, remove their branding and adopt all its employees. From there you can do layoffs, and let the product run it's natural course with minimal funding, essentially eating up whatever revenue was left in that product.",
            "title_similarity": "0.504953"
        },
        {
            "id": "i3iwbfb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3iwe2i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3iwmih",
            "score": 1,
            "text": "Companies are either public or private; a public company sells a “share” of the ownership. When a person buys a share, they are able to vote at shareholder meetings for the Board of Directors (or they can sell their share). \n\nThe Board of Directors appoint the CEO and other important officers, and they make decisions on matters like mergers, acquisitions, etc. \n\nThus, if you own 51% of a company, you can decide who is on the Board of Directors, you can decide what the company does. This is a hostile takeover. So, Bezos could buy a shit ton of stock, but then the price would go up; or, usually what happens, when someone buys a certain percent of stocks, an automatic stock split happens. This wards off corporate raiders for the most part.",
            "title_similarity": "0.663403"
        },
        {
            "id": "i3ixd75",
            "score": 1,
            "text": "There are often mechanisms in place at the company to prevent this, it is referred to as a poison pill. Something that can be used to make the company less attractive to hostile takeovers.\n\n(https://www.investopedia.com/terms/p/poisonpill.asp)",
            "title_similarity": "0.6814016"
        },
        {
            "id": "i3ixuss",
            "score": 1,
            "text": "A hostile takeover is pretty simple, actually: you read the company charter, determine the number of shares you'd need to own in order to gain a controlling vote on the company's board of directors, and you, in effect, own the company, or enough of the company to start dictating decisions.\n\nWhat stops Jeff from buying everything? Well, when you start buying shares of a company, if it's a healthy company with strong cashflow, you're going to quickly discover other people who want to make you pay top dollar for your shares. And where is that money coming from? Well, Jeff will either have to borrow money, or liquidate his stake in AMZN and/or his other businesses to buy this new, arguably undervalued business. There's also regulations which govern when and how officers of publicly-traded companies are permitted to sell their shares in the companies they manage, but the bigger problem is, \"How does this trade make money?\", which is the same problem affecting every single investor, regardless of whether you have $200 or $200 billion.",
            "title_similarity": "0.7510141"
        },
        {
            "id": "i3iydvl",
            "score": 1,
            "text": "Cadbury's is a great example of a hostile takeover by Kraft. Kraft went to the company with a price. Cadbury's said no thanks. Kraft went to the shareholders and offered them a price they couldn't refuse.",
            "title_similarity": "0.7310438"
        },
        {
            "id": "i3iz5t7",
            "score": 1,
            "text": "If he \"wanted\" (which some would argue he actually does) he can set up different entities (companies) in jurisdictions that allow anonymous owners and use companies to \"own\" a shit ton of shares of any one company and have shareholder rights that can move the company in any direction they want.",
            "title_similarity": "0.65391886"
        },
        {
            "id": "i3iz95g",
            "score": 1,
            "text": "Jeff Bezos has a lot of money to you, and me. But in the grand scheme of things, he can't really go out and buy very much that would affect us.\n\nFor example, let's say Jeff Bezos wants to get into electric cars, and he sells everything he owns to buy Tesla. He won't even own 1/6 of Tesla...",
            "title_similarity": "0.6907992"
        },
        {
            "id": "i3j1frr",
            "score": 1,
            "text": "There are different levels of shares. Voting shares tend to be more closely held - something to keep in mind when thinking about these situations. \n\nInterestingly enough, for a long time public  corporations were very afraid of keeping a lot of cash for fear of being targeted by corporate raiders.",
            "title_similarity": "0.61809635"
        },
        {
            "id": "i3j2yjd",
            "score": 7,
            "text": "I study Industrial Economics, this is the first ELI5 I'm somewhat qualified to comment on.\n\nAnyone can buy shares in publicly traded companies. Shareholders vote on what happens to the company they own. If a single shareholder owns the majority of the shares, they effectively have control of the company. \n\nA hostile takeover can happen when a person (though normally another company) pays a lot of money to buy enough shares of the company to have a controlling stake. \n\nIn a purely free market economy, a wealthy person (or firm) such as Jeff Bezos could just buy out all their competitors and merge them into one mega-corporation and form a monopoly. \n\nThis has happened in the past. You may have heard of Rockefeller's Standard Oil monopoly. BP, Chevron, ExxonMobile, and others all used to be part of Standard Oil, of which Rockerfeller was a major shareholder. Rockerfeller was extraordinarily wealthy. \n\nStandard Oil was broken up because it was deemed 'anti-competitive'. \n\nEven if Jeff Bezos had the money to buy eBay, Microsoft, and Netflix, he shouldn't be able to because it would reduce the amount of competition in those markets. In the UK we have the Competition and Markets Authority who investigate such mergers. Recently they blocked Nvidia (who design graphics cards) from taking over ARM (who also designs chips, they are important for mobile devices such as iPhone) because that reduce the already limited competition in the semiconductor industry. With how much it costs the investment banks to sort something like that out, it ended up costing Nvidia over $1 Billion and they walked away empty handed because of the CMA. \n\n&#x200B;\n\nI can go into much more detail if people are interested. \n\n&#x200B;\n\nBut TL:DR / ELI5, the answer is yes. There are many things stopping someone such as Jeff Bezos from taking over the world. No amount of money will allow him to do that, unless the competition authorities are corrupt. Competition authorities are focused on making sure there is healthy competition within every industry. They may allow people to become obscenely wealthy, but if Google or Amazon start getting lazy or greedy (many would argue they already are), they could face large fines.",
            "title_similarity": "0.6606636"
        },
        {
            "id": "i3j3oip",
            "score": 1,
            "text": "Companies break up their ownership into pieces. Think of it like a pie. If a company wanted to raise money, they’ll sell pieces of that pie to the general public. If there are ten pieces to that pie, everybody who buys a pie has an ownership in that company. Usually no one person has more than half of all the pieces (5 piece). So everybody who has a piece of the pie gets to vote on the group of people who will select the leadership of the company. That group is called the board of directors. Usually everything goes smoothly, with people who own pieces of the pie keeping them, and sometimes selling the pieces to others. \n\nA benefit of holding the piece of pie is that the company might give a dividend, which is like some of the profits the company earn. Think of that like a cherry on top. \n\nSo if you own enough of the pie, you have enough votes to control the board of directors by voting for people who will do what you order. In our case, you need to have five or more pieces of our pie. When you do, you probably have enough control to decide who will run your company. \n\nSometimes, someone wants to buy a company or our pie. But the people who are running the company do not want to sell the company. So in that case, the people will go an just buy the pieces of pie from the people who currently own them. So they’ll need to buy the five pieces of pie and the they can chance the board of directors. The new board of directors can fire the current leaders and put in new ones willing to do the things the new owner of the pie pieces wants to do. That’s a hostile take over.\n\nCompanies are different sizes. Amazon, in this example is one of the biggest pies. Jeff Bezos owns maybe 10% of the pie. This ownership makes him worth $200 billion. But even though Amazon is a big pie and Bezos has a significant piece of the pie, when you look at all the other companies in the world, they are worth a lot more than the pie that Bezos owns. So if Bezo sold his pie pieces, he could buy a lot of pieces from other pies, but it’s not enough to run all the other companies.",
            "title_similarity": "0.564545"
        },
        {
            "id": "i3j67ry",
            "score": 2,
            "text": "A hostile takeover is not really “hostile”.  It is basically one that is uninvited by existing management.  \n\nHow does that work?\n\nFirst - you have to have a company whose ownership stock is bought and sold on an open stock exchange.   Companies can have different classes of stock with different voting and dividend rights.  Not all of the classes of stock are necessarily bought and sold on stock exchanges.  The existence of different classes of stock does affect the price of all the classes of stock.  \n\nHowever, let’s assume that you want to take over a company that is a corporation whose only class of stock is traded on a public stock exchange like the New York Stock Exchange.   You could contact the company and let them know you would like to buy all, or a majority interest in the company.  \n\nThis “friendly”",
            "title_similarity": "0.70192426"
        },
        {
            "id": "i3j6p6b",
            "score": 3,
            "text": "I don't see any answer addressing leverage buyouts, which somewhat provides Jeff bezos with the mechanism of buying everything without having enough money to pay for everything. \n\nIt is possible to purchase a company with money that becomes debt on the company. You don't actually need the money yourself. This is what Romney's Bain Capital did to Toys r Us. They end up owning the company and the company ends up going bust. Why would that be a good thing to do?  Because once you are in charge you can pay yourself tons of money financed by whatever assets the company had and then push it further into debt and bankruptcy. Perfectly legal, of course, because they make the rules.",
            "title_similarity": "0.8022962"
        },
        {
            "id": "i3j725m",
            "score": 2,
            "text": "Can't buy companies that don't have public shares, since they can't buy the company shares they won't have the best of time getting power within the company to take it",
            "title_similarity": "0.6001968"
        },
        {
            "id": "i3j7mas",
            "score": 2,
            "text": "You are on the right track. Bezos could buy all of the shares of some existing company. Or at least enough shares to set the direction of the company. There are many potential obstacles, but nothing that would outright stop him.",
            "title_similarity": "0.6150972"
        },
        {
            "id": "i3j7uxs",
            "score": 1,
            "text": "How did Jobs lose control of and get kicked out of Apple (before coming back)? Did it have anything to do with this?",
            "title_similarity": "0.70769715"
        },
        {
            "id": "i3ja3jr",
            "score": 1,
            "text": "Most of Bezos's wealth is held in stock and not cash. If he wanted to buy enough stock in companies he wanted to take over on his own, without talking to mangers of the company and striking some sort of deal, he would have to sell his stock, converting his holding to cash, pay enormous sums in capital gains taxes, and then buy the shares. But there would also need to be enough shares available for him to purchase in order to take over the company. It could take some time. Could probably do it with a handful of smaller to mid cap companies, but not large cap. Not on his own.\n\nHe could use his stock as collateral for a low interest rate loan that he doesn't have to pay income taxes on and buy some small companies with the loan proceeds. This is how a lot of billionaires live and pay little to nothing in income tax. But he wouldn't be able to get enough money from loans to buy \"everything.\" Again, probably significant stakes in smaller cap companies, but not the big companies.",
            "title_similarity": "0.72373414"
        },
        {
            "id": "i3jbw3r",
            "score": 1,
            "text": "Bezos has almost no cash on a relative to his wealth basis. If he wanted to start taking over stuff he would need to sell his Amazon and buy whatever else he wants. He could easily buy all sorts of companies but not on an unlimited basis",
            "title_similarity": "0.6799749"
        },
        {
            "id": "i3jdas2",
            "score": 1,
            "text": "Public listed company that has 11 things:\n\n<Someone gives you money to look after 1 thing>\n\n\"Wow, thanks for the loot mister.\"\n\n<They give you money to look after 6 things in total so they look after just more than you>\n\n\"Woohoo, all these Dollarydoos. I think we should spend it on these sweets.\"\n\n\"Nah, I think we should get these sweets.\"\n\n<Big arguments happen that can take a lot of time to sort out, but one of you will win which will most likely be them because they look after more things unless you can give a convincing argument>\n\n<They give you money to look after 9 things in total>\n\n\"OMG, so much moolah! We should buy something cool.\"\n\n\"Nah, I look after so much I'm gonna do whatever I want and your opinion doesn't really matter so you can go do one.\"\n\n&nbsp;\n\nPrivate company that has 11 things:\n\n\"Hey, can I look after your things?\"\n\n\"No!\"\n\n\"I'll give you a cookie.\"\n\n\"What sort of cookie?\"\n\n\"An oatmeal and raisin cookie.\"\n\n\"Eww, wtf, barf, no!!!\"\n\n\"D'oh!\"\n\n--- FIN ---",
            "title_similarity": "0.63351893"
        },
        {
            "id": "i3je0kd",
            "score": 1,
            "text": "Bezos model is if you won't/can't do it for his price, he just starts his own service doing the same things cheaper until the competition is out of business, or the customer just finds his service to have more value and/or convenience. \n\nBasically, if he could do it cheaper, why would he buy a business that's obsolete?",
            "title_similarity": "0.6724131"
        },
        {
            "id": "i3jeybq",
            "score": 2,
            "text": "A lot of countries have government departments whose sole responsibility is making sure shit like that can't happen. The extent to which this is enforced varies by country and other factors. For example, there have been several company mergers blocked in my country (New Zealand) even though the senior leaders of both companies wanted it to happen, because it was deemed to be anti-competitive, i.e., the merged company would become impossible to compete with and customers would have less choice if they were forced to deal with one large mega corporation. I imagine similar laws and regulations exist throughout the world.",
            "title_similarity": "0.6650914"
        },
        {
            "id": "i3jezam",
            "score": 1,
            "text": "I dunno but they did it on empire and it was the entire board plus other investors that went to take out Lucius",
            "title_similarity": "0.56144005"
        },
        {
            "id": "i3jfoob",
            "score": 1,
            "text": "There are ways that a company can defend itself from a take over one being [Poison Pill](https://www.investopedia.com/terms/p/poisonpill.asp)\n\nPoison pills allow existing shareholders the right to purchase additional shares at a discount, effectively diluting the ownership interest of a new, hostile party.",
            "title_similarity": "0.75871694"
        },
        {
            "id": "i3jj7sq",
            "score": 1,
            "text": "In order to buy things, you need someone willing to sell those things. You can't force people to sell you their stuff for whatever price you want.",
            "title_similarity": "0.610986"
        },
        {
            "id": "i3jjj07",
            "score": 1,
            "text": "I've seen some good descriptions of how hostile takeovers work, but not too much about what could stop Bezos or Amazon buying everything. In addition to what specific companies might put in place to prevent hostile takeovers, there are legal protections for a certain amount. \n\nEven a merger where both companies want to merge can require FTC approval if it comes too close to becoming a monopoly. Also, if a situation does arise where a company has created a monopoly, they may end up being broken apart by the Department of Justice.",
            "title_similarity": "0.74927974"
        },
        {
            "id": "i3jl4j8",
            "score": 1,
            "text": "Antitrust laws! One entity cannot own a monopoly of the competition over any given industry. Although, there's nothing stopping Amazon from going into every single industry and becoming the biggest thing through money if they wanted to. If anything it seems like they are trying to do that between Amazon game studios, Amazon prime streaming having originals, and their fully automated brick and mortar stores.",
            "title_similarity": "0.68202233"
        },
        {
            "id": "i3jlgoy",
            "score": 1,
            "text": "Its all about stocks. \n\nLets say a company issues 100 stocks (normally its millions but lets keep it simple). Each stock represents 1% ownership in the company.At a board meeting each stock gets a vote as well. \n\nIf one person owns all 100 stocks they own the entire company and can do whatever they want with it. If that person wants to raise some money for a project they can sell those stocks to other people who think the company has a good future. Lets say he sells 30 stocks, he still owns  70% of the company and the 30% that he doesn't is spreed among several people so they can't rock the boat to much. \n \nIf you own more than 50% of the stock in a company you own the company and no one can really do anything about it. The board has some control but ultimatly you are in charge. \n\nHowever most companys issues more than 50% of the stock in order to raise funds and only keep 30% to 40% in the ownership of the company itself. Thats more than enough though because the rest of the ownership is spreed out over hundred if not thousands of different people. \n\nA hostile takeover is when someone tries to get enough stock that they own more of it than the company itself. its hard to do but its possible, if they can get more shares than the company itself holds then they can control the company.",
            "title_similarity": "0.49840724"
        },
        {
            "id": "i3jlqlp",
            "score": 1,
            "text": "The OP’s original premise is flawed, just because Bezos is the “richest” doesn’t mean his gross wealth is anywhere near large enough to “buy everything.”\n\nTotal US market cap at end of 2021 was around $28 trillion, Bezos total worth is only $1.89 billion, just a tiny fraction of “everything”. Heck, Bezos couldn’t even buy just Apple. \n\nRough numbers from a quick google search, don’t hold my feet to the fire on them.",
            "title_similarity": "0.6489528"
        },
        {
            "id": "i3jm832",
            "score": 1,
            "text": "The main two things stopping Jeff Bezos from buying everything are:  one, that not everything is for sale; and, two, that he doesn't have the cash.\n\nMostly what he has is shares of Amazon.  He can liquidate those to raise cash, or trade them for shares of another company, but the problem is that any rapid movement on his part when it comes to dumping shares in large numbers both sets of lots of red alerts and alarm bells, and also would cause a panic on Amazon shares, causing the value to immediately drop which would cripple Bezos' ability to continue to buy things.\n\nSo ironically Jeff Bezos gets to remain a multi-billionaire only so long as he doesn't try to actually spend his multiple billions.",
            "title_similarity": "0.7062647"
        },
        {
            "id": "i3jnqz3",
            "score": 1,
            "text": "Bezos isn't that rich, his wealth wouldn't buy even 1 company in the top 50 companies by market cap list\n\nhttps://companiesmarketcap.com/\n\nIt'd take 15 people as rich as Bezos to buy Apple and that's only 1 company.",
            "title_similarity": "0.5126916"
        },
        {
            "id": "i3jnrit",
            "score": 1,
            "text": "Q: What stops Jeff Bezos from taking over everything?\nA: Elon Musk",
            "title_similarity": "0.77204204"
        },
        {
            "id": "i3jo19m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3jovtk",
            "score": 1,
            "text": "I'd just like to add that this doesn't look like a hostile takeover but rather an effort by Musk to position himself as an \"activist investor\" and launch lawsuits against the company for minority shareholder oppression (which may be called something else in the States). This basically means that he can sue Twitter on the grounds that their moderation policies are hurting the bottom line and, therefore, his significant ownership stake in the company.\n\nBut it seems like it's all for lulz because I can't think of any profitable platforms in social media that aren't heavily moderated. Looking at the consistent failure of \"free speech\" alternative social media platforms to gain meaningful market share (and ad revenue) I don't see how he could be successful. Facebook may be hemorrhaging users but I don't get the sense that it's Trumpist memelords who are leaving- they're not particularly tech savvy and I don't believe they have it in them to learn a whole new UI.",
            "title_similarity": "0.74649584"
        },
        {
            "id": "i3jsidq",
            "score": 1,
            "text": "Publicly traded companies are owned, in majority, by \"anonymous\" and vastly numerous share holders. I say anonymous, because they're not truly anonymous. But there's so many different holders who can be using various companies or names to hold shares that it's effectively anonymous unless you know who to go looking for. \n\nSo a hostile takeover is when a party buys so many shares of a company that they now effectively control it. Obviously an easy way to prevent this is for the original owner to retain 51% of the company. But that's leaving a LOT of investment capital on the table, and any board of directors would quickly push for the owner to liquidate a good amount of shares. Jeff Bezos, for example, only owns 10% of amazon. 90% is owned by other people. Now if another company were to buy out 51% through various holdings or persuading other major share holders to vote in the favor of the group taking over, you can effectively oust the owner from their own company.",
            "title_similarity": "0.69670486"
        },
        {
            "id": "i3jsij6",
            "score": 1,
            "text": "I can't explain it like 5 yo. But my favorite real world example is Anheuser-Busch being taken over by InBev. \n\nSuch a good story!! Filled with back stabbing, rich coked out CEO's killing their mistress's (allegedly), Warren Buffett, Belgians, Shamu & Sea World, South Americans, and of course corrupt politicians!",
            "title_similarity": "0.6067265"
        },
        {
            "id": "i3jtlvu",
            "score": 1,
            "text": "What you are looking for is called a 'poison pill' - this boils down to making it less attractive (basically more expensive) with the aim of discouraging the acquiring company. Most of the time it is done by providing a means for shareholders to purchase discounted shares, which dilutes the acquiring company's ownership.",
            "title_similarity": "0.7117181"
        },
        {
            "id": "i3jw1ly",
            "score": 1,
            "text": "What I do is ask really really nicely.  \nCan I buy your company?  \nPlease?  \nOh come on! Why not?  \nYou're mean!",
            "title_similarity": "0.7196521"
        },
        {
            "id": "i3jwi2i",
            "score": 1,
            "text": "In order to buy a thing, someone has to be willing to sell it.\n\nIf the current owner doesn’t want to sell, you can’t buy it.\n\nThat said, if it’s a publicly traded company, and someone buys up the majority of the stock, they can force the minority owners to sell.",
            "title_similarity": "0.73775554"
        },
        {
            "id": "i3jwtdr",
            "score": 1,
            "text": "Yes. Somebody has to be willing to sell it.\n  Now I’m adding extra words because the robot deleted my comment last time I posted that, saying it wasn’t really in the spirit of things. But actually it is, it’s the truth of capitalism, you weren’t just taking shit and giving them money because you chose to, you both have to agree to a transaction. If you on musk goes around buying everything, the price of all the things that he wants to buy are going to go up. His money will become worth less. Now is that really an explanation you want to give to a five year old?",
            "title_similarity": "0.78851974"
        },
        {
            "id": "i3jxnmi",
            "score": 1,
            "text": "Nothing stops this behavior from a legal perspective for the most part. However, if you want buy a public company right away (i.e. within a year) and if that information get's out the cost to buy enough of the company usually will cost 2x -3x the current price since shareholders will be far less likely to sell. \n\nThus hostile takeovers typically occur on downtrodden companies that have failed to meet expectation for several years and the share price is significantly down.",
            "title_similarity": "0.60268795"
        },
        {
            "id": "i3jxyel",
            "score": 1,
            "text": "Bezos can't buy everything because despite being so rich he doesn't have tons of cash on hand because he wealth is tied up in assets",
            "title_similarity": "0.5307319"
        },
        {
            "id": "i3jy1jh",
            "score": 1,
            "text": "Jeff Bezos does not want to buy it?",
            "title_similarity": "0.5312834"
        },
        {
            "id": "i3jy29p",
            "score": 1,
            "text": "Bezos is totally evil. I am a Elon Musk cultists and cannot wait until he makes the trillion mark.",
            "title_similarity": "0.59465"
        },
        {
            "id": "i3k0lfe",
            "score": 1,
            "text": "For starters Jeff Bezos doesn't have the kind of purchasing power most believe. His vast wealth is in the form of Amazon stocks that he would have to sell to get cash. It took Bill Gates decades to turn his Microsoft billions into real liquid money. If Bezos tried to dump all his Amazon stock he would wind up threatening to stability of Amazon and destroy the stock price, so he's rich but not that rich. At least for now.",
            "title_similarity": "0.66794825"
        },
        {
            "id": "i3k0lnh",
            "score": 1,
            "text": "> Is there anything stopping Jeff Bezos from just buying everything?\n\nBezos owns like, 200 billion in stock. Even if he sold it all and managed to get 200 billion dollars cash, the cost of just the US stock market, that's publicly traded companies only, is $30 trillion or 150x more money than Bezos could conceivably get. Not to mention the more of a company's stock gets bought the higher the price goes.",
            "title_similarity": "0.5538482"
        },
        {
            "id": "i3k1ddt",
            "score": 1,
            "text": "Read Barbarians at the Gates to find out to do a hostile takeover with none of your own money!",
            "title_similarity": "0.6759932"
        },
        {
            "id": "i3k1vxu",
            "score": 1,
            "text": "A hostile takeover is when an outside investor tries to buy a controlling portion of a company, usually more than 50% against the wishes of the current management and/or board. This is usually done with borrowed funds and done in order to liquidate the company in question as their assets are worth more than the continuing operations.",
            "title_similarity": "0.6778487"
        },
        {
            "id": "i3k200m",
            "score": 1,
            "text": "Most of Bezos’ wealth is not in the form of money sitting in a bank account. It’s tied up in assets like shares of Amazon stock. He could buy a lot if he sold all of his Amazon stock but he would be giving up ownership of the company.",
            "title_similarity": "0.61635435"
        },
        {
            "id": "i3k28yo",
            "score": 1,
            "text": "Typically they cause a dip in the price first.\n\nEither through news or if they're competing.. then by take customers. Stock tanks. Company buys up makority share.\n\nEtc",
            "title_similarity": "0.63550365"
        },
        {
            "id": "i3k2jsk",
            "score": 1,
            "text": "A hostile takeover is simply a situation in which an investor attempts to take control of a company without the board’s consent, such as by buying up a majority of the company’s voting stock and appointing its own directors to the board.  The existing board of directors might attempt to remain in power through various defensive tactics, such as a “poison pill.”\n\nJeff Bezos could attempt to buy as much stock in other companies as he wants, but 1) he would have to find willing sellers of stock; and 2) he doesn’t have anywhere near enough money to buy “everything.”",
            "title_similarity": "0.80074"
        },
        {
            "id": "i3k3f0z",
            "score": 1,
            "text": "In addition to what was mentioned, sometimes it's not up to the company's leadership whether or not to accept a buyout offer. A board's job is to act in the interest of the owners (shareholders). So if a company's share prices would likely rise due to a buyout, then they are somewhat obligated to take that seriously and go along with it, or risk a lawsuit filed by shareholders.",
            "title_similarity": "0.6545832"
        },
        {
            "id": "i3k4xm2",
            "score": 1,
            "text": "Private companies can also be bullied into selling if a wealthier more powerful entity uses it's resources to make their business extremely difficult to run and earn money.",
            "title_similarity": "0.66488004"
        },
        {
            "id": "i3k4yq2",
            "score": 1,
            "text": "Well, unfettered capitalism sort of implies go hard until you’re a monopoly. But then that’s where capitalism breaks down and someone wins but we all lose. They say monopolies are bad but that’s the goal of capitalism. How do they make monopolies? Lots of ways. Here’s one:\n\nhttps://en.m.wikipedia.org/wiki/Death_spiral_financing",
            "title_similarity": "0.7289227"
        },
        {
            "id": "i3k4z98",
            "score": 1,
            "text": "What's stopping Bezos from buying everything? For one thing, he's cheap AF. Brother cud be a forever in history hero, blasting low wages & forcing the minimum wage up to 'living standards'. He could, like his ex-wife, give away millions upon millions doing surprising cash dumps for orphan disease treatments, bring environmentally friendly clean water to the continent of Africa any freaking thing but by actions, we know he does not. Jeff Bezos, he's way too cheap & selfish. I would be ashamed of myself if I were in his position.",
            "title_similarity": "0.61235124"
        },
        {
            "id": "i3k5z88",
            "score": 1,
            "text": "A lot of people are focusing on defining \"Hostile Takeovers\" but not a lot of people are talkung about the anti trust laws that do not allow for him tp own eveything without signifocant legal battles.",
            "title_similarity": "0.6815518"
        },
        {
            "id": "i3k89fy",
            "score": 1,
            "text": "Basically what Elon Musk just did to Twitter.\n\nHe bought a seat on the board by purchasing a large sum of shares with voting rights.\n\nNext he will \"vote people off the island\"\n\nAnd then there you have it. He now owns Twitter.",
            "title_similarity": "0.5944561"
        },
        {
            "id": "i3kacdv",
            "score": 1,
            "text": "From what I’ve learned from this post, the answer is time.\n\nIt would take too long for Jeff Bezos to buy everything, during which time other companies would have banded together in their own groups.",
            "title_similarity": "0.6790491"
        },
        {
            "id": "i3kapcc",
            "score": 7,
            "text": "Don't know if this is exactly what you're talking about since it isn't hostile but my dad has a story like this.\n\nMy dad ran a string of boys homes for years. Eventually there was too much work for him so he hired a partner. The business grew exponentially and they needed another so the guy my dad hired suggested someone. Years later they needed yet another and the two overruled my dad's suggestion for their own.\n\nThat's when the four banded together and got my dad fired from the business he started. Turns out they all went to the same Mormon church and had planned the takeover since my dad hired the first guy.\n\nThose four immediately turned the business over to the church which shut everything down, sent the kids back to their busted ass homes or put them in state facilities and sold the properties to the highest bidder. \n\nFuck Mormons and their shitty fucking scam religion.",
            "title_similarity": "0.5160579"
        },
        {
            "id": "i3kauf8",
            "score": 1,
            "text": "they stopped micheal jackson,shaq and jayz but yeah they haveone thing in common so i guess whats stopping him? wellif everyone sold everything then only bezos will make money",
            "title_similarity": "0.6948739"
        },
        {
            "id": "i3kdjsd",
            "score": 1,
            "text": "You can’t take over a company then have malicious intent, also Jeff bezos doesn’t have enough money to buy every thing and most of his money is in stocks so he doesn’t really have like 100+ billion to spend on stuff",
            "title_similarity": "0.5901598"
        },
        {
            "id": "i3key5q",
            "score": 1,
            "text": "\"Hostile takeover\" is a bit of a misnomer.\n\nIt only means that the management doesn't want the takeover.\n\nDuring a normal takeover you talk to the management and agree on a price. The management will then tell the shareholders, \"I think you should sell at this price.\" \n\nThe acquirer mostly can't force people to sell their shares. If the shareholders think it's too hostile they can always just turn down the offer. The exception is that when enough people have sold their shares and a few holdouts are asking for a ridiculously inflated price you can force them to sell at the price that everyone else sold at (or potentially less).\n\nThere are two common reasons a manager would fight a takeover. They may think the price is too low or they may just not want to loose their job as the head of the company.\n\nBut the acquirer can ignore the manager and go straight to the shareholders. That makes it \"hostile\".\n\nThere are some legal tricks that managers can play to make that hard to do.\n\nThe biggest thing stopping Jeff from buying everything is that he can't afford it. The total value of all publicly traded companies (~$93T) is way more than the ~$200B he has. Even if he \"only\" wanted a controlling stake in all of those companies he couldn't afford it.",
            "title_similarity": "0.7408642"
        },
        {
            "id": "i3kf8xk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3kko3a",
            "score": 1,
            "text": "They mostly don't anymore.  Once upon a time you could buy up a majority of shares in a company and start throwing out board members and executives.  These days the board has ways (eg. poison pills) to protect their jobs.",
            "title_similarity": "0.7035258"
        },
        {
            "id": "i3kkxx3",
            "score": 1,
            "text": "Some companies have in their charters to not allow someone to have more than a certain percentage of voting shares for the company. Also Jeff bezos doesn’t have the money to buy everything. He’d have to sell off all his ownership of Amazon to buy some other company.",
            "title_similarity": "0.6999435"
        },
        {
            "id": "i3klb9b",
            "score": 1,
            "text": "Companies can issue convertible securities that allow them to call(take/buy) them back and keep them. In other words, if they're scared of a hostile takeover, they buy back enough of the company to avoid the takeover.",
            "title_similarity": "0.71709085"
        },
        {
            "id": "i3knoor",
            "score": 1,
            "text": "He may have 200 billion net worth but that doesn't mean he actually has 200 billion dollars for whatever he's worth now and judging by the women he surrounds himself with he's just a couple more divorced away from bankruptcy lol",
            "title_similarity": "0.54376453"
        },
        {
            "id": "i3kod25",
            "score": 1,
            "text": "It gets more complicated with billionaires who own other companies; some acquisitions and mergers require approval so they don't overstep anti-trust laws.",
            "title_similarity": "0.69301796"
        },
        {
            "id": "i3kp94a",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3kq17s",
            "score": 1,
            "text": "Given Amazon’s massive footprint in several industries, it’s pretty tough for them to buy up competition. However there is nothing  preventing them from building said interest from the ground up, a la their delivery system. He could easily start a VERY big bank with what he has in the couch cushions.",
            "title_similarity": "0.66205555"
        },
        {
            "id": "i3kqgsf",
            "score": 1,
            "text": "bezos doesn't have enough money, also it's a huge risk to buy out the majority shares of a company and the ftc can simply say no(which they should do more often) to prevent monopoly.",
            "title_similarity": "0.67060703"
        },
        {
            "id": "i3kqjwz",
            "score": 1,
            "text": "Tax is a percentage. It grows along with the base.\n\nIf your gain now is $1k and you own $200. In 50 years, if it becomes $100,000 then your tax becomes $20,000.\n\nDeferral obviously has upsides, which is why people do I, but that tax obligation will never shrink to close to nothing.",
            "title_similarity": "0.43886128"
        },
        {
            "id": "i3kqsyn",
            "score": 1,
            "text": "Money. He doesn't have the money to buy everything. Is this a serious question?",
            "title_similarity": "0.52567434"
        },
        {
            "id": "i3ksryd",
            "score": 1,
            "text": "So maybe you didn't see but basically this is how Amazon has become successful. They host numerous products. They find the ones that sell the best. Then they offer to buy that one out at a subpar rate. If the producer refuses (rightly) Amazon copies the product and sells it for less until the original is out of business and then starts raising the price and/ or reducing quality.",
            "title_similarity": "0.71170616"
        },
        {
            "id": "i3kuoab",
            "score": 1,
            "text": "Jeff Bezos has shady folks who get hired on at companies for the sole purpose of making said company bankrupt. Like literally",
            "title_similarity": "0.6801831"
        },
        {
            "id": "i3kv3nm",
            "score": 1,
            "text": "This is a long thread so excuse me if this was brought up, but in the first couple minutes of reading I didn’t see anyone bring up the fact that the board HAS to act in the best interest of the shareholders (it’s a fiduciary duty), so if a competing firm is offering a buyout at premium (above the current market), the board is compelled to accept the offer.\n\nAt least that’s what my googling while watching succession taught me",
            "title_similarity": "0.66915524"
        },
        {
            "id": "i3kviov",
            "score": 1,
            "text": "Antitrust laws. Prevent companies from monopolizing the industry. But of course Jeff Bezos could just buy politicians and then get those laws overturned.",
            "title_similarity": "0.79520094"
        },
        {
            "id": "i3kwxvi",
            "score": 1,
            "text": "Let me explain to you how it actually works. Jeff Bezos doesn’t really do takeovers and doesn’t need to buy everything. When they want to get rid of a competitor, they simply place their own people on the board of directors of those said companies who then engage consultants like “BCG” to sabotage them. New Management takes on big salaries and bonuses while BCG provides bad advices that ultimately would ruin the growth of the company. Amazon would also work with hedge funds to short those companies to the ground where they cannot recover or raise capital anymore. Once this is done, Amazon can then take over that share of the market. This has been done multiple times in the past few years. Hedge funds make a ton of money shorting the stock ( most of the time with synthetic shares which they don’t have to buy back since the company is bankrupt) , those placed in management get big salaries and BCG gets a shit ton of money in consultant fees.\nThey just tried to do it with bed bath and beyond",
            "title_similarity": "0.74017113"
        },
        {
            "id": "i3kx7g9",
            "score": 1,
            "text": "With the latest news of Amazon creating their own 3D printers and blocking sales of any competitors this is what they want us to get used to.\n\nSoon enough some Congressman will have money taken out of his pocket (or his pocket by proxy) and they will probably try to stem or influence Amazon but it will continue to happen for the near future.",
            "title_similarity": "0.722605"
        },
        {
            "id": "i3kxz8y",
            "score": 1,
            "text": "As of today, Amazon is worth $1.67 trillion. So not only can Bezos not “buy everything”, but he owns only a small part of Amazon (whatever it is, I don’t know). If Jeff Bezos decided to sell everything he owned and put it into Amazon stock, he would still own a small portion of Amazon and literally nothing else in the entire world. So no, he can’t “buy everything”.",
            "title_similarity": "0.64671135"
        },
        {
            "id": "i3kyw9q",
            "score": 1,
            "text": "He wouldn’t need to buy a majority of stock, only needs enough for 51% of the total outstanding shares to vote his way. He may only need to buy 20-30% of the stock to do this. Then replace the board at the next shareholder meeting.",
            "title_similarity": "0.54374504"
        },
        {
            "id": "i3kzasp",
            "score": 1,
            "text": "Elon Musk began such \"hostile\" or not of Twitter, and all the desperate Musk gobblers are loving it",
            "title_similarity": "0.40895492"
        },
        {
            "id": "i3l3b67",
            "score": 1,
            "text": "To answer the second part of the question:  While Jeff Bezo's personal weath is extreme at $189b, it pales in comparison to that of the big investment firms.  For example, Goldman Sachs at \\~$1.5 *TRILLION* in assets (more than 10x Bezos')    \n\n\n&#x200B;\n\nWHile Jeff Bezo's is personally wealthy -",
            "title_similarity": "0.538416"
        },
        {
            "id": "i3l5iyn",
            "score": 1,
            "text": "It’s called the government. Thank them. They regulate people like him. But some people think that (take over) is ok to do",
            "title_similarity": "0.5362529"
        },
        {
            "id": "i3l5jza",
            "score": 1,
            "text": "\"What stops Jeff Bezos from just buying everything?\" \n\nA few things.\n\nFirst and foremost, rich people generally get that way because they make good investments.   Jeff Bezos knows how to make a tech company, but I doubt he'd know how to run a semiconductor manufacturer like Intel, or an aluminum manufacturer like Alcoa.  \n\nThus, him buying companies outside of his area of expertise makes no financial sense.  He'd be lighting thst money on fire.\n\nWITHIN his field of expertise, only regulators and costs stand in his way. \n\nA hostile takeover is usually significantly more expensive than an acquisition.  In the US, after someone owns 5% of a company, they have to file regulatory forms whenever they acquire more stock.   Thus, the public at-large can see what is happening.  People may hold more strongly onto their shares, knowing someone wants those shares.  This can cause share prices to skyrocket as the person taking over the company NEEDS those shares to complete the takeover.  Eventually, to reach the necessary 51% of stock, the share price could be 4-5× or even more what they'd have paid in a cooperative acquisition.\n\nIn other cases, such as Elon Musk's recent purchase of 9.2% of Twitter, the company may make concessions to avoid a hostile takeover.\n\nElon Musk could buy Twitter outright, but it'd probably cost him 25% of his net worth by the time he was done... Instead, he became the single largest shareholder (by a large margin) and struck a deal with Twitter.   They give him a seat on the Board of Directors, and in exchange, he agrees to never purchase more than 14.9% of the company for as long as he holds that seat.\n\nIn short, Musk gains the ability to heavily sway (but not outright *dictate*) the direction of Twitter, and Twitter doesn't have to swallow poison pills to avoid the takeover.\n\nA poison pill is a defensive strategy employed by firms that REALLY don't want to be taken over.   They're generally extraordinarily damaging to current shareholders, but substantially raise the costs of a hostile takeover.\n\nThey generally involve allowing company insiders to purchase new stock at a massive discount to the market price.  The upside is it means the acquirer has to buy significantly more shares of stock.   The downside is the current shareholders ALSO have to buy more shares of stock (albeit at discount) just to \"tread water\" in their position value.\n\nIn short, a company and its shareholders will always see a hostile takeover coming.   Either market forces or corporate management can make the costs a SUBSTANTIAL barrier to takeover, even for someone like Jeff Bezos.",
            "title_similarity": "0.6999202"
        },
        {
            "id": "i3l65aw",
            "score": 2,
            "text": "Hostile takeovers work by one party buying enough stock in a corp that they have the majority voting power. Bezos can't buy enough if the controlling interests refuse to give up their shares. In that case the most Bezos can own is 49%. As long as the current owners own 51% of the total shares, they retain control.\n\nIf Bezos really wanted to, he could spend money to do something that would somehow cause the share prices to drop, encouraging shareholders to sell, at which point he could buy up those shares until he has enough to gain a controlling interest.",
            "title_similarity": "0.7237305"
        },
        {
            "id": "i3l6msm",
            "score": 1,
            "text": "A lot of good answers but I want to be more direct on how they work. There are many ways too do a hostile takeover. You can buy shares in the open market, you can go to the targets shareholders and offer to buy their shares off them, you can proxy vote where you try to get existing shareholders to vote out current management. What stops bezos buying everything is he's not that rich. Yes he could buy a smaller company but companies have many strategies to defend against it. Eg a company worth 10 mill bezos could buy ye, but if the company does certain strategies (poison pill) it will push the price of each share up and in the end maybe it costs bezos 20 mill to buy out the company which at that point isn't worth the price. It's all about price to return, how much will it cost compared to how much do I get in return",
            "title_similarity": "0.7847992"
        },
        {
            "id": "i3l6rty",
            "score": 1,
            "text": "Shares (or stocks) in a company are literally that, a share of ownership. If you own one Apple share, you own a tiny fraction of a percentage of Apple. If you own a certain percentage of shares, you are eligible for a seat(s) on the board that controls the company and makes decisions. If you own more than 50% of the shares and therefore control the board, you can outvote the others.\n\nBut not all shares of a company are for sale. Some are held by people or entities connected to the current owners who would not sell no matter the price. Others may be held by Joe Public and might not want to sell for whatever reason.\n\nThat's the ELI5 version. In reality there's quite complex rules around purchasing large amounts of shares, certain requirements or restrictions on ownership levels, rights or not for board seats, there are different types of shares and not all have voting rights, rules around creating monopolies/anti-competition laws, etc etc",
            "title_similarity": "0.56651866"
        },
        {
            "id": "i3l7jxj",
            "score": 1,
            "text": "there is nothing to stop Bezos, certainly not laws.\n\nhe can buy any law he wants, so that it is anything he wants.",
            "title_similarity": "0.44383198"
        },
        {
            "id": "i3la7rl",
            "score": 2,
            "text": "Money.  Look at Elon Musk, it cost him 3 billion for 9% of twitter.  While these billionaires are really rich, they still don't have that kind of money to just buy up anything.",
            "title_similarity": "0.54433477"
        },
        {
            "id": "i3laa46",
            "score": 1,
            "text": "Along with what others have said there are also regulations in place that looks at things like is the deal creating a monopoly and if it is then they don't allow the deal to go forward.",
            "title_similarity": "0.627515"
        },
        {
            "id": "i3lasnb",
            "score": 1,
            "text": "Great example of an epic hostile takeover is how Warren Buffett acquired Berkshire Hathaway",
            "title_similarity": "0.6814055"
        },
        {
            "id": "i3lb27e",
            "score": 1,
            "text": "Would anyone mind sending some relevant subreddits or recommended materials for this information this way?",
            "title_similarity": "0.50250584"
        },
        {
            "id": "i3ld6up",
            "score": 1,
            "text": "There’s supposed to be the government and anti trust laws, but the government is MIA and looking out for itself these days… very few politicians left that believe in sticking to laws.",
            "title_similarity": "0.5534424"
        },
        {
            "id": "i3lf63h",
            "score": 1,
            "text": "In the US, the government actually has to approve the merger/purchase between two companies. In order to avoid a monopoly.",
            "title_similarity": "0.6817209"
        },
        {
            "id": "i3lgbct",
            "score": 1,
            "text": "I don’t know if there’s other comments on this but Bezos couldn’t just buy everything because there are anti-trust and competition laws to prevent it; acting in the interests of consumers. I don’t know what they are in the US but almost every country has them.\nSource: Was an investment banker for 10 years",
            "title_similarity": "0.67067033"
        },
        {
            "id": "i3lgicd",
            "score": 1,
            "text": "Well there are some anti thrust boards but I believe they got gutted at some point or at least focusing more on foreign investors.\nAlso they would not help much in gafa takeovers as they tend to not buy competitors but either completely new types of activity to diversify or new tech that is not yet a competitor but could have been years down the line.\n\nIn short there is no real counter power for corporate greed in a capitalist market.",
            "title_similarity": "0.7120588"
        },
        {
            "id": "i3lgv97",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17674524"
        },
        {
            "id": "i3lhfzq",
            "score": 1,
            "text": "Think of buying a Company like buying anything, a bicycle or a house.  If a bike is $200, you pay $200 for it from the store.  If a house is $500k, you pay $500k (often borrowing money from a bank, called a mortgage, to be able to pay the full amount).\n\nThe difference between buying a house and a Company is that you can buy only part of a Company.  You can't buy part of a house; you cannot say \"I will just buy the kitchen.\"  With a Company, you can buy only a part of it.  That is called stock.  The person who owns over half of those stock is now in charge.  It does not matter if there was a previous CEO or other managers.  If you own more that half (if you can afford it) you make the rules.  \n\nOften when you go to buy all or part of a Company, you want to make friends with the current CEO/Management so they keep running the place for you.  You might want to \"take over\" (own more than half of the Company), but it does not have to be hostile. You basically have the current management continue to work for you.  However, if you buy enough stock and are now in charge, you can kick them out, and do whatever you want to do.  That is a \"hostile\" takeover.\n\nRegarding Jeff Bezos, he does have a lot of money, and could buy a lot of companies that way.  He \"has the money\" to buy many things, but not everything.  Also, at some point governments would get involved and stop him from buying up too-too much.  I'm sure there are things he is already not buying because he knows he would not be allowed.  But that's still pretty rare.  He can buy plenty.",
            "title_similarity": "0.5555247"
        },
        {
            "id": "i3lhg48",
            "score": 1,
            "text": "Loooooved the fact that the post that appeared immediately below this for me was this!!  \n\n\nhttps://www.reddit.com/r/GTA/comments/txa1ft/weeeee/",
            "title_similarity": "0.41213387"
        },
        {
            "id": "i3lifze",
            "score": 1,
            "text": "Even in private companies, after a certain dollar value the US government has to approve these purchases. You get to the point where companies are too big to be acquired and the government would not approve the purchase.\n\nYou need to do all sorts of reports to prove that there's enough competition in the market to prevent one company from taking over everything.",
            "title_similarity": "0.7604557"
        },
        {
            "id": "i3liwo4",
            "score": 1,
            "text": "A good reason that hostile takeovers are hard is demonstrated in real estate redeployment:  \n\n\nIf you wanted to take a local center of 6 parcels and merge them to build a big replacement building, you have to acquire all 6. However, as soon as you get 2-3, the others will notice what you are doing. They can then reasonably demand more than the regular market price for their part, as it is far more valuable to you than the market. (Since you need all 6 to have any value at all).  \n\n\nThis 'holdout' problem is key in hostile takeovers. Not only do you have to acquire a large percentage of the company (which naturally drives the price up. The first share may be 10$ a share, but after you buy 50,000 the next shareholder may only be interested in selling if the price got to 40$), but those existing shareholders are incentivized to increase their selling price even higher because they know you need it.  \n\n\nWhich is all to say that buying 50% of a company is going to cost a \\*lot\\* more than 50% of their current market cap (since current market cap is based on the marginal price of buying a share).  \n\n\nThere are also other things that management can do to try to kill a hostile takeover. Once again, similar to real estate, if all the locals are trying to make it happen it is going to go a lot smoother than if you are trying to do it without telling anyone about it.",
            "title_similarity": "0.71652746"
        },
        {
            "id": "i3ljv02",
            "score": 1,
            "text": "Yes, the cost. Instead of paying actual money to buy everything, he can 'cellar box' the competition (Google Jim Dacosta letters to SEC for source) That's effectively a coordinated hostile strategy against a company where:\n\n- you get people on the board who will destroy the company from within. Think massive c-suite bonuses despite declining company performance\n- you get the media to bash the crap out of the company, giving it bad PR and trying to hammer its stock price\n- you get your internal moles to hire expensive consultants like BCG (that hospital in Sweden, anyone?) who charge insane amounts and give very bad advice very much on purpose\n- you get market makers like Citadel etc to artificially dilute share price by using 'exemptions' to create and flood the market with synthetic stock, while internalising buy orders through their dark pools (watch Jon Stewart for a good explanation of this)\n\nReal life example: Sears.\n\nBest of all, this costs nothing to you, and it ends with the competition six feet under. And why do all your buddies help you? C-suite moles got their fat bonuses issued to themselves, BCG got paid heaps, Ken Griffin minted money in synthetics, and Cramer got paid in social clicks. Everyone's happy.\n\nSo, why spend a single cent and use a hostile takeover? Jeff Bezos is a genius.",
            "title_similarity": "0.747125"
        },
        {
            "id": "i3lkg5t",
            "score": 1,
            "text": "I'm sorry what about musk? Even musk could do it. All I saw on Facebook was him buying Twitter outright and how he could just make it completely non existent",
            "title_similarity": "0.55560976"
        },
        {
            "id": "i3lln2c",
            "score": 1,
            "text": "In India recently Reliance Industries did hostile takeover of Future Retail Limited (FRL) under the nose of Amazon. FRL is a brick and mortar giant in India with over 1500 stores. FRL was almost bankrupt due to pandemic. Reliance Industires offered to buy FRL for 3.4 Billion USD. Reliance was set to became a behemot in retail sector if deal was uncontested. Reliance industries were also their suppliers. \n\nAmazon challenged it in CCI, later in Supreme Court of India when CCI gave decision in favour of Reliance Industries. Amazon is shareholder in FRL Group's other companies. It has dragged for two years.\n\nEarlier this year, Reliance industires worked with the landlords and cancelled the leases, then entered FRL owned supermarkets, shuffling the employes out, shoeing the notice and lease of stores. Later they re-hired FRL employees. In this way the did hostile takeover of almost 947 stores. It caught Amazon unaware. It took Amazon about a week to register a formal objection in Supreme Court of India. FRL upper management were themselves unaware of this and loged direct objections to Reliance Industries and now are trying to salvage their old deal.",
            "title_similarity": "0.65143263"
        },
        {
            "id": "i3ln4sz",
            "score": 1,
            "text": "Bezoa is rich but not that rich. The US government on the other hand...rich as fuck and can buy everything, but nobody hates on the government for having all that cash, noooo, redditors gotta hare the rich man",
            "title_similarity": "0.6370286"
        },
        {
            "id": "i3lne2n",
            "score": 1,
            "text": "You guys, go on r/superstonk and search for Amazon or Jeff Bezos. The amount of financial fuckery discovered is mind boggling. \nMost of the post are easy to understand for everyone who is going to hear that the first time.",
            "title_similarity": "0.63514704"
        },
        {
            "id": "i3loc32",
            "score": 1,
            "text": "I haven’t read in the comments yet that Twitter is set up so that you can not invest in more than 14% of the company.",
            "title_similarity": "0.5455169"
        },
        {
            "id": "i3locs7",
            "score": 1,
            "text": "No. Most of his wealth is in shares so he has to deal with legalities, other shareholders, board members etc. It's not just a 1 and a bunch of 0's after it",
            "title_similarity": "0.5327889"
        },
        {
            "id": "i3lolvn",
            "score": 2,
            "text": "We’re not sure what you mean by “hostile takeovers”. But if you’re asking if there is anything stopping Jeff Bezos from buying everything, the answer is yes, there is.\n\nThere are a few reasons why Jeff Bezos couldn’t just buy everything. First, there is the issue of money. Even though Jeff Bezos is the richest person in the world, he doesn’t have an infinite amount of money. At some point, he would run out of money if he tried to buy everything.\n\nSecond, there are laws that would prevent him from buying everything. For example, there are anti-trust laws that would prevent him from buying too many companies in the same industry.\n\nThird, there are practical considerations. It would be very difficult for Jeff Bezos to actually manage everything if he owned it all.\n\nSo, while it’s possible that Jeff Bezos could buy everything, it’s unlikely that he actually would.",
            "title_similarity": "0.77862704"
        },
        {
            "id": "i3lrs6r",
            "score": 2,
            "text": "I don’t think he has enough money to buy all the companies, Jeff Bezos is worth $189b, amazon is worth 1.669t. Even if he had 100% shares of Amazon and sold them, he couldn’t buy apple worth 2.856t and then he wouldn’t own Amazon. I could be wrong i just googled companies worth and Jef Bezo’s worth.",
            "title_similarity": "0.68784386"
        },
        {
            "id": "i3lrx6e",
            "score": 1,
            "text": "everything costs way more than what jeff has.\n\neven if he could perfectly liquidate his assets he could not buy half of NY city.\n\nand then he would no longer have his current assets.",
            "title_similarity": "0.6474135"
        },
        {
            "id": "i3lt8my",
            "score": 1,
            "text": "The others answers are right but also in legal terms, many countries (not the US) have a law against  Monopoles, in the UK it has allowed lots of supermarkets keeping prices low(er) than if owned by one place.",
            "title_similarity": "0.55926025"
        },
        {
            "id": "i3lte1l",
            "score": 1,
            "text": "You have a company. I want to buy it but you don't want to sell it. So I buy anyway. From the public shares, or private owners. I just need enough that it's mine now and I can do what I want.\n\nAs long as you don't want to sell, it's hostile. As soon as I have enough, I takeover.",
            "title_similarity": "0.71879196"
        },
        {
            "id": "i3lz06u",
            "score": 1,
            "text": "Publicly traded companies where the company itself does not hold majority share- if you have enough money you can just buy majority share and then effectively own the company without anyones consent. \n\nDoesn’t work for companies like Amazon, where the founder still holds more than 51% of the shares, because they can choose to not sell.",
            "title_similarity": "0.6520499"
        },
        {
            "id": "i3m08sb",
            "score": 1,
            "text": "Buy more than half the stock, you control the vote. You jettison the board of directors and out in your own since no one can put vote you, they jettison the CEO and so on.",
            "title_similarity": "0.6346289"
        },
        {
            "id": "i3m0qvp",
            "score": 1,
            "text": "Tbf Jeff bezos doesn't have a lot of liquid capital. At least relatively speaking. So HE probably couldn't buy too many companies. Amazon could, but depending on what it buys, there could be regulations on part of the state, in place, or even on part of the SEC.",
            "title_similarity": "0.5425668"
        },
        {
            "id": "i3m14os",
            "score": 1,
            "text": "Some, but not all of a company's shares are publicly traded. So in this example Bezos can buy a large portion of a company's public shares on the stock market, but he may not have enough to control the company. So to get enough shares to allow control of a company, Bezos in this example will have to convince private shareholders to sell their shares to him.",
            "title_similarity": "0.66728747"
        },
        {
            "id": "i3m2wev",
            "score": 1,
            "text": "If the acquirer really wants to, they can do a hostile takeover if the target is publicly traded and get the financial backing in place and go to the public markets and just start buying large blocks of stock. Once they own enough, they can get a board seat and influence the target or just keep buying and force them to give in.",
            "title_similarity": "0.76304173"
        },
        {
            "id": "i3m41q8",
            "score": 1,
            "text": "Bezos doesn't have enough money to buy everything. He can't even afford to buy full control of Amazon. The price you see stocks quoted at are what each share of the company costs. Often there are hundreds of millions or even billions of shares out there. \n\nBased on share price, Amazon is worth about $1.7T dollars. Bezos \"only\" has about $190B and most of that is already invested in Amazon",
            "title_similarity": "0.5664778"
        },
        {
            "id": "i3m4jmg",
            "score": 1,
            "text": "the word \"hostile\" is not fitting at all. if you're being **publicly** traded, you have become public property. there cannot be hostility involved, it's just a legal trade.\n\npeople use these negative connotations to make it look like the \"hostile\" takeover is something negative, something bad, and they are the victim.\n\nit's bullshit from greedy people.",
            "title_similarity": "0.712327"
        },
        {
            "id": "i3m4mzn",
            "score": 1,
            "text": "Why buy?  If you want to get into X, just get into X.   And the fact that only a few people, organizations can afford to enter a market is a huge problem. This is why inflation won't be fixed any time soon.  Elementary economics say if a market is charging too much, others can come into the market and undercut them.   But due to consolidation, there are only a handful of people who can enter a market.  \n\nAs an example. there are about 5 companies that produce over 80% of the meat in the US.   Meat prices are spiking, I hear that it is because there is a lack of processing centers.  We processed meat during the pandemic, we have been back to work for 8 months now.  Why is there no more processing?  To me it is obviously because companies are making record profits without spending more money on plants.  \n\nNo one is going to try and compete with those companies, and those companies have policies to prevent it.   As an example, in my state, almost all the chicken processing is done my a single company.   If a farmer decides to look into working with another company, the big company tells that farmer if they leave, they can never work with them again and they tell them off the record they won't work with that farm again, so not working with them makes your farm worth less.  In my state, if you don't want to work with them you have to pivot into crops.  Now tell me how a start up sized company is entering that market.",
            "title_similarity": "0.59085965"
        },
        {
            "id": "i3m5sdw",
            "score": 1,
            "text": "Jeff Bezos does not nearly have enough money to \"buy everything\" Furthermore, to even try, would involve him selling all of his Amazon stock.",
            "title_similarity": "0.65368474"
        },
        {
            "id": "i3m69sm",
            "score": 1,
            "text": "There was a movie made in the 1980s called Wall Street.\nPart of the plot relates to a hostile takeover.\nSome of the actors include Michael Douglas, Charlie Sheen, Martin Sheen, and Darryl Hannah.",
            "title_similarity": "0.5837654"
        },
        {
            "id": "i3m80l0",
            "score": 1,
            "text": "The contract he signed with Twitter to join the board says as long as he's on the board he can't own more than 14% of the company. What stops him from buying everything? Well 1 is practicality. I mean he couldn't afford to buy Microsoft and Disney both. Not even Bezoz has that type of money. And 2 most of his net worth isn't in capitol. He dosen't actually have 190 billion dollars. Most of that is appraisal value for if he were to sell the assets he owns.",
            "title_similarity": "0.64511114"
        },
        {
            "id": "i3m8hb3",
            "score": 1,
            "text": "Mostly it's economics.\n\nCompany stock prices are based on a lot of things, but one of them is supply and demand.  You are not entitled to buy whatever stocks exist.  Someone has to sell them.  Bezos can't just buy everything because it's often simply not for sale.\n\nAnd even enough of a company was for sale, it can get really expensive to buy it.  At any given point, a chunk of stock is on the market, but not all of it.  As shares are bought and held, the amount on the market decreases and the price has a tendency to go up...in some cases it goes up a lot.  \n\nI believe I read someplace that if Berkshire Hathaway struggles with being too rich.  Once they decide to invest in something, if they just bought as much stock as they can immediately, the price reaction would result in them having to lose like 10-20% of their money just to overcome the market reaction of them buying as much stock as they can afford because of how wealthy they are. They now have to pick an industry they think will be doing well many years from now and then buy into it slowly over years.   They don't have time available to research and find places to invest their billions in smaller units.  At the same time, money they haven't invested loses value with inflation, but doing literally anything is super risky because of how much it may end up costing them in particular to do it.",
            "title_similarity": "0.6664973"
        },
        {
            "id": "i3m8x36",
            "score": 1,
            "text": "R/superstonk look up boston consulting group and Amazon connections..... bezos doesn't buy he send his cronies to bankrupt a company so take over the market share they have....due to monopoly rules he can't do it directly but he can do it by other means",
            "title_similarity": "0.74714094"
        },
        {
            "id": "i3ma7l7",
            "score": 1,
            "text": "Generally speaking, as long as the shareholders are willing to accept what is being offered for their stock, the deal will go through. \n\nin Bezos' case, he would need the cash to actually buy all those shares. Almost all of his \"wealth\" is in Amazon stock (he owns about 16% of all outstanding shares). He would either have to liquidate that stock (which would tank the value), or offer Amazon stock (which would give the other company significant ownership stake in Amazon). Buying it up in cash would essentially be taking whatever he's acquiring private, which is what private equity firms do all day long.\n\nWe saw just this week where Elon Musk did exactly that, and acquired a significant portion of Twitter stock (and it's still only 10%, which is enough to get a seat on the board)",
            "title_similarity": "0.6569017"
        },
        {
            "id": "i3mb1bd",
            "score": 1,
            "text": "People usually only buy other companies if they feel they can significantly improve the business. Bezos is likely not interested in putting in the time and effort to improve businesses that he has no experience in.",
            "title_similarity": "0.6436964"
        },
        {
            "id": "i3mbv79",
            "score": 1,
            "text": "Bezos doing it already with overpaid consultants to bankrupt companies and take their marketshare. Look at his attempts with toysrus, gamestop, blockbuster, etc.",
            "title_similarity": "0.7201135"
        },
        {
            "id": "i3mcq3b",
            "score": 1,
            "text": "Plenty of explanations here on how takeovers happen and the specifics on being able to buy a lot of stock. \n\nAnother reason Bezos can’t just buy whatever he wants is that he doesn’t have the money. Jeff is worth almost 200B. But that is net worth not liquid cash. Most of his worth is tied to ownership in Amazon which has a market value based on stocks. In order to buy 100B worth of another companies stock he would have to sell a huge portion of his ownership of Amazon.",
            "title_similarity": "0.6582966"
        },
        {
            "id": "i3md17h",
            "score": 1,
            "text": "First of all, all of Jeff Bezos’ money could barely even give everyone in the United States $250, and that’s assuming that all of his Amazon shares are bought at current price, which they would not be.\n\n(Realistically that would actually be somewhere under $70 per person)\n\nSo, I dunno what exactly you mean by “everything” - but for starters he doesn’t have enough money.\n\nIf you’re talking about buying up competition, it’s the FTC, SEC and other government entities that arbitrate whether that is legal or not.",
            "title_similarity": "0.65909606"
        },
        {
            "id": "i3merzl",
            "score": 1,
            "text": "He could start buying things, but the more and more he buys, the more and more risky those assets become because he can simply dump the asset back into the market. Anything he touches gains an added risk to it, and that risk oftentimes shrinks the perceived value of an asset.",
            "title_similarity": "0.69709307"
        },
        {
            "id": "i3mesrp",
            "score": 1,
            "text": "Does he need to?  The Amazon business model controls distribution for so many business that  the guy could almost be labeled a modern day,  John D. Rockefeller.",
            "title_similarity": "0.6566911"
        },
        {
            "id": "i3mg9uk",
            "score": 1,
            "text": "How has no one (that I’ve seen) mentioned a poison pill?",
            "title_similarity": "0.3851249"
        },
        {
            "id": "i3miac1",
            "score": 1,
            "text": "When I went to school as a kid I was told monopolies are illegal.\n\nNow every company buys up their competition and does 100 different things that are so far removed from the companies original intent.",
            "title_similarity": "0.62640196"
        },
        {
            "id": "i3mipv9",
            "score": 1,
            "text": "Well, monopoly law is the only thing to stop anyone from just buying everything but you could always just name the other company you buy something different and monopoly law no longer applies.",
            "title_similarity": "0.67936885"
        },
        {
            "id": "i3mirhi",
            "score": 1,
            "text": "The overwhelming majority of Jeff's value is in company ownership. He doesn't keep his value in a giant money tower.\n\nThis means that in order to buy any business, he needs to first sell shares in his company, which reduces his control over the company.\n\nSecond, a lot of startups are made with the idea in mind that they will get purchased by a bigger company and the current owners stand to gain significantly. You can do this too. Get some idea that you believe can sustain a business, gather some funding, and go. That being the case, there's a lot of lazy startups that aren't worth buying. A business at its core is just an idea. Humans have lots of ideas, so it makes sense to invest only in good ones.\n\nThird, a lot of companies have employees who also own some small percentage of the company. Those employees are core components of the business and the reason for the company's success. What often happens is a company gets purchased, then the employees go f\\* off to early retirement, leaving the current business flat because they're suddenly very wealthy.\n\nFourth, the only reason why a company should ever want to purchase another company is to consume its brand popularity, or to be able to use that company's intellectual property without making regular payments, or to simply eliminate competition. Anything outside of something practical can actually reduce the bigger company's value significantly since investors lose confidence in leadership.\n\nSome companies' investments in blockchain companies are a great example. All blockchain is is basically a massive google doc that everybody can read and nobody can delete from. Investing money in it serves no practical purpose beyond potentially brand popularity, which is also questionable since those companies haven't been around long enough to have a known brand.\n\nFifth, extending your brand to incorporate other brands does one of two things: increases your responsibilities to your own company, or reduces your understanding of your own company. Usually the former since companies aren't overall that complex of ideas, but people frequently pay more just to have to pay attention to less -- and have more time in their day.\n\nSixth, our country is obligated to make sure companies don't grow too large. Eventually, we might see Amazon forcibly split into delivery and online sales and network resource provider. That certainly would have happened 40 years ago, but that doesn't mean we can't suddenly find inspiration at some point later. In any case, some companies are definitely pushing their luck.",
            "title_similarity": "0.7343548"
        },
        {
            "id": "i3mj2tm",
            "score": 1,
            "text": "The US department of justice DOJ allows or prevents all business activity in the US relating to a company “buying” another in any form. Mergers are constantly being stopped by our government when they are believed to not be beneficial to the consumer. Anti trust laws",
            "title_similarity": "0.73076"
        },
        {
            "id": "i3mj2uo",
            "score": 1,
            "text": "A \"hostile takeover\" is when one entity (a person, company, etc.) acquires a controlling stake in a company by purchasing the shares in the open market, as opposed a \"friendly\" takeover, where they approach management and negotiate terms. In order for that to happen, the company must be publicly traded. It's considered \"hostile\" because the negotiation/communication channel for the Buyer and management is essentially closed off, and management doesn't have too many things they can do to prevent it.\n\nThere are things that prevent that from happening, however. Many companies now have \"anti-takeover\" provisions in their bylaws, which basically put in certain mechanisms that make performing a hostile takeover very expensive, unprofitable, or both. For example, a popular strategy is called the \"poison pill,\" which gives pre-existing shareholders the right to buy more shares of the target company (a \"flip-in\" poison pill) or the acquiring company (\"flip-over\") at a steep discount, diluting the ownership of the shares. There are other strategies too.\n\nLastly, acquiring a company is expensive and not straightforward. You might see a stock trading at $100 today. If you were to enter a really large order to buy basically all of the stock, however, like what a hostile takeover would do, the price would *naturally move up* during that time because you're exerting a TON of buying pressure (\"demand\") for those shares. So while the first share you buy might get that $100 target, the *last* share you buy might be at $130 or even higher, making the trade more expensive and less profitable.",
            "title_similarity": "0.72459984"
        },
        {
            "id": "i3mka5h",
            "score": 1,
            "text": "Come on down to r/superstonk and learn about how he created dark pools at DE Shaw and how his wall st buddies destroy companies through naked shorting, cellar boxing, overpaid consultants, etc. Just so he can capture their market share.\n\nYou have much to learn young padewan",
            "title_similarity": "0.6318824"
        },
        {
            "id": "i3ml04m",
            "score": 1,
            "text": "Elon musk appears to be starting this with Twitter.. let's see what unfolds like the guy tracking his plane..\n\n\nBet musk does this and boots Jack Dorsey to install his own puppet if they don't concede to what he wants..",
            "title_similarity": "0.59810543"
        },
        {
            "id": "i3mm12h",
            "score": 1,
            "text": "Hostile takeover crash course:\n\nCompany A: wants to take over company B\n\nCompany B: doesn’t want to be taken over by company A\n\nCompany A Creates negative news regarding company B which tanks their stock. \n\nCompany A buys up majority of company B’s stock for dirt cheap due to its price crashing from investors selling the stock out of fear of losing their money.  \n\nCompany A now holds majority shares of company B therefore giving them control over company B. Company A now has a board seat with controlling shares.  \n\nPossible example of this in the works:  Musk & twitter…..time will tell",
            "title_similarity": "0.72985053"
        },
        {
            "id": "i3mm3r1",
            "score": 1,
            "text": "I know it's been said elsewhere, but even with his immense wealth, and even if we assume he can liquidate enough of it to buy another company, he couldn't afford and of the top 60 companies in terms of market cap.",
            "title_similarity": "0.66453063"
        },
        {
            "id": "i3mo7tv",
            "score": 1,
            "text": "Who says he hasnt already or will soon? The shell corp thing is so shady and seems hard to police. I know nothing about any of this and is most likely very wrong.",
            "title_similarity": "0.56027675"
        },
        {
            "id": "i3moci1",
            "score": 1,
            "text": "Very little. Our monopoly laws are weak. Price may be the most real barrier. He couldn't buy Appel or Google. Probably not even Facebook.",
            "title_similarity": "0.53855664"
        },
        {
            "id": "i3momug",
            "score": 1,
            "text": "Lots of good answers.  I didn't see poison pills mentioned.   Some corporate bylaws will have it set up that if a hostile takeover starts, the executives and board get huge payouts, thus distorting the takeover return on investment.  \n\nAfter the 1980s, many regulations were put in place to limit hostile take-overs, poison pills, golden parachutes, sweet-heart deals, etc.",
            "title_similarity": "0.7249122"
        },
        {
            "id": "i3mp5o9",
            "score": 1,
            "text": "If management rejects your offer and you want to acquire the company nonetheless, you either approach the shareholders directly to acquire a controlling stake or you approach the shareholders to vote in favor of the acquisition in a proxy fight.\n\nThere are a myriad of defenses against hostile takeovers that targets can employ, and it is generally difficult to acquire a company in this manner. The current model these types of folks use instead is called activist investing. They acquire a significant minority stake, obtain board seats, and fight their battles in public to try to force the company to make their requested changes. Largely a response to defense mechanisms that makes actually acquiring a majority stake of the company impossible or costly.\n\nJeff Bezos does not have nearly enough personal capital to go around doing hostile takeovers of companies. And his capital is mostly Amazon stock, so that adds another layer of complications.",
            "title_similarity": "0.7611322"
        },
        {
            "id": "i3mphk2",
            "score": 1,
            "text": "sherman and clayton anti trust laws made monopolys illegal so he would be breaking the law if he bought absolutely everything",
            "title_similarity": "0.65961754"
        },
        {
            "id": "i3mqdsu",
            "score": 1,
            "text": "If the acquirer really wants to, they can do a hostile takeover if the target is publicly traded and get the financial backing in place and go to the public markets and just start buying large blocks of stock.",
            "title_similarity": "0.7410977"
        },
        {
            "id": "i3mr67c",
            "score": 1,
            "text": "He's not rich enough for that. While his personal wealth is egregiously insane at 200+ billion, worth far more than 99.9% of redditor's wealth combined, he can't even buy a majority of any of the largest tech companies.\n  \nFor instance, let's say he wanted to buy Tesla and convert all their batteries to amazon van EV's. Tesla would cost him ~1 trillion, assuming Elon would sell which he probably wouldn't, and that's only the sixth most valuable company. So, at most, Bezos could buy 20% of the sixth most valuable company...definitely not enough to \"buy everything\".",
            "title_similarity": "0.6089606"
        },
        {
            "id": "i3mrprr",
            "score": 1,
            "text": "> Is there anything stopping Jeff Bezos from just buying everything?\n\nJeff would have to sell shares to buy everything. The moment he starts unloading his shares the price of those shares are going to drop in value. The more he sells at a reduced price the more the shares are going to fall. Thats the problem of being the richest person in the world. Your assets aren't really that valuable and if you want to keep the bubble and your status you have to be careful how much shares you actually liquidate into actual cash.",
            "title_similarity": "0.69737995"
        },
        {
            "id": "i3mte2z",
            "score": 1,
            "text": "I worked for the largest eye glasses/sun glass manufacturer in the world (Luxotica) for a brief period. They make pretty much every name brand pair of glasses that you can think of. They wanted to buy Oakley but promptly got told to pound sand. So Luxotica instead bought Sunglass Hut which was Oakley's main distribution outlet. Luxotica then stopped selling Oakley through Sunglass Hut thus devaluing Oakley to the point that Oakley eventually sold to Luxotica at a discounted price. Ruthless but it worked.",
            "title_similarity": "0.57207245"
        },
        {
            "id": "i3mty56",
            "score": 1,
            "text": "Bezos can't just take over anything cause Amazon doesn't have enough free cash and probably not enough treasury stock.  Apple, different story, but even here there are limits.  And these takeovers usually start with owners with a lot of voting shares.  We don't have to worry about Bezos taking over the word yet.  Although we might want to give him a chance.",
            "title_similarity": "0.70384467"
        },
        {
            "id": "i3muvqr",
            "score": 1,
            "text": "Either  it's  gonna be  China or  Bezos. \nWhich is the  lesser of the two  evils?",
            "title_similarity": "0.5235314"
        },
        {
            "id": "i3mvbor",
            "score": 1,
            "text": "As someone who owned several business its not that simple. But if Mr Amazon is determined enough he could, but highly unlikely that he will.\n\n2 factors to consider in taking over a business.\n\n\\-If you are public\n\nIf you are public the acquirer can buy stocks from your company. However, there's likely a limit of how many percentage can be sold to a individual acquirer because of the simple fact that once a owner loses a majority of the stocks to an individual (Company or a person), he becomes a \"Ex\" owner. He is now just a simple shareholder.\n\n**The new majority shareholder becomes the owner**. This is important to note as this enables the majority shareholder (New owner) to set new directives and directions for the company, which the other current shareholders might not like. So a vote is needed. However, from my experience, most shareholder will favor the acquisition when money is good enough.\n\n\\-If you are a privately owned smaller business\n\nYou can be approached and asked if you wished to sell your asset for an amount. You negotiate or reject. If you reject there is likely nothing they can do. Most big companies acquires smaller ones not for the companies but for an asset that they are interested in. This could be a software or anything really that was developed and owned by the smaller company. The bigger owner will buy the smaller company,  acquire that asset, and then discard the company\n\nLets say you create a very good one of its kind software that design houses, You create a company to design houses which brings your company 10 million profit every year. Jeff Bezos offers you 1 billion to buy your company. Lets face it. Most will sell. Mr Amazon can get any talent he wants to develop an asset that outperforms the target that he is interested in so there is that consideration. Is the cost for developing the asset higher than the cost of outright buying the rights to it? Is it worth the hassle?\n\n&#x200B;\n\nOverall my opinion is that Jeff Bezos is at that stage where he cares more about his legacy. Hostile takeovers of a lot of smaller companies is just a bad look. So he probably can...... if hes determined enough, but he probably won't.",
            "title_similarity": "0.7069101"
        },
        {
            "id": "i3mx5jg",
            "score": 1,
            "text": "Hire Boston Consulting Group. BCG will come in and run your company to the ground while extracting as much money in every direction they can. Then while the company is on it's last leg Jeff can come in a purchase it for super cheap.",
            "title_similarity": "0.6345309"
        },
        {
            "id": "i3mxchy",
            "score": 1,
            "text": "Blackrock, Blackrock is stopping them.\n\nOthers have made more serious answers, but Blackrock is the company that has its hands in a little bit of everything. Its CEO, Larry Fink, isn't as rich as Bezos so it gets less news. Fink doesn't have a ton of money comparatively, but his company has ownership and influence over a lot more than Bezos.",
            "title_similarity": "0.6264006"
        },
        {
            "id": "i3mxjdb",
            "score": 1,
            "text": "He can do a hostile takeover if he has the backing. There are actually people that are hired to come in by companies divide the companies up in several small bits sell them for profit and break the company",
            "title_similarity": "0.73167586"
        },
        {
            "id": "i3n0dex",
            "score": 1,
            "text": "And to answer the question about Jeff buying everything, anti-trust laws were set up in the 1920s for just this reason (though trying to get them to stick has been sliding)",
            "title_similarity": "0.6726464"
        },
        {
            "id": "i3n3r8q",
            "score": 1,
            "text": "Elon Musk stands in his way. I read yesterday that Musk has like $100 billion more than Bezos right now.",
            "title_similarity": "0.4086224"
        },
        {
            "id": "i3n4yxz",
            "score": 1,
            "text": "In the United States, the Federal Trade Commission (FTC) would get involved if there were the possibility of a monopoly or too much influence on a particular market.  Other countries have similar things.",
            "title_similarity": "0.6623486"
        },
        {
            "id": "i3n6ez5",
            "score": 1,
            "text": "With all his wealth, Bezos is short about $1.7 trillion of what would be required to buy Amazon.",
            "title_similarity": "0.52889407"
        },
        {
            "id": "i3n6o83",
            "score": 1,
            "text": "There is definitely nothing that can be done to stop Jeff Bezos buying everything. It is inevitable.",
            "title_similarity": "0.45020553"
        },
        {
            "id": "i3nekjk",
            "score": 1,
            "text": "No jeff bezos can't hostile take over every business for a few important reasons.\n\n1. not all businesses have enough outstanding stock that can be purchased or any stock at all for him to acquire. \n2. Even if they are publicly traded most companies keep enough of their own stock between the companies holdings and the employees to prevent a full take over.\n3. Antitrust lawsuits would prevent him from even considering the purchase of many businesses or force him to choose one way or the other in a particular industry\n4. Supply and demand- as soon as people find out that someone is trying to corner a particular market or takeover on a stock you would see the price rise so fast with modern systems it would quickly price him out of doing it to even mid size companies.\n5. Despite how rich he is he couldn't afford to purchase 20% of apples stock let alone every other major company out there",
            "title_similarity": "0.7136324"
        },
        {
            "id": "i3nf6n1",
            "score": 1,
            "text": "This actually happened to me and my family, my dad is a business owner, not anything huge-just a construction company. He was a really hard worker and his siblings were kinda jealous of his ability to make money. One on of my sister’s husband’s had come to him asking for money because his family was sinking in debt and he needed some to get back on his feet. My dad liked the guy and decided that it would be worth more if he game him some stake in his construction company. This guy wasn’t very good with money and decided it was easier to sell that stake back to some of the other guys who held it in my dads company than to hold onto it and collect money passively. After he sold the shared to my dads competition they ousted my dad from the company and we lost everything for a time. For the next two years we had to sell furniture to pay our mortgage and me (m) and my two sisters got I.O.U.s for Christmas. Hopefully that makes sense.",
            "title_similarity": "0.5934775"
        },
        {
            "id": "i3nfecy",
            "score": 1,
            "text": "Hostile takeovers are common. Lots of good books about them. I recommend you take the time to find one.\n\nCompanies utilize something called a \"poision pill\". That's the actual technical term. Here is a common way it's utilized: Shareholders are given the right to buy additional shares at a discount if one person tries to take over the company by acquiring stock.\n\nSounds familiar? Consider Twitter and Elon Musk's move. It helps answer why he didn't just outright buy the whole company. I can't know for sure if that's what happened in the case of Twitter/Musk, but you can bet there's a reason he limited his percentage of ownership.\n\nThe idea of the poision pill, therefore, is to simply make it impossible for a hostile takeover to happen. Very effective, those poision pills.",
            "title_similarity": "0.78571844"
        },
        {
            "id": "i3nft64",
            "score": 1,
            "text": "Don’t understand why companies would allow themselves to be exposed to this… just own 50%+1 stock of all shares and this can’t happen.",
            "title_similarity": "0.5963112"
        },
        {
            "id": "i3norq7",
            "score": 1,
            "text": "For the most simple answer, Bezos owns something like 0.5-.6% of the New York stock exchange. An insane number for one person, but not enough to buy everything",
            "title_similarity": "0.59652483"
        },
        {
            "id": "i3o0j5y",
            "score": 1,
            "text": "To add another element, a lot of companies shield themselves by setting up different types of stock that the company is divided in. For instance, a company may have preferred stock and their articles of incorporation may say that x amount of board of directors are elected by preferred stock holders. So let’s say a company has 5 board members. They decide that 2 board members must be elected by preferred stock holders only. That means that common stock holders can elect the remaining 3. If Bezos buys 51% of stocks, he’d easily be able to elect at least 1 board member, if not 2. That means that the remaining shareholders can elect the remaining board members. So then even if Bezos has majority of shares in a company, that doesn’t necessarily translate to a hostile takeover.",
            "title_similarity": "0.5879626"
        },
        {
            "id": "i3os0g1",
            "score": 1,
            "text": "Is anyone concerned that bill gates is buying all the farmland he can get his hands on? Look it up.",
            "title_similarity": "0.6744808"
        },
        {
            "id": "i3p0q2m",
            "score": 1,
            "text": "I think you're overestimating Bezos' worth compared to the total market cap of \"everything\".",
            "title_similarity": "0.61223996"
        },
        {
            "id": "i3qwlg3",
            "score": 1,
            "text": "For Jeff Bezos to buy everything, someone has to sell him everything.\n\nHostile takeovers aren't hostile at all: the previous shareholders are selling their shares very willingly to the acquirer.\n\nA takeover is called a hostile takeover, when the existing management of the company is hostile to the decision of the owners of the company (the old shareholders) to sell their shares.",
            "title_similarity": "0.73359317"
        },
        {
            "id": "i3wa332",
            "score": 1,
            "text": "LOL buy stuff from him or invest into stuff that could be on his list of stuff & raise the price!",
            "title_similarity": "0.6595812"
        },
        {
            "id": "i4nxyrn",
            "score": 1,
            "text": "Poison pills can prevent this. Interesting subject matter. And why Wachtell became Wachtell, the only law firm that truly functions as an investment bank.",
            "title_similarity": "0.6009556"
        },
        {
            "id": "i52ctct",
            "score": 1,
            "text": "Not to mention that once you start buying a ton of stock in a company, word spreads and the price goes through the roof.\n\nSo to gain a majority share, you will likely end up paying more than what the entire company is worth.\n\nOnly to then have a ton of investors dump the stock and cash in on their profits - devaluing your extremely expensive purchase.\n\nIt's reasons like this that it almost never happens, and mergers or buy-outs are negotiated.",
            "title_similarity": "0.6839598"
        }
    ]
}