{
    "ELI5: Why does the economy require to keep growing each year in order to succeed?\nWhy is it a disaster if economic growth is 0? Can it reach a balance between goods/services produced and goods/services consumed and just stay there?  Where does all this growth come from and why is it necessary? Could there be a point where there's too much growth?": [
        {
            "id": "i4svjbs",
            "score": 6,
            "text": "Capitalist economies only exist because people are constantly producing and buying things they don't actually need. If we all became Buddhist monks who were content with just the basics, the economy would immediately collapse and we'd have another great depression.\n\nSo yes, we need to keep the rat race going or else we'll face complete economic ruin.",
            "title_similarity": "0.6922634"
        },
        {
            "id": "i4t0jcc",
            "score": 243,
            "text": "I realize there is a rule against opinions, but this is an inherently political question. Every answer to this question will be an opinion tarnished by the commenter's political ideology.\n\nThe economy doesn't require constant growth, capitalism does. The economy could refer to a whole lot of things, all generally relating to production, distribution, and consumption of goods. Capitalism isn't the economy, it's a type of economy, and it does require constant growth. This is because capitalists are constantly hoarding / isolating wealth from the working population.\n\nedit: correction, capitalism isn't a type of economy, it's a mode of production. My bad.\n\nAs they take more, we need to produce more to compensate. But in doing so, we make the total amount of stuff bigger. So next time they take more, it'll be more more than last time's more. Capitalism makes no effort to meet people's needs, it's all about making profits for the capitalist. A system designed to meet people's needs would not require such a constant and massive growth.",
            "title_similarity": "0.7082353"
        },
        {
            "id": "i4tgofq",
            "score": 45,
            "text": "Capitalism requires growth, because shareholders expect a return on their stock  investment.\n\nIf the workers owned the companies they work for, the profits would be distributed to them and companies would do what's best for the workers instead of sacrificing everything to boost short term profits in order to satisfy shareholders.",
            "title_similarity": "0.721516"
        },
        {
            "id": "i4t1kh3",
            "score": 38,
            "text": "> Can it reach a balance between goods/services produced and goods/services consumed and just stay there? Where does all this growth come from and why is it necessary? \n\nImagine if the goods and services \"just stayed there\" in 1920, and \"reached a balance\". \n\nNo TV. No internet. No computer. No smartphone. No washing machine. No air travel. \n\nWhat is growth? \n\nBlack and white TV in 20% of households to colour TV in almost every family. That's growth.\n\nNo internet in existence to almost everyone being on a smartphone. That's growth.\n\nWashing clothes by hand to washing machines. That's growth.\n\nPeople shrugging their shoulders and dying en masse during Spanish Flu to advanced companies like Pfizer vaccinating you so you don't die. That's growth. \n\nToday's living conditions make 1920s look like crap. 1920s living conditions made 1820 look like crap.\n\nWith growth, 2120's living conditions would make our lives today look like crap. Without growth, humanity would stagnate at this current level. \n\nWe're nowhere near the maximum pinnacle of products and services. Think about all the material constraints of life.\n\nToday's working class European has the same standard of living (and longer life expectancy!) as a European aristocrat in 1900. Wouldn't it be nice if by 2200 the average person has the same standard of living as a CEO today? Would we prefer that, or would we prefer to stay where we are now?",
            "title_similarity": "0.5377681"
        },
        {
            "id": "i4su7jb",
            "score": 0,
            "text": "Well ideally you want gdp to grow along with population. If your population isnt growing then economy doesnt necessarily need to grow but if economy stays the same and population increases, thats not good for the country",
            "title_similarity": "0.8308276"
        },
        {
            "id": "i4tivwl",
            "score": 2,
            "text": "The short answer would be; it doesn’t *need* to keep growing. Japan’s real GDP has been, more or less, pretty stagnant for the last 20 or so years. They have one of the most prosperous societies on the planet! \n\nWe need to elaborate on what success is supposed to mean here, and the answer will vary by a country’s level of development. If you are as developed as, say, a Japan, than growth might not matter too much. If you’re eg Ethiopia, however, getting a growth dynamic going is extremely important",
            "title_similarity": "0.74716467"
        },
        {
            "id": "i4trdbw",
            "score": 1,
            "text": "Exponential growth is the mantra to justify endless progress when both are at the detriment to society.",
            "title_similarity": "0.5953455"
        },
        {
            "id": "i4ul9gg",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.03167421"
        },
        {
            "id": "i4szx7o",
            "score": 2,
            "text": "Innovation is driven by incentives. A stagnant economy lacks those incentives.\nThough it's also a little chicken and egg. As innovation drives growth.\n\nAnother comment talked about food and population. If population stays the same and there's enough food, then nobody will invent more efficient farming methods.\nNobody needs this extra food. Nobody will pay for this extra food.\nHowever if the population increases, food production needs to increase and so better methods of farming are needed to meet demand and now there's an incentive to get ahead of the curve because you can see the trend is for an ever increasing demand for food.\n\nSome people think growth is only needed to sustain capitalism. But it's also needed for innovation. And I think innovation is one of the greatest aspects of humanity and how we solve problems to keep humanity advancing.",
            "title_similarity": "0.7708782"
        },
        {
            "id": "i4ta1bq",
            "score": 4,
            "text": "Because it's all one big Ponzi scheme that's 'to big to fail'. The system requires new money paid in to cover the debts taken on.\n\nThe vast majority of companies and countries operate on debt which has an amount of interest, so you need to produce more to pay off the initial plus interest. You also have to incentivise people to spend their money by making saving it bad i.e your dollar today is worth $1 but next year it's only worth $0 .97 because of inflation, if we had deflation then you wouldn't buy that new TV they want you to buy because next year that $1 is worth $1.03.\n\nTldr: Capitalism",
            "title_similarity": "0.774895"
        },
        {
            "id": "i4stsnk",
            "score": 23,
            "text": "Couple of reasons why growth is preferable. One, the population is growing. With more people, you need more of everything to keep them comfortable\n\nSecond, getting nicer things. Smartphones didn’t exist 20 years ago. MRIs, satellites, thin TVs. All these things are as a result of economic growth. If the economy stops growing, we don’t get more new stuff",
            "title_similarity": "0.8009983"
        },
        {
            "id": "i4sypf6",
            "score": 2,
            "text": "Besides the population growth aspect, there's also a human psychological want to have more. There's an inherent drive to want more wealth or material objrcts over time, so the economic growth also partly reflects those human desires.",
            "title_similarity": "0.59720325"
        },
        {
            "id": "i4tdtyn",
            "score": 3,
            "text": "Simple answer, shareholders. They require quarterly growth in profits so they can make money. Simply making the same profit each year isn’t enough.",
            "title_similarity": "0.85007846"
        },
        {
            "id": "i4tfrti",
            "score": 4,
            "text": "I think it is propaganda from a class of people that live off of stock market activity. \nWall Street versus Main Street. They act like Wall Street’s health is some kind of indicator of average per capital buying power. But it’s not, at least not anymore. They need the growth to be able to siphon off money for themselves. They tell us we need the stock market to grow so that we keep buying, and also so we keep investing, so they can manipulate stocks even more.",
            "title_similarity": "0.76050377"
        },
        {
            "id": "i4t8z5c",
            "score": 1,
            "text": "It doesn't. See Japan. Very successful country that has experienced long periods of relatively flat economic growth. \n\nHowever, might I suggest that your first question should be \"how is economic growth measured\". In most cases GDP is used but almost every country has a different way of calculating theirs (UK includes property transactions for example, when other countries do not). \n\nThen when you see what is included and what is not, you can ferment your own view on what economic success might look like.\n\nThere are several very good books around the subject of GDP.",
            "title_similarity": "0.7182209"
        },
        {
            "id": "i4tccjt",
            "score": 1,
            "text": "You’re getting a lot of answers. Most of them wrong. This thread perfectly illustrates why Reddit is absolute trash and a huge detriment to humanity.  \n\nAnyway. The economy needs to grow because we run a very deliberate inflation through monetary policy.   \n\nWe want inflation to incentivize a higher velocity of money.   \n\nSo unless you’re growing at around 2% you’re actually becoming less productive.  \n\nThen we’d like to grow even more than that if possible, because that’s an indication of more people doing more productive things, generally speaking. When a person does something productive, like he makes a wooden sculpture, then he’s adding that value to the entire economy. He’s transformed something immeasurable and inherently non-economic, his time and muscle energy, into something that’s measurable and has a market value, a sculpture.  \n\nAnyone who tells you that “infinite growth is impossible” is a midwit that you can safely ignore.",
            "title_similarity": "0.75143814"
        },
        {
            "id": "i4sth1q",
            "score": -6,
            "text": "Progress. Honestly though, recessions build the economy better than growth. Hear me out… when you’re down and have to succeed, you will. Then you come back 2x greater.",
            "title_similarity": "0.77035016"
        },
        {
            "id": "i4vmbgv",
            "score": 6,
            "text": "The pessimistic answer is growth of stock market value is required to provide retirement income in an absurd multinational ponzi scheme while at the same time provide low/no effort income to the wealthy investment class. So it is made to grow at the expense of the labor class.",
            "title_similarity": "0.7477411"
        },
        {
            "id": "i4sxhzx",
            "score": 192,
            "text": "Your question is similar to why there is inflation. TLDR you need to give your citizens a reason to continue paying for goods and investing in companies. In a deflated economy, people will hold on to their money and not spend it knowing they can buy it for cheaper in the future. A steady inflation is beneficial to most world economies",
            "title_similarity": "0.7343638"
        },
        {
            "id": "i4tj4bz",
            "score": 5,
            "text": "It could if it was not for greed. This is a question I had that lead me to that answer. Every year, every company adjusts prices and they normally go up fifty cents to a dollar every year. But wages don't.",
            "title_similarity": "0.74326336"
        },
        {
            "id": "i4sunnr",
            "score": 40,
            "text": "There are probably several answers to this question, but there are two things I think contribute. \n\nFirst is that our population is growing (albeit very slowly in the US as of late), so that’s one reason we’d like the economy to grow. \n\nMore importantly, the growth of the economy is one factor that helps drive investments. If the economy didn’t grow (meaning most companies don’t generate net new value for their shareholders), then investors have effectively lost money. This is because the money that they invested in a company (which has not earned additional value for a whole year) could have been sitting in a savings account or invested in government bonds and accruing interest (creating additional value). This would disincentivize people from investing in companies, which is generally bad for job growth / employment rate / innovation / etc if companies have less funding and aren’t generating additional revenue themselves. \n\nI’d like to make clear that I have no background in economics lol so I hope you get some better answers, I’m curious to see what others have to say!",
            "title_similarity": "0.85531163"
        },
        {
            "id": "i4t5ae8",
            "score": 1,
            "text": "the growth comes from our imagination - imagining new, better ways to grow crops, make hardware, provide service through software, etc. etc.\n\nWe keep finding ways to support ourselves in sustainable manners, which leads to economic growth. in the past, academics think that growth will be capped by the amount of food we can produce (how many hectares can we use for food, versus for humans to live in?), but technology advancements made it possible to support more humans on lesser land. generally, new inventions in every generation allowed us to shift away from agriculture focus into industrials (factories, etc.) and then services (including apps), which led to economic growth.\n\nwithout these inventions, America and the world would not be where it is today. Compared to recent developments, China was generally not growing much economically for thousands of years before that, and just maintaining status quo - if they decide not advance, the population could very well still be living without electricity and modern heating.\n\nthe next wave of innovations could very well stem from how we can continue to improve our quality of lives while damaging the environment less (possibly even making it better in the process?) and that could be the reason why growth continues to be desirable.",
            "title_similarity": "0.6921977"
        },
        {
            "id": "i4t5pvt",
            "score": 3,
            "text": "Growth is good because it *should* lead to less poverty. It also makes the country stronger and more secure. This is important because at the end of the day, each country (regardless of politics) must take care of itself and its people.",
            "title_similarity": "0.5109025"
        },
        {
            "id": "i4sx0i9",
            "score": 17,
            "text": "Debt. If we used all money available on a day we could not pay it back. Debt is a future investment. That can work. The problem is when you literally built your whole economy on it. For example the housing market. Housing market is to a large degree built upon scarcity and debt.\n\n\nIf there is a population decline it mean that there will suddenly be a housing surplus. Suddenly economy is not expanding/prices rising but the massive debt is still there. Without debt it would not be a disaster.",
            "title_similarity": "0.80189323"
        },
        {
            "id": "i4szwon",
            "score": 0,
            "text": "The reason it is REQUIRED to grow, population growth. \n\nOn average, the US population is net positive ~0.5% a year. If the economy doesn't grow by at least that much, then that's when you get deflation, which tends to really fuck with things since it encourages hoarding and reduces the flow of money (hoarding is of course one of the multitude of reasons that billionaires are bad from an economic reason)\n\nThe reason why it is pushed so hard is because of how investments work. Basically, if any given corporation doesn't make more money than it did the last year, it has hit the \"Sell high\" part of buy low sell high, and investors could make significantly more return on interest by selling the stock for huge profits, and investing in smaller businesses, and that sudden loss of funding would trigger a death spiral where the too big to fail get beat the fuck up. They almost definitely wouldn't be allowed to fail then, but they wouldn't be too big to fail for much longer.\n\nFor a lot of companies that are too big to fail, they are at 100% utilization of their available market, or the market is so competitive between a small number of huge players that they aren't able to effectively get a bigger  share of the market. So, they need either a bigger market or more utilization of the share of the market when that's impossible (such as something like your local power company where they are at effectively 100% of the even theoretically possible market)",
            "title_similarity": "0.8312812"
        },
        {
            "id": "i4szyrx",
            "score": 0,
            "text": "It's because most world economies engage in poor/optimistic planning for future funding that requires increasing future sources of funds for continuing viability. A growing economy increases future tax funds, allowing some coverup of inefficiency and outright corruption.",
            "title_similarity": "0.72675705"
        },
        {
            "id": "i4t20z9",
            "score": 0,
            "text": "If they economy has zero growth then everything economic becomes a zero sum game. For every winner there's a loser as there's a fixed amount of money to go round. Let's assume your company makes the same amount of revenue, profit etc every year (zero growth) in order for you to get a raise someone else needs a wage cut or to be fired. For Apple to make more money and employ more people, Samsung (or Home Depot or KFC or anyone) has to make less money and fire people.",
            "title_similarity": "0.7626051"
        },
        {
            "id": "i4tbbsf",
            "score": 0,
            "text": "Because we keep adding people.  More mouths to feed means more resources required to maintain them.",
            "title_similarity": "0.4851591"
        },
        {
            "id": "i4tempp",
            "score": 0,
            "text": "People are talking about population decline in developed countries, I am more concerned about the population boom in non developed countries, because we're going to end up paying for them as well, why do people that live in third world countries keep having so many kids?",
            "title_similarity": "0.7826476"
        },
        {
            "id": "i4tvhty",
            "score": 0,
            "text": "Economy is a word that means efficiency.  Increasing efficiency is a good thing. \n\nIf you worked all year and only made enough to pay your rent, gas in your car, and food, would you consider that a successful year?\n\nOr what if you made $80k but also a tree fell on your house causing $80k in damage. Would that be a good year?",
            "title_similarity": "0.75127363"
        },
        {
            "id": "i4ubag1",
            "score": 0,
            "text": "Because if it didn't grow the people who are the richest and control the economy, news, politicians, and stock market wouldn't continue to see returns on their real assets.",
            "title_similarity": "0.71971565"
        },
        {
            "id": "i4ufk51",
            "score": 0,
            "text": "Due to the over farming of land all top soul has eroded. Humans are such short term thinkers. It’s sad.",
            "title_similarity": "0.45851678"
        },
        {
            "id": "i4uozr3",
            "score": 0,
            "text": "a lot of it is capitalism brainwashing where the point of any business is to make more money progressively and there can't just be a constant earning flow.",
            "title_similarity": "0.71669257"
        },
        {
            "id": "i4uuf1y",
            "score": 0,
            "text": "The purpose of a business is to add value. This is done by refining a product or providing some service.  But by adding value the total amount of value in a system will increase. \n\nBy this logic no growth means that youve also removed some value from the system.",
            "title_similarity": "0.67977285"
        },
        {
            "id": "i4uxj1b",
            "score": 0,
            "text": "Because we're not good at fairness beyond certain points.  Why you, not me?  Why them, not us?\n\nIn theory, a growing economy means you have to sacrifice less for more and more people.  Ask people to sacrifice for others, and then difficult question pop up.  Not that humanity hasn't dealt with these questions, but we don't like the answers.  How many societies the world over have had kings and queens?  With a growth economy, there are many average people around the world that live as good if not better than a king 1500 years ago.\n\nTake away a growing economy, and all the global citizen stuff disappears.  Cheap energy dulls the sharp edges of tribalism to some degree, but if the economy stops growing, humanity will return to a much more traditional way of living.\n\nSurvival is not easy.  Most of us are alive today because of oil, which is the lifeblood of the economy.",
            "title_similarity": "0.7727635"
        },
        {
            "id": "i4vi3yy",
            "score": 0,
            "text": "Because it is a Ponzi scheme.  Everyone at the top takes from the layer beneath them.  They need a new layer of people to keep producing / buying in order to keep their position.  If we stop growing - OH NO!  They will lose money.\n\nIt doesn't really make a damn bit of difference to normal human beings.  It is a pure abstraction that we can completely ignore if we decide we want to.  But, we won't.  We would rather starve and die and kill off the masses than deny shareholders another record quarter.\n\nCheck out the great depression.  Check out millions losing their homes in 2008 while we bailed out the banks, instead of the homeowners (who would have, in turn, bailed out the banks.  But god forbid we help PEOPLE instead of corporations).",
            "title_similarity": "0.72192943"
        },
        {
            "id": "i4wmllj",
            "score": 0,
            "text": "\"Growth\" comes from only two things:\n\n1.natural resources that one can take from the earth at relatively little cost (think about how we steal resources from the earth but dont put everything back\n\n2. labor. Need fresh labor.\n\nThat + it's all an illusion propped up by Central Bank debt. There is no true economic 'growth' without m",
            "title_similarity": "0.6660336"
        },
        {
            "id": "i4ta6ug",
            "score": 99,
            "text": "The reason why economies tend to grow (when allowed to) is because, in general, people want it to. People, in general, want higher living standards than they currently have and are willing to put in the work for it. We absolutely could have 0 economic growth and the world would not go under, the problem is when people generally want growth but there is no growth, there are other underlying problems causing this, that's why 0 growth invokes the idea of economic chaos.\n\n&#x200B;\n\n>Where does all this growth come from\n\nEssentially it comes from people figuring out more efficient ways to do something. This can be a new machine being bought that is quicker or more energy efficient, it can be a work process being automated so something that previously took 30 mins to do by hand is now done in 20 seconds by a piece of code or it can just be a completely new technology being invented (usually the real effect on economic growth comes once this technology has been tinkered with enough to make it cheap enough to actually be used by many people/companies).\n\nEdit: Because so many people seem to be saying this, let me say this again explicitly: Population growth is not the reason for economic growth, since any reasonable person will measure long-term economic growth as GDP *per capita,* not simply total GDP. Having more people in and of itself adds nothing to improve living standards.",
            "title_similarity": "0.7815155"
        },
        {
            "id": "i4sw64p",
            "score": 1,
            "text": "because only businesses that do so get funding through investors.  If you aren't continuing to grow quarter over quarter the major investors will not touch you.",
            "title_similarity": "0.7183242"
        },
        {
            "id": "i4sw9rv",
            "score": 1,
            "text": "Economy is domino effect as it is dependent on every ones output \nWith favourable resources \nApart from this everyone tries to innovate something to hope someday it will dominate the world market",
            "title_similarity": "0.6943332"
        },
        {
            "id": "i4szw3w",
            "score": 1,
            "text": "It's because we expect everyone to earn their keep, and we allow business owners to own the innovations of their employees.",
            "title_similarity": "0.41059786"
        },
        {
            "id": "i4t1ps6",
            "score": 1,
            "text": "So governments can pay their ever-growing debts with the money they siphon off due to inflation/taxes.",
            "title_similarity": "0.6582602"
        },
        {
            "id": "i4t5z9b",
            "score": 1,
            "text": "Because the stock market is a ponzi  scheme. If they don’t keep getting more and more people to keep putting in money, it will collapse.",
            "title_similarity": "0.70054185"
        },
        {
            "id": "i4tc0m1",
            "score": 1,
            "text": "If it doesn't grow how will the uber rich support their lifestyles? If they can't support their lifestyles then they won't be able to buy as many politicians. Then the politicians won't pass as many laws that help the rich support themselves.  It's the circle of LIIIFFFFEEEEE!",
            "title_similarity": "0.72482526"
        },
        {
            "id": "i4tc70k",
            "score": 1,
            "text": "It wouldn’t be a disaster. If economic growth were 0 the oligarchs would cry about their imaginary lines and most of our lives would probably not change.",
            "title_similarity": "0.6773774"
        },
        {
            "id": "i4ua8bs",
            "score": 1,
            "text": "Having read most of this thread, I can assure you that almost everything that has been said here is wrong.  Most people don't understand what GDP and growth in GDP are or how they are measured.  GDP is just an aggregate of certain payments.  For example, if you and I both grow vegetables and eat them, that is not counted as production nor does it add to GDP.  But if we grow the exact same amount of vegetables, but you buy some of mine and I buy some of yours for the exact same amount of money, that counts as additional production and adds to GDP even though we both end up with the exact same amount of money, and the amount of vegetables produced and eaten is exactly the same.  So growth in GDP is partly a measure of specialization: how much do we pay other people and firms for goods and services rather than producing them for ourselves and our own families without payment.\n\nThe notion that the earth's finite resources somehow impose a limit on growth is therefore false: a handful of rocks could represent $.01 of GDP when thrown into a cement mixer, but the exact same resources could be refined and made into $1M worth of electronic components.  Some high-tech products are so valuable that you could in theory carry around $1T worth of them in a suitcase.  \n\nPeople also conflate growth with industry.  There is nothing to say that paying people for goods or services has to involve smokestacks and CO2 emissions.  If some rich fool pays Kate Upton to stand around at a party looking nice, that also grows GDP.  But there is an old joke about two economists who grow the economy by paying each other to eat dog $#!+, a clear case of economic growth making us, in aggregate, worse off rather than better off.",
            "title_similarity": "0.5781275"
        },
        {
            "id": "i4uoyl7",
            "score": 1,
            "text": "Zero growth means you're actually doing worse. The government keeps printing fiat, which directly causes inflation. So if you are stagnant, you actually lose like 5-10%(on the conservative side).\n\nYay quantitative easing!",
            "title_similarity": "0.70575225"
        },
        {
            "id": "i4uw0vz",
            "score": 1,
            "text": "Because interest exists. If the economy doesn’t keep growing, the amount of debt exceeds the amount of wealth, and not everyone can be paid back. This happed immediately so it is kind of stuck making more and more to pay more and more.\n\nEdit: Followed the bots orders and corrected payed to paid.",
            "title_similarity": "0.7614327"
        },
        {
            "id": "i4szxzm",
            "score": 976,
            "text": "It's kinda self-perpetuating. The economy grows because our whole economy is built around the idea of growth. We borrow against the future in the expectation of better returns, we invest in the future in the expectation of future gains.\n\nAnd within this system, individuals demand growth. Would you like to get a pay rise next year?  Where's that money/stuff/welfare going to come from? Either from growth (more money available), or from redistribution (taking from one to give to another) - with the obvious snag that redistribution means someone else has to have less money/stuff/welfare. So growth in the economy enables growth in individual wealth, welfare, and lifestyles. Lack of growth means stagnation. Recession means falling living standards.\n\nThis is all putting aside the population size point, which I think is actually incidental to the point. Even with a stagnant population, you would still need growth for the above reasons.\n\nNow, it's possible to imagine a post-growth economy but it's pretty hard. There are big conversations around de-growthing the economy because infinite growth implies infinite consumption of resources, and we ain't got infinite resources. It sort of shakes the very foundation of how everything works.",
            "title_similarity": "0.84051716"
        },
        {
            "id": "i4u0t2b",
            "score": 29,
            "text": "Simply put: most of the wealth in capitalist societies is privately owned. The impetus for making wealth \"productive\" (i.e investing it by buying labour and inputs to make new things to sell) rather than consuming it is an expected return after investing the initial wealth. So say I've got $20; I could either spend it now on something I'll enjoy, or buy things that I could then sell for $25 later. \n\nThis is the process that plays out over the entire economy, where investors expect returns on their investments in order to justify investing in the first place. And when this behaviour is aggregated, it turns into expecting economic growth across an entire economy.",
            "title_similarity": "0.7324814"
        },
        {
            "id": "i4uo37o",
            "score": 8,
            "text": "Because governments and large institutions have borrowed against that future growth, and our retirement accounts are invested in that future growth.",
            "title_similarity": "0.67742646"
        },
        {
            "id": "i4tj411",
            "score": -2,
            "text": "Look at your own paycheck. Do you want it to stay the same for the next ten years for doing the same job?  If no, then you want the economy to grow",
            "title_similarity": "0.7988771"
        },
        {
            "id": "i4vq2x1",
            "score": 2,
            "text": "It could serve 99% of humanity with slow growth or a balanced equilibrium, but rich investors will sell their shares if they don't expect them to keep growing, which will cause their perceived value to drop. Since they get to write the narrative, they make this scenario sound like failure, when in reality all the new ways markets are finding ways to force themselves into our private lives and skim value off the top to make growth seem limitless are actually hollowing out society for the rest of us.",
            "title_similarity": "0.73760235"
        },
        {
            "id": "i4tbs2a",
            "score": 41,
            "text": ">Can it reach a balance between goods/services produced and goods/services consumed and just stay there?\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n1. Capital goods depreciate.     Things like tractors, buildings, roads, etc. all require higher than normal returns to maintain them.   Imagine your car.   The *full* cost of your car is not just the price on the lot.\n2. Investment is what increases standard of living.   When firms, people expect 0% return, they make 0 investments, and hoard money causing, which can make existing debt more expensive and make it *more* tempting to hoard more money.     In this recent recession, *deflation* was the big thing the Fed feared and inflation did indeed hover around 0% for a bit.\n3. Economists often model people's welfare as \"utility\" and utility is a [function](https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Function_machine2.svg/1200px-Function_machine2.svg.png) of all the goods/prices in the economy.   So notionally its U(x,p) where U= utility and p = price and x = the good.     But people consume *thousands* of goods, so a person's utility is actually a whole series of various p,x combinations across thousands of goods.        If we do a bit of math, we would see that the consumption of *any specific* good is a function of the consumption of *all other* goods.    This is important because what it means is that the only way to increase your utility is for prices to fall for some goods relative to others (or all together!)  \n\n\nSo an economy needs to *grow* to prevent deflation, overcome depreciation and improve people's welfare.",
            "title_similarity": "0.7327856"
        },
        {
            "id": "i4sy3n7",
            "score": 4,
            "text": "To echo what others have said, but look at it slightly differently.\n\nEvery person needs certain stuff to survive. So the economy needs to produce enough of that \"stuff\" for that to happen, or people start to suffer. Since the population is growing, then the economy needs to produce more stuff.\n\nIf the population starts declining, then it will need to produce less stuff. This is actually a problem in some countries right now. Their populations are starting to age and also experience slower growth, or decline. So their economy is in peril of following along with it.\n\nA healthy economy (making sure people's needs are met along with a reasonable subset of their desires) means that people will make more people. Odds are they'll be healthy, and we as a race will be able to continue to strive towards whatever our purpose is on this planet. This idea is up for debate, but we've already been through periods where those needs are not met for all people, and it's not a good time for most of the people involved.",
            "title_similarity": "0.76268053"
        },
        {
            "id": "i4uqeo2",
            "score": 4,
            "text": "It’s because the economy is built on a series of contracts, many of which require interest payments. The more you burden an economy with interest, the more likely it is to need growth to satisfy those contracts. The modern economy is built on a house of cards that is debt.\n\nEdit: to clarify, it is not necessarily the case that interest requires an expansion of the economy, just that that is one of the ways to address interest and oftentimes it results in the necessity to expand the economy",
            "title_similarity": "0.7081853"
        },
        {
            "id": "i4vnmdr",
            "score": 2,
            "text": "Because the the rich get richer.  It is most important that the rich continue to increase their wealth, and a growing economy does that.  The rich control the world, the messaging, you and me.",
            "title_similarity": "0.62242776"
        },
        {
            "id": "i4tbxdo",
            "score": 4,
            "text": "The amount of value in an economy isn't fixed. It can be destroyed or created. An increasing economy implies creation of value, which implies innovation. And while economic growth isn't directly linked to better living conditions, like it used to be. But the innovation is still linked to better living conditions.\n\nBut yeah as I say it hasn't been that coupled for a while. That's why some people are arguing that we should now be focusing on other metrics that better correlate to living conditions. E.g. would it be bad if the renewables sector wasn't growing year on year? Yeah it'd be a fucking disaster. But would it be a disaster if the fossil fuels sector was shrinking, but the renewables growing, making the overall energy sector stagnant? No, you could easily argue that's far better than an energy sector that's overall growing, but only because of fossil fuels.\n\nWe absolutely want economic growth. Because again it does mean there's innovation in some ways. But I think we should now instead be basing success on more specific areas of the economy. E.g. if the pharmaceuticals industry grew because of new opioids, would that be a good thing? Hell no. If it grew because of a cure for HIV and better cancer treatments would that be a good thing? Hell yeah.",
            "title_similarity": "0.8132736"
        },
        {
            "id": "i4vobp5",
            "score": 6,
            "text": "It shouldn't matter. If the economy shrunk but wealth was distributed more fairly the world would be a better place. The problem is that our society isn't built that way and everyone just cares about gdp growth, even if the extra is all held by 10 people.",
            "title_similarity": "0.7657234"
        },
        {
            "id": "i4t4hdz",
            "score": 103,
            "text": "In addition to the very important economic factors, there’s also an element of the social contract that comes into play: things are expected to get better in the long run. People get up and go to work every day with the tacit understanding that they’re working towards a more prosperous world. Very few people are satisfied enough with the status of their lives to be enthused by the promise of stagnation.",
            "title_similarity": "0.7246461"
        },
        {
            "id": "i4t0a8a",
            "score": 14,
            "text": "Even with a stable population the economy grows as production becomes more efficient, through technological and other advances. At this stage people can have more and more luxury items - luxury being things they don't 'need' to survive, but things they still want to have. So, more people can get the latest model of x, can take more/better holidays etc etc.\n\nIf people stopped wanting things beyond their current level of consumption then a balance could be reached, but people generally get used to what they have, and then want more. And capitalist media/societal setup encourages this.",
            "title_similarity": "0.6710044"
        },
        {
            "id": "i4suhfq",
            "score": 11365,
            "text": "Well, the question will be addressed in the future, because some countries are already experiencing population decline. The growth of an economy should, at least notionally, reflect the growth of it's population - the people. A non-growing economy when population (especially working population) is growing is a pretty bad thing.\n\nJust think of it this way, forget the economy at large and think about food. If food production remains steady and population doubles - that cannot, in general, be a good thing.\n\nThe challenge of economic management, technology and production is to meet the needs of the people and not to \"achieve\" certain measures. The measures are what is used to give a broad indications to allow some time for policies and resource allocations to adjust - but the measure isn't the end goal, it is a means to an end. The goal is the welfare of the populace.",
            "title_similarity": "0.8500931"
        },
        {
            "id": "i4t38y1",
            "score": 1,
            "text": "Imagine running on a treadmill that is wired up to speed up when you speed up and slow down when you speed down, but not straight away. You need to not fall off the treadmill, which means the main thing is to make sure you speed up and slow down gradually. Although the treadmill is pretty good at getting up to speed if you go fast. But because of its momentum it is less good at slowing down. So if you slow down or stop entirely it is quite likely that you will fall off the treadmill before it slows down or stops itself. And yes in theory you could carefully and gradually slow down to the point where both you and the treadmill are safely stopped, but in practice that's very hard and dangerous to do, whereas just going faster is easier, and so the natural tendency is just to go faster and faster and faster.\n\nOh also we give people prizes for going fast. In fact we organise our society so that the people making us go the fastest have the most power. So that doesn't help either.",
            "title_similarity": "0.57985926"
        },
        {
            "id": "i4t4j4b",
            "score": 1,
            "text": "You consume: You eat, you replace, you want more...\n\nTherefore production is needed. Production is growth.\n\nYear on year growth is needed, because standard of living is rising. Everyone want to eat, travel, heat, ..",
            "title_similarity": "0.6155209"
        },
        {
            "id": "i4t56ap",
            "score": 1,
            "text": "tldr\n\nit doesn't\n\nif the pop growth is exceeded by gdp growth then it's producing excess which becomes wealth.\n\nif the pop growth exceeds gdp growth then it's a recession\n\ncurrently most nations don't know how to handle negative pop growth so they just assume it will be bad.",
            "title_similarity": "0.7642185"
        },
        {
            "id": "i4t5ww9",
            "score": 1,
            "text": "The Embeded Growth Obligation; Eric Weinstein. \n\nhttps://theportal.wiki/wiki/Embedded\\_Growth\\_Obligation",
            "title_similarity": "0.40101996"
        },
        {
            "id": "i4t64xf",
            "score": 1,
            "text": "Simple. Because if you don't grow you shrink. The same rules applies to you. If you don't develop yourself you take steps back as the world moves on.",
            "title_similarity": "0.5047386"
        },
        {
            "id": "i4t65we",
            "score": 1,
            "text": "This question is based  on a wrong assumption. Unlimited growth is impossible in a limited system.",
            "title_similarity": "0.5203705"
        },
        {
            "id": "i4t7kf8",
            "score": 1,
            "text": "Imagine what has to happen to a society for a whole year to go by in which nobody comes up with anything new, nobody improves on any existing process, and nobody discovers how to make anything even a little more efficient.",
            "title_similarity": "0.6187904"
        },
        {
            "id": "i4t7y8i",
            "score": 1,
            "text": "The economy needs constant growth or the infrastructure and the bills that are behind it catch up to the cost and there isn't enough for the future planning. It's one of the same issues we're experiencing in the US. We have our priorities stretched so thin, that there won't be enough support (for things we do actually have), to continue. So as we are rapidly approaching a tipping point for a possible gain in the economy to be turned into a loss. We have to work on moving forward. It's possible to get ahead of the curb and make sure we can pay back what is owed. But we've dug ourselves into a hole that requires finessing to get out of.",
            "title_similarity": "0.800526"
        },
        {
            "id": "i4t80n1",
            "score": 1,
            "text": "The need to pay off the interest of debt. Economies need to grow at a rate of interest + inflation to ensure that they can service their debt obligations. To do this they will need to continually grow.",
            "title_similarity": "0.7138924"
        },
        {
            "id": "i4t8dnn",
            "score": 1,
            "text": "To give a better answer, it is best to refine your original question first.\n- Do you mean the gross income of a country?\n- The income per capita (how much an individual earns)\n- The revenue of businesses\n\nThe answer to the first questions is mostly simple, when the population of a country increases, you want the gross income (tax revenue) to increase as well. If this doesn't happen that means people are earning less on average. In modern economy businesses also contribute greatly, but thus is why we split them, since they have different driving factors.\nThe opposite could also be true, where a country sees a massive population influx, in which the gross income goes up, but the income per person goes down. This can be a pointer to a country having bad education or infrastructure. So here an \"increase in economy\" is not a desired effect even though you potentially increase your workforce.\n\nRegarding income per capita  the metric that is used as an indicator for a countries wealth.\nNoone willingly wants to be able to buy less than they were able to in the past, so the aim is for the economy to either stay the same or grow. The former has an inherent problem named inflation, let's get back to that in a bit\n\nBusiness are a beast of their own, and they are mostly driven by two different factors.\nStakeholders and business models. \nStakeholders simply want a profit margin on their investment, it is honestly as simple as that. To accomplish that the business in question has to grow.\nFor the other factor around the 60's iirc there has been a  widely used but mostly arbitrary  3% 'growth' that any business at least needs to be successful.\nNow any dmall business owner who I.e. owns a shop or a bakery might be satisfied with owning that one shop for the rest of its lifetime and the same amount of employees. However this is rarely the case, and the aims are often directed at expansion of the business.\nThis is just purely human ambition and dreams.\n\nNow to pack this all together we come to inflation. Since the average goal of every single individual is to earn AT LEAST the same, but preferably more. We get the phenomenon inflation. Things get more expensive, because everyone is aiming to earn more, which in turn creates the desire for people to earn even more because they still want to buy at least as much things that they were able to do in the past.\n\nThis might not be the shortest answer, but I think this is the most complete answer on a relative ELI5 level",
            "title_similarity": "0.7788391"
        },
        {
            "id": "i4t9j33",
            "score": 1,
            "text": "This is an excellent question. I'd say a good ELI5 answer is impossible, because the question is unresolved and is being debated by many of the world's top economists. A key issue: what do we actually mean by economic growth, and how do we measure it? Clearly traditional metrics like GDP are so flawed that focusing exclusively on them may be directly harmful to the economy.",
            "title_similarity": "0.70024943"
        },
        {
            "id": "i4tafx3",
            "score": 1,
            "text": "To answer your questions: 1) A lack of economic growth is usually only an issue when economic growth does not keep up with population. This means that for countries with a relatively stagnant or even decreasing population(ie: Japan), a corresponding stagnation in economic growth is pretty harmless if not natural. 2) As the population grows and as human needs and wants evolve/change over time the new “equilibrium” of goods produced changes as well. Therefore the economy must change in order to account for this. 3) Proper, long-term, economic growth happens from increases in overall productivity. This is stuff like technology improving or governments investing in things like education, infrastructure, etc. The reason growth is necessary is to, ideally, achieve good living conditions for a growing population. 4) Yes, there can be a point when there is too much short-term growth. This is known as an over heated economy and, fun fact, is something that the US and many other countries are experiencing right now. While slightly counter intuitive, an economy experiencing too much short-term growth is bad because it is usually accompanied with high rates of inflation.",
            "title_similarity": "0.849944"
        },
        {
            "id": "i4tarmm",
            "score": 1,
            "text": "The US monetary system has no backing except the driving force of corporations and business. Our money is not backed on gold it is backed by the American economy and oil hence the name petro dollar. I am simplifying here and overly so as to be easily digestible. Since our money depreciates in buying power it needs to be back by the economy ergo if the economy does well the dollar depreciates less and under the right conditions - the dollar can appreciate in value.",
            "title_similarity": "0.6887874"
        },
        {
            "id": "i4tat0e",
            "score": 1,
            "text": "Let's say people are fish and economy is size of tank / amount of water:\n\n* as fishes grow bigger / have offsprings, you need to increase the size of the tank <- fulfilling basic needs\n* in general it's also good to have bigger tanks so fishes have more space to swim, put decorations (corals etc), utilites (airpumps, water filter, etc) <- increase country's wealth & residents' wellbeing",
            "title_similarity": "0.5514808"
        },
        {
            "id": "i4tbtq7",
            "score": 1,
            "text": "It's primarily because of inflation caused by the government. If the dollar inflates by 5% every year, everyone needs to increase their profits by 5% just to not get poorer.",
            "title_similarity": "0.7288808"
        },
        {
            "id": "i4tc7xs",
            "score": 1,
            "text": "GDP Gross domestic product (GDP) is the standard measure of the value added created through the production of goods and services in a country during a certain period.  We use this to suggest we are better off it goes up or is higher next year.  But it is so deceptive.  In war our GDP goes up when we make more bombs, fighter aircraft, war ships etc.  Are we better off?\nEnvironmental disasters can make the GDP go up- ex Exxon Valdez filled with bunker oil crashed off Alaska when the crew were drunk- we spent two billion to clean it up.  Were we better off even thought the GDP went up?  Or what about all the unpaid work done by women who stay at home, cook, clean and look after the children - very important tasks and yet it is not recorded in the GDP.  If we paid women to do these tasks the GDP would be huge.  We also talk about productivity as if that is important- I look at it and say we are just replacing people with machines or computers. Is this a good thing if they have no where to work?  Or now do menial jobs? So growth for growth sake is a shitty measurement IMO.",
            "title_similarity": "0.76004744"
        },
        {
            "id": "i4tdrpr",
            "score": 1,
            "text": "One word: Crime. Learn more about the underbelly of our fraudulent financial system over at r/Superstonk",
            "title_similarity": "0.42000964"
        },
        {
            "id": "i4te9q6",
            "score": 1,
            "text": "Look at it this way.  \n  \nYou work hard, you make more money as your life progress, you are able to marry, have children, send them to better schools than you had, etc. You have more money than your family potential used to be.  \n  \nNow imagine that, but the whole country.  \n  \nThat is economic growth. The country (and its people) have more money, they can sustain a more advanced the budget hungry government, and technology and socially the country progress forward.  \n  \nNow the opposite also exist.  \nPeople are only getting worse throughout the generations. Income is lower than inflation, less advance jobs, more poor people.  \nThat is the effect that happens when people say that economy is reduced.  \n  \nStagnated economy is relatively similar to economic shrinkage. There are still more people but the wealth and income is being shared by more people. So less to everyone. Or poor people just don't come out of their state, rich people stay rich, and the middle is stuck where they are.",
            "title_similarity": "0.7670567"
        },
        {
            "id": "i4tebxr",
            "score": 1,
            "text": "Lots of answers here giving an economics 101 perspective of why a well functioning economy should naturally expand over the long term, but the more immediate and deeper reason we (from politicians down to the average joe, whether they can articulate the why or not) fear economic stagnation or deflation so much is because markets inherently lead to greater and greater concentration of wealth.\n\nIn most liberal (economic, not political) economies, the share of the economic pie to the wealthiest will grow over the long run. But as long as the economic pie continues to grow in size, those experiencing a smaller and smaller share of the pie could still conceivably experience greater wealth in absolute terms, and therefore increasing standards of living. Elon Musk and Jeff Bezos might gobble up more of the Americas GDP in percentage terms next year, but as long as average Joe can buy a bigger truck or eat at better restaurants too he’s lest likely to call for a revolution - he might even support Musk and Bezos for ‘creating jobs’. \n\nIf the pie stops growing, the only way for the vast majority of people to see an increase in their quality of life (or indeed, avoid a decline, due to the tendency for wealth to concentrate) over the medium or long term is through wealth redistribution, on a scale that usually precludes peaceful means..",
            "title_similarity": "0.7972347"
        },
        {
            "id": "i4tei6j",
            "score": 1,
            "text": "It has to do with our set up:\nCountries make debt and invest in things, then this things make growth happen; example are infrastructure, research, education, social plans.\n\nWith this setup, which is healthy by the way, you need absolutely to grow. If you don’t, you will struggle to repay the debt that you made.\n\nThe problem is that investments have diminishing returns, so we invested a lot of money in future tech, but future tech pays less and less the more you advance. It’s like, if in Stone Age you make and highway, you can’t repay it as you dont actually have an economy that needs an highway. But if you build a dirt trail, the tribe may benefit enough and they cost can be covered.\n\nIn our times: your make a highway two lanes, you repay it quicker but it doesn’t boost you much, if you make a 6 lane, it’s very hard to repay but has a higher boost to local economy.\n\nThe highway is just an example, all types of investments am also work like that, tech, medical, social, they all have to strike a balance between cost and return.\n\nWhat we are facing, is that some long term investments have been made for a world that we imagined 40 years ago. Now the world isn’t exactly what we expected, so some investments can be problematic. For example, a slower growth can make the difference to be happy having built the highway or having an underused very expensive highway we regret having made.\n\nSo, we (1st world) inherited a debt intense set up, that worked for, let’s say, 40years old predictions, but growth is less than expected so we have to rush a new plan to divert, modify, and reinvent those investments to make them fit the actual world. Growth is not little, the problem is that it is geographically shifted towards the 3rd world, a lot more than predicted. So third world is struggling with “not having invested enough” and desperately needs cash to invest, first world is desperate to cut expenses to pay back the extra investments that are not paying off.",
            "title_similarity": "0.81115305"
        },
        {
            "id": "i4tfhvw",
            "score": 1,
            "text": "The economy has to grow so that we can have inflation. The governments can not afford their debt if they can’t inflate the supply of dollars and devalue the currency.",
            "title_similarity": "0.77534175"
        },
        {
            "id": "i4tgdlg",
            "score": 1,
            "text": "Easiest way to put it is if people aren’t spending the economy isn’t growing. That means things like businesses aren’t getting sales so they go out of business. Less successful businesses means less jobs and less money to spend. It can just further spiral out of control and you hit a major recession like the Great Depression. \n\nThis is tied very closely to inflation which is controlled by the federal reserve though adjusting interest rates. Higher interest rates means less borrowing and less spending to slow inflation. When spending gets too low and we start to see the economy shrink they drop interest rates to increase borrowing/spending. \n\nThe explanation of why is pretty simple, the explanation of how exactly gets really complicated",
            "title_similarity": "0.7571608"
        },
        {
            "id": "i4tgpb1",
            "score": 1,
            "text": "So Ray Dalio actually has a great video on this...https://youtu.be/PHe0bXAIuk0\n\n\nBut the simple answer is to pay off debt. Credit, or thr creation of debt, is what allows the economy to expand. It finances new homes, business, innovation, and technology. But it needs to be paid back and usually with interest. It's also important to remember creating credit is adding to the money supply. So as we create credit we add money to circulation which is the basis for inflation. In order to keep inflation from making our money worthless and bad debt from bankrupting us, we need to increase our productivity. The increase in productivity allows us to grow the economy, pay our debts, and take on new ones. This happens in a cycle over and over again.",
            "title_similarity": "0.6671529"
        },
        {
            "id": "i4thnyr",
            "score": 1,
            "text": "Jelmer Mommers has an interesting book called \"How are we going to explain this\" which focusses a lot on the environmental Sustainability of our planet. In this book he has a chapter dedicated to economical growth and how we as a society should neglect this number and instead focus on other aspects to show how countries are developing. Some countries have already stopped using the economy as an indicator.",
            "title_similarity": "0.62782156"
        },
        {
            "id": "i4ti5sp",
            "score": 1,
            "text": "You can't really use the official measures of the economy. They just count how many dollars were spent. And when you have a debt ridden government and insane printing of paper money by the banks and the federal reserve those numbers become delusional. \nThe real growth of an economy is how many toasters you manufacture per person. The greater the number per person the great the quality of life we all receive.",
            "title_similarity": "0.72045857"
        },
        {
            "id": "i4tif15",
            "score": 1,
            "text": "If economic growth went to zero it means that there’s no new jobs for kids graduating. It would also mean that many people lose their jobs, since companies won’t be investing in offices and equipment to grow, so the people who build offices and equipment would lose their jobs, too.\n\nA healthy economy will, on average, grow at a rate that is a bit faster than population growth. This means that most people can get jobs and that everyone will get richer over time.\n\nAll this growth comes from a two places: people and investment. \n\nMore people means we can make more stuff, so the economy grows.\n\nInvestment in technology allows us to use resources more efficiently, so we can get more output from the same resource input (e.g. electric cars). \n\nInvestment in education means that people can work more efficiently and we get more output from the same input (e.g. medical doctor vs a witch doctor)\n\nInvestment in buildings and equipment also lets us work more efficiently (e.g. farming with a tractor).\n\nSo even if we don’t consume more resources and our population isn’t growing, we would expect ongoing investment in R&D, education, and equipment to drive growth in the economy.\n\nThe opposite is also true: if we didn’t invest in these things then we could get no growth. This was sort of how things were in the dark ages, which is generally agreed to be not a very fun period of time.\n\nBut we can have too much growth (and it’s all happening today!).\n\nIn the long run, if we grow the economy at the expense of our environment (consuming non-renewable resources, damaging the environment for future generations) then growth today comes at the cost of growth tomorrow, which future generations would probably view as bad.\n\nGrowth can also be bad in the short run. When all this investment does the future is happening, we can get to a situation where the amount of stuff we want to build and people we want to educate etc. exceeds our ability to do so. This happens because we have only so many people and so much equipment and when they’re all employed then costs will rise as employers compete to try and get workers and equipment.\n\nThis sounds pretty good but what’s happening is prices are rising without any increase in output, folks are just paying more for the same stuff. This is called inflation, and it’s viewed as bad because you get into this vicious cycle of wages rising and so companies out up prices so workers demand raises. This cycle has a tendency to accelerate and all of a sudden a dollar today is worth much less in a month’s time, and it’s just very hard to operate in that kind of environment.\n\nThat’s why you hear “the fed lifting interest rates”, which is happening right now. We are seeing high inflation, meaning that stuff is getting more expensive, so they will raise interest rates, which will reduce investment, reducing demand for equipment and workers, and halting the rising prices that we’re seeing. Or at least that’s the theory.",
            "title_similarity": "0.7911759"
        },
        {
            "id": "i4tipc6",
            "score": 1,
            "text": "Economics studies three things: *what* is produced, *how* it is produced, and *who* gets what is produced.  When you state it like this, it looks more like a moral/philosophical question than a practical one, and in the early days of economics the subject was very much considered a branch of moral philosophy.  \n\nSo economic growth just means that more things (both goods and services) are being produced.  And in the abstract, this is good, because there are people who want things (food, shelter, and so on) who don't have them.  Some things are more essential than others, of course, but by and large people will always want more goods and services of one sort or another.  Economic growth means that more of these wants are being met over time.\n\nIt's important to add that although generally in the West we enjoy a high standard of living, there are still huge portions of our own population who don't have adequate incomes or the goods and services we would consider basic requirements such as food and housing.  That is multiplied tenfold for populations in poorer countries.\n\nThis is the basic rationale for why we should have economic growth.  Of course there is lots to say about specific cases when growth is harmful and how the harm from economic activity should be managed, and indeed how economies as a whole could and should be managed.",
            "title_similarity": "0.7350716"
        },
        {
            "id": "i4tiuvm",
            "score": 1,
            "text": "Mostly because without labor shortages, capital pressure wages downwards, and then the economy goes into a death spiral where lower wages means fewer things and services being bought, meaning fewer wages being paid..",
            "title_similarity": "0.673975"
        },
        {
            "id": "i4tk2r3",
            "score": 1,
            "text": "Leverage. People leverage their current position, betting on future growth, to make more and more money. Its always grown so this should always be safe right? Have enough institutions thinking like this and thats how you get a crash.",
            "title_similarity": "0.684706"
        },
        {
            "id": "i4tkabm",
            "score": 1,
            "text": "You have heard about pyramid schemes? Where people at the top make money by getting other people to join in and pay them, and people below do the same with other people and so on? These fail because at some point you run out of people to take into the scheme; maybe because they don’t want to or eventually because you would run out of people who are not already part of the scheme.\n\nWell, the modern economy is essentially like that. The only difference why it mostly, kinda works, is because the economy grows, so you grow the pyramid. There are mostly three ways this happens: get new money into the scheme through conquest or foreign exploitation (harder to do today), increasing the population and increasing productivity (mostly through new technology).\n\nIf the economy stops growing, then the scheme would fail, just like any other pyramid scheme.",
            "title_similarity": "0.78032106"
        },
        {
            "id": "i4tkb17",
            "score": 1,
            "text": "If the economy doesn't grow, it will eventually stagnate.\n\nThis is serfdom was - the economy only grew at the rate of population growth, so as a result people's children had exactly the same life their parents did.\n\nGrowth allowed per person income to grow out of this trap, and as long as economic growth is greater than population growth, this will continue.  We don't need infinite growth, but we do need the economy to growth at least faster than population does, just to keep the per person income even.\n\nIf the economy fails to keep up with population growth, then people get poorer on average.  Now add in inequality, and we kind of need a bit more \"margin\" of growth to make sure more people are experiencing gains in their lifestyle.\n\nSometimes this isn't just higher income, but cheaper more capable (more efficient) goods (e.g. a phone that's $1000 in 2022, is faster, has a better camera, etc., than a $1000 phone from 2018, for example, even if the cost is the same).",
            "title_similarity": "0.81975436"
        },
        {
            "id": "i4tlq76",
            "score": 1,
            "text": "Because of the aged pension.\n\nThe aged pension is an implicit agreement upon birth that beyond an agreed upon age people have contributed enough to a society and can be awarded a portion of the societies production for no input.",
            "title_similarity": "0.54411626"
        },
        {
            "id": "i4tlqq4",
            "score": 1,
            "text": "Because we’ve designed it to, so to speak. We measure success as growth, which has gotten us into this sustainability pickle. There is this idea of a circular economy I’ve heard of recently, where the measurement of success is zero waste, not endless growth. https://archive.ellenmacarthurfoundation.org/explore/the-circular-economy-in-detail. Endless growth is just not sustainable. We’re victims of our own success and have exceeded the carrying capacity of this planet. All problems can be traced back to too many people on the planet. Don’t like that urban sprawl?? Well, too bad, people need jobs. So we clear land to build stores and fast food places so people have a place to work. Wanting all farming to be organic and sustainable and good for the environment is great and all, but you just can’t feed the human population like that.   I have a constant war between my head and my heart. Yes, disease and death is sad and bad, but in simple ecological terms, the population of humans is out of control and nature needs to do its thing to rebalance it (aaaaand COVID-19 enters the chat lol).",
            "title_similarity": "0.6910628"
        },
        {
            "id": "i4tly1v",
            "score": 1,
            "text": "have you ever looked at a dollar and seen a pyramid on it. the pyramid symbolizes that it is a pyramid scheme.",
            "title_similarity": "0.45112318"
        },
        {
            "id": "i4tlzzt",
            "score": 1,
            "text": "It doesn't. A group of politicians get together to justify why we need them to control the human population and the relationships we have with each other to make things more fair. And the success of that is decided by GDP. \n\nThis has happened throughout history but more specifically this cycle started back in the 30s.",
            "title_similarity": "0.70880014"
        },
        {
            "id": "i4tm07t",
            "score": 1,
            "text": "If your population is growing at any rate you want to make sure the new people can get jobs and buy the things they need/want.  With zero growth the new folks reaching working age would have to wait for someone to retire but with current technology trends, there may be fewer jobs anyways.  This is why some folks are arguing that we may have to pay our population a base wage just for being a citizen.  At least this way there are still consumers.",
            "title_similarity": "0.77201176"
        },
        {
            "id": "i4tmet5",
            "score": 1,
            "text": "True ELI5: \n\nIt's not that things HAVE to grow. It's that shrinking is very, very bad, and hard to stop. No one has any good ideas for how to stop shrinking, so we avoid it by focusing on growing. \n\nAdult ELI5:\n\nConstant growth isn't the issue. Deflation is. Deflation creates a downward cycle that we don't have a really solid and reliable economics theory/model to stop, so we primarily prevent it by focusing on growth.\n\nIn theory, you could break even each year and be fine, but in practice that's hard to impossible to do. You're always going to go up or down at least a little, and since even a little going down can snowball, you prevent it by always erring on the side of up. And if you're going to err on the side of up...why not be as safe as possible?",
            "title_similarity": "0.7505001"
        },
        {
            "id": "i4tmge8",
            "score": 1,
            "text": "If we look to nature, we can see that anything that grows too big, dies. It cannot support itself at some point, and collapses. Yet we seem to think “the economy” is somehow exempt from this basic truth.",
            "title_similarity": "0.55440855"
        },
        {
            "id": "i4tmowj",
            "score": 1,
            "text": "It's necessary so that the 1% keeps redistributing the 99%'s wealth to itself. Balance has less to do with goods/services consumed and more with profit margins to be made so wealth can be transferred. If it doesn't turn up profit, it gets destroyed, no matter what it is: product (food, clothing), technology (solar power or planned obsolescence) or human capital (wars). \n\nThe funny thing is that the nearer people are to the 1%, the prouder they are about facilitating this transaction, and calling it good (or progress) but they're just middlemen. True progress is beneficial and mostly noticed by the lowest tier of society, otherwise it's just an illusion to exploit them. (Think of MLMs)",
            "title_similarity": "0.70738167"
        },
        {
            "id": "i4tmp5x",
            "score": 1,
            "text": "Its systemic. Growth compensates for eroding systems like dept increase, destabilizing financial systems, inflation, increasing volatilities, failing pension systems, failing healthcare systems, increasing resource sparsity, increasing pollotion, …\nWe are seeing the first finite size effects now meaning that we are reaching a point where this compensation mechanism will not wirk anymore.",
            "title_similarity": "0.7367784"
        },
        {
            "id": "i4tmyul",
            "score": 1,
            "text": "Because we have been slightly ponzi scheming the debt in our country at a controlled rate for decades and decades contingent upon continued population and economic growth.  Works fine until it doesn't.\n\nIf that slows down it will put a huge stress on whatever generation or two happens to bear the brunt of that debt if the population/economy doesn't continue it's climb upwards.",
            "title_similarity": "0.82414216"
        },
        {
            "id": "i4to73e",
            "score": 1,
            "text": "Because my retired father wants to have his savings padded so we can continue to pay for his golf club memberships and hang out with Chip and Chad without any worries.",
            "title_similarity": "0.47993436"
        },
        {
            "id": "i4to7wn",
            "score": 1,
            "text": "In the most basic sense economic growth means there's more goods and services available which leads to an increased standard of living. When you look at GDP per Capita countries that rank higher always have a higher standard of living, for example poverty in America would be considered very wealthy when compared to poverty in Africa or some south American countries. When economic growth declines that means there's less goods and services available in the economy per Capita leading to the inevitable increase in costs and a decrease in the availability of goods and services. It is basically impossible to prevent standard of living decline when the economy shrinks. Population decline or work force participation rate decline will also cause a similar thing to happen.",
            "title_similarity": "0.78487563"
        },
        {
            "id": "i4torl0",
            "score": 1,
            "text": "It's the mother of all ponzi schemes. That growth is assumed to be desirable is one of the bedrock assumptions of modern society. People are in for a rude awakening as most countries are at a demographic cliff. In a world with declining population and climate change woes, growth is neither assured nor even desirable.  Indeed, unchecked growth within organisms is commonly called \"cancer\".",
            "title_similarity": "0.6721785"
        },
        {
            "id": "i4tp0j4",
            "score": 1,
            "text": "Basically supply and demand. \nIf the economy doesn't grow and people keep replicating themselves without the economy growing (housing/food..etc) then inflation goes up to curb unnecessary spending but the little people feel it the most! \nIf the economy crashes the least affected are the rich and wealthy as they have enough wealth do diversify their interests and and stay afloat while the middle class and below suffer.\nIt starts with a housing crises then mass unemployment so the rich can cut their losses and ends in the extremes at food shortages and revolution and restructuring of the economy.\n\nWhile the latter stages are extreme if we keep printing money the way humanity is and living beyong our populous means then we will inevitably burst this bubble we are in.\n\nSolutions are there but the top 1% don't want it and they govern the governments. Wealth redistribution through higher taxes to the super wealthy and closing loopholes is one step. The other is to stop lobbying which is a fancy legal term for pure corruption. \n\nDo i think it will change? Nope.\n\nEconomic rant over",
            "title_similarity": "0.771277"
        },
        {
            "id": "i4tp4le",
            "score": 1,
            "text": "Economic growth is linked with inflation, i.e. increase in prices. Increase in prices (2% YoY) is necessary as an incentive for increased productivity and innovation.",
            "title_similarity": "0.699848"
        },
        {
            "id": "i4tp4m5",
            "score": 1,
            "text": "It doesn’t. The whole concept of perpetual growth is an unsustainable metric we use because the capitalist machine has spread wide and large around the globe. GDP is a measure of how much an economy produces each year, but there are other measures like poverty rates, wage growth, expressed quality of life, etc that are much better metrics that many eco-economists encourage us to shift to measure economic well-being",
            "title_similarity": "0.80143094"
        },
        {
            "id": "i4tpyaa",
            "score": 1,
            "text": "I think you're mischaracterizing his answer (not on purpose though). He's building intuition on *why* inequality in wealth is *natural* in a specific sense, not that it is a good thing not desirable outcome.\nOne is a positive statement ( a description of reality) and the second a normative one.",
            "title_similarity": "0.5711961"
        },
        {
            "id": "i4tqalm",
            "score": 1,
            "text": "Without growth, the banking system is a ponzi scheme. Everyone needs to trust that there will be more money later.",
            "title_similarity": "0.6609285"
        },
        {
            "id": "i4tqbpq",
            "score": 1,
            "text": "The answer is really simple really. Our economic growth is funded with debt. The economy needs to grow so we can pat back the debts. If debts don't get paid back, companies and people go bankrupt, which causes others to do the same. Cash liquidity dries up, and we go into a depression. \n\nThe other reason is that population I still growing, so there needs to be work for these new people, otherwise poverty and all the problems that go with it will grow.",
            "title_similarity": "0.7468637"
        },
        {
            "id": "i4tqdbb",
            "score": 1,
            "text": "Imagine you invented widgets and build them in your garage.  You make them with a few simple tools and a little bit of start up capitol.  You can charge whatever someone will pay for a widget.  Your rate of retirement en is good, but your capitalization is small. \n\nFast forward twenty years.  Widgets are a global phenomenon.  Factories and mega corporations in many countries are mass producing widgets.  You need to invest in factories and machinery to make a widget business.  The price is driven low because customers can buy a cheap import instead of a domestic hand crafted widget. The rate of return is lower even though many more widgets are being made, due to market saturation and technology.\n\nThis is why simple commodities and raw materials businesses have lower margins and higher startup costs than businesses that sell services or finished goods.  As technology and economic growth advance, the opportunities for profit are less.  If you want to make a widget business in your garage now, you most likely can't.   Your margins are too low for anything short of a mega factory to be profitable\n\nImagine now you are heir to a wealthy family that has lived off of profit from your investments for generations or a billionaire entrepreneur whose business has plateaued.  You need to either increase your return or accurate more wealth to maintain the same wealth relative to the peasants.  So you either try to open up new markets, by for instance opening up closed economies abroad or starting mining or manufacturing operations int he third world where none existed.  Or you can try to push into the newest technology where returns are good, but this requires a new product to be created and new people to buy it.  Either way, the economy has to grow.  \n\nTldr; Gains from growth in a capitalist economy accrue to the top, because interest is hard to find but easier if you already have a lot of money. So if the economic growth were to slow, the rest of society would over time close the gap with the rich, so they push policies designed to force economic growth at the expense of all else.",
            "title_similarity": "0.68328124"
        },
        {
            "id": "i4tqg4m",
            "score": 1,
            "text": "Zero growth is not possible, it’s a theoretical idea. There will always be a surplus of goods and services or a shortage of goods and services but never just enough. To have enough resources would go against the economic idea of scarcity.\n\nGrowth comes from demand. Too much growth is a bad thing because it causes inflation. We’re seeing the affects of that now. Supply chain issues increase price because time to market changes. A great example is a port, if shipping containers are sitting in a port waiting to be shipped, they will cost more as they are paying for space at the port.\n\nToo much growth can cause very high inflation and is curbed by reducing the money supply and increasing interest rates. Reducing growth gives the economy a chance to cool off and catch up.",
            "title_similarity": "0.77065456"
        },
        {
            "id": "i4tqpgn",
            "score": 1,
            "text": "I spend a lot of time thinking about this, as I work in the very long term investment business so at least hear me (and my generally dissenting opinion) out. Apologies in advance for typos (on mobile) and a sporatic thought process (it’s 6am)\n\nIt’s **not**a disaster, we just tend to think of it as one. Long term, negative growth will become the norm.  However, none of our schools of economics account for this because we’re only now entering an era where it’s possible to see this far in the future. \n\nTo start, we measure growth in terms of GDP growth. Formulaically,  GDP = C+I+G+X. Where:\n\nC = consumer spending\nI = private investment\nG = government spending\nX = Net exports (exports minus imports)\n\nAs an aside (that still serves as a good lead in), there’s inherently a problem in government spending being part of this equation, as elected & unelected officials can boost the economy’s growth by giving themselves an undeserved raise. Where do the funds come from? First taxes, then debt… (mostly debt).\n\nInflation is tied to growth in many ways. The basic concept of inflation is that a dollar today is worth more than a dollar tomorrow. 2% inflation (the fed’s target rate) means a dollar today is worth $0.98 in a year.\n\nThe basic principle behind deficit spending and targeting of a low, but positive inflation rate is that we borrow money today, to fund projects, and repay that debt (often over 30 years) with dollars that are worth less each year into the future. Since this is an ELI5, I won’t get into the math of it, but even at a 2% inflation rate over 30 years the *true*repayment amount (in terms of a dollar’s value today) is pretty significantly discounted, most notably when the entirety of the principle is paid at the end of the period and only interest is paid during the life of the debt (pretty much every bond). Thus, the use of debt is essentially a cheat code to grow the economy today at a cost we pay back later. With succesful allocation of that investment, the return will far exceed the cost.\n\nWe view growth as a positive thing because, (hot take); *up until recently*, a growing economy means job growth, and (hopefully) wage growth. If everyone is employed and their wages are growing (at a rate exceeding inflation) then the standard of living must rise with it. We spend and or invest more, and grow GDP, in a positive feedback loop. \n\nThe difficult thing to extrapolate from our simplistic measure of GDP is the cannabalistic nature of capitalist markets. I say capitalistic, because one of the basic premises of capitalism is that if you can do something better, or cheaper than your competition, your business will grow, and outpace the competition. In other economic systems, better models of business or production can essentially be shut down, in order to protect a worse model for any number of reasons, like protecting jobs, but this obviously leads to worse outcomes long term, as innovation is supressed. \n\nThe cannabalism comes when one business model far outclasses another to achieve the same goal. As the upstart, better business model grows, it comes at the cost of the death of it’s competitors (and all the jobs they provide), while requiring less resources to do so. \n\n**This is where things get a little weird and the “growth is good” narrative flips**\n\nThe older, less efficient business has to downsize to continue to operate, so people lose jobs, while the small upstart company, operating more efficiently, has no need to hire at an equal rate, leaving workers displaced. Maintaining job growth becomes difficult when a business that needed 10,000 employees can be replaced by one that only needs 100. But since profit is the goal of nearly every business, there’s no need to charge much less than the competition you just ran out of town, and once that happens companies can actually raise their price when they reach monoploy status. \n\nWe’re entering an era where we’ll face huge deflationary pressure from technology. Currently we’re in a transitory phase as the pain of labor displacement hasn’t yet reached a breaking point. The result is that all the benefits of the implementation of technology are currently accruing to those who realized the the scalability of technology, invested in it, and were lucky to be in the right place at the right time… i.e. tech billionaires.  \n\nTry to think of the “end game” power of different technologies. Car production lines that don’t require labor, except to program and service machines that build cars. The leaps in agriculture we’ve already seen where a handful of farmer’s production is greater than the production of thousands 200 years ago. Software that could remove the need for nearly every function of white collar labor (accountants, finance, HR, marketing).  Each of these functions have very different life spans,  but once AI reaches a point where it can make better decisions, faster, than the people in those roles, there won’t be a need to employ those people anymore.\n\nThis is how technology is deflationary (makes things cheaper). The cost to businesses to do…. Well, literally everything, is becoming cheaper because of the scalability of tech, specifically software and AI. This is why people in silicon valley view it as an inevitability that in the future, the only jobs will be developing software. If all job functions can be performed by machines or software, then all we’ll need to to do is write the software and program the machines to do those jobs, or program machines to build and maintain those machines. \n\nWhen will the deflationary effect of technology *actually* be realized, rather than the value of all the cost savings accruing to a few smart but extremely lucky few? It’s already becoming a meme… when there’s no consumers left to buy any products because we’ve all lost our jobs to tech. Except there (likely) won’t be a single breaking point. Instead it’ll be like we’re collectively being boiled by slowly raising the temperature of the water until we’re dead in the water. The only way to avoid this is to accept that negative growth and deflation aren’t actually bad things, but rather, inevitabilities; and to try to develop economic, business, and re-skilling programs that account for this future. \n\nTL,DR: we think growth is good because it always has been. Tech flips the script and creates negative growth due to cannabalistic nature of markets.",
            "title_similarity": "0.6825615"
        },
        {
            "id": "i4tqxrm",
            "score": 1,
            "text": "This is a great question, and it's definitely among the topics Reddit's average user is most uninformed about.  Nearly every highly upvoted answer is completely wrong, perpetuates myths, backed my misinformation and pseudoscience.\n\n* No, the economy does not require growth to \"succeed\". \n* Growth comes from progress.  Someone invents a machine or technology that benefits us more than the previous approach it replaced.  Life improves.\n* There's no such thing as too much growth, unless you think that human progress and prosperity could reach a point of \"too much prosperity\".",
            "title_similarity": "0.6902243"
        },
        {
            "id": "i4tr74a",
            "score": 1,
            "text": "Back in the 1960's the wife would stay home and the husband would work, and they could afford a nice life. A single family home. A car.\n\nNow the wife goes to work too.. so they must have so much money to be able to do so many things... but they don't? It turns out housing just doubled in price and now she works for basically nothing. \n\nThere are elements of the economy that are zero sum, and when we get more productive, those things go up in value, and the people who can't send their wife to work are the ones that lose out.\n\nIt turns out that this was predicted by a man named Henry George.\n\n>  If there is less deep poverty in San Fran Francisco than in New York, is it not because San Francisco is yet behind new York in all that both cities are striving for? When San Francisco reaches the point where New York now is, who can doubt that there will also be ragged and barefooted children on her streets? - Henry George, 142 years ago\n\n\n He wrote an entire book on this - Progress and Poverty. Here's a nice summary - https://astralcodexten.substack.com/p/your-book-review-progress-and-poverty",
            "title_similarity": "0.6950035"
        },
        {
            "id": "i4trigx",
            "score": 1,
            "text": "Because our system is a house of cards that depends on growth.  If we re-oriented for sustainability the entire system would collapse. \n\nRemember that 2% growth per year isn’t linear, it’s exponential.  It is by definition unsustainable, but somehow required to prevent collapse.",
            "title_similarity": "0.8316203"
        },
        {
            "id": "i4trj3s",
            "score": 1,
            "text": "If the economy doesn't \"get bigger\", the wealthy people stop making making as much money.\n\nThey hate that.",
            "title_similarity": "0.7010462"
        },
        {
            "id": "i4tsqqu",
            "score": 1,
            "text": "The economy has to grow in order to be healthy because economists have defined growth as a metric of health, and have set the \"interest of the shareholders\", i.e. return on investment, as the principal responsibility of a corporation. This leads to all kinds of negative unintended consequences. For starters, growth always has limits, so businesses, and therefore the \"economy\", is in a constant struggle against the natural limits to growth. The food industry, for example, can only *naturally* grow to the point that everyone is fed what they need in order to be healthy. But the food industry *is supposed to grow*, as per our economy's definition of success, so it runs into what Michael Pollan calls the \"fixed stomach problem.\" To grow the industry, people have to eat more than is healthy. How do you do that? Add more and more addictive ingredients, like sugar, fat, and MSG, and employ manipulative branding. \n\nTo add to that, the need for companies to increase the value of their stock means that its perceived value is attached to the public expectation that the value will increase over time. Is this a company that is going to continue to grow if I buy a bit of it now? If so, I'll get more money, so I value this stock more than some other. So the stock market is intrinsically speculative, with the value of a share largely detached from the *current* value of the company. That means that if the company fails to grow, it will lose speculative value. Once it's speculative value is gone, speculators sell, and the stock price goes down. Since providing shareholders a return is the official duty of a company in our current system, this is a high economic crime.\n\nI would argue that our economy is a bit of a cancerous arrangement, and cancers have to grow to be healthy *themselves*, but that growth is far from healthy for the rest of us.\n\nOn the flip side, *the* economy isn't the *only possible* economy. We could conceivably arrange things so that the health of the economy corresponds to the health of society. But we haven't done it yet.",
            "title_similarity": "0.73741835"
        },
        {
            "id": "i4tsqxh",
            "score": 1,
            "text": "Isn't capitalism built on unrestricted and continual growth?",
            "title_similarity": "0.63748693"
        },
        {
            "id": "i4ttfit",
            "score": 1,
            "text": "To make returns on investments. If the economy stops growing, capital owners will either invest in other countries or not invest at all. If they stop investing, people won't be getting paychecks, then they stop purchasing, and then there's less places that will give capital owners return on investment. If you ever wonder why recessions and depressions happen without real tangible reasons, besides systematic dysfunction, now you know why.",
            "title_similarity": "0.7818769"
        },
        {
            "id": "i4ttn9m",
            "score": 1,
            "text": "Economies want to grow because populations grow. If your population grows but your economy does not, then the standard of living drops (well, kind of - it is a good ballpark but resource allocation matters, not just total resources). If your population is stable, then a growing economy means that the standard of living is going up. \n\nIn general though for our world to be sustainable and not fizzle out in a century we have to figure out ways to do more with less - to maintain our standard of living (more or less) with a lot less resources required. Eating more plants, efficient housing, less transportation and more mass transit, building stuff that lasts a long time, using a bit less stuff",
            "title_similarity": "0.7993585"
        },
        {
            "id": "i4ttr7m",
            "score": 1,
            "text": "Well, to average people \"the economy,\" doesn't matter. The media is just referring to the national GDP in that case. Since the wealthy own most of the stock market and control the large companies, GDP growth is going to the top 25% of earners, or maybe even top 10%. Real wages, in terms of purchasing power parity, have been falling for nearly 50 years in the USA, and you hear that expressed in subs like workreform or antiwork or latestagecapitalism. And you're finally seeing some wage growth which is trickling down to minimum wage type jobs. \n\n  \n\nThe media and the government have fixated on GDP and the stock market for so long that it's just generally accepted that this is a good measure of success. Lazy economists would agree. One has to become a bit of a philosopher to know which measure to use - why do we want our democratic country to be wealthy, other than for as many people as possible to enjoy greater wealth? If only 1 person benefited from that greater wealth, would that be good enough? 10? 10,000? 1 million? 10M? Myself, I think that number should be 100M households benefiting from a growing economy a country of 330 million.",
            "title_similarity": "0.7109536"
        },
        {
            "id": "i4tu5fj",
            "score": 1,
            "text": "Businesses require that people be willing to invest money in them or lend money to them. If the economy is not growing, this means that on average people are not getting any reward for investing and lending, so there is no reason for them to bother to do this. If the economy is getting smaller, that means that on average people are getting less reward than they put in, and would be better off keeping their money and not doing anything with it, or stuffing it in a mattress. Since businesses need investment and loans, negative economic growth means that eventually many businesses will fail. Since those businesses provide jobs and taxes, this is bad for everyone.\n\nAlso, governments need those investors. Most governments pay off their debts by taking out new loans to pay off the old ones. A man named Keynes showed people that this is less stupid than it sounds, but it only works if lots of people are willing to lend the government money. If it’s smarter to use the mattress option, the government will default on its loans and not be able to pay for schools or roads.\n\nBasically, Capitalism is an economic system in which all major institutions are working to be more appealing than a mattress to people with disposable income.",
            "title_similarity": "0.71105325"
        },
        {
            "id": "i4tu5hu",
            "score": 1,
            "text": "An exploited workforce which spends almost its entire disposable income every month.\n\nThe poor and impoverished keep the wheel turning. The wealthy fucking hoard their funds instead of spending it because they can live without spending every last penny they have every month.",
            "title_similarity": "0.7005786"
        },
        {
            "id": "i4tuy6g",
            "score": 1,
            "text": "Economic growth is not necessary. The reason that this concept even exists is bcs of the stock market. Also to all the people saying economic growth is an indication of improved “operational efficiencies” what you actually mean is underpaying and overworking staff just a little more each year so that it LOOKS like there is growth. If COVID didn’t prove to you that the stock market is a fucking sham then your drinking the coolade",
            "title_similarity": "0.7917565"
        },
        {
            "id": "i4tvf5s",
            "score": 1,
            "text": "It's not a disaster in principle, it could very well be 0 growth. In fact there's been many arguments for just that, see \"Prosperity without growth\" a book on this.\n\nThe main reason is debt. With countries increasingly in debt, and not stopping to borrow, debt keeps increasing. If the economy doesn't grow at the same rate, to debt keeps accumulating and an increasing share of our taxes go to service debt. If the economy is growing, then debt is much more manageable. \n\nThink credit card debt. If you keep getting more and more debt but your salary increases, it's no big deal. But if your salary is stagnant, all of a sudden you need to cut down on your Sunday brunch, or one evening of drinks with friends, a date with your gf, the gym membership, ... All of that sounds very manageable, but when people get used to a certain lifestyle it's actually hard.\n\nSame with governments - Every cut in the budget, say not maintaining the infrastructure appropriately, is painful. And the argument that there's countries without that infrastructure to begin with won't fly with an angry population. (Rightly so....)",
            "title_similarity": "0.79525137"
        },
        {
            "id": "i4tvwg7",
            "score": 1,
            "text": "Not an economist, but arguing from first principles:\n\nAssuming that by economic growth you mean real GDP growth, we need to consider at least 2 additional components: population growth and productivity growth. I am ignoring capital (i.e. holding it constant) for the purposes of simplifying the discussion. \n\nThe only way to keep economic growth at zero is to  have one of the following combinations:\n\n-\tZero population growth and zero productivity growth. The implication is that standards of living remain constant. \n\n-\tPositive population growth and negative productivity growth (i.e. people becoming less productive or fewer people working). The implication is that standards of living decline as fast as the population grows. \n\nIn other words, you can only have zero growth if your population is stagnant, or if standards of living go down.\n\nPractically, both reproduction (having kids above replacement rates) and greed (making money, which in capitalist societies implies innovating and outcompeting and generally being more productive) are pretty strong psychological forces. \n\nThe only way to keep economic growth at zero under those forces would be a massive dilution of standards of living (or a tremendously unequal distribution of standards of living).",
            "title_similarity": "0.7682687"
        },
        {
            "id": "i4tw8pn",
            "score": 1,
            "text": "When you say that the economy must grow, do you mean GDP?",
            "title_similarity": "0.7074105"
        },
        {
            "id": "i4twcg5",
            "score": 1,
            "text": "Actually, there are economic theories that suggest that when capitalism matures it moves towards conservation of wealth instead of pushing for growth. The idea is that risk/reward ratio drops so much that we don't want to risk losing what we have in order to have more. And if your country's way of life is comfortable, you definitely don't wanna lose that for some relatively small growth possibility. Currently, there are US and China with double digit growth YoY. Then there is more mature and stable capitalism of Netherlands an generally Europe- it experiences stable but single digit growth and events like GME are almost impossible to imagine. Then, you have Japan that hasn't experienced growth for 20 years but it hasn't lost anything either- they are preserving their economic success and their society has embraced that as a way of life. Their big companies do not seek limitless growth, their #1 objective is maintaining status quo.",
            "title_similarity": "0.7387937"
        },
        {
            "id": "i4twlok",
            "score": 1,
            "text": "When \"economic growth is 0\" in the context of an inflationary monetary system, it means the real economy is contracting, usually pretty rapidly.\n\nThe inflationary monetary system is how the bank takes your life, by robbing you of the value of your savings, the time-shifted value of your life&labor.  IIRC, global inflation takes about 400 million lives per year, just in terms of year-over-year inflation.   \n\nMost people don't notice this because they, too, see \"economic growth\": the numbers representing their bank balance get bigger even though each dollar in that bigger number buys less.  If you don't have sufficient \"economic growth\", it becomes harder to miss that you have less value even if it's a bigger number.\n\nFor most of the past century or so, this has been obfuscated by population growth and associated growth of the real economy.    It's basically a ponzi scheme.  New investors (i.e. generations) paid the dividends of the earlier investors, with mainly the middlemen skimming the middle getting rich.\n\nBut the parasite inevitably weakens the host until it begins dying.\nThat's what began in late 2019.",
            "title_similarity": "0.81373525"
        },
        {
            "id": "i4twngx",
            "score": 1,
            "text": "Look up how ponzi schemes work. That's essentially how all capitalist regimes functions. That and the subjugation of the global south. America in a bubble wouldn't have made it 5 years.",
            "title_similarity": "0.6529286"
        },
        {
            "id": "i4twrmd",
            "score": 1,
            "text": "Because people are cancer.  We grow for the sake of growing.  We won't stop until the host is dead.",
            "title_similarity": "0.5095874"
        },
        {
            "id": "i4tx6wl",
            "score": 1,
            "text": "The US is less than 5% of the world's population. If you add in Western Europe, Canada, Australia, Japan and Taiwan you get to about 15%.\n\nThat leaves us with three options:\n\n1) Accept a state of permanent and severe global wealth inequality\n\n2) Redistribute current wealth (ie the 15% share their wealth equally with the 85%)\n\n3) Grow the economy, a lot",
            "title_similarity": "0.6836713"
        },
        {
            "id": "i4tx90l",
            "score": 1,
            "text": "You sure you didn't mean to ask why companies need to continually make more and more profit every year to succeed, regardless of economic growth?\n\nIt's one thing to keep a growing population fed, it's a whole other thing to have to make more profits for investors.",
            "title_similarity": "0.8551822"
        },
        {
            "id": "i4txiy9",
            "score": 1,
            "text": "I really like this book related to this topic.\n\nhttps://smile.amazon.com/Prosperity-without-Growth-Foundations-Tomorrow/dp/1138935417",
            "title_similarity": "0.4103414"
        },
        {
            "id": "i4txnsu",
            "score": 1,
            "text": "The whole capitalistic system is built on greed. A long time ago humans realised greed is like the most powerful motivator, but it always lead to bad things, like centralisation of power, monopolies, dictatorships, etc.\n\nSo rather than trying to ostracise greed, what if we could invent a system with certain incentives designed to ‘channel’ greed into creating ‘good things’?\n\nHence capitalism, which has resulted in a lot of technological progress, however at it’s core greed is… well greedy, so we’ll always have to contend with that fact.\n\nIf you find a better system that than capitalism that produces technological progress without greed as a motivator let us know.",
            "title_similarity": "0.62065315"
        },
        {
            "id": "i4txych",
            "score": 1,
            "text": "Because it’s a pyramid scheme. You need more people buying in, more growth, to fuel the company’s perceived worth, thereby the company’s stock, and the stock market in general. This is how the richest of the rich make and grow their money. Everyone else is just a salaried employee.",
            "title_similarity": "0.7116469"
        },
        {
            "id": "i4tymr0",
            "score": 1,
            "text": "let's say that you busted your butt at work all year. at some point you're going to want a raise and/or a promotion. you'd be pretty disappointed if that never happened. your professional growth is a microcosm of the overall economy",
            "title_similarity": "0.79312897"
        },
        {
            "id": "i4tyr03",
            "score": 1,
            "text": "The reason economies are based on growth is because of the central bank system. The total money in the economy is based on the size of the economy in the currency of whatever country issues that currency. So Canada’s is based in Canadian dollars, but the total dollars are the size of the economy. \n\nNow where does a country get its self-issued money?  The central bank, which effectively lends the money out to the country. Each year, although money is not repaid to the bank, the debt grows because of interest, so the economy must grow enough so that it’s new value exceeds the new total debt. Then the economy has a new value each year, and the dollars within it go up. \n\nThe downstream effect of this is that each dollar in the economy has a lower percentage of value every year. If it was 1 of a million, then that’s much more value than 1 of a billion or trillion. That’s inflation. \n\nIf there’s too much growth, then inflation is high - so central banks raise interest rates to cool the inflation cycle. \n\nIf the economic growth is zero or below, you run the risk of stag-flation, which means real goods get more expensive, but economic growth doesn’t happen. The inflation part of this cycle is your own economy falling behind other economies, as they grow and yours does not. That’s why people fear zero growth.",
            "title_similarity": "0.7596085"
        },
        {
            "id": "i4tyz59",
            "score": 1,
            "text": "There are different definitions for what \"economy growth\" means:\n\n* Increase in the numbers written on a bank account\n* Increase in the amount of goods/services produced per person\n* Increase in the quality of life of a larger number of people\n\nThe first one, is what most often gets reported, but is very misleading without taking into account the increase of the prices for goods/services. Still, it's the simplest way to estimate growth, so everyone wants to just \"have more money\"... and then think how much it's actually worth.\n\nAn increase in goods/services per person, is a better interpretation, independently from whether the amount of money and prices grow or shrink. This economic growth can be driven by either an increase in money owned, or a decrease in the price of goods/services, which is a thing thanks to technologic advances.\n\nHowever, the average amount of goods/services that people can afford, doesn't take into account whether everyone can afford them, or just a tiny fraction of people get the lion's share, nor whether those goods/services are actually useful and what people want.\n\nIn an ideal world, the monetary growth would be irrelevant, while the other two would grow as humanity gets better at doing things.\n\nIn a short-term \"everyone for themselves\" world, a monetary decrease causes panic, lack of trust in each other, and chaos.",
            "title_similarity": "0.7660223"
        },
        {
            "id": "i4tzbdr",
            "score": 1,
            "text": "The most basic reason is the population continues to grow so the economy grows with it. GDP is basically just a translation of how much labor you can produce. Dollars are a representation of what labor is worth and the more labor eligible people you have in your population the more labor you can produce and so the more dollars you earn. The economy grows because the labor base grows. What is more interesting is in areas where population declines you see consolidation of wealth and increase in economic disparity. Not a lot of studies done on this topic by economists because of the sensitivity it introduces.",
            "title_similarity": "0.77351594"
        },
        {
            "id": "i4tzykj",
            "score": 1,
            "text": "Effectively all our money is built on debt. It didn't used to be (back in the day, more than a century ago), but making it based on debt solved certain problems (bigger discussion than I can eli5).\n\nOur economy (or more accurately central banks) \"create\" money by taking out \"loans\" . To get a bit more money for spending (mostly for the government to spend extra tax free) and to incentivize investment (which helps them ensure enough jobs to keep people busy and not be as angry with said government) they take out a bit more debt each year. In order to pay off the \"interest\" the economy must grow. Otherwise you end up not paying \"bills\" and \"defaulting\".  \nThe terminology is different at a national/whole economy scale, and things like \"default\" look very different, but they are generally devastating. (Fewer jobs even though there's work to do, starvation, bad allocation of resources, international relations problems, can trigger wars, etc.)\n\nIf we leave debt-based economies behind we will have more historical precedent for dealing with shrinking economies without catastrophe. But we open up old cans of worms. Many (including many gold bugs and crypto bros) feel debt-based economies are finally unsustainable. But it's not clear yet what we do instead. So, for now, there's a push for growth because we built in a need for it.",
            "title_similarity": "0.7822732"
        },
        {
            "id": "i4u0c64",
            "score": 1,
            "text": "Increasing economic growth \\*generally\\* means increasing standard of living, which is considered a good thing. A shrinking economy results in decreased standard of living.\n\nThink about the standard of living during the \"roaring twenties\" vs. the subsequent Great Depression.",
            "title_similarity": "0.7834019"
        },
        {
            "id": "i4u0f8i",
            "score": 1,
            "text": "I'd like to go back in time and murder which ever idiot decided to introduce \"quarters\". Looking to grow and increase profits quarter over quarter is a huge problem in our capitalistic economy.",
            "title_similarity": "0.70953774"
        },
        {
            "id": "i4u0ny8",
            "score": 1,
            "text": "Part of the strategy for managing ever growing government debt is also growing the economy along with it.  Growing the economy in theory leads to more taxes collecting to pay debts and take on new debts.  If the economy did not grow then the debt would quickly become unmanageable and when the central bank issues more money to cover existing obligations inflation can run rampant.",
            "title_similarity": "0.7359854"
        },
        {
            "id": "i4u0p3l",
            "score": 1,
            "text": "No, because of governments. Governments require a surplus of growth in order to function and to fund already established programs. Without a surplus of growth - i.e., a tax base - they will resort to issuing debt, which of course is just an assurance taken against future economic growth. Without governments, it would in theory be possible to have balanced economic growth, but then there wouldn't exist a central entity interested in measuring and promoting such things. Of course, there are other thing that necessitate economic growth, such as stock and equity markets, but without governments and regulation, it's difficult to see how these things wouldn't just blow themselves up or collapse - I think the long term success of most speculative markets relies on government bailouts and subsidies, at least in part. Think about it; you have an entire industry that essentially produces nothing of economic value, and yet it thrives. Seems like that should only be possible with the help of government intervention, and encouraging people to invest their assets speculatively, in order to counter things like inflation, which of course is also correlated with governments, as they control the money supply.",
            "title_similarity": "0.74079084"
        },
        {
            "id": "i4u17yw",
            "score": 1,
            "text": "2 main reasons I can think of. Loans require interest to be paid back, and stocks are valued according to projected growth. If your company remains constant, and everyone thinks it will, then nobody can make profit by buying and selling shares, so, the shares lose value. People can make money on dividends though, but still.\n\nThat's for a company. For the economy in general, it's loans. The inflation rate, the interest rate and all of that are set so that there's a tumbling momentum. The interest rate is the gas pedal. The central bank uses the interest rate to decide how freely or how strictly to hand out loans. If the economy is good, the central bank makes lots of loans and prints out lots of money, this causes inflation, but that's ok, because the economy has grown so much that the dollar value has increased. You don't want your dollar to grow too strong, otherwise people won't be trading for your expensive goods anymore. So, you print a much of money and devalue your dollar to keep it at a constant rate of inflation at about 1%. If your economy is predicted to slow, you increase the interest rate, and fewer loans are given out. \n\nIf the loans and interest aren't paid back, everything crumbles. Everybody loses money. That's what the crash in 2008 was. It was too many weak loans given out to too many people and passed off as good loans. They defaulted, things crashed. \n\nSo, people borrow, they borrow to create value, and they need to create more value than the loan plus interest so they can pay it back. \n\nMaking the loans stimulate the economy as well. It stimulates new businesses and new growth. So the more you *can* lend and create new money, the better it is. But you don't want excessive inflation. So, the central bank seta the interest rate appropriately so the right amount of lending occurs. The defaults can be handled, inflation is kept in check, all the while the most stabs and hitting something big occur. \n\nYour loan could create a Google. That would be huge. Google alone would increase the dollar quite a bit. That would allow you to make a bunch more loans and maybe create another big corporation.",
            "title_similarity": "0.78462696"
        },
        {
            "id": "i4u1me7",
            "score": 1,
            "text": "Economic growth might be easily summarized: (amount of people) multiplied by (productivity of people). To grow your economy, either you need more people or you need your people to do more with their effort. This growth means more food, more construction, more innovation, more improvements; this leads to more things we love and collectively, hopefully, each of us gets a little richer over time.  \n  \nWhat's the current outlook? In fact, we see population increase has slowed down a LOT in the USA, it was only slightly above 0% last year, due to COVID deaths, opioid deaths, less births, and less immigration. COVID did a lot of economic damage in that way: less near-term and long-term future workers and consumers. We've borrowed a lot of money to keep our economy afloat, and we see in inflation the increased money supply for businesses and US citizens has made each dollar go less far, buying less stuff (aka 8% inflation)...  \n  \nSo, low population growth, high inflation, excess deaths relative to other nations...things could be better here in the USA. We do have very skilled and productive workers who can pump out amazing vaccines, new anti-viral drugs, repurpose treatments for new COVID purposes, but we still have an undercurrent of anti-science, anti-technology biases which weakened our COVID response. The anti-vaccination movement, for instance, has damaging effects on our economy: less population survives, those who get long COVID or who miss work due to unvaxxed COVID illness, they'll be less healthy+productive workers. Anti-vaccination hurts economic growth.\n  \nFacts matter, science matters: we need to double-down on what works and throw away the snake oil. Would anti-vaxxers throw out the science that makes cars, planes, satellite radio, awesome food, awesome internet technologies? No, they just throw out vaccines for some sad reason...We're shooting ourselves in our feet, all due to misinformation on FB and cable news and the internet's dark corners, leading to unwarranted skepticism of safe and effective medical practices. We need to revamp our information ecosystem and build a better society if we truly want more economic growth in the face of challenges like pandemics, climate change, and global destabilization by autocrats like Putin.",
            "title_similarity": "0.8355595"
        },
        {
            "id": "i4u1wvo",
            "score": 1,
            "text": "Because capitalism is a death cult whose appetite won't be sated until all resources have been fully consumed. It doesn't have to be this way. It is this way because of capitalism.",
            "title_similarity": "0.6537197"
        },
        {
            "id": "i4u2m52",
            "score": 1,
            "text": "If we’re talking about the US. We live in a consumer encomy, if people are constantly spending and buying then there is no growth.",
            "title_similarity": "0.6572155"
        },
        {
            "id": "i4u3bau",
            "score": 1,
            "text": "Most people have a desire for more. More money, more food, nicer car, nicer clothes. Even the poorest people on the planet want more. \n\nThere are 2 ways for an individual to get more. \n\n1 - take a bigger piece of the existing pie. \n2 - grow the pie so your piece is bigger.\n\nThe general view has been that option 2 is preferred over option 1. Grow the economy and everyone gets a bit more. Keep the economy the same size and some people will get more while others get less. \n\nReality has proven very different from the theory, but the ELIF answer is if you have 1/8 of a small pizza or 1/8 of a medium pizza which is more pizza?",
            "title_similarity": "0.6597345"
        },
        {
            "id": "i4u3q0q",
            "score": 1,
            "text": "If you got the time, I would recommend watching [this episode](https://youtu.be/dXErN2jPgK4) of Metaphysical Milkshake. They go into your specific question at some point, and the explanation is really, really easy to understand.",
            "title_similarity": "0.3184187"
        },
        {
            "id": "i4u40mm",
            "score": 1,
            "text": "We want to have better lives in the future than we have today.\n\nIn a world without economic growth, there'll be no retirement funds. No college funds. You won't buy property as an investment vehicle. You won't retire. Life will look exactly the same in fifty years as it does today. There'll be no new technology. The cities won't expand. And if you want to not have *less* in the future, the population better not grow either, because if the population grows but the economy doesn't, those new people have to take their stuff from somewhere.",
            "title_similarity": "0.6929888"
        },
        {
            "id": "i4u4s47",
            "score": 1,
            "text": "Growth is based on resources and tech improvement. If we stop growing and progressing we could hit there. The planet only has finite numbers of resources - but those are renewable and the sun constantly puts energy in, so it's not actually finite like I said. That's before we even expand past this planet.\n\n3% growth is a random target someone made up, but the point is some areas contract while othrrs grow more. We can also get better at producing things, which is grow of some widget, but possibly reduction in labor requirements.\n\nBut we always want more technology, more discoveries, so in that sense we should always grow.\n\nAnd I think we don't ever want a stagnation where you balance to zero growth because that means if Bob in the middle of nowhere decides to take a break for an hour extra, we start shrinking and regressing. We want growth so people can also take breaks and have some things easier.",
            "title_similarity": "0.73173964"
        },
        {
            "id": "i4u4y00",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03167421"
        },
        {
            "id": "i4u54yt",
            "score": 1,
            "text": "A Ponzi scheme (/ˈpɒnzi/, Italian: [ˈpontsi]) is a form of fraud that lures investors and pays profits to earlier investors with funds from more recent investors.[1] The scheme leads victims to believe that profits are coming from legitimate business activity (e.g., product sales or successful investments), and they remain unaware that other investors are the source of funds. A Ponzi scheme can maintain the illusion of a sustainable business as long as new investors contribute new funds, and as long as most of the investors do not demand full repayment and still believe in the non-existent assets they are purported to own.",
            "title_similarity": "0.6806692"
        },
        {
            "id": "i4u57vj",
            "score": 1,
            "text": "It’s only a disaster for unregulated capitalism. The bullshit argument that population grows by a certain percent each year so food production has to keep pace is the lie they tell to make you believe capitalism is “natural.” Capitalism is great as long as it’s regulated (otherwise is has one winner and everyone else has to be a loser), but it’s not natural and it takes some effort to shoehorn into human existence. One of the easy ways to regulate it is to maintain a food surplus so population fluctuations aren’t a disaster.",
            "title_similarity": "0.80353945"
        },
        {
            "id": "i4u5lix",
            "score": 1,
            "text": "ELI5: because the overall population is always growing. For more complicated explanation see other comments.",
            "title_similarity": "0.5332819"
        },
        {
            "id": "i4u75hd",
            "score": 1,
            "text": "Growth of 0 is an unstable equilibrium. Gross domestic product is equal to Consumption + Investment + Government Spending + Net exports. If growth is expected to be 0 in perpetuity than nobody will want to invest (since they can't expect a return greater than the risk premium of their investment)...But now without investment GDP is out of whack and will lead to a recession (negative growth). In theory consumers could move their investment dollars to increased consumption to offset this effect, but this isn't realistic.",
            "title_similarity": "0.8254221"
        },
        {
            "id": "i4u7buf",
            "score": 1,
            "text": "Well,  to put it simply,  an economy is activity. You could think of it as motion.  If acceleration/ every is not being applied actively,  then it will slow and eventually stop. While it is possible to put JUST enough energy into a system to sustain an exact amount of motion, it isn't likely to be done naturally. So you either find systems increasing in speed or slowing down most often. Essentially, the heuristic rule that if a system is not speeding up, then it's slowing down,  while not STRICTLY always true, works almost all the time since the only two situations where it's not true are where there's either no resistance at all, or the energy input and the energy expended are exactly the same at all times.",
            "title_similarity": "0.64729226"
        },
        {
            "id": "i4u83jv",
            "score": 1,
            "text": "A lot of people forget that GDP (economic production)is reported in the countries currency. \n\nThat currency is subject to inflation and is relative to other currencies.\n\nSo if there is 4% inflation, and economic production of that country stays the same, the GDP will increase by 4%.\n\nSo it looks like the economy is growing, but it is really not.\n\nIf GDP is 0% it means that production is not even keeping up with inflation. It means people are earning less money, and spending less money. They are getting poorer, not richer.",
            "title_similarity": "0.7848944"
        },
        {
            "id": "i4u85xz",
            "score": 1,
            "text": "Because the whole thing is a ponzi scheme, with Rich mofos at the top that always want more.",
            "title_similarity": "0.44255245"
        },
        {
            "id": "i4u8e4k",
            "score": 1,
            "text": "Put simply, the economy has to grow to keep up with the population. So if the economy were to stop growing and there were too many people, it wouldn't be able to support a population of that size.",
            "title_similarity": "0.77338684"
        },
        {
            "id": "i4u8eaa",
            "score": 1,
            "text": "Do YOU want to make more money next year? Do you want to buy new stuff that makes you happy? So does everyone else. And on average the success in achieving that goal is our gdp growth.",
            "title_similarity": "0.81583905"
        },
        {
            "id": "i4u8edn",
            "score": 1,
            "text": "Because capitalism requires growth on top of growth until eternity, even when logically, we all know that this is impossible",
            "title_similarity": "0.6411438"
        },
        {
            "id": "i4u8ien",
            "score": 1,
            "text": "In Finland, last 3 yrs sum of hours worked, has not risen,but employment and GDP has increased. As well as use of energy, which so far has correlated with economic growth.\n\nEmployment+energy+machines->products into market.\n\n[https://www.stat.fi/til/tyti/2021/12/tyti\\_2021\\_12\\_2022-01-25\\_tau\\_049\\_fi.html](https://www.stat.fi/til/tyti/2021/12/tyti_2021_12_2022-01-25_tau_049_fi.html)\n\nIn recent study, Geological Research Institute: (search YouTube for Simon Michaux)\n\n[https://www.gtk.fi/en/current/gtk-research-the-currently-known-global-mineral-reserves-will-not-be-sufficient-to-supply-enough-metals-to-manufacture-the-planned-non-fossil-fuel-industrial-systems/](https://www.gtk.fi/en/current/gtk-research-the-currently-known-global-mineral-reserves-will-not-be-sufficient-to-supply-enough-metals-to-manufacture-the-planned-non-fossil-fuel-industrial-systems/)\n\nAnd IPCC warns that if the world does not start to decrease CO2 emissions in next 30 months, our climate and ecosystems will be disrupted beyond return.So we cannot continue with present continuous growth model...",
            "title_similarity": "0.73681366"
        },
        {
            "id": "i4u8lmp",
            "score": 1,
            "text": "Because the economy isn't designed around the idea of producing goods and services to meet the needs of the population. \n\nWell, some parts of the economy are. But the cornerstone of our contemporary economy is centered around \"investment.\"\n\nSo say you buy a widget for $5. You don't really want a widget, you just want to \"invest\" in the widget, hoping to resell it for more. So in a year's time you sell the widget for $7. But for you to sell it, it means someone else is buying it. And why would they buy it? Because they too want to \"invest\" hoping it will be worth more later. So now $7 is no longer good enough. For this investor to be happy, the widget price needs to get higher. And in a year's time they sell it for $9. But now the buyer at $9 wants the price to go up, otherwise why else would they buy it for $9? \n\nThat's the stock market.\n\nWhen people buy shares it means someone else is selling those shares. Every \"trade\" has a buyer and a seller. And people only \"buy\" when they think the price is going up.\n\nSo now we've got ourselves on this system where we expect the price to only go up, and up, and up, as if growth were an unlimited thing.\n\nThink of someone buying Amazon shares right now. They would only do so if they expect the price to go up. This means things need to happen for it to go up. While some prices are affected by the ebbs and flows of the market itself, other things can affect price, like the \"health\" of the company, and so forth. \n\nThis is why when a company goes public suddenly it's mission and goals change. It's no longer about providing a service for a fair price. Instead it's about growth, growth, growth. And at some point innovation cannot keep up with the expectations of the investors, who are only buying 40k shares at $62/share because they want to sell 40k shares to get a nice return. So they start to do things that can \"increase value\" in other ways, like lowering costs, lowering costs like labor costs, or manufacturing costs, or design costs. This is why it seems sometimes products get worse over time, or why \"shrinkflation\" happens to consumables, or why jobs get sent overseas, or why the target market goes from a small niche to the general population. \n\nWhen an investor buys 10,000 widgets for $5, it's so they can sell it for $7. But to sell it for $7, it means someone is buying it for $7, which means that person is only buying it for $7 because they think they themselves can sell it for $9. And on. And on. And on. And on. Until someone is left holding the bag.\n\nAnd with this, it's important I think to note how in nature there is only one thing that focuses on unlimited growth. It isn't even a black hole, which evaporates over time. It's cancer. \n\nAnd as to your question about too much growth? Well, you know, climate change. All these efforts to increase the value end up with what they call \"externalities\". Decreasing manufacturing costs can be done by reducing pollution controls, for example. It's cheaper to throw your waste in a river than deal with it properly. And added up all together all this cancerous growth has metastasized into a malignant tumor called climate change.",
            "title_similarity": "0.7871863"
        },
        {
            "id": "i4u8xtm",
            "score": 1,
            "text": "With modern corporate capitalism, we have decided to grow the pie (economy) as much as possible and worry about who gets what slices later. Unfortunately, most of the new pie made each year goes to the 1%.",
            "title_similarity": "0.748948"
        },
        {
            "id": "i4u9ins",
            "score": 1,
            "text": "A growing economy means you can do more in the society. It’s really difficult to afford major infrastructure upkeep if your economy is stalling or slowing down. \n\nSame with companies. A growing company can hire more people, etc. \n\nNo growth? No expansion, no changes, stalled.",
            "title_similarity": "0.806418"
        },
        {
            "id": "i4u9uul",
            "score": 1,
            "text": "From a historical perspective, it's because originally \"westernism\" was based on the idea of pretending there are infinite resources.\n\nAll current capitalist systems have grown from that idea in one way or another. Reality obviously disagrees. So whenever reality forces its way into our made up system (and it does this periodically and dramatically) it seems like our system is failing. \n\nIt is failing, actually. It's a frontier / colonial style system (where there are many more resources than demand for them). It is ideal for exploitation. For example France is a pretty country, made wealthy on the back of places like Haiti which were stripped harshly and left bleeding. \n\nThey just remove resources from other places and consolidate the wealth to themselves. \n\nBut now it's harder to exploit these places. Recently the US ransacked the middle east, some of latin america, and consistently their own lower classes. As the US loses more, the effects are moving further and further up into the middle class. This leads to more poor people and more worker exploitation, until at some point it will eat itself from the inside out. \n\nRussia, who pretends to not be capitalist but sacrificed millions of lives to try to look like them (oligarchs thrive in capitalism), is going through a similar situation right now with their Ukraine assault.\n\nIt's a constant battle / struggle for resources that exists because our system is based on the false idea that they do.",
            "title_similarity": "0.66141236"
        },
        {
            "id": "i4u9uw7",
            "score": 1,
            "text": "If you haven't - check out Ray Dalio's explanation of the economy. It's about 20 minutes long and explains the growth and decline of economies better than anyone here can. \n\nIt's beautifully animated and keeps everything as simple as it possibly can be.\n\nhttps://youtu.be/PHe0bXAIuk0",
            "title_similarity": "0.57606244"
        },
        {
            "id": "i4ua5ps",
            "score": 1,
            "text": "I scrolled down a bit and didn't find this answer so I'll pitch in: Saving for retirement. 401ks are a powerful vehicle for retirement saving because the economy reliably returns about 7-8% a year in the long term. If the economy stopped growing and permanently declined, many many people would be seeing their retirement plans evaporate and their chance at a good quality of life in their later years would be gone.",
            "title_similarity": "0.7674242"
        },
        {
            "id": "i4uadl0",
            "score": 1,
            "text": "Of course it can reach a balance and it should so long as population growth stays flat. There is a huge problem that is fairly simple to spot. If growth is flat with population and resource need is satisfied (which is possible because a healthy human, at some point, will say \"I have enough\") financial asset appreciation would also be flat/non-existent. No asset appreciation, no wealth growth.\n\nIn short, stock holders won't make more and more money by just sitting on their assets. It becomes their probelm and not JUST yours. This is unacceptable.",
            "title_similarity": "0.6344172"
        },
        {
            "id": "i4ucr3r",
            "score": 1,
            "text": "Because then we can’t deficient spend.  If we will have more next year we can spend more next year.",
            "title_similarity": "0.68374026"
        },
        {
            "id": "i4ue63i",
            "score": 1,
            "text": "its a debt based system where currency is destroyed when  it gets paid off, however the intrest on the debt still exists after the original debt is paid off therefore there is not ever enough currency to account for the intrest. so more debt needs to be created to keep it going.",
            "title_similarity": "0.6846193"
        },
        {
            "id": "i4ue7op",
            "score": 1,
            "text": "It's a function of capitalism. The market has to keep growing otherwise private individuals won't have an incentive to invest and the artificially inflated bubble will burst. This then affects those who have not been hoarding resources, while those who have hoarded wealth can then acquire more while the market is low. The bubble will then inflate again until it bursts and the cycle continues.",
            "title_similarity": "0.7719373"
        },
        {
            "id": "i4uea6k",
            "score": 1,
            "text": "because the economy is nothing more than a myth created by people who want to see this world destroyed...   \n\nwhen that time comes the parasites will scurry into their underground bunkers and cities only to one day rise like the cockroaches they are to do it all over again...  \n\ntldr, economy is a hoax and we are doomed because people can't see this.",
            "title_similarity": "0.5367941"
        },
        {
            "id": "i4uejg7",
            "score": 1,
            "text": "**Growth encourages investment.**  If you run a lemonade stand, and you see more customers day over day, you may buying more lemons, sugar, equipment, and maybe hiring some more help.  That growth creates a feedback loop that benefits everyone, as the people that supply your lemonade stand will buy more to support you, and hire more people, which leaves more money in the hands of lemonade buyers.\n\nThe opposite is also true.  If your lemonade stand is seeing a decline in business, you will buy less of all of the above.\n\nZero growth would be a breakeven.  But people tend to want to enjoy the benefits of growth, and seek out politicians that promise growth.",
            "title_similarity": "0.6767006"
        },
        {
            "id": "i4uel8h",
            "score": 1,
            "text": ">Why does the economy require to keep growing each year in order to succeed?\n\nBecause what is the point of an economy if it doesn't actually yield increasing wealth for its people? If your population stays the same, and your economy is flat, it means that the things you're not creating anything of lasting value.\n\n>Could there be a point where there's too much growth?\n\nSure, it happens all the time, it's called a 'recession', and it's when the denominated value of a class of assets, or all assets, turn out to be not as high as prices indicate. The stock market, and to a lesser extent, the bond market, are forward-looking: The value of a stock or bond isn't necessarily what the thing you bought will produce today, if you liquidated it, but what it's going to produce over its lifetime.\n\n>Where does all this growth come from and why is it necessary?\n\nWell, growth is denominated as GDP growth, which is an estimate of the sum total of all economic activity in a country. And this is where things get tricky, but not all GDP contributes to future prosperity equally. If I borrow $200,000 from the bank and spend it on instant lottery tickets, this year's GDP figures will go up, but the future debt will promise that my contribution to next year's GDP will go down. Even if I win all those scratchers, someone else is going to wind up paying my winnings, because lotteries, gambling, and crypto are zero-sum games. They don't actually produce anything of value in and of themselves. But if I take that $200,000 and start a business, I'm *arguably* going to be making something that's of use to other people in the economy, which is how I'll pay back my loans, and how my customers will improve their lives.\n\nAnd that's the point of *all* economic activity, at the end of the day: to encourage us to work for each other, by harnessing our own self-interest.",
            "title_similarity": "0.93089837"
        },
        {
            "id": "i4uemeo",
            "score": 1,
            "text": "Greed, pure and simple. The \"health\" of the economy is not defined by arbitrary metrics, the \"health\" of an economy is in how well it works for the society that constructed it and uses it to maintain economic viability.\n\n&nbsp;\n\nYou original question is grounded in a point of view that is based upon the **Taxes Fund Spending** lie promulgated by those that choose to obfuscate reality as they freely exploit the system for personal gain.\n\n&nbsp;",
            "title_similarity": "0.55616295"
        },
        {
            "id": "i4uemp4",
            "score": 1,
            "text": "Capitalism requires constant “growth” and an increasing consumption of resources. This is why many people say capitalism is unsustainable and that we are in an era of post-capitalism. Say what you want about “communists” or whatever, but this IS unsustainable. Inflation pushes the market to never stop scaling up. There IS a ceiling and we are getting closer and closer to it",
            "title_similarity": "0.74323887"
        },
        {
            "id": "i4uepf8",
            "score": 1,
            "text": "I believe some nordic countries already switch their economic approach to this. Instead of measuring the country’s success on % growth each year, they’re more focused on population happiness and if their needs are met.",
            "title_similarity": "0.76460266"
        },
        {
            "id": "i4uf1em",
            "score": 1,
            "text": "because if the population is growing and the economy has stagnated everyone will get poorer",
            "title_similarity": "0.66661334"
        },
        {
            "id": "i4ufknr",
            "score": 1,
            "text": "Due to the over farming of land all top soul has eroded. Humans are such short term thinkers. It’s sad.",
            "title_similarity": "0.45851678"
        },
        {
            "id": "i4uhlwg",
            "score": 1,
            "text": "The other responses have been solid. I have a few degrees in Economics and Mathematics, so I'd like to answer your questions more directly.\n\n***Is it a disaster if growth is 0?***\n\nNo. Countries like to talk about their growth to say they're doing a good job, but that doesn't mean it's a perfect indicator. If a country adds 1% to its population and produces 1% more GDP, then they can say they had 1% growth, but it didn't materialize into anything better for the populace. What we should care about more is the growth of GDP per capita since that focuses on the experienced growth for individuals.\n\nZero growth is scary for a few reasons, though. It's scary for being close to shrinking. If we went from growth to stagnation, then does that trend mean we're going to shrink soon? It's scary for the leaders whose citizens expected growth. And, it's scary from a technology perspective because if we're inventing new things every week, why didn't that materialize into growth? Was the rest of our economy shrinking, and our technology was the only thing holding it up?\n\n***Can it reach a balance between goods and services produced and goods and services consumed and just stay there?***\n\nNo. A simple counter example would be that of tastes. Fashion changes, flavor palettes change, architectural designs change. All of these result in a dynamically changing set of desires consumers have that producers respond to. How then do we respond to them?\n\nSuppose Apples were to become twice as popular. People are willing to pay a little extra for apples. Apple Orchards then plant extra trees in the hopes of capturing some more demand, but it takes a tree 4-8 years to produce fruit. Maybe the orchard captured some extra sales, but they've now expanded operations. This will have a longer term affect on the apple supply. We call these situations where decisions are not perfectly fluid \"sticky\".\n\nEmployment is sticky. We can't hire and fire people on the daily to reach a perfect equilibrium. We hire people on salaries for a year oftentimes, so if they're not needed, it can be hard to fire them. This means companies aren't perfectly efficient to maintain an equilibrium.\n\nTechnology also comes in here and reduces the ability for long-term equilibrium. Think of Quickbooks. Once it was made, regular employees could do bookkeeping. That meant we reduced the demand for bookkeepers. Now, this might sound like it's bad to lose jobs, but what we've done is free up human capital to go do new things. We preserved the benefit the bookkeepers offered, and those people can now work in a field that really needs them. This also produces growth.\n\n***Where does the growth come from?***\n\nI gave quite a few examples above, but here are some brief, clear ways to think of a few causes of growth.\n\n* **Growth can come from technology**. Hardware and software are doing amazing things for us by allowing employees to fulfill more roles. By reducing the people needed to do a task, we have people freed to be valuable on something else that was a bottleneck.\n* **Growth can come from sticky investments**. Just like how your clothes expand from you stretching them here and there, the economy expands accidentally from just trying to handle small demand shifts. If you invest in a taste of today, you still have that equipment tomorrow.\n* **Growth can come from desire**. I want to be rich. You want to be rich. That sounds pretty nice. Because there are people who want to improve their stake in life, they need to find a way to make money. This almost always comes from spurring growth. You start a business to provide something new or deliver the same thing in a better way. This is a **strong** factor in growth. For those who believe in capitalism, this is one of the two pillars of its greatness (the other being that the market better responds to demand than central planners).\n\n***Could there be too much growth?***\n\nNo, with a caveat. If you're talking about growth **rate** (growth in a specific time span), there would be a limit. However, this has an even longer explanation going deep into how we deal with finance. TL;DR debt gets really wacky when your growth rate is too high, and slowing down is like stopping your bike tire with your hand -- you can do it, but it'll hurt.\n\nGrowth across a large time span is limitless. If we continue to grow, we'll have more resources for more people to give them better lives. This is why GDP per capita is important and why we should keep our eyes on whether growth is really helping people at the bottom too.",
            "title_similarity": "0.7667191"
        },
        {
            "id": "i4uhnhs",
            "score": 1,
            "text": "Interpersonal conflict. Basically we are making promises all over town that its in everyones best interests to work with us. The day we stop making those promises will lead to a massive increase in conflict",
            "title_similarity": "0.47419918"
        },
        {
            "id": "i4uim1b",
            "score": 1,
            "text": ">Why does the economy require to keep growing each year in order to succeed?\n\nIt doesn't, depending on the goal.   \n\nYou could easily have a nation with zero growth....   but if it had any neighbors that were growing eventually that nation would be consumed / left in the dust / no longer be competitive / citizens elsewhere will have a better standard of living. \n\nBut if you exist in a friendly sort of live and let live setting, liiiiiiike, the Amish. Then you can pretty much just continue to exist and persist as you are.    That's dependent upon America not brutally conquoring Amish lands by sending in shock troopers or aggressively applying economic warfare. The Amish can simply choose not to sell the land, but if they can't bring product to market they'd go broke.   All that said, even the Amish run farms like a business and seek to make money and profit. \n\nWith technology marching forward all the time (faster and faster) the concept of having a static stable economic setting that just doesn't change much over a long period of time is... \"Quaint\". \n\n>Why is it a disaster if economic growth is 0? \n\nOther than neighborly competition, where it's just fine if you have zero growth so long as they do too, there are a lot of systems in place that are built with the expectation of growth.   That's not entirely unreasonable considering considering we've been growing on average pretty much forever.     But pensions are essentially big ol' pyramid schemes. The retired workers are paid by the young workers.    This is great when the company grows and there's more young workers supporting the smaller previous wave of workers.  It's a horrific feedback loop when the company shrinks and has a top-heavy pension program.   A less obvious but similar problem is how money is introduced into the system. The FED makes loans to other big banks, who loan it out to others.   This is the printers going \"BRRT\" as the saying goes.  But those loans (used to) come with rate that has to be paid off.    That rate means that work has to be done to afford to pay off the loan.  We can never actually pay off all the loans, there's literally not enough money, but we can do work for pay to afford the interest. In the grand scheme of things, we're another day older and deeper in debt. \n\n\n>Can it reach a balance between goods/services produced and goods/services consumed and just stay there? \n\nIn theory, yes.   But you have to:\n * Cap population growth (which comes with some major social problems)\n * Change up monetary policy (which has kinda already happened, interest rates were zero for a while there)\n * Get everyone world-wide to play along with this idea and not try and rise above others (which sounds like a Poli-Sci joke)\n * Get off of ALL fossil fuels (anyone dealing with logistics has that uncomfortable blank stare of disbelief)\n * Account for and balance out all externalities like pollution (the environmentalists are having a sad laugh)\n * Get out of the current mass extinction event, but the last bullet would fix climate change so that kinda comes for free\n \nAnd then then, you'd only have a few billion years before the sun swallows the Earth destroying everything. \"Eternal\" just doesn't exist. \n \n>Where does all this growth come from and why is it necessary? \n\nWork. Effort. Building things. Stick a seed in the ground and come back in a season.   Take a block of iron and turn it into a knife.   The economy is NOWHERE near a zero-sum game.   People create and destroy wealth all the time. If you make more than is destroyed, that's growth.\n\n>Could there be a point where there's too much growth?\n\nOh for sure. We've seen this in microcosms plenty. Rabbits overbreeding in an area until there's not enough food and they develop disease and die out.   A ranching community growing so much that the over-graze an area.    L.A. not having enough water coming down the river.   There are a bajillion and one ways to run into limiting factors where additional growth is hindered  to everyone's detriment. \n\nTo be REAL clear about this:   **\"The current human civilization is not sustainable\"**.   I mean come on, we're burning oil.   A fossil fuel. That's not going to last. Things will have to change. But of course they'll change. That can be scary, but it's not the end, it's just different.",
            "title_similarity": "0.8105456"
        },
        {
            "id": "i4uitav",
            "score": 1,
            "text": "I’ve thought about this a lot myself. I’m not an economist, but I have studied quite a bit around the subject. So, I’ll offer a theory on this that you may not find in the rest of the comments. \n\nOur current world economic system was essentially established after ww2. During the war the United States, and other western nations following, solidified policies to maintain the ability to fight full-scale war on Two fronts. In the United States that basically meant to keep the military ready to fight a war in the Atlantic and Pacific theaters simultaneously. \nOnce the war was over this was standard procedure and led to what Eisenhower called the “military industrial complex.” \n\nThe military industrial complex is the practice of combining national security and military readiness with the economic potential of a nation. \nSee before ww2 we had an economy which was mostly free-market and relatively volatile. When the war broke out we did not have the industrial capacity to fight a war. It took us a few years to get the gears moving and build the factories needed. \n\nTo help, many companies, like Ford Motors, repurposed their factories to produce military armament. This was so effective that after the war the DOD developed a “War Ready” strategy in tandem with our economic productive capacities. \n\nA war-ready-state is when you are ready for war. Wars take massive amounts of logistics. Logistics is basically the ability to supply resources to where it’s needed when it’s needed. \nIn order for our economy to transition from peace time to war time very quickly, we must keep its productive capacities at a very high level. So, convince everyone to buy new cars every couple years, then you’ll have factories greased and ready to start producing tanks immediately. \n\nBasically this means the economy needs to grow and have an ever increasing productive potential. \nThere are many functioning parts needed to be able to convert a peace time economy to a war economy. The western world economy is essentially designed to be able to switch to war mode on a dime. \n\nDuring peace time we need to keep and maintain a trained and skilled work force. Which means they need to keep working and keep learning. As the population grows and the needs increase the demand to produce goes up. \nOur economy must keep its head above water if it wishes to keep swimming. Which means we can never stop paddling. \n\nI don’t agree with this world view. But that’s the secret they don’t tell anyone anymore. \nOur economy is designed to be a war economy. \n\nWar economies must be able to out produce the enemy. All wars are won by logistics. And logistics is simply the ability to do more faster in more places.",
            "title_similarity": "0.54832906"
        },
        {
            "id": "i4uj02t",
            "score": 1,
            "text": "It only really *needs* to grow to keep up with population. Though ideally growing an economy without growing the population leads to better conditions for said population.\n\nThere's also good ol' capitalism which grows for the sake of growing. Even if it only pretends to grow the magic line must always go up even if that means cutting corners. Usually when growth from capitalism happens, the average member of society doesn't see any benefit from it. The extra wealth concentrates at the top of a society and for the most part it stays there.",
            "title_similarity": "0.7823699"
        },
        {
            "id": "i4uj0d1",
            "score": 1,
            "text": "Because more and more people enter the job market, and more and more people enter retirement. Without growth, the new entrants won't get jobs or won't get a pension.",
            "title_similarity": "0.752019"
        },
        {
            "id": "i4uj19t",
            "score": 1,
            "text": "Debt interest. Also known as usury. I think it became normal because of the amount of risk involved in a mercantile economy, regular losses had to be made up with outsized gains in successful voyages. Now, our developmental model is a perpetual growth machine that is obviously contradictory with the way we want to live and how the world actually works. It doesn't have to be this way, but entrenched institutions, combined with our flawed human condition keeps the contradictions going.\n\nELI5\n\nIf I lend you $10 and in return you have to pay me $12 in a year, how do you do that? You have to get it from someone else. So you try to trade that money and create something that you can exchange for at least $12.\n\nWell other people don't just have money, because money is only created by lending.\n\nSo, say at least 2 other people borrow money. They will also borrow $10 and have to pay back $12 in a year.\n\nNow  there are at least $30 in circulation but there will have to be $36 in circulation next year!\n\nYou may be able to get your $12, but they would never be able to pay their loan.\n\nThere must be $36 next year for the economy to break even. More people must borrow, more exchanging must happen.\n\nThe economy must grow to meet the debt interest.",
            "title_similarity": "0.7691601"
        },
        {
            "id": "i4ujlx8",
            "score": 1,
            "text": "Because a lot of people have invested a lot of money into the general economy getting bigger in the future. And if that were to not happen, it would have a large knock-on effect, upsetting the existing markets and causing a lot of collateral damage in the process.",
            "title_similarity": "0.66064763"
        },
        {
            "id": "i4ujo6p",
            "score": 1,
            "text": "I would expect it has to do with the fact that interest and debt grow faster than gdp. Always. So an economy without growth is actually an economy in decline, as more of the gdp continually gets eaten up by increasing debt.",
            "title_similarity": "0.813311"
        },
        {
            "id": "i4ukqdg",
            "score": 1,
            "text": "People have all made bets, from very small to very large, that things will be better in the future than they are today. Economic growth is necessary for those bets to pay off. Stagnation is a return of the bet with no gains, discouraging future bets. Contraction is loss of the principal investment.",
            "title_similarity": "0.80694175"
        },
        {
            "id": "i4uks03",
            "score": 1,
            "text": "Read Karl Marx, that dude predicted everything about economic development and downfall. Constant growth is a myth that makes people create debt. Money is created through debt, ask your landlord and his bank))",
            "title_similarity": "0.6413647"
        },
        {
            "id": "i4ul2tz",
            "score": 1,
            "text": "It doesn't. Breaking even is a good thing. Loss is bad. Profit is extortion of others labor so you can do less. \n\nWe need to make ends meet. The way of capitalism says you need growth or it's loss. Always loss of you don't grow.",
            "title_similarity": "0.6801423"
        },
        {
            "id": "i4ul6in",
            "score": 1,
            "text": ">Why does the economy require to keep growing each year in order to succeed?\n\nIsn't this the classic method of keeping an MLM solvent?",
            "title_similarity": "0.88812244"
        },
        {
            "id": "i4um7sx",
            "score": 1,
            "text": "Because at least the economy has to grow with the population, otherwise living standards drop (eg. having one hospital is good for a small town, but if that grows to a big city then that's not nearly enough.)\n\nIf you have a country with a very stable population you could easily have an economy that stays at a steady level. If you only need one hospital per 10000 people and there's only 10000 and it doesn't grow, you don't need new hospitals.\n\nThe economic growth comes *from* the population increase: more people enter the workforce, they provide more goods and services, but then again those goods and services are needed because the population is expanding, so it all balances out in the end. People see that a larger town needs another hospital, and so they build it and staff it, and that process of building and staffing grows the economy (you have to pay the builders, architects, and brick makers, then the doctors, nurses, and administrators.)\n\nThe economy could grow into a bubble, basically held in place by sheer faith in the system (which btw is why a lot of the modern economy works, because people believe it works; if people don't believe it works, it ceases to work.)",
            "title_similarity": "0.7679964"
        },
        {
            "id": "i4um91e",
            "score": 1,
            "text": "One of the metrics politicians use is GDP. Many others are compared to GDP.  Like Debt to GDP ratio as a measure of how in debt the country really is. If you have a debt of 100 million but a GDP Of 1 million it'll take the total output of the country 100 years to pay off the debt. But With a GDP OF 500 million it's a much smaller Debt Load. \n\nPoliticians can hide growing debt with a growing economy. If the ratio drops, or remains the same, then it looks like they are doing a good job. But hides that the debt grew slower than the economy, but still grew.",
            "title_similarity": "0.7516035"
        },
        {
            "id": "i4umleh",
            "score": 1,
            "text": "Well assuming population and circumstance remains the same, it wouldnt matter that much. But populations tend to go up",
            "title_similarity": "0.58295155"
        },
        {
            "id": "i4umwzu",
            "score": 1,
            "text": "It doesn't require it. \n\nUnless yours is the only one that doesn't grow, then you've been left behind. \n\nUnfortunately everyone in the world is trying to actively participate in that experiment of constant growth.\n\nSome countries have tried to isolate themselves (in certain measure) from the worldwide markets like Hugo Chavez in Venezuela, North Korea with the Kim dynasty, Fidel Castro's Cuba, and the like. \n\nYou'll notice all of those were branded tyrants and despots and some might be for sure, but it all started because they tried a different economic system that doesn't play well with the constant relentless growth-at-all-costs of capitalism and well, they were left behind, then the rulers handled their economy being left behind as they saw fit and the results are now in history. \n\nHistorically it seems constant, but regulated growth is the way to go. \n\nAs with most things the extremes are bad: unbridled capitalism is no heaven, no growth is no good either. The answer usually lies in the middle. \n\nAnd that's where most places are: some manner of social measures supported by restrained capitalist growth. It's nice, people seem happier that way.",
            "title_similarity": "0.68701625"
        },
        {
            "id": "i4un2hk",
            "score": 1,
            "text": "Economic growth improves quality of life. If you had $10k before and $20k now, you will have a better quality of life. If everyone goes from $10k to $20k, society as a whole improves QoL. \n\nThis is possible because value can be created. For example, you have $1M cash. You hire workers to build a $1M house. After completion, the workers will have the $1M cash and you have a $1M house, together that’s $2M in value. This cycle goes on and everyone is better off.",
            "title_similarity": "0.6876388"
        },
        {
            "id": "i4un435",
            "score": 1,
            "text": "I mean its a capitalist society.  It goes by services someone has to make fast food, we need field workers, or how about handy man people.  So they get paid by other people that work etc.   \n\nPeople just need to work to keep the world revolving someone needs to do certain task so it continues where sadily enough the top guys are the big winners usually since they dont do much and get the big bucks.  \n\nSo if population is increase yet economy isnt girl I see a problem here.  More people means more money should be floating since more work more money being made etc.",
            "title_similarity": "0.72083354"
        },
        {
            "id": "i4ungrn",
            "score": 1,
            "text": "In a static world that kind of balance would be ideal.  The world is constantly changing.  Some people are driven to consume more than others.  It's not likely economic growth would ever rest at zero.  The job of a market economy is efficient, equitable, distribution of resources.  I would argue that a shrinking economy that succeeds in the above is not necessarily a bad thing.  A growing economy that fails in those measures is not always a \"good\" economy.\n\nUltimately it's up to us to decide what a constitutes a successful economy because its existence is predicated on our need to exchange things without killing too many people in the process.",
            "title_similarity": "0.7425004"
        },
        {
            "id": "i4uns24",
            "score": 1,
            "text": "Because it’s a Ponzi scheme where people will pull their money out if shit slows down and becomes self perpetuating leading to a death spiral",
            "title_similarity": "0.4990625"
        },
        {
            "id": "i4unu1v",
            "score": 1,
            "text": "Zero growth in economy per capita in the long run means that we aren't figuring out how to do anything better, new or more efficient. It means that the current standards of life are going to be what it is for all foreseeable future. It would mean that we have reached our practical limit or the limits set by fundamental reality and that humanity will either start its final communist utopia or go out in a bang.",
            "title_similarity": "0.7634964"
        },
        {
            "id": "i4up2qg",
            "score": 1,
            "text": "I'm probably totally wrong about this and maybe someone more educated in economics can explain or correct me.. but no one mentioned that the economy measures growth based on exchange of goods and services which said goods and services are exchanged with using a fiat currency system. This system of currency inherently had been engineering debt into it, so typically every dollar gained now and recent times that enterd the currency exchange was loaned out by a private banking system  (the Fed). The rate of which that dollar is loaned out out varies and is determined by \"officials\" who guage the economy/market. So essentially a government is borrowing future gains to supply currency now to grow the economy thinking available money means more transactions, which in turn causes an endless cycle of nessasary econmic growth as debt is constantly accumulating. That is why the Fed has been trying not to raise interest rates over the past decade, because it would contact the money supply and allow for a natural market correction of all the gains borrowed to prop the economy up over the past decade... this isn't even taking into account the debt governments reguarly operate at and grow each year  into account making growth nessasary....",
            "title_similarity": "0.6692586"
        },
        {
            "id": "i4up9sl",
            "score": 1,
            "text": "The economy needs to keep growing to \"succeed\" _under the current metrics for success_. That's what the metrics care about: growth. The whole system is designed around growth.\n\nThat's why the economic indicators used in many western countries have been criticized: they prioritize things like growth over other things like population health, happiness, scientific achievement, etc.\n\nIf you're only measuring speed, then only supercars will be successful. If you're measuring efficiency of shuttling people from point A to point B, a humble hatchback or a bus become measurable successes.",
            "title_similarity": "0.7672614"
        },
        {
            "id": "i4upij9",
            "score": 1,
            "text": "It’s nominal growth measured in usd. And since we’ve been made accustomed to ‘normal’ inflation of about 2-6% over the last four decades, this means the economy didn’t necessarily grew that much, jus that the dollars you’re measuring the growth in are worth less now than 40 years ago.",
            "title_similarity": "0.768602"
        },
        {
            "id": "i4uqffw",
            "score": 1,
            "text": "There's many theories and this is a major topic in macro economics if you're interested in reading into it further I suggest Greg Mankiw at the undergrad level and David Romer at the graduate level. I'll take a stab at an ELI5.\n\nA lot of it comes down to inflation and also social support systems.\n\nIf prices were expected to go down in the future (deflation), you and other consumers would likely hold off on buying things today to try to get a better deal tomorrow, which would slow down consumption. That spirals throughout the economy in a bad way. Companies make less goods, need less jobs, hire less people, lower hours worked, lower wages, people earn less, people buy less, and down we all go as a spiral.\n\nIf prices are expected to go up by a predictable amount (2% inflation), you and other consumers can plan your consumption/saving decisions over your life better. You're incentivized to consume today because goods will be more expensive in the future but you can predict how much you can consume today vs save for retirement. Consumer spending becomes more predictable, companies can plan production and labor better, hiring and paying more consistently (2% salary increases per year). Everyone wins when it's consistent and predictable. This is also aligned with human psychology of wanting more. We're all naturally programed to grow. It also supports improvements in quality of life through innovation like technology and health care. \n\nThe obvious other option is 0 inflation/deflation. This is extremely challenging to manage and doesn't encourage innovation or productivity. 200 years ago everyone was a farmer because food and water is our greatest need. Until technology was improved enough to automate food production, everyone was stuck farming.\n\nThe other reason is social support programs. The working generation today is paying for the support of the previous generation. If we didn't have continual moderate growth, there would be larger generational gaps as population swings. Swings would result in one generation getting excellent support, while the next would get less, etc. Constant growth helps save and prepare for changes in population.\n\n I'm sure you can already see emotionally strong emotions around generational gaps today. It would likely be much worse if we didn't have continuous economic growth.",
            "title_similarity": "0.77785206"
        },
        {
            "id": "i4uqhz6",
            "score": 1,
            "text": "Basically the predominant economic theory goes that as human population grows, we need innovative solutions for problems that restrict our growth. As we innovate, we create new products and industries. This correlates with an expanding economy. As to your follow up questions, we don't really know what happens when we run out of innovations or problems or when the population does not increase.",
            "title_similarity": "0.7884551"
        },
        {
            "id": "i4ur6ja",
            "score": 1,
            "text": "Thank you for this question! I've never understood this! Instinctually, my feeling is homeostasis serves best.",
            "title_similarity": "0.31141466"
        },
        {
            "id": "i4urdnj",
            "score": 1,
            "text": "It isn't a disaster, it is just heavily propagandized as one because the current Global economy is so far detached from any material concept of value that losing any momentum, even enough to create doubt that growth will keep accelerating, could cause the market to crash from runaway devaluation of wildly overvalued assets. The current market is amazing for billionaires because the system is so heavily gamed in their favor that their imponderable theoretical wealth lets them buy their way around any material circumstance, enabling them to keep rigging it in their favor. The longer they keep the current system going, the more concentrated all wealth will become, and the easier it becomes to keep it going. The only flaw in this little scheme is that eventually, when a material crisis does happen (famine, war, PLAGUE) the system instantly implodes as the pressing need to stay alive makes theoretical wealth worthless and the threat of instability crushes the notion that there will be growth. It's the reason the USA felt the need to give companies worth hundreds of billions of dollars taxpayer money equal to hundreds of billions of dollars after the COVID crash; without this infusion of cash, the promise of growth would fail and the economic trend would reverse. Instead, Corporations had a record profit year and have had them contiguously since then.",
            "title_similarity": "0.6900493"
        },
        {
            "id": "i4urjbt",
            "score": 1,
            "text": "Because of interest it has to grow. Not because of population. You need to make more money than you borrow, so you can pay your debt. So you need to grow",
            "title_similarity": "0.7058898"
        },
        {
            "id": "i4urr32",
            "score": 1,
            "text": "It doesn't. The economy need to constantly grow to ensure high profits for the wealthy. The large metropolitan area I live right outside of has this mentality. They will continue to grow the city until it is nowhere I would want to be. The traffic is already terrible half the time. If I wanted to live in NYC or LA I would have moved there.",
            "title_similarity": "0.7424744"
        },
        {
            "id": "i4usdz8",
            "score": 1,
            "text": "Because their are more humans that need to eat from a pie that needs to keep growing! \n.\n.\n.\nf*^k*#g Humans",
            "title_similarity": "0.48244077"
        },
        {
            "id": "i4usgi2",
            "score": 1,
            "text": "It’s not “required” it just grows, thats a side-effect of market incentives. Competition drives price down and quality up, business has to compete to survive therefor growth occurs.\n\nIf businesses stopped growing I suppose we’d be in a theoretically-imagined evenly rotating economy, which I highly doubt with the state of regulation on the market as it stands. As long as a product can be made at a lower cost or at a higher quality, there will be growth. \n\nProgressives on Reddit often parrot this “finite resources can’t sustain capitalism! Late stage capitalism! Muh social safety net!”, a lot of this is propaganda fed to them by the education system which itself tends to be more interested in indoctrination than teaching.",
            "title_similarity": "0.8075975"
        },
        {
            "id": "i4usla5",
            "score": 1,
            "text": "There's another reason people don't usually think about, entropy. It is not possible to stop being active and expect the universe to leave things as are. Maintenance in order to keep things working is also a contributor to growth. We need to replace things that break down, recycle their materials (were such a process is in place), feed consumables to machines, fuel, etc. Everything wears down and breaks in time. A lack of growth can also be a signal that maintenance is not being done and on the long run it means things—that produce the consumables and infrastructure we need to stay alive and comfortable— would break down. In real life, all living things need to aim for growth, even if just a little bit of it, just to keep up with entropy and avoid death.",
            "title_similarity": "0.6753891"
        },
        {
            "id": "i4usw7i",
            "score": 1,
            "text": "It's about \"succeeding\", it's about what people want.\n\n>Why is it a disaster if economic growth is 0?\n\nIt's not a disaster, but it's not desirable. For example, you probably enjoy the things that you have in your life, like your home, car, game console, sports equipment etc.\n\nYou probably want to have more of that next year, than you had last year? You'd like your life to get better, right?\n\nIf the economy doesn't grow, how will you get more stuff? If there is zero growth, the economy is a zero-sum game. In order for you to install AC in your house next year, someone else has to go without something if there's no growth. If the economy grows, you can both get AC.\n\n>Could there be a point where there's too much growth?\n\nNo, and lots of people like to say \"infinite growth isn't possible so capitalism is wrong\" but that's very stupid and they haven't thought it through.\n\nWe measure the economy with numbers. And we don't need \"infinite growth\" which is a phrase they use when criticizing, we only need \"unbounded growth\". There is a huge difference.\n\nThere's no reason why I can't pay a quintillion dollars for a beer in 3022 - no reason at all. I could pay a quintillion quintillion dollars for a beer in 4022, too. The only thing likely to pose a real threat to unbounded economic growth is the eventual heat death of the universe, and that would need it's own ELI5.\n\nGrowth is a good thing, it means we're producing more things that people want. Now growth is too much, because we want a lot, and when there is zero growth, we are not generating new jobs, so people at the bottom get screwed, especially younger people with less experience.",
            "title_similarity": "0.83357835"
        },
        {
            "id": "i4uubp9",
            "score": 1,
            "text": "There are two answers here:  \n  \n* Population generally increases over time, which means that without at least some growth actual individuals will see decreased quality of life over time.\n* Even if that were not the case, however, people tend to want more.  They want their resources tomorrow to be better than their resources yesterday.  And we rarely cultivate an idea of enough money.",
            "title_similarity": "0.8110339"
        },
        {
            "id": "i4uuc2c",
            "score": 1,
            "text": "It’s a simple answer really: Debt.\nEconomies are based on fake money (fiat currency) that is created entirely from debt. Then interest is added during this creation which creates a vacuum because interest is never created so it doesn’t exist.",
            "title_similarity": "0.551985"
        },
        {
            "id": "i4uudas",
            "score": 1,
            "text": "I feel we should go to zero growth, or minimal. We're in charge of the planet, so why does our species choose to spend our lives working away in miserable jobs?\n\nPeople like to be productive, don't get me wrong, but we spend too much of our life working. We need to rebalance things, the first step is 3-4 day work week.",
            "title_similarity": "0.69536346"
        },
        {
            "id": "i4uuj04",
            "score": 1,
            "text": "It is how the ponzi monetary system is designed....grow or die.  But essentially mimics all life in general really. You are growing or dying.....",
            "title_similarity": "0.5120591"
        },
        {
            "id": "i4uvm6t",
            "score": 1,
            "text": "It can't? Global capitalism is a machine that has been built to spill since day 1.",
            "title_similarity": "0.5976008"
        },
        {
            "id": "i4uwou0",
            "score": 1,
            "text": "The standard of living in the US, EU, Japan, S Korea, etc depends on labor and resources from less organized but resource rich countries that have a lot of people abused for their labor. The major trading powers, e.g. G6, have convinced or forced enough of the governments in poor countries that they can work towards similar standards of living in their countries by organizing their economies to provide the consumer goods and natural resources that enable the wealth and power of the rich countries to continue*. The system to enable this creates a huge imbalance in trade that the major trading nations try to disguise through financial nonsense and real, but damaging and unsustainable, resource and labor consumption, as well as careful control of the technological information that could actually improve the lives of people in poor countries.\n\n*I know how dumb that sounds.",
            "title_similarity": "0.69504976"
        },
        {
            "id": "i4uwtyz",
            "score": 1,
            "text": "Because people make babies and those babies will need jobs if they’re going to eat and have a roof over their head.  Generally, more babies are born than people who die, so economic growth is required.",
            "title_similarity": "0.71146"
        },
        {
            "id": "i4uwz41",
            "score": 1,
            "text": "Forget all these answers and know that you are well on your way to understanding the absurdity of the life and society in which we were all born. It’s all a huge crock of shit and we all just play along to survive. \n\nSorry OP, I want off this ride.",
            "title_similarity": "0.4545775"
        },
        {
            "id": "i4uxvws",
            "score": 1,
            "text": "I tried my best to answer in one post, but here’s an op-ed that summarizes the position arguing for zero growth but maintaining a high standard of living in Japan, which is a great case study to explore your question: [Can Japan have prosperity without growth?](https://asia.nikkei.com/Opinion/Can-Japan-have-prosperity-without-growth)",
            "title_similarity": "0.6656948"
        },
        {
            "id": "i4uy9hg",
            "score": 1,
            "text": "The true ELI5 answer is that *generally* (this is not true for every country), populations increase on a year by year basis. \n\nThe population of Canada in 2000 was 30.69 million people, and in 2021 it was 39.16 million people. In a 20 year span, this is an increase of 8.47 million people, or roughly 28%.\n\nIf the economy was not constantly growing, we would not have the jobs, infrastructure, products, etc to support constantly growing populations. If the economy was the same size now as it was in 2000, we'd likely have mass unemployment and shortages of products and goods.",
            "title_similarity": "0.80024546"
        },
        {
            "id": "i4uyp7i",
            "score": 1,
            "text": "Economic growth =\\= monetary growth. It means jobs. Why is it important more jobs are created?  Because population growth is always greater than 0",
            "title_similarity": "0.8233683"
        },
        {
            "id": "i4uyygg",
            "score": 1,
            "text": "Compounding debt. National debt exceeds Gross Domestic Product (GDP). We must continuously produce more dollars to pay lenders who let the government borrow money.",
            "title_similarity": "0.7189486"
        },
        {
            "id": "i4uz9gn",
            "score": 1,
            "text": "It's because banks provide loans on an interest. If you borrow 100 dollars from a bank and at the end you have to pay back 110, that plus 10 dollars must come from somewhere. And money can only be 'created' by asking for further loans the interest of which you will also have to pay back in the future. \n\nIt's not the 'economy' that needs the growth - it's the banks.",
            "title_similarity": "0.6913096"
        },
        {
            "id": "i4uzds8",
            "score": 1,
            "text": "Do you want a raise this year? So does everyone else.",
            "title_similarity": "0.5570909"
        },
        {
            "id": "i4v02le",
            "score": 1,
            "text": "Humans are rarely content. The economy growing is a direct result of the demand of humans for new and nicer things. That demand makes for opportunities to generate wealth for yourself, and thus you gain better nicer things. If the cycle stops there’s no chance of improving your circumstances and people get unhappy. That traditionally leads to violence",
            "title_similarity": "0.7032857"
        },
        {
            "id": "i4v0bxq",
            "score": 1,
            "text": "The economy does not have to grow.  \n\nAnd yes there is such a thing as too much growth.  If you burn up scarce resources in a non-efficient way you can grow in the short term at the expense of long-term sustainability and growth.\n\nIn general, it's not the size of the economy that matters, but rather the efficiency.\n\nThe idea that the economy has to continuing growing year after year is stupid claim put forth by certain idiot politicians because stupid voters believe it. And then it is used as a straw man by equally stupid Marxists to criticize Capitalism.\n\nSo, because both the right and the left are equally ignorant of economics, the myth persists because it's ammunition for both sides.\n\nNothing in free market economics says economies have to keep growing.  They have tended to do so, because we are still making advancements in technology and increasing globalization provides more opportunities for trade and efficiency.",
            "title_similarity": "0.80290294"
        },
        {
            "id": "i4v0fi0",
            "score": 1,
            "text": "In the late 60s early 70s there was a lot of concern about the “population explosion”. This was when worldwide population was approaching 3 billion. Big business said more people more customers. Then we invented disco music. The rest is history.",
            "title_similarity": "0.64276433"
        },
        {
            "id": "i4v0m9n",
            "score": 1,
            "text": "Because we live in a debt based credit system. So we lent money from the future with interest (bonds) that needs to be paid back by creating more value. This system will stop working within the next few years because it’s a broken system.",
            "title_similarity": "0.7415106"
        },
        {
            "id": "i4v10x9",
            "score": 1,
            "text": "Only capitalism requires infinite growth, and it's because the whole system is predicated on an average publically traded stock seeing a 101% or so return. Because that is true, the uber-wealthy feel safe investing vast sums of money across the exchanges. Most of the businesses on the NYSE have built themselves to be reliant on this form of investment.\n\nWhen your employer sees a 10% boost to profits and you get nothing, it's because the ownership sent it out, in one way or another, to their investors. Even though they didn't do any of the work. Because they have money, it is a safer bet for your employer to pay out dividends than it is to pay employees more, as the entire capitalist system works to ensure that any given worker is replaceable\n\nThat's why all the corps hate unions: they allow the workers to wield enough power to force the dividends to go to the people who actually created them in the first place.",
            "title_similarity": "0.7151246"
        },
        {
            "id": "i4v1bfw",
            "score": 1,
            "text": "I'll also add that as the economy continues to grow the government can take on a larger burden of debt relative to the growth. This is a hot topic for economists, with a split between what are called classical economists and keynesian. However, if the country were to stop growing, then it would have the very harsh repercussions of that debt to face.",
            "title_similarity": "0.738184"
        },
        {
            "id": "i4v1zo9",
            "score": 1,
            "text": "This is the economics answer. Economics does a great job obscuring the larger truth usually. The real reason the economy must keep growing is because shareholders of stocks demanded that they get profits from their investment. If a publically-traded company doesn’t grow the executives can be sued as a breach of their “fiduciary responsibility”. That is to say, growth is mandated because the shareholders want to get richer.\n\nFurthermore, with the advent of the fossil fuel industry and oil in particular, the amount of energy we had at our disposal especially beginning in the 1950a went up by orders of magnitude. With the invention of plastic, all of a sudden, the cost of making consumer goods went way down. How many of you have any metal buckets hanging around the house? Plastic?\n\nSo with modern factory production and plastics on-line, the problem was in order to keep growing they needed to convince people to consume more. That’s when the concept of a “consumer” was really born, and advertising began to perfect the art of stoking people’s insecurities to get them to buy a never-ending conveyor belt of goods. “planned obsolescence” was invented because if goods lasted too long, people would stop buying as many.\n\n“capitalism” as a system is the process of doing whatever it takes to “grow” “capital” — aka money /la& investments. That’s really the only intrinsic goal baked into the system. Economics in general has a shitty track record of accounting for “externalities” … namely the costs to society and the environment for whatever the economic activity is. Some economists have advocated for “true cost” to be calculated, which can be though of as “economists need to learn how to subtract”.\n\nFast forward 70 years and microplastics haunt the oceans and are literally found in our bloodstream, we are at 412 parts per million CO2 in the atmosphere (when we were at 350 ppm before the industrial revolution) and the icecaps are melting.\n“Growth above all else” is making people unhappy, and making the planet uninhabitable for modern society while we are at it.\n\nUnregulated, unfettered capitalism is literally insane at the systemic level, and yet here we are.\nAnd this is much more so a problem of “consumer culture”, than it is population. The carbon footprint of a wealthy American is 20x or more than that of someone in many other parts of the world. And that wasn’t the case 80 years ago.\n\nOh… and the concept of “carbon footprint” was invented by a PR firm working for British Petroleum to shift the responsibility for burning oil onto the consumer, while BP continued unchecked growth and profit from the supply side. And the concept of “recycling plastic” was literally invented and pushed by the American plastics industry to make consumers feel better about buying endless plastic crap and having everything wrapped in plastic packaging —- while the industry knew that 90%+ of plastic was not recyclable in municipal waste streams.\n\nI’m too tired right now to find links and citations for all of this, but most of it is out there if you search.\n\nHappy Friday!",
            "title_similarity": "0.74602705"
        },
        {
            "id": "i4v2sih",
            "score": 1,
            "text": "We will in a world of an expanding money supply (money printing) so even if you have 2 percent inflation you need economic growth just to make up for that.",
            "title_similarity": "0.77353466"
        },
        {
            "id": "i4v37gn",
            "score": 1,
            "text": "The economy is basically a living system, and when something living isnt growing, its dying. Economic death would lead to society dying which would lead to the fall of man. There you go.",
            "title_similarity": "0.57895476"
        },
        {
            "id": "i4v3cq3",
            "score": 1,
            "text": "It's a pyramid scheme funneling everything to the top.   Like all schemes, it needs unlimited growth to pay out today what was promised tomorrow.   In the end, it will crash.  *looks outside* \n\nOh. Right.",
            "title_similarity": "0.65308523"
        },
        {
            "id": "i4v3d7u",
            "score": 1,
            "text": "I’d like to ad to that in a different way…”when does $100 TRILLION dollars become worthless/too much?” How did we get to a point where a trillion dollars is acceptable?",
            "title_similarity": "0.63612306"
        },
        {
            "id": "i4v3rod",
            "score": 1,
            "text": "Our implementation of money is based on debt.\n\nBanks create money.\n\nIf you borrow 100k from a bank, they enter that in the system and... POOF! 100k now exists.\nBut you have to pay back 125k. That additional 25k was not created. You have to get it somewhere.\n\nIf things stay as is, there isn't enough money in the system. Keeping it at its current size isn't sufficient, because it's built on speculation on future growth.",
            "title_similarity": "0.76338476"
        },
        {
            "id": "i4v40xb",
            "score": 1,
            "text": "Two basic reasons, population growth, and slight growth is easier to manage than contractions economically speaking.",
            "title_similarity": "0.5104618"
        },
        {
            "id": "i4v4d74",
            "score": 1,
            "text": "There's a lot of nuance in what times it is or isn't objectively good to have some amount of economic growth (based largely around things like technological progress and population change), but the real reason it \"has\" to keep growing so much every single year is just to preserve our current fucked-up system of rapidly concentrating more and more wealth into the hands of the already-obscenely-wealthy elite, the average well-being of the general population be damned. \n\nBarely-restricted capitalism as we currently allow it requires constant growth, but that economic system is far from the only way of doing things in theory.",
            "title_similarity": "0.810249"
        },
        {
            "id": "i4v4w75",
            "score": 1,
            "text": "It doesn't. People call growth success because they think death and starvation are bad things. Human growth has its limits and the economy tries to find ways to see that limit increased.. it fails because that's the same thing as success.",
            "title_similarity": "0.72355354"
        },
        {
            "id": "i4v577r",
            "score": 1,
            "text": "The economy does not need to keep growing, but that doesn't seem to have dawned on a number of people. You can read the angst of people studying the decline in human fertility and projecting falling human population. They see this as a problem because it will become too hard to make the economy keep growing. They offer solutions such as increasing immigration and cajoling  women to be baby ovens as well as productive workers. \n\nIf the population is increasing there is good reason to want the GDP to increase, the GDP per capita is at least maintained. \n\nArtificially increasing the population through immigration or bullying women simply so that we can increase production is insane.\n\nThere is an explanation for it when you consider the fact that the vast majority of all new income goes to a very small section of very rich people. We must keep increasing the GDP so that rich people get richer.",
            "title_similarity": "0.76328486"
        },
        {
            "id": "i4v5qmj",
            "score": 1,
            "text": "In regards to the market. The stock market and investing as a whole is based on future growth. Not today’s profits or today’s profits being the same as yesterday. If there is no economic growth then there is no point in investing, why put a $1 in today to get a $1 back tomorrow when you can use and enjoy that $1 today. Growth provides the incentive to invest in the future. \n\nInvesting can include starting a business or anything else. The problem is if the economy doesn’t grow then there is no incentive to start new businesses, expand businesses, etc. The new incentive without growth is to save and hoard as much money as you can. \n\nThere is a lot more to it but that’s my ELI5 answer.",
            "title_similarity": "0.82685417"
        },
        {
            "id": "i4v66hx",
            "score": 1,
            "text": "I actually believe we should adopt a form of capitalism which I would model a bit like a trapezium where we work out exactly what kind of health care, education system, social program and justice system we want, like shopping, then work out how much that will cost and tax proportionately. I find it a really strange system where we just shrug and go ‘no money for children’s food’ or whatever, it is crazy really. I know people will go ***well cut the clothe to suit the means***, but the means is being decided here, it isn’t just random and pulled out of a hat or like conservative viewpoints with this perversion of cutting or keeping taxes low regardless.",
            "title_similarity": "0.6277035"
        },
        {
            "id": "i4v6keq",
            "score": 1,
            "text": "Because for most of the world population keep increasing, if you have the same level of economy but larger population then more people slid down closer to poverty\nIt's much complicated than that tho",
            "title_similarity": "0.72979474"
        },
        {
            "id": "i4v6wu8",
            "score": 1,
            "text": "There is also a fundamental investment need for growth. Almost all business requires investment (debt or equity) to function. That debt (loans, bonds, etc.) or equity (partnership interest, traded stocks, etc.) require someone to give a business cash in exchange for more cash tomorrow, next year or some other time in the future.\n\nIf you say the economy will remain static with no growth or decline, then no bank will lend businesses, because there is no room to grow revenue to pay back interest. The business wouldn't even be able to pay back principal, assuming they spent cash on a new machine. And the stock market would have no value. We put our money \"at risk\" in the market in the hopes of more money tomorrow. Zero growth means at best we only get our original money back, assuming no fees, credit/default risk, etc.\n\nEssentially in order for any economy to work (not just a capitalist one), there has to be a reason to believe tomorrow will hold more value than today. If tomorrow holds the exact same value as today, then why spend or risk money to get anything done, built, researched...",
            "title_similarity": "0.78609467"
        },
        {
            "id": "i4v76b7",
            "score": 1,
            "text": "The key to balance is absolving debt and eliminating interest. Simply put we as society lives  beyond our means and requires growth in order to remain solvent.   \n\n\nWe passed the point of too much grown about 6 billion people ago.",
            "title_similarity": "0.7254604"
        },
        {
            "id": "i4v77ho",
            "score": 1,
            "text": "Black holes of greed, AKA the rich, wouldn't be able to buy vitally important things like yachts or second homes in the country if there was no growth. They never stop searching for ways to make more money, because if they don't make more money they might not be able to afford their third luxury car, and that would never do.",
            "title_similarity": "0.67831594"
        },
        {
            "id": "i4v7fkm",
            "score": 1,
            "text": "It doesn't, but Capitalism demands that you attempt it otherwise you end up homeless and starving. It's not sustainable which is why our governments and planet are going to hell.\n\nThere are reasons an economy does grow due to growing population size and the needed infrastructure to support that, but the idea that it NEEDS to is so that those who benefit from that growth get to benefit from it further and grow their power and influence.",
            "title_similarity": "0.76985055"
        },
        {
            "id": "i4v841q",
            "score": 1,
            "text": "It doesn't. There's no reason the economy should grow. As long as it's in sync with consumerism there's no real issue.\n\nThe only thing that would realistically happen is that stock markets won't go up anymore, but stay flat or even decline. Which is not a problem. It only means rich people won't automatically become even richer.",
            "title_similarity": "0.6144582"
        },
        {
            "id": "i4v8e20",
            "score": 1,
            "text": "It doesn't  NEED to. But you would also need to be maintaining a stable 0 growth population and low relative inflation.\n\nAlso if this went on for multiple years would likely seriously hamper most mud to high return investment strategies as they rely on consistent exponential growth to function. Basically low/no growth makes it hard for the investor class and retirement accounts to get reasonable returns on their investments. Which would cause a lot of bad things with how the current economy operates in the US and most countries.",
            "title_similarity": "0.80622256"
        },
        {
            "id": "i4v8rqa",
            "score": 1,
            "text": "1000 dudes can make x amount of stuff.\n\n2000 dudes should be able to make at least 2x amount of stuff.\n\nIf you HAD 1000 dudes, and were making x amount of stuff, and now you've got 2000 dudes, but you're still making 1.8x amount of stuff (not 2x) then you've got a problem, and someone isn't going to have stuff.\n\nMaybe you can stretch some stuff, and maybe there's some dudes that figure out if everyone gave a few bucks to a pool of money, they can make sure that the dudes that don't have what they need, can still get by.\n\nMaybe you're REALLY clever about it and after all is said and done, only 3 out of the group end up without a home, and without a proper place to sleep.\n\n3 out of 2000, that don't have a proper home. That's absolutely fucking awful for those dudes. But we can see why that happens. It isn't acceptable. But it very nearly unavoidable.\n\n\nMultiply those 2000 folks by 164,750 and you get within spitting distance of the population.\n\nMultiply those 3(.4ish) people by that same 164,750 and you get within spitting distance of the homeless population in america.\n\nLastly, Imagine what happens if the rate of economy growth lags behind population growth by 1/10th of 1.\n\nThat's another 300+ ish people immediately made homless.\n\nIt's WAY easier to become homeless than to become \"no longer homeless\".\n\nSo, when the economy stabilizes, those folks are still homeless. Many of whom will never recover.\n\nJust the fluctuating \"negligable margins of ERROR\" destroyed 300 people's lives.\n\nLosing 10% of a countries economic growth (a less positive rate of change, not just a dip in gdp) for example, has a PROFOUND and devastating effect on the people living there.\n\nPopulations are growing exponentially. Take a moment to look at \"population growth over time\". Wikipedia hasl a great chart, from multiple sources.\n\n11000 years ago, estimate 4 million humans.\n\n2000 years ago, 200 million ish humans.\n\nAlright, 9000 years difference. Pop doubled eh... 6.5 ish times over.\n\nToday? 7.75ish BILLION people.\n\nIn 2000 years, pop doubled 16 freaking TIMES!!!\n\nIn about a quarter of the time, the pop rate sped up by a factor of 3. And in the next 500 years, it will have sped up AGAIN by an additional factor of 4 or 5. Barring something cataclysmic and awful happening.\n\nEconomies need to run absolutely RAGGED to keep up with that kind of monstrous exponential growth.\n\nNever mind the competition of our economy against the economy of other groups who's moral paradigms are diametrically oposed to our own.\n\nAnd everything else that's going on.\n\nEconomy isn't just $. It's the result of the combined sweat and effort of 1/3 of a millenia of human experience. It is the bleeding edge, and the penultimate crown jewel of every single human or protohuman that has ever drawn breath, bending their attention, and often times their straining backs, to one, singular goal: the prosperity and furthered continuance of our species.\n\nIt is the basis for society, the foundation of cooperation, and at it's core, relies on the same principles which drives humans to self improve.\n\nErgo, it is directly related to the prosperity of a population. And in THAT sense, it's a measurement of how well any particular society is functioning, in an ALMOST objective way.",
            "title_similarity": "0.6065137"
        },
        {
            "id": "i4v9aio",
            "score": 1,
            "text": "A country is just like a company.\n\nIf your company doesn't grow, you can't afford to give people raises. You can't afford to promote people. You can't afford to stay competitive with things like research and development opportunities or new acquisitions. You must always grow to succeed.\n\nCountries are in competition with each other. If you have one economy growing but another one is standing still - you will quickly lose elections or be the victim of unrest / outside takeover.",
            "title_similarity": "0.78790855"
        },
        {
            "id": "i4v9lpy",
            "score": 1,
            "text": "Another way to answer this question is to look at how banks (in the Western world) work. Banks in, say Europe and US, are allowed to lend out around 10 times as much money is they “own”. That is, if a bank “owns” 100 billion Euro, that bank is allowed to lend out 1000 billion Euro. \n“Most people” leave their money in the bank or in some financial assets such as stock and therefore don’t need to withdraw their hard cash. Therefore, the banks can lend out more than they own.\nThis is something that started in the 19. or 20. century to enable faster economic growth. And boy did it make our economies grow faster!\n\nThe reason this system works is that we always expect to become better, wiser, more efficient etc. at everything we do because of, for instance, research. And so far, this has been the case. For instance, it has never been cheaper to buy a mobile phone, computer, or 1000 calories of food, and as a civilization, we have never been better off. Since we expect ourselves to become better/more efficient/more effective every day/year/decade, this system works.\nOn the other hand, if the economy stopped growing - as in full stop for many years or even decades - the system would eventually fail to work.\n\nIf you want to learn more about this, I recommend reading “Homo Sapiens” by Yuval Noah Harari. This books explains all of human history including our financial system and how the economic model in the Western world works.\nhttps://www.ynharari.com/book/sapiens-2/",
            "title_similarity": "0.6078843"
        },
        {
            "id": "i4va14u",
            "score": 1,
            "text": "My limited understanding of economics, specifically the capitalist model used here in the USA is that there is always an elastic boom to bust to boom cycle that continually happens that is hopefully tempered somewhat by central Bank policies with interest rates",
            "title_similarity": "0.73254466"
        },
        {
            "id": "i4va9bm",
            "score": 1,
            "text": "It's not what economies require, it's what capitalism requires. All capitalism is predicated on the notion that every investment will have positive returns. So we bolster our numbers by printing money and creating debt which leads to inflation. Meanwhile we have deflationary pressures working against this goal like technology, which increases efficiency and allows us to produce more goods and services at lower costs. You would think that prices would be going down due to this, but they don't because we just create more and more money and more debt so that the numbers keep going up. Eventually it's all going to blow up in our face.",
            "title_similarity": "0.7516755"
        },
        {
            "id": "i4vba0n",
            "score": 1,
            "text": "Unrestrained exponential growth is the operating mode of a cancer cell.\n\nPlenty of people will tell you it’s necessary to keep improving quality of life, but you should always keep this in mind as an explanation for why such growth should be carefully observed, managed, and in some cases requires treatment.",
            "title_similarity": "0.5744198"
        },
        {
            "id": "i4vc13q",
            "score": 1,
            "text": "Because if billionaires don't get richer, what is the point of anyone else even existing? \n\nHail Elon!",
            "title_similarity": "0.6830491"
        },
        {
            "id": "i4vc3yr",
            "score": 1,
            "text": "Just asking the question is a good sign.  They say businesses always have to be growing or they are dying as well.  And it just boggles the mind.  We can't always be growing because we have finite resources.  We're already straining things as it is.  The real answer is that Capitalism is bad, businesses always growing and only caring about making money is bad, and it's all unsustainable and destroying the planet for human habitation.  We need to change.  We need Socialism",
            "title_similarity": "0.71372485"
        },
        {
            "id": "i4vcszd",
            "score": 1,
            "text": "Economic growth is a variable term. The stock market being successful doesn’t mean every stock increases in value it just means the amounts of buying and selling of those stocks is occurring. The Great Depression happen mostly because people stopped buying and selling, instead just holding onto money.",
            "title_similarity": "0.76009953"
        },
        {
            "id": "i4vdd23",
            "score": 1,
            "text": "The stock market is how most everything gets their money. Banking, insurance, government bonds and debt etc. they have to have growth to have money and the growth is dependent on publicly traded companies ever increasing stock value.",
            "title_similarity": "0.6513323"
        },
        {
            "id": "i4vdykv",
            "score": 1,
            "text": "Shareholders fuck us all. They are the end-all-be-all of late stage capitalism. If corporations don't realize this, we're fucked. Sorry for my negative take.",
            "title_similarity": "0.51627135"
        },
        {
            "id": "i4ve6jb",
            "score": 1,
            "text": "Growth needs to reflect both population and technology. For certain technology advances every year, and ideally should even overcome contractions in population. No growth means that something bad is happening that is countering that, which leads to less wealth for the population. Less overall wealth means a lower standard of living than what's possible.",
            "title_similarity": "0.84564674"
        },
        {
            "id": "i4vef8p",
            "score": 1,
            "text": "Debt is the true reason. \n\nMost of the common, popular explanations for the \"need\" for growth are predicated on certain assumptions. For example, assuming population growth or assuming growth in demand for public services. It's possible that population growth may stop. And likewise it's at least possible to conceive a level of public services that satisfies the net demands of everyone. But debt, and specifically the charging of compound interest on debt, essentially requires growth in order to satisfy the compound accumulation of interest.\n\nIn the earliest barter systems of economics \"money\" was debt. People arranged to exchange good and services between one and other, negotiating to agree upon value. But inevitably some transactions were not immediate. The cobbler agrees to make shoes for the chicken farmer in exchange for a half dozen eggs every week for a year. The shoes may be ready in a week. But some means of recording the egg debt is needed. Currency is created for that purpose. Could be coinage. Could be shells. Could be a pair of sticks with notches in them.\n\nSo it's important to understand that without debt there is no money. Money is debt. Now the minute a party on the delay side of a transaction begins to charge interest on the value owed, some growth in the overall value of goods and services in the \"economy\" *is absolutely required.* \n\nIf we look back at the cobbler and the chicken farmer, if the agreed upon \"same day\" value of the cobbler's shoes is 312 eggs, but the cobbler demands an interest rate of one egg per month, then the transaction is completed with 324 eggs. In an economy at theoretical equilibrium (all transactions are balanced) the other dozen eggs must come from growth. The farmer must increase his productivity to cover the debt of twelve additional eggs. The farmer has to work longer hours, or invent some chicken farming innovation in order to produce more eggs (remember, we said the economy was in equilibrium).\n\nNow, of course, a cobbler and a chicken farmer in a barter economy might not arrange things this way. But as soon as we introduce bank currency and bank lending into their economy, then it become inevitable.",
            "title_similarity": "0.71726274"
        },
        {
            "id": "i4vexd7",
            "score": 1,
            "text": "Population 1, $1 divided amongst everyone. 1 job\n\nPopulation 2, economy no grow, $1 divided amongst everyone. 1 job  \nPopulation 3, economy no grow, $1 divided amongst everyone. 1 job  \nNot good  \nPopulation grows, as it grows you don't want the people to be in a vegetative state you want them to work, create 'value', etc. Technology also advances, meaning 1 person can make $2 worth of product but still get paid $1 because it was still around $1 of work but $2 of value was created. We don't tell them, hey just make 1 product still here is .50c, we say keep putting in 40 hours and make 2 products - and they may not like it but they need $1 to live so its life.",
            "title_similarity": "0.74286306"
        },
        {
            "id": "i4vey20",
            "score": 1,
            "text": "Well because currently people are using capitalism as the economic ideology which based on infinite growth in theory but in reality that is impossible. \n\nThis is my expression when talking about corporations or businesses. You either see yourself become a monopoly or see yourself become a subsidize entity. Either you become Apple or AT&T/PG&E/Farmer Corporations etc.",
            "title_similarity": "0.7137641"
        },
        {
            "id": "i4vfa8h",
            "score": 1,
            "text": "Lots of bad things tend to happen, all at once when there is a recession (shrinking economy). \n\n1. Businesses stop investing because they fear that they won’t see that money back. This means everything starts getting old/tired/broken. \n\n2. Unemployment rises and getting any kind of paid work becomes stressful. \n\n3. Government income plummets because no one is doing stuff that can be taxed, so they lose their ability to improve the country. \n\nAll of a sudden, everyone seems broke and bitter about it. These things aren’t a part of some natural law, but generally recession tends to bring grief, so governments try to avoid them starting up. They can also be self perpetuating.",
            "title_similarity": "0.6861485"
        },
        {
            "id": "i4vfkgr",
            "score": 1,
            "text": "“The Economy” is a concept, not a tangible thing. The economy is “good” when people think it’s good, and it’s “bad” when people think it’s bad. \n\nIf people are worried about the future, they don’t invest in the future by buying things and hiring people. Then, other people see that as “evidence” that the economy really is “bad,” so they stop buying goods and services and investing in growing their businesses because they don’t think it will pay off, etc. \n\nTo a great extent, economic forecasting is a self-fulfilling prophecy, which is the reason Fed Chairmen, to take a random example, are extremely careful about what they say about the state of “the Economy.”",
            "title_similarity": "0.69934994"
        },
        {
            "id": "i4vfucz",
            "score": 1,
            "text": "Because capitalism requires infinite growth at the detriment of the population so the capitalists can infinitely sustain their domination of the governments and markets.",
            "title_similarity": "0.6508447"
        },
        {
            "id": "i4vgzds",
            "score": 1,
            "text": "A group at MIT posited there are limits to growth. You can check out their 1972 classic book, Limits to Growth. Gaya Herrington at KPMG tested the 1972 assumptions in 2019 and essentially proved the 1972 assumptions are accurate. So yeah, there are limits to growth.",
            "title_similarity": "0.6617456"
        },
        {
            "id": "i4vh3qq",
            "score": 1,
            "text": "There have beed studies showing that at some point economic growth doesn't increase happiness. So then when to stop growing? For rich countries the sooner the better since we use so many resources for no apparent reason.",
            "title_similarity": "0.7983297"
        },
        {
            "id": "i4vhbmo",
            "score": 1,
            "text": "> Can it reach a balance between goods/services produced and goods/services consumed and just stay there?\n\nYou could, if the population wasn't entirely dependent on wages for income.\n\nAmong the jobs people do, are jobs creating new businesses. Constructing new buildings. Manufacturing and installing new equipment. Things like that. For any given enterprise, there is more work involved in establishing a business than operating it. If that weren't the case, the business wouldn't be profitable. Thus, once a business is established, a bunch of jobs go away.\n\nNow, so long as those people have other jobs to go to, they can continue to live their lives, buying the things they need using the money they make at their jobs. But if this *stops*, those jobs don't just go away at one site or another. They go away entirely, until something needs to be replaced entirely.\n\nNow you have the same number of people, but fewer jobs. Total wages goes down. Competition for remaining jobs drives down wages per person. All of this lowers consumer demand, forcing manufacturers and vendors and such to reduce production... meaning you've got even more people either with reduced or eliminated employment. Same number of people, even fewer jobs.\n\nThus, the once the economy stops expanding, it will actually start contracting, because a significant portion of the economy is dependent on revenues from industries involved in expansion.\n\nIf there were some kind of an institution in place that allowed people to continue to contribute to demand (ie. to buy stuff and thus continue enabling businesses to pay the workers that are still needed) despite the drop in employment, then it would be possible to have an economy that can sustain without growth.",
            "title_similarity": "0.7235929"
        },
        {
            "id": "i4vi0sy",
            "score": 1,
            "text": "Because of inflation. If you grow 0% and inflation is 5%, you actually are getting 5% smaller, if you grow 5% with 5% inflation you stagnate. LOL fiat money",
            "title_similarity": "0.61382306"
        },
        {
            "id": "i4vi7vm",
            "score": 1,
            "text": "If you cannot borrow against the future, the percentage growth you cannot borrow against has a exponential effect on the resultant decline of the economic capacity of the present. A drop from 3% per annum growth rate to 0% would reverberate down the chain and have a much larger than 3% effect on the present.\n\nFor an extreme example of sorts, look what happened to speculative tech stocks due (simplifying here) to a 6% increase in inflation (inflation can partly be thought of as negative real growth rate) - they dumped 60-90% in value in a span of a few months.\n\nThe effects are nonlinear. \n\nThere is such a thing as too much growth. For example, if the USD gets too strong, that causes various issues internationally due to the USD’s use as a reserve currency. \n\nFYI I am not an economist or central banker, and know basically nothing about the economy.",
            "title_similarity": "0.7961695"
        },
        {
            "id": "i4vidd8",
            "score": 1,
            "text": "“ANYONE who believes that exponential growth can go on forever in a finite world is either a madman or an economist”\n\n-(economist) Kenneth Boulding",
            "title_similarity": "0.6181182"
        },
        {
            "id": "i4vioys",
            "score": 1,
            "text": ">Why is it a disaster if economic growth is 0? \n\nThe population goes up.  If the economy doesn't keep pace, then people will have no money to buy food.",
            "title_similarity": "0.85352504"
        },
        {
            "id": "i4vj4n6",
            "score": 1,
            "text": "We're reaching the point where we are going to have to figure that out.\n\nNone of these answers are going to solve it because economists themselves are faced with this problem right now.",
            "title_similarity": "0.5304601"
        },
        {
            "id": "i4vjrdf",
            "score": 1,
            "text": "If your economy doesn't grow, it will fall behind other economies that do grow. Therefore, stagnating means falling behind and becoming less competitive. Therefore, not growing means failing in the near future.",
            "title_similarity": "0.76077354"
        },
        {
            "id": "i4vktum",
            "score": 1,
            "text": "It doesn’t that’s a Capitalist lie and people telling you otherwise are lying and exploiting you most probably (economic scientists)The fact economic and science are part of the same sentence is insane. Sorry fucks your wrong where does the climate come in for economics or people? Externalities lol depraved people! DE - GROWTH is the only way to maybe save the planet and the human spices! This Civilization is cringe as fuck let’s END -CIV. https://youtu.be/RpfmyI42PYw READ Desert! https://theanarchistlibrary.org/library/anonymous-desert",
            "title_similarity": "0.6332223"
        },
        {
            "id": "i4vkw36",
            "score": 1,
            "text": "Because the goal of exploitationism (much more honest of a word than capitalism) is to get enough money that you can begin ~~leaching~~ generating a passive income.",
            "title_similarity": "0.60233647"
        },
        {
            "id": "i4vlah5",
            "score": 1,
            "text": "Probably an interaction with how investment and retirement plans work (stock market) and how debt is managed from a small business to national level. Loans are taken out with the expectation of growth to pay off the loan in the future.",
            "title_similarity": "0.6505358"
        },
        {
            "id": "i4vlfom",
            "score": 1,
            "text": "You'll get a low of answers here but essentially it boils down to this. Most of the money that is produced in the United States has nothing to do with goods or services being sold and everything to do with the trade of ownership in the companies that produce them. I.e. the stock market. If people have no motivation to invest their money into the stock market because it won't grow and make them a profit for doing nothing then businesses won't have the capital they need to sell and produce meaningless goods and services which means even less investment. Which means even less meaningless jobs selling meaningless shit for no other reason than to make rich people more money. \n\nThe entire economy depends on a bunch of filthy rich people sitting on their asses trying to make more money sitting on their asses. \n\nAnd that's why we're fucked.",
            "title_similarity": "0.6827483"
        },
        {
            "id": "i4vlg4u",
            "score": 1,
            "text": "because the tenets of free market capitalism was developed during the massive expansion of the west. \"infinite\" growth was effectively possible (as long as you were willing to displace indigenous people, which they definitely were) in the early days of the united states",
            "title_similarity": "0.54607713"
        },
        {
            "id": "i4vlhsu",
            "score": 1,
            "text": "It's a made up system that no one needs to survive. The monetary system needs it to survive.",
            "title_similarity": "0.4680466"
        },
        {
            "id": "i4vm82z",
            "score": 1,
            "text": "It boils down to two things. Randomness and war (or competition). \n\nRandomness from population birth and death. This affects the resources needed. Even if one society (or even an organism like a bird) were to perfect the equation and reach equilibrium between population size and resources needed it doesn’t stop another society or organism from coming along and wrecking their day with their pursuit of growth.",
            "title_similarity": "0.64013594"
        },
        {
            "id": "i4vmjn7",
            "score": 1,
            "text": "People keep having babies. The economy needs to grow to support the new people. If it stays at 0, people are going to have a hard time making a living.",
            "title_similarity": "0.77407175"
        },
        {
            "id": "i4vnfpz",
            "score": 1,
            "text": "A good way to think of it is using the idea of pressure.  If there is a bit of excess pressure, it causes things to swell and grow slowly.   If there is no excess pressure, a balance, then things stagnate.  Cracks are not forced open wider (opportunities are not taken), bits fall off and aren't replaced (nothing to come in and take its place).  A blobby flowing thing like an economy needs a bit of positive pressure to keep its shape and spread.",
            "title_similarity": "0.6208646"
        },
        {
            "id": "i4vo5hn",
            "score": 1,
            "text": "More people + more people escaping poverty. No growth means the number of people escaping poverty doesn't exceed the number of people entering poverty.",
            "title_similarity": "0.66688466"
        },
        {
            "id": "i4voa29",
            "score": 2,
            "text": "Because they want to always have inflation. It’s all to complicate the system so most people won’t be able to understand how much of value of your productivity goes to the people at the top.",
            "title_similarity": "0.6564226"
        },
        {
            "id": "i4voplv",
            "score": 1,
            "text": "Publicly traded companies (those with stocks that can be bought/sold by any investor) have expectations of growth set so the value of the company continues to increase (which drives the decisions made at the head of the company). Increased value gives investors a positive return on their investment (stock prices go up) and since this need for increase never goes away, it becomes a constant demand.\n\nYes, a company could thrive just fine at a steady level of profit, but if it is publicly traded, the investors will either back out and cause stock value to fall, due to the lack of growth or they will vote to remove the leadership in favor of someone who will run the company in a manner than keeps the stock prices moving upward.",
            "title_similarity": "0.74088115"
        },
        {
            "id": "i4vpdvq",
            "score": 1,
            "text": "Related, Important read: Prosperity Without Growth: Economics for a Finite Planet https://www.amazon.com/dp/1849713235/ref=cm_sw_r_cp_api_i_M1T3CWE3X9H5D1BE71MV",
            "title_similarity": "0.57088435"
        },
        {
            "id": "i4vpfgw",
            "score": 1,
            "text": "If population achieves a steady state, the housing market will experience a big loss in work. Car sales will slow but not disappear. Food growing and distribution will be relatively steady.",
            "title_similarity": "0.69634163"
        },
        {
            "id": "i4vpkk1",
            "score": 1,
            "text": "Our economic system depends on people borrowing money, and paying back a little more money than they borrowed.  If economic growth is zero, people are losing money when they pay back their loans.",
            "title_similarity": "0.70964"
        },
        {
            "id": "i4vpsmh",
            "score": 1,
            "text": "Go to Odysee.com and watch the documentary “Money as debt”.\n\nThat’ll answer your question better than Reddit ever could.",
            "title_similarity": "0.51710063"
        },
        {
            "id": "i4vqdjh",
            "score": 1,
            "text": "Do you wanna make the same amount of money the rest of your life? Or do you wanna better yourself?",
            "title_similarity": "0.65555274"
        },
        {
            "id": "i4vqizz",
            "score": 1,
            "text": "As an (aspiring) economist, I'm hopefully qualified to answer these questions, though much of my answer is basically from intuition.\n\nLet us begin with the more conventional questions, and then move on to the more interesting.\n\n**Firstly, what is economic growth? Where does it come from?**\n\nWe usually measure the economy in terms of GDP, Gross Domestic _Product_. That is to say, a growth in GDP, is a growth in the amount produced in an economy (or in the value of the produce).\n\nThere's two ways this can happen, either through a growth in population (two people produce and consume more than one), or through a growth in efficiency (i.e. more is produced with the same amount of people, what we usually consider technological progress).\n\nIt is important to note that this has _always_ been a thing. Using data on the estimated GDP of England from the 1200s (you can find it on Our World in Data), the economic growth of England was in average 1% between 1200 and 1800 and about 2% between 1800 and 2000. (This interestingly tells us that the industrial revolution is a story of moderate growth sustained over a long period of time, very different from the explosive growth of the countries which only have to catch up by applying what has already been discovered).\n\n**Could there be too much growth?**\n\nIn the short term yes, in the long term, no. Any economy has a natural long-term or potential growth rate. This is it's economically sustainable growth, basically.\n\nIn reality economic growth can vary a lot in the short term, but it will always trend back to its long term growth. This means that if the economy overheats in the short term, you're in for a recession down the line to compensate.\n\nThat's Keynesian economics is so concerned with mitigating business cycles, so that booms and busts are more moderate.\n\nOf course, the long term growth is not static either and can itself change as well.\n\n**Now for the interesting question. What would it mean for growth to remain at zero perpetually?**\n\nSo this is an interesting question. This would mean there is no innovation, no technological growth.\n\nIt also means the \"size of the pie\" so to speak, is fixed, which has profound consequences.\n\nThis means humanity will never be better off in the future than it is now, which also means that individuals cannot simply be better off through skill, experience or ingenuity. The _only_ way to be better off is for someone else to be worse off. The economy is a zero sum game.\n\nThis makes the economy essentially hypercompetitive, and creates a lot of resentment towards anyone that's better off than you, because they are better off at your expense. There is no use trying to create anything new, we've defined that this is impossible, so the only way forward for you is to redistribute resources from other people.\n\nIt is possible this would read to unrest and demand for perfect equality. This would further remove any motivation for innovation or effort, but of course we've kind of already by definition removed that.\n\n**One more thing of note**\n\nThe economy does reach, basically by definition, a balance between goods and services produced and consumed, or supplied and demanded, this is known as equilibrium. However this equilibrium need not be constant, it can and will change over time. Growth just means that more is produced and consumed, at a new higher equilibrium.\n\nHowever it also _can't_ just stay there, because even if the long run equilibrium is completely unchanging, there is always going to be some random variation and some economic shocks, which are going to temporarily dislodge the market from this balanced state.",
            "title_similarity": "0.74262905"
        },
        {
            "id": "i4vre3s",
            "score": 1,
            "text": "You need $1 to start business X... I give you $1 with the promise that you will give me back $1.25 in 6 months or whatever. You now have to make sure your company makes more than my original investment plus interest but enough to pay your other costs as well.",
            "title_similarity": "0.7066267"
        },
        {
            "id": "i4vsjnc",
            "score": 1,
            "text": "Quite simply basic human nature suggests humans have unlimited wants, we always want to consume more! This is a basic assumption in economics. \n\nThe economy is measured by the total value of everything which is consumed, therefore it would be nice if that kept increasing, we can purchase more stuff and generate more income, so less people will be poor and a myriad of other benefits. \n\nEconomic growth is too much if it is unsustainable, meaning we are producing at a point beyond which we should be able to, such growth generally just leads to inflation, and reduces how many resources we actually have. We can continue to grow as long as we gain more resources, ie. a greater population or more energy etc. Or if we become more productive, for example from better technology.\n\nAs others have pointed out much of the complex modern economy is built around the assumption we will continue to grow, and if we don't it could lead to a lot of trouble, and a terrible loss of confidence. Meaning people will buy less stuff, companies will make less money and thus hire less people(unemployment), all round not very good.",
            "title_similarity": "0.73811316"
        },
        {
            "id": "i4vsnp8",
            "score": 1,
            "text": "Other than the obvious answer that a growing population should be associated with more economic growth, the answer is: because people want a better standard of life!!\n\nWant to buy new clothes? Want to improve your house? Want to adopt pets? Want to travel around and explore the world? What if you break your leg? What if there is an outbreak of a new disease and you need a vaccine or medicine? Etc. Etc. PEOPLE ARE NOT TREES!! We are human beings with dreams and desires. Also, we're not invulnerable. Shit happens and we deal with it. A growing economy could mean that we are better prepared for anything that could happen and, more importantly, can also mean that our standard of living is improving.",
            "title_similarity": "0.7116514"
        },
        {
            "id": "i4vsqwt",
            "score": 1,
            "text": "Economic growth, often measured by GDP growth, is a rough approximation of the growth of wealth of the nation. Wealth is the sum of the value of things you possess, such as your house, your computer, your education, your sense of satisfaction after a nice meal, the well-being of your family, etc. For the most part, GDP just represents the stuff that can be part of a transaction, but the other stuff tends to go along with the rest.\n\nBut you might ask, since wealth is intangible, it doesn't come from the ground or grow on trees and there's no way to make wealth itself, where does wealth come from? It comes from voluntary transactions! How? Let's say Ed is a carrot farmer. Ed likes carrots, but not for every meal. Ed's neighbor Charlie raises pigs. Charlie likes pork chops, but also would like some variety, too. Ed and Charlie agree to a trade of carrots for pork chops. Ed valued the pork chops he received more than he valued the carrots he gave away, and the same goes for Charlie. They're both better off despite the fact that the total number of carrots and pork chops between them didn't change. That gap in value before and after the trade is the origin of wealth. For the economy to grow, the wealth created by millions of daily voluntary transactions has to overcome the destruction of wealth due to natural degradation of property, violent acts, or inefficiencies of non-voluntary transactions.\n\nSo, why grow the economy? \n\n1) It's nearly impossible to intentionally coordinate 0 net growth. It's much easier to destroy the economy. It's a bit easier to grow the economy modestly. We may as well grow rather than degrade. \n\n2) Generally, people want a better quality of life for themselves and their children in the future. They do this by acquiring wealth, and when you aggregate that behavior over an entire society, you get a drive for economic growth. Or at least a distaste for policy which they believe prevents economic growth.\n\n3) One of the things a growing economy can buy is security. All nations have other countries which they consider a threat or potential threat. The enemy nation is going to do their best to grow their economy, whether you're growing your economy or not. Eventually, they're going to be able to buy a lot more military force than you can, and now you've become a vulnerable target for violent takeover.\n\n4) Wealthy nations can afford more humanitarian aid than poor ones. The more your economy grows, the wealthier it is, and the more aid you can afford, helping others to raise or protect their quality of life.",
            "title_similarity": "0.7258444"
        },
        {
            "id": "i4vsy69",
            "score": 1,
            "text": "Economies started growing long before capitalism was invented, and people in many types of economic systems have wanted their economies to grow.\n\nJust a general response to the “because capitalism” simplification.",
            "title_similarity": "0.6419383"
        },
        {
            "id": "i4vtc07",
            "score": 1,
            "text": "Because the dominant economic shares are held by the Global oligarchs who are exploiting people and extracting wealth from the environment to fund armies used to conquer more land and resources to further cement the class stratification between the \"owners\" of the economy, and the rest of us who are the cannon fodder for their wars, or their slaves in the coal mines/fields.",
            "title_similarity": "0.5536469"
        },
        {
            "id": "i4vtkkf",
            "score": 1,
            "text": "It doesn't. The only reason people think it does is because the 1% has convinced the 99% of this \"fact\".\n\nThe reality is the only thing it would effect is how much some CEO gets paid.",
            "title_similarity": "0.6335615"
        },
        {
            "id": "i4vtwn5",
            "score": 1,
            "text": "Answer: It doesn't! Learn about donut economics.\n\nEarly in the 20th century GDP was selected as \"the metric\" but after a certain point GDP growth does not correlate to improved quality of life. Most developed economies have passed this point already.\n\nOnce a country has passed the phase where GDP directly increases the quality of life for citizens the country can theoretically decide to focus on improving quality of life or a different economic metric instead of GDP. This can lead to less profitable but very necessary jobs being invested in, or rejecting high growth manufacturing jobs because of environmental concerns. \n\nDonut economics can also be referred to as negative GDP, but the term is less popular because of the negative connotations.",
            "title_similarity": "0.8113179"
        },
        {
            "id": "i4vu2do",
            "score": 1,
            "text": "It doesn’t have to grow to succeed. It just grows naturally through population growth, more efficient labor and uses of capital, better technology, etc. Zero growth is generally considered bad because we’d actually be getting poorer per person, assuming that the population is growing. But if the population stops growing, presumably no growth would be just fine.",
            "title_similarity": "0.75138557"
        },
        {
            "id": "i4vu9qf",
            "score": 1,
            "text": "It doesn't require growth. That's a myth. A lot of people who bet on growth will be unhappy, though, because they bought companies with the expectation of selling them for more later, after they've grown.",
            "title_similarity": "0.69900894"
        },
        {
            "id": "i4vur29",
            "score": 1,
            "text": "'Growth' is a misnomer. What people care about are profits, and if their profits aren't at least *stable*, then the economy isn't 'working' in their favor.\n\nIn reality, the less work people have to do, the better. Technology should be giving us more and more time to do what we want, but that isn't happening. People are a resource, and so they'll always be utilized to the most profitable extent possible.",
            "title_similarity": "0.7435706"
        },
        {
            "id": "i4vvgeq",
            "score": 1,
            "text": "When a product gets made there are 3 groups involved:\n\n1. Capital owner: the person who has the tools needed to make the product: e.g. land, factories, cash, etc.    \n2. The workers who use the tools to make the product.   \n3. The government who oversees the society the other two are in. \n\nIn capitalism the capitalist is in control of how things are done. In communism the workers are in power, in socialism the government is in control. \n\nIn capitalism, to encourage the capitalist to risk his resources to buy the land, or build the factory, there needs to be a high chance his investment will make him more capital. Or why would he bother? Why spend a million dollars making a new factory if the only hope is to get a million dollars back? \n\nFor the capitalists investment to grow the economy needs to grow.\n\n\nAn analogy: think of the economy as a savings interest rate. you have a $100. You could buy something with it, or put it in a savings account. If interest rates are 10% you can opt to \"invest\" and get a dollar every year. After 10 years you are getting \"free money\". \n\nBut if interest rates are 0.1% it would take a thousand years to get that \"free\" money.",
            "title_similarity": "0.5952532"
        },
        {
            "id": "i4vw8d0",
            "score": 1,
            "text": "What happens in a Ponzi scheme when there isn’t enough money coming in to cover the payouts?",
            "title_similarity": "0.6255895"
        },
        {
            "id": "i4vwibx",
            "score": 1,
            "text": "People talking about consumerism or people as a unit of labor - but the answer is much more simple. It is innovation. The stagnation of technology would stagnate the marketplace. The economy is ofc driven by components like labor force and the sale of goods, but the real growth comes from innovation and development. \n\nSome of this is superficial but when technology advances so does the economy and the people working on those advancements. I suspect you'd see very different lifestyles of countries dependent on maybe a more stagnant product or service versus those that are on the vanguard of innovation and technological development.",
            "title_similarity": "0.75099826"
        },
        {
            "id": "i4vwj2i",
            "score": 1,
            "text": "Short answer? Because people fuck.\n\nThat's all it boils down to.\n\nMore people fuck, more kids being born, more of a strain it is economically.\n\nLess people born, more leeway for economic growth to be stagnant as it isn't disastrous.\n\nMore people, lower resources, higher cost, Yada Yada",
            "title_similarity": "0.691253"
        },
        {
            "id": "i4vwqhf",
            "score": 1,
            "text": "The drive for constant growth is why profits have skyrocketed, while wages have stagnated. Somehow, they convinced us that growth is healthy.",
            "title_similarity": "0.71324927"
        },
        {
            "id": "i4vwsy4",
            "score": 1,
            "text": "Another way of viewing economic growth is, improvement in standard of living, and thus quality of life. \n\nAn old x-ray machine gets replaced with a newer, more expensive video x-ray, and then an MRI machine. \n\nCars get better and the population upgrades as their older cars wear out, etc. \n\nAll of that counts as economic growth. People generally want better, and also more, stuff, even if population growth is zero.",
            "title_similarity": "0.68622273"
        },
        {
            "id": "i4vxi6z",
            "score": 1,
            "text": "It’s how capitalism works in short. Without growth, there can be retractions, depressions, etc.",
            "title_similarity": "0.6099361"
        },
        {
            "id": "i4vy1v4",
            "score": 1,
            "text": "Yes it can reach a balance. Austrian economics has such a theoretical model for the economy which they call the evenly rotating economy. New people born replace the people dead, and production equals consumption. It would not be the end of the world.\n\nThe main reason why the media, politicians, and big business push for constant growth is the high levels of debt governments, consumers and businesses take on. Taking on so much debt with no growth mean a lot of those debts go tits up. This is bad for big business in general.\n\nFurthermore, even perceived slowdowns in growth justify more spending by government. Which of course makes big business and politicians richer. So to answer your question more succinctly, a constantly growing economy is in the self interest of the people that hold most of the power in our current society.",
            "title_similarity": "0.7554656"
        },
        {
            "id": "i4vyxdm",
            "score": 1,
            "text": "Here are some various perspectives to think about. \n\nZero growth can imply that things aren't getting better. People in the world still live in poverty. They could be doing much better. If you are looking at a given area, zero growth implies stagnation.\n\nGrowth is a function of many things, two obvious ones are the number of people and new technology. Focusing on these two factors, zero growth would imply either a stable population (births = deaths) or that there is no technological improvement. Have we really learned everything about the universe? Are there no better mousetraps left to build? Will reddit ever fix their god damned video player? Unlikely all. The point is that given a world with a growing population and new technology to create, stagnant growth implies something has gone very wrong.",
            "title_similarity": "0.77381396"
        },
        {
            "id": "i4vzdqm",
            "score": 1,
            "text": "It’s because the population is constantly increasing. As there are more people taking slices out of the pie, the pie needs to grow; otherwise, the slices get smaller. Population growth is expected to halt by the end of the century, so we’ll have to wait and see what that looks like.",
            "title_similarity": "0.7797107"
        },
        {
            "id": "i4vzxgj",
            "score": 1,
            "text": "While not explicitly a function of capitalism, the reward structure of capitalism encourages infinite growth.",
            "title_similarity": "0.5714793"
        },
        {
            "id": "i4w1yos",
            "score": 1,
            "text": "Economic growth is not a good or bad thing. You can have decreased growth but if the fruits are spread more evenly it could be a good thing. Just depends on what the goals of the economy are.",
            "title_similarity": "0.6270281"
        },
        {
            "id": "i4w2yjm",
            "score": 1,
            "text": "How the hell else do you expect trillionaires to be made?",
            "title_similarity": "0.45838064"
        },
        {
            "id": "i4w35um",
            "score": 1,
            "text": "It's mostly psychological. It is the same reason why inflation needs to be above zero. People cannot handle things getting a little bit worse. People need steady pay raises over time. Deflation is particularly interesting because even if you can buy more with your money, people can't handle their pay number going down. Keeping worker morale high this way can be self fulfilling resulting in actual economic growth, but realistically that mostly comes from improvements in productivity through technology, and population growth.",
            "title_similarity": "0.7990991"
        },
        {
            "id": "i4w3xaw",
            "score": 1,
            "text": "The economy doesn't need to keep growing. We as a society keep growing, the economy is a system that is driven by us. We consume, we produce, and around we go.",
            "title_similarity": "0.5414855"
        },
        {
            "id": "i4w5fxn",
            "score": 1,
            "text": "Every day our processes and technologies improve which makes producing goods and services way easier. Easier production means fewer people who are needed for a specific job. Combine this with a growing population and the result would be high unemployment which os not only bad for the unemployed people and the sociological effects, it also means that people have less money with which they can buy stuff which again would harm companies and further pressures them to work more efficiently. Thats why we need a growing economy to work against this.",
            "title_similarity": "0.7373467"
        },
        {
            "id": "i4w5j2y",
            "score": 1,
            "text": "The entire premise of lending money is that it generates a return for the lender and also generates more wealth by being put to productive use by the borrower.  If growth stops lending slows or stops because there is no money in it.   If lending dries up then everything grinds to a halt.",
            "title_similarity": "0.72654116"
        },
        {
            "id": "i4w5neh",
            "score": 1,
            "text": "Interest. Every time someone makes money from nothing, that money has to ultimately come from somewhere, and that somewhere is the future. If growth stops, all of a sudden all that free money everyone's been getting starts coming from the system itself.\n\nIt's like if you had a steady supply of Jenga blocks you could just build higher and higher and higher, but if the blocks stopped coming in, you'd have to start pulling from the base. No, \"stop building\" isn't an option, shut up you commie.\n\nThen the tower falls over (the Great Depression) and everyone loses out, except the guys building the tower who all of a sudden just got a TON of blocks to build with for basically free. Wow-ee, how convenient for them!",
            "title_similarity": "0.72428143"
        },
        {
            "id": "i4w6b2d",
            "score": 1,
            "text": "The challenge of economic management, technology and production is to meet the needs of the people and not to \"achieve\" certain measures. The measures are what is used to give a broad indications to allow some time for policies and resource allocations to adjust - but the measure isn't the end goal, it is a means to an end. The goal is the welfare of the populace.",
            "title_similarity": "0.5863098"
        },
        {
            "id": "i4w6qdj",
            "score": 1,
            "text": "One of the elemental factors in an economy is that all the goods reach marketability through human labor, and human labor is just population times work hours. As the population grows, the specialization possible increases as well, meaning that more people means fewer Jack of all trades and more specialist opportunities which generate more value per hour input.\nYou COULD see static economic growth with static population numbers and it wouldn’t really be a bad thing, but since the population keeps going up, less productivity means the consumption is rising and the production is lagging, and thus the (gross) quality of living will slump.",
            "title_similarity": "0.8144803"
        },
        {
            "id": "i4w76j1",
            "score": 1,
            "text": "I think this may be exactly what OP is asking but I've wondered about this for many years. Can economies prosper or successfully stabilize if there was permanent zero population growth world wide? At some point the world's population is going to need to become static (more likely shrink) for at least as long as we can figure out how to support population growth.",
            "title_similarity": "0.84818804"
        },
        {
            "id": "i4w7sf7",
            "score": 1,
            "text": "Here's a podcast episode with two economists debating [economic degrowth](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5hY2FzdC5jb20vcHVibGljL3Nob3dzLzYxOWJlNWMwNzA1MTM4MDAxYjljODQ3OQ/episode/aHR0cDovL3d3dy5ibHVicnJ5LmNvbS9qYWNvYmluLzgyODg0ODQxL2JlaGluZC10aGUtbmV3cy1kZWJhdGUtb24tZGVncm93dGgv?ep=14) at the 24 minute mark, in the context of the climate crisis.\nI'd add there are different ways of thinking about \"disaster\", politically, socially, from a class (owners vs workers) perspective, from an international one, because access to goods and services are already not equally distributed, so another part to think about is at what point would stasis be defined. This is one of the sticking points with carbon emissions. China says its not fair that the West consumed all these resources and basically created the climate crisis with their emissions, but now is the time for everyone, including those who didn't develop like the west, to cut it out. Of course, that is also a self serving argument because they are polluting much more in their quest for development than other developing countries.",
            "title_similarity": "0.5688889"
        },
        {
            "id": "i4w8nq9",
            "score": 1,
            "text": "Because we built our value system on profit. If something is not profitable, you lose money. If it is break even, it is not worth doing. Only potentially profitable things are invested in. In order for that to happen on a large scale we need growth, or it would result in growth. Kind of chicken egg. \n\nEven if our population stayed the same and our expectations too, we would still need growth. This is why marketing is so important. We need expectations and demand to rise to push more consumption.\n\nThere is also the Grow or Die principle. Where you need growth to outcompete the rest.\n\nCould there be a point where there is too much growth? Yes. And we are constantly dealing with it. One of them is when we make our supply costs so low through low wages that consumers have less money to spend. This curbs growth and kills the economy. Another, more dire side is that by becoming more efficient and creating a society where rapid consumption is the norm, we are quickly depleting natural resources of all kinds. Another problem is waste management of discarded products. There are also social factors when looking at how we treat our cheapest laborers in Asia, Africa and South America. (Turns out it is also more profitable to cheaply dump our waste there). And lastly, this drive for profit doesn’t always result in things that would be best for society. A local problem here is that a lot of perfectly good food is thrown out because there is one moldy apple in the bag. It is cheaper to throw it out than to sort it out. This creates absolutely shocking amounts of food waste. And that’s just one example. Couple this with the climate crisis and you can see how a growth based economy, that HAS to put profit before societal improvement, is really fucking up our environment right now. \n\nI’m sure some points here could be explained better by others, but I would also look into the 1st and 2nd contradiction of capitalism.\n\nPs. You can also see how this profit hoarding creates a wealth gap that actually needs at least _some_ form of redistribution. That’s why some capitalists actually want governmental taxation, but applied evenly so they do not lose their edge, so the lower and middle class can consume more again. Others say we have too much governmental meddling and should instead focus on more growth so the middle and lower class get to reap the benefits of new technologies through the yearly upgrades paid for by their consumption. Though this wealth cannot be hoarded and should always be reinvested, with wages rising at least with inflation rates. But if not for hoarding wealth, why would you work to create a multi-billion dollar company? The wealth gap is biting the rich in their own asses. What they can do is get the biggest piece of the pie, basically outcompeting the other rich. Bezos does that really well with Amazon moving in so many different sectors.",
            "title_similarity": "0.7572712"
        },
        {
            "id": "i4w8tpl",
            "score": 1,
            "text": "The more general meaning of economic growth is long run increases in people's general standard of living.\n\nWe take a more operational meaning to be long run increases in GDP per capita.\n\nSo to answer your question, I think it's because economic growth is often an indicator that people's material standard of living are improving. \n\nPeople are always striving, being on the hedonistic treadmill, for more and a constantly growing economy could be considered a manifestation of the aggregate's endeavours.",
            "title_similarity": "0.7400155"
        },
        {
            "id": "i4w9k6n",
            "score": 1,
            "text": "Cause it’s a Ponzi scheme?🤔",
            "title_similarity": "0.3436203"
        },
        {
            "id": "i4w9l7k",
            "score": 1,
            "text": "More people require more goods and services. That’s all an economy really amounts to.\n\nSo if you have population growth you need economic growth to cover it. \n\nIf your population is in decline then you’ll eventually hit a point where there are too many old people for the amount of goods and services  being produced. You need a growing economy to take of them when they can’t take care of themselves to compensate for them exiting the workforce, or just have them work till they die. \n\nThe only time you don’t need a growing economy is when you have a stagnant population to go with it. Even then economic growth is still good in almost every current circumstance.",
            "title_similarity": "0.8073652"
        },
        {
            "id": "i4waiay",
            "score": 1,
            "text": "Let's perform a thought experiment that starts with 2 simple rules:\n\n1) That the way to gain money is to save more than you spend.\n\n2) All payments come from a closed system; no federal reserve or monetary agency adding currency\n\nIf everyone saved all of the money they made no one would buy any goods, companies (besides banks) wouldn't have any income since no one is spending *any* money, so nobody gets paid anymore.  By adding more money to the system companies can pay again and people can save again.\n\nIn 2022 we have an increasing concentration of wealth; which means more and more of the total money in circulation is being paid to companies and ending up in savings accounts.  If we don't add money to the system it will dry up and people won't be able to get paid as well.\n\nAnd as another redditor said, \"nobody likes the prospect of stagnation\"\n\nSo we just keep injecting money and \"que será, será\"",
            "title_similarity": "0.7008116"
        },
        {
            "id": "i4wbo5n",
            "score": 1,
            "text": "Because capitalism is built on the concept of enough never being enough. It's a competition based system, where people compete for resources. \n\nAs you say, the sane way to do it would be to reach a resource equilibrium, and the basic rule before all other rules would have to be to never exceed the available resources.\n\nNow, that's not the case. Nobody gives a shit about available resources, they just burn through it at maximum rates in the quest for maximum money - a man made concept that has almost nothing to do with real reality anymore. \n\nThere are grassroots organizations like the Venus Project or the Zeitgeist Movement that try to get people on board to realize this basic fact - that we only have so many resources, and we literally can't use more than we have. We're deficit spending our civilization. It literally has an expiration date. One that's coming at us fast.\n\nThe core problem is that we use the polar opposite of cooperation as our basic paradigm - namely competition. As long as we keep doing that, our species keeps digging its own grave. Capitalism is simply an absolutely horrible system that has killed millions upon millions of humans before their time, maybe in the billions even. 9 million starve to death on this planet every year thanks to capitalism.",
            "title_similarity": "0.65144765"
        },
        {
            "id": "i4wc8bd",
            "score": 1,
            "text": "In order to answer this question we must begin with another. \n\nWhat is the economy? \n\nThere are many different definitions but the one I’ve always been most comfortable with is this: \n\nAn economy is a system or series is systems in which a society combines human labor, technology, entrepreneurship, and raw materials in order to meet its material needs and wants. \n\nIf we accept this as our definition, then it follows logically that growth in any one of those four component parts will definitionally grow the whole, though that may be difficult to measure depending on the specifics. Similarly, shrinkage in any of those areas can result in an overall decline if not made up for by growth in other areas. \n\nOne example of such a decline is the Great Depression of the United States in the 1930s. There were many contributing factors that caused the depression but one of them was the decline of the agricultural sector with the advent of the dust bowl. Starting in the late 1920s years of unsustainable agricultural practices finally came due. The topsoil had become so badly eroded that massive dust storms swept across the American south. These dust storms essentially meant that hundreds of miles of previously fertile farmland was now no longer usable. In other words, it represented a raw material (fertile farmland) that had previously been more abundant becoming more scarce. This alone likely didn’t cause the depression itself, but it played a role. \n\nOn the flip side of the coin, growth in any of those component parts often correlates with an increase in the overall economy. Sticking with the example of raw materials for a moment, the discovery of oil on the peninsula of Saudi Arabia brought previously unknown amounts of wealth to the area. Cities were carved out of the desert, fed with water provided by massive desalination projects. And all of that was paid for by the export of Saudi oil. Once again, there were likely other factors involved, but the growth in the raw materials of that country undoubtedly contributed to its overall growth. \n\nSo, that’s my answer.",
            "title_similarity": "0.6630205"
        },
        {
            "id": "i4wcqpw",
            "score": 1,
            "text": "Two things I don't see discussed a lot that help to put the other answers into context:\n\n1) The economy grows every time that value is added to something. This happens when someone turns a chunk of rock into an iron bar. Value is created between the price paid for the ore and the cost paid for the iron bar. It happens when the person flipping burgers turns frozen meat into a product that the consumer purchases. Value is created between the cost of incoming materials and the price the consumer pays. The difference between those two is the created value that is used to make the economy expand.\n\nEasily this could reach 0 growth. Yes, companies create value but that value is then divided among the person who performed labor, the government takes a share for the services it performs, the manager takes a cut, and so on. The end value created is what you see when a business reports a profit for the year, they made more value by selling their product than it cost them to produce their product. A negative value is represented when companies report a loss, they produced less value than they spent generating their product. \n\n2) T=Most modern economies aim to have 2-3% inflation each year to drive investment. Investing is a risk, you make some money, give it to someone else and hope that they make it into more money by creating value. But they could also lose value. If you take your money and put it in a bank you have 0 risk, you get back what you put in. \n\nInflation gives an incentive to invest by punishing savings. If inflation decreases the value of money by 3% when you take a -3% loss each year by saying your money in a bank. Now even if there's a chance that you lose your investment as long as you lose less than that 3% you still came out ahead relative to saving.\n\nhope this gives some context to the other answers given.",
            "title_similarity": "0.67136484"
        },
        {
            "id": "i4wdsmv",
            "score": 1,
            "text": "ELI10. There is more accumulating debt every year which forces a positive growth every year. More of a scam, really. The growth isn't used to offset the debt, which is why the national debt is growing so much (wrt US).\n\nEver notice how many times the US \"adjusts\" its numbers after \"predictions\"? Because it's all a scam. It works because the powerful play along. Problem is...living  gets continuously more expensive for typical citizens and eventually spreads into the middle class--destroying it.",
            "title_similarity": "0.8271992"
        },
        {
            "id": "i4we6wc",
            "score": 1,
            "text": "I think the better question to ask is not why the economy should grow every year but why PROFITS should grow every year - especially profit margins. This facet of most capitalist societies generates a great deal more problems than it solves. Inevitably, it leads to worse quality in product, treating your labor force worse, and often cutting safety corners with respect to employees, consumers, or the environment. At a certain point we really do need to decide that stability is more critical than ceaselessly increasing profits.  \n\n\nIn other words: it's fine if the economy grows - it's directly related to population and productivity (though there's room for argument that population will start to take a back seat with lowered birth rates and increased automation) and so the overall size of the economy should be able to grow enough for everyone to have a proverbial seat at the table. Distribution is it's own challenge.",
            "title_similarity": "0.8468763"
        },
        {
            "id": "i4webvx",
            "score": 1,
            "text": "So rich people (by way of stock holders of some sort) can profit off of it. That's literally it. There's nothing else. It doesn't benefit the general citizens, except those that hold stock as well.",
            "title_similarity": "0.5563601"
        },
        {
            "id": "i4wfvs4",
            "score": 1,
            "text": "It doesn't. People are just greedy.\n\n......................................................\n......................................................\n......................................................\n......................................................\n......................................................\n......................................................\n(Extra characters to satisfy the stupid bot.)",
            "title_similarity": "0.31401092"
        },
        {
            "id": "i4wgy0x",
            "score": 1,
            "text": "The people here aren’t giving you a solid answer.  This is not that difficult. \n\nLet’s say I have $20 and I want to invest it into something. \n\nIf I start a business that returns 10% per year that is pretty good. And I might do it.  Because there is risk when I invest. \n\nBut what happens if you invest it and you get 0% back? Well that wasn’t a good deal because of the risk in investing. \n\nAnd that is why growth is necessary. You need to make money on what you are doing and increase the value of your company by doing that. Because the growth is how you say, take a risk on me. Otherwise you might as well stick it under the bed or on a vault or something. \n\nSo multiply that by everyone and you get the economy needing to grow.",
            "title_similarity": "0.8186241"
        },
        {
            "id": "i4wh8ln",
            "score": 1,
            "text": "Because capitalism is nothing more than a pyramid scheme. Because capitalism is nothing more than a pyramid scheme. Because capitalism is nothing more than a pyramid scheme. Because capitalism is nothing more than a pyramid scheme. Because capitalism is nothing more than a pyramid scheme.",
            "title_similarity": "0.468574"
        },
        {
            "id": "i4whlap",
            "score": 1,
            "text": "Because income/wealth inequality is the oxygen starved engine of the economy. An engine with no oxygen cant fire up, cause there’s no oxygen to fuel the fire in the engine. Same with the economy. The amount of people goes up (accelerator), the money has to spread out to those new people(fuel) or else they become a starved engine of people who get perpetually poorer as they’re born. If this happens, even to .1% of people every year, that grows to like 10% of people in some places and 0% of people in other places, so the wealth stagnates and is hordes by the people who already have it from when the economy was growing. One thing leads to another and if the economy doesn’t grow, or stagnates, it’s basically over for the country in question unless they do something quick.",
            "title_similarity": "0.74786735"
        },
        {
            "id": "i4whtim",
            "score": 1,
            "text": "Economics/finance guy here: It’s because our current money system is based on debt (bank loans make up most of the supply of money, and this is money creation the Fed or govt can’t really control).  This debt requires constant growth to enable people/businesses to pay off debts already incurred.  If the engine stops, the debt house of cards comes crashing down and we  inevitably have a contagious Lehman Brothers moment like in 2008, which is the result of the game of musical chairs ending, creating a mad dash for cash to settle all the debts, and there isn’t enough cash out there to settle all the debt, which is what creates the eventual Lehman “shit hits the fan” moment. \nNot many people realize most money in the system is privately created bank credit, not “cash” created by the government or Fed, and the cash is required to settle all bank debts eventually.  When it’s needed most is also when there’s never enough of it.",
            "title_similarity": "0.70772535"
        },
        {
            "id": "i4whxjp",
            "score": 1,
            "text": "Pretty simple. It is a Ponzi scheme and like all Ponzi schemes if they don’t grow fast enough the con is up.",
            "title_similarity": "0.48500073"
        },
        {
            "id": "i4wi096",
            "score": 1,
            "text": "Infinite consumption and endless growth is the foundation of Capitalism. Earth systems will collapse if we choose to continue down this path. Steady state economic models are the only sustainable solution",
            "title_similarity": "0.657412"
        },
        {
            "id": "i4wk99i",
            "score": 1,
            "text": "Because it is a scam. We consume today while expecting to be able to pay current prices, which we could not afford today, with money that is supposed to be generated out of thin air in the future.",
            "title_similarity": "0.7157018"
        },
        {
            "id": "i4wkcd1",
            "score": 1,
            "text": "Want a raise at work?.. grow",
            "title_similarity": "0.4365458"
        },
        {
            "id": "i4wkln8",
            "score": 1,
            "text": "At least four reasons offhand. One, because the population is growing. Two, because most businesses are run on borrowed money, and they have to make interest payments. Three, because the supply of money is steadily increasing by policy, creating average inflation of 2-3% (if all goes to plan). Four, the only thing that makes the natural wage for unskilled labor go up over time is economic growth.",
            "title_similarity": "0.76130104"
        },
        {
            "id": "i4wkn2k",
            "score": 1,
            "text": "At the absolute most simple level it's because every dollar in existence at one time was \"created\" and distributed as a loan with interest from the central bank. If the economy cannot handle the interest payments the government is forced to create more money or else face a total collapse. The system is only maintained if the economy expands at a small rate.",
            "title_similarity": "0.7378787"
        },
        {
            "id": "i4wkx4d",
            "score": 1,
            "text": "Because capitalism requires infinite growth to function. For profit to exist, money has to go from someone to someone else. If there is even 1 cent of profit being made constantly, eventually the wealth gap will become unsustainable. As such, unless there is constant growth to offset the loss of capital from those who cannot profit, the system will collapse",
            "title_similarity": "0.79644173"
        },
        {
            "id": "i4wlie8",
            "score": 1,
            "text": "Mom and dad say they’ll give you money if you promise to color in the lines and bring the worksheet back home with a sticker on it to show them. They know how important there investment is in providing for a good future which, in time, builds stability within the family lines. You decide to go to school forever to continue getting money from them. You use the money that you get, to pay someone to color for you while you buy candy and Pokémon cards and play on the playground with what’s left. You sell crappy Pokémon cards to kids who don’t know better. In turn, you buy more candy and more cards . If you stop going to school, bringing home stickers on your progressively harder worksheets, the money stops coming in and the dream ends there. The jig is up.",
            "title_similarity": "0.59638494"
        },
        {
            "id": "i4wlrkt",
            "score": 1,
            "text": "It doesn’t. It’s the current mainstream school of economics that has many flaws. There are schools of economics like de-growth economics that argue exactly what you’re wondering. One argument they make is that to sustain a 3% growth rate for another 100 years, assuming no world changing breakthroughs in efficiency and materials recycling, we will ultimately have to consume more resources in one year than exist on the planet.",
            "title_similarity": "0.82822764"
        },
        {
            "id": "i4wm20y",
            "score": 1,
            "text": "Because modern economy is based on borrowing money from the future, ie people apply for loans to buy their houses or factories apply for loans to upgrade ther equipments. All these happen because both lenders and borrowers believe that economy will grow in the future, so that borrowers are able to pay back with interests. If the economy stops growing, the lenders will lose motivation to give loans to those in need.",
            "title_similarity": "0.7594389"
        },
        {
            "id": "i4wmqyq",
            "score": 1,
            "text": "Because the system is broken, but it’s the best one we’ve got so far. A key problem is that we don’t live in a world of limitless resources.",
            "title_similarity": "0.5155191"
        },
        {
            "id": "i4wn1c7",
            "score": 1,
            "text": "Some of it just because of the debt economy we have. Government must write off they debt it has and inflation does a real helpful job that way without just defaulting. \n\nThe other part of it is that right now the world population is still growing so to remain relevant in the world you want your population to be at least 0 but better to be growing as well. \n\n\nThere are countries whose populations have fallen for the past 30-50 years in a combination of low birth rates and emmigration and they are not exactly relevant to the world at large. They tend to be the smaller ones and already under the protection of a major world power in some way. \n\nSo big industrialized countries want about 1% population growth whether that is by birthrate or by attracting immigration. Big less industrialized countries want to curb their growth to allow all their infrastructure to keep up with the population and not have a drastic boom and bust in age groups.\n\nWe are due for 8 billion some time in the next year and estimates from 9 to 14 billion are not unrealistic by the end of the century. You could be a country of 100 million today with an aging population and a culture that is against immigration and be in really big trouble in about 30 years if your aim is to remain globally relevant without rising social tensions. Aging population means the birthrate has already fallen below 2 and people today will not replace the population that will die some time in the next 30 years.\n\n\nPoor countries want more economy equality. If the whole world was as developed as America technologically and was wasteful with all the luxury it has then we would need multiple planet earths. Our bottom 30% live better than the average of the middle 80% of most countries in the world. There are countries that don't have electricity in their homes 24 hours 7 days a week and don't even know what modern internet use looks like. There are countries where the type of food we can all eat daily here is only eaten on feast days several times a year. There are countries with a lack of clean accessible water. Literacy and Education is also severely lacking in many places and those countries are trying their best to ascend.\n\n\nTLDR The way money works and the way human interactions work make it imperative that any country that wants to maintain modern power or increase it should have a growing economy.  A balance is possible but very few people who would have the biggest impact on that being achieved will actually be seeking that balance instead of seeking growth.",
            "title_similarity": "0.7976863"
        },
        {
            "id": "i4wnmvp",
            "score": 1,
            "text": "The only right answer: All money in the economy originates from banks. People didn't make the money, banks did. So every dollar out there is somehow part of a loan someone once took. A company for example. The bank gets interest for that loan. However, that interest does NOT exist as money within the economy. That means all the loans cannot be paid back. The only way for this system to work is if more new loans are taken than old ones paid back. More new loans taken means economic growth. If that growth fails, in order to keep up old loans have to be deleted (via bankruptcies). But the money is still out there so what that means is inflation. Everytime a company goes bankrupt and can't pay its loans back, a tiny portion of our money is taken to pay for it via inflation.\n\nDon't think of economic growth as something has to get physically bigger because that would mean limits. In a nutshell economic growth just means new loans are taken faster than old are paid back.",
            "title_similarity": "0.7390667"
        },
        {
            "id": "i4wnzqh",
            "score": 1,
            "text": "It's niche, but there's a school called \"zero growth economics\" that argues it's both possible and necessary (the latter often for environmental reasons).",
            "title_similarity": "0.55026513"
        },
        {
            "id": "i4wowvb",
            "score": 1,
            "text": "The real answer is that it doesn't have to, unless the point of an economy is endless profit.  Which is unattainable.",
            "title_similarity": "0.55664897"
        },
        {
            "id": "i4woyg5",
            "score": 1,
            "text": "Every year humanity invents a lot of stuff and we implement that stuff and people agree this really adds value and that adding of value is captured/measured/expressed by that economic growth.",
            "title_similarity": "0.64449155"
        },
        {
            "id": "i4wp2dh",
            "score": 1,
            "text": "Imagine you have $1 million dollars. You want to invest. You buy stocks at a company. They grow 1%, you “win”. They lose 1%, you “lose”. If you think they are going to lose money, you pull out that $1 million and invest it somewhere else. If you pull out the money, the company’s/country’s capital decreases. If the speculation of the company/country tends to decrease. Other investors pull out the money. Until it reduces the organization’s capabilities to do things. And every other investor pulls out their money. So nothing works anymore. They lose everything.",
            "title_similarity": "0.7724101"
        },
        {
            "id": "i4wpcxx",
            "score": 1,
            "text": "The best answer I can give is that “the economy grows at least 2% a year forever” is so thoroughly baked into the structure and expectations of the modern economy that changing it would be like pulling the rug out under a house of cards. Everyone who cares about this stuff expects future growth because it’s pretty much always happened before, in the same way that us ordinary humans expect the sun to come up every day. Massive amounts of money are parked in things like index funds and retirement accounts because people expect those things to gain value at a steady rate.\n\nI personally believe that endless growth isn’t possible for much longer barring an unexpected massive advance in technology, and that a zero-growth world would still be perfectly fine to live in. But the transition would essentially destroy the economy as we know it, and we’d have to figure out something new.",
            "title_similarity": "0.7708328"
        },
        {
            "id": "i4wpylo",
            "score": 1,
            "text": "Because our entire way of life, our investment strategies, (arguably) toxic work culture, etc. is all based on the idea of endless growth. If this were to suddenly end, people wouldn’t see the continuously greater prosperity we’ve come to expect, and would start to get upset, possibly, in fact, likely, leading to further problems.",
            "title_similarity": "0.6855551"
        },
        {
            "id": "i4wqqv3",
            "score": 1,
            "text": "Because population tends to grow each year and technology also tends to advance with time, so if there's more people with better tools it is expected that they are able to make more in total than before, if they aren't it must mean there's something wrong somewhere.\n\nAlongside with the problem that having more people to divide the same wealth, or even less in case of negative growth, with means everyone, in average, gets less for themselves.",
            "title_similarity": "0.78391397"
        },
        {
            "id": "i4wqsvf",
            "score": 1,
            "text": "This is a deep thread, but I’ll add 2 cents. A big reason why growth is needed has to do with incentives to spend and invest which then leads to more growth. If you believe that prices will go up tomorrow, then you will buy today, hence putting money in circulation and help the economy move along. However, if you think price tomorrow will be lower, then you hold off on buying as long as you can. This effect leads to less economic activity. \n\nThe babysitter co-op is a classic example. https://en.m.wikipedia.org/wiki/Capitol_Hill_Babysitting_Co-op\n\nI realize I am conflating growth and inflation which are not the same thing, but usually go together. A little inflation drives many of the modes that help fund loans which have been great for people to afford better standard of living than their current cash balance would warrant - think of how hard it would be to buy a house without a mortgage!",
            "title_similarity": "0.81476724"
        },
        {
            "id": "i4wt4y2",
            "score": 1,
            "text": "Economic growth is related to inflation (AD-AS), and 0% inflation has 4 problems : 1) central banks overestimate inflation 2) negative chocs will turn into deflation 3) debt-deflation phenomena 4) bad for workers roll.",
            "title_similarity": "0.7463105"
        },
        {
            "id": "i4wuizo",
            "score": 1,
            "text": "Because our economy channels wealth to the rich. To stop economy from failing, we need to pump new wealth in to it so there is enough to go around. Its like a game of monopoly, when a player \"wins\" they've taken so much wealth for themselves, the game stops working. If you handed out new monopoly money to players, the game could keep going. The winner could keep winning and the rest of the players could survive paycheck to paycheck, but would own nothing. This would mean the game grows. If we don't grow, everything collapses.",
            "title_similarity": "0.7500758"
        },
        {
            "id": "i4wv5fx",
            "score": 1,
            "text": "Because we are using Monopoly money which is inherently worthless and inflationary. Assets are a currency and they increase in value. So is good and silver.",
            "title_similarity": "0.6194348"
        },
        {
            "id": "i4wx0af",
            "score": 1,
            "text": "The world economy is built on borrowed money, on paying for today's pleasures with discounted future money. That scheme requires economic growth, which requires population growth and/or increasing productivity.\n\nThe stock market represents an inflation of capital value that far exceeds the original investment, and the actual amount of money that would be required if investors sold their stocks for cash. A classic Ponzi scheme.\n\nSo far, so good. But when future expectations of wealth fall behind current predictions, the Ponzi scheme can unravel, quickly.",
            "title_similarity": "0.7813399"
        },
        {
            "id": "i4wy7y6",
            "score": 1,
            "text": "The reason economies need to \"grow every year\" is because all global economies are backwards in that they're built upon the inflationary model instead of the **natural and organically occurring** deflationary model. \n\nThe inflationary model is built on one principle -- consumption. The biggest fuel required for consumption is *credit*, specifically, easy credit. How many people do you know whose house \"makes more money\" than they do? How *natural* is it for a dwelling to increase in price by two hundred thousand dollars in a couple/three years? How many people have borrowed against their ever inflating assets to buy a second ever inflating asset, or a boat, a holiday, renovation, etc?  How many \"accidental millionaires\" are out there?\n\nHow many CEO's have you heard of that invested in automation or some form of AI because they wanted to be less efficient or less competitive in their respective marketplace? \n\nNone. \n\nSo why aren't \"things\" becoming less expensive every year if companies become more streamlined and more efficient? \n\nInflationary practices are forced upon the naturally occurring deflationary economy to ensure goods (i.e., houses to chewing gum) increase in \"value\" every year.\n\nThe problem faced by consumption based inflationary economies is **modern technology**. which is inherently deflationary. This has never happened like it's happening today.  And no, the industrial revolution doesn't count, for obvious reasons.",
            "title_similarity": "0.83740604"
        },
        {
            "id": "i4x0kuj",
            "score": 1,
            "text": "I’m surprised that no one here (as far as I can tell) has mentioned debt-to-GDP ratio.  In today’s world this is a major factor that necessitates the growth of economies as nations remain perpetually in debt.  Currently Venezuela has the highest ratio with Japan not far behind.  The debt-GDP ratio determines a nation’s ability to pay off its debts and if the ratio goes far beyond 100% it’s generally seen as a sign of trouble.  This ratio if it goes too high also affects a country’s creditworthiness.",
            "title_similarity": "0.7497979"
        },
        {
            "id": "i4x1gp5",
            "score": 1,
            "text": "Keynesian Economics vs Austrian Economics\n\n&#x200B;\n\nStart here: [https://mises.org/library/thought-experiment-comparing-austrian-and-keynesian-stimulus-packages](https://mises.org/library/thought-experiment-comparing-austrian-and-keynesian-stimulus-packages)\n\n&#x200B;\n\nFinish here: https://mises.org",
            "title_similarity": "0.53704107"
        },
        {
            "id": "i4x54uv",
            "score": 1,
            "text": "Because what Americans like to call “the economy” is actually just a massive pyramid scheme that collapses every decade or so.",
            "title_similarity": "0.68874645"
        },
        {
            "id": "i4x71f6",
            "score": 1,
            "text": "There seems to be a misconception in this thread that economic growth and technological innovation are the same concept. While the latter can lead to the former, it does not always.",
            "title_similarity": "0.5825112"
        },
        {
            "id": "i4x9kou",
            "score": 1,
            "text": "As an econ graduate, I feel obligated to answer your last question: The idea of “the economy” was invented with the creation of “capitalism” so for the last 400 years, they have been inherently connected—and capitalism, in all its models, seeks growth. Is this good? My professors used to say **”growth for the sake of growth is the logic of a cancer cell”** so there’s that. But the ELI5 answer is that we measure our economy by its growth because that’s what the capitalist economy is set up to do, and historically speaking, no one knows when or if it will ever be “too much.”\n\nTo be extremely reductive (please don’t kill me), Adam Smith thought profit-seeking growth would eventually collapse upon itself and that’d be that, Malthus thought population would outpace growth and we’d all starve to death, Marx thought the brutal inequality of capitalist growth would force the transition into communism, Keynes thought the boom-and-bust system could be smoothed and sustained through government regulation forever, etc. etc. The point is, none of these political economists have been proven right because the end of capitalism (i.e. an economy where growth is not the key driver of all activity), has not yet happened. \n\n*(Again this is so simplified, please don’t come at me for shredding these massive theories down to a dozen words each)*\n\nThere’s a lot of good material already in this thread so I hope this still contributes something. The history of economic theory is wildly overlooked imo but it’s important to show the diversity of how much fucking subjectivity there is in our understanding of the economy",
            "title_similarity": "0.7220934"
        },
        {
            "id": "i4xb5m6",
            "score": 1,
            "text": "The population is growing, so as a result the economy has to grow right along with it. If after a year the population had grown 5%, but the economy only grew 3%, then the economy would effectively be shrinking",
            "title_similarity": "0.78263485"
        },
        {
            "id": "i4xnrt2",
            "score": 1,
            "text": "Not at all true. Economic growth has nothing to do with capitalism. Essentially every economic system in history has aimed for growth, China is a mostly communist economy and they are constantly trying to grow. The USSR was a mostly communist economy again and was also trying to grow constantly.",
            "title_similarity": "0.65180665"
        },
        {
            "id": "i4xo3iv",
            "score": 1,
            "text": "Innovation is driven by incentives. A stagnant economy lacks those incentives. Though it's also a little chicken and egg. As innovation drives growth.",
            "title_similarity": "0.6727927"
        },
        {
            "id": "i4yehr9",
            "score": 1,
            "text": "The measures are what is used to give a broad indications to allow some time for policies and resource allocations to adjust",
            "title_similarity": "0.26214683"
        },
        {
            "id": "i50d25h",
            "score": 1,
            "text": "There was a large infrastructure bill passed.  But the Republicans delayed it so long claiming they wanted it to be bipartisan and then did not vote for what they said the bill had to be. So it was finally passed last winter and now the money is allocated, it will take time to determine what roads and bridges are most in need, put out bids and make that money go as far as possible. \nOnce those jobs are allocated money, people will be hired for good paying construction jobs.  Those jobs will allow them to buy a house, which means other people will build those houses.  They will eat out for lunch and other people will make greater lunch sales. \nTechnically economists expect some recession.  Keeping people working with full time jobs that offer benefits and a comfortable middle class life keeps the country growing.  The roaring 1920's created the Great Depression of the 1930's.\nWhen the divide between the Poor and the Rich is so large it erodes the middle class, you get Depressions or Revolutions.  In fact now the divide between the poor and rich is greater than the economics that created the French Revolution.  Slow growth that provides a solid middle class is what every economy strives for.",
            "title_similarity": "0.6873735"
        },
        {
            "id": "i51rvas",
            "score": 1,
            "text": "It does NOT need to grow it should stop growing when everyone can afford to live in a country for example",
            "title_similarity": "0.49939692"
        },
        {
            "id": "i52lqdc",
            "score": 1,
            "text": "Infinite growth is not possible without solving “problems”(Finite resources) before/during growth. Am I naive🙏🏽",
            "title_similarity": "0.57395774"
        }
    ]
}