{
    "CMV: Violent crimes should be punished more harshly if they are committed by on-duty police officers\nDisclaimer: I am not a lawyer, and I may be missing some nuances with respect to how sentencing and punishments typically work, and lots of other stuff.\n\nViolence, or the threat of violence, is punished more harshly when there is more weight behind it. For instance, the difference between simple battery and aggravated battery generally includes the use of a deadly weapon, even if the injury sustained by the victim is the same.\n\nThe actions of on-duty police officers have the implicit backing of the state, which has a monopoly on the legitimate use of violence. In the same way that it is worse to commit a crime with a deadly weapon than it is to commit that same crime without one, it is also worse to commit a crime while leveraging the power of the state than it is to commit the same crime without leveraging that power. \n\nI therefore believe that violent crimes such as assault, battery, manslaughter, and murder that are committed by on-duty police officers should carry increased punishments. For instance, an on-duty police officer who commits second degree murder might be subjected to the same range of sentences as a non- (or off-duty) police officer who committed first degree murder.\n\nEdit:\nSo I wanted to address an argument that I've seen against this in the comments several times--namely, that we shouldn't have different legal standards for different people based on their profession. I agree. I was thinking about that when I first made this post, which is why I originally excluded off-duty police officers--my intent was to differentiate the act (commission of a violent crime and taking unjust advantage of the state's monopoly on violence) from the person (the police officer). I'm not sure if the method I proposed actually accomplishes this, though. A few people have pointed out potentially better ways to do this.\n\nAlso, apparently something like this already exists, as u/r33k3r and others have pointed out: https://www.justice.gov/crt/deprivation-rights-under-color-law\n\nEdit2: Left out a word": [
        {
            "id": "gv07lls",
            "score": 1,
            "text": "/u/SolopsisticZombie (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/mtkq2z/deltas_awarded_in_cmv_violent_crimes_should_be/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.54731953",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gv003j7",
            "score": 0,
            "text": "I suppose I would think that too if I never had to work such a brutal and thankless job where you're routinely in contact with the absolute worst of humanity. You literally could die at work on any given day, doing any of the tasks you're paid to do. The entire media industrial complex spews non-stop hateful propaganda about you and the decisions you make. The people you run into fill their social media with guns, drugs, and threats, and then when their lifestyle reaches its inevitable end, they're treated like sweet precious angels.\n\nThankfully, I actually did my own research rather than just gobbling up narratives proffered by  massive uncaring corporations. These people aren't angels. Cops make plenty of mistakes.\n\nBut death by cop is so incredibly rare that it is waaaay down on the list of shit to care about.\n\nBesides, no one cares about white people being killed by cops. Remember that white guy killed when an officer put a knee on his neck? The year of non-stop media coverage? The large merchandising effort afterward? Me neither. For some reason, the interests that control the news cycle didn't say anything about it. You have to go out of your way to find it: [https://apnews.com/article/9612534be8b3885bcbf9d80a36a020bb](https://apnews.com/article/9612534be8b3885bcbf9d80a36a020bb)",
            "title_similarity": "0.66233295",
            "sentiment_compound": -0.9864
        },
        {
            "id": "guzivsb",
            "score": 0,
            "text": "Many crimes already are punished like that. Being seen as in a position of authority, exploitation of power, use of deadly force when you’re trained all tend to carry harsher sentences. \n\nFor example, boxers who beat people to death are usually given harsher sentences because they’re trained fighters and they know what damage can be done. \n\nSoldiers who use deadly weapons are trained in firearms use so they usually receive harsher sentences because they are considered competent in their use and know what damage they do and what will kill. \n\nPolice already face similar sentencing for abuse of power and authority. They’re trained in law and order so breaching professional conduct as well as the law already entails a harsher sentence.",
            "title_similarity": "0.82860816",
            "sentiment_compound": -0.9853
        },
        {
            "id": "guzvahq",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.1195653"
        },
        {
            "id": "guzfvv5",
            "score": -2,
            "text": "Why does it have \"more weight\" because it's in the name of the state? What do you mean by more weight?  \n\n\nAs I understand it usually punishment is harder if the threshhold is higher. That's why punishment is higher if murder was planned and coldblooded rather than when it's just caused by negligence.   \n\n\nCops basically have to deal with danger everyday. Get shot at all the time. To me when they make a mistake and shoot when they shouldn'T have, it even has less weight as when some random criminal recklessly shoots a bystander.   \n\n\nThe cop is forced to be in a situation where they could harm others. They can only be blamed for the splitsecond decision that was a mistake. Not for picking up the gun and putting themselves in situations where they could hurt others.   \n\n\nIn the end tho, it just depends on the individual case. That's why I don't believe such a differentiation would make sense.   \nYou can always consider aspects of being a cop in any individual trial which I'm sure already is the case. There is no need to turn that into specific legislation tho.",
            "title_similarity": "0.8545032",
            "sentiment_compound": -0.9904
        },
        {
            "id": "gv0197o",
            "score": 37,
            "text": "I believe that violent crimes committed by on-duty officers during action should be punished less than those of a regular person in general (not counting situations where a policeman just shoots person or something like that). Basically every case should be inspected independently and should have little to no connection to punishments of a regular person. \n\nWhy?\n\nThe police's job is one of the most important in our society, but also the one that carries the most responsibility and a lot of stress, and possibly one of the jobs with(possibly) highest chance of dying. It has to be done. Situations that policemen encounter and work in are special case in our society. Those situations by definitions are the ones that are the most dangerous and most unpredictable. If we were to punish police more for mistakes they make during stressful situations than the crimes made by civilians do you think that it would be fair? \n\nMany cases of police killings are not clear at any point of the investigation. What for the person outside looks like excessive use of firearms used against innocent person is in fact a defense triggered by fast, unexpected move towards waist (to possibly take out a gun) by a person that was suspected to be armed. What after the fact looks like an innocent person with mental health problems having a breakdown for a person during the events looks like unstable person rushing around having god knows what in his pockets. When that person resists arrest and starts rushing towards you, despite your warnings and knowing you are a police officers what is a correct response? Do you know? Would you let that person come close enough to touch you or stab you? What if this sudden move from outside the view is this person taking his gun out and preparing to shoot you? Would you let that chance? Should you? \n\nThen the argument with training comes along. While it's true that cops should be trained better, the problem is that there is only so much you can train a person to do. We are humans. We are not perfect machines that will have perfect information and choose perfect actions based on that. We are humans. We will make mistakes. Trained people make mistakes too. Even the police. Even soldiers do. Sometimes that mistake will be handcuffing a person. Sometimes it will be detaining a wrong guy. And sometimes, unfortunately it will be a tragedy. And in those situations we should look very closely whether it was the cop's fault or not.\n\nBecause there is a huge difference between a slight, but understandable mistake in work and cold blooded murder. And cops very rarely do cold blooded murders. Because most of the time when those mistakes occur they are in highly stressful situations with lives (theirs and people around) at stake with fractions of seconds to make a decision.",
            "title_similarity": "0.8762419",
            "sentiment_compound": -0.9972
        },
        {
            "id": "guzt2jl",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.113344245"
        },
        {
            "id": "gv02u36",
            "score": 7,
            "text": "Police officer convicted of violent crimes should be punished less harshly than civilians because police are allowed to be violent. Police if charged with a crime are charged as individuals, not as “the state”. And those individual police officers are authorized to use violence and threats of violence as part of the job of law enforcement.  If, by error or negligence, their use of violence moves from legitimate to criminal (which can occur in the blink of an eye) the distance from legal to illegal actions can be very small.  And this is often how police end up charged with a crime.    Cops legitimately using a baton to subdue a suspect go to far after the subject stops resisting and gets charged with assault. A cop  confronts a suspect after receiving a call about an individual with a gun and shoots him when he reaches for his waistband, but he has no gun and is the cop is charged with murder. A cop grabs for their taser in a  struggle with a resisting suspect,  in the heat of the moment grabs their gun by accident and shoots the suspect. All these sound familiar? And they all involve one little step from legit use of violence to illegal use.  \n\nOne the other hand there is almost no circumstances where an individual civilian is allowed to use violence.   They have to intend to commit a criminally violent act since there is no legitimate reason for them to be using violence in the first place. \n\nUnder your theory the cop who shot Duante Wright if convicted of manslaughter would receive a harsher sentence than a criminal convicted of manslaughter who starts a bar fight and kills a man when he knocks him out and the victim hits his head and dies. The cop has a legit reason to be violent with Wright in pursuit of his arrest. The bar fighter has no legit reason to have hit his victim. The cop should not get a harsher sentence.",
            "title_similarity": "0.9016484",
            "sentiment_compound": -0.9986
        },
        {
            "id": "gv091hl",
            "score": -2,
            "text": "I would agree with this on one condition - we make it an equally serious offence to inaccurately portray a police encounter. If a reporter says \"John Smith murdered Dwayne Brown\" and the court does not find that officer guilty of murder, that journalist does time for first degree murder.\n\nThis will end the problem of police violence overnight, because the problem isn't police murdering people - it's the media telling you police murder people.",
            "title_similarity": "0.8077584",
            "sentiment_compound": -0.9824
        },
        {
            "id": "guzfrmn",
            "score": 467,
            "text": "Violent crimes should be punished harshly despite what section of the workforce you may take place in, a violent crime is a violent crime.",
            "title_similarity": "0.83664274",
            "sentiment_compound": -0.9709
        },
        {
            "id": "guzrwd2",
            "score": 0,
            "text": "I am sympathetic to the idea that in the sentencing of a violent offense, an on-duty police officer may have a harsher punishment due to their greater position of responsibility, but the same logic can cut both ways. For example, if an officer claims they acted out of self-defense in their violent action, even if a court does not accept the self-defense as being objectively reasonable, they could still accept evidence that the officer was subjectively in a state of fear and panic when the violence occurred and use that to justify a lesser sentence. Sentencing is multi-faceted and highly contextual, which is appropriate because it gives the court space to apply their common sense to give a punishment appropriate to the circumstances, instead of being restricted by overly-prescriptive rules that are broadly acceptable but can lead to bad outcomes in individual cases.\n\nAnd as a broader point, IMO the largest issue with police violence is not that the sentences are insufficiently harsh, but that the law, conservative prosecutors & the blue wall of silence are preventing police from being charged and convicted of these violent crimes in the first place. As someone else noted, the theory of deterrence (that harsher punishments will prevent the crimes) has not really been proven out. A far more urgent response to police violence is to ensure that the justice system can adjudicate and properly punish violent police officers at all, rather than the punishments given to the rare police officers that actually do get prosecuted and convicted.",
            "title_similarity": "0.8935425",
            "sentiment_compound": -0.9976
        },
        {
            "id": "guzhr58",
            "score": -3,
            "text": "What percentage of the 3million people in jail do you think are innocent of the crime they're found guilty of?",
            "title_similarity": "0.5888835",
            "sentiment_compound": -0.5994
        },
        {
            "id": "guzvu6l",
            "score": 10,
            "text": "One aspect that needs to be considered is that the police are required by their work to become involved in and resolve contentious situations.  They don't have the option of saying \"Not getting involved in that mess.\". Imagine the situation: a couple of police officers turn the corner and see a fourteen year old boy and a sixty year old man in a heated fight, striking each other with big stones.  They don't stop when the police try to calm them down.  So the police have to stop it physically in the heat of the moment, and they have to think not just about their own safety but that of both participants.  They don't know who started it, and so much could go wrong and they could be blamed for the injuries of an innocent child or an innocent old man.  In court, the prosecutor could suggest all sorts of things they \"should\" have done instead which rely on a large amount of hindsight and may not occur in the heat of the moment.\n\nNow, there are genuine issues in countries where police are largely funded through forfeiture, thus placing them at odds with the public. But where there is policing by consent, I think that their actions should be taken into account the fact they don't have the option to not get involved.  That doesn't mean that they should get off scot free, but I don't think they should receive surplus punishment either.",
            "title_similarity": "0.748984",
            "sentiment_compound": -0.3519
        },
        {
            "id": "guzp7lx",
            "score": -3,
            "text": "Unfortunately, the role of being a police officer needs to have implied forces of violence. Without them the police officers job becomes virtually impossible. Its an obviously extreme example but if someone robbed a house and the police were not able to grab them and force them to the ground, there would be rampant theft as the thieves could easily escape.\n\n(Im not a lawyer and this depends on the area you live in) Also the idea that utilising a weapon and committing the same crime as one without a weapon means that the crime is more severe is not entirely true. The concept behind that sentencing is that the person with the weapon has a clear intent of malice when committing the crime of murder for instance and then enacts that, which results in a more severe sentence. Thus the idea that a position of power/technical experience being leveraged in a crime is equivalent to that of a weapon isn't strictly accurate as the person in a levaraged position doesn't necessarily mean they're using that maliciously.\n\nNow that is not an argument for abuse of that violence but in a legal sense the waters are muddied between force that is excessive and force that is not excessive. And the degree of malice shown by said officer doing their job and going over and above the appropriate action is also muddied in a court.",
            "title_similarity": "0.839491",
            "sentiment_compound": -0.9951
        },
        {
            "id": "guzs18q",
            "score": 0,
            "text": "Violent crimes should be punished much harsher when they are committed by anyone. I think every situation is different.. a person killing someone who just raped his child is different than a person killing someone because they were having a bad day. Just as a cop killing a fleeing suspect with a gun in a split second decision is different than a cop continuing to kneel on on suspects neck even after the suspect has lost consciousness(thus contributing to suspects death).  But the law and punishment should not be based on race, wealth, religion, occupation, etc.",
            "title_similarity": "0.82122624",
            "sentiment_compound": -0.9737
        },
        {
            "id": "guztay4",
            "score": 0,
            "text": "Are you suggesting they get higher than the maximum sentence or just above average?",
            "title_similarity": "0.2669174",
            "sentiment_compound": 0.0772
        },
        {
            "id": "guzxvw7",
            "score": -4,
            "text": "Police are the only thing between violent criminals and the death penalty. The west exists on the basis that stealing something like a horse or cow once gets the death penalty. Steal anything twice? Death penalty. The cops arent killing enough people.",
            "title_similarity": "0.7379823",
            "sentiment_compound": -0.9837
        },
        {
            "id": "guzyr4s",
            "score": 0,
            "text": "I'd like to hear your thoughts on this article/radio podcast (less than 7 minutes long).\n\n[link](http://Police Violence And Reform: The Inequality In Restorative Justice Opportunities  https://www.npr.org/2021/04/17/988414716/police-violence-and-reform-the-inequality-in-restorative-justice-opportunities)",
            "title_similarity": "0.57430667",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gv01gqr",
            "score": 0,
            "text": "No",
            "title_similarity": "0.029596541",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv03sbo",
            "score": 0,
            "text": "I've been saying for years, double the fines/criminal penalties for crimes committed by cops/politicians. They constitute a greater potential harm to society when they're authorized and entrusted to use deadly force. When they abuse that public trust, the penalties should take that into account.",
            "title_similarity": "0.73901623",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv069b4",
            "score": 0,
            "text": "I would counter their should be a multiplier much like hate crime laws, but that applies to someone who uses a government position to commit crimes. \n\nSo if you are a congressman, and sell cocaine no extra time for that crime. Though if you are the head of the FBI selling cocaine, and use your position to keep your operation from being discovered. You should have double the sentence, or some multiplier like that.",
            "title_similarity": "0.79554856",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gv07kn9",
            "score": 0,
            "text": "The punishments for violent crimes as is are fairly substantial. The trouble right now isn't that police need to be punished more harshly than civilians, but rather, they they're being punished far *less* harshly than a civilian in the same situation.\n\nI think a lot of the problems regarding the issue of cops needing to be held to a higher standard can be solved if they were actually simply held to the same standard as civilians instead of given free acquittals or far less harsh punishments.",
            "title_similarity": "0.8802613",
            "sentiment_compound": -0.9176
        },
        {
            "id": "gv0qf91",
            "score": 0,
            "text": "They are, arent't they?",
            "title_similarity": "0.028294804",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1gw9y",
            "score": 0,
            "text": "This is just obvious police hate.",
            "title_similarity": "0.5290692",
            "sentiment_compound": -0.5719
        },
        {
            "id": "guzmgyz",
            "score": 234,
            "text": "Standardized punishments have been shown to be less effective at dissuading the behaviour it punishes. Tacking on additional punishments to criminal behaviour because of a persons job won’t have as an appreciable effect as say better training and recruiting.",
            "title_similarity": "0.7383273",
            "sentiment_compound": -0.7501
        },
        {
            "id": "gv09lg0",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.1195653"
        },
        {
            "id": "guzwfxu",
            "score": 1,
            "text": "I think you should include any felony committed by any public official who takes an oath whether on duty or not.  I wouldn't include all government employees, but would include anyone who exercises authority over the public in the course of their official duties.  So not garbage men or postal workers, but including local city council members and  the postmaster general.\n\nPeople in positions of authority are employed to generally maintain or improve the general welfare, it is a position of trust which can be violated.  Committing a violent crime is a violation of that trust.  Their crimes not only do the damage caused by their crime, they also damage public trust in our institutions and the fabric of our democracy itself.  That damage should be deterred, too.",
            "title_similarity": "0.84082115",
            "sentiment_compound": -0.9674
        },
        {
            "id": "guzzvws",
            "score": -1,
            "text": "The law should be equal across all people. No one should get treated differently just because of their employment, whether that be the president, a cop, or a ditch digger.",
            "title_similarity": "0.5852479",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv0c3yt",
            "score": -1,
            "text": "I agree.   If you assault a police officer, it's a harsher charge than if you assaulted your neighbor.",
            "title_similarity": "0.8498709",
            "sentiment_compound": -0.836
        },
        {
            "id": "guzwqjs",
            "score": -2,
            "text": "What is your take on the U.S. D.O.J. not bringing any charges to the Capital Police officer killing an unarmed woman (gunshot to the chest) during the January 6th protest/riot?",
            "title_similarity": "0.54819506",
            "sentiment_compound": -0.5553
        },
        {
            "id": "gv0b7ds",
            "score": 2,
            "text": "More harshly X zero is still zero.",
            "title_similarity": "0.30865997",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv02brb",
            "score": 4,
            "text": "Something like this exists, called “Depravation of rights under color of law”. It’s not that severe, just up to a year in prison, but could be used as a model to what you are talking about.\n\nhttps://www.justice.gov/crt/deprivation-rights-under-color-law",
            "title_similarity": "0.5724101",
            "sentiment_compound": 0.0495
        },
        {
            "id": "guzwu0x",
            "score": 92,
            "text": "Harsher penalties consistently fail to increase deterrence.\n\nThe problem with officers breaking the law isn't that penalties aren't harsh enough. It's that they don't expect to face ANY penalties.\n\nIf officers expected to be caught and face consequences, if a culture of police actually policing each other could take hold, and outside eyes could reinforce that, I don't think we'd need longer sentences. Just do away with the expectation that police can get away scot free.",
            "title_similarity": "0.84611714",
            "sentiment_compound": -0.2946
        },
        {
            "id": "guzr9mw",
            "score": -6,
            "text": "I would argue they already are punished if you compare them to violent criminals at large. Look at the rate at which violent crimes end with an arrest in New Orleans, Detroit, Chicago, Atlanta, Houston, etc. It’s very low as a percentage which means many criminals are staying out on the streets. However, police officers involved in an incident are going to be investigated a majority of the time, even though it’s more likely their actions were not criminal based on their training.",
            "title_similarity": "0.8114125",
            "sentiment_compound": -0.9706
        },
        {
            "id": "guzvpt4",
            "score": 9,
            "text": "This issue with punishing lore harshly is the misconception of the initial point of jail and prison.\n\nPrison isn't supposed to be simply a place to store criminals. The underlying initial idea was to reform its inmates. Those not serving life sentences were/are intended to learn the errors of their ways so that once they leave prison, they can be a better model citizen and not commit a crime again.\n\nThe issue there is that many (I'll ever say most) prisons don't care of their inmates are successful or not, and do the bare minimum to keep them alive and well, nevermind better them to prepare them for a successful and responsible life upon release.\n\nOn top of that, in prison you are basically *required* to join a group, just to stay alive or generally out of harm/rapes way. In joining these groups, you take yet another step backwards from what a model citizen outside of jail would be. The longer you are in prison, the more difficult it is to be anything successful outside of prison, and is part of the reason why so many people gok back to prison. They can't handle being pit on their own, they don't have the life skills necessary to success outside of jail.\n\nThis issue much more affects those whom prior to their sentence were already not in a good spot, but we've seen it time and time again where people of a better upbringing who break the law go to jail, and come out worse than when they went in.\n\nThe solution here should be fair trial and sentencing, but also better training, better regulations of said training, and better prison reform support to ensure those in jail are learning more skills to prepare them for success upon release.\n\nIf you leave someone to rot for 15 years, and take another person and teach them the error of their ways for 15 years while preparing them for how the world outside is like in 15 years, guess which one is going to do better on that 15th year once they return to society.",
            "title_similarity": "0.75367194",
            "sentiment_compound": 0.9745
        },
        {
            "id": "guzkfyv",
            "score": 101,
            "text": "[removed]",
            "title_similarity": "0.113344245"
        },
        {
            "id": "gv011jl",
            "score": 34,
            "text": "The biggest problem with holding police accountable is getting the convictions in the first place. Raising the penalties for a crime can sometimes reduce the rate of convictions for that crime.\n\nAlso, it's not often the equivalent crime. If an on duty police officer robs a liquor store, sure. But in general these are crimes that are committed more or less in the performance of duty. It is in some ways worse, but it's also harder to separate from the so-called reasonable use of force that is permitted in the course of the police officer's job. So just taking \"murder two\" and adding a little extra sentence doesn't address the issues that make it harder to hold them accountable.",
            "title_similarity": "0.8524221",
            "sentiment_compound": -0.9543
        },
        {
            "id": "gv00kdg",
            "score": 1,
            "text": "Manslaughter is different than murder, making a manslaughter charge more severe is like making typos punishable by death if you are an accountant, workplace accidents are realistically an avoidable fact. Cops who murdered are abusing power. Cops who made a workplace accident, I think their guilt is punishment enough, it’s more punishment that life in prison, knowing someone died by your hands, wouldn’t you agree?",
            "title_similarity": "0.8101794",
            "sentiment_compound": -0.9896
        },
        {
            "id": "gv01mtn",
            "score": 7,
            "text": "The immediate issue I can think of is that officers will be more likely to hesitate when making the decision to use deadly force. I think it would be more helpful to train officers to make the right decision at the right time to use force and execute it properly.",
            "title_similarity": "0.762044",
            "sentiment_compound": 0.1851
        },
        {
            "id": "gv01pza",
            "score": 3,
            "text": "There are usually extra laws for official misconduct etc that cover that what you are talking about. Convictions rarely get the maximum punishment and the states attorney could easily argue the points you are making in sentencing. Adding that into the laws likely wouldn't accomplish anything. The time and effort would be better spent taking steps to hold them accountable to the extent our current system is supposed to, rather than adding the potential for longer sentences that will never deter anything and aren't even likely to increase the punishment significantly",
            "title_similarity": "0.81955886",
            "sentiment_compound": -0.6036
        },
        {
            "id": "gv04l47",
            "score": 2,
            "text": "I don’t think the state would give their “implicit backing” to someone committing crimes, no matter if they’re a cop or not...",
            "title_similarity": "0.66604626",
            "sentiment_compound": 0.0583
        },
        {
            "id": "gv0dgz0",
            "score": 1,
            "text": "In many jurisdictions, crimes committed by on and off duty law enforcement officers (as well as lawyers) have an effective punishment that is more harsh than the standard citizen. Essentially they will be found guilty of the same crime and often receive the same punishment from the court system. The difference is in the administration of the punishment. Many jurisdictions have programs to reduce jail time. For example, many places have a two-for-one serve time whereas if your punishment is for five years, you’ll be out of jail after 30 months. Also many places have set times where someone will be eligible for parole. Due to a higher ethical standard placed on LEO’s, they are often not eligible for these programs (i.e. they serve day for day) so effectively the punishment plays out harsher for them despite receiving a similar ruling.",
            "title_similarity": "0.7478638",
            "sentiment_compound": -0.9276
        },
        {
            "id": "gv0ee03",
            "score": 1,
            "text": "I guess, I'm not understanding the question or your view, when are Police committing these acts of violence?? Police Officers are carrying out the will of the people, the laws of the people. Why would anyone or how could anyone perform the duties of a Police Officer if carrying out their duties were considered a crime?? Because Police Officers do get punished and go to jail when they commit crimes outside the scope of their duties or use their office to commit crimes.",
            "title_similarity": "0.83200216",
            "sentiment_compound": -0.8343
        },
        {
            "id": "gv0ei1v",
            "score": 1,
            "text": "In order to prevent people from committing crimes, the most efficient way is to make the penalty unavoidable, rather than harsh.\n\nIf you let's say speed on a highway, you probably are not really scared about the fine, but just about the fact of being caught by the police.",
            "title_similarity": "0.8090831",
            "sentiment_compound": 0.13
        },
        {
            "id": "gv0ft3i",
            "score": 1,
            "text": "It is... once they get to jail the prisoners deal with them in a way the law could never punish them. That is if they don’t hang themselves first.",
            "title_similarity": "0.69536275",
            "sentiment_compound": -0.1341
        },
        {
            "id": "gv0gl5i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.113344245"
        },
        {
            "id": "gv0ie7r",
            "score": 1,
            "text": "Correctional officer here!!\n\nI 10000000% agree.",
            "title_similarity": "0.258159",
            "sentiment_compound": 0.4738
        },
        {
            "id": "gv0jtk3",
            "score": 1,
            "text": "Why don’t apply the same idea to doctors and nurses?",
            "title_similarity": "0.40618908",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0ke1e",
            "score": 1,
            "text": "Not a lot of people would choose to be a police officer if they are gonna get punished for it",
            "title_similarity": "0.64726",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gv0ldkv",
            "score": 1,
            "text": "The issue isn't that there should be more punishment. That flies in the face of a just society, where everyone is treated equally under the law. The issue is accountability when someone sworn to protect and serve does cross the line and the lack thereof that is generally shown.",
            "title_similarity": "0.72181344",
            "sentiment_compound": -0.4927
        },
        {
            "id": "gv0lw6x",
            "score": 1,
            "text": "The punishment should be tailored for the crime, not the suspect.",
            "title_similarity": "0.7570516",
            "sentiment_compound": -0.7015
        },
        {
            "id": "gv0mx7u",
            "score": 1,
            "text": "Can we just meet in the middle and have them get the punishment anyone else would have?\n\nIs that asking too much?",
            "title_similarity": "0.6134422",
            "sentiment_compound": -0.5514
        },
        {
            "id": "gv0n8tx",
            "score": 1,
            "text": "Im going to answer as if you're living in the united states.  If you're not, these may not apply. \n \n\n>For instance, an on-duty police officer who commits second degree murder might be subjected to the same range of sentences as a non- (or off-duty) police officer who committed first degree murder.\n\nHow would this not violate the central tenants of our criminal justice system, namely equal protection under the law?  \n\n>which has a monopoly on the legitimate use of violence\n\nDoes it really though?  Self defense is a right of all citizens, and when violence is used in self defense, the burden of proof that the violence was illegitimate is on the prosecution.  Further, in many places private citizens are within their rights to use legitimate violence in the defense of others, and even in defense of property in some jurisdictions.",
            "title_similarity": "0.87994283",
            "sentiment_compound": -0.9755
        },
        {
            "id": "gv0ntt4",
            "score": 1,
            "text": "I hope you are still reading replies. All crimes should be judged the same regardless of the profession of the perpetrator. Instead, I'd support adding an additional charge, something along the lines of \"Officer Misconduct.\" That still holds the police more accountable, but doesn't discriminate based on employment.",
            "title_similarity": "0.80884945",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gv0p4y4",
            "score": 6,
            "text": "It’s a slippery slope.  If you remove the liability protections from police they are simply never going to use their weapons.  So when they get a call that someone is shooting up a school they will just sit in their cars and wait until the suspect runs out of bullets.  \n\nIf your a police office and will have every use of force second guessed in slow motion, after the fact you will just not put yourself into a position where that will be an issue.  \n\nDon’t get me wrong.  I don’t have any good answers.  But removing the liability protections will not have the effects that the proponents think they will have.  \n\nThis is not a situation that is confined to the just the US.  Even in the UK there are complaints of police deaths and no police there has ever been convicted of murder, despite some very controversial shootings and this in a country where most police don’t carry guns.  \n\nThere’s no panacea to this subject.",
            "title_similarity": "0.69802094",
            "sentiment_compound": -0.9625
        },
        {
            "id": "gv0t0hs",
            "score": 1,
            "text": "I don’t think police should be punished more harshly but I do think they should be charged for the crime they commit, which could include abuse of power and unlawful detainment. I also think the police need to not be treated differently while off-duty. I don’t know if you all know but currently employed police officers have the same protection when they are off-duty as well. They only need to be “in fear for their life” to kill you in the parking lot at Costco. And charge your loved ones with assault of police officer for protecting you in a fight with the crazy man in the bread aisle. (This scenario happened in riverside, California a couple of years ago right around when that mass shooting at Costco in Texas happened)\n\nI think a quicker solution to reduce police violence is have them carry insurance like doctors. And have the ability for the families of the people they killed be able to sue them personally. I think it’s time for the police to start to think more and make better decisions when it comes to using force. \n\nThe police need to be sure the person had a gun before they shoot. Because a lot of these wrongful shootings (by public standards not police standards) the police aren’t thinking about anything else but I need to kill him before he kills me. \n\nSo I would \n1. Charge police with the crimes they commit which could be different because of the unique position their job puts them in.\n2. The protection the police have under the law should only be when they are actually working.\n3. The police should carry insurance similar to what doctors have to get. And allow families of the people the kill or greatly disable/injure to sue them.",
            "title_similarity": "0.8416701",
            "sentiment_compound": -0.9939
        },
        {
            "id": "gv0u35v",
            "score": 1,
            "text": "I don’t really think that’s the issue though. The issue is that our system allows people in positions of power, such as being in the profession of law enforcement, to act in ways which would otherwise be thought criminal.\nThis isn’t even a controversial thing to say. It’s why we have such harsh penalties for people who impersonate a police officer. Police in the modern US are given extraordinary professional privilege which is nowhere defined in the constitution. The constitution, in fact, does not outline any system of professional law enforcement, and the privileges today afforded to American police officers are a result of a long history of legal compromise, racism, and class warfare.\nThe fact that today even off duty police officers are extended the power to act as negotiator and enforcer in all manner of minor personal disputes is ludicrous in a system which, at the time of its founding, guaranteed the legal right of two (white, educated, and propertied) men to murder one another over an insult.",
            "title_similarity": "0.7912892",
            "sentiment_compound": -0.9633
        },
        {
            "id": "gv0xa3l",
            "score": 1,
            "text": "It's a difficult situation to assess. Obviously there have been a lot of video documented situations where the officer is directly and intentionally commiting a violent crime. Balancing the intentional against the unintentional against the mandatory is not a equation that can be directly calculated. However, that being said, if every officer of the law wears a body cam then very little is ever left to question. Qualified immunity is bullshit and it will end soon.",
            "title_similarity": "0.7959827",
            "sentiment_compound": -0.9246
        },
        {
            "id": "gv0yby1",
            "score": 1,
            "text": "CMV: Police should be held to a higher standard in every matter regarding the law, and as far as I'm concerned, should face harsher consequences for all deliberate, unnecessary illegal actions.",
            "title_similarity": "0.7498777",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gv0ypdm",
            "score": 1,
            "text": "They don’t even get punished lol",
            "title_similarity": "0.28361064",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gv10dq5",
            "score": 1,
            "text": "So conversely, violent crimes done by an off duty cop would be punished less harshly?\n\nHow about we punish all to the same standard regardless of race, sex, occupation and political leaning?",
            "title_similarity": "0.8648574",
            "sentiment_compound": -0.8987
        },
        {
            "id": "gv11sdt",
            "score": 1,
            "text": "i mean yeah they should be, who watches the watchmen?",
            "title_similarity": "0.3334428",
            "sentiment_compound": 0.296
        },
        {
            "id": "gv13b34",
            "score": 1,
            "text": "Police should just be treated equally in the eyes of the law instead of having their own private justice system.  If we could actually send dirty cops to jail, the harsher punishment bits would probably get sorted out naturally.",
            "title_similarity": "0.83562785",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gv14gvx",
            "score": 1,
            "text": "No, everyone deserves “equal rights”. They should be held as accountable as anyone else. Putting people on pedestals is one thing that ruins democracy.",
            "title_similarity": "0.6436721",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gv15h1i",
            "score": 1,
            "text": "Let me start by saying I agree with your intentions, but I fear this will make bad things worse. Consider the following:\n\nOne of the few good reasons we have police is because ultimately there must be some use of deference to the state to prevent the chaos associated with failed states like Somalia and Afghanistan. If police officers are given the option to say \"we didn't intervene because the individual officers are too worried about being prosecuted\", then that's a whole 'nother can of worms. The police could then start saying they have another legitimate reason to not intervene in *some* crimes as opposed to others, their reasoning becomes confidential, then we'll have a mafia state. \n\nFundamental police reform is necessary, I'm totally with you. But essentially this threat of prosecution would allow the bad police extra room to shield themselves from the law. \n\nWhat if Gang A starts getting squeezed, and Gang B starts taking over, and the cops have the power to say \"sorry we couldn't go after Gang B, we felt it was too risky!\"\n\nETA: consider Canada's guide to citizens' arrest in Canada \nhttps://www.justice.gc.ca/eng/rp-pr/other-autre/wyntk.html\n>Warning\nA citizen's arrest is a very serious and potentially dangerous undertaking. Unlike a police officer, private citizens are neither tasked with the duty to preserve and maintain public peace, nor properly trained to apprehend suspected criminals. Exercise extreme caution when attempting to make a citizen's arrest.\n\nSociety still needs people that have the authority to lock up psychos.",
            "title_similarity": "0.8401853",
            "sentiment_compound": -0.9957
        },
        {
            "id": "gv167h7",
            "score": 1,
            "text": "There is a law, in many places, that provides for greater penalties for assaulting a police officer (whether or not they’re on duty). Why not a corresponding sanction for assault AS a police officer?",
            "title_similarity": "0.8458696",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gv16yjd",
            "score": 1,
            "text": "I agree. Police officers should be held to a higher standard than the rest of us. So should politicians, come to think of it.",
            "title_similarity": "0.6566467",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv18nsl",
            "score": 1,
            "text": "Obviously lots of people have pointed out why this isn’t a good idea, and pointed out the real problem isn’t Hal place or prosecuted but just that they aren’t. I saw similar thread a while back and I posted my take is; I believe that police officers should be prosecuted for their crimes just like anyone else except it should be treated like their second offense.￼ anytime someone commits a particular crime for the first time, they are given a bit of a benefit of a doubt. However if they do the same thing the second time around, it’s pretty clear they should’ve known better, they are aware it’s wrong, and there’s a bit of a pattern developing. \n\nIn the case of a police officer, they should be aware of what crimes are, what the potential punishments should be, and what could be done to avoid the situation. Thus prosecute them like a second offense., Even if it’s the first time they did it.￼",
            "title_similarity": "0.88148457",
            "sentiment_compound": -0.5187
        },
        {
            "id": "gv1aorw",
            "score": 1,
            "text": "As another commenter has mentioned, increases in sentencing consistently fail to deter crime. The real solution here is the thin blue line of silence, police officers are part of each other's in group and some feel above the law due to their position as a police officer.\n\nWe need to affecting police work in a way that effects the culture. I'm not sure of a good way to do this and honestly you're going against human nature in regards to how people act in positions of power and how we treat our ingroup. \n\nIncreasing sentencing for police officers would likely exacerbate these issues by making them feel attacked by the state and populace. Remember how police officers acted in washington when they were under pressure after they were criticized for applying different standards to the capitol hill protestors vs BLM? They stood on the podium huddle together in large group and said they did nothing wrong. If the state attempts to clamp down on police like this it will create a thicker blue line, which is the last thing we need.",
            "title_similarity": "0.84625214",
            "sentiment_compound": -0.2042
        },
        {
            "id": "gv1b06c",
            "score": 1,
            "text": ">which has a monopoly on the legitimate use of violence\n\nHuh? The state enjoys the same right to \"legitimate violence\" anyone has, namely self defense or defense of others. Cops may abuse their power, but that's not legitimate violence.\n\nThat also isn't the only \"legitimate\" use of violence. There's also things like sports competitions eg boxing, and in some cities, honest to god duels are legal (though with much heavier restrictions than the \"pistols at dawn\" stuff)",
            "title_similarity": "0.83570623",
            "sentiment_compound": 0.7042
        },
        {
            "id": "gv1b4bu",
            "score": 1,
            "text": "Not only \"on-duty\". Any law enforcement official. From beat cop all the way up to the govenors/pres who sign the bills into law the legislators pass.",
            "title_similarity": "0.56467885",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1b844",
            "score": 1,
            "text": "It isn’t exactly the “weight behind a crime” that makes something punished more harshly it is the danger inherent in the act that makes the crime more harshly punished.  In your example assault with a deadly weapon has a greater punishment than assault without one because there is a greater threat of death or serious bodily injury which is deemed to be worth protecting.  That being said, you could make a different argument that police officers should be punished more harshly, but a crime being punished based on the weight behind it is not generally the justification for sentencing guidelines.",
            "title_similarity": "0.88135266",
            "sentiment_compound": -0.9811
        },
        {
            "id": "gv1c07m",
            "score": 1,
            "text": "The punishment for a crime should be mostly static as it's meant to be. There just need to be extra charges for people who are able to use the position to facilitate commiting a crime. Things like dereliction of duty, abuse of agency/authority, disregard of established safe practices, etc..",
            "title_similarity": "0.85902494",
            "sentiment_compound": -0.9217
        },
        {
            "id": "gv1cdnd",
            "score": 1,
            "text": "Cops shouldn't have any business being involved in half of the shit they're used for. Then a mass shooter is posted up in a vegas hotel room unloading on a crowd and they just panic outside the door for 10 minutes. \n\nGive a community direct democracy, and the same amount of resources they throw at the current system i bet they come up with something better, and that should be an option for everybody.",
            "title_similarity": "0.6105565",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gv1f9vf",
            "score": 1,
            "text": "Every human is born equal. Noone should be punished harder or lesser than another. The problem only lies in the fact that most police officers are not prosecuted at all. And btw: punishment is never ok to begin with, the justice system should strive for prevention and resocialisation. Also privaze prisons are a crime against humanity.",
            "title_similarity": "0.79661375",
            "sentiment_compound": -0.8886
        },
        {
            "id": "gv1gaoo",
            "score": 1,
            "text": "I would say ALL crimes should be. Even more so for lower level crimes like cops that get caught framing people red handed because it's generally easier for them to get away with it... or at least use to be. With the prevelance of body cams I assume it makes it a bit harder.",
            "title_similarity": "0.82419926",
            "sentiment_compound": 0.3732
        },
        {
            "id": "gv1hk2r",
            "score": 1,
            "text": "There's no changing your view. You're just an idiot who lets Reddit think for you, seemingly convinced the Police go around killing people for fun...",
            "title_similarity": "0.6661495",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gv1ia34",
            "score": 1,
            "text": "Why the heck would this be logical. Are you saying that a police officer who accidentally breaks a bank robber's leg while tackling him should go to prison for 5 years?\n\nYou've forgotten the point of police officers amongst the BLM",
            "title_similarity": "0.5375583",
            "sentiment_compound": -0.765
        },
        {
            "id": "gv1j0yk",
            "score": 1,
            "text": "I believe that someone who knows the law (police, lawyers), that break the law should have strict sentences due to the fact they have higher knowledge of the law, and should be an example on how to obey it.",
            "title_similarity": "0.79725623",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gv1l0ps",
            "score": 1,
            "text": "I mean a solid comparison would be a crime in which an mma fighter vs or avergae person gets in a fight of self defence. The mma fighter will recieve a steeper penalty than the average person due to training and expertise. His hands are registered weapons. Cops are trained professionals",
            "title_similarity": "0.7480053",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gv1lykg",
            "score": 1,
            "text": "Simple solution, put them in GP with the other prisoners and let the situation sort itself.",
            "title_similarity": "0.4561175",
            "sentiment_compound": -0.25
        },
        {
            "id": "gv1n6fy",
            "score": 1,
            "text": "Hell yeah!",
            "title_similarity": "-0.021086546",
            "sentiment_compound": -0.5707
        },
        {
            "id": "gv1nly7",
            "score": 1,
            "text": "Maximum sentences for all.",
            "title_similarity": "0.18780616",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gv1nvh9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.113344245"
        },
        {
            "id": "gv1okme",
            "score": 1,
            "text": "I feel like it would be more statistically probably to accidentally commit a violent crime if your job includes activities that could lead to death by accident. \n\nIt’s like saying, should a trucker face higher consequences than a normal person for hitting a person?\n\nA trucker had a far higher chance to accidentally crash into someone than a normal driver due to their time on the road. \n\n—-\n\nNow that I think about it, I don’t see a lot of random videos where truckers accidentally crash into people.\n\nIf accidents caused by truckers are statistically lower than accidents caused by non truckers (for comparable numbers, like 100 truckers vs 100 non). Then I have no idea. \n\n—-\n\nIf we’re talking maliciously commited crimes and not accidents—then I feel the punishment should just be steep regardless of profession. Although I’ll argue that if you have commited a violent crime—you be prohibited from working in law enforcement",
            "title_similarity": "0.75508547",
            "sentiment_compound": -0.9859
        },
        {
            "id": "gv1tkp0",
            "score": 1,
            "text": "How about we just reach for same accountability. That would be a world of improvement.\n\nThe reason I say this is that they are HUMAN.  They bear the backing of the state but I don't expect them to near the sins of the state.  Only their own.  They should be held accountable to the same standards we are.  That is all I ask.  But hold the state to a higher level.  Because they are the true enemy.",
            "title_similarity": "0.7289305",
            "sentiment_compound": -0.6059
        },
        {
            "id": "gv1zbrw",
            "score": 1,
            "text": "It’s 2:30 am here and I’m too tired to read all of this so I’m just going to write this response based off the headline:\n\nI agree to a certain point. Obviously if an on duty police officer kills someone, they should be punished more harsh then if they where a civilian.\n\nBUT i think they should get off scot free if it was a clear act of self defense, because that’s how it is (atleast in America) where if you shoot someone and kill them but it was out of self defense, you probably won’t face many if any repercussions.",
            "title_similarity": "0.78460336",
            "sentiment_compound": -0.6482
        },
        {
            "id": "gv1zl7d",
            "score": 1,
            "text": "Shouldn't everyone be treated equally?\n\nIf you have classes of people with varying levels of legal and social protection it seperated them from the people.\n\nEqual rights should be equally applied to all.",
            "title_similarity": "0.5131972",
            "sentiment_compound": 0.128
        },
        {
            "id": "gv22efj",
            "score": 1,
            "text": "They should be punished more harshly compared to a citizen, or compared to the punishment for police officers as of right now (Paid vacation)?",
            "title_similarity": "0.80761296",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gv22qtm",
            "score": 1,
            "text": "I think they should be punished more harshly in general.",
            "title_similarity": "0.67983204",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gv24q8a",
            "score": 1,
            "text": "Putting aggression onto other people we see as more deserving of the aggression is not an effective solution to the problem of misplaced aggression.",
            "title_similarity": "0.69687426",
            "sentiment_compound": -0.896
        },
        {
            "id": "gv260ud",
            "score": 1,
            "text": "All that isn't really relevant if you don't get a real conviction at all in so many cases.",
            "title_similarity": "0.5090173",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv27rkz",
            "score": 1,
            "text": "The only thing that will solve the issue of policing is abolition. More policing and more prisons will not solve it, it will exasperate it.",
            "title_similarity": "0.70624644",
            "sentiment_compound": 0.0536
        },
        {
            "id": "gv29a04",
            "score": 1,
            "text": "How about let's start with \"At all?\" Lol wtf\nFor starters.....Jeesh...shootings a lil high there we barely see them charged AT ALL for fuckin murder in ppl",
            "title_similarity": "0.6175935",
            "sentiment_compound": -0.8191
        },
        {
            "id": "gv29tce",
            "score": 1,
            "text": "Police are the same as civilians with a yellow jacket on to make them feel special, you’ve been convicted that a police officer is some how above civilians.",
            "title_similarity": "0.6407133",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gv29ts6",
            "score": 1,
            "text": "violent criminals should just just be taken out. our prisons do not offer reform, its a rotating door. violent offenders continue to be violent regardless. just take them out. quit lying to yourselves that reform is a thing.",
            "title_similarity": "0.81297565",
            "sentiment_compound": -0.9694
        },
        {
            "id": "gv2izwa",
            "score": 1,
            "text": "Any crime committed by a cop at any time should be severely punished, but any crime committed by a cop while on duty, using his service weapon, or in any way using his position and authority to commit that crime should be treated the same way as a capital offense and receive the severest penalty allowed in the state.\n\nWhy? Because cops are given guns and authority.  They must be held to higher standards or they will abuse their power.",
            "title_similarity": "0.8821976",
            "sentiment_compound": -0.9781
        },
        {
            "id": "gv2mhar",
            "score": 1,
            "text": "The state does not order them to be unnecessarily violent.   \n\nAnd if it did their culpability could only be less as they would be following orders, which shifts some of the blame to their superiors.\n\nSo the implicit fact here is that they only wield state force when acting under orders and trained procedure. \n\nAnd the only extra power they wield is that their actions may be justified by law and mandate after the fact. \n\nThe same may occur for bodyguards, security staff and people defending their homes.  They may also get to say shoot someone and walk free if the law provides for it. \n\nBut any of them, if they go outside of the law, immediately lose that power and protection. \n\nAnd at that point we are all equal in the eyes of the law.  As are the punishments.  \n\nSo no.",
            "title_similarity": "0.8272305",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gv2mven",
            "score": 1,
            "text": "Yes. I don't know how anyone could argue otherwise. They are in a position of power, and have one of the highest levels of physical control over (and potential for injury to) other people that exists in any job.\n\nWith great power comes great responsibility (thanks, Uncle Ben), and that can only really be true if there are increased consequences. If you can't be surgically consistent in your emotions and procedures, you aren't cut out to be a cop, and that's ok. There are other jobs out there.\n\nI mean shit, cops are harder on truckers (and should be) because they drive an exponentially more dangerous vehicle that could wipe a whole row of cars off the road if the driver isn't perfect. Higher responsibilty for other people's safety always means tighter enforcement in every other job, why shouldn't it be the same for police?",
            "title_similarity": "0.7071253",
            "sentiment_compound": 0.8127
        },
        {
            "id": "gv2ozn2",
            "score": 1,
            "text": "I agree\n\nand so should police officers who refuse to tell about such actions of their fellow officers",
            "title_similarity": "0.6519092",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gv2s50f",
            "score": 1,
            "text": "The crime by itself should not be punished differently.\n\nHowever, it does have implications for their ability to work in the police force.",
            "title_similarity": "0.7357216",
            "sentiment_compound": 0.0721
        },
        {
            "id": "gv2usbc",
            "score": 1,
            "text": "I agree that police in general should be prosecuted more harshly for all crimes committed on duty. Nothing undermines the legitimacy of the police force like openly disregarding the laws they punish other people for breaking. Getting away with violent crimes even more so as we’ve seen with the escalations in response to police violence over the years.",
            "title_similarity": "0.8707342",
            "sentiment_compound": -0.83
        },
        {
            "id": "gv2vw8n",
            "score": 1,
            "text": "Agreed. Punished more severely and any settlements come directly out the the police pension.",
            "title_similarity": "0.75426096",
            "sentiment_compound": -0.6361
        },
        {
            "id": "gv2wffd",
            "score": 1,
            "text": "I personally feel like we punish violent crimes too harshly (assuming this is about the US) and the issue is not that some people get punished too lightly its that too many get punished to harshly. My main point being I think we should adopt a legal system that still has minimums but of like 5-7 years ( for violent crimes) then you re-evaluate the person on a case by case basis. Because the guy who got drunk and into a fight and kills someone is not as massive of a public safety threat (especially as they get older and wont be as aggressive or as strong) as a serial killer thus hopefully by the time they get out along with some Cognitive Behavior Therapy I think we could get majority of “violent offenders” out of prison. I know this doesn’t directly address what to do about if its a cop and I think your point is very intriguing but the continuation of trying to fix our problems with incarceration will lead us no where.\n\nEdit: grammar",
            "title_similarity": "0.84302825",
            "sentiment_compound": -0.9807
        },
        {
            "id": "gv2zwg5",
            "score": 1,
            "text": "OP you may not be aware of this...which is completely fine, but if this type of behavior can be proven, the majority of states have some type of official misconduct charge for state govt employees. If you’re found to use your position to commit an offense that would be considered an indictable crime, you could be charged with that indictable crime AND the associated official misconduct. It’s generally a 5 do 5 plus whatever else you’re convicted of. That’s huge. You could have committed an indictable crime that would get you a max of two years, and get hit with an extra 5 on top because of your position.\n\nPeople are going to respond “false, cause qualified immunity”. This is a knee jerk reaction, not one grounded in fact, but born of misconception. (That misconception is on the shoulders of law enforcement because they don’t explain reality to anyone not in law enforcement) Qualified immunity is only applied if the offense is found to not be intentional, involving an element of mens rea (the guilty mind). If that crime is not an accidental good faith accident, which happens, QI cannot be applied. \n\nFor example, chauvin.\n\nEdit: I should note that this “generally” applies more to corruption crimes but can definitely apply to violence depending on the situation.",
            "title_similarity": "0.6944258",
            "sentiment_compound": -0.9837
        },
        {
            "id": "gv3ekt8",
            "score": 1,
            "text": "If you are tasked with enforcing the law and you break the law, you *should* get a harsher sentence. Like that police officer who raped women on the job and got 250+ years in prison.",
            "title_similarity": "0.7277665",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gv7zd1v",
            "score": 1,
            "text": ">which has a monopoly on the legitimate use of violence\n\nThis is why every violent action by a police officer shouldn't be considered a crime, even if it would be for the average person. \n\nIf an average person pulls out a gun and shoots someone, that's murder. In the context of police, it is often justified. Additionally if there isn't a clear standard, no one will ever want to be police. That's not going to go well for your community.",
            "title_similarity": "0.8275149",
            "sentiment_compound": -0.9577
        },
        {
            "id": "gv8248f",
            "score": 1,
            "text": "If they're actually found guilty of assault or murder then yes, I don't have a problem with treating it as more serious in terms of jail time. However it's largely irrelevant as cops usually get off. And if you increased the punishment, it would only create more pressure to give them the benefit of the doubt that they were just trying to protect themselves or do their job.",
            "title_similarity": "0.8672757",
            "sentiment_compound": -0.8089
        }
    ]
}