{
    "CMV: It’s wrong of businesses to ask me to tip for counter service\nI’ll start by saying that I think tipping culture as a whole in the US sucks. Employee wages should not be subsidized with tips, employees should just but paid fair wages to begin with. \n\nI’ve noticed this trend over the last few years where food shops that only offer counter service have been asking for tips. Places like donut shops, frozen yogurt shops (this one really irks me because you get your food yourself), and coffee shops now ask for tips at the register. I’ve only noticed this at places that have fancy point of sale systems where there’s a touchscreen facing the customer and they sneak in a little tip screen at the end of the transaction. Tipping at the table at restaurants is one thing, but these places ask you to tip while the person you’re supposed to be tipping is watching you make your selection. It’s incredibly awkward.\n\nThe main issue I have with this is that at these places, the employee is providing me with a service for about a minute at the most. They grab my donuts, hand me my bag, then ring me up. Why are you asking for an extra $3 for 60 seconds worth of work? At least at sit down restaurants your server is helping you for a significant amount of time. They’re taking your order, bringing you drinks, providing a line of communication between you and the kitchen, bringing your food out, fixing any errors the kitchen made, all while you’re sitting down and having a good time with your family or friends. They provide you with an experience, and I have no issue with tipping at a restaurant like that. But I get none of that from the guy running the register at the froyo shop.\n\nWhy should I tip these people?": [
        {
            "id": "gv2qgy6",
            "score": 1,
            "text": "/u/jdbuck99 (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/mtzw0x/deltas_awarded_in_cmv_its_wrong_of_businesses_to/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.4873733",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gv334o2",
            "score": 42,
            "text": "You are aware that you can not leave a tip, right? \n\nIf you don't tip for table service, people will think you're an asshole, because you are.\n\nIf you don't tip for counter service, then literally nobody will care. As far as I'm aware (and tbf I could be wrong here), people who work the register are paid a full hourly wage. It's low, but it isn't the $2.50/hr or whatever that a table waiter makes. The tips are a bonus to what they make, not the core of what they make. Also, those tip jars don't even benefit the business, they go straight into the pockets of the workers - saying \"It's wrong of businesses to ask me to tip for counter service\" doesn't even make any sense because it's not the business that's asking, it's the workers.\n\n Do you think that service workers should be paid more? If not, do you think that somebody should have the option to pay service workers more if they want to? If you answered yes to either of those questions, then you don't actually agree with the view you want us to change.\n\nI'll say again that this is just my understanding of how it works. If I'm wrong here, then you should not change your view.",
            "title_similarity": "0.811246",
            "sentiment_compound": -0.5866
        },
        {
            "id": "gv2zk41",
            "score": 0,
            "text": "As someone who worked as counter staff, we put up with just as much bs as waitstaff. We have to interact directly with the cooks which is honestly even worse. We get yelled at for mistakes that we don’t make. And we run around multitasking just as much as a waitstaff. We don’t expect a 20% tip but if you have a $60 which we have to run around and find all the pieces for, $5 would be a nice thanks.",
            "title_similarity": "0.78050125",
            "sentiment_compound": 0.775
        },
        {
            "id": "gv2z39m",
            "score": 29,
            "text": "My income has been based off tipping for most of the last decade. The reason I’m fine with this practice is because there’s no limit to what I can make an hour. Some busy nights I can clear anywhere from 40 to 50 US dollars an hour. If you told me starting tomorrow that I’d be making a flat hourly rate of 18 or 19 dollars an hour I’d quit immediately.",
            "title_similarity": "0.58857834",
            "sentiment_compound": 0.296
        },
        {
            "id": "gv3fl6g",
            "score": 24,
            "text": "Tipping should be banned entirely. Your job is literally to serve me the coffee/donut, or to bring me food to the table. You don't tip supermarket cashiers and they smile and do their job just as fine Even more ridiculous are the tips for airport shuttle drivers or hair stylists. Why tipping for something they get paid to do? If your haircut costs $12 and you expect $3 in tips, say that your haircut is $15 and cut the BS.\n\nAnd if you pity about tipped employees, don't worry. Managers will find a way to staff their restaurants, what about paying livable wages?",
            "title_similarity": "0.8705904",
            "sentiment_compound": -0.5785
        },
        {
            "id": "gv36ocw",
            "score": 10,
            "text": "Tipping in general is a ridiculous concept.\n\nNo other industry demands for customers to pay bonuses for employees (that's what these payments are essentially, bonuses) so I don't see why the restaurant industry thinks they're special.\n\nI mostly only tip if it's mandatory due to being a posh place. If it's optional I rarely do so. Maybe if I'm in a poor country where the money is pittance to me but a lot to the locals, but if you're in a rich country there is no excuse to ask for more money. It's essentially double dipping",
            "title_similarity": "0.8092286",
            "sentiment_compound": 0.7627
        },
        {
            "id": "gv2yoln",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv2o878",
            "score": 201,
            "text": "I disagree in that I believe it is wrong to tip for regular restaurant service also. There are hundreds of different service workers that work very hard and yet we have been scammed into tipping a couple of them. Tipping makes the restaurant workers dependent on the guilt level of the customers rather than the owners supplying them with a steady, livable wage.",
            "title_similarity": "0.8409301",
            "sentiment_compound": -0.8173
        },
        {
            "id": "gv2yfwu",
            "score": 1,
            "text": "are they \"asking\" or just having a tip jar there? \n\nthat being said, if you order takeout from a restaurant you should still tip, at least a few bucks. if you dont, depending on how that restaurant does it, the server might end up actually losing money by serving you.",
            "title_similarity": "0.7577121",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gv39vnk",
            "score": -1,
            "text": "You're so generous. /s You care about the fact that the counter employees can't work the other tip-oriented jobs, obviously.\n\nSeriously, go work in the service industry. Maybe you'll change your sad view that way. No one cares about whether or not you think someone's trying to obligate you. You should feel obligated anyway if you've got a generous spirit. We're talking about a few bucks here, not 30%. That said, even counter employees will remember you for good or not. Want better service, the employees and business to stick around? Tip.",
            "title_similarity": "0.82002676",
            "sentiment_compound": 0.5551
        },
        {
            "id": "gv3jey5",
            "score": 5,
            "text": "First off, no one is \"sneaking in a tip screen.\" They are a part of the point of sale (POS) that many food service businesses use. \n\nAs for coffee shops, the barista literally makes a drink for you once you order it (assuming you are getting something other than drip coffee). I noticed that you didn't include bartenders in this \"not deserving of a tip\" categorization, and I believe baristas generally fit into the same category since they make drinks to order. Heck, people tip on draft pints all day, and those beers aren't even made by the bar like drip coffee is made by a cafe.\n\nAs for the concept that counter service in general isn't worth a tip, I'd argue that they'll do the same things for you as a table service waiter WITH LESS STAFF. The difference is that you have to go to them if you have an issue with your order. The counter agent is communicating your order to the kitchen, having it brought to the right table, getting your drinks for you (often), and resolving any issues you may have after your initial interaction. There's still plenty to get right/go wrong.\n\nThat's why you should still tip. Services are being rendered through a different method. Also, people are quick to complain about tipping at food establishments but I almost never hear any complaints about tipping for: moving services, car detailing, landscaping, hotel staff, or a number of other service jobs. And none of these people have extended interactions with you, they simply render a service.\n\nEdit: also, as a person that works at a place with one of these screens, I am absolutely not watching you tip or not tip. I am far too busy anxiously waiting for you to get on with your business so I can get on with mine. I have to grab all the shit you requested and move everyone else through the line before I start losing customers who feel they have waited too long. The feelings you are having about this screen asking if you would like to tip are entirely internal to you if I am on the other side of the counter. The tip is appreciated, but I serve at least 100 other people everyday and really can't be bothered to see who does and doesn't tip (unless a person sucks for other reasons).",
            "title_similarity": "0.810181",
            "sentiment_compound": 0.8818
        },
        {
            "id": "gv3b82z",
            "score": 3,
            "text": "Coffee shops are one place I will always tip, and totally understand why. Even though it’s just counter service, there’s a huge range of effort needed for different customers. For example, one person might go in and just order a black brewed coffee, maybe a cookie that’s already been prepared. Another employee could go in and order a half sweet vanilla latte with oat milk and whipped cream. Making a latte vs pouring a cup of coffee are vastly different, each latte is made with consideration and skill and that deserves more than minimum wage, in my opinion. You’ve also got people dealing with shitty or rude customers, a tight time crunch when there’s a rush, etc, and a tip seems fair for that.\n\nOne way I look at places like a coffee shop, they’re being paid minimum wage to be there. If they’re there all day with no customers, they’re still paid minimum wage. So why should they get paid the same amount for just standing around vs doing a lot of extra work and meeting extra expectations? I understand that it ideally should always be the establishment’s responsibility to pay fair wages (rather than the customers), but the problem is that, like with other tipped professions, that’s not happening, so tipping is the right move.\n\nFor things like coffee shops, food shops where they make it in front of me (think places like subway), etc., I tip. Anywhere that they are goi g above and beyond what they would still be paid for just by being open, I tip. \n\nIf it’s a front desk where they’re seated at a computer (answering phones, doing desk work/office work, etc) then I don’t think you need to tip, since me being there isn’t MORE work for them, just different work. \n\nIf it’s some kind of retail store where they’re making commission off of sales, then I don’t think you need to tip, since me being there may create more work, but they’re also being paid more than if I didn’t come in (due to commission).\n\nBut if they would have been just hanging out, enjoying each other’s company, tidying, studying, etc. without me coming in, and my being there means more work for them, then I tip. \n\nHope that makes sense?",
            "title_similarity": "0.76077163",
            "sentiment_compound": 0.9666
        },
        {
            "id": "gv3kax6",
            "score": 2,
            "text": "OP I just want to add, (I agree with you) you missed a very vital part that makes these digital tip jars the most offensive thing: they AUTOMATICALLY put a tip. You have to OPT OUT of giving a tip by changing it to \"No Tip\".  \n\n\nI find that offensive and ridiculous. How many people tip because they feel guilty or bad with the server watching them make their selection? How many people tip because they're just hitting \"next/next/next\" while checking out because there's a long line?",
            "title_similarity": "0.80334926",
            "sentiment_compound": -0.8738
        },
        {
            "id": "gv302vd",
            "score": 107,
            "text": "[removed]",
            "title_similarity": "0.113400035"
        },
        {
            "id": "gv35frb",
            "score": 9,
            "text": "so i’ve worked both as a server and behind a food counter and more often than not (unless possibly barista which i did for a very short while) people working counter service jobs end up doing waaay more work than waitressing and in my experience gets payed the same hourly wage (in America). what i always felt was unfair was that because waiters work directly with customers more often gets them more opportunity to get tipped. but all they are doing are chatting up customers, running the food, and every once in a while bust a table if the place doesn’t have a buster. very rarely as a waitress i had to deal with a shitty customer. but as a food counter worker i not only had to deal with very shitty customers on the daily, i had to prep cook, assemble food, take orders, clean, bust, all the while only making $1 tips with the most generous customers. i always felt since i was working both jobs that waitressing was a lot easier and felt it was ridiculous that just because i didn’t bring you your food that i wouldn’t get a bigger tip. sure going to grab froyo where you serve yourself is one thing. but if someone behind the counter is creating drinks or sandwiches or pizza or what have you i can almost guarantee they are getting the same hourly wage as servers without the added benefit of tips. it’s genuinely sucks and i’m glad i’ve transitioned out of food service. idk maybe i’ve just had bad luck in the places i have worked in (LA and brooklyn)",
            "title_similarity": "0.7677965",
            "sentiment_compound": 0.1623
        },
        {
            "id": "gv30p0g",
            "score": 0,
            "text": "Its not wrong for someone to ask you for something. You don't have to tip just hit the little button that says \"no tip\" at the bottom. \n\nI work at a place that uses these tablets. I get paid like $15/hr on top of tips so we definitely don't expect tips. Asking =/= demanding. These things aren't guilting you into tipping they're just there for people who want to. I personally want to give extra to people who make food for me because I appreciate the work they're doing \n\n\nAlso, I get the whole tipping at a sitting down restaurant but at the place I work I do a LOT more work than a server does (prep food, work grill, make food, ring up.) Q",
            "title_similarity": "0.78287995",
            "sentiment_compound": 0.6825
        },
        {
            "id": "gv31kfm",
            "score": 0,
            "text": "A lot of times I leave a tip at the counter if the person seems extra overwhelmed or tired that day or if the place is slammed. Other times if it’s just me picking up food I don’t leave a tip at the counter, but if they don’t ask or offer the option then you can’t decide for yourself. I think what you really want is to feel like you can click 0 or no tip without feeling any guilt. You can. The counter workers understand all this.",
            "title_similarity": "0.8171125",
            "sentiment_compound": 0.2395
        },
        {
            "id": "gv35t1n",
            "score": 0,
            "text": "I have a sliding-scale for tipping that depends on how much work someone has done to provide me with a service. If minimal work is done and I know the company pays minimum wage, I will either not tip at all (e.g. if an employee only pours me a cup of coffee), or up to 15% (e.g. if the employee makes me a latte). The more work they do for me, the higher the tip. \n\nI also think that sometimes a tip is requested at the end of the transaction but it isn't expected. For example, at a donut shop, if they're grabbing a donut and putting it in a bag, they can't expect people to tip for that, but at the same time, a larger order may actually warrant a tip, and that's why the screen asking for tips is there at all. \n\nIn summary, I do agree with you, but disagree that the expectation is there for everyone to tip at every transaction.",
            "title_similarity": "0.83291876",
            "sentiment_compound": -0.0387
        },
        {
            "id": "gv3a6r2",
            "score": 0,
            "text": "But then again, you should always tip the bar.",
            "title_similarity": "0.45446503",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3fh4e",
            "score": 0,
            "text": "I agree that removing tipping and just adjusting the price of things to pay workers more would be more efficient.  But it's a pedantic argument.  The average tip they receive is baked into the equation.  When you pay them or the restaurant pays them you're still losing that money.  Counter service is not expecting more than a dollar or two outside of the pandemic, so I really don't see the issue.  You're essentially saying you think they deserve to be paid more.  If you believe that, than it is not different than them upping the price of your latte and paying the employees more and the difference is pedantic.  If you believe they should be paid more, then you should tip while advocating elsewhere for a culture/policy change.  But it's not workers fault that our cultural norms are stupid, so they should still get tips to help supplement their shit pay.",
            "title_similarity": "0.8414316",
            "sentiment_compound": -0.8838
        },
        {
            "id": "gv3grku",
            "score": 0,
            "text": "I think it depends on the type of service and how you view it. This isn’t necessarily to *completely* change your mind, but give you another way of thinking about it. What if we considered some of the workers like private contractors? For instance, the restaurant is there to provide food, but the reservation staff is like a travel agent, they are separate from the food, but they make your experience better.\n\nObviously, this analogy could be better, but it does provide an alternative way of thinking about the problem, and I think it can change the way we go about it. I want what’s best for society and this problem is commonly talked about, but I have little experience with it. Some prefer being tipped, while others don’t. There are advantages and disadvantages to both systems and I personally think that because there are some advantages to tipping, there are acceptable reasons to have it, but we shouldn’t have it in situations where it isn’t advantageous",
            "title_similarity": "0.7428965",
            "sentiment_compound": 0.9715
        },
        {
            "id": "gv3jcuv",
            "score": 0,
            "text": "You’re right, fuck the poor.",
            "title_similarity": "0.29249924",
            "sentiment_compound": -0.765
        },
        {
            "id": "gv3jgo7",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv3m7ll",
            "score": 0,
            "text": "If you can tip you should. It increases the quality if life of the server. If you cannot then you shouldn’t, that way businesses can cater to people who may not otherwise be able/willing to afford their offerings.\n\nIt keeps business going and allows those who are able to do the right thing.\n\nIt goes without saying that the best case scenario has everyone paying and being able to pay a good living wage for services.",
            "title_similarity": "0.62189007",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gv3m959",
            "score": 0,
            "text": "Some places do not allow employees to accept tips, so customers are unsure if it is appropriate and will not tip. Having a tip jar or receipt line item allows customers to understand that tipping is acceptable. It's not overly intrusive if they have a jar or line item on the receipt, it's more of just an option that is available to you. If they verbally ask, that's a bit more intrusive because of the guilt trip aspect.",
            "title_similarity": "0.73773414",
            "sentiment_compound": -0.0335
        },
        {
            "id": "gv3ps59",
            "score": 0,
            "text": "I usually do but I do agree it's annoying having to tip for small things like that. But I've also noticed a lot of the employees will say \"and if you just fill out the tip screen\" or \"how much do you want to tip\" and then stand there and watch you so you feel obligated to tip 20% on a small item. I'll applaud them for realizing that asking people to tip means they're more likely to but I don't always feel it's necessary. \n\nEdit: I always tip when going to restaurants.",
            "title_similarity": "0.74357015",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gv3q4iw",
            "score": 0,
            "text": "Do you tip at a bar? There’s no difference",
            "title_similarity": "0.37649187",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv3qx5x",
            "score": 0,
            "text": "Name a business that asks you to tip.  Not talking about autograt.  Name a business that does this.  I have never ever seen a business asking for tips.  I've seen tip jars with silly illustrations but that isn't the same as asking you to tip.\n\nNo one who deserves a tip ever asks for one.  \n\nI tip at counters because I remember what it's like to work one.  I remember how shitty 20% of people are to customer service employees.\n\nNo one is saying you must tip.\n\nJust don't tip, but don't make your guilt anyone else's problem.\n\nJust don't do it....",
            "title_similarity": "0.79339164",
            "sentiment_compound": -0.8601
        },
        {
            "id": "gv3t2ng",
            "score": 0,
            "text": "To be clear, you’re upset about them *asking* for tips, and the example you’ve given is the software they use? Generally, that interface is more to blame than anything else, but you can just not tip. For reference, most point of sale (POS) devices ask that question in many services industries; for example, at retail stores, with products with extended warranties, will also always ask. Those systems are designed that way, and because people have the dichotomous attitude of simultaneously saying “you shouldn’t ask,” and feeling, “if I don’t tip, I’m the asshole.”\n\nIt’s advertising, like anything else. However, COVID has made things difficult. Tipping more at the counter now is more symbolic of your hope the restaurant and their staff stay in business. In either case, it’s 100% your choice.",
            "title_similarity": "0.78698677",
            "sentiment_compound": 0.5805
        },
        {
            "id": "gv3tgkp",
            "score": 0,
            "text": "Cheap ass",
            "title_similarity": "0.16252005",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gv3uqmj",
            "score": 0,
            "text": "They’re not asking you for a tip. They’re providing a place where one can tip if they’re so inclined. You can imagine that some people want to just leave their change as a tip and that having this occur frequently enough, the staff would decide to provide a receptacle for it. No one is asking you to tip they’re just providing the ability to do so to those who choose to do so. You’ll just have to ignore the jar and decline the screen without feeling guilty.",
            "title_similarity": "0.690573",
            "sentiment_compound": -0.0869
        },
        {
            "id": "gv418kv",
            "score": 0,
            "text": "I work at a popular coffee chain. I've been here a few years, so I make more than minimum wage... but the work is difficult. You say it only takes a minute to get your coffee/donuts. We're being graded on our times and getting your food to you fast is our selling point. But consider this... I work as order taker at the drivethrough. I worked a 9 hour shift yesterday and between 6 and noon I took the orders of over 450 cars. I take the order, type it in as I start to add ingredients and pass to the girl on my right. I put together sandwich bags for every hot food order and run across the store to get every donut and bakery item. I also stock as we use things, clean as much as I can between orders and we make sure to have you out of the drive through in less than 200 seconds from the time you pull up to the speaker. I work my butt off every shift. When you leave a dollar, I have to share it with 6 other people. I also have to claim all my tips so it reduces my paycheck in taxes.\n\nI've worked as a waitress before and had a lot of standing around time. The tips were better, but I didn't have to claim all of them back then. But I work way harder now and I think we really earn those tips. Thanks for those who tip us! It's mostly single moms at the shop and every bit helps!",
            "title_similarity": "0.69975543",
            "sentiment_compound": 0.9603
        },
        {
            "id": "gv48rzi",
            "score": 0,
            "text": ">Employee wages should not be subsidized with tips, employees should just but paid fair wages to begin with.\n\nwhat is fair? to me, fair is getting what you agreed to under the terms of a contract once you have fulfilled your obligations. if you agree to 800/hour then that is fair. if you agree to 2/hour then that too is fair.\n\nit is my opinion that waiters and waitresses, unlike the kitchen staff and others, are an employee of the customer not an employee of the restaurant. the contract is typically 15% gratuity for good service which is usually stated upfront on a desk, paper, or on the front door. if the service isn't good then something less than 15% is fair and if the service is above and beyond and the customer actually appreciates the additional service then it is highly recommended that the gratuity reflect the appreciation but nothing is obligatory beyond 15% in that case.\n\ni must agree with your sentiment otherwise. if you are not being waited upon then you have no obligation to tip and you should not feel guilty for paying for the food only. i never tip if i don't sit at a table or if the waiter/waitress is horrible.\n\nedit: tipping is very much like merit pay. that is the fairest kind of pay in my opinion.",
            "title_similarity": "0.79309815",
            "sentiment_compound": 0.993
        },
        {
            "id": "gv48y8u",
            "score": 0,
            "text": "You're disgusting. Do it one day.",
            "title_similarity": "0.38192463",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gv4bge5",
            "score": 0,
            "text": "From a waitress; we don't want a \"fair wage\" and dislike people championing for us to receive one.\nI average between 25-30 dollars an hour at an American restaurant, or about 1k per week, due to tips.\nIf we moved to a flat wage, I'd likely see that cut in half at the very least.\nHowever, I do agree that counter service does not warrant a tip, simply because I've worked in both environments.\nAs a full service waitress, I run my ass off for my tables, and put a decent amount of thought into the service.\nAs a counter girl when I was younger, I wanted people in and out ASAP.\nThere is a difference.",
            "title_similarity": "0.824824",
            "sentiment_compound": -0.6229
        },
        {
            "id": "gv55mld",
            "score": 0,
            "text": "Boomer. With a name like that it’s pretty obvious you’re a redneck. I’m sure you also don’t agree with some peoples “lifestyles” too huh?",
            "title_similarity": "0.608733",
            "sentiment_compound": 0.8591
        },
        {
            "id": "gv5992q",
            "score": 0,
            "text": "Go work a counter service job, you’ll change your own mind.",
            "title_similarity": "0.59678847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5xo6a",
            "score": 0,
            "text": "Depends how good the food is.",
            "title_similarity": "0.31829086",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gv30ulh",
            "score": 20,
            "text": "There is a particular niche situation which I think you should consider and that's shops which double as community hubs which are trying to promote a social good. Café's and places like that which are inclusive and encourage social gatherings while promoting a wide range of programs and services that'd be useful to their surrounding communities. Examples of the former would be open mic night, game nights, acting as a public forum to discuss laws/policy and examples of the latter would be promoting networking events for young professionals, and writing workshops.\n\nWhile you're certainly right that on a transactional level that each individual sale may not merit a tip based on that's sale's associated service, but tips are not just for that. They are a means for an individual who appreciates the business or the people serving within it on a level beyond the transactional. We apply that kind of thinking with charities because they're giving a reasonable attempt to promote a social good, so why not do that with businesses that are earnestly trying to do the same?",
            "title_similarity": "0.59709764",
            "sentiment_compound": 0.9822
        },
        {
            "id": "gv2ne0s",
            "score": -10,
            "text": "You should tip “these people” because wages need to be subsidized as you already know. If you don’t want to tip, then call your legislators and demand that people be paid a living wage for their work.\n\nOr\n\nMake yourself your own food.",
            "title_similarity": "0.7546974",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gv2ntu5",
            "score": 677,
            "text": "In the past, my view was that if the counter employees had to do a significant amount of extra work to get my order, then I would consider a tip. For example, if I ordered a regular coffee that just required pouring, no tip. If I order a more complex coffee drink (like the skim latte I ordered this morning on my walk), then I provide a tip.\n\nI also consider tipping to be an opportunity to redistribute a bit of wealth to people who don't get paid as well as I do. It's the only way that I can actually have a positive effect on what they make during the day, and I'm happy to do it if it's offered as an option, and if I feel that it's justified at all.\n\nI don't consider these hard and fast views, and I adjust them as circumstances require. For example...\n\nAt the moment, my philosophy is that people working the counter during a pandemic are doing me a service and providing me with something that I want.\n\nSome people will claim that they are being paid more than tipped employees and so don't deserve a tip. My view is that the pay that they receive is too low to justify dealing with the public when a highly contagious virus is still not under control.\n\nThey aren't necessarily able to work from home as I am. Therefore, because they're at greater risk doing their job, I have no problem tipping. I just picked up coffee 30 minutes ago and tipped 50% for exactly that reason.\n\nWhile I don't necessarily think that counter employees are justified in expecting a tip during normal times, we're not in normal times right now.",
            "title_similarity": "0.810459",
            "sentiment_compound": 0.9636
        },
        {
            "id": "gv300fx",
            "score": 10,
            "text": "Most of those places have had \"tip jars\" forever, and that it's never been expected or demanded to tip for counter service. \n\nIt's exactly what it sounds like - a tip - if you feel they're doing good service for you \\*and\\* you feel like it, leave a little extra. \n\nMany people don't carry cash anymore, so this gives people who are paying on their card the opportunity to leave a tip if they want to, but they don't have cash to put in the jar. \n\nThe workers aren't paid less because of it. They would be paid less as more people moved to digital currency if there wasn't a digital equivalent to the tip jar.",
            "title_similarity": "0.7522805",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gv35o1b",
            "score": -1,
            "text": "Lets say the average tip is 10% - maybe 15% and this donut costs you .... $1.00  that's  10 cents, or maybe 15. Or, maybe you buy 10 donuts, that tip is $1.00 or $1.50. Honestly, if you're one of the people that can afford to eat out, consider yourself lucky. The server probably doesn't even get half what goes into the cup anyway. \n\n&#x200B;\n\nThis reminds me of this time a kid took me and her dad out for dinner. She asked for the bill, because it was her treat. The bill was $90 for 3 of us to eat and she gave a $45 tip because (her words) \"I panicked! I didn't know what would be fair!\"  \n\nFair, imo is \\*kinda\\* standard 10 - 15%. \n\n&#x200B;\n\nIf you're bad at math, just think the total bill X .1 - everyone has a cell phone with a calculator. If you frequent the place and have a \"regular\" item you choose, before you go up to pay decide how much you want to or not.  It doesn't have to be awkward, if you don't have coins or change, you dont have change. \n\n&#x200B;\n\n\\- it's fine and hopefully the server will realize - you had the option of tipping OR not.",
            "title_similarity": "0.69307244",
            "sentiment_compound": 0.8395
        },
        {
            "id": "gv3xn0a",
            "score": 1,
            "text": "At my work we always have pizza day on the Thursday after the first Tuesday of the month.\n\nWell the pizza buyer had a meeting last time so I had to go pick up the pizza, $100 worth. When I signed the receipt I put down a $0 tip.\n\nI got back and he asked if I left a tip. I said no and he said \"I always give them $10\"\n\nLike why bro. You drive your car there, carry the pizza to your car, and drive back. They provide the service you paid for and nothing else. Save your money man.",
            "title_similarity": "0.72335374",
            "sentiment_compound": 0.171
        },
        {
            "id": "gv4abke",
            "score": 1,
            "text": "Our generation is almost completely devoid of normal social skills. \n\n> It’s incredibly awkward. \n\nNo it’s not. You press the no button. There’s no social norm associated with tipping over the counter labor. \n\nThere’s nothing awkward about rejecting someone’s request, when you fundamentally disagree with what they’re requesting, as it’s unreasonable. \n\nIf they said, “Hey, do you mind giving me your shirt? I need to blow my nose real quick”. Would it be awkward, rejecting their request? Of course not. It’s an unreasonable request, if anything it’s awkward that *they asked in the first place*. \n\nSo when they say, “Hey can you give me a tip, for doing exactly what you asked, with no additional service.” Just know that *they’re* being unreasonable, and say no.",
            "title_similarity": "0.68357813",
            "sentiment_compound": -0.8958
        },
        {
            "id": "gv5eyj6",
            "score": 1,
            "text": "I made a post with this exact issue. You detailed it much better than I did, hence why I removed my post: \n\nIt’s obnoxious. I’m already paying a gross amount for a coffee, yet you want to enlarge my bill? For what reason... because you need to do your job, that you’re paid for? Using a cash register and making coffee? \n\nWe have interacted for less than 1 minute, and you make a face when I express “just round it up” when you ask if I want to leave a tip... \n\nIt’s fucking rude. I don’t appreciate being forced to do anything. I don’t want to revisit your business. \n\nEspecially after you made a face when I left you 75 cents, on my expensive coffee tab... because I want to be nice. \n\nIt reeks of entitlement.",
            "title_similarity": "0.8478843",
            "sentiment_compound": -0.5473
        },
        {
            "id": "gv3n59y",
            "score": 7,
            "text": "I'm with you. My local coffee shop who I would love to support has a minimum suggested tip of $1.  On a coffee that's already $3.  33%?\n\nAlso when I first came to the US I was told to tip 12.5% for good service.  Now it's 20% or higher as standard even for counter service.  Or shitty service.  Even when the waiter sucks you still end up tipping.  \n\nJust pay them a proper wage.  I don't want to drink 5 beers and then do math based on how expensive my beer was.",
            "title_similarity": "0.7442695",
            "sentiment_compound": 0.4728
        },
        {
            "id": "gv3mc1i",
            "score": 18,
            "text": "I work in a boba shop, often alone. Yesterday in a rush I dealt with probably 20 people and their orders, all unique, in about half an hour. Right at the end of the rush, a group of about ten walks in and order 8 additional drinks. I man the register, make the drinks, and on top of that, have to manage making more tea, making more boba, getting more ice, restocking when I run out of something and making food. My boss came in to help out with the group of ten but my feeling is I absolutely bust my ass for people’s unique and sometimes complicated orders and without tips the job would not be worth doing on minimum wage.\n\nI absolutely agree that I should be payed higher by my boss, but when you walk into an already busy shop and then order an additional 8 drinks and don’t tip it sucks. I agree with others who have said the level of effort workers have to apply should be taken into account. \n\nMaybe I’m projecting, I don’t know, but there’s my argument haha\n\nEdit: Lots people are saying that people in all sorts of low income jobs bust their ass every single day and neither expect nor get tips. I'm fortunate to have a job in a changing market where tips are (unfortunately) becoming more and more commonplace. Yes, the system in the United States sucks big time. But this is how it is at the moment.\n\nI don't think I work harder than anyone else. I don't think I deserve tips more than others. I don't see how any of what I said was classist or racist, as one comment suggested. I worked in a university dining hall for two years, earned minimum wage, never got tips, and now realize I was doing work that would have earned me much, much more in a proper restaurant. The nature of customer service in the USA is exploitative, there's no getting around it.\n\nI appreciate all the feedback, definitely worth thinking about. I think the argument that \"I don't get tips in my job, where I do all the same work as you, and do it without tips, so why should you\" is somewhat flawed. \"I went to college and worked hard to pay off my loans, so why should you have your loans forgiven?\" I'm not trying to hurt or offend anyone. This is the most attention any of my comments has ever gotten and I appreciate the discussion.",
            "title_similarity": "0.71663034",
            "sentiment_compound": -0.3887
        },
        {
            "id": "gv3nkja",
            "score": 2,
            "text": "We have a place that does that around here. Great food but it's like you are the person cashing me out. You haven't even given me my food yet. What if I tip 20% do I get my lunch 20% faster? Probably not. It's dumb. \n\nI should never be asked to tip this way.\n\n If I tip at a counter service place, you earned it. \n\nTable service restaurants frustrate me because I know servers really don't get paid what they should so I always tip, but why can't we just pay people what we should so that tips can be something extra for doing a great job or going above and beyond.",
            "title_similarity": "0.85765564",
            "sentiment_compound": 0.909
        },
        {
            "id": "gv2pndq",
            "score": -2,
            "text": "I don't think hassling the regulators for better wages is right or will work. The business chose a tactic that optimises their profits. If they can usual social pressure to subsidize their staff's wages, that's cheap profit for them. So the answer would be don't shop at those places.\n\nThat said, with the increasing prevalence of monopolies (at least to my perception) tactics like this are becoming more widespread as customers lack any viable alternatives for their shopping / services. \n\nIt might be 'not cool' but to say it's wrong is to say it's wrong for companies to exploit social inclinations to increase the profitability of their business. Most companies in the modern market that are not engaging in such practices will have a harder time competing with those companies that are, it's simply more profitable to exploit human nature than attempt to change or mitigate it.\n\nSo morally is it wrong? No, it does not infringe upon anyone's rights.\n\nCommercially is it wrong? No, like basically everything commercial, it is tailored towards whatever generates the most profit from customers (because in subsidising wages you increase job satisfaction which allows for shortcomings elsewhere in the job, such as holiday pay).\n\nProfessionally is it wrong? Well people get paid for doing basically nothing all over the place. I've met programmers charge £30 an hour for jobs that a complete novice could do in an hour. I place responsibility on the customer to make their own choices and analyse the information available to them. Social pliability is not something we should be accommodating IMO, peer / social pressure can have some deadly consequences if not challenged and coming  face to face with it in a store actually prompts considerations like this post where people question social pressure and how it is used.",
            "title_similarity": "0.81639457",
            "sentiment_compound": 0.7377
        },
        {
            "id": "gv59ytn",
            "score": 3,
            "text": "Yep, America is dumb. Pay your people properly, idiots. It's not the customers job to pay people their wages.",
            "title_similarity": "0.74845946",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gv33rnt",
            "score": -4,
            "text": "counter SERVICE. Just tip if there's a tip line.",
            "title_similarity": "0.37830138",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv36z1v",
            "score": 3,
            "text": "Honestly I am not going to answer the question as a whole (I will leave that up to someone else) but I want to touch on the first part of your argument, that people like waiters shouldn't have  to rely on tips for money. Funny enough (I think it was in Britain) they got rid of tipping and just gave waiters more than minimum wage and the waiters went on strike because they were actually making more money with tipping than without tipping. My point being that most waiters end up earning more money day to day with tipping than without tipping while only earning something like 2.45$ a hour.",
            "title_similarity": "0.8034966",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gv3jbop",
            "score": 4,
            "text": "I worked at a pizzeria in a beach town that was located next to a bunch of bars and restaurants.\n\n\nThe owner was a sexist Bitch who only hired pretty girls and worked us unreasonably hard. Few kept jobs through the summer season and I knew too many girls who ended up dying of unrelated causes after working there. It’s weird to know that 3 coworkers are dead from that job- I’m relatively young and have not known other coworkers to die after leaving other jobs. \n\n\nThe pizzeria was open something like 11am-4am. The only time a counter server would make money would be the 10pm-6am shift. \nThe pizzeria would employ 2-3 employees at a time during the night shift, and the day shifts were just 2 people. \n\n\nThe cook was paid minimum wage, but counter servers were paid $2.09/hour. We were told that during shifts with few tips we would be compensated at minimum wage if our tips didn’t equal minimum wage. Our boss routinely lied and claimed we earned minimum wage via tips on those mid-day shifts between 11-6pm.\n\n\nI worked two jobs- I worked at a French restaurant as a cook during the day from 10am-2pm, 4:30-10pm. Then, I would go to the pizzeria at 10:15 (they were practically next to each other) and I would work until 6am. \n\n\nI would also work at the pizzeria on my days off from the French restaurant and I’d take the penniless 11am-6pm shift and would often opt to stay until 10pm just to squeeze a few tips into the day. \n\n\nI was responsible for reheating pizzas in an oven that was blazing in my small space to walk behind the counter. Burns were routine. If there were customers who wanted table service in the sit down area, I was also their waitress. I cleaned my working area, the sit down restaurant area (tables, floors, walls), bathrooms, and sidewalk area. I was responsible for to-go orders, and if business was slow, I was asked to give samples on the street. At night, we dealt with drunks after they came from the closing bars down the street. We routinely had lines down the block past our closing time but our boss insisted we keep serving food. We were consistently pressured to keep selling food past closing because the bars frequently over-served customers. Police preferred that we sell food to belligerent people instead of letting the sloppy messes roam the streets. We would often be asked to make extra pies to give to police, who would not tip, and we would be yelled at for food waste if the police didn’t pick up their pies. The longer the line of drunks, the longer I would have to stay and work until sometimes 6:30-7:00am. If it weren’t for the fact that I could walk 2 blocks home, I’m sure I would have died of sleeping while driving. \n\n\nIf customers asked why we had a tip jar I would tell them exactly why: I was being paid barely anything for hours and hours of work. Without tips, I could barely pay for college. Quite simply, without tips, I would be losing money working that pizzeria job. I couldn’t afford to *not* make minimum wage but had an employer who didn’t care to make sure we were being properly compensated. No, as an 18 year old, I didn’t have time to consult the Department of Labor. Customers would tip out of pity or laugh in our faces. \n\nJust because you don’t see the worker providing wha you deem “enough” services, doesn’t mean they aren’t providing those services. \nIf you were to visit the pizzeria at noon on a Tuesday, you wouldn’t know that the counter server makes $2.09/hour. It’s not like part of my job was to beg for tips. But the side of judgement with your purchase is not necessary. \n\n\nWhen you try to punish the system of tipping you’re just hurting vulnerable workers. If you hate tipping so much, put your money where your mouth is and fix the system. Refusing to tip is anti-worker, not pro-solution.",
            "title_similarity": "0.71440846",
            "sentiment_compound": -0.986
        },
        {
            "id": "gv3h2ds",
            "score": 6,
            "text": "Pre-pandemic, I never ever tipped for counter service. In addition to all the issues you mentioned, the main reason is that I don't know what kind of service I'm going to receive. If it's a deli for instance, I go in, order my sandwich at the counter, and when I pay the cash register system asks me to tip. At this point I don't know if I'll get my food in a reasonable amount of time, if I'll get what I ordered, if it will taste good, or anything else that you might take into account while tipping. All I know is that the person was nice and polite while taking my order, but I know literally nothing else about the service. What a dumb idea to ask me to tip at this point.\n\nBut since the pandemic I've started doing it, just out of recognition that I can afford it and I am lucky enough to work from home which service workers don't have the option of doing.\n\nI also agree with your broader point that I wish tipping wasn't a thing ever and that instead companies just paid their employees good wages.",
            "title_similarity": "0.8216026",
            "sentiment_compound": 0.9109
        },
        {
            "id": "gv3hcch",
            "score": 5,
            "text": "There's two aspects of Tipping.  Financial and social.  For the financial side of things, I'm almost in agreement with you.  People should not be reliant on tips for their income, but tips should be an enhancement.  In which most service type Jobs, Tips should be treated like bonuses. \n\nFor the social, Tipping is a sign of gratitude.  At Restaurants you tip based on how well you feel served.  Hair salons, based on your experience and how well you enjoy your new haircut. But it is more than the act.  You are thanking the person with financial means.  But in a covid world, financial means are dying for many, many businesses.  In my area, most business are either operating at a loss in hopes of sustaining till post vacinne or it is more of a hobby ownership, and not primary means of income.  In these cases, I tip, because I want the business to survive and I have a steady income (fortune 500 company  job).  \n\nBut lets examine the social aspect.  A tip is a means of thanks and gratitude.  Did you have questions for the barista?  Did they go above and beyond the \"take money hand goods.\" Baristas actually do a fantastic job for these things a lot of the times. Sometimes they do some foam art, or little drawings on names.  Or a casual conversation, to which I personally appreciate.  These things enhance and make my day, so in return I want to enhance and make their day.  Take the donuts shop.  At a lot of donut shops the register is also the one making the donuts, and are there for hours before anyone is buying donuts.  I can recognize this and give a tip saying, yeah your selling this donuts for $1, but i think you deserve more.  \n\nOr take the froyo shop.  I find often these jobs are being handled by high school or college students.  They are not making much.  I know I can afford to help them on their journey to independence, but not everyone can.  I also know it is better for the store to keep prices low and costs low, more people are willing to get froyo then.  Therefore I am lucky and able to tip, but a family of 4 who only have the flexibility to go out for major events, can take their son out to froyo for their birthday. \n\nTipping allows for more exchange of finances to more people, and people to pay what their wish, as opposed to what is asked.  Its the inverse of bartering.  In which more people are able to get the goods, because some are willing to pay more.   I personally wish non-mandated tipping was more common, so I can give the workers more money, and just pay the business the costs.  \n\nThat said, screw all included tips, service fees, and anything else that isn't already baked into the price of goods.",
            "title_similarity": "0.7512809",
            "sentiment_compound": 0.9967
        },
        {
            "id": "gv2nd39",
            "score": 1053,
            "text": "Just to be clear, you aren't against tipping in general but only think its wrong to ask/demand for tips for a job that isn't deserving of such?",
            "title_similarity": "0.6533002",
            "sentiment_compound": -0.5187
        },
        {
            "id": "gv35zrd",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv34std",
            "score": 13,
            "text": "Tipping should be renamed the international hospitality charity fund\n\nWorkers across the world on this industry are overworked and underpaid.",
            "title_similarity": "0.63925266",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gv30sfo",
            "score": 363,
            "text": "FYI, not sure if it will change your view or not. I worked, and know people who worked at the types of counter service jobs you're talking about.\n\nEvery time it was brought up, the primary reason for the jar was to give customers who wanted to tip an easy way to do so. Without the jar, the customers would need to ask if tipping is okay, who can they give it to, etc..\n\nBut with a jar there, if someone would like to tip it's easy (and not awkward) for them to do so. There was never a conversation like \"I can't believe they didn't tip!!\" In fact, most people didn't tip and that was fine.",
            "title_similarity": "0.75808764",
            "sentiment_compound": 0.8903
        },
        {
            "id": "gv2med5",
            "score": 45,
            "text": "Are you referring to tip jars? Or tip lines on receipts?",
            "title_similarity": "0.4335457",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv2n4ca",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.113400035"
        },
        {
            "id": "gv2o5zv",
            "score": 1,
            "text": "I don’t believe you should have to tip them for exactly the reasons above, but I will play devil’s advocate. Sometimes these counter service workers make the experience of buying whatever extremely smooth and fun. If they engage in polite conversation and seem genuinely happy to provide a service I will usually throw a couple bucks on the ticket. If the food/service I’m ordering is done in a way that is entertaining such as ice cream. I will almost always tip if the person is a kid(I remember the struggle of my first gig) so long as they aren’t completely useless.",
            "title_similarity": "0.7538706",
            "sentiment_compound": 0.9307
        },
        {
            "id": "gv2v5b9",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.113400035"
        },
        {
            "id": "gv2z214",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv323b1",
            "score": 1,
            "text": "I cannot speak for why they might do this after the pandemic has been dealt with however during the pandemic table service is pretty restricted (if not completely absent) and so servers who formerly relied on tips from service are suffering pretty badly.  This is one of those \"thousand points of light\" things that George Sr used to talk about, where we own some responsibility to help others who are trying to help themselves but need some help from those who are better off.  Think of it as a reward to those who are taking a risk of catching a disease to make sure that society still continues to function somewhat like it would in more normal times.\n\n&#x200B;\n\nEdit: ok I know I date my self by quoting George Sr.  LOL",
            "title_similarity": "0.7411361",
            "sentiment_compound": 0.978
        },
        {
            "id": "gv334fj",
            "score": 1,
            "text": "It's because in all of these places the managers wish that they could give more money. Or another way of putting it is that all of the people with these types of jobs serving you have no benefits and are usually part time, working two or three jobs at a low wage.\n\nI think American boomers kind of get off on it though I think their special sauce is knowing that the people serving them work multiple jobs with overtime and no benefits. Coffee wouldn't tase the same without the wage slavery is my guess.",
            "title_similarity": "0.82351065",
            "sentiment_compound": 0.5781
        },
        {
            "id": "gv35pte",
            "score": 1,
            "text": "Tipping culture give waiters a significantly high wage than any “fair wage” the business could afford. \n\nAlthough yeah, it’s fucking stupid to be expected to tip a cashier",
            "title_similarity": "0.64853585",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gv35xmg",
            "score": 1,
            "text": "I would agree with you, except for the situation with the pandemic.\n\nQuite a lot of service industry workers are hurting financially from shorter hours, fewer customers, and even being laid off from business closures. At least in my area, food places spent the last year or so only catering to takeouts (we've only just opened up to limited dine-in), meaning there's no dine-in tip income for the workers. I'm lucky to not be significantly impacted financially, so I leave a 10-15% tip to help them tide through these difficult times, especially for places I like (a few favorites closed down permanently, much to my dismay).",
            "title_similarity": "0.7971326",
            "sentiment_compound": 0.1832
        },
        {
            "id": "gv36bjb",
            "score": 1,
            "text": "Before those little Square checkout machines were everywhere there was always a little tip line on the receipts you got with a credit card transaction. It always made sense to me, after all why would they put in the time and money investment to make a cash register option not to add a tip line? Sometimes you just need a generalist machine. I see Square the same way. And whenever I’m at a place that uses Square they angle the touchscreen towards me so the cashier can’t see it. That seems less visible to them than the receipt on the counter was.",
            "title_similarity": "0.77414656",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gv375gh",
            "score": 1,
            "text": "Because these people work their asses off and get paid shit. Your paying the people not the business when you tip. You don’t have to tip but your showing appreciation for these people providing you a service.",
            "title_similarity": "0.62512606",
            "sentiment_compound": 0.4854
        },
        {
            "id": "gv37fuk",
            "score": 1,
            "text": "Tipping ties employees wages to inflation. Unless a minimum wage law is passed that ties increases to inflation, tipping will always result in better pay.",
            "title_similarity": "0.5737825",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv37sym",
            "score": 1,
            "text": "If it’s just a counter service then the tipping is not expected. It’s just a way for you to give appreciation (I always do a dollar or so, but if I can tell they’re really busy and understaffed I’ll always go 20%). The ones on the computer are just a way for people to tip without cash. Like when I worked at sonic people always asked how they could tip with their cards, but there wasn’t a way so they would feel bad bc they wanted to tip me. But counter service/ fast food places don’t really care that much if you don’t tip. My friend worked at a counter service place and literally never cared if she got tipped. She thought it was nice if she did, but she didn’t think twice if she didn’t.",
            "title_similarity": "0.7801199",
            "sentiment_compound": 0.668
        },
        {
            "id": "gv38101",
            "score": 1,
            "text": "This would make for a great Curb Your Enthusiasm episode",
            "title_similarity": "0.22166559",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gv385ms",
            "score": 1,
            "text": "I would agree, except everywhere I worked with tips had tip sharing where the wait staff would divide a portion of it to the back (kitchen, bussing, and dishwashing); I think cooks and other service staff should have the same incentives as wait staff to put up with days and hours that are extremely busy.\n\nThis goes for coffee shops and donuts, too, because generally the people taking orders also make the food and need some competence and experience.",
            "title_similarity": "0.790209",
            "sentiment_compound": 0.765
        },
        {
            "id": "gv38g20",
            "score": 1,
            "text": "If it's a small local business, the people working the counter might also be the small business owner or family and tips might be a significant part of what allows them to stay in business through the pandemic.  \n\nAt my favorite local brewery I was generally tipping at least $20 every time I filled up my growlers since they are personal friends and I wasn't able to spend as much time there over the pandemic, and my favorite hole-in-the-wall restaurants get $10 or 30% every order, whichever is more.  I know that those tips were going straight into the business owners' pockets since the people taking my order are the business owners, but I wanted to do whatever I could to make sure my favorite businesses stay afloat.  \n\nNow that the pandemic seems to be winding down, I'll stop tipping quite so much, but I'll always still tip because even for counter service, because I can afford to and I remember what it was like to work in a shitty (IMO), thankless job where I had to deal with the public on a daily basis.",
            "title_similarity": "0.7241235",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gv38h07",
            "score": 1,
            "text": "Out of curiosity, how do you feel about tipping Uber drivers or taxi drivers?",
            "title_similarity": "0.5462477",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv39baw",
            "score": 1,
            "text": "I agree. It’s just awkward and completely unnecessary. It’s probably just a way for the business to get more money, I guess. I doubt the employees see those “tips”.",
            "title_similarity": "0.7118413",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gv39xu6",
            "score": 1,
            "text": "My local beer store has a tip jar. Like, you go find the beer you want on the shelf, carry it to the register yourself, then wait for the person working to ring you up.\n\nNo fucking way that is a job that should be asking for tips.",
            "title_similarity": "0.7473168",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gv3a4mv",
            "score": 1,
            "text": "Hear here!",
            "title_similarity": "-0.096042424",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3ao9z",
            "score": 1,
            "text": "I usually don't tip them since unlike servers, they make an actual normal hourly wage.",
            "title_similarity": "0.5379579",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3av5c",
            "score": 1,
            "text": "I worked service for years - where people deserve tips - and this pisses me off. 18%tip for you to hand me a croissant and a coffee in 1 min? You’ve gotta be fuckin kidding me\n\nWages should be higher",
            "title_similarity": "0.77542096",
            "sentiment_compound": 0.2831
        },
        {
            "id": "gv3bph1",
            "score": 1,
            "text": "Everyone should be paid a fair wage and a tip can be given when outstanding service is provided.",
            "title_similarity": "0.39616027",
            "sentiment_compound": 0.743
        },
        {
            "id": "gv3bw7y",
            "score": 1,
            "text": "We do a lot more than just counter service where I work, imagine a restaurant but we are doing art instead with our customers....and we often get tips offered. Especially with the trend of what OP is talking about. \n\nI've been tempted to put out a tip jar or add that line on the credit card slips. I know staff wants me to, but I feel icky about it.",
            "title_similarity": "0.7654977",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gv3cdp9",
            "score": 1,
            "text": "You should tip if you want to. That's it.\nThe problem with tipping is not the employers, but the employees. They accept those unfair underpaid jobs, which anyone can do. That means if you leave, someone else will take the job, even if told how bad it is. Employers won't change those policies if they help cut expenses and there are no downsides. It would take a collective effort of society to change that.",
            "title_similarity": "0.76271456",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gv3djg9",
            "score": 1,
            "text": "I *never* tipped for counter service before the pandemic. Now I always do.\n\nOnce the pandemic is over, I will likely go back to declining the tip.",
            "title_similarity": "0.6313644",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3e6ag",
            "score": 1,
            "text": "I'm not a fan of tipping bit if I pay cash I'll often leave the coins. Call it a tip if you will but I do it because I've had more than one cashier pull from that jar so I didn't have to take say 95 cents in change. I've also talked to some workers who use square and just went with the default setting so they don't expect a tip the option is just there and it's not worth removing. \n\nWhile I hate tipping I get better service sometimes from small shops with only a counter. Hell when I'm with my kid it's fair to say some go above and beyond in a way I'd consider an experience. I also sometimes go to walkup taquerias and the patience some show in allowing people to practice their broken Spanish is probably more tip worthy than many waitstaff who just take your order and drop off food",
            "title_similarity": "0.8269317",
            "sentiment_compound": -0.8993
        },
        {
            "id": "gv3f4a3",
            "score": 1,
            "text": "You shouldn’t be asked to tip, sure. But you should tip if asked.\n\nIf they are asking for tips, that’s how the owner justifies paying them less than minimum wage.",
            "title_similarity": "0.7294323",
            "sentiment_compound": 0.1655
        },
        {
            "id": "gv3f6rl",
            "score": 2,
            "text": "This isn’t specifically logic or fact based - only the way I think about it. \n\nI like to think that my ability to choose where I tip matters. Places that are corporate that I frequent, I try and find info online about pay rate and all that. Most of the places you’re talking about have at least minimum wage base pay (not the serving min of $2.13). For something like a coffee, even though the job looks easy, it takes a specialized skill that someone spent hours of their life learning that I am now benefitting from. I’ll throw them the change because I respect the craft of what they’re doing. \n\nBut, in the cases where it’s not corporate, I really like to frequent the same small eateries and I enjoy tipping them. For example, one small bakery by my job is owned by an older (50’s or 60’s) couple. They serve the most delicious kolaches (a Czech pastry popular at all donut shops in Texas). They serve an Asian/Czech fusion of these pastries and take care to source great ingredients and produce an incredible and consistent product. A product that is - in my opinion - undervalued. They sell their product at a competitive rate to the rest of the market but actually handmade their product. When it’s the owners in there always working and I know the money is going to support something I want to see staying around, I am happy to give. \n\nI think it’s just capitalism. I’m not an economist or anything but it makes me feel like I’m casting my vote for the type of world I want to participate in. \n\nNow all of that being said, even if it’s a corporate spot - I empathize with the frustration of working in the service industry. I don’t mind throwing my change in a jar but do feel the automatic tip buttons on POS (point of sale) systems have become increasingly intrusive. This sucks for me because it’s mostly smaller businesses with these products. \n\nLike I said, if it’s a craft or skill someone learned, I’ll still hit the 10-15% button. But the guy watching me fill up my cup at yogurtland? Come on, no way.\n\nEdit: for clarity",
            "title_similarity": "0.7543397",
            "sentiment_compound": 0.9935
        },
        {
            "id": "gv3flov",
            "score": 1,
            "text": "It's wrong of the government to force me to pay for services I don't want. At prices I don't want to pay. So I agree with you",
            "title_similarity": "0.70574766",
            "sentiment_compound": -0.2191
        },
        {
            "id": "gv3g557",
            "score": 1,
            "text": "I agree. I don’t think tipping should be a thing at all. It’s a scam.",
            "title_similarity": "0.45159543",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv3gv5d",
            "score": 1,
            "text": "Even better, there is a drive through Mexican food chain in my town that hands you a tablet to finish your payment with the tip request on the screen. I'm sorry, I'm not tipping in a drive through without something extraordinary happening. It made me so uncomfortable to click no tip with the drive through person staring at me that I've stopped going there.",
            "title_similarity": "0.81295776",
            "sentiment_compound": -0.5949
        },
        {
            "id": "gv3h0z9",
            "score": 1,
            "text": "Waiters/tresses should be given a fair living wage. It shouldn’t be the customers responsibility to tip so they can make a fair living. Tips should be based on quality of service",
            "title_similarity": "0.636188",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gv3hp9j",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv3hsz6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv3j2qz",
            "score": 1,
            "text": "I worked at an older building that still used elevator operators. When I started working there (80's) they did their job with no fanfare, by the time I left (02) they expected a tip each time they pressed a button which may have been why so many people were using the stairs.",
            "title_similarity": "0.6629968",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv3j6xt",
            "score": 1,
            "text": "They're just asking, there is nothing wrong with that. If you don't think tipping them is worth it, then don't.",
            "title_similarity": "0.4416464",
            "sentiment_compound": 0.5352
        },
        {
            "id": "gv3jecd",
            "score": 1,
            "text": "I'm a bartender who uses one of those square systems on an ipod. None of those tips actually go to the person at the counter, they usually get pooled into a gratuity that basically tips everyone a fraction of your tip. My advice? Don't tip on the screen and just hand cash. Too many unethical managers have sticky fingers",
            "title_similarity": "0.7285495",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gv3jobw",
            "score": 1,
            "text": "When I worked at a coffee place back in the day it wasn’t up to us. The tip jar was part of the official system and we were all expected to divide it evenly amongst ourselves at the end of the night, even if we weren’t working on the register at all.\n\nI would guess companies encourage this for the same reason sit down restaurants do, so the employees can feel better about their crappy pay without having to actually give them more of their money.",
            "title_similarity": "0.8407596",
            "sentiment_compound": 0.296
        },
        {
            "id": "gv3kqwo",
            "score": 1,
            "text": "Because these people need tips to live. If that’s a problem then vote for people who will raise the minimum wage",
            "title_similarity": "0.55392194",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gv3lj2r",
            "score": 1,
            "text": "Tips are stupid and worthless. I don’t tip. I used to be a pizza driver and I still didn’t tip. Pay people what the should be paid and stop relying on customers to pay your workers fuckin wages. Jesus Christ. Do I need to pay for the fucking produce next?",
            "title_similarity": "0.8462788",
            "sentiment_compound": -0.8658
        },
        {
            "id": "gv3mypj",
            "score": 1,
            "text": "Correct me if I'm wrong, but it's perfectly culturally acceptable not to tip at a counter serve place. The reason those POS systems ask you these days is because no one carries around cash for tip jars anymore so if you feel like tipping (which you are not obligated to unlike a sit-down restaurant) you can just hit a button to do it from your card.",
            "title_similarity": "0.7606634",
            "sentiment_compound": 0.8462
        },
        {
            "id": "gv3n10w",
            "score": 1,
            "text": "Feels too awkward to say no? Saying no isnt hard with practice",
            "title_similarity": "0.3853168",
            "sentiment_compound": -0.4623
        },
        {
            "id": "gv3ngak",
            "score": 1,
            "text": "The touch screen systems r\nTake a chunk of all fees used. Ie square.\n\nThey take a part of the tip as well. They know you are more pressured to tip, at the very least tip with their system instead of cash. It's a big added revenue",
            "title_similarity": "0.6148758",
            "sentiment_compound": -0.024
        },
        {
            "id": "gv3nyh0",
            "score": 1,
            "text": "Waiters make $2.13/hr + tips. \nPizza delivery driver make about minimum wage + tips.\n\nSource: worked both for a good while.",
            "title_similarity": "0.6169932",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gv3o3ai",
            "score": 1,
            "text": "I work at a counter service icecream shop with a tipping option on the register. It is my view that tipping is a nice thing to do, if I’ve had to spend more than 5 minutes with you. Waiting on you to decide with a growing line behind you, asking for samples of several flavors, want me to hand pack several pints or quarts for you, large to go orders. It depends on the type of customer you are. If you are quick and easy, sure tips are always nice but I don’t think you “should be” tipping me. If I just spent 15 minutes hand scooping a gallon of icecream for your to go order of 4 quarts, I’m expecting a tip.",
            "title_similarity": "0.7297353",
            "sentiment_compound": 0.9062
        },
        {
            "id": "gv3o9j5",
            "score": 1,
            "text": "Because you’ll end up making minimum wage if the tips don’t make up for it. And in some restaurants you can end up making a good living.",
            "title_similarity": "0.59235036",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gv3okrb",
            "score": 1,
            "text": "I went to buy a pack of cigarettes at a gas station,  the debit machine asked if I wanted to leave a tip. Seriously wtf...",
            "title_similarity": "0.59861517",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gv3ovkh",
            "score": 1,
            "text": "If they are super nice and hook me up I'll always tip like a dollar, can't put a price on a good mood.",
            "title_similarity": "0.60568595",
            "sentiment_compound": 0.9022
        },
        {
            "id": "gv3ox8x",
            "score": 1,
            "text": "I was a server a few years ago. I can’t attest for other people but I know for a fact that I made a lot of money as a server. Including  what my employer paid me, I averaged about $20-$40/hour. I know a lot of servers who make $60k-80k/ year. I’m sure people who work at fine dining make more than that. It’s a really good gig. \n\nLet’s just be honest, a lot of servers wouldn’t want a $12-$15 hourly wage. They’ll lose a shitton of money. I wouldn’t even think about being a server if I got paid that little since I have to deal with a lot of entitled people. $15/hr to be someone’s bitch throughout their dining? Hell no.\n\nThat being said, I fucking hate the tipping industry. It’s really shitty for people to say ‘don’t eat out of you can’t afford to tip’. Well maybe I’m not here to live and bask in your outstanding serving skills? Maybe I’m here to just eat my food since I don’t want it getting cold by the time I get home. And tattoo artists!! Holy hell! You make $150+/hr and still feel that customers should pay you a 20% tip? Why?!? Because you did a good job? But that’s literally why you charge more than a hundred dollars an hour. Would tattoo artists prefer to NOT get the business of the customer because they don’t want to tip?",
            "title_similarity": "0.64287806",
            "sentiment_compound": -0.8812
        },
        {
            "id": "gv3oyq0",
            "score": 1,
            "text": "I own a taco shop. The register prompts for a tip because customers requested the option. We don't expect tips, but after being asked about it for a few months we decided to make it an option. Something to consider. Maybe they're asking for them, maybe it's there because customers wanted to be able to tip. My employees start at $10/hr.",
            "title_similarity": "0.75914717",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3qnp4",
            "score": 1,
            "text": "One time I was paying cash at one of these places and I said \"keep the change.\" The worker replied \"we aren't allowed to take tips.\" .... But then why when I pay with a credit card does it ask for a tip?? I guess it's just a bonus for the owner.",
            "title_similarity": "0.7597501",
            "sentiment_compound": 0.8364
        },
        {
            "id": "gv3t3tu",
            "score": 1,
            "text": "I 100% agree. I worked at a pizza place every receipt had tip on it because of deliverys. Some people asked what should I tip on take out. I always said 0. I was just handing them a pizza no need for tip.",
            "title_similarity": "0.7053769",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gv3tjo7",
            "score": 1,
            "text": "There's a local mom and pop Japanese restaurant near my house. They're the only restaurant I found within a reasonable distance to serve good home cooked Japanese food like your mom would make.\n\nI tend to order from them for pickup or for something special that was pre-made that day. Yes well I'm not getting a full service like I would have to sit down I still leave a large tip because I want this business to stay open. Especially now with covid I know business ishurting and anything I can do to help to keep them open I'll do. \n\nI believe you do have a point with a larger chain restaurants where employees are paid shit wages while the corporations see huge profits. IMO I normally don't tip here. I will make an exception for employees that go out of their way to make the experience nice. Also if they recognize me as a return customer (most likely due to the fact I leave a tip).",
            "title_similarity": "0.72662246",
            "sentiment_compound": 0.9607
        },
        {
            "id": "gv3u1u1",
            "score": 1,
            "text": "I make direct eye contact when I hit the no tip button at Jersey Mike's",
            "title_similarity": "0.36562523",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv3u1xi",
            "score": 1,
            "text": "there is such a thing as tipping wages in florida, for some fucking reason, and they're lower than standard",
            "title_similarity": "0.507449",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv3u3r8",
            "score": 1,
            "text": "Too be honest OP I don't really know what makes you think you're in any position to decide weather it's \"okay' for a business to ask for tips\n.. because you're not served enough? Counter jobs can still be incredibly demanding, more than likely understaffed. Most if them also don't supply a living wage. The tip thing isn't like uwu pay yst more just cause. Im sorry but the sentiment that some services 'deserve' tips is usually perpetuated and debated by people who have no idea what they're talking about and can't distinguish humans that are emoleyed from vending machines. Just don't tip if you don't want to. Nobody expects anything from you. Plenty can't even afford to tip. But this kinda questions and debate is just soo...silly.",
            "title_similarity": "0.7940893",
            "sentiment_compound": -0.3992
        },
        {
            "id": "gv3uecv",
            "score": 1,
            "text": "No.",
            "title_similarity": "0.01452451",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3ulem",
            "score": 1,
            "text": "Options to tip have popped up EVERYWHERE. I have an option to tip at my local craft beer store when I go in to pick up cans not even sit at the bar. There was an option to tip at a place I went and bought kombucha. It’s fucking ridiculous. I feel rude not tipping if there’s a tip line but this just seems abusive.",
            "title_similarity": "0.83244854",
            "sentiment_compound": -0.8656
        },
        {
            "id": "gv3v7iu",
            "score": 1,
            "text": "Dude... I felt the same way. I was at a bar once and just ordered a beer without an open tab and the bartender shouted at me over not tipping....",
            "title_similarity": "0.67031133",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3vj22",
            "score": 1,
            "text": "Reddit people are cheap motherfuckers, Keep the change.....fuck",
            "title_similarity": "0.5395462",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3vvnj",
            "score": 1,
            "text": "Cashiers ≠ waiters and therefore are not receiving waiters wages and therefore do not need tips to compensate. Not changing your view though, I believe you’re right",
            "title_similarity": "0.66431934",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv3vy1i",
            "score": 1,
            "text": "Its wrong of business to underpay their employees but if you go to an establishment where they do and you refuse to tip that makes you... also a prick",
            "title_similarity": "0.73152256",
            "sentiment_compound": -0.7876
        },
        {
            "id": "gv3w8a9",
            "score": 1,
            "text": "I'd also like to note that some modern payment services don't allow vendors to turn off the option to ask for tips. For example a local bakery has to put up a note saying \"we do not expect tips\" because Square, one of the largest merchant payment services, doesn't allow you to turn off asking for tips at all. \n\nI've never seen anything more than a tip jar with a note on over the counter service before ipads came along.",
            "title_similarity": "0.7799757",
            "sentiment_compound": 0.0433
        },
        {
            "id": "gv3wd4h",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14687821"
        },
        {
            "id": "gv3wsyn",
            "score": 1,
            "text": "As long as you tip servers >18% and bartenders >20% the guild is pleased.\n\nReal talk through: tipping isn't going anywhere as long as the politics in this country are run by big business and banking lobbies. It sucks that we make $2.14/hr and have to rely on voluntary contributions to pay our bills: but it's like that, and that's the way it is.",
            "title_similarity": "0.7242353",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gv3x9jm",
            "score": 1,
            "text": "Cooks, dishwashers, and sometimes busboys don't get tipped, and the servers get tipped. Guess who works harder in an area that's hot and sweaty? The fucking cook. Guess who works hard to clean shit up and do a lot of heavy lifting? The fucking busboy. Who works hard cleaning the dishes and utensils, risking cuts and injuries from sharp utensils and broken glass? The fucking dishwasher.\n\nAnd the servers usually make more than a cook does during a shift for fairly easy work. This is not a fair system. That's why tipping shouldn't be a thing in any culture, period.\n\nSource: was a longtime food service worker, and I was usually the grunt that did the bussing and dishes, along with a bit of cooking/prep. It always made me so angry watching the servers counting out huge wads of cash for doing pussy work, while the rest of us got paid in peanuts.\n\nThe servers would purposely rub our faces in it by counting the tip cash in front of us, smiling and laughing. They also made the workplace toxic by gossiping and turning the staff against one another.",
            "title_similarity": "0.782495",
            "sentiment_compound": -0.8044
        },
        {
            "id": "gv3xcvi",
            "score": 1,
            "text": "Cuz they have to deal with you and people like you all day.",
            "title_similarity": "0.37543118",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv3xxrq",
            "score": 1,
            "text": "One restaurant that I order pickup from has now included a 15% gratuity in their app that you have to manually edit, but it won’t let you put 0. So I either leave a small tip or put 1 cent and look like a jackass.",
            "title_similarity": "0.772627",
            "sentiment_compound": -0.2836
        },
        {
            "id": "gv3yrle",
            "score": 1,
            "text": "I'm with you on this.  I hate the pressure of being asked to tip when standing at the counter.  If I'm ordering a slice of pizza and they call my name when it's ready and I pick it up at the counter, you're not getting a tip.  There's one taco place I go to that always has a long line of people and they ask you at the counter, out loud, for all to hear \"Would you like to leave 15, 18, or 20% tip\" and you pick up the food at the counter when they call your name and throw your own trash away.  It's so obnoxious.",
            "title_similarity": "0.8086558",
            "sentiment_compound": -0.7155
        },
        {
            "id": "gv3ywka",
            "score": 1,
            "text": "Hey I agree with you but just want to provide some personal example for you. \n\nIn my city the cost of living requires roughly a 14 to 15 $ wage. Unfortunately as a lot of the state is rural and republican as opposed to my city minimum wage is 7.25$. \n\nMy partner works at a bakery/ coffee shop that only pays minimum wage. Most retail and food jobs are like that here sadly. But because it's a tourist city and there is a lot of wealthy homeowners people in the customer service industry have to have these tips to love. With tips my partner wages roughly end up being $12 to $14 an hour. \n\nSo as said i do agree and think it's wrong but I would say never  blame the workers. If they could be paid more and not have to relay on tops most would.",
            "title_similarity": "0.7416649",
            "sentiment_compound": 0.9301
        },
        {
            "id": "gv3zny4",
            "score": 1,
            "text": "I don't feel guilty about not tipping at Subway, Starbucks (I order a plain coffee, black) or the like. I'm using my resources to patronize their establishment, if anything they should be tipping me. \n\nI tip my Lyft / Uber / Delivery $2 by default, if the person goes above and beyond (getting out of the car to assist with bags etc) I throw in an extra buck. \n\nOtherwise I usually carry cash, and if pressed to tip I just say it's my wife's money and ask for a receipt that I throw in the trash.",
            "title_similarity": "0.7631144",
            "sentiment_compound": 0.5903
        },
        {
            "id": "gv40e1i",
            "score": 2,
            "text": "I dont have a problem with tipping anybody. I agree that tips should not be forced onto the customer and businesses should be paying their employees a living wage. But, there is one instance in particular where exactly what you're talking about is useful for me.\n\nI regularly go to a vape shop in my area. It's a little cornerstone with devices behind the counter and bottles of vaoe juice on the shelves behind you. Very simplistic, and the employees don't do very much to get you your product. They have a POS system that's basically an iPad on a swivel that that the end of the transaction asks of you want to tip, and gives you suggested percentages.\n\nNow, I ALWAYS tip these people. The reason isn't because I am forced to. It's because every single time I go into this location, they have been some of the friendliest and nicest people that have ever served me. Once, I went in on my lunch break and stood in there talking to the owner of the shop about music and videogames for 30 minutes, and ended up getting back to my job late. They are super supportive of me trying to quit vaping, and are always encouraging me to shoot for lower and lower levels of nicotine. In my opinion, they deserve the tip. Not because I'm forced to do it, but because I genuinely enjoy the service and conversation they give me.\n\nTip based in service and experience. Not because a tip screen is in front of your face.",
            "title_similarity": "0.7775694",
            "sentiment_compound": 0.9802
        },
        {
            "id": "gv40nsi",
            "score": 1,
            "text": "I'm a cashier for a restaurant where you order at the counter and then the food is brought to your table. We have a tip jar, but the tips are shared between everyone in the restaurant, kitchen included. I can understand not wanting to tip, but sometimes it doesn't only go to the one at the register.",
            "title_similarity": "0.74340594",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gv41ak9",
            "score": 1,
            "text": "Whenever I visited the cool college town near me, I liked to stop at the candy store.  It was all bulk bins and you filled your bag up yourself.  The cashier weighs it and takes your money. I was always surprised to see a tip jar on the counter.",
            "title_similarity": "0.7014947",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gv431d7",
            "score": 1,
            "text": "My issue is tipping before I receive the service. As OP point out, you are asked to tip right when the person rings in your order. I am then expected to tip prior to receiving my food/drink. I have to pick it up myself, bus my own table, etc. what if the food/drink sucked or was wrong? I already tipped. It’s a dumb system and this comes from a decade long service worker that depended on tips..",
            "title_similarity": "0.8302543",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gv432qa",
            "score": 1,
            "text": "My question is...who exactly does the tip go to? If I use my credit card, and tip 10%, does it go to the person who rang me up?",
            "title_similarity": "0.4849805",
            "sentiment_compound": 0.4515
        },
        {
            "id": "gv43lhq",
            "score": 1,
            "text": "I always tip. The amount depends on the services rendered.\n\nI tip a minimum of $5 for delivery, and as much as $15 if it’s raining or snowing and the business is more than 10 minutes from my place.\n\nI tip 20-30% when dining in a restaurant with a server.\n\nI tip no more than $3 when ordering carry out.",
            "title_similarity": "0.58927035",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv43nfa",
            "score": 1,
            "text": "One day I gave a $5 tip on a $7 jalapeno double cheeseburger. They gave me a quadruple burger.",
            "title_similarity": "0.50191724",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv44aux",
            "score": 1,
            "text": "If you think that they can afford the cost of living in that area then the tip jar wouldn't exist. \n\nDo you think they're fleecing you to get rich and become a mega corp?\n\nIt is just an option to help these individuals reach a better quality of life without them passing the cost onto all customers.",
            "title_similarity": "0.70209074",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gv44bv6",
            "score": 1,
            "text": "Let’s say the tipping culture spreads to other businesses like donut shops, etc. The corporation, or the owner running this business can now lower the wage he’s paying his employees, because they can expect to make up any shortfall through tips.  If they decide they don’t like their wages slashed, and decide to quit, there is always someone else desperate enough to take the job.  Don’t believe me?   Look at all the service industry staff in the U.S. getting paid $2.00 an hour.  The employees don’t make any extra money.  The customers up paying more. The owner/corporation/shareholders cut their bottom line so in effect all of that tip money goes to the owner.  It’s a perverse system that needs to be abolished.",
            "title_similarity": "0.8230771",
            "sentiment_compound": -0.6771
        },
        {
            "id": "gv44frq",
            "score": 1,
            "text": "Totally agree.  The US tipping culture is outrageous.  I need to tip my barber for a $20 haircut?  TF?",
            "title_similarity": "0.6027932",
            "sentiment_compound": -0.1449
        },
        {
            "id": "gv44zbt",
            "score": 1,
            "text": "My store doesn’t have a tip option on the debit/ terminal, and I hear that we SHOULD have a tip option on there at least twice a week from customers - and believe me it is just as irritating to be told “you should have a tip option” as it is to have it in the first place.",
            "title_similarity": "0.84103876",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gv46vj9",
            "score": 1,
            "text": "Fuck the one employee at my local Buffalo Wild Wings who always explicitly points out the tipping option on the card machine when I do pickup orders and gives me a “really, asshole?” look when I don’t tip her.",
            "title_similarity": "0.77230906",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gv46zz0",
            "score": 1,
            "text": "My biggest gripe with SkipTheDishes is that you have to pre-tip your driver. If your tip is less than $5, your order takes a along as possible. Sickening",
            "title_similarity": "0.5990213",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gv475h0",
            "score": 1,
            "text": "Tipping in general is a pretty fucked up practice anyway",
            "title_similarity": "0.44252932",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv48ofk",
            "score": 1,
            "text": "In many states, the minimum wage does not apply to tipped workers or a reduced minimum wage applies. The IRS also assumes a minimum tip rate of 8% for tipped jobs when you report income for tax purposes.\n\nIn other words, tipping subsidizing wages is written into our laws in the US to the point where in some states workers make no money (<$2/hr) without tips. (If you live in a state where the full minimum wage applies to everybody equally like California, things are a little different.)\n\nNow I do think it's tacky that so many places ask for a trip at checkout and have like a minimum of 18%.  I refuse to tip at those places.",
            "title_similarity": "0.7494705",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gv48s56",
            "score": 1,
            "text": "Tip your server. The restaurant that I worked at had the servers tip a percentage of their earnings to the bussers, dishwashers, and bar tenders. It only happened one time, but on a slow day I got stiffed by my 3 only tables (tourists) and had to actually pay the other workers out of pocket. If I didn’t also have a (weak) hourly wage I would’ve lost money by working.",
            "title_similarity": "0.8070693",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gv492m4",
            "score": 1,
            "text": "Generally it’s waitstaff, bars and haircut shops they need tips.",
            "title_similarity": "0.5280418",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv4967e",
            "score": 1,
            "text": "While I agree with you for the most part, this is not a new issue. It’s been going on for at least 20 years, at least in urban areas in the US",
            "title_similarity": "0.31453398",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv49g5i",
            "score": 1,
            "text": "Over the last year or two, I've started noticing something related to this in many restaurant/stores that have a tip screen on a POS system. The person working the counter will physically turn their head and look away while I'm going through the purchase authorization flow. I haven't asked anyone about it, but my assumption is that this is probably something that is becoming more common to train as a simple way to reduce the awkwardness of selecting a tip in front of someone.\n\nI don't think this would actually change my view, since there still isn't a very meaningful amount of service being done, but it does mitigate one of the key points as to why the user experience is problematic.",
            "title_similarity": "0.82114816",
            "sentiment_compound": -0.8257
        },
        {
            "id": "gv49l1m",
            "score": 1,
            "text": "It's not wrong for them to ask - but they shouldn't expect anything. I worked as a waiter and bus boy in several restaurants and tip very well unless the service is bad if I'm waited on. If they seat me, take my order, bring food and drinks and refill my glass - that is service I tip for. I tip barbers and others as well. But if I walk up to a counter, order and pick up my food and drink or serve my own drink - that isn't tippable service. If I place an order to go and pick it up - that isn't tippable service, though I've had people go out of their way in some situations and I've tipped them.",
            "title_similarity": "0.79650986",
            "sentiment_compound": 0.1941
        },
        {
            "id": "gv49vhc",
            "score": 1,
            "text": "Ya sorry but the guy working at a frozen yogurt shop ain't ever getting a tip from me. I put everything together myself. You're just there to take my money after I did all the work.",
            "title_similarity": "0.8157925",
            "sentiment_compound": -0.0387
        },
        {
            "id": "gv49zj2",
            "score": 1,
            "text": "Then don't tip. 🤷🏼‍♂️",
            "title_similarity": "0.15753084",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv4aljb",
            "score": 1,
            "text": "I can see your point, and tipping should be optional in some instances. My view from being a past table service worker it was an equalizer for those who put in the extra work to get rewarded for giving extra effort. I also see many of those counter service shops as young people in high school/college or just starting out trying to make it on minimum wage and know how hard it is to get going, so now that I have a job where I have a little extra I like to have the option to put money directly in their pockets. But I do agree it should be an obligatory thing in most cases",
            "title_similarity": "0.72256345",
            "sentiment_compound": 0.7556
        },
        {
            "id": "gv4axgy",
            "score": 1,
            "text": "here in australia, no one tips and workers never expect them. this whole tipping concept is bullshit and should be illegal.",
            "title_similarity": "0.61004514",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gv4b2vc",
            "score": 1,
            "text": "Thank you. I agree w you but unfortunately, for a long time now, I’ve been tipping every one because I feel so guilty. Regular places I pick up to go from, I’ve been leaving them 5$ for the longest now. I used to serve and I RARELY got good tips at a sit-down restaurant. My service was better than most people and I couldn’t believe people tipped so awful. I’ve never been like that though. I don’t even have income from a job but I still do it. You’re right though. Allll these places expect tips now. Why?",
            "title_similarity": "0.7731942",
            "sentiment_compound": -0.9293
        },
        {
            "id": "gv4b34v",
            "score": 1,
            "text": "We can complain about tipping culture all we want, but unless the service industry makes changes by paying livable wages, by not tipping we are just hurting the server.  Lots of restaurants went to take out only or really increased their take out service during covid.  I have made it a habit of tipping even more for take out than I used to as I am just thankful to be able to get take out food.  \n\nFor counter service only places, that have always been counter service only, I am aware that the couple of dollars I might tip mean a whole lot more to the employee than to me and I am happy to help them.",
            "title_similarity": "0.8461717",
            "sentiment_compound": 0.9272
        },
        {
            "id": "gv4b4am",
            "score": 1,
            "text": "Just don’t tip.  Or, if you really feel they’re underpaid then tip.  Either way, the whining about the tipping system isn’t going to change anything.",
            "title_similarity": "0.55610704",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gv4c2nq",
            "score": 1,
            "text": "They Do This Sh!+ At DOMINOES PIZZA (the forced tips screen when you pay-pickup your pizza).",
            "title_similarity": "0.6416894",
            "sentiment_compound": -0.5093
        },
        {
            "id": "gv4cd5d",
            "score": 1,
            "text": "This one is easy. Tipping is wrong.  Employers should be paying their employees more. Tipping only allows the employer to make more profits.",
            "title_similarity": "0.6840229",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gv4ch91",
            "score": 1,
            "text": "If you feel this way. Then don't tip. I'm not willing to change your mind on this one. Stores that ask for tips and give great service then sure I will tip but that is up to you.",
            "title_similarity": "0.60834885",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gv4cioj",
            "score": 1,
            "text": "Think about it from the economic perspective.\n\nRestaurants operate on very tight margins.  Most are not very profitable.  In order to remain just viable, you must keep you labor costs under 30% and Food Costs under 30 % and rent under 10%.  Add in maintenance, utilities, linen service, cleaning supplies, uniforms, accountants, payroll service etc etc etc.  Profit margins are very thin\n\nTo maintain that 30% labor expense, restaurants rely on subsidizing their employees' pay with tips.  If tips were to be eliminated, many of these workers wouldn't be able to afford rent.  Servers make an insane amount of money relative to the amount of skill they possess, but these workers at counter service  fast casual restaurants (who are both cooking the food and serving customers) are not making much.  \n\nEliminating tipping would lead to 20% price increases, reduced portions, or lower quality ingredients.  The perceived value of the product would tank, which would lead to the restaurant failing.  \n\nI guess if there was a federal law outlawing all tipping, the whole market would adjust simultaneously- everybody could raise prices by 20% and then we are all and dandy.  You wouldn't have to deal with annoyance of tipping someone.",
            "title_similarity": "0.74351585",
            "sentiment_compound": -0.779
        },
        {
            "id": "gv4cn32",
            "score": 1,
            "text": "I grew up in the USA and have been in Australia for 20+ years. We don't tip here. Instead employers are required to pay livable wages. Our conservatives are against this and attack it as much as possible.",
            "title_similarity": "0.7178717",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gv4corg",
            "score": 1,
            "text": "Tip someone who makes your coffee a fucking dollar. If they’re just ringing shit in then there’s no tip, but if they actually prep something for you throw them a dollar or two",
            "title_similarity": "0.7704456",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gv4d8cd",
            "score": 1,
            "text": "Subway just started this where I live, I HATE it. I get if your being waited on at a restaurant, or get delivery where people go out of their way.",
            "title_similarity": "0.74613833",
            "sentiment_compound": -0.6633
        },
        {
            "id": "gv4e4l0",
            "score": 1,
            "text": "Not sure where you live in the US, but I never tip at counters with the tip jar (very rarely I do if I have an extra dollar or two and like the store a lot), but I've never gotten the impression that it was expected, and I've also worked at places with a tip jar too. It's kinda just \"extra\" for people to throw some money in if they really liked the service. \n\nI do agree about the digital systems that have a giant \"TIP\" section in places that don't really make much sense to tip as a kind of guilt trip. That's annoying for sure.",
            "title_similarity": "0.7900455",
            "sentiment_compound": 0.6673
        },
        {
            "id": "gv4epfh",
            "score": 1,
            "text": "Accepting tips is perfectly fine for me in the same way i don't think it is bad when beggars ask your for change, now, straight up asking you for it is a different matter",
            "title_similarity": "0.5579184",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gv4euin",
            "score": 1,
            "text": "I tip at burrito places. Since I’m a regular and they know I tip I get all the extras free. So my queso, bacon, double meat for two burritos and lots of chips all gets comped. The $3 I toss them is well worth the long run savings considering I go once a week at least.",
            "title_similarity": "0.5901809",
            "sentiment_compound": 0.743
        },
        {
            "id": "gv4f7pf",
            "score": 1,
            "text": "To Insure Prompt Service (TIPS) at the counter was the original tip jar.  Whether you agree or disagree, it was incentive for the employee to take care of your immediate needs immediately, before others.",
            "title_similarity": "0.57619345",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gv4fiew",
            "score": 1,
            "text": "My first job was at Baskin Robbins when I was 15. We were told in no uncertain terms by the owners that the next time they hear of a Tip Cup being put on the counter that they would fire the person that put it there.\nOur job was to provide the best service possible to the customers for the marked price of the product and we were not to beg for additional money from the customer. And it was specifically providing BAD service to put a cup out making the customer feel they needed to pay anything above what the register said.",
            "title_similarity": "0.84043074",
            "sentiment_compound": -0.237
        },
        {
            "id": "gv4fkch",
            "score": 1,
            "text": "Just don't tip for counter service then? No one's forcing you.",
            "title_similarity": "0.42671558",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv4fknw",
            "score": 1,
            "text": "One of best things about vacationing in Japan is no tips.",
            "title_similarity": "0.5628659",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gv4g047",
            "score": 1,
            "text": "I always say tipping is for the wealthy and people with extra money lying around.\n\nIt’s selfish for servers to believe that poor people that they serve owe them extra money so that they can make MORE than minimum wage. No server DESERVES to make more than minimum wage... it’s a privilege granted to them by tippers. They are not entitled to it.",
            "title_similarity": "0.7567607",
            "sentiment_compound": -0.7659
        },
        {
            "id": "gv4gbx5",
            "score": 1,
            "text": "I don’t normally tip for counter service, or perhaps left over change when I paid cash.\n\nBut, during COVID and while businesses are still open, I have started tipping because service workers are at great risk of contracting COVID and facing time off.  “Thank you for your service” seems too easy - I feel like putting my money where my mouth is.",
            "title_similarity": "0.7770558",
            "sentiment_compound": 0.9022
        },
        {
            "id": "gv4gltn",
            "score": 1,
            "text": "Personally, since Covid, I like it—whether or not the service is good, I tip 15-18% at the register when I see that, I consider it hazard pay just at the moment. If the service is good, I add a cash tip at the end.",
            "title_similarity": "0.5645633",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gv4gurb",
            "score": 1,
            "text": "In IL, there is still a minimum wage for people who make tips, albeit about half of standard minimum wage. Employers are supposed to pay the difference if you don't make enough in tips that shift to compensate. However, most employees don't follow through with this as then they have to report their tips (which they are supposed to do) and then they are taxed.",
            "title_similarity": "0.73573005",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gv4h1nw",
            "score": 1,
            "text": "US. I feel tipping is subsidizing corporations because they refuse to pay employees more. But I still tip generously at the table. Readers, pay your bill with a cc if you desire but make sure to *tip with cash*. There are too many companies that tax the whole bill, which includes servers' tips, and get away with it. \n\nYou think since the pandemic restaurants are paying these servers more? They're not. The tip jar is generally split with whoever answered the phone and took my to go order and the cashier ... I don't care. Some even walk out to my car and bring the food.\n\n***UNTIL*** these poor workers are paid an adequate wage I will continue to tip. The pandemic has made people more aware of the disparity in wages. I drove by a Dairy Queen last week and was shocked to see a Help Wanted sign on their marquee, right under the comment the dining room is open. Starting wage $14. Better. What that means is these kids have found work that pays them a decent wage and they're being forced to pay more. Good.",
            "title_similarity": "0.85081226",
            "sentiment_compound": 0.7716
        },
        {
            "id": "gv4hs6d",
            "score": 1,
            "text": "Tip for service. It shouldn't have anything to do with whether someone is working behind a counter or going around the room on a unicycle juggling glasses. If they're providing service, TIP. And this whole \"they should just pay their staff a decent wage\" argument only goes so far. Yes, they should pay a better wage, but that wage wouldn't likely be enough for the industry veterans who are making mortgage payments and putting kids through school on their tipped earnings. Those people (and their kids) would be fucked.",
            "title_similarity": "0.82193744",
            "sentiment_compound": -0.7439
        },
        {
            "id": "gv4hy5p",
            "score": 1,
            "text": "So I’m actually a business owner and do have one of those fancy registers. There is a way to disable the tip screen, but I did not choose to do so. The reason being that currently, the only people in the business are myself and my husband. We have not turned a profit yet, so we don’t make anything from our business. We have a product that is labor intensive and priced fairly for the amount of time and cost that goes into creating the product. Our profit margin isn’t large. \n\nThe reason we included that is because the city we live in is very big on supporting local businesses. We never expect it, but there are a lot of people who are very invested in the success of new, small business in our area. \n\nI don’t tip when the option is presented at chain counter service restaurants, unless the service is extraordinarily phenomenal. I think large companies should be able to handle the weight of paying their employees good wages. But I will usually tip at local places because I know their pockets don’t run as deep. I don’t tip at Starbucks, but I will tip every time at my local coffee shop. \n\nIt’s just a way to show appreciation and a little extra support.",
            "title_similarity": "0.75784284",
            "sentiment_compound": 0.9783
        },
        {
            "id": "gv4ifhm",
            "score": 1,
            "text": "Gotta agree. If someone is serving you in a restaurant and they’re providing good and friendly service then I’ll tip but the automatic tipping of ANYONE in a service industry just because they’re in a service industry is really annoying.",
            "title_similarity": "0.7895993",
            "sentiment_compound": -0.0489
        },
        {
            "id": "gv4imbw",
            "score": 1,
            "text": "Tipping in general makes sense if it's at all based on the amount of time and effort your server went to.  But feeling obligated to tip 6 times more money because I ordered an expensive steak vs a burger is silly.  The chef worked the same amount, the waiter worked the same amount, they brought me only one plate.\n\nSame works in reverse too.  If you go to Steak & Shake and order a $4.00 meal with a water, you certainly don't get to only tip the waitress $0.80.  That would be fucked up.",
            "title_similarity": "0.77968323",
            "sentiment_compound": -0.631
        },
        {
            "id": "gv4j1eu",
            "score": 1,
            "text": "Sooooo....you aren't ok with tipping....you just said that you want it to go away....tip where you are comfortable....bringing it up makes you look cheap....just saying",
            "title_similarity": "0.5981808",
            "sentiment_compound": -0.1501
        },
        {
            "id": "gv4j2sx",
            "score": 1,
            "text": "The worst is when the system isn’t facing you and they have to ask you if you want to tip for counter service- I feel like an ass for saying no, but most of the time it’s literally just me picking up food, which I don’t believe deserves a tip.",
            "title_similarity": "0.8621784",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gv4ja3p",
            "score": 1,
            "text": "If I am paying 100 bucks for a massage and you still want a tip beyond that why not raise the rate to what you want to receive and leave it a flat price?",
            "title_similarity": "0.52975166",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gv4jiwb",
            "score": 1,
            "text": "Tipping needs to go away and replaced with a comparable wage because there is literally no consistency or predictability. It's incredibly difficult for someone to plan their bills based on the good graces of fellow Americans. It is also a weird creepy vassal surf kinda thing where the fine folks throw the poor small people a buck if they dance the way the like for them.\n\nJust pay people. Plain and simple.",
            "title_similarity": "0.7538091",
            "sentiment_compound": -0.101
        },
        {
            "id": "gv4jsmc",
            "score": 1,
            "text": "I don't understand why someone thinks they deserve extra for doing the job they agreed to do. I get that servers usually don't get paid what they should...but take that up with your employer. That's not the customers obligation",
            "title_similarity": "0.7217728",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gv4kmn4",
            "score": 1,
            "text": "A lot of places are doing this now. Keep in mind that, unlike a sit down restaurant you’re not expected or required to tip at these sorts of places; it’s just the option and if you do tip, it doesn’t have to be a lot. When I go to Dunkin, I usually round up to the nearest dollar and they get to keep my change. It may only be 50 cents, but if everyone or even 1/4 of the customers tips 50 cents it’s a decent amount of money. And again, it’s optional. Personally I don’t mind this. I had a Burger King lady go above and beyond for me last year, and I wanted to tip her so badly. She said she’d lose her job if she took any money from me, and that’s not right either.",
            "title_similarity": "0.6328847",
            "sentiment_compound": -0.8761
        },
        {
            "id": "gv4l2a8",
            "score": 1,
            "text": "Why not? Who gives a shit about a buck here or there when you're paying double for coffee you could make better at home for half the cost?\n\nWeird priorities bub.",
            "title_similarity": "0.69317746",
            "sentiment_compound": -0.4137
        },
        {
            "id": "gv4lhbb",
            "score": 1,
            "text": "I just don't feel obligated to tip at counters, thinking of it from the perspective of the business they just get free money from the prompt so I don't mind them having it. I only tip at counters if it's a small business and I order something like a pour over coffee which takes someone 5minutes or so to make just toss a dollar or so.",
            "title_similarity": "0.7403327",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gv4lmo6",
            "score": 1,
            "text": "Usually the tip jar at counter places is more for spare change or if they do something super awesome. Like for example, once I lost an ice cream to the ground as I was sitting down and they insisted on replacing it for free.",
            "title_similarity": "0.76107836",
            "sentiment_compound": 0.91
        },
        {
            "id": "gv4lsve",
            "score": 1,
            "text": "This is going to get completely buried at this point, but I used to work in credit card processing and this has to do with the way tips are processed on credit cards. \n\nAt a traditional restaurant the card transaction is run for the meal amount and then the total is changed after this without the card present, usually at the end of the day. This will overwrite the original transaction and be processed for the full amount with the tip. This can only be processed through credit card software that can handle changing the transaction amount.\n\nWhat you're referencing is called tips at time of sale. The transaction is only run for the full amount with the tip because the amount is entered before the transaction is completed. With this kind of software the total cannot be changed once the transaction has ended. \n\nThey're not trying to guilt you into giving a tip, it's just the only way they can accept tips for those who want to leave one. Their software can't add a tip after the sale.",
            "title_similarity": "0.7833743",
            "sentiment_compound": 0.9683
        },
        {
            "id": "gv4mb2d",
            "score": 1,
            "text": "I also heard  that in states where marijuana is legal, it's customary to tip the \"bud tender\",\nIs this true?\n\nI will 100% tip when asked to, I always believe people deserve a respectable wage, but my state recently got medical weed and JFC it's a $150/year for a \"prescription certificate\" on top of the usual $40-50/8th.\nIt is ridiculous to me to watch weed be industrialized by big corporations making millions, and expect me to tip to subsidize their workers wages.\nIs this a thing we're supposed to do??",
            "title_similarity": "0.67103654",
            "sentiment_compound": 0.4243
        },
        {
            "id": "gv4mfoj",
            "score": 1,
            "text": "It’s one thing to tip a server that’s wage is around $2 an hour, it’s ridiculous to tip the girl at the smoothie king making $9+ an hour for throwing some fruit in a blender for a minute long encounter.",
            "title_similarity": "0.7195403",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gv4mudd",
            "score": 1,
            "text": "I agree. Don’t let them guilt trip to tipping. I only tip when I make special request beyond regular transaction. Or if I’m regular and they throw in small freebies. Straight order, paying, and grabbing the food over the counter, yeah no tip.",
            "title_similarity": "0.7255639",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gv4n9cu",
            "score": 1,
            "text": "I hate tipping culture. It's ridiculous and harmful.\nThat said. I worked at that donut shop. We don't Ask for tips but we certainly appreciate it. And I'm talking an extra 10 cents to a quarter every two three customers.\nThat translated to an extra 20$ every week.\nFor people making minimum wage, any variation of minimum wage, that 20$ is worth it.\n\nThat's why you should tip the donut shop. Because it makes it worth it-competitive to work there. It makes the quality staff want to stay instead of leave for a better job.\nSo give your spare change you are just going to drop. Increase the quality of your local coffee/donut shop. Reduce the line ups in the morning.\n\nAs they say, you get what you pay for.",
            "title_similarity": "0.8238709",
            "sentiment_compound": 0.899
        },
        {
            "id": "gv4ndiy",
            "score": 1,
            "text": "I think of gratuity as a thank you for someone performing a service for me. I don’t put any thought into how much they make or what type of establishment I am in. Someone comes to fix my cable, here’s some cash. Guy at the supermarket helps put the groceries in my trunk, here’s some cash. I tip my barber basically 100%.",
            "title_similarity": "0.73457813",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gv4neng",
            "score": 1,
            "text": "The simple solution to this problem is to not tip them.",
            "title_similarity": "0.2939934",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gv4nff9",
            "score": 1,
            "text": "Agreed. I've worked restaurants and have never been a fan of counter service tipping. Unless something they did was above and beyond and absolutely amazing, I don't tip at counter service. As someone who's served, it's a fricken insult considering they just rang up an order and they want a tip? For....? Bagging something and taking my money?\n\nTalk to me when you're running around, multitasking up the ass for multiple tables, being screamed at to run food, dealing with unreasonable and entitled customers, pressure from management to meet dessert and alcohol sales, all while being pleasant and giving the customer a good dining experience. \n\n... But you have a tip jar for ringing up my bag of donuts. \n\nYeah no. I'm far from anti tipping, but that's where I draw the line.",
            "title_similarity": "0.84235233",
            "sentiment_compound": 0.4321
        },
        {
            "id": "gv4nk39",
            "score": 1,
            "text": "So I honestly thought they were just poorly thought out systems, so I never tip on counter service.\n\nAre places really expecting you too?",
            "title_similarity": "0.6621422",
            "sentiment_compound": 0.507
        },
        {
            "id": "gv4npl5",
            "score": 1,
            "text": "You are correct. In the United States if the minimum wage had grown as much as CEOs salaries had since the 70s it would be $40 an hour. Tipping reduces the minimum wage and creates poverty. Of course that makes no difference to the people actually in these jobs so it's up to them to unionise amd fight for a higher minimum wage and better working rights.",
            "title_similarity": "0.7044442",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gv4npq8",
            "score": 1,
            "text": "In establishments like this, tips are shared among all the workers. Not just the person at the resister that you interact with for 30 seconds to a minute. \n\nAt Starbucks, the tips are shared so the barista actually making the drink receives extra money. \n\nAt Chipotle, the tips are shared among everyone who prepared your meal. From the line cooks to the people on assembly. \n\nTo be clear, these employees are paid minimum wage or higher. So unlike sit down service, these tips are not subsidizing their wages. They are in fact “to insure prompt service”. \n\nYou don’t necessarily need to tip 20%, but a dollar or two can go a long way. Especially if you made special requests or had a large order to arrange (probably more than a few bucks in this case).",
            "title_similarity": "0.7343782",
            "sentiment_compound": 0.8641
        },
        {
            "id": "gv4otgl",
            "score": 1,
            "text": "Agree. Tipping is automatic in the US, that even servers put in the least amount of effort because they know they will be tipped regardless. There are hundreds of other jobs that pays minimum wage and they never see a dime in tip money.",
            "title_similarity": "0.6629778",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv4qlu1",
            "score": 3,
            "text": "David Chang is a restauranteur spearheading the abolition of tipping, arguing food should cost what it costs and responsibility should be placed on the restaurant owner to pay a fair wage. I hear people say, when you don’t have the tipping model, service quality is diminished. I can’t say for sure. I’ve had amazing and shitty dining experiences in the US and abroad.  I know the service industry employees here in the US work their tails off for those good tips and are so bummed to see anything less than 20%. Thoughts?",
            "title_similarity": "0.8972417",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gv4qm8g",
            "score": 1,
            "text": "I only tip for table service. That’s it’s.",
            "title_similarity": "0.5281321",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv4ro5v",
            "score": 1,
            "text": "I find this very interesting, and I’ll say my piece as someone who’s worked at a local owned shop (not a chain) for over 2 years now. Take it now you will. \n\nYes, making a latte takes me under 2 minutes to do, but there’s a lot of variance from drink to drink. Sometimes it’s easy, some people want half sweet, sometimes it’s more complex. Half sweet almond milk no foam. Is it hard work to do all of these things mechanically? No, but there is a lot of skill involved in making a drink someone wants to come back for. The thing is I could make a latte in 40 seconds, but is that going to be a good latte, not at all. There’s a lot of skill and art, sometimes literally, in making some of these drinks. We only do it quickly because we have other customers waiting, but even I don’t rush drinks when we are busy because I enjoy people telling me it tastes great and coming back for more. \n\nWhen I pour a black drip coffee, I spent 10 seconds tops. Did i deserve a tip for that? Fuck no. Do people still tip me 1 dollar on a 2.25(cad) coffee? Yes. And I always tell them they don’t have to do that I didn’t do work, and what they say is always along the lines of “you are always nice and I appreciate it”. That’s the thing I think you are missing out on, especially for a local shop, you get to know people a lot. I talk to a lot of people every day, the same people weekly, and I memorize orders just from when someone walks through the door. Infact it wasn’t even my idea to ask my boss to add tips to the till, since we only had a cup before, it was customers asking me every day “how can I add a tip?”. They would ask weekly if we got it figured out, or told my manager to add it. Eventually I went to my boss and he did, and I ended up with almost an 8 dollar raise if we use the new tips added to my wage, which is insane. From 14.50-> 22 almost, is a big deal. \n\nAnd here’s the thing, do I think someone’s an asshole if they don’t tip? Not at all. \n\nDo I think someone who is picky, high maintenance with their drink or all around is rude is an asshole, when they don’t tip? I do. That’s the only time I think to myself “really? Couldn’t tip” every other time I don’t even check if they did or not till they leave, because it doesn’t matter to me. \n\nTLDR: a lot of customers genuinely want to tip us, making lattes and related drinks is much harder than people think, it’s easy to make a latte but to make a GREAT latte took a lot of skill and effort, especially latte art. I don’t care if someone tips or not unless they were a jerk or demanding to begin with.",
            "title_similarity": "0.73204494",
            "sentiment_compound": 0.9919
        },
        {
            "id": "gv4sjpj",
            "score": 1,
            "text": "I tip at least 20% when we go to a sit down restaurant and have someone serving us to be clear. \n\nHowever, I am not going to challenge this one because I agree. It's also ridiculous to expect a tip to be given before even trying the product. My husband is very anxious and is always pressured into it. I tell him simply, if you're being asked to tip before we get the product; don't. That's not how it works. He doesn't want to hurt the employees feelings so he keeps doing it. \n\nI absolutely hate that on top of it the employee is often creating a lot of pressure by directly looking at the screen while requesting the tip. I find the entire situation increibly rude and disrespectful.",
            "title_similarity": "0.8304054",
            "sentiment_compound": -0.6656
        },
        {
            "id": "gv4sp35",
            "score": 1,
            "text": "Meh, most of them get paid shit. I don't tip 20% if I'm not getting served, but I still always tip a couple bucks. It'll affect their lives far more than mine, and if it's somewhere I go regularly sometimes they'll hook you up. I've also worked as a pizza delivery driver so I guess I have some experience with tippers vs non tippers.",
            "title_similarity": "0.7597592",
            "sentiment_compound": -0.3506
        },
        {
            "id": "gv4szlh",
            "score": 1,
            "text": "I agree to an extent.  I think the worker should be paid according to what the position demands of them.  Tipping should be a monetary way of saying, “Thanks for doing such a great job,” shouldn’t be expected, and should be in addition to they’re already-fair wages.  I should not be expected of the consumer to fill in the gap between the employer’s pay rate and a livable wage.",
            "title_similarity": "0.67570627",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gv4t2qp",
            "score": 1,
            "text": "Unless it is above and beyond service, or something that I myself cannot do, I will not tip",
            "title_similarity": "0.28474766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv4togh",
            "score": 1,
            "text": "I am a very generous tipper and often tip at the type of places you mentioned BUT it is outrageous.  For me it’s uncomfortable and I sometimes will avoid places that do this.  \n\nBTW I hate at Petsmart when you are automatically offered to donate $1 ( or more) as you complete your POS purchase.  I have a rescue! That’s why I’m there- to get supplies for my adopted pet.",
            "title_similarity": "0.7811085",
            "sentiment_compound": -0.8688
        },
        {
            "id": "gv4trz6",
            "score": 1,
            "text": "Restaurants aren’t big business. They usually can’t afford to pay their employees more and the choice is either raise prices or customers subsidize the pay with tips.",
            "title_similarity": "0.7596618",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gv4tt6y",
            "score": 11,
            "text": "I'm really tired of the current trend of cashier point of sale software that always asks you if you'd like to tip. No. I'm not going to tip 10%+ or a dollar because the cashier scanned my candy bar and then turned the tablet towards me so that I can run my own credit card, sign my name, enter my own email and/or choose my receipt option, and cash *myself* out. Fuck that. I literally did all of the labor myself. Pay your own fucking employees and don't shift the burden to customers. \n\nI don't even trust these businesses to even pay their employees the tip I would give them. Plus the software company most definitely takes a hefty % of the tip that goes directly to the SaaS PoS company and not to the employee or even the business itself. \n\nThis trend has gotten worse during covid, with all of the \"contactless\" point of sale cash out processes being used. Most of the time the customer does all the work themselves on a tablet. \n\nI have no problem tipping the traditional tipped roles like servers, bartenders, delivery, etc. But I'm against these SaaS companies throwing in a pointless \"tip\" option on their software so that *they can take a percentage commission off of the tip*. Fuck that.",
            "title_similarity": "0.8575072",
            "sentiment_compound": -0.6974
        },
        {
            "id": "gv4ui2e",
            "score": 1,
            "text": "Just click zero and dont feel bad",
            "title_similarity": "0.22814734",
            "sentiment_compound": 0.431
        },
        {
            "id": "gv4uor6",
            "score": 1,
            "text": "Put zero and move on. I think it's a feature of the pos vs a decision of the business.",
            "title_similarity": "0.5698539",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv4vayz",
            "score": 1,
            "text": "It’s not all about you, dude. Just because they only interacted with you for a minute or two does not mean that they haven’t been on their feet for hours, probably through a lunch or breakfast rush... \n\nA waiter has a finite section, they can only be so busy. Of course they have time to kiss your ass. \n\nA counter person can be on the run relentlessly for hours. And don’t forget the amount of abuse that they take on a daily basis; people irritated about the line, or their own personal issues, creepers who spend a dollar to hold some counter person hostage for an excruciating conversation... drive-by racism, and lofty idealists who bravely refuse the token gesture of gratitude, because only they can perceive the true form of injustice. \n\nHave some perspective. And maybe a little empathy. Yes, they need the money, but more importantly, they deserve the gratitude.",
            "title_similarity": "0.7336815",
            "sentiment_compound": 0.3716
        },
        {
            "id": "gv4vk2e",
            "score": 1,
            "text": "Emily Post and similar etiquette sources agree with you. \n\nOf course, it’s all relative. Most people don’t tip Housekeeping in a hotel or a few others who offer services that are considered tippable.",
            "title_similarity": "0.5969094",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv4vpqg",
            "score": 1,
            "text": "🗣Say it louder for those in the back!!! I agree 💯%!!!!",
            "title_similarity": "0.0703682",
            "sentiment_compound": 0.5673
        },
        {
            "id": "gv4vxyl",
            "score": 1,
            "text": "I know there’s tip jars and the receipts are the typical ones you see in many food establishments but I have not experienced a situation where I feel like they’re asking or truly pushing it.",
            "title_similarity": "0.7265693",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gv4wce2",
            "score": 1,
            "text": "I see delivery and waiting as both deserving of tips, what’s your stance on this?",
            "title_similarity": "0.41027778",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv4x59f",
            "score": 1,
            "text": "I stopped going to the more convenient breakfast location near my house because every time I paid with my card they would ask me if I'd like to leave a tip, and I would have to say \"no\" out loud every morning in front of the entire store. I don't want to change your view, you're entirely right. \n\nAsking people that when they haven't had their coffee first thing in the morning is honestly rude to me.",
            "title_similarity": "0.8747661",
            "sentiment_compound": 0.0459
        },
        {
            "id": "gv4x8k3",
            "score": 1,
            "text": "Restaurant Manager here, we have the same conversation about to go orders, because the staff isn't really doing much if all they have to do is bag up your food and hand it to you when it comes. That being said, my bosses use the tips as a justification for paying them less, and so I make it a habit of tipping even though I don't think the service should be a tipped position. It's not your job to protect the employees by any means, but they are getting skrewed either way so I feel better about leaving a couple of dollars for them. Especially during the pandemic, I have seen multiple positions get downgraded in pay over the justification that they are getting tipped.",
            "title_similarity": "0.88620806",
            "sentiment_compound": 0.7612
        },
        {
            "id": "gv4x8yi",
            "score": 1,
            "text": "Drives me bonkers too! I hate when you have to hit 3 buttons to say I don't want to tip. It's psychological to make you feel bad. Tipping culture is the worst.",
            "title_similarity": "0.67376184",
            "sentiment_compound": -0.9155
        },
        {
            "id": "gv4xkmm",
            "score": 1,
            "text": "Absolutely. I'm glad I live in a country where tipping is rare and seen as abnormal.\n\nThe business relationship is simple... I pay the company for the service and the company pays its staff. Tipping culture is a way to have lower bills on the menu, thus tricking customers into eating there, by hiding the extra 15% charge they are socially expected to pay. No fuck you Mr restaurant owner, pay your staff a decent base wage.\n\nThe other part that beggars belief is the notion of tipping \"for a good job\". Bitch that is literally the job of the employer. The person is SUPPOSED to do a good job, that is literally why they are hired. It's not my responsibility to incentivise someone else's staff... The base salary is for a good wage and should be good enough to incentivise itself.",
            "title_similarity": "0.82965654",
            "sentiment_compound": 0.814
        },
        {
            "id": "gv4xyc6",
            "score": 1,
            "text": "I used ta work one of those counter service jobs. Here's my take. I don't expect a tip. In fact, i agree with you for the most part. But i still put out a tip jar. I still threw in some of my own money to make it look used. I figured if someone wanted to give me extra money, i had no problems taking it.  \n  \nPersonally, i don't tip counter service unless there is a show that goes with it,",
            "title_similarity": "0.7457768",
            "sentiment_compound": 0.5628
        },
        {
            "id": "gv4yep4",
            "score": 1,
            "text": "Those have always been there, it's just adapting to the digital age. Tip jars at the counter of coffee shops, ice cream shops, and small counter top order places have always been a nice way to to leave change. But no one carries cash anymore and those little tip puts add up throughout the day. You don't have to tip 20%, just round up to the closest 0 or 5.",
            "title_similarity": "0.6863764",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gv4z3su",
            "score": 1,
            "text": "I stay the fuck away from places that have a turn around tablet or just a screen the worker- who is paid hourly- sees whether I tip or not.\n\nTo go on I believe tipping is a fucking scam and this country needs to wake up. How the fuck is $4.25 for a waiter/ess acceptable?! Minimum wage here is $8.50 which is still shite, but it's fucking DOUBLE what the people who endure shit from piss poor human beings take all day....\n\nI do leave generous tips at times. Especially to those who make a good effort. I don't just give shitty tips because someone makes a mistake or they look like they're having a bad day. If someone's job revolves around tips making an actual living, majority of the time I will tip well.",
            "title_similarity": "0.7912853",
            "sentiment_compound": -0.852
        },
        {
            "id": "gv4zjv2",
            "score": 1,
            "text": "Places like this I do not tip the usual 15% to 25%. Instead I usually just tip a dollar. I would say still tip though as others have said because a lot of baristas are only paid around $2 an hour.",
            "title_similarity": "0.6703958",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv505nk",
            "score": 1,
            "text": "Tipping as a culture is stupid. Employers should pay their employees enough.",
            "title_similarity": "0.72405505",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gv50m3w",
            "score": 1,
            "text": "At least at cold stone they dance for tips",
            "title_similarity": "0.36994717",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv51ze7",
            "score": 1,
            "text": "I went to a photo printing place last week that had a tip line on the receipt 😐",
            "title_similarity": "0.46425724",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv52a9s",
            "score": 1,
            "text": "Given the shit wages service industry make I tip even at counter and takeout orders.  But it's less than for table service.  \n\nI to would like to see fair wages paid and tipping go away.",
            "title_similarity": "0.8273045",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gv52pnr",
            "score": 1,
            "text": "I’m with you, I almost never tip in a counter service situation. If I walk in, they say hi and ask what I want, I say item, they hand me item, and now it’s time to insert my card and pay... sorry, that doesn’t warrant an extra charge. I guess you can’t knock them for trying and allowing people to be generous if they choose to but unless someone goes above and beyond, I am way too worried about my own finances to put money in every tip jar.\n\nAnytime a tipping debate comes up you always see “if you can’t afford to tip you can’t afford to go!” kind of rhetoric. So now if I can’t afford to tip at counter service I shouldn’t go? There needs to be a limit of what is expected of people or we all need to just eliminate all food sources other than the grocery store and start over with the entire hospitality industry.",
            "title_similarity": "0.77560014",
            "sentiment_compound": 0.1386
        },
        {
            "id": "gv53063",
            "score": 1,
            "text": "I hope you tip delivery. They're more deserving than table service, they make the same money as someone inside (if not less) and have to eat the cost of gas, maintainence, depreciation of value of their vehicle, and the risk to their lives sky rocketing the moment they get in the car just to bring you you food you couldn't be bother to pick up or make yourself. And no, they don't get the delivery  fee you pay as wages, that fee goes towards covering the labor cost of not having your delivery driver in store handling food.",
            "title_similarity": "0.7835629",
            "sentiment_compound": 0.5908
        },
        {
            "id": "gv534ot",
            "score": 1,
            "text": "It's not wrong for then to place a tio jar on the counter or have a tip line on the credit card slip. You dont have to tip them and they arent expecting much if anything at all. \n\nIf the person is saying, \"will you tip me please,\" then its inappropriate and I'm sure their employer would not be happy about it. People that want to tip will tip and people that don't wont. I worked in a mattress store and my coworker was always surprised that I'd even get tipped when I was there selling mattresses.",
            "title_similarity": "0.79362154",
            "sentiment_compound": 0.7879
        },
        {
            "id": "gv53fpp",
            "score": 1,
            "text": "Be wary of those touch pad tipping systems as well. I used to work for a small business that used Square, a popular software for new businesses. The owner \"hadn't figured out how to tip us out\" via that system and therefore we never saw credit card tips, only cash. Pretty sure he was just an ass who pocketed the money.",
            "title_similarity": "0.77195084",
            "sentiment_compound": 0.5742
        },
        {
            "id": "gv53iy7",
            "score": 1,
            "text": "When you pick up an order, the top goes to the BOH. Usually not the server who grabs it for you.",
            "title_similarity": "0.5718517",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gv53z7q",
            "score": 1,
            "text": "call your members of congress to advocate for a livable wage then and call those places asking to speak to a manager to see if they are paying their employees based on the tips.\n\nin high school i worked one of those jobs and it was super shitty to have to estimate how much less than the minimum wage i was selling my time for.",
            "title_similarity": "0.76758695",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gv540oa",
            "score": 1,
            "text": "I think people should tip because they ask employees to do above and beyond service that’s more than minimum wage services, and they know and acknowledge that we should be paid fair wages but we’re not. Plus a lot of these jobs ask for more then what the job entails and you can’t really just say no or else you’re fired so I don’t see why tipping a dollar or two when you’re buying things is so bad. You revive back what you put out so maybe you’ll have more money flow, that’s just how I see it.",
            "title_similarity": "0.7464076",
            "sentiment_compound": -0.904
        },
        {
            "id": "gv544zy",
            "score": 1,
            "text": "I usually tip like 5% for counter service. More if they're super nice. I don't think it's expected like it is for table service.",
            "title_similarity": "0.5368709",
            "sentiment_compound": 0.8993
        },
        {
            "id": "gv54clk",
            "score": 1,
            "text": "It's only wrong because the business is clearly saying 'we don't pay our employees a fair wage. Can you help them out?' And that's the problem.",
            "title_similarity": "0.7749946",
            "sentiment_compound": 0.2951
        },
        {
            "id": "gv54f1v",
            "score": 1,
            "text": "This may sound bogus, but here are my views because I’ve been both a barista promoted to  manager at a coffee shop, and a line cook promoted to sous chef at a restaurant.  I am going to ramble on a lot, and it may feel like it gets a little off topic, so I apologize in advance.  \n\nAll ingredients cost money, and just because you are getting them at wholesale, does not mean you are always getting them a heck of a lot cheaper.  In fact, the coffee shop gets a milk delivery and pays about just as much as you would at the grocery store for the items, and in some cases, paying even more.  I remember at one point a 32oz bottle of heavy whipping cream was $10.  Some customers wanted keto lattes (12ozs aerated to about 14ozs with 2 shots{2oz} of organic and fair trade espresso) for only $6.  The advantage here is you have someone deliver the milk to you.  There were times where the price of milk would fluctuate much higher and it would have been cheaper to go to the store yourself and buy the milk.  \n\nRestaurants, coffee shops, etc...only really make money and a decent profit when they are able to do a larger than normal volume (weekends, holidays,etc...) tips actually help them bring down labor costs so they have better profits.  Profit margins aren’t as high as people would expect.  Also, most coffee shops and restaurants you see are signed into a lease (rent is determined by square ft of space occupied) sometimes up to $14 per foot or more.  Have you ever driven by a restaurant or coffee shop that is never busy and you often wonder why they’re still in business even though they barely have any customers?  Sometimes it’s better to bite the bullet and slowly bleed money than it is to to try and break a lease and burn the $250,000 that you just spent renovating an 1,800 square foot coffee shop that’s not receiving the love you thought it would.  You have to remember whenever you see a new establishment come in to occupy a commercial setting, they often need to hire an entire team of designers and architects who in turn have to pull permits that often take weeks to get just to make sure the entire building can meet current codes.  They then bring on their own teams to help them do the 3D renders.  Most new coffee shops don’t actually start to turn a profit until after their second or third year in.  Starbucks can get a way with what they do because they created an entire market for themselves, own most of their real estate, and have had decades to build their business.  They’ve also paid millions upon millions to have machines designed that cut corners for them where their labor can’t.  \n\nI worked at a super fancy restaurant where the return air system for the line cooks was just awful and would cost a ton of money to replace.  The property management(a multibillion dollar establishment who owns a chain of outdoor malls) refused to pay for it because it was too expensive.  Well then the restaurant definitely couldn’t afford it.  This ultimately led to me quitting, that and I could make the same amount of money in a less toxic environment while pouring peoples coffee all day. \n\nPsychology.  \nYour perception of your local coffee shop would change if instead of paying your usual $6 for a latte you are now being forced to pay $7.2 for regardless of how good or poor service is.  The coffee shop I worked at had profit margin of about 15-20 percent.  $6 x .15 = .90 cents.  Imagine how many lattes you would need to sell just to pay the baristas hourly wage at $15 an hour, which is we didn’t because we relied on tips, but we did pay more than minimum for sure.  Now imagine having 8 baristas working through your rush.  Have you ever went to a coffee shop that often times felt like they took forever to make your drink and felt like maybe they should bring more staff on?  This might be why.  This is a mentality that a lot of coffee shops do have, especially when tips combined with hourly don’t make for a decent wage.  \n\nThis isn’t the mentality I used at my coffee shop.  I staffed up enough during my rushes that people on average only waited about 3 minutes for their drinks.  The convenience of having a delicious product that only took about 5 minutes from entering the door is what made my establishment spike in business like crazy, especially during COVID.  I wouldn’t of been able to do this without customers gratuity, and my baristas damn sure worked for it too.  They have a hustle mentality that’s met with an actual genuine human being who is actually happy to help you start your day, often times my baristas are the first people of the day that my customers see.  \n\nUltimately tips lower a business overhead cost.  By relying on people with great attitudes and character to be the face of the restaurant to put forth the effort to make a guests day, an establishment can bring on more staff to reduce ticket wait times and better increase the value of guests experience.\n\nTips reduce labor cost.  Labor is what costs the most money, always.  Paying less in labor is always better than hiring on cheaper labor with no experience.  By the time tips factored in they were making up to $18 an hour on busy days and at the worst of COVID, they made more, sometimes more than me.  If we had to raise prices to pay an hourly at $15 and told people that is why they’re paying more, I doubt anybody would leave a tip.  But that is my opinion.  \n\nTips help a lot.  You’re not required to leave one if you don’t want to.  Tipping has been around for...ever.  It’s help build entire business models. \n\nWhen I waited tables I always brought my A game because I knew that affected me financially.  It was a win win ordeal. I would do my best to provide an excellent service and in turn I’d make the restaurant look great itself.  Some servers were clearing $400+ on busy nights. You bet they hustled.  \n\nI am super critical about tipping.  If I go out to eat at a restaurant and the overall staff morale and my servers attitude don’t meet my expectations, I don’t tip well or at all.  If I goto a coffee shop and see poor performance, dirty towels, dried milk spillage everywhere, and poor service, I don’t tip at all.  If I see them and they look like they’re doing their best, I try and make it worth their time.  I don’t believe in tipping people who don’t seem like they want to provide me a good experience.  If they don’t care, then neither will I.  I reward the hustlers on the other side.  If their having conversations while my espresso is oxidizing on the counter or my food is dying in the window, I don’t leave a tip and I don’t often come back.  \n\nSo here are my apologies for rambling on and on and on.  I’ve been both the grunt and the leader in a few settings now.  Each position you will begin to see things a little differently.  Thankyou for your time 👍",
            "title_similarity": "0.86728203",
            "sentiment_compound": 0.9992
        },
        {
            "id": "gv552oy",
            "score": 1,
            "text": "If they do something out of their way I'll tip. For example I called in an order to pick up some Japanese from a fast food Japanese place not long after I had my son.. The drive through was long so I carried my son in his car seat inside with me to pick up the food.. the guy saw I had my hand full so even though they were busy he offered and carried the food to my car and loaded it for me... then yea I'm going to tip in situations like that.. that wasn't his responsibility",
            "title_similarity": "0.7008543",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gv5602z",
            "score": 3,
            "text": "Tipping is stupid. Pay your employees a living wage. Idiots.",
            "title_similarity": "0.6954662",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gv567iz",
            "score": 1,
            "text": "I do a lot of take out and I’m always wondering if I should tip for take out. I usually leave like $3-5.\n\nThe one place I always tip for “counter service “ is coffee shops. If somebody is making me a latte, that’s some work so I give a $1 per drink, same as a bar",
            "title_similarity": "0.6713777",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gv56aog",
            "score": 1,
            "text": "Went through a local drive through/fast food joint drive thru and they asked for a tip. I realized how much judgment is happening on both sides in that moment and it’s really unnecessary. \n\nCoffee shops doing this while they hold the tablet is also really awkward. My gf and I just had this discussion and we are in agreement. \n\nI live in Portland Oregon and servers get paid at least $13.25 plus tips. That’s fine, I love tipping table service. \n\nWhy am I tipping you at a drive thru?",
            "title_similarity": "0.8166965",
            "sentiment_compound": 0.8078
        },
        {
            "id": "gv573qt",
            "score": 1,
            "text": "Put succinctly - it’s just a modern tip jar.\n\nYou don’t get mad when a counter has a tip jar right? Well far fewer people carry cash these days, so this gives them a different way to contribute to a “tip jar”. It’s absolutely not expected of you, just like the old school tip jar.\n\nAnd putting out a tip jar isn’t wrong.",
            "title_similarity": "0.7520237",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gv57no5",
            "score": 1,
            "text": "You are usually tipping the person behind the counter, which if it’s a restaurant is probably “hostess” which is not a fully paid position most of the time and is a tipped position. Coffee places make sense if you go a lot because you build a relationship. Donuts I don’t understand and froyo not so much, I would expect those to be fully paid positions and while I tip sometimes if they are personable or I have the change I will but I usually tip on service work and those like you seem to be saying aren’t as service work as other jobs.",
            "title_similarity": "0.80513227",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gv57q09",
            "score": 1,
            "text": "Ditto. I tip in proportion to services rendered.\n\nIf you're a server making only $4.25 an hour, and you spend 40 minutes of your day being polite and attentive and doing all the leg work, having to tip out bussers and bartenders as well, then yes, 20% tip standard for all but the worst service (not even trying). If you are cutting my hair, having gone to beauty school and honed your skills over time, paying booth rent and spending 40 minutes of your day on me, 20% minimum. If you're and Uber driver putting wear on your own personal vehicle, being only counted as a sub contractor with zero benefits and you spend 40 minutes of your time driving me somewhere, 20% tip.\n\nIf you're shoving out burritos cafeteria style for example, spending all of 60 seconds with me and asking me no more than 5 questions or your only interaction with me is scanning a product and pressing a few buttons on a screen, yeah sorry but no tip unless it's knock your socks off service.",
            "title_similarity": "0.6347975",
            "sentiment_compound": 0.09
        },
        {
            "id": "gv57ypx",
            "score": 1,
            "text": "Tips go to the whole house,back & front.  Also, sometimes the cashier is taking the orders, making the orders & reconciling the transaction.  Repeatedly.  For entitled pricks and looky-loos and the such.\n\nAnd I like that the tablet / Square POS thing doesn't restrict tips to cash transactions & does the math for me.  It's easier than tipping at a restaurant or bar\n\nBut yes the tips system has got to go.  18% gratuity on every order should be able to cover the business's additional obligations",
            "title_similarity": "0.74998534",
            "sentiment_compound": 0.784
        },
        {
            "id": "gv586du",
            "score": 1,
            "text": "The whole u.s workers system is fkd capital is nothing without a work force..in Australia the minimum wage for 18yrs+is like $18 p/h ..ur wage should be more that a coffee..",
            "title_similarity": "0.57669514",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv58ejr",
            "score": 1,
            "text": "I'm going to wager a guess that we have different definitions of wrong here, which is probably the disconnect, but I don't really see it as all that \"wrong\" morally speaking to request something you're entirely able to decline. It's not as though this constitutes a \"tipped job\" in the same way that a waitress or bartender is, so you're not supplementing their income as much as you are simply adding to it. If, for some reason, you feel like you want to tip, you have that option, if not, the 0% button is right there.\n\nI guess I'll just lean back on this: there's no real expectation, in a POS transaction, that you tip. If you feel otherwise compelled or pressured, I think that's mostly on your personal feelings/beliefs on the situation. My counter point would be this: do you tip bartenders? \n\nIf a bartender is just grabbing you a beer, and you're taking it and walking off, do they deserve a tip more than a coffee shop employee? Why or why not? If the only answer is that you're supplementing their wages, then I think this whole bit falls apart, since counter employees generally aren't going to be making the $30 minimum/month to be considered tipped employees. Otherwise, I'd be curious what the substantive difference is between a bartender pulling the cap off a beer bottle, and a froyo employee ringing you up.\n\nTo give an example, I tip bartenders not out of some moral obligation but out of a practical one. In my experience, tipping well (usually 40-60% the cost of my drinks or a couple bucks for beers & simple stuff) at the bar is going to get me better and quicker service the next time I come back up to get drinks. In this case, I'm not going up to the froyo guy three times in a sitting, so I don't tip. Same goes for restaurant tips. I typically tip rather well, but do so based on the service. I rarely, very rarely give little or no tip, but I have before for non-existent service (it was a whole thing), and have tipped incredibly well for over-the-top service. \n\nUltimately I think this comes down to why you think tips should be given out in the first place. If you don't think that people working the counter deserve a tip for just doing their job, then I don't see why asking for a tip makes the business bad since you can just say no.",
            "title_similarity": "0.703104",
            "sentiment_compound": 0.3065
        },
        {
            "id": "gv59jnf",
            "score": 1,
            "text": "Don't think about it as them asking for a tip, think of it as them giving you the option to leave a tip. It's like getting food to go and the tip area is still on the receipt. You can leave something if you want but it's not expected.",
            "title_similarity": "0.65694535",
            "sentiment_compound": 0.34
        },
        {
            "id": "gv5a24t",
            "score": 1,
            "text": "Places like Starbucks that dont even put the milk a d sugar in your coffee and expect tips? I expect my paycheck for doing your job!",
            "title_similarity": "0.827818",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gv5aflf",
            "score": 1,
            "text": "The place I work at does this and it’s so embarrassing for me. Also our customers get really confused. I wish they’d get rid of it. So I actually have to agree here",
            "title_similarity": "0.696325",
            "sentiment_compound": -0.1269
        },
        {
            "id": "gv5agaf",
            "score": 1,
            "text": "Panera's machine has been coming up for a tip for few years now and I always thought it odd since it's not a work for tips job. No idea who even gets the tips and how can I tip before I get my food. If it's shit, how do I get my tip back?",
            "title_similarity": "0.7966748",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gv5api5",
            "score": 1,
            "text": "I almost never,  tip on a to go order!",
            "title_similarity": "0.5321587",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5awan",
            "score": 1,
            "text": "I don't tip for counter service, idgaf what kind of looks they give me.",
            "title_similarity": "0.52770483",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5bmcq",
            "score": 1,
            "text": "No tips for counter service.",
            "title_similarity": "0.39187008",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv5bwb9",
            "score": 1,
            "text": "I worked as a counter person and barista at a bakery for a year. There was a tip jar. The owner told me, \"we don't really want to have a tip jar, but if we don't put it out, customers will keep asking for it.\" So, in one sense, the tip jar/option is there because people like to tip.\n\nSecondly, as others have said, I've never expected tips from a counter job. I've greatly appreciated them, but there's no expectation.\n\nNow that I have plenty of money, I always tip at these places if I have the chance. It feels good for me, it feels good for them, and it only costs a buck or two. These tip jars are a very efficient way to make everyone's life just a little bit better. My policy is to be grateful anytime someone gives you a chance to give :)",
            "title_similarity": "0.8384981",
            "sentiment_compound": 0.9876
        },
        {
            "id": "gv5c0x7",
            "score": 1,
            "text": "Aside from table service at restaurants, I generally don't tip unless the staff do something extra or I'm asking for something slightly out of the ordinary. I'll sometimes tip for takeout at the places I go to semi regularly and the staff know my name to help them out specifically.",
            "title_similarity": "0.7042503",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gv5c12f",
            "score": 1,
            "text": "Best thing about this? You don’t have to. If you don’t want to throw an extra buck or two down on a latte to someone just making it by like all of us, it’s simple. Don’t. Employee doesn’t go the extra mile and ask how you’re doing or doesn’t make you feel welcome? Just hit no tip. You’re not a bad person if you don’t and you’re not a good person if you do.",
            "title_similarity": "0.7567098",
            "sentiment_compound": 0.8626
        },
        {
            "id": "gv5c3cb",
            "score": 1,
            "text": "TIPS means  **To Insure Prompt Service**  and it is optional. If you dont feel like it, not a big deal.\n\nNot tipping has worked all over the world. Restaurants owner needs to start tipping their own employee and start paying livable wage if they care about their employee. Out of all these years, I have found that about 20% of the places are worth tipping and do a better service. Most of the waiter/waitresses show about 3-4 times tops to check on you. Its just wrong to expect 20% minimum tip for everything. I have started tipping less because there was 0% raise in 2020/2021 and inflation has caught up close to 10%.",
            "title_similarity": "0.8153701",
            "sentiment_compound": 0.7261
        },
        {
            "id": "gv5c9vf",
            "score": 1,
            "text": "...and with the counter service, these employees are making more than minimum wage.  As opposed to a waitperson at a full service restaurant, who is making minimum wage plus tips in this case..",
            "title_similarity": "0.6614179",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5cq1f",
            "score": 1,
            "text": "The point of sale system I use in my business doesn't let me get to the print receipt option until first going through the tip screen. I  honestly don't like turning the screen around for people to tip because I don't like putting people on the spot about it, but then I often get people asking me to tip after it's too late because I've bypassed that screen.",
            "title_similarity": "0.79932433",
            "sentiment_compound": -0.0284
        },
        {
            "id": "gv5d8fn",
            "score": 1,
            "text": "I agree with you. What's interesting to me is at chains now like Panera Bread and Jersey Mike's, before you pay they'll ask if you want to add a gratuity... It would be one thing, If they were delivering the food/drinks to my table and taking my order, but when I'm ordering food to go? It's weird. Coffeeshops I can understand a little more.",
            "title_similarity": "0.77970296",
            "sentiment_compound": 0.3071
        },
        {
            "id": "gv5damm",
            "score": 1,
            "text": "As someone who was a waitress, I agree. I got a tip for giving them a pleasant dining experience for an extended amount of time, bringing their food and drinks to their table, as well as anything else that they might need. I've tried explaining this to several friends, but they all think I'm an asshole because I don't want to leave a dollar tip on a three dollar coffee.",
            "title_similarity": "0.7639315",
            "sentiment_compound": 0.726
        },
        {
            "id": "gv5ddkq",
            "score": 1,
            "text": "The popular bread named place I worked at added this at the register a couple years ago and we constantly get comments about how people don’t feel like they need to tip the register person like they are the only people the money would go to. It’s also a tip for the people making your drink and making your food and cleaning the dining room and taking your trays/garbage away. Even before it was implemented at the register, I never saw anyone giving the food preparers or baristas a tip and I rarely saw the dining room person get a tip and that’s with me working there 10 years before the tipping system went into place. Now the team splits sometimes $100+ a night or so, which ends up being an extra $2, $3 a day.\n\nNot saying I disagree - I think tipping culture is crazy and everyone should be being paid a comfortable wage. But I see people saying a lot that it shouldn’t be asked at the register or shouldn’t be for register workers but it HAS made an impact on my associates lives/pay and that’s what I am for.",
            "title_similarity": "0.8275035",
            "sentiment_compound": 0.6025
        },
        {
            "id": "gv5de6s",
            "score": 1,
            "text": "If employees are paid fair wages in no way does that change tipping culture",
            "title_similarity": "0.5304419",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gv5dgpa",
            "score": 1,
            "text": "The \"tip screen\" is a default setting on the Point of Sale system (eg. Clover) that is installed at retail venues.  Most counter service employees know this and don't really expect a tip in my experience...I've even had clerks straight up tell me to bypass the tip screen.",
            "title_similarity": "0.8047191",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gv5dl33",
            "score": 2,
            "text": "I have the exact same view as you. So I say you shouldn’t.",
            "title_similarity": "0.24633308",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5dpae",
            "score": 2,
            "text": "If business payed their workers more no one would need tips.",
            "title_similarity": "0.5313787",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gv5dqhl",
            "score": 1,
            "text": "As long as there is an exception to the minimum wage for server jobs, you should definitely tip. But that exemption should be removed",
            "title_similarity": "0.69377035",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gv5dww8",
            "score": 1,
            "text": "TIPS ARE A COURTESY! NOBODY IS FORCING YOU TO TIP AND ITS UP TO YOU! \n\nDon’t let servers bully you by whining about how awful their job is, and don’t let shame stop you from tipping. That being said, don’t be a dick and not tip when you get good service.",
            "title_similarity": "0.6815021",
            "sentiment_compound": -0.8793
        },
        {
            "id": "gv5e202",
            "score": 1,
            "text": "I live in one of the most expensive cities in the world and make a good wage - I know that most of the people who work at my local coffee shop usually have around the same college education that I have but whereas I spent 10 years working for the man to live comfortably they might be pursuing artistic and creative interests - pursuing their dreams (and even if not I used to work food/bev and it sucks).. I tip every single time no matter what. \n\nIf it helps them pay their rent for treating me with good customer service for something that I should honestly be doing myself all the better - I think of my tip as my lazy tax. \n\nI hope some of these counter folks are pursuing their dreams and someday make a living of it\n\n(Edit: and to those who don’t have a college education you still worked just as hard to pour me a cold brew so you get a dollar too)",
            "title_similarity": "0.6898167",
            "sentiment_compound": 0.9838
        },
        {
            "id": "gv5fsse",
            "score": 2,
            "text": "Can we start a movement where everyone stops tipping so that everyone working in restaurants are paid fairly instead of having to rely on tipping system? I seriously think it's unfair for customers to be supplementing these instead of restaurant owners taking full responsibility and treating everyone working fairly?",
            "title_similarity": "0.83856547",
            "sentiment_compound": -0.6966
        },
        {
            "id": "gv5gg3j",
            "score": 1,
            "text": "There are multiple places where I live that have quite expensive donuts, coffee and pastries. \n\nThey have the little screens where when you swipe you card it asks if you want to tip. Typically three choices. And none offer 10% as a choice. It’s often 15-20-25. \n\n25% tip to put a donut in a bag? Pour a cup of coffee? Gtfo!  \n\nEven 15% is too much for me. Where I get so up set is the amounts/percentages and how little is done compared to a sever at a sit down restaurant. A restaurant server takes your order brings food too you and goes back and forth and does a ton of work. Tip well deserved. But some one who I deal with once and does barely anything wants the same percentage? Nope, not me I’m done with it. \n\nSo I have a fix. I’m not a cash guy. Usually don’t have it one me. But I’ve started to make a point of keeping 1$ bills in my wallet. Instead of tipping by percentage on the screen. I make a big deal about “oh, I’ll leave a cash tip” then only throw in 1, maybe two if I spent over 15-20$.",
            "title_similarity": "0.74570346",
            "sentiment_compound": 0.3031
        },
        {
            "id": "gv5gthc",
            "score": 1,
            "text": "Let's be real. Tipping in general is bullshit and makes 0 sense.",
            "title_similarity": "0.473724",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gv5gzed",
            "score": 1,
            "text": "I got asked to tip in a liquor store. No extra service provided, they just rang up my order as a cashier. Tip feature on the debit machine. No, I am not tipping at a liquor store!",
            "title_similarity": "0.7466003",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gv5h462",
            "score": 1,
            "text": "The only place I tip at the counter is the marijuana dispensary. I really like all the employees and they have a tip jar at the counter. So whatever change I have goes in the jar",
            "title_similarity": "0.56266075",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gv5hmlg",
            "score": 1,
            "text": "I think tipping culture is a good thing. It gives the customer a bit of control over the survive they will receive. If the waiter does a bad job then they get less or no tip. They do a good job then they get a large tip. It also allows them to make way more than they normally would if they did not get tips and only paid hourly. If they do move to making more hourly then food prices would increase. So you will still be paying as though you are tipping but there is no grantee of good service.",
            "title_similarity": "0.763367",
            "sentiment_compound": 0.4384
        },
        {
            "id": "gv5hopd",
            "score": 1,
            "text": "I'm not gonna comment much. You're conflating the way our country's retail/service economy should be set up with whether or not you should tip an individual working in said economy that they can't control. Those are two different things. That doesn't mean you're wrong about either point but let's not conflate them.\n\nI tip because I try to be kind and that's the way our current economic system is. These people working there often make barely any money without the tips and for many of them it's the difference between affording groceries or not. Whether or not that should be the case is a different story. But I'm going to tip Steve a dollar when I go there because he's super nice and he gets minimum wage with no health insurance or benefits and I like him. At many coffee shops (including the Starbucks I worked at), we constantly cleaned tables, sampled pastries, brought out drinks (especially to customers that were unable to carry them to the table like disabled customers). Also, your point about what waiters do is weird to me. Because you say they do all this with the kitchen staff, but these people ARE the kitchen staff. There's no separating. We do the counter, do the cleaning, do the cooking, do the inventory, do the managing (at least at Starbucks and other places I've gone to, the manager is working the front and sometimes maybe not allowed tips but will dish them out to the staff). Isn't that more tip worthy? It would be like you could tip the kitchen staff. Plus we clean everything all the time while people/families/(maybe you?) spill crumbs and drinks everywhere and leave napkins all over the place and sugar all over the counter.\n\nAnd as someone who's worked jobs like this (Starbucks) I would run around like a mad man and help 30 customers an hour minimum. Stocking tons of boxes, making drinks and (preparing food) at lightning speeds that we were judged pretty harshly on), etc. We'd spend hours while working deep cleaning, mopping, cleaning toilets (at least someone would have to every day), throwing out garbage, cleaning floor mats, shoveling outside when it snows, dealing with hostile/drunk/etc. customers. And that doesn't even count busy days. Lines out the door, street fairs, holiday parades, etc.\n\nI guess I have said a lot.\n\nAnd also. This is new to you? I worked at Starbucks in 2004-2014 and we had a tip jar from the day I started. And Dunkin Donuts had a tip jar since then at least too because I would go there and tip there also. I actually don't think I've ever gone to a coffee shop that didn't have a tip jar sitting around unless it was a specific corporate one where they were forbidden to except tips (Barnes and Noble was like that for a while). This was NFC payments which is what I assume you meant by POS systems.",
            "title_similarity": "0.8361776",
            "sentiment_compound": 0.9912
        },
        {
            "id": "gv5hqtk",
            "score": 1,
            "text": "Tipping is a way of not paying workers for what they do.  Businesses are in the business of making money, the goods and/or services they provide is just a way to get that money. \n\nYeah being forced to tip in order not to feel like an asshole is psychological coercion.\n\nIt is the whole economic system that is corrupt and it is getting worse, not better.",
            "title_similarity": "0.8008924",
            "sentiment_compound": -0.8134
        },
        {
            "id": "gv5i2d2",
            "score": 1,
            "text": "The US government doesn't see them as people. Disparage the poor but play the facade like they could work harder for money, like circus acts. Tipping is another way to concrete sizeable wage gaps. The US minimum would statistically be federally $45 an hour in 2019 if equality existed.",
            "title_similarity": "0.7035788",
            "sentiment_compound": 0.7615
        },
        {
            "id": "gv5i54d",
            "score": 1,
            "text": "Agreed, mostly. \nI’m different than most redditors however, in the fact that I’m not super liberal, so I don’t think just “paying them more” will be better(or happen, or work).I prefer a tip culture where i can get something cheap and deem whether or not that customer service was worth it. Sometimes 1.5 minutes with a customer service worker is 10x better than an hour at a restaurant. \n\nAlso any tip paid in cash GENERALLY isn’t put on taxes (as an ex cash employee) and that makes a pretty big difference to the young and the poor. \n\nIt would be awesome if we as a culture would move to heavy tipping based on experience. As an ex 10-year salesman I think it’s nice to get paid based on your work when you care more, are kinder, and do your best. Most employees at most places are shit. I wish in customer service we tipped more to the people who helped us. I worked for comcast for a couple years, would help people a TON and the culture isn’t to tip, but when people did it showed me that they truly appreciated that I cared and took care of them. We got paid $50k a year so us getting paid well really didn’t make the employees do a better job. A different culture might fix that. Who knows",
            "title_similarity": "0.74225765",
            "sentiment_compound": 0.9864
        },
        {
            "id": "gv5ib3c",
            "score": 1,
            "text": "I did a whole thesis in college about the work culture in fast casual restaurants and to be honest tipping promotes a toil work environment. When you're underpaid you go out of your way to make tips so you end up tolerating sexual harassment, verbal abuse and eventually mental health goes to shit. Plus customers know they have the power over the amount for tip and will make you \"work\" for it. Simply tipping culture should be eradicated and worker should be paid a liveable wage. In many places in Europe an Asia its rude to tip because its implying that the worker is poor and needs that extra 10%-20%.",
            "title_similarity": "0.8686462",
            "sentiment_compound": -0.8979
        },
        {
            "id": "gv5itnr",
            "score": 1,
            "text": "You got half of this right. It has indeed increased with the use of tablet Point of Sale solutions. But the reason why the software company built this function is that it increases the total transaction value, and therefore, the credit card fees they earn. The business owners just go with it and don’t change it or remove it (which they can do).",
            "title_similarity": "0.60792905",
            "sentiment_compound": 0.8324
        },
        {
            "id": "gv5jfal",
            "score": 1,
            "text": "Why? You don't have to, and you're getting to put money directly to the workers. \nI think of it as an option for people making good money in some professional job that really are happy to spare it. \nIf you're at all tight or budgeting, skip it!\n\nEdit: and it's 100% the workers that want this. Not the business owner. \nSo I'd call it a win.",
            "title_similarity": "0.63799345",
            "sentiment_compound": 0.9056
        },
        {
            "id": "gv5jk2o",
            "score": 1,
            "text": "And they are asking you to tip pre-service! Like ordering a pizza or sandwich, you pay, tip; then it comes out wrong, or twenty minutes late, but you've already tipped them for the opportunity to be let down.",
            "title_similarity": "0.76144695",
            "sentiment_compound": 0.5411
        },
        {
            "id": "gv5jq58",
            "score": 1,
            "text": "I remember working retail \n\nOf 100% of customers are presented with a “yes or no” extended warranty, 6% will just choose yes and not even read about it. \n\nThat’s why.",
            "title_similarity": "0.6127838",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gv5jtz5",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14687821"
        },
        {
            "id": "gv5jwik",
            "score": 1,
            "text": "I mean, I don't think it *makes sense* either but what really makes sense about the economy or wealth distribution? It's a wildly unfair system. What really doesn't make sense is you drawing the line in an arbitrary spot. The person behind the counter should make more, traditional waiters should make more, you should make more, everyone should make more besides large-cap majority shareholders but life goes on. At the end of the day you're just deciding whether or not you want to give a worker an extra dollar of yours, the context is really meaningless. You don't have to tip, but by providing an opportunity the employees get more tips, some people are happy to do it cause maybe they're rich. It's just about giving people an opportunity. If you don't want to, just don't, or just tip a dollar, you'll never be held accountable.",
            "title_similarity": "0.8324665",
            "sentiment_compound": 0.9489
        },
        {
            "id": "gv5k0qe",
            "score": 1,
            "text": "I just stopped going to those places.",
            "title_similarity": "0.38087153",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gv5kdfl",
            "score": 1,
            "text": "Until the system changes, I’ll will keep tipping. Otherwise they aren’t getting paid right. \nSome servers make so much, they will never be paid in a way to match that. \nBut overall I personally don’t mind spending slightly extra to tip someone. It just does not bother me.",
            "title_similarity": "0.63223535",
            "sentiment_compound": 0.3724
        },
        {
            "id": "gv5ll1l",
            "score": 1,
            "text": "I always tip 1 dollar at the counter. Here ya go",
            "title_similarity": "0.471966",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5lo8v",
            "score": 1,
            "text": "I manage a major pizza chain and we ask for tips. Most go to the cooks who work minimum wage because major companies can't be bothered to pay more. Most of my employees can't get better jobs due to health issues (got a guy who was run over and his legs are now crooked as a result. And a driver who had major heart surgery at 30. He's been with us for about 6 years and has to follow up on it twice a year.) But I can't control how much they are paid so I encourage them to ask for tips and for customers to tip. And most of them are cross trained so someone at the counter may jump on the table to takeover for someone who might now want to be on the table anymore.\n\nThey show up when the food industry as a whole right now is struggling to keep people working. I think they deserve something for that and the damn companies aren't going to give them their due rewards. Without them, you won't get your fast food items. Without them, the company fails.\n\nCost of housing is getting crazy where I am. Minimum wage is $8.65 but a 1 bedroom is about $850 on average. I've witnessed some employees splitting an apartment just to save money. \n\nHell, I'm salary but after the hours I put in, it only averages about $15 to $18 an hour. I'd ask for tips too if I could.",
            "title_similarity": "0.7383014",
            "sentiment_compound": -0.6551
        },
        {
            "id": "gv5ltka",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv5me2o",
            "score": 1,
            "text": "I’ve worked enough jobs in my younger years to know who works for tips and under minimum wage then those who work a cash register and has tips at the end of the receipt.",
            "title_similarity": "0.54708886",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5miis",
            "score": 1,
            "text": "So don’t tip",
            "title_similarity": "0.14843704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5nbpd",
            "score": 1,
            "text": "Amen. Personally, I think businesses should have to disclose when employees are paid below minimum wage for tipping (at many of these places you mention they are not, yet I now see 30% tip rate as the default setting now....), and that you should not be allowed to request tips before service is rendered (it's beyond uncouth into the range of different service for different people). Pay better, charge full price, and don't request tips for minimal or not yet provided service.\n\nThis racist, sexist history of subpar tip wages should go, too. It's a ridiculous legacy, which is more often used a marketing gimmick (like $9.99 dinners at Chili's and mandatory tipping of room stewards on Carnival to advertise untrue prices) foisting risk on employees who are most vulnerable.",
            "title_similarity": "0.7835896",
            "sentiment_compound": -0.7386
        },
        {
            "id": "gv5nd4r",
            "score": 1,
            "text": "I worked all morning to prep your food. Ive been cooking all day and now I’m making your food just for you. Give me two dollars so I can get a fucking soda",
            "title_similarity": "0.68001294",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5nm5h",
            "score": 1,
            "text": "Then if you know that these people are being exploited by their bosses...why consume the service and contribute to their exploitation? If you really hated it, you wouldn’t consume the service, and you would vote for politicians that change the laws that allow for employers to exploit their employees. \n\nBy still going to these places and agreeing to the prices that you agree to, but not the tip, you are giving a pat on the back to the owner you supposedly disagree with, and doubly screwing the employee along with their employer. If you hate it so much, don’t consume the service, you get to bitch about how you don’t like to tip but still expect the service, but servers don’t get to not serve you without the tip. And if you think the job is so easy, then go work it for a month and tell me you still feel that way.",
            "title_similarity": "0.79908323",
            "sentiment_compound": -0.7639
        },
        {
            "id": "gv5odhh",
            "score": 1,
            "text": "just don't tip people if you don't want to for counter service.",
            "title_similarity": "0.4854508",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gv5ogc1",
            "score": 1,
            "text": "There have been a couple of places around where I live that have started doing this, but I've just stopped going there. I don't really love the whole idea, it makes me feel uncomfortable, but I don't really need to eat out so I just don't worry about it.",
            "title_similarity": "0.64584696",
            "sentiment_compound": -0.8185
        },
        {
            "id": "gv5ok13",
            "score": 1,
            "text": "I I recently saw this at a mini grocery store that also sold coffee. Can you imagine buying like $100 worth of groceries and then paying $20 on top of it just because? I got a small $8 coffee and they swung the machine around so I could add a tip. Really awkward. Sick of this tipping nonsense in America.",
            "title_similarity": "0.75651145",
            "sentiment_compound": -0.4536
        },
        {
            "id": "gv5ol72",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv5oybq",
            "score": 1,
            "text": "I 100% agree. Not wrong",
            "title_similarity": "-0.04971335",
            "sentiment_compound": 0.6192
        },
        {
            "id": "gv5p9ot",
            "score": 1,
            "text": "I agree, I still tip, but I differ that people should just pay their workers better. I just don’t like that it’s on the customer if the worker makes enough.",
            "title_similarity": "0.7265674",
            "sentiment_compound": 0.8047
        },
        {
            "id": "gv5phat",
            "score": 1,
            "text": "I tip at jersey mike's cause the employees are friendly and have conversations and joke with me. And they toss in cookies occasionally.\n\nI don't too at subway cause the employees always look like I am interupting them...",
            "title_similarity": "0.64630234",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gv5pip0",
            "score": 1,
            "text": "Don’t wait staff at sit down restaurants make significantly less per hour than counter service? In the 80’s I worked both types of jobs. As a waiter I made $2.55/hour plus tips. As a counter worker I made minimum wage $4.50/hr. I never expected a tip then. Why do they expect tips now?",
            "title_similarity": "0.6822313",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5plxv",
            "score": 1,
            "text": "I think tipping culture in general is bullshit. Your employer pays your wages, not me. A tip is something you get for outstanding service and because you made my experience special. Me showing up to a restaurant should not automatically mean I have to tip you.\n\nIf you're upset that people don't tip well then you're brainwashed by an employer and culture that tells you to feel that way. Your employer pays your wages. Your employer makes a LOT more money than you do. Why would you be ok with them making all that profit, not paying you, and then blaming the customer who already paid a good price for the consumed goods.",
            "title_similarity": "0.84209013",
            "sentiment_compound": 0.5083
        },
        {
            "id": "gv5qfyx",
            "score": 1,
            "text": "I don’t think this will change your mind but I want to put it out there for others to know too. \n\nFirst of all as someone who worked in food service multiple times I agree tipping culture in the US is messed up, people should just be paid a regular wage. \n\nAnyway. When I worked a coffee shop, we don’t just do counter service/pour your coffee and hand it to you. We’re doing the early morning food prep, we’re cleaning dishes and counters and tables, we’re making the little containers of cream cheese or peanut butter for your bagels, we’re hand filling the little tea bags we serve, we’re making the cold brew and iced tea ourselves (meaning we don’t just buy these things). This doesn’t go for every shop obviously, but in a lot of small cafes that aren’t chains, we do way more than just pouring the coffee. Again though, the wage system in America does desperately need to be fixed.",
            "title_similarity": "0.86475503",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gv5r1de",
            "score": 1,
            "text": "If someone touches my food they’re getting a tip. IDC if it’s sit down or take-out. If I’m not sitting down, these servers have taken extra time to box up my stuff and it’s ready when I am. This comment is only in relation to take out restaurant orders; I don’t know what you’re dealing with with froyo places.",
            "title_similarity": "0.7703203",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv5r3u5",
            "score": 1,
            "text": "I always feel weird about tipping for a take out meal. There was no service provided like a waiter. Am I suppose to tip?",
            "title_similarity": "0.7999626",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gv5s13l",
            "score": 1,
            "text": "I live in a city where the default tips for counter service are 25% on the little Square screens.",
            "title_similarity": "0.39839572",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5s21n",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv5sawx",
            "score": 1,
            "text": "So just don't tip? I don't get why people get so offended like dog just don't put your money in the jar.",
            "title_similarity": "0.6791271",
            "sentiment_compound": 0.0418
        },
        {
            "id": "gv5t2bd",
            "score": 1,
            "text": "Is there even a standard for this percentage wise? I’ve tried to be generous during covid but in normal times I would sometimes and not others.  My go-to spots are mostly fast casual, pick up and leave.",
            "title_similarity": "0.580837",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gv5t2qx",
            "score": 1,
            "text": "I don't think anyone deserves tips. Why should I pay extra money for no reason, when I should be expecting the same level of good service regardless of whether I tip or not? The only reason I do tip is because I know they'll spit in my food if they know I don't tip. That's what tipping has turned into, not a reward for outstanding service, but a bribe to not get crappy service. \n\nHowever, with that said, if waiting staff were to get the same flat wages as everyone else, then tipping shouldn't be the requirement it is now. Otherwise, it wouldn't be fair, not only to the other employees in the restaurant, but othet jobs that do just as much work in their own field but don't get tips.\n\nSo by extension, I agree, counter service should not be expecting tips at all.",
            "title_similarity": "0.81162906",
            "sentiment_compound": 0.3907
        },
        {
            "id": "gv5tbyv",
            "score": 1,
            "text": "Actually let me rephrase that. At 12 bucks an hour pre pandemic and pre min wage increase at 43 hours a week i made enough to:\n\nPay my rent, car insurance, a car payment, two 4k tv payments, my phone bill which included financing on the newest galaxy and smart watch, highspeed internet w no data cap, 3 streaming services, xbox live, enough savings to survive 8 months of covid paying all those bills w/o even digging into unemployment, and still give my grandparents money and feed and clothe myself and my dog and i still made enough to have a wife and maybe even one kid. \n\nThats a LOT. And I had guns and went shooting too which is an expensive fucking hobby. I mean, NOW at the same exact rate of pay i have about half that shit. And luckily dont have to pay rent anymore thank god. One of the tvs is paid of thank fuck. But i had to downgrade my whole lifestyle. I mean, i dont mind. Im not some yuppie. But its a noticeable change and I really wish more people knew the logistics of this and how much the fed and the states actually take out of our paychecks for ur precious little social programs that dont do shit to curb the homeless problem. Half my job these days is kicking out homeless people who are legitamately threatening to kill me and starting fires. Im not even fucking kidding. I have to stay an extra 3 hours now at this job just to make sure the homeless dont wander in and harass the guests and start fires to escape the cold or take a dip in our pool and shoot up in someone car. I remember when I used to have compassion. That was right about the time of the last recession. Now I look around and I see two people. Workers and lazy fucks. The only difference between celebs and politicians and CEOs and the homeless is LUCK. \n\nU dont need luck if u have skill and work ethic and u certainly dont need to violate ethics and steal peoples money using the levers of government if ur willing to get up off ur ass for just 8 hours 5 days a week. Thats seriously not a lot.... \n\nThe economy was fine until everyone started fucking with it. It really was.",
            "title_similarity": "0.5618616",
            "sentiment_compound": -0.9346
        },
        {
            "id": "gv5ttgp",
            "score": 1,
            "text": "The staff you are referring to are making at least minimum wage (not tip wages). Don’t give them a dime.",
            "title_similarity": "0.5495384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5uehp",
            "score": 1,
            "text": "If you have to ask for a tip, chances are you didn't earn one",
            "title_similarity": "0.3961326",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gv5v7jv",
            "score": 1,
            "text": "You should try living in Canada. We have the same expectation/obligation to tip as Americans but the minimum wage workers still are legally required to be paid minimum wage plus keep whatever they get when tipped. I work construction yet if my friend gets a minimum wage job THAT GETS TIPPED they will definitely be earning more than me. Please tell me; HOW IS THAT FAIR? I bust my ass quite literally and my knees and my hip which worker's comp just outright refuses to help me with, even just a simple visit to the physiotherapist or chiropractor because they said so.\n\nNow you live in America where minimum wage worker's wages are supplemented by tips so quite your bitching and stop being a cheap ass and just fucking add the 15% or whatever already you twat.",
            "title_similarity": "0.75239027",
            "sentiment_compound": -0.5374
        },
        {
            "id": "gv5vo1l",
            "score": 1,
            "text": "I tip 15% minimum. How much higher is goes is up to you. If it’s horrible service I just don’t go back to their section. But going thru a donut drive thru and they have a tip jar to hand me a donut and take my money no ty.",
            "title_similarity": "0.79419696",
            "sentiment_compound": 0.0644
        },
        {
            "id": "gv5vz08",
            "score": 1,
            "text": ">employees should just be paid fair wages\n\nthey are. this is propaganda by waiters/tippers because they make a ridiculous amount of money from tips. if they don’t get any tips they get a normal wage",
            "title_similarity": "0.7374297",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv5w4w2",
            "score": 1,
            "text": "It's never wrong of them to ask. It's a little pushy, and some go overboard with it. Some say nothing, and it's just the screen on the card reader.\n\nBut tipping is, or rather SHOULD BE, about great customer service. The person at the counter is still serving you. Maybe on that day, that counter person knocked your socks off. Maybe on that day, the customer is feeling extra generous. It never hurts for them to ask. Making the customer aware that tipping, as it should be applied, can be applied anywhere might lead to people getting away from the mindset of tipping only in certain settings (sit down restaurant, hairdresser, etc) and instead focus people on tipping anywhere IF they get great service.\n\nYou're right, the system needs to change, but the way the average consumer thinks about tipping will need to change as well. \n\nIt should be a reward for a job well done. A reminder to the customer to at least consider it is ok.\n\nAnd you never have to tip anyone, anywhere, if you don't feel so inclined.",
            "title_similarity": "0.73830724",
            "sentiment_compound": 0.9884
        },
        {
            "id": "gv5wfyq",
            "score": 1,
            "text": "I get your point. But even with self service someone made that donut, and in those situations those tips are generally split amongst all of the staff not just the cashier. But no one really expects you to tip, the touch screen thing is just part of the system it's there whether the employees want it or not and it gives the option to customers who don't carry cash to tip if they feel like they want to.",
            "title_similarity": "0.8402562",
            "sentiment_compound": 0.3291
        },
        {
            "id": "gv5wko0",
            "score": 1,
            "text": "The ice cream place by me has a drive thru and they always ask me out loud, “Would you like to leave a tip?” And it’s always so awkward when I reply, “Not today.”",
            "title_similarity": "0.73869944",
            "sentiment_compound": 0.0474
        },
        {
            "id": "gv5wyfb",
            "score": 1,
            "text": "Just don't tip, then. You don't have to, and if you really believe it's wrong, stand by that.",
            "title_similarity": "0.3337213",
            "sentiment_compound": -0.5209
        },
        {
            "id": "gv5wzl9",
            "score": 1,
            "text": "Due to the unlivable wages the market has deemed appropriate for these positions, I do feel it is necessary to tip for those who can afford it as long as the service is not poor. In times where I have been in a financially strong position, especially during COVID, I have tipped counter employees. In times where I have been struggling, while I would have liked to, I have not.\n\nBasically I feel responsible my fellow working class citizens as I can, since capitalism as we know it has not been providing the appropriate wages.\n\nI think the best way we can change this as private citizens is to elect politicians who will fight for workers rights and to patronize establishments who support fair wages.",
            "title_similarity": "0.75253195",
            "sentiment_compound": 0.9294
        },
        {
            "id": "gv5xur2",
            "score": 2,
            "text": "\"Uh uh, I don’t tip. No, I don’t believe in it. … Don’t give me that, if she don’t make enough money she can quit. … I don’t tip because society says I have to. All right, I mean I’ll tip if someone really deserves a tipping, if they really put forth the effort, I’ll give them something extra, but I mean this tipping automatically, it’s for the birds. I mean as far as I’m concerned they’re just doing their job. … She was okay. She wasn’t anything special. … Look I ordered coffee all right? Now we’ve been here a long fuckin’ time, she’s only filled my cup three times. When I order coffee I want it filled six times. … The words “too fuckin’ busy” shouldn’t be in a waitress’ vocabulary. … Jesus Christ, these ladies aren’t starving to death. They make minimum wage. I used to work minimum wage and when I did I wasn’t lucky enough to have a job that society deemed tip worthy. … You know what this is? It’s the world’s smallest violin playing just for the waitresses. … So is working at McDonald’s but you don’t feel the need to tip them do you? Well why not? They’re serving you food. But no, society says don’t tip these guys over here, but tip these guys over here. That’s bullshit. … Fuck all that. … I mean I’m very sorry the government taxes their tips. That’s fucked up. That ain’t my fault. I mean it would appear that waitresses are one of the many groups the government fucks in the ass on a regular basis. I mean show me a piece of paper that says the government shouldn’t do that, I’ll sign it, put it to a vote, I’ll vote for it, but what I won’t do is play ball. And this non-college bullshit I got two words for that: learn to fucking type, ’cause if you’re expecting me to help out with the rent you’re in for a big fucking surprise.\"\nThis basically sum it up Pink?",
            "title_similarity": "0.6985572",
            "sentiment_compound": -0.9723
        },
        {
            "id": "gv5y5kg",
            "score": 1,
            "text": "You can always ask for anything, closed mouths don’t get fed.\n\nIf you truly don’t believe it’s worth tipping, then just don’t do it. The fact that you think it’s awkward or uncomfortable to select “no tip” indicates that you subconsciously think you should tip. I assume that indicates you make more than minimum wage at your job",
            "title_similarity": "0.72362673",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gv5yabr",
            "score": 1,
            "text": "Imo no matter how shit a service is, the person deserves minimum wage and therefore atleast a little tip ( if they are making less than minimum wage like a driver or waiter). A cashier wouldn't get a dock in pay because they didn't give a shit so why should a waiter?",
            "title_similarity": "0.7479687",
            "sentiment_compound": 0.09
        },
        {
            "id": "gv5yz6s",
            "score": 1,
            "text": "Pretty much all these comments show just how deep into our Stockholm Syndrome we are with tipping. We Americans have some weirdly specific blind spots we'll bend over backwards, and then some, to defend.\n\nPut simpler, you don't need to change your mind because tipping is insane and just a way for employers to perpetuate worker exploitation and financial insecurity.",
            "title_similarity": "0.7378221",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gv5zjqn",
            "score": 1,
            "text": "I tip when I'm being a difficult customer. Which is alot.",
            "title_similarity": "0.5237969",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gv5zlll",
            "score": 1,
            "text": "You seem cheap",
            "title_similarity": "0.096625015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv5zlyn",
            "score": 1,
            "text": "And who are these assholes that think you should tip before you get your product? (I'm looking at you online food orders and delivery services.)",
            "title_similarity": "0.7656071",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gv607p9",
            "score": 1,
            "text": "Totally agree.",
            "title_similarity": "-0.12167058",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gv60cag",
            "score": 1,
            "text": "Do you tip your bartender ?\nA barista is just an a.m. bartender.\nJust sayin.",
            "title_similarity": "0.6682793",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv60ry5",
            "score": 1,
            "text": "OP has no idea how absolutely soul crushing it is to work in a coffee / donut shop. 90% of the people are rude just because  \"they haven't had their coffee or breakfast yet\". Not to mention, baristas are expected to memorize entire orders from the dozens of regulars we see every day so we can get them out as fast as possible so they MIGHT leave a tip that's gonna be split between EVERY EMPLOYEE. The fact that the P.O.S ask if you want to tip, is because some people actually do want to, but just dont have cash. The barista, sells clerk, whatever on the other side isnt judging you on whether or not you leave a tip. However, leaving a tip can in fact make your next visit even better, because the staff will know you arent one of the usual assholes and will put even more effort into providing you with better service.",
            "title_similarity": "0.804857",
            "sentiment_compound": -0.1776
        },
        {
            "id": "gv60vlt",
            "score": 1,
            "text": "I agree for the most part. The only problem is that employers do not agree. A friend works for a pizza place as the cashier/order taker and only gets paid $7/hr because they are a \"tipped\" employee. Yeah if the cashier doesn't make enough in tips + hourly to cover minimum wage then the owner has to make up the difference. But still, minimum wage here is only $8.65/hr. So even at minimum wage you can't live off that. Then the fact they are open from 4pm-10pm daily means they don't even work full days or get 40 hrs/week. So yeah, she really depends on the tips. \n\nSay what you want about the situation, those counter employees typically DO rely on the tips that a few people do give to the counter employee to make ends meet. It is what it is. I never tipped counter employees at all until my friend told me how it works for her. Hate the problem, but don't take it out on the person who is just trying to get by however they can. $2 isn't gunna hurt ya lol. So that's what I do now, if there's a tip jar or place on the receipt, I tip a couple $. Makes the person brighten up and makes me feel a little better. 🤷‍♂️",
            "title_similarity": "0.8119534",
            "sentiment_compound": 0.9288
        },
        {
            "id": "gv616qu",
            "score": 1,
            "text": "I think these POS systems are trying to guilt trip you into paying more than the menu price for something that is not a tipping job.\n\nIt is only awkward if you feel bad when you press \"no tip.\"\n\nJust remember that you wouldn't feel bad at a normal register, so why feel bad at this one",
            "title_similarity": "0.799314",
            "sentiment_compound": -0.7972
        },
        {
            "id": "gv61cv1",
            "score": 1,
            "text": "Then don't tip?",
            "title_similarity": "0.18127154",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv61wir",
            "score": 1,
            "text": "I for one get OP’s point. I hardly ever go out for lunch, but recently went to a Jersey Mike’s and when I went to pay I was presented with a tip option. You wouldn’t tip at Burger King, Taco Bell or McDonald’s, you don’t tip in drive through’s, why would I tip at jersey mikes or at Starbucks for that matter? \n\nPoint in fact, you don’t tip at Lowe’s or Home Depot, you don’t tip when you buy a new pair of shoes at the mall, you don’t tip at Macy’s. \n\nPeople working waiter jobs are paid under minimum wage and count on tips. Counter workers are paid at least minimum wage.",
            "title_similarity": "0.74624884",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gv61y8a",
            "score": 1,
            "text": "Wait, you guys are going outside?",
            "title_similarity": "-0.016859377",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv62dad",
            "score": 1,
            "text": "Absolutely ridiculous.",
            "title_similarity": "0.05732116",
            "sentiment_compound": -0.4201
        },
        {
            "id": "gv62gom",
            "score": 1,
            "text": "I always tip on coffee coffee. What I mean by that is Americans or a latte at my local spot, the way I see it is here in Canada we are expected to tip a buck a beer (at least that’s how I do it in Toronto) but coffee is in my opinion often more of a skill than pouring a beer and these people make way less than a bartender or server. I guess it’s Ike share the wealth. I don’t tip at timmyhoes or pretty well other places, maybe at a sandwich spot or something more involved. That’s my rationale.",
            "title_similarity": "0.7624204",
            "sentiment_compound": 0.9331
        },
        {
            "id": "gv62tjc",
            "score": 1,
            "text": "My husband used to work in bars. I’ve only lived in the states for 11 years, so it’s so weird to me - so they put you on their schedule, they don’t give you any benefits (which, as a foreigner, I was shocked to find out you can’t afford to go to a doctor), and then you essentially get paid directly by customers. So... You’re attached to a place that barely even pays you? And apparently if you’ve made a certain amount in tips they actually don’t have to pay you anything at all? AND for some reason there is different minimum wage for tipped and regular workers? Like... it’s the law that customers subsidize the wages. Don’t even get me started on different minimum wage that depends on your age. What the ACTUAL fuck.",
            "title_similarity": "0.7717826",
            "sentiment_compound": -0.4786
        },
        {
            "id": "gv62y1h",
            "score": 1,
            "text": "Agreed with OP",
            "title_similarity": "-0.091123335",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gv63nop",
            "score": 1,
            "text": "Yea not for counter service, I normally throw in buck but if they asked me I’d pass",
            "title_similarity": "0.61862034",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv648mj",
            "score": 1,
            "text": "It depends on how they get paid for me. If they get paid a wage I’m not gonna tip but if the place is gonna cuck them for like 2 dollars an hour like at restaurants you have to tip",
            "title_similarity": "0.7525376",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gv64b64",
            "score": 1,
            "text": "Any goofballs that think tipping is only about subsidizing wages clearly know nothing about incentives.",
            "title_similarity": "0.7239813",
            "sentiment_compound": 0.1872
        },
        {
            "id": "gv64eu4",
            "score": 1,
            "text": "What I find sneaky in this situation is when the owner is working on the floor and the employee has to share the tip with the owner.  My local Baskin Robbins for example.  I always left the change.  My order is $8, you get $2 from a ten.  Recently my daughter's co-worker's daughter started working there.  I find out that the woman that I thought was a manager working nearly everytime I go in is actually the owner. The jar starts out with $5 in ones and change to encourage tipping.  (Monkey see monkey do).  When the girl starts her shift the tip jar is discreetly changed.  That tip jar is counted at the end of the girl's shift and split between her and the owner.",
            "title_similarity": "0.7469926",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gv64gxi",
            "score": 1,
            "text": "I need that meme where the character puts its finger up to interject then puts its finger back down because a good point was made.\n\nI am a big proponent of tipping at full service restaurants and bars. I worked in the industry for a long time and made a good living from tips.\n\nBut I also find it strange when I'm not receiving that level of service and there is a tip jar. Especially as OP says when you're only dealing with them for a minute. \n\n&#x200B;\n\n&#x200B;\n\nHere's what I find very strange. And I have to be vague because this is such a specific situation. A friend of mine was working for a specialized delivery service. Basically you order a product that has to be direct delivered by hand because it was fragile. So they'd wait until 20 or 30 units were ready to ship and this person would plot a road trip to deliver the items at each buyer's address across several states. Obviously shipping wasn't free. Each buyer paid $X for that shipping service. My friend was on contract which means they were given a certain amount per item to deliver. I think a truck was provided. But they had to pay gas, hotel, and all road expenses out of pocket or out of the fee they were paid to deliver. They said the way they actually made money was when the buyers would tip this them. I told them that I would have never thought to tip them and they got upset by me saying that. I explained that the way I view it and the way I think most people would view it is I already paid the delivery fee, which I believe was several hundred dollars in this case. Why on earth would I tip on top of that? They told me that when people didn't tip they didn't actually make anything doing it. I thought this was basically a fucked up business model by the person that hired them.",
            "title_similarity": "0.76321995",
            "sentiment_compound": 0.5869
        },
        {
            "id": "gv64p37",
            "score": 1,
            "text": "Fuck that man! Why would you be expected to tip for counter service!? What the fuck are you tipping for? Just because? 🤷‍♂️",
            "title_similarity": "0.67181015",
            "sentiment_compound": -0.8452
        },
        {
            "id": "gv64scp",
            "score": 1,
            "text": "I wouldn’t say you should tip every time because you’re right why tip 3$ for sixty seconds of work well maybe not a whole three dollars but some change if u get it or a dollar depending on how genuinely nice the employee is , if they ask how your doing and say hey when you walk in a tiny tip is not really much to ask for. Not every employee you come in contact with will be so nice and caring or make sure your order is actually right , I’d be damned if I tipped the local McDonald or Taco Bell  cause they get shit wrong every time",
            "title_similarity": "0.81519485",
            "sentiment_compound": 0.6564
        },
        {
            "id": "gv65gmo",
            "score": 1,
            "text": "I think the emotional labor is the worst part for servers. I haven't been a server, but a busser and I got nauseas everyday before I went in to that job. being treated like shit and expected to be kind back is draining on an individual. these people are dealing with virtually every complaint that customers have about the company as a whole and the establishment specifically. they deserve some kind of compensation for that burden. I don't think it should be based on the subjective opinion of the guests they serve, but they shouldn't make almost nothing hourly and rely entirely on tips to survive financially",
            "title_similarity": "0.8170185",
            "sentiment_compound": -0.714
        },
        {
            "id": "gv65k0y",
            "score": 1,
            "text": "I don't think it's wrong specifically because you can just enter 0 or press No Tip. If there was no way to complete the transaction without a tip, that would be wrong. If they verbally ask \"would you like to tip me?\" that's wrong. But simply including the option at the end of the transaction is not wrong.\n\nPersonally I enjoy tipping people whenever I can. I make decent money and a few bucks will mean a lot more to them than it will to me. Just a way of paying it forward to someone that I personally feel is working hard. If they *did not* have an option to leave a tip, I'd probably be irritated by that.",
            "title_similarity": "0.6355368",
            "sentiment_compound": -0.0108
        },
        {
            "id": "gv65ugh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1134"
        },
        {
            "id": "gv662iq",
            "score": 1,
            "text": "Unfortunately the US tipping system makes it standard for an employer to pay them less and promise tips to improve their perceived hourly rate. It shifts the burden onto the consumer which is wrong- depending on who you ask, but at the moment it /is/ the system.  \n\nThis is less popular in corporate counter service because big biz can afford to either pay their employees more or shuffle people from one identical store front to another if they don’t want to stick around. For small business tipped wages cuts cost which is EVERYTHING esp given the large over head of food services. To go to a Liveable Hourly the prices on the menu usually get hiked which can be a dangerous move with corporate competition that is able to cut cost elsewhere to keep good cheap. \n\nAs to why the tip jar is even warranted... In most of those places the counter employees are continually stocking and maintaining stations (ie with froyo and coffee service) and/or prepared the goods you are receiving. While it’s a minute transaction they prepared the whole storefront for you.... They don’t just hand you a donut. \n\n\nSo even if you don’t think the burden should be on you to pay these people walking into an establishment, enjoying the fruits of labor from someone that you know is underpaid and then deciding you don’t need to tip them is totally legal but kind of makes you an asshole IMO. \n\nTLDR it’s wrong in way that would require an entire retooling of the food service system in the US. So just tip the poor counter people.",
            "title_similarity": "0.84777987",
            "sentiment_compound": -0.4659
        },
        {
            "id": "gv668pc",
            "score": 1,
            "text": "Dude, we're in a pandemic where counter service has increased and waiting tables has increased, and the culture and wage regulations haven't caught up yet. \n\nIf you're cheap or \"principled\" just keep refusing.",
            "title_similarity": "0.71292543",
            "sentiment_compound": 0.128
        },
        {
            "id": "gv66i8a",
            "score": 1,
            "text": "Some jobs are less attractive, but you want to have good people working them. Some businesses need to guarantee that their customers enjoy their visit. A tipped job can have very different outcomes depending on how nice the worker in question treats the patrons of the business. So by keeping wages subsidized by tips, as you say, you give a real incentive for that worker to not take out their bad day on the clients. You also ensure that the patrons of your business are treated in a friendly manner, because it directly relates to how the customer perceives their service and your business. The tip is good for everyone. It is a chance at better wages for the worker, it is an incentive for better customer experience for the business, and it puts real power into the customer hands.\n\nThe business might offer higher wages, sure, but the ability to tip in itself is a pretty neat concept.",
            "title_similarity": "0.688993",
            "sentiment_compound": 0.9949
        },
        {
            "id": "gv66iy0",
            "score": 1,
            "text": "As someone who has worked at these type of locations, I worked way harder at them than I do at my corporate job and got paid minimum wage. It’s not just 30 seconds to grab you your coffee. It’s getting there at 4am to grind beans, create a menu for the day, clean out the urns, pull the food from the freezer, make the teas, date all the items for expiration, count the drawers, unpack the delivery milk or supplies, take inventory, etc. It’s a lot more than people think and in general, I maybe would be $3-5 in tips for a 6-8 hour shift which didn’t even cover the parking fee I had to pay everyday to park at my work. We never expect tips or think badly of customers who don’t tip, but it does make our day when we get a tip.",
            "title_similarity": "0.69082576",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gv67mbo",
            "score": 1,
            "text": "Ok I’m not American, but are you actually expected to tip at McDonalds? Like they even have you sort your own trash after you eat.",
            "title_similarity": "0.77717626",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gv67s24",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.1140124",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gv68jw6",
            "score": 1,
            "text": "Americans: Tipping is like a science and art combined. Here's my 5 paragraph explanation.\n\nMe: It's just a gift for nice people.",
            "title_similarity": "0.40418965",
            "sentiment_compound": 0.802
        },
        {
            "id": "gv690z8",
            "score": 1,
            "text": "I used to rip $1 for coffee and 10% on take out.  I live in a state with a state minimum wage..  But in the pandemic I've been tipping 25%-40% on everything.  These people are working in risky conditions to help bring us little joy in the lockdown.  They deserve it.\n\nSo yeah, during the pandemic you should be tipping because these people have been showing up everyday and exposing themselves to an unnecessary risk just to serve you.",
            "title_similarity": "0.7459091",
            "sentiment_compound": 0.7656
        },
        {
            "id": "gv69mua",
            "score": 1,
            "text": "I agree that tipping should go away and it is rooted in a racist history that came from trying to suppress wages of black people in America post Civil War. \n\nYou should still tip people if there is an option to because your personal feelings about tipping doesn't change the fact that they often still get minimum wage or close to minimum wage (which is a starvation wage.)\n\nIf you truly believe tipping needs to go away then you need to assist in efforts to provide everyone with a fair and liveable wage with benefits like healthcare, paid maternity/paternity leave, etc.\n\nYou are not sticking it to the \"man\" or coffee shop owner. You're harming someone who is spending 5 to 10 minutes making you a luxury latte who then has to go work a 2nd or 3rd job to make ends meet.\n\nAnd serving you coffee, icecream, take out, etc, are all still services that all take effort. \n\nKinda seems like your reluctance to tip is less about the effort of serving you and more about your personal politics. If you are concerned that the employees don't make enough and shouldn't have to survive off tips maybe express that to the owner or your city council.\n\nNo one is forcing you to tip, so don't be a turd about it.",
            "title_similarity": "0.7507634",
            "sentiment_compound": -0.507
        },
        {
            "id": "gv69svx",
            "score": 1,
            "text": "Goddamn, \\*\\*\\*s are so \\*\\*\\*\\*\\* stupid!!!  The most educated generation of fucking idiots in history.",
            "title_similarity": "0.47754025",
            "sentiment_compound": -0.825
        },
        {
            "id": "gv6au0d",
            "score": 1,
            "text": "As someone who has worked in every aspect of the food service industry, tipping is always slightly awkward and counter tipping is the most awkward, no one is asking for it at the counter but it is a nice bonus and the jar is to eliminate the weird can I tip you questions, of course you can but it's not necessary but I want it. Sure we all wish for better wages and to toss out the tips completely, bit you put the onus on the owners, the profit margins in most restaurants and other service establishments are extremely narrow with labor and food costs eating into a large part of that, Americans in general are not prepared to pay the cost to offset labor with food increase. I know this anecdotally, I opened a high end food truck several years ago and charged appropriately, it did not go over well, the price was higher then the expectation. Of course during covid all this is out the window , spread the wealth of you can with people who have to but their face forward in the midst of a dangerous plague.",
            "title_similarity": "0.8645994",
            "sentiment_compound": 0.963
        },
        {
            "id": "gv6b6om",
            "score": 1,
            "text": "You definitely gotta know which palms to grease. Bartenders, Bud tenders, and the corner boys all need some fiscal love. Life is good if you follow these rules",
            "title_similarity": "0.5689151",
            "sentiment_compound": 0.886
        },
        {
            "id": "gv6b938",
            "score": 1,
            "text": "I picked up an order from a restaurant the other day. Of course, there was a spot to place a tip on the website. We didn’t tip on the website for our pickup order. When I got there to pick up, the girl had the audacity to ask me if I wanted to tip. She made it sound like she was expecting it by the inflection in the way she said: “Do you want to leave a tip on the card or in cash?”\n\nI couldn’t believe it. It was a place the rhymes with Wallive Warden btw. I got there and there was a call-in number to let them know that I was there. When I called it, someone eventually picked up and never said anything. I could just heard them talking amongst themselves about all the to-go orders. I just felt like mentioning that bit.",
            "title_similarity": "0.77610147",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gv6bbja",
            "score": 1,
            "text": "I don't think coffee shops should necessarily be included in this. I can understand the logic for places where I can walk behind the counter and easily provide the service myself, but coffee shops don't fall into that category. Most people can't step up to an espresso machine and make a perfect latte. It might only take 60 seconds for you to get it, but it takes a lot of time and practice for the barista to learn to do it properly so that you can get it that quickly. If it's just plain batch brewed coffee sure don't tip that's easy. Specialty coffee like espresso and pour overs definitely deserve tips. So yea tip your baristas.",
            "title_similarity": "0.7681833",
            "sentiment_compound": 0.9245
        },
        {
            "id": "gv6c147",
            "score": 1,
            "text": "Tbh i dont get tipping culture, it doesn't exist in my country.\n\nPeople don't expect to get tipped here, if you really really liked the food then people do tip but it is not customary to do so and someone who does not do it doesn't make them a haeartless asshole.\n\nI would assume things are totally different in US",
            "title_similarity": "0.7885213",
            "sentiment_compound": 0.2927
        },
        {
            "id": "gv6cfle",
            "score": 1,
            "text": "Meh... I'm a poor person so I'm probably on the other side of your view, I would say to tip them if you can afford it.  Obviously I can't afford to tip anybody (literally have 50 cents in my bank account right now and it's been that way for almost a month), and if I worked at those places, a tip would be so helpful because obviously I'm getting paid shit... some of these places are a horror show to work at.  These service jobs have employers that expect you to be perfect at the job and go above and beyond, for minimum wage.",
            "title_similarity": "0.7360981",
            "sentiment_compound": -0.5242
        },
        {
            "id": "gv6cu83",
            "score": 1,
            "text": "So I'm normally against this concept too, expect for local businesses. There's this one sandwich place I go to where it's always the same nice lady working, giving free chips despite not getting the combo, etc. I tip her occasionally because she goes above and beyond the standard over the counter service.",
            "title_similarity": "0.69801605",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gv6cuz9",
            "score": 1,
            "text": "End tipping. Pay higher.",
            "title_similarity": "0.18615668",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gv6cwud",
            "score": 1,
            "text": "Fuck it then only tip when you feel like the person earned it. I always tip deliveries and when someone physically does something in service for me. If you just stand there and click a few buttons then you ain’t getting shit.\n\nOr if it’s a place I have been frequenting, a usual spot. I always tip even on takeout. Again, just be reasonable.\n\nTip what you WANT. Not some arbitrary 15%. And tip when you want, not as some bullshit “duty”. \n\nActually that’s just like tithing.\n\nGive out of the freedom of your heart not out of duty",
            "title_similarity": "0.6966684",
            "sentiment_compound": 0.8935
        },
        {
            "id": "gv6d1sb",
            "score": 1,
            "text": "Not going to try. Maybe of the service or product is extremely cheap but still of good quality, but otherwise the manager just makes me pay twice. Once for the product and profit and once for the salary of the employees. That's bullshit, I'm just guilted into enabling them to get higher profit margins...",
            "title_similarity": "0.7612376",
            "sentiment_compound": 0.6956
        },
        {
            "id": "gv6d2sg",
            "score": 1,
            "text": "I have worked in food service and retail.\n\nEveryone is getting hazard tips from me right now. \n\nThank you for your service. \n\n$5 is for counter service. \n\nDelivery usually $10-15 depending. I'm one person, so that's usually 20%+",
            "title_similarity": "0.55917925",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv6deit",
            "score": 1,
            "text": "Don’t tip then, it’s there if you have the extra cash to show you appreciate the work they do in general. They don’t expect a tip. \n\nI worked as a barista for 6 years. I never expected a tip. Every now and then a regular threw in a buck or 2. \n\nMainly ppl just put their coin change in it. Which it adds up and always appreciated!",
            "title_similarity": "0.7561009",
            "sentiment_compound": 0.7424
        },
        {
            "id": "gv6e14g",
            "score": 1,
            "text": "First and to be clear, everyone is paid minimum wage. If tips don't reach minimum wage then the employer must fill the gap. So don't feel the need to tip at counter services. \n\nSecond, tips are an awesome incentive for waitresses to be good at their job. I made more money as a waiter than I do now /hr and I'm ugly af. The pay ceiling is vastly lower than my current position (ie: a manager here makes way more) but I know tons of waiters and waitresses who make 3 or $400 in a 5 hour workday. They all work at either Applebee's, Texas Roadhouse or Old Chicago. These aren't high end restaurants and they aren't in wealthy areas. \n\nI know one girl who averaged $1000 a night as a bartender on weekends. \n\nRegardless of how you feel about minimum wage you can't raise minimum wage that high and if you eliminate tips and remove incentive to perform, what is going to happen to these people?",
            "title_similarity": "0.67645866",
            "sentiment_compound": 0.5644
        },
        {
            "id": "gv6e3qi",
            "score": 1,
            "text": "If you have the money to go out and buy an expensive, $7 complicated Frappuccino mocha decaf soy icee, you have the money to tip. Go make it yourself.",
            "title_similarity": "0.6937039",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv6eewf",
            "score": 1,
            "text": "I hate when those coffee shops include the tip, and then you have to erase the tip from their ipad yourself lol",
            "title_similarity": "0.7882986",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gv6eq2n",
            "score": 1,
            "text": "In Australia we don’t have to tip as the staff get a Living Wage... like everyone DESERVES!!! \n\nWhen I get a tip, it’s genuine from the person as they really did enjoy your effort and experience there. I feel like I’ve done a good job at customer service when it happens. It means a lot to me. Forcefully tipping in the Richest Country in the world should be shameful as it makes the ones in Corporate real slackers for not modernising",
            "title_similarity": "0.62679243",
            "sentiment_compound": 0.9091
        },
        {
            "id": "gv6hnbl",
            "score": 1,
            "text": "Tips are too high imo.",
            "title_similarity": "0.2217595",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv6i7pm",
            "score": 1,
            "text": "I'm in Australia, we don't need the tipping system here because we actually pay a living wage to our workers. Yet that doesn't stop a great many places having top jars at the counter. \n\nI'm sorry, just no. If we lived in a different country, sure. But we don't, so just no.",
            "title_similarity": "0.6601693",
            "sentiment_compound": -0.0008
        },
        {
            "id": "gv6qcyy",
            "score": 1,
            "text": "I couldn’t agree with you more. I’m not against tipping in restaurants either, but this new trend where someone pouring me a cup of coffee is asking for a tip is ridiculous. What’s next, tipping customer service for answering my call? Maybe I should tip the IRS for taking my money while we’re at it haha",
            "title_similarity": "0.82877916",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv6u6zq",
            "score": 1,
            "text": "I worked at a pizza place when I was 16. They always sent me home an hour before close so they wouldn't have to split the tip jar with me",
            "title_similarity": "0.6220521",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv6vzy4",
            "score": 1,
            "text": "Especially at Panera. I kean you're already charging like $8.00 for a mass produced tuna sandwich that comes out of a bucket. You really can't pay your employees more so you have to guilt people into a tip at the counter?",
            "title_similarity": "0.7690346",
            "sentiment_compound": 0.244
        },
        {
            "id": "gv72euz",
            "score": 1,
            "text": "I'm dealing with a huge clusterfuck with my card (Simple) because a restaurant asked if I wanted to add a tip on my purchase. I use a card for things like this that doesn't ever have much money on it - usually I add to it about the amount I intend to spend, maybe a dollar or more extra. Well, I'm the type of person that has trouble saying no in situations like this, so I said to add a 3 dollar tip, thinking I had enough to cover it. \n\nI didn't. \n\nThe transaction went through on my end, wiping out all the money, but didn't clear on their end. 4 days later, the charge is still pending and hasn't been reversed. In those 4 days, a gas purchase from a week ago got charged a second time somehow, so now the account is negative and has a overdraft fee that's going to wipe out almost the entire amount that's supposed to be reversed from the failed restaurant charge. So, essentially leaving a $3 tip has turned in to $35, and all attempts to contact Simple are failing - through the app, no one has replied, and when I called, there was a **two hour** wait time. To make matters worse, Simple is closing in a week and transferring to BBVA, so I'm guessing I won't hear anything until that transition happens.\n\nIf I'm not asked for a tip when I order, then I'm not leaving a tip. Never again am I caving to the pressure of a last minute tip at the pickup window.",
            "title_similarity": "0.78787684",
            "sentiment_compound": -0.9801
        },
        {
            "id": "gv74p2x",
            "score": 1,
            "text": "I personally think those tip screens exist for people like me who want to round up my transaction to an even dollar amount. Likely the tips all go into a pool and are distributed evenly at the end of the day/week. \n\nIt’s just an opportunity to get rid of spare change",
            "title_similarity": "0.5878329",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gv74pwg",
            "score": 1,
            "text": "Places like this have always had tip jars. You can put money in them or not, it's totally up to you. Did the cashier help you in some exceptional way? Maybe they gave you a recommendation for a great donut, coffee, sandwich, etc.? Give them a rip if you want. The transition to contactless and cashless payment has made this harder, so new machines often have electronic tip functions. If all they did was hand you your food or ring you up, you don't have to tip. But if you feel like they really went out of their way to make your experience more enjoyable, you can tip them. It's optional, not compulsory.",
            "title_similarity": "0.82601273",
            "sentiment_compound": 0.936
        },
        {
            "id": "gv7zsi0",
            "score": 1,
            "text": "I agree.",
            "title_similarity": "-0.14757706",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv8i4y1",
            "score": 1,
            "text": "I guess it's not wrong to ask, but it's shitty that cashiers and delivery drivers get more tips that people doing manual labor. Maybe it's just where I live, but I clean carpets and I bust my ass for customers, constantly go the extra mile and I see tips from maybe 15% of customers, if that. And what's funny is that it's always the lower income homes that tip me. I get really bothered that the culture more so expects us to tip someone for driving food somewhere and sitting at a cashier, than to tip manual labor services.",
            "title_similarity": "0.8404012",
            "sentiment_compound": -0.8254
        },
        {
            "id": "gv969te",
            "score": 1,
            "text": "You said you are against tipping culture because employees should be paid a fair wage to begin with. People who work at the donut shops are most likely not getting a fair wage. They might not have “earned” the extra bit but just as you tip a server because they are underpaid it doesn’t hurt to do the same for others.",
            "title_similarity": "0.84354734",
            "sentiment_compound": -0.6631
        },
        {
            "id": "gv9jo5c",
            "score": 1,
            "text": "The business isn't asking, the staff is. Why don't you feel that you should pay for people performing a service for you? You do it for every other business you purchase from.",
            "title_similarity": "0.6892284",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gva8g3r",
            "score": 1,
            "text": "> Why should I tip these people?\n\nAnother way of looking at this is that it's soft inflation. The inflation of goods and services is not being fully accounted for in the advertised price and instead comes from social pressure. The person handing you your doughnuts is working there regardless of whether a customer is currently buying something or not; your tip supplements their wages, getting them closer to a livable income than wages alone. This also lets the doughnut shop advertise cheaper doughnuts.",
            "title_similarity": "0.8112052",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvguq1o",
            "score": 1,
            "text": "I know this is a little late but tipping people can make them very good money.  My nephew was a delivery driver making the minimum with tipping wage and was able with the tips to calculate out that he got about 15 an hour.  Which for a high school student is pretty good.",
            "title_similarity": "0.5802258",
            "sentiment_compound": 0.9252
        }
    ]
}