{
    "CMV: Howl's Moving Castle should have won the Oscar over Wallace and Gromit: Curse of the Were-Rabbit\nAs the title says, I believe Howl's Moving Castle was more deserving of the Best Animated Picture award than Wallace and Gromit. The characters were more interesting and dynamic, the plot was more creative (although I will concede the W&G had better pacing), and the music and visuals are a tier above what W&G have to offer. \n\nOn top of that, W&G is presented as a comedy but the jokes and characters are not that funny, especially in comparison with other successful animated comedies. \n\nChange my view!": [
        {
            "id": "gvl2wgt",
            "score": 1,
            "text": "/u/Forgot_the_slash_s (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/mwzoqs/deltas_awarded_in_cmv_howls_moving_castle_should/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.48644942",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvl1h5n",
            "score": -2,
            "text": "I haven't seen W&G but I watched Howl's Moving Castle with my kids and don't think it is deserving of any awards. Nothing about it really stands out, and the plot and characters were just simple excuses to get from the start to the finish.\n\nI don't get what you found interesting about any of the HMC characters. I find them so boring that I can't even be bothered to write about how boring they are since they seem so obviously boring to me. \n\nThe \"plot\" is a mess too. The entire thing hangs off the chance meeting and curse of Sophie, and a series of unlikely events that follow. The ending reveal of the prince is laughable. He \"loves\" this person he barely knows to the extent that she is his \"true love\", while she has no such feelings, but inexplicably \"loves\" Howl? Please. This is grade-school level plot.\n\nVisuals seemed pretty standard. Can't recall any scenes that I thought were amazing. Music was similarly forgettable, and this is coming from someone who does add music from movies/shows to my playlist.\n\nI don't think you can even make a convincing case that HMC is deserving of an award, let alone over something else. I'm surprised to hear it was nominated. I can only imagine it was a lean year for animated films or something or there were external reasons, because it doesn't deserve it on merits.",
            "title_similarity": "0.62643605",
            "sentiment_compound": 0.9902
        },
        {
            "id": "gvlgxo4",
            "score": 0,
            "text": "I'm a common person. Seen both movies at different times in my life. Remember both well. Have never followed award ceremonies. \n\nHowls moving Castle is moving in a way the Wallace and gromit are not. While WG will make you laugh and draw you in, howls will grab your heart and mysticism and carry them away. \n\nFor experts to dissect and analyze, they will year both apart in ways I can't imagine. But in laymen's terms, howls was better.",
            "title_similarity": "0.7764899",
            "sentiment_compound": 0.8113
        },
        {
            "id": "gvl3tjb",
            "score": 0,
            "text": "I'm sure people are annoyed about hearing the book was better, but the movie cut out so much of the story in the book. That being said, foreign films dont usually do that well",
            "title_similarity": "0.70251155",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvl93lu",
            "score": 0,
            "text": "God I love Wallace and gromit but I have to agree that as a film howls is better. The sound design is something else and damn some of the visuals in that film where breathtaking. Guess it only lost because it was less known.",
            "title_similarity": "0.8594836",
            "sentiment_compound": 0.8294
        },
        {
            "id": "gvlcb2e",
            "score": 0,
            "text": "Consider: Howl's Moving Castle is a boring fucking movie",
            "title_similarity": "0.5835062",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvllf57",
            "score": 0,
            "text": "Definitely correct",
            "title_similarity": "0.035189085",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvlmol6",
            "score": 0,
            "text": "You’re 100% correct",
            "title_similarity": "0.17734045",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvlq4gm",
            "score": 0,
            "text": "No view to change you’re right!",
            "title_similarity": "0.2203189",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gvm5ozh",
            "score": 0,
            "text": ">and the music and visuals are a tier above what W&G have to offer.\n\nStrongly disagree.  Stop motion animation is 1000x more interesting than anime.  Also, it's a kids movie, not an adult comedy.  OFC the jokes aren't gonna be on the level of an actual comedy.  Stop being a weeb and then you will change your view.",
            "title_similarity": "0.8052182",
            "sentiment_compound": 0.1238
        },
        {
            "id": "gvlkyql",
            "score": 6,
            "text": "Speaking as a British person, Curse of the Were-Rabbit was fucking hilarious. I think it maybe just didn't appeal to your sense of humour, which is totally fine, but it's a bit unfair to say that the film was objectively not funny.",
            "title_similarity": "0.8224538",
            "sentiment_compound": -0.711
        },
        {
            "id": "gvlh6zp",
            "score": -1,
            "text": "i didnt see howl but wallace and gromit sucked so i agree unless howl is anime then bc anime sucks more and is for kids then u should think w&g is better bc its clay not anime",
            "title_similarity": "0.7645279",
            "sentiment_compound": 0.0689
        },
        {
            "id": "gvlhi7a",
            "score": 1,
            "text": "No. You are correct.",
            "title_similarity": "0.1494289",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvl7hsg",
            "score": -2,
            "text": "I’ve never understood the appeal of W&G. And I don’t think many other people liked it that much either. I’ve never heard someone say it’s their favorite movie. You know what movie people still love and often talk about almost 17 years later? Howls moving castle.",
            "title_similarity": "0.6486683",
            "sentiment_compound": 0.875
        },
        {
            "id": "gvl0wh3",
            "score": -3,
            "text": "I've never even heard of those, can someone explain the context?\n\n&#x200B;\n\nedited: \", can someone explain the context?\"",
            "title_similarity": "0.3251927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvkxd6n",
            "score": 239,
            "text": "[deleted]",
            "title_similarity": "0.081540555"
        },
        {
            "id": "gvl6ajs",
            "score": 5,
            "text": "I disagree on the point that HMC had 'interesting and dynamic' characters - Sophie was the same stock female character Studio Ghibli had been using for decades down to her lack-of-creativity face that he used for Kiki, Princess Monooke and Nausicca, etc.\nThe only interesting thing about her was that she would shift from young to old but at any age she was boring.      She had to be the most boring of any of their female leads.",
            "title_similarity": "0.6298796",
            "sentiment_compound": -0.5632
        },
        {
            "id": "gvkw3ji",
            "score": 51,
            "text": "The Academy Awards haven’t done a great job of recognizing foreign films traditionally, so it’s a surprise when they do.\nAlso, even though Howl’s is adapted from a western novel, the storytelling doesn’t fit the 3 act structure that most western stories adhere to.\nI love the film a lot more than Wallace and Gromit in any iteration, and agree it’s probably more deserving. That doesn’t mean it reflects the values of the Academy, and what they’re looking to reward.",
            "title_similarity": "0.8439019",
            "sentiment_compound": 0.9785
        },
        {
            "id": "gvl2rzi",
            "score": 21,
            "text": "Clearly you've yet to understand the artistry that went into Wallace and Gromit: Curse of the Were-Rabbit.\n\nYou see, Wallace and Gromit: Curse of the Were-Rabbit -or WGCAR for short- is a masterpiece unlike any other.\n\nHell, my kid was conceived to that movie.\n\nIf I had to choose between never having an orgasm for the rest of my life and seeing WGCAR just one more time before returning to my day job as President of Opinion - well; I think the answer is obvious.\n\n(I fucking love Wallace and Gromit: Curse of the Were-Rabbit.)",
            "title_similarity": "0.76182127",
            "sentiment_compound": -0.4033
        },
        {
            "id": "gvky7qp",
            "score": 188,
            "text": "Watched HMC for the first time last year and found the story to be a total mess. Felt validated when I found out this is a common opinion even among Miyazaki super fans, and there are countless essays on the topic you can find right here on Reddit if you do a search. I went on to read the HMC novel and absolutely adored that, and it made the movie's poor pacing and messy plotting all the more obvious and galling.\n\nThat said, I adore the visuals, animation, music and general world of the HMC movie and overall I like it despite its shortcomings. And I haven't seen W&G so I can't compare. Just putting in my two cents, the movie is very far from perfect and one of the lesser Ghibli films IMO.",
            "title_similarity": "0.6995746",
            "sentiment_compound": 0.9206
        },
        {
            "id": "gvkxtp7",
            "score": 543,
            "text": "W&G has one of my favorite lines of all time:\n\n“The way I see this, it was arson.”\n\n“Arson?”\n\n“Aye, Someone was arson around.”\n\nI remember this far more than I remember any lines from Howl’s Moving Castle.",
            "title_similarity": "0.58178324",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvl05m0",
            "score": 8,
            "text": "I feel like W+G might have gotten the Oscar more as recognition of the entire W+G collection as opposed to just the value of the movie as a stand alone piece. When people think about animated works that were real turning points, the original 3 short films are almost always on the list.\n\nThat being said, I haven't seen Howl's Moving Castle, so this is a totally uneducated opinion here.",
            "title_similarity": "0.81708527",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvl0ror",
            "score": 121,
            "text": ">The characters were more interesting and dynamic, the plot was more creative (although I will concede the W&G had better pacing), and the music and visuals are a tier above what W&G have to offer.\n\nI think much of your argument is housed in this statement, and I think there is plenty of room to defend Wallace and Gromit within it.\n\n1.**The characters were more interesting and dynamic**\n\nHard disagree. The characters of Howl's Moving Castle are standard fantasy shlock that don't really offer any nuance or substance. There is a young, naive girl. The old embittered prince. The quirky side characters. But they pale in comparison to the nuanced and developed protagonist of other Ghibli films.\n\nIn comparison, Wallace and Gromit are a pair of buddy cop rabbit exterminators. That is an interesting dynamic that you can't find anywhere else on screen. And I think its a testament to their characterizations that so little dialogue has to be offered, and yet an entire relationship dynamic can be understood between the characters.\n\nNo they don't change very much, but characters in comedies often lack groundbreaking changes.\n\n 2.**The plot was more creative**\n\nWell Howl's Moving Castle is based off of 1986 British Novel. It is tough to credit the plot as original or creative, when Miyazaki is clearly drawing from already established material.\n\nWallace & Gromit (though derivative of werewolf stories) is a wholly unique and original story, which I would in many ways laud more than the creativity of Howl's moving Castle.\n\n 3.**The music and Visuals are a tier above what W&G have to offer**\n\nMusically, probably. I love Ghibli music and couldn't really name you a song from W&G. But visually, Wallace and Gromit is stunning. You may not enjoy stop-motion animation as much as I do, but the man hours dedicated to a project like that is ridiculous.\n\nI would say they are comparable. Howl's looks amazing. But so does Wallace and Gromit.\n\n**Overall,** I like both movies quite a lot and think either COULD have won.\n\nI don't think either SHOULD have won. They were both good enough that I wouldn't be upset if either took home the gold. Even Corpse Bride was good enough.\n\nOscars are dumb. They mean nothing. If a movie is good, it deserves to be celebrated. \n\nHowl, Corpse Bride, and W&G all were worthy of recognition.\n\nETA: a word",
            "title_similarity": "0.82309747",
            "sentiment_compound": 0.9978
        },
        {
            "id": "gvl8l5i",
            "score": 32,
            "text": "Head mod of r/wallaceandgromit here, I'd have to disagree.\n\nCurse of the Were-Rabbit arguably is a flawless comedic masterpiece and has some of my favourite character interactions from perhaps the entire series, or from many of the movies I've seen.",
            "title_similarity": "0.79308915",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvkz3jg",
            "score": 19,
            "text": "Who decides what criterion should be used when deciding what's more \"deserving\" of the oscar? This seems highly subjective.",
            "title_similarity": "0.5780012",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvkuoau",
            "score": 1313,
            "text": "From a technical aspect I think W&G is more impressive than HMC. Feature length stop motion films are incredibly difficult to pull off effectively, much more so than hand drawn animation.",
            "title_similarity": "0.7573067",
            "sentiment_compound": 0.7385
        },
        {
            "id": "gvlc4ay",
            "score": 22,
            "text": "Howl’s Moving Castle is a beautiful in its own right but consider the Studio Ghibli films that came before it. Does it hold a candle to Spirited Away (which nabbed the Oscar a couple years earlier)? Or Princess Mononoke? Or Grave of the Fireflies? Or even My Neighbour Totoro? \n\nIf you like it better than these other titles, that’s fine, taste is subjective after all, but while it’s a fantastic film, I would certainly consider it a *mid tier* Studio Ghibli film.\n\nCompare that to Wallace and Gromit which showcases incredibly imaginative stopmotion animation, excellent pacing (as you pointed out), and was probably one of the funniest movies I’ve ever seen (again taste is subjective, but evidently I’m not alone in feeling this way). On top of that, it is likely *that* studio’s best work to date.. \n\nNow I can sense you might take issue with my argument because it relies heavily on these films being compared to their predecessors. But when it comes to the Oscars, a director / studio’s past work becomes highly relevant. We may prefer that films to judged independently of the films that come before them, but that simply is not the case. How can one watch Howl’s moving castle and not be reminded of Spirited Away - Miyazaki’s brush strokes are everywhere, yet few would consider it to be his best work. Whereas W&G, despite being part of a franchise, was fresh, original, funny and equally deserving of recognition, even if it was a goofy comedy.",
            "title_similarity": "0.8532877",
            "sentiment_compound": 0.9958
        },
        {
            "id": "gvl0ndh",
            "score": 77,
            "text": ">On top of that, W&G is presented as a comedy but the jokes and characters are not that funny, especially in comparison with other successful animated comedies. \n\n&#x200B;\n\nComedy is entirely subjective, and I'll go out on a limb and say that British comedy and American comedy are VERY different things, and trying to directly compare the two is unfair at best. If you don't believe me, watch the UK Office. I don't feel like this point is valid at all.",
            "title_similarity": "0.8089154",
            "sentiment_compound": 0.9639
        },
        {
            "id": "gvl0ln1",
            "score": 34,
            "text": "Only one film can hold a candle to *Curse of the Were-Rabbit* for comedy value and that is *Chicken Run*. It is a flawless example of its oeuvre: a fun story and wall to wall gags. The story is tight and fits the *Wallace and Gromit* plot arc, without repeating anything from their previous outings. The jokes are not high-brow, but they just keep coming even in the bits with tension. And the tension is genuine and perfectly pitched. This is best summed up in the climactic scene: peril and then revival with smelly cheese! You can't compete with that.\n\nAlso Nick Park's animations capture a sense of humanity that not even Pixar on their best day can match. Ghibli in fairness don't even try as that is not really their thing, focussing more on the magical elements and visuals. Not that Aardman's visuals are anything less than stunning. The car greenhouse? Come on...",
            "title_similarity": "0.7882403",
            "sentiment_compound": 0.9597
        },
        {
            "id": "gvl563z",
            "score": 2,
            "text": "I would simply say not to care about the Oscars.",
            "title_similarity": "0.4249339",
            "sentiment_compound": -0.3875
        },
        {
            "id": "gvl8ev2",
            "score": 11,
            "text": "Many of the other commenters noted that the plot of Howl's Moving Castle was kind of a mess. This was because original source material didn't have a war at all. That was something that Miyazaki shoehorned in because he wanted to make the movie about pacifism.",
            "title_similarity": "0.7119085",
            "sentiment_compound": 0.449
        },
        {
            "id": "gvl8uir",
            "score": 2,
            "text": "Story wise. yes.\nTechnical ability. No",
            "title_similarity": "0.34136933",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gvl8y90",
            "score": 11,
            "text": "So much of this is subjective. How would you like us to change your view on what's \"funny?\" I'm sure many people would say W&G was very funny. I doubt we will change your opinion on which movie you enjoy more. But everything you list here is not what correlates to winning awards. Your arguments are disconnected from the thread title. Awards are for the overall quality of the animated film (unless it's something specific, like editing or sound or score).\n\nWe can simply look at Metacritic, which takes critic reviews and weights them by score. W&G has an 87, and HMC has an 80.\n\nOr rottentomatoes, where W&G has a 95% and HMC has an 87%.\n\nYou can also look at the Annie Awards (for animated films), and W&G won 10 awards. HMC had three nominations. All three HMC nominations were losses to W&G, which won.\n\nMaybe you enjoy one more than the other, but across aggregate measures, W&G is rated better and thus more deserving of the Oscar.",
            "title_similarity": "0.8186524",
            "sentiment_compound": 0.9912
        },
        {
            "id": "gvlbzbx",
            "score": 5,
            "text": "I haven't seen both in a very long time, but what I can say is that the Academy tends to consider overall craftsmanship when it comes to animation (I say *tends* as this isn't always the case). In terms of the actual *animation* Howl's Moving Castle, while visually stunning with a great soundtrack, simply didn't push the envelope in any way. It's a Ghibli film with Ghibli characters and Ghibli style. \n\nOn a technical level, W&G wins in every category mostly because it was a well-executed stop motion flick, which is an incredible feat in the animation world. The icing on the cake is that it was a well-received story with a very wide audience reach in terms of accessibility (concept wise).\n\nI'm a huge Ghibli fan but this is how I see it--\n\nIs Howl's a better movie? Maybe. Is it a better animation? Hardly.",
            "title_similarity": "0.83683485",
            "sentiment_compound": 0.9861
        },
        {
            "id": "gvlewcn",
            "score": 2,
            "text": "It's all subjective. You would have to have a CMV for every vote cast.",
            "title_similarity": "0.39428926",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvlg42j",
            "score": 2,
            "text": "Yo I have seen this W&G movie so many times in my youth and  never knew it won an oscar wtf",
            "title_similarity": "0.40080348",
            "sentiment_compound": -0.7781
        },
        {
            "id": "gvlhqei",
            "score": 4,
            "text": "There are two points I want to make here.\n\nThe first that the Academy Awards are as much about Hollywood politics as they are about the quality of the films. This works both ways, with certain films being elevated and others rejected purely on the whim of the academy.\n\n&#x200B;\n\nThe second is more in line with your expectations and also more complicated. Ostensibly the award for Best Animated Feature Film goes to the best animated feature film of that year. However, for this is not necessarily the film which you would consider the most enjoyable, or even the one which is visually superiour. With Wallace and Gromit, the style of animation is extremely different from Howl's Moving Castle which may not be to your taste, but the quality of the film's animation is spectacular. It's incredibly smooth for stop motion animation which is an amazing technical achievement for a full length film. Howl's Moving Castle doesn't really do anything to push the boundaries of animation in the same way.\n\nSo while your experience of the films tell you that Howl's Moving Castle is the superiour of the two, the academy takes far more into account than viewers do. From their perspective from within the film industry, Wallace and Gromit deserved the award.",
            "title_similarity": "0.85615814",
            "sentiment_compound": 0.9505
        },
        {
            "id": "gvliz05",
            "score": 2,
            "text": "A little background: \n\nThe three nominees in the 2006 Oscars for best animated feature were  *Howl’s Moving Castle*, *Corpse Bride*, and *Wallace and Gromit: Curse of the Were-Rabbit*. Howl was a traditional animation, the others stop-motion. No Pixar or Disney or Dreamworks entries. \n\nOpinion: \n\nAll three were pretty great in their own way. I think Howl had the weakest story, though. \n\n(But here 15 years later, Howl is the only one that regularly draws me to re-watch it.)",
            "title_similarity": "0.7744551",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvlkkk6",
            "score": 1,
            "text": "I can not change your view. I have tried several times to get on board with W&G and I just don't get it.",
            "title_similarity": "0.43285638",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvln5fw",
            "score": 3,
            "text": "I wonder if Howl was viewed in the original Japanese - or the English dub. The English voice actors did their best, and Disney’s dubs of the Ghibli films are pretty high quality translations - but I think you really loose a lot of the characterization when the voice actor changes. I think Sophie feels and acts so much more natural in Japanese partially because her English voice actress has to think about timing, sync, and forcing English syllables onto animation mouthing Japanese - personally I think Howl, Spirited Away, and When Marnie was There are very different films in English vs Japanese.",
            "title_similarity": "0.803679",
            "sentiment_compound": 0.84
        },
        {
            "id": "gvln65y",
            "score": 2,
            "text": "Funny dog tho...",
            "title_similarity": "0.4586855",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvlnl60",
            "score": 2,
            "text": "that would give the academy award a tiny sliver of credibility - do you really want that?",
            "title_similarity": "0.563819",
            "sentiment_compound": 0.624
        },
        {
            "id": "gvlo1wf",
            "score": 2,
            "text": "It seems that sentimentality is given weight at the Oscars a lot, and W&G had a lot of love built up over the years for their short films.  Also, Howl was an incredible film but had a degree of weirdness and moral ambiguity, not usually desirable in animated films.",
            "title_similarity": "0.782139",
            "sentiment_compound": -0.1513
        },
        {
            "id": "gvlp27d",
            "score": 2,
            "text": "I just wanna be that person.\n\nMaybe HMC would have won if it would have kept Sophie's magic in the movie so the ending would have actually made sense!\n\n\n/Read the book then watched the movie.",
            "title_similarity": "0.6880589",
            "sentiment_compound": 0.6114
        },
        {
            "id": "gvlpjno",
            "score": 2,
            "text": "They are never going to award/acknowledge an anti-war movie",
            "title_similarity": "0.30740327",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvlq7t0",
            "score": 1,
            "text": "I dont think anyone has to.",
            "title_similarity": "0.11376038",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvlrjxc",
            "score": 2,
            "text": "There is some context that I believe is relevant. Nobody from Ghibli bothered to show up when the Academy gave them an Oscar for Spirited Away, a snub almost unthinkable if you are in the industry (the official excuse was that they didn't believe they could win). So can understand why voters (who are all part of the Hollywood establishment) gave him the finger and voted for a Spielberg-affiliated movie instead despite the artistic merit.\n\nVideo of the 2003 Oscar winner for best animation [https://www.youtube.com/watch?v=qxU6xN8o9r8](https://www.youtube.com/watch?v=qxU6xN8o9r8)  \n(Edit: the ceremony was held in 2003, for movies released in 2002 in the US, Spirited Away had actually premiered in Japan in 2001 but that doesn't count for Academy rules)",
            "title_similarity": "0.7329235",
            "sentiment_compound": 0.7179
        },
        {
            "id": "gvlvagh",
            "score": 2,
            "text": "Wallace and Gromit never set out to have a compelling story so I don’t think it’s fair to grade it based on that. \n\nAlso it is a British movie right? British humor is different from other western humor, the UK Office isn’t seen as very funny in the US while the US Office isn’t seen as funny in the UK. Maybe this movie was funny to it’s target audience. I always found American humor to be really absurdist or physical while UK comedy was more tongue in cheek.",
            "title_similarity": "0.77279663",
            "sentiment_compound": 0.9583
        },
        {
            "id": "gvlvtom",
            "score": 3,
            "text": "I'm not sure I can agree in any way that comes out objective. Howl's Moving Castle is in my eyes one of Ghibli's worst films and W&G is one of the best animated, paced and comedic kids films of the noughties",
            "title_similarity": "0.81245226",
            "sentiment_compound": 0.5168
        },
        {
            "id": "gvlvz4s",
            "score": 2,
            "text": "I have to say OP I don't agree with your deltas at all, while W&G is one of my most favorite comedy/funny movies of all time, it's just that. It's a comedy/funny movie, it's not Howl.\n\nI wish this sub made it possible to challenge delta-ed comments.\n\nA commercial movie is like art (or basically is), you measure how great it is by how it makes you feel, even institutions like AMPAS (The Oscars) gives their awards by votes & not by an objective means.\n\nW&G made me & my family laugh, more than I care to admit, but Howl made me relate to every cringe art critics comment I've ever heard, Howl made me feel things I never knew I could feel, it left me staring at a black screen for God knows how long after it ended, just desperately trying to take in that I just witnessed history made, so effortlessly, so casually, nonchalantly. Miyazaki made it look easy & impossible at the same time, he did it so well I can't wait to to waste a lot of money & time just to meet him & beg him to make more masterpieces.",
            "title_similarity": "0.8326816",
            "sentiment_compound": 0.9631
        },
        {
            "id": "gvlyc6p",
            "score": 2,
            "text": "Howls was a boring movie.",
            "title_similarity": "0.50316226",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvlynm8",
            "score": 2,
            "text": "HMC is one of Miyazaki's weakest, and I don't think that's an unpopular opinion.",
            "title_similarity": "0.56062263",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvlyy0e",
            "score": 2,
            "text": "I think they’re both very good animated movies, so I would’ve been fine with either winning Best Animated Feature Film.",
            "title_similarity": "0.76717335",
            "sentiment_compound": 0.9117
        },
        {
            "id": "gvlzzox",
            "score": 2,
            "text": "Miyazaki’s reaction was devastating https://youtu.be/eBhXjFV99oM",
            "title_similarity": "0.4413674",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gvm3s3f",
            "score": 5,
            "text": "Personally I have rarely been as disappointed by an animated movie as Howl's Moving Castle. I sat there afterwards and was like \"Wtf was that kind of dumb ass story?\"\n\nIt switches around in what it does all the time, does shit in explaining what the characters even do and why and then it had such an absolute cop out fairy tale ending that made no real sense. Was just dumb.",
            "title_similarity": "0.73353356",
            "sentiment_compound": -0.9427
        },
        {
            "id": "gvm6tj9",
            "score": 1,
            "text": "Sorry, loved W&G. You loose.\n\n(Not really changing your view, sorry about that too.)",
            "title_similarity": "0.5503452",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvm7hwf",
            "score": 2,
            "text": "The Oscars are rigged as hell so which is better doesn't make a rat's ass of a difference for the award.",
            "title_similarity": "0.6969827",
            "sentiment_compound": -0.6041
        },
        {
            "id": "gvmbchy",
            "score": 3,
            "text": "yeah i just remember falling asleep watching howl the first time.  howls is really not that much deep when it comes to story compared to other ghibli movies.  \n  \nfor me, howls it the least rewatchable/exciting of the ghibli core. but its just a matter of opinion",
            "title_similarity": "0.71856636",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gvmhn62",
            "score": 4,
            "text": "Wrong and no I will not clarify",
            "title_similarity": "0.18166354",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gvmi8rx",
            "score": 3,
            "text": "I haven't seen Howl's Moving Castle, so I might not be able to contribute much to this discussion. I can, at least, give a professional animator's perspective. I was at the Annie Awards ceremony that year. W&G won every award it was nominated for. I was elated. That movie was fantastic. From the opening shot, I was 100% on-board. I'll describe my thinking as that first shot opened.\n\nIt's of a police officer walking down the street. Immediately, I noticed something different than most stop motion movies: it was on twos. That is, one frame of animation for every two frames of film. It might seem counter-intuitive, but 12 frames per second produces a wonderful look, one that maintains a sense of motion but allows the eye to \"fill in the blanks.\" It's ideal for cartoony animation, as it leads to snappier, springier, more dynamic motion (if it's used right).\n\nBeyond that initial impression, I was delighted with the artistry  and craft of the movie. The character designs were world class. The animation was fantastic. It's in a style that we just don't get any more in feature length movies. The story was good, though I admit it wasn't amazing.\n\nI guess the TL;DR is that I, a professional animator, loved W&G -- not just as entertainment, but as a shining example of the art of animation and cinema. I honestly have a hard time imagining Howl's Moving Castle stacking up well against it, especially for a western audience (which AMPAS most definitely is). I'm sure I'll watch it eventually, and OP's post makes me more likely to seek it out.",
            "title_similarity": "0.64523935",
            "sentiment_compound": 0.9942
        },
        {
            "id": "gvmj8f5",
            "score": 3,
            "text": "I'm not disagreeing with your argument, (personally i never saw W&G or at least recent enough to remember literally anything that happens), but the Oscars aren't a good judge of a animated films quality and more about notability. Remember in 2018, Your Name wasn't even nominated for a best animated picture category, and its been on record that many members of the academy don't even watch the pictures in animated best picture category, and simply pick the one their kids like, or they've heard that are good. So even if Howl's is a better movie, its highly unlikely that the academy would even care.",
            "title_similarity": "0.71263754",
            "sentiment_compound": 0.9788
        },
        {
            "id": "gvmjlfx",
            "score": 3,
            "text": "Your mistake is thinking the Oscars award the \"best\" films. The Oscars is a trade show originally created by the studios to help promote the film industry. The same studios actively campaign for awards--just like politicians--even holding mixers which will screen the movie for important voters and media which let them hobnob with the stars to raise its profile. Ghibli as a Japanese company doesn't care about American trade awards and doesn't usually campaign (especially back in 2004). Sometimes the American distributor does but only because they think the recognition will increase sales.",
            "title_similarity": "0.6983143",
            "sentiment_compound": 0.9049
        },
        {
            "id": "gvmk1qs",
            "score": 2,
            "text": "I always preferred the book to the movie.",
            "title_similarity": "0.56781334",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvmlubu",
            "score": 2,
            "text": "But funny cheese man",
            "title_similarity": "0.5449188",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gvmps1l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.066642486"
        },
        {
            "id": "gvmqz2m",
            "score": 2,
            "text": "TIL: people still watch the Oscars.",
            "title_similarity": "0.3071679",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvmrghu",
            "score": 2,
            "text": "Howls moving castle was a BORING movie",
            "title_similarity": "0.5774039",
            "sentiment_compound": -0.4648
        },
        {
            "id": "gvmswoz",
            "score": 2,
            "text": "CMV, the oscars are fucking dumb and you can like whatever makes you happy.",
            "title_similarity": "0.6228344",
            "sentiment_compound": 0.3832
        },
        {
            "id": "gvmteb7",
            "score": 1,
            "text": "FYV",
            "title_similarity": "0.024711806",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvmwd7c",
            "score": 3,
            "text": "k weeb\n\ngromit supremacy 😤😤😤",
            "title_similarity": "0.30659923",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gvmxuee",
            "score": 2,
            "text": "Hell yes. And I like both movies.\n\nAlso, there's a woman who writes fantasy stories, Howls's castle is only part of the story and there's a lot more that happens (Spoiler: >!They get married!<)",
            "title_similarity": "0.55849844",
            "sentiment_compound": -0.2462
        },
        {
            "id": "gvn1rm7",
            "score": 2,
            "text": "It was a stacked year. Both of these films are masterpieces of their respective formats. They are both animated, but that's merely a technicality as they are amazingly different films. Either could have won, and someone could rightfully claim the other deserved it. Amazingly, the other nomination that year was _Corpse Bride_, which couldn't compete with those two films for the Oscar, but certainly would have beaten out winners of other years.\n\nAdd to that the Oscars are notorious for making the historically \"wrong\" choice and this choice is nothing compared to some of the more egregious examples, in fact, the very same year, _Crash_ was the winner of the Best Picture award.\n\nChoosing _Wallace & Gromit_ over _Howl's Moving Castle_ is entirely a defensible position, especially within the context of the Oscars.",
            "title_similarity": "0.86055803",
            "sentiment_compound": 0.934
        },
        {
            "id": "gvn2l4w",
            "score": 2,
            "text": "I have never seen Howl's Moving Castle and I'm sure it's great but I just came here to say that I am a Wallace and Gromit stan",
            "title_similarity": "0.49640238",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvn4k1w",
            "score": 1,
            "text": "As much as I love Wallace and Gromit, curse of the were-rabbit was the worst movie imo",
            "title_similarity": "0.7422107",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gvn8aww",
            "score": 2,
            "text": "I love Ghibli but HMC really messed up a great story by cramming anti-war propaganda into a story that didn’t need it and left so many unnecessary loose threads hanging that I really didn’t like the last 1/3rd of the movie. The Witch of the Waste, Sophie’s completely unnoticed magic among other problems (including Wales). \n\nI think W&G was more coherent and better overall.",
            "title_similarity": "0.8322165",
            "sentiment_compound": -0.4063
        },
        {
            "id": "gvnaiu5",
            "score": 2,
            "text": "HMC definitely has it's merits and moved the genre forward, however it doesn't capture the Zeitgeist in the way that Wallace and Gromit does. The sense of community and duty to community that is invoked by W+G's service to vegetable protection is both familiar and identifies something that is missing in the modern world. We work and work with status as an end goal, then bicker and bicker about trivialities, minor restrictions and the merry-go-round of heads of state. W+G demonstrates a world we can admire; a world where veg and community comes first. We know from the very opening scene that they mean business and they'll be ready at the drop of a hat to protect the vulnerable. The drama in which their dedication and service to their locality is told, inspires us to think about how we can all do our part.",
            "title_similarity": "0.6779058",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gvnmtlg",
            "score": 2,
            "text": "How about CMV: Best animated film Oscar is actually best children's animated movie.   It routinely is awarded to either Pixar or Disney (so I guess really just Disney).  Most voters don't watch any of the nominations and Japan,  which continually puts out animated films, rarely has films nominated.   The list of snubs and travesties may start with Miyazaki, but include great films such as Your Name and A Silent Voice.  At least Howl's didn't loose to some paint by numbers Pixar flick like Cars.",
            "title_similarity": "0.7643063",
            "sentiment_compound": 0.9464
        },
        {
            "id": "gvnndnp",
            "score": 2,
            "text": "Probably consistency, HMC has amazing parts but also has some plot points and moments that don’t feel as refined with the Ghibli touch of detail. Cheese man and Cheese dog on the other hand keeps a pretty consistent theme through the entire movie with one witty punchline after the other. Although I find the decision to be a pretty close one in my opinion as both films are pretty stellar.",
            "title_similarity": "0.749539",
            "sentiment_compound": 0.9666
        },
        {
            "id": "gvnnwll",
            "score": 2,
            "text": "The Oscars are notoriously poor judges when it comes to the field of animation, and therefore cannot be taken seriously as a subjective judge of quality in an animated film.\n\nThe category itself was established in 2002, and while the academy of motion picture arts and sciences boast 440 members in the animation profession (as of [2015)](https://www.cartoonbrew.com/awards/know-your-oscar-voters-a-list-of-the-academys-animation-members-115036.html)\n\nThey are dwarfed by 7000 other voting members that routinely view the Best Animated Feature Award as a novelty trophy, voting for films because they feature a dog or at against films because they're from a certain country ([Source](https://www.cartoonbrew.com/award-season-focus/proof-that-oscar-voters-are-clueless-about-animation-109456.html)\n\nWhy then should Howl's Moving Castle won an oscar. It's not a measure of the better film, its a measure of the whims of the Academy Members. They're reliable judges in fields they take seriously, and animation is not one of those field.",
            "title_similarity": "0.64794016",
            "sentiment_compound": 0.9204
        },
        {
            "id": "gvnrya9",
            "score": 2,
            "text": "OYG I didn't even know this was a thing. Howl's Moving Castle is my fav Ghibli movie (and The Cat Returns)",
            "title_similarity": "0.561993",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvnt2y1",
            "score": 2,
            "text": "Counterpoint: the Wallaced rabbit saying \"OHH I DO LIKE A BIT OF GORGONZOLA\"",
            "title_similarity": "0.6092393",
            "sentiment_compound": 0.4995
        },
        {
            "id": "gvntd2e",
            "score": 1,
            "text": "Blasphemy!",
            "title_similarity": "0.27623564",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvnxpxg",
            "score": 2,
            "text": "Howl's Moving Castle, while impressively creative and beautifully animated, had a huge story/structure problem that really lets down the whole experience. \nIn the third act; The deus-ex-machina door, Sophie destroying the castle by taking Califer out, then changing her mind and bringing him back in (?), Suliman deciding to call the ministry of defence and end the war because the movie is over, Sophie falling for Howl in the end even though their previous interactions weren't simply based in romance.\nI love the imagination but I think the pacing is all over the place and there's a lack of humanity or attachment to the world of the movie. Spirited Away was able to juggle insanity, memorable characters and creativity while also retaining a solid structure, clear motivations, and a real sense of humanity that we can relate with as observers of a strange world.\n\nMaybe I'm biased because I'm British, but I thought W&G was hilarious, a perfect feature film follow-up to the previous short films. It's not as creative as Howl's but it has a solid structure, twists and turns, and a wholesome ending. Technically the film is impressive because of the mix of stop-motion/cgi and if it's ever on TV I am likely to tune in.",
            "title_similarity": "0.7375455",
            "sentiment_compound": 0.9432
        },
        {
            "id": "gvo1wq7",
            "score": 1,
            "text": "Your view doesn't need changing, it's perfect. Tbh my fave animated movie is Howl's Moving Castle,",
            "title_similarity": "0.5479896",
            "sentiment_compound": 0.765
        },
        {
            "id": "gvo2edb",
            "score": 2,
            "text": "I'm not big into stop motion or anime. I'd pick howl any day of the week watched this with ma niece a few months ago for the first time an now we watch it once a month now.",
            "title_similarity": "0.48055184",
            "sentiment_compound": 0.2235
        },
        {
            "id": "gvo60eq",
            "score": 2,
            "text": "You may say W&G is not funny but in  actuality  it's just not to your taste/sense of humour.",
            "title_similarity": "0.55959547",
            "sentiment_compound": 0.5341
        },
        {
            "id": "gvoan30",
            "score": 1,
            "text": "You’re not wrong. I’ve never much cared for that Wallace & grommit aesthetic but Stop-motion is more labor-intensive. \nNow you know how I felt when Isle of Dogs lost out to Into The Spiderverse.",
            "title_similarity": "0.68810487",
            "sentiment_compound": -0.4289
        },
        {
            "id": "gvobuxq",
            "score": 2,
            "text": ">The characters were more interesting and dynamic, the plot was more creative (although I will concede the W&G had better pacing), and the music and visuals are a tier above what W&G have to offer.\n\n>On top of that, W&G is presented as a comedy but the jokes and characters are not that funny, especially in comparison with other successful animated comedies.\n\nI mean... that's just your opinions...\n\nI'm a *huge* Miyazaki fan but I do actually believe \"Howl's Moving Castle\" is quite a step down from basically all his other work and I don't think it's that unpopular opinion (I only really see “The Castle Of Cagliostro” (which, to be honest, I have not seen) consistently being considered worse but that's really from before Miyazaki became *the* Miyazaki). Miyazaki's work in general isn't that tight in terms of plot (often purposefully) but unlike his other work I do feel the emotional clarity suffers here. In its predecessor Spirited Away it did feel a lot more like were lost and swept away with the main character. It's all gorgeous to look at but most of the time I find it really hard to emotionally engage with anything.\n\n\"Wallace and Gromit: the Curse of the Were Rabbit\" is more simplistic, surely, but I also feel it completely succeeds. It's an adventurous romp with characters that may not be deep but are all memorable and there's quite unexpectedly references to old body horror which give it a fairly unique atmosphere.\n\nAll in all to say which one is \"better\" is hard to say because they are quite fundamentally different. But I do think it's very easy to say \"Wallace and Gromit: the Curse of the Were Rabbit\" is really Aardman (and slapstick claymation in general) at its best while I would not say \"Howl's Moving Castle\" is outstanding as a Miyazaki or Ghibli movie.",
            "title_similarity": "0.90675974",
            "sentiment_compound": 0.9943
        },
        {
            "id": "gvoepqt",
            "score": 2,
            "text": "Counter point: Howl’s Moving Castle didn’t have Hutch as a character. Wallace and Gromit: Curse of the Were-Rabbit did have Hutch",
            "title_similarity": "0.6624937",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvoj3iq",
            "score": 1,
            "text": "Thank you!",
            "title_similarity": "0.11457122",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gvojyed",
            "score": 2,
            "text": "Stop motion tek time",
            "title_similarity": "0.115860075",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvqi0fu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.066642486"
        },
        {
            "id": "gvrph5l",
            "score": 1,
            "text": "I refuse to CYV, you’re 100% accurate",
            "title_similarity": "0.3654604",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzacc3u",
            "score": 1,
            "text": "The plot is exactly what was bad about Howl's Moving Castle. \n\nThere was only half a story line. It changes mid-way when the witch turns into a senile old lady. Cause it goes from Howl being oh-so-scared of the witch to being chicken of his war duties. I mean, don't change the story mid-way. Pick one. They didn't need the witch after she did the curse. All she did was fight with Sophie to give Sophie half an excuse to pour water over Calcifer so that she could be forced to shove that thing back into Howl. But I don't agree with Howl having all these anti-witch-of-the-west protection tokens, then having them not work as she can step in. Then he never mentions those again. What was the point of those then? He doesn't need to show his cowardice twice. And The story goes from kapowing the witch and her curse, to dealing with the war and understanding Howl. Kinda confusing for the dumbasses like me unless you put in hours of thought into this. \n\nAnd then there's a bunch of bad writing everywhere. \"Oh the prince is found! Stop the war!\" (that's it!? Just like that!? What was the war about then? They won't start a big war like that for something small like that)   \"Oh Calcifer, let's get you outta the castle to rescue Howl. (Castle crumbles).. Oh wait, we needed that. Hey Calcifer, get the castle started again.\" \"Sophie, I now have something to protect, you.\" (Oh how romantic, but what about the other times you went to war? Did you just go to run away and dodge bullets or something?). There was probably some others but I didn't care about them.\n\nand sure, there is the thing where Sophie is trying to break her curse. That was lame. Oh, it was love that make me young again. So cheezy. (except after reading a bunch, It is actually kinda lovely. All the different interpretations. ex) willing herself to be young, )\n\nTo be as unbiased as I can, i Feel like this movie is only good if you're dumb as a rock and is just looking at the lights and saying wow, or if you're somebody who knows exactly what to look for in the beauty of this art. for me, these plot points just took it away from me, and i can't appreciate the \"beauty\". Maybe I just don't know what I'm supposed to be looking for, or it wasn't dumbed down enough for me. Or maybe it really is terrible. But I'm that portion in between that can't appreciate what that was.\n\nTo be honest though, the more I read about it the more I appreciate the \"story\". But I haven't watched it in a really long time.",
            "title_similarity": "0.6798874",
            "sentiment_compound": -0.9779
        }
    ]
}