{
    "CMV: Lying to a sexual partner about being on birth control should be a punishable offense.\nIf a man lies that he's had a vasectomy in order to have unprotected sex, he deserves to be punished. If a man removes a condom mid-sex without the knowledge (and/or approval) of his partner, that should be punished. If a woman lies about being on birth control and has sex with a man, she deserves to be punished. Same applies if she claims that she's already pregnant, when she isn't. If a woman has previously taken birth control pills and then decides to stop taking them, she should be legally obliged to tell her sexual partner(s) about it before having sex with them again, if she has previously told them that she's on birth control. Same applies for a man who decides to reverse his vasectomy.\n\nMy opinion applies even if they don't result in a pregnancy or an STD. Of course it has to be **proven** that there was deception, because pregnancies can still happen even with birth control. I don't want to see people punished for defying the odds. Can you change my view?": [
        {
            "id": "gvoqcy6",
            "score": 35,
            "text": "My thought is, each party can use birth control. You are ultimately responsible for you. Men cause pregnancy. Use at your own risk (!)",
            "title_similarity": "0.61721593",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gvoxzen",
            "score": -4,
            "text": "Make abortion legal. Problem solved.",
            "title_similarity": "0.3736449",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvphjl7",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvogovw",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvomkf5",
            "score": -14,
            "text": "how about instead of making women prove if they were on birth control or not and going into all of these random specifics about what they said specifically to lie, you just dont nut raw in someone if you dont want to risk a child? being forced to carry a child violates your body autonomy. stop comparing it to your right to dictate if women abort or not and stop using them for sex if you dont want that. birth control is not 100% effective- no form is. the goverment shouldnt have even more control over that by criminalizing something for the pure purpose of unprotected sex from men with 0 consequences",
            "title_similarity": "0.83304954",
            "sentiment_compound": -0.8558
        },
        {
            "id": "gvp2klg",
            "score": 76,
            "text": "It's illegal to take of the condom because you are exposing your partner to physical harm. They are now exposed to STDs and if female they can get pregnant which will either end with an abortion, miscarriage or birth. You can cause your partner physical pain and discomfort. This does not happen at all when a woman lies about birth control. The only one physically affected would be the woman, not her partner. \n\nI think lying about birth control is abusive, but it is not the same thing as taking of a condom.",
            "title_similarity": "0.8575002",
            "sentiment_compound": -0.9231
        },
        {
            "id": "gvp0bpm",
            "score": 0,
            "text": "The only way for a situation like this to hold water in court would be for the both of you to sign a contract. Too much possibility for abuse in situations where they both risk it for the biscuit anyways and still have sex; What’s the punishment? Guy doesn’t have any responsibility for the baby? Monetary fine? Jail time? Cool, if I rawdog it and she gets pregnant all I have to do is say she said she’s on the pill, and I don’t have to worry about being a dad. Not to mention, are you gonna take her to court if she gets pregnant at all, and it turns out she really is on birth control but it simply failed? Goodbye all semblance of trust if this is a long-term relationship, and any possibility of a relationship if this was a one-night stand or new relationship.\n\nSame thing would also have to apply to all STDs, because it’s the same situation of ending up with something, possibly for the rest of your life, that you didn’t want anything to do with in the first place (yes there are places and situations where you’re obligated to tell your partner if you’re aware, such as HIV). \n\nIt’s too simple to just wear a condom to bother complicating things with laws. Plus unless you want to absolve the man of all responsibility, you’re creating an awkward situation for the rest of that baby’s life by creating a situation where the father is responsible for having the mother charged with a crime.",
            "title_similarity": "0.8338671",
            "sentiment_compound": 0.3421
        },
        {
            "id": "gvov6o8",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvp1a6r",
            "score": 6,
            "text": "Punishable by law? Even if it doesn’t result in an STD or pregnancy? I disagree, people’s private sex lives and private relationships shouldn’t be overregulated. Who you sleep with is not and should not be the government’s responsability. We are talking about adults here, right? Unless there is actual physical violence, two adults should be able to resolve this.",
            "title_similarity": "0.716341",
            "sentiment_compound": -0.8196
        },
        {
            "id": "gvpovwx",
            "score": 0,
            "text": "While I agree with you in theory, there's 3 main points I can use to try to change your view:\n\n1. How can this be proven in the first place? I don't think it's possible to pinpoint to a specific point in time when a person stopped taking birth control. Also considering that birth control methods are sometimes ineffective, it can't be proven that the person was not in fact on them. Maybe some chemicals can indicate not taking pills altogether, or in the case of vasectomies, not having one can be determined but it is not often possible in the other cases. So how will the law be enforceable.\n\n2. Anyway, talking about the existence of such a law in itself rather than implementation: having such a requirement makes the government effectively step into an area of people's lives that should be left private. It's one of those things thats not something the government should enter. There are many lies in a relationship, what makes this important enough to outlaw? What's next, outlawing cheating in non-spousal relationships (I'm aware that monogamy is required by law in many countries but again, also shouldn't be a law lol)? \n\n3. Concerns about safety. This is possibly more common towards bc methods for women but being forced to be on birth control in an abusive relationship can be detrimental for the person. Sometimes the pills do cause mood disruptions (depressive symptoms etc) do being in a situation where you're forced to take the pill can be unhealthy and disclosing not being on it can be unsafe.",
            "title_similarity": "0.63320076",
            "sentiment_compound": -0.9703
        },
        {
            "id": "gvq3m4k",
            "score": 0,
            "text": "Deserves to be punished? Sure.\n\nShould the state be authorized to punish such conduct? Absolutely not.\n\nThe criminal justice system is a monster. Let's start with the cops. Do you really want a dude with a gun and a badge, whose primary job is to \"make it home safe,\" and who enjoys broad protection when he violates your rights (qualified immunity, assuming US), getting in your business about what exactly you said to your sexual partner? Bonus points if you are a woman and officer friendly is going through a tough divorce. \n\nI'll stop there except to leave you with something I recently heard a libertarian say about criminal law making: we should only make laws where we are comfortable with the motion that people can die e forcing these laws.",
            "title_similarity": "0.79352504",
            "sentiment_compound": -0.3784
        },
        {
            "id": "gvq7qwf",
            "score": 0,
            "text": "Rather than arguing that the acts you list belong in the criminal sphere, why not argue instead for men to have the ability of a financial abortion?  This is when the father is removed of the duty to pay financial support to the mother.  As with any law, there could be a spectrum  (full/partial) and restrictions, even to the point of restricting a complete financial abortion to cases of deceipt or rape.\n\nAs other commenters have noted, there are major problems with making this criminal.  How would you prove it all?  Remember that anything in the criminal sphere has to be proved beyond a reasonable doubt, whereas anything in the civil area is on balance of probabilities.\n\nTo me this addresses the unfairness of such circumstances in a more direct way.",
            "title_similarity": "0.78604937",
            "sentiment_compound": -0.9695
        },
        {
            "id": "gvqaak1",
            "score": 0,
            "text": "No, it shouldn't.  First of all, this seems to be coming from a man's perspective, but this argument should be gender agnostic.  A man could lie about a vasectomy as easy as a woman could lie about birth control.\n\nIn the end, I think this comes down to personal responsibility and the fact that life has risks associated with it.  Life is not fair.  YOU have a personal responsibility to NOT sleep with people that you don't trust.  If you misjudged someone's character, that's on you.  I find the idea that you'd want the government so deep into our personal lives that you no longer have responsibility for the sexual partner you choose to be completely absurd.",
            "title_similarity": "0.82141495",
            "sentiment_compound": -0.8738
        },
        {
            "id": "gvqay3c",
            "score": 0,
            "text": "Hi OP, here to drop my perspective as a law student. You seem to want the legal system to change, so I wanted to talk about why what you want isn’t possible.\n\nThe short answer is: it’s all about consent. I’m assuming you don’t mean to create a completely new law, based on that assumption consent is the easiest way to expand what you want. Currently in UK law sexual crimes depend on whether or not you consent, and acknowledges the difference in consenting to condom sex vs non condom sex; ergo it wouldn’t be too hard to incorporate “birth controlled sex” against not. (Disclaimer: I am, of course, simplifying things a lot; and am only a law student)\n\nThe difficulty lies in “legally obliged to tell their partner”, after all obligations are not the same as limitations. I won’t go too deeply into detail, but at the very least expansion would criminalise the behaviour you reference but not create an obligation to inform the partner. (Taking off a condom during sex is a crime, but imposes no obligation on someone to not do that exactly)\n\nThe issue also is— would we be going against someone’s freedom if we were to impose declarations? Under the current law, if someone explicitly states they won’t have sex if condition A is present, and condition A happens under your influence— that is still a crime. So suppose someone lies about being on birth control, that person is not allowing the other to consent. Is this not up to your standard? How far does this “obligation” you mention go, and why does having sex make this an exception? I am not questioning this exactly, but to make this into law these are questions that will br asked. \n\nAnyway happy to talk on this further, this is interesting! And any UK lawyers feel free to correct me if I’ve mischaracterised something.",
            "title_similarity": "0.7180979",
            "sentiment_compound": 0.377
        },
        {
            "id": "gvqixd4",
            "score": 0,
            "text": "It's the man's responsibility to ensure he's wearing protection if he isn't willing to accept the risk that the birth control will fail, or that the partner might be lying to him. The moment a man puts all the responsibility for contraception on the woman, they should lose all recourse.\n\nThis is not the same as a man removing a condom mid-sex. In this case, a woman may have taken reasonable precaution by insisting the man wear a condom. To then take the condom off without consent is clearly wrong, and should be subject to legal action. Similarly, the case of a hidden vasectomy-reversal is analogous to the condom removal.\n\nI also feel that lying about a vasectomy is not the same as lying about birth control. One *inflicts* pregnancy on another. The lie about the vasectomy means you are inflicting pregnancy on another, while the lie about birth control is something a man should factor into his tolerance to risk of unwanted pregnancy.",
            "title_similarity": "0.87604284",
            "sentiment_compound": -0.9733
        },
        {
            "id": "gvqqdrs",
            "score": 0,
            "text": ">If a man lies that he's had a vasectomy in order to have unprotected sex, he deserves to be punished.\n\nHe will be punished with child support. \n\n>If a man removes a condom mid-sex without the knowledge (and/or approval) of his partner, that should be punished.\n\nIn many countries it is, it's considered a form of rape. \n\n>If a woman lies about being on birth control and has sex with a man, she deserves to be punished.\n\nThis will only become known if she gets pregnant; otherwise, how would anyone know? The rhythm method does show to be effective, but it's also up to a guy to practice safe sex and wear condoms. In this instance, there's nothing about contracting an STD. Knowingly exposing someone to an STD under false pretext should be considered assault, if it's during sexual activity, it should be considered sexual assault.",
            "title_similarity": "0.97433704",
            "sentiment_compound": -0.9562
        },
        {
            "id": "gvqrn32",
            "score": 0,
            "text": "Making it illegal to lie about birth control in general might be a poorly phrased law that would likely lead to abuse. If someone is in an abusive relationship and they secretly take birth control, then this would make that illegal. Allowing people to maintain control of their own bodies seems to be the main thing that you want to uphold, you're probably trying to make illegal is reproductive coercion. This is when someone tries to threaten, manipulate, or sabotage their partner's birth control. It seems that reproductive coercion is currently considered a form of sexual assault or rape. I don't know if there needs to be a separate law. \n\nI'd say that sabotaging birth control should probably be considered sexual assault, but having sex with someone after sabotaging their birth control should be considered rape.\n\nIf person A is having sex with person B on the condition that they are on birth control means that they would not give consent to B if they were not on birth control. So, B sabotages birth control without their A's knowledge, then A can no longer consent to sex and it should be classified as rape. If A catches B sabotaging their birth control and gets proof, then that should be considered sexual assault because it violates A's right to bodily autonomy and exposes them to the risk of STDs without their consent.",
            "title_similarity": "0.8688845",
            "sentiment_compound": -0.9949
        },
        {
            "id": "gvp7j8v",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvoyjqp",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvos6oh",
            "score": 2,
            "text": "A guy with a vasectomy isn't unprotected sex...",
            "title_similarity": "0.46457145",
            "sentiment_compound": 0.2755
        },
        {
            "id": "gvp7496",
            "score": -1,
            "text": "Having relationships being regulated in such a way is an horrible idea to contemplate, what kind of sick society requires such laws? Don't we have common sense enough to avoid toxic people in the first place?",
            "title_similarity": "0.72353464",
            "sentiment_compound": -0.8642
        },
        {
            "id": "gvon8x8",
            "score": 196,
            "text": "Saying that people who lie about birth control deserve to be punished is not the same thing as saying they actually should be punished for it.\n\nI'd just ask you to consider if it's a wise or practical idea to have courts so heavily intervening in intimate moments of relationships. Do we want our courts clogged with interpersonal spats that may hinge entirely on a few words in the heat of passion? Can we even expect the courts to pick out who is the liar and who is not with any real accuracy? How much money and time is going to be wasted not just by participants but by the taxpayer and the courts to settle personal vendettas in a sloppy and inaccurate manner?\n\nNow some may point out that we already do this to some degree with rape cases, but I'd contend only out of absolute necessity. We cannot afford to have any tolerance for sexual assault, and the unfortunate reality is this absolutely horrible crime sometimes hinges on a few words or acts in intimate settings. But just because we have no choice but to have the courts involved in these cases doesn't mean we should open the courts to all kinds of petty lovers' quarrels.\n\nThis is a big enough headache when it comes to sex that results in pregnancy. Both side may legitimately think they are telling the truth when in reality the birth control simply failed (none are 100%). But add in cases where it didn't result in pregnancy and there's no proof of anything. It's just a system when one emotionally hurt ex-lover can attempt to criminal punish the other. It's more likely to be used for extortion than anything positive.\n\nThen there's the problem of why should we stop there? Why not criminalize all lies that lead to sex, and given that two people in romantic buildup are rarely completely honest about their bad sides we can damn near make all intercourse criminal. We could have the government's blunt force applied to every hook up.\n\nThe idea of government intervening heavily in interpersonal relationships sounds like a gigantic nightmare if you ask me. Single people looking for relationships or even one night stands have to make their own judgment calls. There's no amount of law that's going to change that. You need to be good at determine who is honest and who is a liar, or alternatively accept the consequences if you don't really care. Absolutely make sure you personally take care of birth control and don't leave that to the word of someone you do not absolutely trust. Your solution is worse than your problem.",
            "title_similarity": "0.82918215",
            "sentiment_compound": -0.9957
        },
        {
            "id": "gvomocd",
            "score": 23,
            "text": "In theory, I agree. But practical enforcement in a democracy is impossible. \n\nPractically, actually, physically, historically, humanly and philosophically, it is impossible to distance the act of sex from procreation dispite the existence of birth control. \n\nThink about the enormity of what you are suggesting. Since the dawn of time, every single sexual encounter ran the risk of pregnancy. The concept of consistantly reliable birth control was non-existent. This is a modern phenomena. And that doesn't exist 100%, either.  \n\nUnless you had a written and enforceable signed contract before each encounter, and elected legislatures willing to pass  laws written to specifically to enforce such sexual contracts, and SCOTUS judges willing to uphold such laws, and juries willing  to convict based upon them, there is no chance. People lie. When there is no proof and the heat of the moment is paramount, people will lie.\n\n Therefore, there is a world of difference between \"should be enforceable \" and \"can be enforceable. \"\n\nAdditionally, why add this layer of legal complexity to an already complex social and altogether basically and intimately human situation?  Frankly, it's the ultimate in having your cake and eating it too. \n\nEvery time you drive a car, you accept the risk of a crash. That's why car insurance is mandatory. And it WILL happen eventually. Every time you fly in a plane, you accept that it might crash. That's why you carry life insurance. Every time you eat a greasy fat burger, you accept the risk of weight gain or a heart attack. That's why you have health insurence.  Every time anyone has sex, legally both parties are agreeing to accept the risk that the woman might become pregnant. Nothing is 100%. \n\nPart of being alive and experiencing all that life has to offer comes with risk. The same goes for sex.\n\nOne final point: regardless of any and all agreements before sex, all legal decisions hinge on only one thing: the welfare of the child. (Edit: Except for rape) no legislature, jury, judge or society is going to de facto punish a child (by jailing a parent) for the act that brought it into the world.\n\nEdit: It occurs to me that bungee jumping  is something similar to what you are suggesting. You want the thrill. They are willing to give you the thrill. There is some safety gear that you hope is sufficient. Everyone does what they can to keep you alive. You dont expect the worst to happen, but you still sign a waiver before you jump.",
            "title_similarity": "0.6477692",
            "sentiment_compound": 0.9719
        },
        {
            "id": "gvp6lkl",
            "score": 3,
            "text": "Or how about everyone just protects themselves? \"I appreciate that you're on the pill, but I'm going to wear a condom anyways\" and \"I'm glad you're wearing a condom but I'm still going to take the pill\". Why complicate things further? Everyone can protect themselves.",
            "title_similarity": "0.62671787",
            "sentiment_compound": 0.8823
        },
        {
            "id": "gvq2u69",
            "score": 2,
            "text": "The punishment is the child",
            "title_similarity": "0.38276005",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvqjkua",
            "score": 2,
            "text": "If someone lies about birth control, a vasectomy, or removing a condom mid sex it is technically rape.  The consent of the sexual contact is relying upon those things, so any of them being a lie is technically breaking consent which in turn is rape.  The same goes for many other issues.  Pregnancy, relationship status, std status, etc.  If you lie about something in order to trick someone into sexual consent, you are in fact raping that individual.\n\nProof is difficult.  Short of sexual contracts (which honestly should be a thing), most of these issues end up being a he said/she said scenario...which is why all of them continue to happen.  I don't judge anyone for casual sex, but I sure as hell worry about how they may be getting abused emotionally and physically due to partners who care more about themselves than anyone else.",
            "title_similarity": "0.8925078",
            "sentiment_compound": -0.9209
        },
        {
            "id": "gvqo2qh",
            "score": 2,
            "text": "This is a somewhat ridiculous idea for a law because it cannot work in practice. A person removing a condom is visible and can also be felt. If someone pokes holes in a condom there is physical evidence. It would be easy to prove a tubal ligation or vestictomy did/did not happen. \n\nHowever, a woman forgetting a pill for a day, taking it a few hours too late, being on antibiotics, throwing up, having a high weight and a number of other factors can make the pill fail. Knowing this, men should always wear a condom because no person is infallible. Anyone could easily miss a pill or have a stomach flu. Even if the woman didn't pick up her prescription at the pharmacy, she could claim she forgot that week. Trying to prove a woman intentionally and maliciously went off the pill in order order baby trap a partner would be almost impossible to prove. You have the burden to prove guilt with presumed innocence if you're working on the US model. It would be a huge waste of time and resources with nearly all the cases being dismissed or not brought to trial. \n\nAdditionally, laws like this are the reason women in some countries are prosecuted for abortions when they have had already suffered a miscarriage. You would almost certainly have cases where a woman threw up or went on an antibiotic and gets accused of assaulting their partner. \n\nIf you don't believe me about the difficulty of taking birth control pills at exactly the same time every day, because plenty of men have argued how easy it is, then I suggest picking a time and taking a placebo every day at the same time for a month. You would need to buy a pack of mints or something similar and mark them as special. If you lose the pack or don't have it on you that day you can't just run out and buy a replacement because that wouldn't work in real life with insurance and prescriptions. They've done it on Buzzfeed or some other similar channel before. It's more complicated than you think. Maybe you overslept your alarm one day, another day you don't have a drink on you so you need to swallow it dry (obviously not with mints), on one day you're at a friend's house for lunch/dinner, another time you're in the middle of a business meeting. If you try and choose a later time, maybe one day you're sick or exhausted and fall asleep early. Or better yet you're out at the bar and already had a few drinks so you forget. Maybe you get bad news about someone being in a car accident and need to drive back home without the time to pack a proper bag. Things come up all the time. No man should rely on his partner taking the pill if he 100% does not want children, nevermind the STD risks. Wear a condom or get a vasectomy that's the only reasonable choice unless a male version of the pill comes out so both parties can be protected.",
            "title_similarity": "0.7845174",
            "sentiment_compound": -0.982
        },
        {
            "id": "gvp42ep",
            "score": 0,
            "text": "There’s no way you can prove any of these claims.",
            "title_similarity": "0.23219684",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvpensl",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvpf2fu",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvph1mc",
            "score": 0,
            "text": "Morally I cannot disagree. We are talking about the law in this case though, imagine how a court battle between a couple is really going to go. 'Blood analysis shows no birth control metabolites in my defendant's blood your Honor, but she never claimed she was using such contraception to begin with.\"\n\n\"Nuh uh\"\n\n\"Uh huh\"\n\n\"Nah tho\"\n\n\"You knew the risks of having sex\"\n\n\"No u\"",
            "title_similarity": "0.7241781",
            "sentiment_compound": -0.4512
        },
        {
            "id": "gvpkflk",
            "score": 0,
            "text": "Would it not be more practical to only make deceit(regarding birth control/fertility) a punishable offence on the man’s behalf only? It’s 1. A lot more practical to enforce, since any man with a vasectomy would have a medical record and 2. If a women lies to a man regarding birth control, the only person who will suffer any tangible consequence is herself",
            "title_similarity": "0.84050477",
            "sentiment_compound": -0.886
        },
        {
            "id": "gvpsyy4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvpt15m",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvpv7yr",
            "score": 0,
            "text": "Alright... Just curious to get some opinions here..\n\nWhat if the girl says she can't get pregnant...but does?",
            "title_similarity": "0.54263836",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvpwf3d",
            "score": 0,
            "text": "So... clarifying question: do you know of any jurisdiction anywhere that, if you could actually prove this in a court of law, you would not be able to sue them for this?\n\nFraud for any reason can generally be sued for. \n\nIf you're talking about *criminal* punishment, then just no. It is literally impossible to prove this \"beyond a reasonable doubt\". It might be able to be proven in a colloquial sense (or to prove it to the standards required in a lawsuit, which are less). But in criminal court? Never going to happen.\n\nAnd furthermore, it shouldn't. It's a tort, not a crime.",
            "title_similarity": "0.60924816",
            "sentiment_compound": -0.8418
        },
        {
            "id": "gvpxgrl",
            "score": 0,
            "text": "It is a as punishable offense I’m many places, and that offense is rape. If a person consents to sex while using birth control pills/a condom, and then their partner deliberately goes back on that, it means there’s no consent anymore.",
            "title_similarity": "0.8730011",
            "sentiment_compound": -0.8825
        },
        {
            "id": "gvpy0gk",
            "score": 0,
            "text": "I don't think we need more government intervention into people's personal lives in the bedroom. \n\nAlthough this may sound a tad patronizing, get to know and trust the person you plan to sleep with before you do. Don't make assumptions in the moment and be careful. If anyone purposefully and maliciously tries to trick someone into pregnancy, that is a major issue of character/mental stability and I would imagine there should be red flags ahead of time.",
            "title_similarity": "0.7551256",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gvpyxjs",
            "score": 0,
            "text": "Idk, I think the social consequences are enough, we don't need to make it a criminal offense. If my girl lied to me about birth control, she would suffer the consequences of a pregnancy or the fallout of our relationship. Yeah, it sucks that I could potentially become a father unwillingly, but that has always been a downside to being sexually active.\n\nI just don't see the need to punish people for essentially breaking trust with their partners. I mean, it's kinda the same reason that adultery isn't a crime most places. It will fuck up your life, but you won't go to jail for it.\n\nAlso, is it really the government's job to protect you from, what, hurt feelings? I mean, unless it results in a child or the consent is in question, is it really anybody else's business?",
            "title_similarity": "0.7518302",
            "sentiment_compound": -0.7495
        },
        {
            "id": "gvpzj30",
            "score": 0,
            "text": "Birth control isn’t probable nor 100% effective. They have apps that provide algorithms now that show green days and red days- red days being abstain or extra protection because you are fertile. Hypothetically both people could have the app to view the woman’s fertility and therefor take some of the burden off the woman for “birth control”.",
            "title_similarity": "0.58475673",
            "sentiment_compound": -0.6656
        },
        {
            "id": "gvq0wq8",
            "score": 0,
            "text": "It’s just too he said she said-y there’s literally no way to prove a conversation happened. It’s unclear to me why someone would even lie about being on birth control. Perhaps to eliminate the use of a condom? I’ve never been on birth control though and most guys I’ve been with are cool with no condom as long as we both know we’re both clean. \n\nI am aware the pull out method is the worst form of birth control if you could even call it that but in my specific situation I have a very low and possibly zero chance of pregnancy so tbh I am comfortable with the pull out method. \n\nFelt like I needed to say that in case anyone reads this and starts coming at me about how irresponsible I am. I know that’s still irresponsible on some level but I can’t be on birth control and I’m just not willing to have condom sex my entire life.\n\nAlso I don’t know why but it’s funny to me that it’s never crossed my mind that saying you’re already pregnant could be a possible way to get someone to have unprotected sex with you. That’s terrible and I don’t condone it but I feel like that would be a story line in a sitcom or something.",
            "title_similarity": "0.6786822",
            "sentiment_compound": -0.5632
        },
        {
            "id": "gvq1ngx",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq2no3",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq3ahz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq3sxt",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq4uj9",
            "score": 0,
            "text": "You can still use condom if you don't trust that person.  The legislation you are proposing is more prone to misuse than to be actually able to prove the fraud. Condom related laws seem ok cause it has STD angle and it's easy to prove if the sex was unprotected. At the end of the day a law is based on more than just moral dillemas. Practicality, prone to misuse, infringement of other rights etc has to be taken into account.",
            "title_similarity": "0.70552707",
            "sentiment_compound": -0.7907
        },
        {
            "id": "gvq6m4p",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq6me5",
            "score": 0,
            "text": "It’s a dangerous fallacy to equate morality with legality. Yes, lying is morally wrong, but it’s only legally an offense in specific circumstances. \n\nHere are some reasons that you should consider: \n1. He said / she said issues generally die in the courts. There’s basically no way to prove this. \n2. Taking off a condom is not the same as lying about birth control. The main reason being STD exposure and consent to this risk. Not really relevant here, but birth control is a lifestyle and often causes bad side effects while condoms are a cheap and easy option. Men seem to look for any reason to not use them. \n3.  Regardless of what your partner tells you, you’re still ultimately responsible for your own choices and your health. \n4. Basically no women takes birth control exactly how it’s prescribed. The best way is to take it at the same time every day but often this time is approximated or a day is missed. There’s just a huge grey area between “not on birth control” and “max protected by birth control” that would be impossible to legislate. \n5. BC isn’t 100% effective so you’d have men take women to courts and subject them to blood tests / medical examination if they got pregnant while purportedly on BC to prove their case? \n6.  You didn’t specify but usually people propose that the man wouldn’t be responsible for the baby if they were “tricked” into pregnancy. This essentially only hurts the child and not the mother. Child support is for the child, the blameless party here.",
            "title_similarity": "0.7696929",
            "sentiment_compound": 0.6428
        },
        {
            "id": "gvq8bli",
            "score": 0,
            "text": "I would suggest that even if it should be an offence and might even already be covered in some jurisdictions under the laws regarding deception there's little point in your emphasis of \"punishable offence\" as any law specifically written for it is going to be pretty much unenforceable.  Specifically I'm looking at the offence of rape right now and how when it occurs within the context of a sexual relationship the he said/she said makes it nearly impossible to prove.  \n\nThe benefit of making it an offence under law specifically is simply as a social constraint or driver of change.",
            "title_similarity": "0.71027213",
            "sentiment_compound": -0.9022
        },
        {
            "id": "gvq92ee",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq9kmq",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq9n7j",
            "score": 0,
            "text": "This is why as a man, me and my wife used a condom until the night before our wedding. Ain't trusting anyone with that. Consequences are just too huge to trust.\n\nUnfortunately, women don't have the same tools. Ghosting is disgusting and definitely rape in my mind. I would agree with the above being legal doctrine. Main issue is how do you prove these attacks? Innocent until proven guilty makes these sorts of thing hard to enforce.",
            "title_similarity": "0.84194785",
            "sentiment_compound": -0.7317
        },
        {
            "id": "gvq9scy",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq9txn",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqah8w",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqas6y",
            "score": 0,
            "text": "So genuine question to anyone who supports this: exactly how do you think this would work? \n\nCan any random guy/girl claim they were lied to about this at any moment and start a criminal investigation? How would that investigation go? The burden is on the prosecution to prove the crime, how would that ever work?\n\nAnd realistically, how much time/effort/money would the police actually spend investigating this? In a country where thousands of rape kits go untested.",
            "title_similarity": "0.7495649",
            "sentiment_compound": -0.9626
        },
        {
            "id": "gvqbrob",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqc7ku",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqcd7a",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqdwhj",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqei74",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqembu",
            "score": 0,
            "text": "I agree in principle. There are places where removing a condom without your partner’s knowledge or consent (stealthing) is legally considered rape. Because the partner (male or female or other) did not consent to unprotected sex. Under this standard lying about or stopping birth control without telling your partner should also be considered a type of rape because they consented to have sex with a reduced risk of causing pregnancy. They did not consent to sex without any precautions in place. \n\nHowever, the difficulty I have with this is the impact on any resulting child. If a mother is convicted of this crime how does that affect child care/support? Does conviction automatically waive legal and financial responsibility on the fathers part? You can bet this is an argument that would be made in court and, in the US at least and with the current make up of the judiciary, I can definitely see the argument succeeding. \n\nAnd how would it apply to failure rates? Condoms break, birth control fails. People make mistakes and sometimes there is just a moment of passion. There are also moments of intoxication where, technically, no one is able to consent due to being impaired. Still, if everyone was drunk/high and she wasn’t in a state to tell him she’s not on birth control where does the fault lay? Did he rape her because she couldn’t consent or did she rape him because she was too drunk to remember to tell him? \n\nAnd how does this apply to the aforementioned stealthing? Whose crime is the worst? If she consented only to sex with a condom is she still legally bound to inform him of her birth control status? Can his conviction be overturned because of her failure to disclose?\n\nThis is one of those topics that really to seem straightforward at the outset but get more Gray the longer one thinks about it. To summarize:\n\n1. This has the potential to create a loophole for people to escape financial and legal responsibility for any child born as a result of this sex act (and both parties accepted the general risk that comes with sex)\n\n2. If the responsible party is intoxicated they could inadvertently and unintentionally violate this law. This could have long ranging legal and financial repercussions when there was no intent to cause harm and the party was not on a position to consent in the first place. \n\n3. This could be used to further harm victims of sexual assault in that legal developments and precedents may impact how their assault can be prosecuted if they did not disclose to their assailant. After being raped the last thing anyone needs to do is be charged with rape in turn (at any degree) because they didn’t mention their birth control status. \n\n4. There are myriad situations where intentional offenders or dead beat dads could manipulate the system such that a law pertaining to this could be used to favor physical and violent offenders, even when there was no intent on the part of the female to manipulate or not disclose the information.",
            "title_similarity": "0.8926573",
            "sentiment_compound": -0.9972
        },
        {
            "id": "gvqenm0",
            "score": 0,
            "text": "I agree, but I think it’s unprovable, unless you have texts or some other communication where the person admits to the deception. I think a good rule of thumb is to always be in charge of your own contraception. Plus, vasectomy babies exist, as do babies who were conceived when the mother was on birth control. When my husband and I got together, we were in no position to be having kids. I was on birth control, he used a condom, and we used spermicide. We really didn’t want kids at that particular time in our lives (we were quite broke and I was still in college).",
            "title_similarity": "0.78632",
            "sentiment_compound": -0.3657
        },
        {
            "id": "gvqf1f1",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqfzoh",
            "score": 0,
            "text": "Not punishment; we should normalize relationship contracts. The undesired outcome would be the \"punishment\".\n\nIf they sign a contract saying that they don't intend to have kids, are supposed to be on birth control, and still get pregnant...then the man doesnt need to pay child support if the woman decides to keep the child against his will. If she aborts it, he pays for the abortion. If the man wants the child and not the woman, some sort or negation or secondary contract could easily transition that into a payed surrogate situation or even just a custody sharing arrangement. \n\nThis ties in neatly with various other aspects of family planning and custody. \n\nIt's pretty simple, really.\n\n\nThere shouldn't technically be a \"punishment\".\n\n\nPeople should just have clearly defined expectations, and zero contract means zsro expectations or goals.  If you have a plan for your life, put it in writing.",
            "title_similarity": "0.78298557",
            "sentiment_compound": 0.8939
        },
        {
            "id": "gvqgaou",
            "score": 0,
            "text": "You gonna punish everyone that lies to you as well? You get punished if you give an incurable STD...",
            "title_similarity": "0.7606789",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gvqgyqf",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqhtu0",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqhuf3",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqib4y",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqikbp",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqiun4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqjipn",
            "score": 0,
            "text": "It already is",
            "title_similarity": "-0.12842084",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqjz2e",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqk93b",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqkr1o",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqkrl3",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqla7a",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqloq4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqn2sm",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqn2yb",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqoahy",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqoku8",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqomgu",
            "score": 0,
            "text": "How about everyone be responsible for themselves. After I had a child as a teen, we used the pull out method, I decided if I don't want anymore kids it was up to me. We all know how making babies works and should know how to prevent it. Why is it such a surprise when \"accidents\" happen?",
            "title_similarity": "0.63770616",
            "sentiment_compound": 0.2448
        },
        {
            "id": "gvqoo52",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqpejk",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqpgbm",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqpolz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqpuye",
            "score": 0,
            "text": "Given that the methods arn't 100% effective, it's hard to argue that you were under the impression that there was no chance of pregnancy, when there always is outside of complete infertility.  \n\n\nSo, you're not being led to belief it's safe when there's a risk; You're simply being led to believe that the risks are lower than they actually are, which isn't as severe.  \n\n\nAlso, it's so hard to prove that it wouldn't be enforceable.",
            "title_similarity": "0.6225878",
            "sentiment_compound": -0.7489
        },
        {
            "id": "gvqqdsk",
            "score": 5,
            "text": "It would be EXTREMELY difficult to prove any of these accusations in a court of law. People lie. Even under oath. “The rubber slipped,” “I never told her that,” “I never told him that,” etc. \n\nWhat should be considered is the aftermath of such a sexual event. And, the male should be just as responsible for the health of the mother as the health of the child. Or, share financial responsibility for the abortion and for the woman’s health. \n\nThe more responsibility that can be shared by both, the more thinking will go into the action. Unfortunately all of our laws are still based on biblical times (when Babylon was still flourishing).",
            "title_similarity": "0.7732549",
            "sentiment_compound": -0.3239
        },
        {
            "id": "gvqr4n9",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqr8ik",
            "score": 0,
            "text": "It happens. Hooked up with an ex during a bad on again/off again break up (if ya know ya know). When we were together, she had an IUD. During an “off again” period between us, she had it removed. \n\nSo we run into each other outside of a bar after a month-ish of no-co. Chummed it up, end up having a roll in the hay in a parking lot in the back of her Subaru. Great, just like old times. A few weeks later, I get a text “I’m pregnant”. Never mentioned anything about having her iud removed until I asked about it after she tells me that. Like cmon man. \n\nShe debates on keeping it for a few weeks, which were some of the most anxiety riddled weeks of my life. We wound up going half n half on the ol thing. Actually spent a lot of quality time and probably extended the whole breakup process another 6 months before another crash and burn. Still miss her.",
            "title_similarity": "0.51831007",
            "sentiment_compound": 0.079
        },
        {
            "id": "gvqrij2",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqrw30",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqs1l0",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqsa0x",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqsae4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqsmo5",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqt14y",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqt7aq",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqup0k",
            "score": 0,
            "text": "I had to deal with the opposite of this. My ex girlfriend lied to me and made me think we were having a baby because her period was months late. \n\nEven tried to force me to marry her and have a kid at our young age even though I said no. I was promptly hated after saying no.",
            "title_similarity": "0.7568743",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gvqvoqn",
            "score": 0,
            "text": "Problem solved for me.. I unfortunately or fortunately have only cam inside a woman twice in my life.  I am a master puller outer.. no kids coming from me in the messed up  world.. how do u even talk to your kisses about these crazy times and tell them our last 4 generations killed the planet and u have to fix it.. good luck",
            "title_similarity": "0.5457272",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gvqvxdh",
            "score": 0,
            "text": "The thing is birth control shouldn't be on one partner alone. If either party was truly concerned with unwanted pregnancy then it is also their responsibility to take precautions, regardless of if the partner claims to have vasectomy/tubes tied or on birth control. It's both parties responsibility, and blindly believing what a partner claims is not a good enough excuse. If you don't want to have a baby, then make sure you don't- use protection, use the pull out method- (90% effective) but don't be careless because you decided you would entrust that responsibility to your partner, who could be a total stranger. Seriously, your own sexual protection, STD or pregnancy should be on YOU. Personally if you're sexually active and don't want STDs or unwanted pregnancies why are you screwing around without protection? And then you want to blame others? Uhmm hello take your own precautions, don't cry foul cuz your lazy ass decided not to care.",
            "title_similarity": "0.7517448",
            "sentiment_compound": -0.8258
        },
        {
            "id": "gvqwfme",
            "score": 0,
            "text": "This whole article is basing its support on morality, yet whose morality? \n\nGod says if you have sex outside of marriage (like all the people in this article are doing), you should be punished. \n\nWell of course we don't want God's morality. We want to make up our own morality that we like.   \nFine, make up your own morality, but don't judge others whose morality says it is ok to lie to their fornication and adultery partners.",
            "title_similarity": "0.8466707",
            "sentiment_compound": 0.771
        },
        {
            "id": "gvqx5ns",
            "score": 0,
            "text": "The fact is that this IS already a punishable offense. Consent is conditional by nature; if you consent to sexual activity under the condition of existing birth control and then someone engages with you in a sexual way without meeting that condition, it is sexual assault. \n\n\nThe issue is that pursuing a civil case for this, when it's borderline impossible to prove that the conditions were established beforehand, is costly and time consuming. Folks who became pregnant will be preoccupied with sorting the financial and emotional turmoil involved in perusing their options. *Personal bias here, but I hold less sympathy for the person with a penis. Use a condom or run the risk; there is no such thing as a perfect BC option.*",
            "title_similarity": "0.83914924",
            "sentiment_compound": 0.0285
        },
        {
            "id": "gvr1j1z",
            "score": 0,
            "text": "If you're a man and your partner lies about birth control then do you really think that a court would do anything? Women can already ruin your life with a false accusation and there really isn't anything you can do about it",
            "title_similarity": "0.8471592",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gvr1v0w",
            "score": 0,
            "text": "When you decide to have sex, you take the risk of getting pregnant. It’s not cool to deliberately lie to your partner, but it’s also possible to get pregnant even using those safety measures, and some people don’t realize that birth control takes a while to kick in once you start taking it, so they start too late when becoming active w a partner. Obviously men have more control when it comes to pulling out/keeping the condom on in this scenario, so if anything the man should have to face some sort of consequence for those types of actions, since unless the female doesn’t engage/want to engage in sex it is not something she can control or even know about.",
            "title_similarity": "0.82044125",
            "sentiment_compound": 0.8526
        },
        {
            "id": "gvr2g3s",
            "score": 0,
            "text": "Rape by omission already is a crime.\n\nOne that applies to guys who say they'll marry a virgin but don't but somehow doesn't apply to people who lie about age, birth sex, and birth control status.",
            "title_similarity": "0.84957",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gvr4bhb",
            "score": 0,
            "text": "That’s how I ended up with my first kid. We’d been together 4 years, no talk of kids etc. I came home from work one day and was told I was having a kid. I threw up, I love my daughter but I’ll always resent my ex for deliberately stopping her pill without discussing it with me first.",
            "title_similarity": "0.560474",
            "sentiment_compound": -0.09
        },
        {
            "id": "gvr54r1",
            "score": 0,
            "text": "Can you imagine getting called into court for something you didn't do, and there's no possible way to disprove the claim, you have to simply hope/trust that a jury of random people will determine the truth?\n\nLaws like this don't exist already for a reason, and it's because convicting someone of a crime is a long and expensive process for society and everyone involved. We have a backlog of trials, there are people waiting to be exonerated through the examination of physical evidence. You don't want to hold up this process listening to people argue back and forth.  ​\n\nSo that being said, how could this ever be proven? A couple would have to be filming a narrated sex tape,\n\n\"It's september the third, 6pm, I'm here with my girlfriend and we're gonna have sex. And she is on birth-control, as per the text conversation that took place this morning\" \n\nAnything short of that and you basically have to take someone on their word. There would be so many wrongful convictions.",
            "title_similarity": "0.6876948",
            "sentiment_compound": -0.2691
        },
        {
            "id": "gvr7i8z",
            "score": 0,
            "text": "Women will never be held accountable for any decisions when a man can be blamed. Just look at the court systems, especially divorce courts. America is more sexist that most people realize.",
            "title_similarity": "0.6462796",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvr7jt9",
            "score": 0,
            "text": "If you’re really concerned about pregnancy just use your own birth control. Even if you have good reason to trust your partner, there’s always some risk. There’s really no need to criminalize even more conduct than we already do. If you don’t want kids, don’t rawdog it.",
            "title_similarity": "0.66491973",
            "sentiment_compound": 0.4417
        },
        {
            "id": "gvr8c2o",
            "score": 0,
            "text": "I have always thought this. The law should be, if you are having consensual sex, there should be a legal document signed that if she is pregnant, the male is held accountable. Otherwise, he would not be held accountable. That includes child support or any other medical bills. \n\nThis should deter some women from getting pregnant from several men and just to seek child support. That is horrible for the child and for an unsuspecting father that wasn't ready. Would it be a perfect system? No, but we need to start somewhere. \n\nWho's with me to start a petition to our leaders in office?",
            "title_similarity": "0.8176782",
            "sentiment_compound": 0.432
        },
        {
            "id": "gvr992y",
            "score": 0,
            "text": "the situation you agreed to isnt the one happening, it can be considered sexual assault. ive only seen it with removing the condomn all sneaky like, but it could apply to any of these situations.",
            "title_similarity": "0.7316528",
            "sentiment_compound": -0.1406
        },
        {
            "id": "gvr9bbm",
            "score": 0,
            "text": "I don’t think irresponsible sexual activities like OP mentioned should be punished by the law. I think people should just be accountable for their actions and elect to use protection for themselves and not rely on their partner to do it. \n\nI don’t want to have my tax dollars to have to go towards someone’s public defender who is suing because a random that they consented to sleep with lied about birth control. If you decide to have unprotected sex that’s a personal problem not a legal one.",
            "title_similarity": "0.77110684",
            "sentiment_compound": -0.8994
        },
        {
            "id": "gvr9uwg",
            "score": 0,
            "text": "My **EX** told me after having unprotected sex , \"Oh man I can't believe I haven't taken my birth control in like a week\" needless to say after a 2 year relationship she didn't understand why I was angry and refused to have sex with her.",
            "title_similarity": "0.68584526",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gvrajh2",
            "score": 0,
            "text": "I’m willing to pay extra taxes for a lot of things, but I’m not willing to pay extra taxes to try to enforce something like this.\n\nAlways wrap it up and protect yourself.  Don’t stick your dick in crazy or don’t let crazy dick stick it in you.  \n\nBe responsible for yourself and you probably won’t have to deal with this kind of nonsense.",
            "title_similarity": "0.5349195",
            "sentiment_compound": -0.8819
        },
        {
            "id": "gvrao7u",
            "score": 0,
            "text": "Had a woman lie to me about being on birth control - she intentionally got pregnant, under the assumption I'd be ok with that and we'd just get married and live happily ever after. It wasn't an accident, in her own words \"you're so good with (my daughter) that I know you'd make a good father\" and so on. She was a young single mom without much in terms of financial stability and her ex was a complete dead beat dad, no child support etc. I had just graduated college and got a job with the state.\n\nI had no plans on having children that young in life, I had just finished school and I wanted to enjoy the freedom. I'm 100% pro choice, and recognized it then, as I do now, as being her decision. However, here's how I framed it, because I wanted her to get an abortion: \"You can have that child, and I'll pay child support etc., but I will never participate in his/her life. You made this decision without me, this is your child. I will never speak to you again.\" I doubt I would have made good on that promise, but the threat worked. She got an abortion. Fast forward 5 years and she'd had two kids with someone else, a coal miner who liked to beat her up. IDK where she's at now. I dodged a bullet - if she'd lie about something like that, nothing was beyond her.\n\nSO fair warning to those who want to make this decision on behalf of someone else, without their knowledge/consent: it's ultimately your choice/body, but those decisions have consequences that can last a lifetime. Accidents happen all the time, and that's an entirely different set of circumstances - but consciously deceiving someone will come back to haunt you. Maybe not today, maybe not tomorrow - but if this is how you operate, it will catch up to you some day. And in this instance, there was an abortion that could have been entirely avoided, and that's something she's going to have to live with for the rest of her life.\n\nI'm sure something like this could be tried in civil court, possibly family court as well. If not, once men are more empowered in terms of parental rights etc., I'm sure this will be made a criminal offense. Yes it would be hard to prove, but cell phones record audio and it might get allot easier to prove in the near future.",
            "title_similarity": "0.6578771",
            "sentiment_compound": 0.7293
        },
        {
            "id": "gvrawv5",
            "score": 0,
            "text": "OP I 💯 percent agree with you!! But it's too hard to prove. Unfortunately not everyone can be a decent f*cking human.  \n\nEven with BC, you still have a chance to get pregnant. so don't play with fire unless you're willing to get burned, if you're not careful! Simple as that imo",
            "title_similarity": "0.6989017",
            "sentiment_compound": -0.5282
        },
        {
            "id": "gvrbeyk",
            "score": 0,
            "text": "You should be aware that birth control can fail. Nothing is 100%. If it’s important to you then protect yourself. I fully support ALL men getting vasectomies before they ever have sex with a woman until they are in a committed relationship and both agree they’re trying for children. Then they can get a reversal, sperm bank deposit or adopt.",
            "title_similarity": "0.6879571",
            "sentiment_compound": 0.8016
        },
        {
            "id": "gvrbf53",
            "score": 0,
            "text": "It is, in the UK it’s considered rape.\n\nThis is because the agreed circumstances before the act were changed and appropriate consent could not be given.\n\nSource: Study Law, wrote an essay on it last month",
            "title_similarity": "0.667535",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvrdfww",
            "score": 0,
            "text": "You are responsible for your own genitals, the only punishable offense is a man taking the condom off mid way without consent. Everything else be a fucking grown-up, if your a man without a vasectomy wear a condom, if your a women either take birth control or require your partner to wear a condom. Once you agree to sex without a condom, or even to have sex, you better be ready for possible consequences. No birth control is 100 %.",
            "title_similarity": "0.8134569",
            "sentiment_compound": 0.3472
        },
        {
            "id": "gvrg06d",
            "score": 0,
            "text": "I was under the impression that lying about vasectomies, removing the condom and lying about birth control was considered sexual assault if not rape as one of the parties is unaware that the other party is being deceitful.",
            "title_similarity": "0.8801177",
            "sentiment_compound": -0.6442
        },
        {
            "id": "gvri9v2",
            "score": 0,
            "text": "This is actually a punishable offence in a lot of places, as if infringes on consent if your partner only explicitly consented to protected sex. Proving it was an intentional lie is very, very unlikely to be possible in most cases, though, just as it's incredibly difficult for women to prove rape. It also needs to be said that birth control fails, and people forget to take the pill quite often. Imo this is actually a pretty slippery slope",
            "title_similarity": "0.81188285",
            "sentiment_compound": -0.8516
        },
        {
            "id": "gvrjp5r",
            "score": 0,
            "text": "I think that consensual sexual relationships are based on trust. If you don't trust your partner's word or for some reason worry about deception, you can always choose not to engage sexually. Doling out \"Punishments\" is kind of backwards when thinking about the justice system. Taking sexual partners to court to punish them is immature in thinking for starters. The person being taken to task about this could easily countersue a sexual partner for harassment and/or mental anguish for doing the deed with them and then suing them over it. This is more of the realm of social competence. The court will ask why you engaged in sex with a person who you felt was deceiving you about this very matter. What kind of \"punishment\" do you think they would receive? None. What kind of punishment would you be looking for them to receive? To be barred from engaging in sex with the plaintiff without birth control in place? That ship would have already sailed!",
            "title_similarity": "0.82689714",
            "sentiment_compound": -0.9677
        },
        {
            "id": "gvp4zta",
            "score": 14,
            "text": "The biggest issue with this **good practice** you’ve described is that it runs afoul of the right to privacy. (In America, but possibly in other countries) medical privacy is heavily protected, and for good reason (I believe this is self-evident, so I won’t elaborate on it here, but I’m happy to dig into that if you disagree that medical privacy is important). \n\nTo that end, I think I agree with regards to condom usage, but I have a hard time in particular with this:\n\n> If a woman has previously taken birth control pills and then decides to stop taking them, she should be legally obliged to tell her sexual partner(s) about it before having sex with them again, if she has previously told them that she's on birth control. Same applies for a man who decides to reverse his vasectomy.\n\nAny persons medications, surgeries, treatments, etc. is strictly their business (and their doctor’s, and their power of attorney’s). While being honest in these matters is the right thing to do 100% of the time, to legally require what you’ve laid out (especially in the quoted section) would be a direct violation of privacy law (HIPAA* in the USA). This is not a freedom I think should be compromised, therefore I must disagree with your view.",
            "title_similarity": "0.7396152",
            "sentiment_compound": 0.7984
        },
        {
            "id": "gvozap3",
            "score": 9,
            "text": "/u/fluid_reference (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/mxjuyv/deltas_awarded_in_cmv_lying_to_a_sexual_partner/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.509834",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvoyvns",
            "score": 13,
            "text": "I’m with you except when it comes to the bc pill. Part of the problem with the pill is consistency. Taking it every day at the exact same time. When I went on it doctors didn’t tell me how important this piece was. As a result I had friends and even myself claim we are on it, which was true. But hours would be missed and sometimes even days. But in our heads we were like, yep we are on it.",
            "title_similarity": "0.5224371",
            "sentiment_compound": 0.6956
        },
        {
            "id": "gvpkeli",
            "score": 11,
            "text": "Eh, I think the punishment is just your life, in general. Being that kind of shitty, your life isn't going to be rewarding. You'll never truly be comfortable with yourself.\n\nRegardless of how you judge someone else, though, birth control is always a personal choice. *He* wears a condom because *he* doesn't want to have a child right now. *She* uses a birth control method of some sort because *she* doesn't want to have a child right now. Neither of them should be relying upon the other. If you don't want to have a child, use birth control. It's a personal responsibility.\n\nHow many tens of thousands of men are paying child support right now because, in the moment, they couldn't resist the urge to do it without protection? It doesn't even have to be because she lied, it could be because her birth control had that 1 in a 100 chance of not preventing pregnancy that day.\n\nHow many women have had unwanted children or unwanted abortions because they trusted him in that moment? *I'll pull out* or *I've had a vasectomy* or *You can't get pregnant if your period is X days away in some direction* or *Don't worry, I've got a condom.*\n\nProtect yourself.",
            "title_similarity": "0.77361137",
            "sentiment_compound": -0.5183
        },
        {
            "id": "gvp769r",
            "score": 1,
            "text": "Lying in general should be a punishable offence.",
            "title_similarity": "0.49979573",
            "sentiment_compound": -0.8176
        },
        {
            "id": "gvpbi8h",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvpjkjb",
            "score": 1,
            "text": "You can’t ask anyone to prove they are taking birth control, let alone properly. If you don’t want a baby, bag it up. You do actually have the option to protect yourself.",
            "title_similarity": "0.5971075",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvpvfyq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvpzv55",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq52n2",
            "score": 1,
            "text": "Personally, I think we need to stop criminalizing sexual activity. It is somewhat perplexing to me that atheistic persons trash religion only to replace it with functionally the same thing. That is, guilt-ridden sexual encounters where you mostly fear making a misstep that will result in severe punishment.\n\nI do believe that criminalizing any aspect of sex is against the public interest, with the exception of obvious exclusions like rape.\n\nIt is just impossibly unfair to wager the state of mind in the moment against a future state of mind. This sort of criminalization is functionally equivalent to a thought crime and should be banned.\n\nRape to me should basically entail involuntary invitation to sexual performance and that is it.\n\nWe want to live in a society where people are not too scared to fuck for goodness sake. News flash: it’s important for society’s continuation into the future and is one of the only truly great things about being alive.",
            "title_similarity": "0.8032477",
            "sentiment_compound": -0.92
        },
        {
            "id": "gvq7529",
            "score": 1,
            "text": "Unless we are talking about the arm implant or IUD, it is effectively impossible to prove that your partner has lied about being on birth control. Birth control pills have a failure rate of 9 percent with typical use, and there are a hundred ways it could have been accidentally inactivated rather than the man being “baby trapped”. Left the pills in hot purse by accident or straight up forgot to take one in the morning (I know I’ve forgotten to take my medicine many times) could result in an accidental pregnancy without any malicious intent.  There’s also absolutely no way to test if hormonal BC has been used correctly as far as I know - should all women have to take a monthly blood test to compare their normal hormone levels vs the levels while on BC?  Putting aside that it’d be a cruel thing to do, hormone levels can swing naturally from conditions like PCOS. Making it punishable by law would result in either no convictions, or many women being wrongly accused of deceit.",
            "title_similarity": "0.73208284",
            "sentiment_compound": -0.9678
        },
        {
            "id": "gvq8gae",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqgn5r",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqkbp7",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqpsvz",
            "score": 1,
            "text": "Uh no. Not sure where youre from, but in the US the first ammendment guarantees everyone the right to lie as long as the lie is not directly linked to monetary fraud. Thats why the police cant arrest people simply for lying to them. Thats why you can tell your parents youre a christian when youve been an atheist for years without the cops coming knocking. Your GFs going to lie to you if she wants. Thats her business. Dont like it? Find another GF.",
            "title_similarity": "0.75143254",
            "sentiment_compound": -0.908
        },
        {
            "id": "gvr7hnt",
            "score": 1,
            "text": "No no no no no.  This title sounds reasonable.  But the title applies only (yes, primarily) to females.  This is a one-sided idea for a law.  This idea forgives men for being lazy, horny, undersexed, under-thinking little shits.\n\n\nsource: am man",
            "title_similarity": "0.6392602",
            "sentiment_compound": 0.3552
        },
        {
            "id": "gvrj4mf",
            "score": 1,
            "text": "I actually agree almost completely, but to avoid a \"he said she said\" scenario you'd have to involve paperwork/contract stating with a signature, and that immediately puts the partner in a position of feeling distrusted, and even if not; birth control isn't effective 100% of the time just like a condom isn't. Meaning, the person technically liable in this situation could be totally innocent and non-malicious. The whole no condom thing I thought was actually a joke in entertainment, of course they should be punished, and to the absolute max. You don't do something without someone's consent, especially sexually. That being said, I have a feeling if I was a female I'd be making sure to look at least once to see the condom on out of habit. That could just be me, though.  \n\n\nBut yeah, I actually agree with you as the thought is a good sentiment and concept, but totally fails when you transfer it onto paper.  What I mean is, good luck doing that on Tinder, people are shitty enough as it is yet alone signing a contract saying you're on birth control, or had a vasectomy, which could have legal action taken against you if it isn't even your fault and fate comes by chance. Enough people even get upset hearing about prenups yet alone something that can fall through that wouldn't even be their fault if not malicious.   \n\n\nHope my opinion speaks a bit to you, if not, sorry for wasting your time OP.",
            "title_similarity": "0.8273932",
            "sentiment_compound": 0.3762
        },
        {
            "id": "gvonmmd",
            "score": 22,
            "text": "You just listed things you wan to happen. Can you explain the WHY part?",
            "title_similarity": "0.256505",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpjbke",
            "score": 8,
            "text": "Much of my argument has already been said, but I will add my voice to the chorus. \n\nIn short: you believe law is about right and wrong, when in practice it is about what you can afford to prove. \n\nWhile I agree lying about birth control by any party is essentially rape, I believe that the current structure makes it far more likely for women to be successfully prosecuted than men, given the fact that \"the pill\" must be prescribed. Justice is not justice when it cannot fairly address the problem.\n\nI am someone who was \"stealthed\" many years ago. It was the era of AIDS: we absolutely had \"the conversation.\"\n\nI would point out that people know that what they are doing is *wrong*-- otherwise they wouldn't be lying about it. If the spectre of an accidental/unwanted (by one party) pregnancy doesn't deter someone I'm not sure legal consequences would either: the moral failure already exists.\n\nThese kinds of cases would be difficult and expensive to prosecute. Inevitably, it becomes a he said/she said case. She said \"I told him my birth control lapsed.\" He said \"She didn't.\" The problem is that it is much easier to show a woman never purchased the pill than it is to prove a man didn't have a condom (or didn't put on the one the woman provided). I worry that the number of women successfully prosecuted would far outstrip the men, although I suspect that the number of men who commit this transgression is far higher, as traditionally men shoulder less of the burden of children and therefore, less of the risk. I suspect that the man who stealthed me probably calculated that the risk to him was relatively low. \n\nI have fantasized for years about calling him and letting him have it, or publicly outing him as at least a one-time asshole. Do I wish I could have prosecuted him? Perhaps. Perhaps knowing I could would have made him pause and act differently. I do know that actually prosecuting him successfully would have been near impossible at the time. It is my understanding that stealthing has been included in rape laws-- I would be curious to know how successfully such acts have been prosecuted. \n\nSomeone earlier made an analogy about driving: drunk driving is only prosecutable because we can factually test to see if it is true. \n\nUltimately, sex requires two people, who enter together into what is essentially a high risk activity. I've come to the conclusion that both have independent responsibility for managing that risk for themselves. We know, when we choose a partner, that the possibility exists that they may be lying in fact or by omission (the STD they don't know they have). Love or alcohol may blind us to the true scale of that risk, but that lapse in judgement doesn't absolve us of our part of the responsibility. I chose to sleep with the man who stealthed me. Did he consent to using a condom before we had sex? Yes. Was he an asshole? Yes. In a perfect world should I have been able to prosecute him for rape? Yes. \n\nBut I knew at the time that the world was imperfect, that having sex was potentially a life and death choice (it truly was at the height of the AIDS epidemic), and I consented to sex with him. I suppose some will cry victim blaming at my perspective and so I want to be clear: This does not absolve him. He bears the greatest percentage of that responsibility, but I shouldn't pretend that it was reasonable for me to believe I was entering into a risk-free situation, because sex never is, and never will be, risk free.\n\nThe advent of birth control allows us to pretend we can manage the risk-- and indeed, we can to a much greater degree-- but to pretend that sex should somehow be risk free, and that it is the responsibility of the government to enforce this belief, is not a practical solution.  Condoms break. Birth control pills get skipped. Vasectomies sometimes don't quite work.  There is no test that can establish the truth of what happened between two people and while justice seems attractive it only truly exists when it can be fairly and rightfully applied. At this point in time that is not possible when it comes to sex, and I doubt I want to live in the world where it would be.",
            "title_similarity": "0.7817967",
            "sentiment_compound": -0.9652
        },
        {
            "id": "gvotvwv",
            "score": 35,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvp7b6s",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvq41d9",
            "score": 2,
            "text": "It is a punishable crime if the victim is given HIV, and several people have been convicted for lying about their HIV status and knowingly transmitting the disease. \n\nUnfortunately, these cases are almost impossible to prosecute. Rape is the hardest crime to prosecute, and this would be even more complicated.\n\nFor one thing, it’s really hard to prove what a person knew or did not know, let alone what a person said to another person in bed.\n\nAnd the number one defense is always going to be, “the complainant was mad that we broke up and just wants to get me in trouble.”\n\nIf this were a crime that could easily be proven, it would absolutely be punished.",
            "title_similarity": "0.8265519",
            "sentiment_compound": -0.989
        },
        {
            "id": "gvr2rax",
            "score": 2,
            "text": "The punishment is called parenthood 😂",
            "title_similarity": "0.4099701",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvpui8m",
            "score": 3,
            "text": "No birth control is 100 percent effective.  Someone can be on it and still get pregnant, it doesn't mean they are lying. Now if people are not on any form of business but say they are, or take off a condom during sex, then you have a point, but too many people think birth control is 100 percent effective then call the other person a liar because they don't understand how it works.",
            "title_similarity": "0.7690247",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gvq4877",
            "score": 2,
            "text": "This has an easy solution.\n\nJust treat every sexual encounter you arent purposefully trying to make a baby in as if the other person isn't on birth control and wear a condom.",
            "title_similarity": "0.642962",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gvqdesw",
            "score": 3,
            "text": "It’s a violation of consent. It should be treated as such.",
            "title_similarity": "0.38459668",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvqqej3",
            "score": 4,
            "text": "The word you are looking for is rape. Stealthing is rape. Lying about contraception is rape.",
            "title_similarity": "0.7547897",
            "sentiment_compound": -0.9612
        },
        {
            "id": "gvohimz",
            "score": 956,
            "text": "I support you in spirit but how do you prove that? It's a totally he said she said situation. Even if you manage to find some proof in text people can still claim they had a talk about it. \n\nFor vasectomy it's easy to prove that he didnt have it but hard to prove that she thinks he did though text and maybe witnesses in a best case scenario (e.g. friends who claim the couple was mentioning he had a vasectomy).I am sure even now a woman who got pregnant can abort and file a civil suit for emotional pain, cost of abortion, etc and if she keeps the kid then the guy will need to pay child support anyway \n\n\nNow birth control pills is much harder. It is provable if the woman never took them and perhaps referenced taking them but since it's a popular contraceptive its extremely hard to say she was taking them but then stopped. And to show she stopped on purpose and not by mistake. Thered have to be evidence and witnesses not just of her stating shes on BC like in the first case but of her stating she stopped to deceive the guy. Which will be very rare to obtain. And even then it's still hard to prove what exactly was or wasnt communicated right before sex - she could say those statements were a joke, or that he was already aware that she didnt take them, or that she actually did take them at that point but they failed anyway or forgot.....\n\n\nIf the guy had some evidence and witnesses \n like that he could probably try suing her too for emotional pain but as mentioned, it would still be a tough one to prove. But he still wouldn't be legally allowed to get her to abort or to get away with child support as much as I personally think it's unfair, because the courts frame that as childs right independent from mothers actions so what can he really get?",
            "title_similarity": "0.7259432",
            "sentiment_compound": 0.8394
        },
        {
            "id": "gvq3tk6",
            "score": 15,
            "text": "My question for you is, what about people (often women) in abusive, sometimes violent relationships whose partners may insist that they have unprotected sex? If these women somehow manage to get ahold of birth control, they are protecting their health and their chances of getting out of the abusive relationship alive, but then they would be breaking the law, because obviously they would have to lie to their abusive partners about it. \n\nThis becomes especially problematic if these women manage to escape their relationship and try to bring charges against their abusers. Suddenly, they have to worry about whether or not their ‘illicit’ use of birth control might be used against them in their domestic violence case, or regarding custody of any children. \n\nAt best, this would discourage survivors of domestic abuse to come forwards and press charges (which is already a difficult process) for fear of incriminating themselves. \n\nAt worst, it could effectively criminalize victims of domestic abuse, and give abusers yet another legal weapon.",
            "title_similarity": "0.86601543",
            "sentiment_compound": -0.9967
        },
        {
            "id": "gvpuzko",
            "score": 5,
            "text": "The state doesn’t care about intent, they only care that babies that exist get their due care. This makes the baby the innocent bystanders. As the male or female, you’re considered an adult who’s responsible for your own agency and decisions. Don’t put your ding dong into strangers you haven’t built up trust with or vis versa, but if you do, the state says that’s your choice; they’ll be on the side of the child. \n\nThe idea of having a government who could punish people in a democratic free society from lying to each other goes against the principles of free association.\n\nI wish there was a way to hold people to account for lies but the government isn’t the fix. I’m speaking from personal experience. It’s a lesson about personal responsibility that needs to be taught.",
            "title_similarity": "0.6857095",
            "sentiment_compound": 0.81
        },
        {
            "id": "gvplscp",
            "score": 8,
            "text": "I agree with you, lying to your partner about BC when they wouldn’t have consented otherwise removes consent. But I’m going to play devil’s advocate for a bit in hopes that it’ll convince you that you need to add a lot more nuance to what’s prosecutable.\n\nThe most common form of deception of this kind is saying you’ll pull out when you have no intention of doing so. Obviously that’s not okay, but not pulling out also happens by accident too. And unless the perpetrator admits to doing it on purpose they can call it an accident.\n\nWhat if I’m on the pill, but like most women, my usage is imperfect? The pill is 99% effective with perfect use and 92% effective with typical use. Plenty of people present their usage as perfect and plenty of others consent based on that 99%. Is that 7% difference enough to remove consent entirely? Probably not. But what if you’re worse? Not everyone has the memory for the pill to be a great BC choice. What if I’m bad enough that it’s only 80% effective? 50%? These aren’t numbers that I even know how to tie to my habits.\n\nSome spermicide isn’t effective until 10-15 minutes after application. If someone applies it and doesn’t watch the clock is that a criminal offense? What if she applies it, doesn’t read the instructions and wants to start immediately, but he knows you have to wait and doesn’t tell her to wait? Sure he should speak up, but is it criminal if it’s her mistake? \n\nAnd going forward from there there’s all sorts of lies that people tell to sexual partners. That they’re single, wealthy, or even younger than they actually are. If a partner wouldn’t have consented knowing the truth do they negate consent as well?",
            "title_similarity": "0.7617383",
            "sentiment_compound": 0.9709
        },
        {
            "id": "gvphaiy",
            "score": 32,
            "text": ">if a man removed a condom mid-sex without the knowledge of their partner\n\nThis is already classed as rape in the UK, known as ‘stealthing’, I believe. Is this not the case elsewhere?! Jfc.\n\nThe others... I can see being hard to prove, yeah. But it’s one of those things that would probably be proved by friends of the perpetrator coming forward to give evidence because they disagreed with the action the perpetrator took, rather than physical evidence, I’d guess? Idk haha",
            "title_similarity": "0.876916",
            "sentiment_compound": -0.7965
        },
        {
            "id": "gvokx1u",
            "score": 457,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvp0f7p",
            "score": 19,
            "text": "Legally speaking, in certain areas doing that is considered rape, as it is deemed that the consent is invalid because they were consenting to protected sex. Very difficult to prove though...",
            "title_similarity": "0.7711625",
            "sentiment_compound": -0.2944
        },
        {
            "id": "gvpaug8",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvpbqpx",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvpchev",
            "score": 1,
            "text": "Whats your view on whether lying to a partner about being OFF birth control should be a punishable offense in the same way? (So a partner makes it seem like they could cause a pregnancy, when they can’t)? Did you just omit this type of lie or do you think its not as important? To be consistent you probably should (someone could waste their life trying to get an impossible pregnancy)",
            "title_similarity": "0.8587274",
            "sentiment_compound": -0.8668
        },
        {
            "id": "gvpe5xo",
            "score": 1,
            "text": "In many countries and US states, removing a condom without consent (also called stealthing) is sexual assault. This follows the legal concept of conditional consent, where a person can consent to a specific act without consenting to all acts.",
            "title_similarity": "0.74033654",
            "sentiment_compound": -0.2883
        },
        {
            "id": "gvph5zs",
            "score": 1,
            "text": "I mean how are you going to punish them ?",
            "title_similarity": "0.40622252",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gvpkv0q",
            "score": 1,
            "text": "Isn’t fraud already an offense?",
            "title_similarity": "0.36571622",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gvpkxjv",
            "score": 1,
            "text": "At least in the UK, it is. Any sort of sex under false pretences (including the situations you have mentioned above) are illegal, provided the jury can be convinced in court.",
            "title_similarity": "0.6651166",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvplwr5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvpmqpj",
            "score": 1,
            "text": "What if the person was on birth control but missed one day on accident, should they be punished then? How are you planning to prove 1: that they actually said they were on birth control and 2: that they were not in birth control",
            "title_similarity": "0.726141",
            "sentiment_compound": -0.899
        },
        {
            "id": "gvpppw0",
            "score": 1,
            "text": "Punished? Holy shit.\n\nBoth females and males can protect themselves with their own unremovable contraceptives/surgeries, so it is still THEIR responsibility to prevent pregnancy if they don’t want children. \n\n\nHowboutdat?",
            "title_similarity": "0.7260649",
            "sentiment_compound": -0.6072
        },
        {
            "id": "gvpt4h1",
            "score": 3,
            "text": "I agree with you but I have a question on this. I have a friend that had vasectomies done on him twice which reversed themselves naturally. Him and his wife desired they were done and got two more kids out of the ordeal. How would you classify this situation.",
            "title_similarity": "0.7093149",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gvptkh3",
            "score": 1,
            "text": "Wont hold up in court he said she said. Cant punish if you cant prove, it is innocent until proven guilty still.",
            "title_similarity": "0.57326305",
            "sentiment_compound": 0.3348
        },
        {
            "id": "gvptyu9",
            "score": 8,
            "text": "What about the reverse? \n\nCouple agrees to try and have a baby but one party is secretly medically sterile. BC or vasectomy. Partner is only having this sex to try and GET pregnant. But the other one knows that cant happen. Now theyve wasted years of their partners life when pregnancy has a best-done window, risking their chance at ever having a kid. Plus mental anguish of thinking they themselves might be infertile and all associated medical exams. \n\nWould that ALSO be illegal?",
            "title_similarity": "0.81320536",
            "sentiment_compound": -0.9247
        },
        {
            "id": "gvpujf8",
            "score": 1,
            "text": "It’s not enforceable. Rape is most unenforceable as it is. It’s a good concept but just beyond the scope of what law can do",
            "title_similarity": "0.5363641",
            "sentiment_compound": 0.5137
        },
        {
            "id": "gvpvsmd",
            "score": 1,
            "text": "It doesn't look like you stated any reasons, only provided details of the opinion. Please edit to add reasoning, as the first rule requires.",
            "title_similarity": "0.3772639",
            "sentiment_compound": 0.049
        },
        {
            "id": "gvpxe31",
            "score": 1,
            "text": "Personal responsibility.  \n\nYou still have to choose to have unprotected sex with your partner.  \n\nIt shows a lack of judgement if you are in a situation described by OP's title.",
            "title_similarity": "0.6986499",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gvpybpx",
            "score": 1,
            "text": "It is actually considered reproductive coercion and is a form of abuse. \nhttps://www.thehotline.org/resources/types-of-abuse/",
            "title_similarity": "0.62940097",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvq2xv7",
            "score": 1,
            "text": "Nope I’m against regulating anything in the bedroom that is consensual regardless if one or more of the parties were misinformed.",
            "title_similarity": "0.53937995",
            "sentiment_compound": 0.0935
        },
        {
            "id": "gvq489j",
            "score": 3,
            "text": "the ideal is good, but the execution would require draconian authoritarianism, so I'm out.",
            "title_similarity": "0.6150306",
            "sentiment_compound": 0.4854
        },
        {
            "id": "gvq49b4",
            "score": 1,
            "text": "It could be considered rape under the right conditions \"I consent only if you're on BC\"",
            "title_similarity": "0.536618",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gvq5p2m",
            "score": 2,
            "text": "This can’t work unfortunately because no birth control is 100% effective/guaranteed outside removing reproductive organs and hell there would be surprises every now and then just because the human body is weird",
            "title_similarity": "0.68960726",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gvq6j8l",
            "score": 1,
            "text": "There are civil remedies available such as for the “intentional infliction of emotional distress” albeit this is a different approach than making it a criminal offense.",
            "title_similarity": "0.46449286",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gvq6wg7",
            "score": 1,
            "text": "Well yeah, it is. There's a thing called fraud, and lying about birth control would qualify as fraud",
            "title_similarity": "0.7041433",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gvq8709",
            "score": 1,
            "text": "I mean, it is a crime? It's called Rape by Deception...",
            "title_similarity": "0.63655114",
            "sentiment_compound": -0.9022
        },
        {
            "id": "gvq8rad",
            "score": 1,
            "text": "I hate to bring up slippery slopes, but is anyone totally truthful of who they are?  I think most people can say we wouldn't have slept with someone if they had known x, y, and z and that there was some reasonable expectation that those details shouldve been made clear.   \n\nAt a basic level being in an intimate relationship with someone is sort of like consenting to things we wouldn't have consented to.  I'm not suggesting poking holes in condoms is acceptable, but rather that by being close to someone we're consenting to lots of things we would not have chosen if given the option, and many of those things have the potential to be really bad.  I dont mean to suggest we ought to think just one way, but rather than there's important decisions to be made within a wide range of circumstances, and whether or not we consent is not a perfect test of if something should or should not be legal.\n\nSecondly I want to focus on the primary consequences of such a deceit.  I see with comparing the difference between male and female sabotage of contraception is the principle of responsibility.   Its a commonly held view that women have responsibility over their own bodily autonomy, and therefore a deceit to make a woman pregnant is a violation of her autonomy while a deceit on her part to get herself pregnant is not.   What's left is responsibility for the child.   Does the man have rights over his partners body?  Certainly not. But does he have a responsibility towards a child he creates?  It seems the answer would be yes, but what if he did not intend to have the child and took necessary steps to prevent it?   In the case of a mother sabotaging her birth control it seems like common sense to think the father should have no responsibility because his intentions played no part in the mothers secret scheme.   On the other hand, sometimes intentions go wrong and babies happen without a scheme.   Is it then still not his problem?  \nWhat if a woman schemes to have a child without the consent of her partner, and then doesn't wish him to have contact with said child even if he wishes to? Does he have paternal rights in this case? \n\nThis might seem a lot of obfuscation questions, but I think that rather than them being intentionally confusing they're revealing the complexity of the situation.    My counter argument is not just that it ought to be legal to sabotage birth control, but rather that it is not possible to give a perfect answer that would not insult some way of looking at it.  So rather than wishing to change your mind completely, I hope you consider that there are circumstances where your position might be in need of specificity and amendment.",
            "title_similarity": "0.6931423",
            "sentiment_compound": -0.6467
        },
        {
            "id": "gvqba2x",
            "score": 1,
            "text": "Personally, I don’t want to try and get the government more involved in the bedroom. People need to have personal responsibility and only have sex with people you know or believe are trustworthy. \n\nI completely agree with you that lying in order to have unprotected sex is totally messed up, but the government doesn’t need to try to prevent it. The people involved in the situation are taking obvious risks by having sex with somebody they don’t know that well.\n\nI know the personally responsibility argument isn’t too popular these days, but I really feel like in this situation it is preferable than getting the government more involved in everybody’s sex life.",
            "title_similarity": "0.806872",
            "sentiment_compound": 0.5883
        },
        {
            "id": "gvqcxul",
            "score": 1,
            "text": "I believe that is illegal. Isn't that a form of entrapment?",
            "title_similarity": "0.4467721",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvqd6kw",
            "score": 2,
            "text": "IANAL but I'm pretty sure this already falls under rape by deception. The consent relies on birth control measures",
            "title_similarity": "0.7796409",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvqf6cr",
            "score": 1,
            "text": "Yeah but that would be near impossible to enforce.",
            "title_similarity": "0.18981603",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gvqfwuw",
            "score": 1,
            "text": "Wouldn't you save yourself the stress by just wearing a condom?",
            "title_similarity": "0.629912",
            "sentiment_compound": -0.6628
        },
        {
            "id": "gvqgp0r",
            "score": 1,
            "text": ">Of course it has to be proven that there was deception\n\nOk, cool. How are you gonna prove it?",
            "title_similarity": "0.41840664",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gvqiio7",
            "score": 1,
            "text": "If you're talking about reproductive coercion, that's already a crime in many jurisdictions",
            "title_similarity": "0.63879216",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvqjnfw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqjqpq",
            "score": 1,
            "text": "The only thing I would change about your view is the \"punishment\" part. That implies criminal charges when this should be a civil penalties matter. They owe a debt to the person harmed by their decit, where criminals pay a debt to society.",
            "title_similarity": "0.5823308",
            "sentiment_compound": -0.9628
        },
        {
            "id": "gvqkfim",
            "score": 1,
            "text": "What's the harm though?",
            "title_similarity": "0.22722617",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvqlleu",
            "score": 1,
            "text": "So you want government to be involved in everything sans pants.",
            "title_similarity": "0.30346373",
            "sentiment_compound": 0.1477
        },
        {
            "id": "gvqlonl",
            "score": 1,
            "text": "If a woman says she is on birth control and you raw dog her, it is your own fault because birth control fails and it does not protect you against STD'S.  WRAP IT BEFORE YOU TAP IT.",
            "title_similarity": "0.83550143",
            "sentiment_compound": -0.7707
        },
        {
            "id": "gvqnbbd",
            "score": 1,
            "text": "Just because something is wrong doesn't mean it should illegal. A law on the books like this would be wholly unenforceable and almost impossible to prove guilt in most situations. It also seems to violate basic human speech rights...no one should be forced to tell anyone anything.  Sorry, no way in hell i could get down with a legal precedent like this.",
            "title_similarity": "0.5495392",
            "sentiment_compound": -0.9485
        },
        {
            "id": "gvqoc0b",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqt8zx",
            "score": 1,
            "text": "What if the sexual partner is a rapist? The victim may say she's on birth control to perhaps prevent him from attempting to make her pregnant if that's his intention. Just an example",
            "title_similarity": "0.8599404",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gvquggp",
            "score": 2,
            "text": "Other than an outright admission you’d have trouble proving it. And then what would be the proper punishment. \n\nThese are all low key sexual assaults which are already difficult to prove. \n\nThe problem would be enforcement.\n\nI also foresee this law being abused by vindictive partners.",
            "title_similarity": "0.73082745",
            "sentiment_compound": -0.9584
        },
        {
            "id": "gvqwz6w",
            "score": 1,
            "text": "So what do you think about having a vasectomy and not telling your partner?",
            "title_similarity": "0.6879701",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqxm3m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqxnwi",
            "score": 1,
            "text": "Education and availability are more important than punishing people.",
            "title_similarity": "0.29990858",
            "sentiment_compound": -0.4158
        },
        {
            "id": "gvqxoec",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvqxxmq",
            "score": 1,
            "text": "My niece got pregnant by a man who swore he was impotent. As far as I’m concerned he raped her while accepting my niece is not a smart woman.",
            "title_similarity": "0.8152678",
            "sentiment_compound": -0.7475
        },
        {
            "id": "gvqy6vw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvr0z0w",
            "score": 1,
            "text": "So your plan is to start punishing pregnant single women.",
            "title_similarity": "0.6525124",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvr19nl",
            "score": 1,
            "text": "If it’s an intentional lie then yes.  But I have a daughter who was ‘created’ when I was in birth control but no one told me antibiotics would mess them up.  It’s was 1990 and I was 17.",
            "title_similarity": "0.553425",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvr1map",
            "score": 1,
            "text": "Isn't this already illegal? It's called 'stealthing' here and I'm pretty sure it's already considered a form of rape.",
            "title_similarity": "0.6561959",
            "sentiment_compound": 0.4067
        },
        {
            "id": "gvr1mnw",
            "score": 1,
            "text": "We are actually going to tie up the courts with this?",
            "title_similarity": "0.3147644",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvr2tge",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvr3kpt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvr48jg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvr5n48",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvr62yy",
            "score": 1,
            "text": "Just wear a condom dude",
            "title_similarity": "0.26580727",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvr69ol",
            "score": 1,
            "text": "I have a friend who was basically tricked into that and the girl got pregnant on purpose because he came from a rich family and knew he was a good guy too.",
            "title_similarity": "0.61516976",
            "sentiment_compound": 0.8442
        },
        {
            "id": "gvr6g7y",
            "score": 1,
            "text": "Maybe everyone just be responsible for their of birth control.",
            "title_similarity": "0.4887624",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvr7j51",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvr7v4x",
            "score": 1,
            "text": "This is called “reproductive coercion”. It’s already illegal, at least in many parts of the US.",
            "title_similarity": "0.56967247",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvr8hka",
            "score": 1,
            "text": "You shouldn't be having unprotected sex. \nThis whole situation is avoidable with protected sex. Not to mention you have 100% control of where you put your genitals.",
            "title_similarity": "0.63259363",
            "sentiment_compound": 0.6136
        },
        {
            "id": "gvra4vz",
            "score": 2,
            "text": "Punished by whom and how? You want 3rd party witnesses attached to every couple in a relationship? Are your thoughts always that abstract and hypothetical or you sometimes think how stuff works in practical reality?",
            "title_similarity": "0.62169576",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvra856",
            "score": 1,
            "text": "It is technically a crime in Brazil. In our criminal code, we have a crime for inducing/convincing someone to have sex or continue a sexual act under a false pretense.\n\nSo, if you \"fake\" being sterile to convince someone to have sex with you because they wouldn't otherwise... Well, it's a crime.\n\nIf you were separated from your family as a kid and later find your brother /sister and hide your true identity to bang your sibling, well, that's also a crime.\n\nIf you're a Brad Pitt lookalike and lie to a person and this person accepts to have sex with you only because they truly think you're him... That's a crime!\n\nBut as people have already mentioned, it is really difficult  to prove anything in cases such as these. But at least the law is there. If something like this happens to you, and you can prove it, the law is there to protect you.",
            "title_similarity": "0.85727155",
            "sentiment_compound": -0.7217
        },
        {
            "id": "gvrb4jx",
            "score": 1,
            "text": "Criminalizing the lies people tell each other to get sex is utterly futile and destructive.",
            "title_similarity": "0.81478155",
            "sentiment_compound": -0.8822
        },
        {
            "id": "gvrcabp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359972"
        },
        {
            "id": "gvrcunj",
            "score": 1,
            "text": "na, guy here. like, actual grown adult, \n\nif you don’t want a child it’s YOUR responsibility to put a hat on. End of story. \n\nbirth control can fail, condoms are the shit",
            "title_similarity": "0.65484774",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvrd5i0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359972"
        },
        {
            "id": "gvrdrkl",
            "score": 1,
            "text": "Actually a man did get accused of rape for removing his condom during sex. So.",
            "title_similarity": "0.8575237",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gvre6c3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359972"
        },
        {
            "id": "gvree8t",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06359972"
        },
        {
            "id": "gvrf28o",
            "score": 1,
            "text": "Just make it where if one party doesn't want the child and the other party refuses to abort they're not held liable for anything no child support no nothing",
            "title_similarity": "0.42860213",
            "sentiment_compound": -0.123
        },
        {
            "id": "gvrf7w0",
            "score": 1,
            "text": "Impossible to prove, impossible to enforce, agree in principle that any of these things are incredibly scummy.",
            "title_similarity": "0.36425304",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvrfb5j",
            "score": 1,
            "text": "The real solution would be to let men legally abandon the baby.",
            "title_similarity": "0.5239293",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvrfcgw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359972"
        },
        {
            "id": "gvrfd4m",
            "score": 1,
            "text": "I get where you’re coming from, but what good would it do to throw a new mom or new dad in jail? So another baby can grow up foster care?",
            "title_similarity": "0.6083193",
            "sentiment_compound": 0.8594
        },
        {
            "id": "gvribu9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06359966"
        },
        {
            "id": "gvripf1",
            "score": 1,
            "text": "no. because birth control fails and I am sure people(men) will take advantage of it and blame her for lying to him. missing ONE pill or taking it at a different time and you can  still get pregnant.",
            "title_similarity": "0.870104",
            "sentiment_compound": -0.7579
        }
    ]
}