{
    "CMV: There should be a hard cap for how much politicians are allowed to spend on campaigning.\nSome clarifications:\n\n\\- That amount would vary by office, especially on whether that office is local or federal.\n\n\\- Fundraised money does not carry over to reelection campaigns. It cannot be donated either, because donations can be abused for PR clout. It must be fully refunded to donators.\n\n\\- There is no limit on how much contributors can spend, only on what politicians can spend. As a consequence, there is a de facto limitation on what a contributor can spend because anything in excess of the spending limit is worthless. In other words, although it would be legal to spend extra, it wouldn't do anything because it's just going to be refunded.\n\n&#x200B;\n\nWhy such a specific regulation? I believe it would achieve a few benefits:\n\n\\- The playing ground for campaigning is equalized. Political connections and personal wealth are completely nullified, leaving only the merits of the politician and the ingenuity of their campaign staff given a limited budget.\n\n\\- Politicians are no longer able to cheese an election simply by throwing money at their campaign. This would severely hamper the mere exposure effect. They will be forced to listen to the will of the people, including those who may not fully agree with their policies.\n\n\\- Lobbying through campaign donations would be largely obsoleted. There would no longer be an incentive for politicians to submit to corrupt, evil corporations because they know their opponent wouldn't be able to do it either.\n\n\\- Possibly the most subjective point: Elections would be much more interesting! It's no longer a quest to figure out which side is able to throw more cash on the wall, the game becomes purely strategy-based.\n\n&#x200B;\n\nWhy would what I'm suggesting be a bad idea?": [
        {
            "id": "gvu9y68",
            "score": 1,
            "text": "/u/PANIC_EXCEPTION (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/mydo8g/deltas_awarded_in_cmv_there_should_be_a_hard_cap/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.4786417",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvuc65n",
            "score": 4,
            "text": "Simply put, money doesn't win elections.  So while there is good reason to limit donations per person, it would be pointless to cap spending.",
            "title_similarity": "0.7703448",
            "sentiment_compound": -0.0444
        },
        {
            "id": "gvuake1",
            "score": 1,
            "text": "Also stop the years long campaign cycles. 6 months tops.",
            "title_similarity": "0.4380049",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvu6taf",
            "score": 31,
            "text": "> There is no limit on how much contributors can spend, only on what politicians can spend. As a consequence, there is a de facto limitation on what a contributor can spend because anything in excess of the spending limit is worthless.\n\nThis alone would not fly legally. The Supreme Court has routinely upheld that financial contributions to political campaigns are political speech and, therefore, protected by the First Amendment. The First Amendment also prohibits legislation that circumvents the wording of the First Amendment. So you can't restrict the speech by proxy, either. \n\nSo if you wanted to institute this policy, it would require a Constitutional Amendment (to get rid of the most popular amendment) which would be a huge undertaking and, quite frankly, with the problems this country has, a colossal waste of money and time that could be spent making better legislation that doesn't violate the Constitution.",
            "title_similarity": "0.8976008",
            "sentiment_compound": 0.6729
        },
        {
            "id": "gvuhize",
            "score": 0,
            "text": "Spend? There should be a hard cap on how much money they can receive in donations, particularly with regard to how large individual donations can be.  Cap the donations, you’ll cap the spending",
            "title_similarity": "0.72003675",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvuj8ai",
            "score": 0,
            "text": "I don't like the idea if a hard cap. Instead I think what would be better is no one can spend more than the person with the least amount of money on the ballot. This would give 3rd parties a boost as well as lower the costs of elections",
            "title_similarity": "0.7533864",
            "sentiment_compound": 0.5408
        },
        {
            "id": "gvuq2a3",
            "score": 0,
            "text": "Actually, corporations still pay half a million dollars for “speeches” and then pay them off to pass laws. Lobbying would still be a huge issue",
            "title_similarity": "0.6852619",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gvueb5m",
            "score": 1,
            "text": "There should also be a time limit on campaigns. 100 days that's it.",
            "title_similarity": "0.4502986",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvueif0",
            "score": 1,
            "text": "They have that in the UK. One party didn't follow the rules, and have got into power, then faced no consequences. The other party does follow the rules but doesn't get votes, because the party in power uses its money for targeted Facebook advertising. Now the one party has a solid majority in the country with no sign of leaving.\n\nBoth the UK and the US have bribery and corruption. Arguably, the UK is worse, because in the US there is open competition. UK politicians are bribed for 10s of thousands of pounds, in the US it costs millions to influence politicians. In both cases, Joe Public doesn't get much of a say, but in the US there's at least a chance of people banding together legitimately and making their own Super PAC.\n\nSo, while limiting spending sounds nice, it can actually create an easier situation for bad actors to take advantage of.\n\nAt least the US got rid of their Trump. The UK is still struggling with no end in sight.",
            "title_similarity": "0.7771841",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gvuti2w",
            "score": 1,
            "text": "There should ZERO money in politics. Absolutely no spending whatsoever. \n\nFundraising is okay because that shows how much support you're getting from people and that helps your exposure.",
            "title_similarity": "0.6551225",
            "sentiment_compound": 0.5729
        },
        {
            "id": "gvufayl",
            "score": -2,
            "text": "Republicans are liars, cheaters and thieves they will still break the rule",
            "title_similarity": "0.5345204",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gvut6kv",
            "score": 6,
            "text": "Did you know that political scientists have studied the effect of campaign spending and found it remarkably ineffective at swaying voters and winning elections? You might look, shallowly, at campaign spending and outcomes and conclude that money does win. But that would be incredibly poor methodology. You wouldn't know if money had an effect. Perhaps people are loathe to donate to someone they don't consider as having a real shot. Maybe lobbies only donate to true contenders because who needs to curry favor with someone who can't win an election and get into office? In both these examples money follows candidates that people think will win, not winning following the money. \n\nAnd what about all the uncontested races and de facto uncontested races? The majority of elections in this country are decided long before any votes are cast. Rural Kentucky isn't voting in anyone but a Republican, regardless of the money Democrats throw at it. Just as California ain't sending a Republican to the Senate. Campaign spending doesn't change that, demographics do. Most races simply aren't competitive. When you examine just battleground races where both sides have a real shot at winning and try to see if spending has a real effect, you find that it doesn't. \n\nI'm not going to go into whether or not your idea is good on the merits. I think it's enough to know that the problem you're trying to solve doesn't exist. You think money decides most or many elections in the United States. Factually that is incorrect and it grows more wrong every single day as polarization increases.",
            "title_similarity": "0.81170624",
            "sentiment_compound": 0.6079
        },
        {
            "id": "gvu85rf",
            "score": 9,
            "text": "weaken political campaigns, and you make them rely more on super pacs and other unaffiliated opinionated groups.",
            "title_similarity": "0.7518842",
            "sentiment_compound": 0.3353
        },
        {
            "id": "gvucwwb",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.17214748"
        },
        {
            "id": "gvu6lqh",
            "score": 581,
            "text": "This would make it more likely for media companies - news organizations, networks, etc - to have a substantial amount of sway over both politicians and elections.\n\nIs that preferable?",
            "title_similarity": "0.58045286",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvuhq3g",
            "score": 80,
            "text": "Suppose I own local TV and radio stations.  I run for office.  I use my stations to run commercials on my behalf as well as numerous 30 minute spots on why I'm awesome.  I only pay for the hourly staff, electricity, and maintenance, as I don't need to pay ad time to myself.   \n\nMy opponent wants to run ads on my TV station.  I charge him normal advertising rates. \n\nThe mistake is assuming speech is a 1 to 1 ratio of money spent, and by limiting money, you make speech amounts fair.  But by limiting by money, you limit people who don't have access to cheaper mechanisms to speech.",
            "title_similarity": "0.7145953",
            "sentiment_compound": 0.4585
        },
        {
            "id": "gvuhq5h",
            "score": 29,
            "text": "This is already a law in the UK, in case you didn't know. Personally, I think if you want to and corruption, a more important thing would be to prevent lobbyists from offering high paying jobs to politicians after their term ends. On an unrelated note, have you seen what Andrew Yang has proposed about campaign funding? He had an idea that Americans would be given like 200 dollars or something that they can contribute to politicians how they saw fit, and they couldn't keep the money if they didn't donate it, so it was just a credit. This money would be the only funds politicians would be allowed to use for campaigning. I thought it was an interesting idea, but I'm not sure what the ramifications would be. I thought you might find the idea interesting and want to look into it as well. The RepresentUs YouTube channel also made some interesting videos on corruption in America and how they plan to try to stop it, I'll link one of them for you in case you're curious to watch it: [Link](https://youtu.be/5tu32CCA_Ig)",
            "title_similarity": "0.85886276",
            "sentiment_compound": 0.9301
        },
        {
            "id": "gvu8ubr",
            "score": 193,
            "text": "Large donor groups and super PACs *already* circumvent election laws by running “issue ads” that are really in support of candidates. All this would do is drive more spending “underground,” so to speak.  It would be even harder to disentangle money and politics since a greater portion of the donations would be going to dark money groups rather than campaigns.",
            "title_similarity": "0.8382555",
            "sentiment_compound": 0.8548
        },
        {
            "id": "gvu7tu8",
            "score": 20,
            "text": "I feel like you’re completely leaving out the issue that anyone or any organization could then spend their own money directly on any type of campaign materials or what have you that they wanted.",
            "title_similarity": "0.7019736",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvua4cz",
            "score": 6,
            "text": "The problem is this benefits established political parties with large fundraising bases and organizations that can spend or agitate on their behalf and prevents independent politicians with a rich backer or a few rich backers (or even their own bankroll) from competing with them.",
            "title_similarity": "0.73169416",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gvuawlv",
            "score": 5,
            "text": "The problem with that is the cost of living throughout the US is different. If you want to pay your staffers a living wage in Sacramento, California, that looks much different than it would in a district in rural Missouri. So if it's a federal requirement, it's hard to say that what number would be fair for representatives when the US economic diversity gives different needs right now.",
            "title_similarity": "0.72018456",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gvudp2s",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.17214748"
        },
        {
            "id": "gvuexnw",
            "score": 1,
            "text": "The issue is that not all donors would get their money back. Some would, but the money actually spent on campaigning is gone and couldn’t be refunded. Therefore, some people lose their money and others get it back.",
            "title_similarity": "0.7118369",
            "sentiment_compound": -0.5499
        },
        {
            "id": "gvugcg8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17214748"
        },
        {
            "id": "gvuh2db",
            "score": 1,
            "text": "Doesn't matter. Citizens United.",
            "title_similarity": "0.25611305",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gvuhls5",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.17214748"
        },
        {
            "id": "gvuhnu0",
            "score": 4,
            "text": "As others have mentioned; the problem lies in the unintended consequences of restricting speech.\n\nWe could do it, but the fallout would be potentially more catastrophic than the fix.\n\nLuckily there’s an alternative that’s already been created: matching funds.\n\nEssentially, the candidates voluntarily accept restrictions on their monetary behavior in exchange for the government matching every donation the candidate receives, and doubling their war chest. It’s a deal too good to refuse, and while they could, it doesn’t make financial sense to reject.\n\nIt’s a known system that works, or at least, did once upon a time. (Possibly incorrect trivia: if I recall, it was Howard Dean and the Internet grass roots fund raising that showed it was possible to blow past the cap on matching spending, and then candidate Obama who proved it in the primary by rejecting matching funds and yet still raising more money than he would have with matching restrictions imposed)\n\nSo the short version is we already have a solution to this problem that doesn’t involve the unintended consequences that come along with a hard cap: we need to adjust the cost benefit ratio of the matching funds system so that it once again provides candidates a greater benefit to accept the restrictions than to cast them off.",
            "title_similarity": "0.76774716",
            "sentiment_compound": 0.2983
        },
        {
            "id": "gvui4wz",
            "score": 1,
            "text": "I read through and didn’t see anything similar to this. I always thought that there should just be a centralized delineation of a politician’s political stances and voting record, as well as any other important information. So, let’s say a single website that hosts all of the politicians information so you can study them. No campaign speeches, no traveling— none of it. Idk how this would fit into some of the points others have made here, but essentially I’m just talking about ending campaigning (and by proxy campaign funding) entirely. I’d rather just have as much hard data about each candidate available and that’s it. Every candidate gets the exact same platform and they’re not allowed to campaign outside of it. \n\nI originally thought of it because I always thought it was ridiculous that someone is holding office but actually all they are doing is fundraising and campaigning — which probably makes it utterly impossible for them to do their work as a senator, governor, what have you. But I also hate the idea of rich people getting to exert massive amounts of political influence without being politicians.",
            "title_similarity": "0.8027339",
            "sentiment_compound": -0.5191
        },
        {
            "id": "gvuito9",
            "score": 1,
            "text": "I disagree only in the sense that I believe that political advertising should be band in full thus eliminating the need for most campaign donations in the first place.  Candidates would be allowed to have a website to advocate their platform, appear at public events and town halls, and participate in debates with other candidates, but they would have no need to spend money on advertising because they couldn’t do it in the first place.  In my opinion, removing political advertising as a whole solves a lot of problems as it severely limits the reason why politicians need money in the first place. \n\nSelfishly, I would also enjoy not being bombarded with political ads and mailers during election season too, but one can only dream...",
            "title_similarity": "0.85365015",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gvuiyt2",
            "score": 1,
            "text": "Well, India has long implemented all these points you've suggested. No one gives a fuck. If Indian politicians are good at anything, it's finding loopholes when there are none.",
            "title_similarity": "0.6090963",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gvuja9z",
            "score": 1,
            "text": "link it to the standard of living of their districts. they can only spend proportional to the average citizen in their district.",
            "title_similarity": "0.5937612",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvuk151",
            "score": 1,
            "text": "What you're suggesting is quite similar to [Public Campaign Financing](https://en.wikipedia.org/wiki/Publicly_funded_elections).\n\nThat won't solve the problem though, since we can implement public campaign financing and still get nowhere if we don't overturn the Citizens United ruling and Super PACs first. Those are the real killers, because the money that would have otherwise gone into the candidates' campaign funds will just end up in SuperPACs where coordination is officially not allowed, but goes on under the radar anyway (and it's hard to catch or prove in a court).",
            "title_similarity": "0.8792589",
            "sentiment_compound": 0.1111
        },
        {
            "id": "gvulck9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17214748"
        },
        {
            "id": "gvuptve",
            "score": 1,
            "text": "Its only bad because there should be NO campaign donations and we should use a national and state run campaign fund only. The system in the US is setup for graft and bribery as it is right now and setting a cap wont do much to stop that. Major campaign finance reform is needed so that these representatives stop representing corporations and special interest groups and only focus on representing its constituents.\n\nYou are also vastly underestimating the little bit of money these politicians sell themselves out for as a lot of them get other things like promises to be consultants for millions after they retire from Congress and only something like $10k-$50k for their campaign funds.\n\nAgain, this just doesnt solve the route of the problem and only slightly limits it.",
            "title_similarity": "0.8695935",
            "sentiment_compound": -0.2083
        },
        {
            "id": "gvursvb",
            "score": 1,
            "text": "If you need a lot of money to run for office then its a shit system",
            "title_similarity": "0.692124",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvusgwz",
            "score": 1,
            "text": "You are correct that money has power in politics, though it appears you overestimate the power of money. In the 2020 election, we saw the one of the richest men in the world throw $500 million of his own money in a presidential bid in only a few months, and drop out almost immediately.\n\nSmarter regulation might lessen the power of money in politics, but being the root of all evil doesn’t mean it’s all that matters. We’d be better off targeting lobbying practices and laws that guarantee transparency in election spending.",
            "title_similarity": "0.6976662",
            "sentiment_compound": 0.1182
        },
        {
            "id": "gvuuo21",
            "score": 1,
            "text": "So I can get 30 people to run against me on the campaign of electing me to that office? They spend their money on promoting their policy, which is electing sokuyari as mayor. \n\nI believe in policies for addressing climate change and UBI. Only one candidate in the election also has those policies. What counts as spending money on a political campaign? If I write newspaper article about UBI and climate change? If I buy ad space asking people to reduce, reuse and recycle? If I publish my studies on how effective UBI will be? Do any/all of those count as political spending? If so how do we fund studies at all? If not, what stops people from “spending” without supporting a political campaign?",
            "title_similarity": "0.68552077",
            "sentiment_compound": 0.6806
        },
        {
            "id": "gvuxtx0",
            "score": 1,
            "text": "I agree, and this is already the law in the UK.",
            "title_similarity": "0.23299697",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvuy3t6",
            "score": 1,
            "text": "Someone's prob already said this but it's not just money, it's time. Seems like the last 2 years of a presidents first term are spent campaigning for the next term. Good argument against anyone having a second term",
            "title_similarity": "0.6700727",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gvuz80a",
            "score": 1,
            "text": "I think a time limit for general elections would be better. Let the candidates advertise all they want in the primaries but limit the general election to a few month's worth of media exposure. Let the voters have a break and then a brief time to focus on the campaigns. Also a certain amount of free media for any campaign under a reasonable advertisement budget. Citizens need a break from political ads and politician need to spend way less time begging the rich and powerful for money.",
            "title_similarity": "0.7796594",
            "sentiment_compound": 0.9645
        },
        {
            "id": "gvuzm4i",
            "score": 2,
            "text": "Regulations already limit what contributors can give. Result, much money goes to \"independent\" PACs, forbidden by law to coordinate with candidate. These PACs run vicious negative ads, and the candidate bears no responsibility. I liked it better when the candidate was responsible for everything.",
            "title_similarity": "0.8283709",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvuzqne",
            "score": 1,
            "text": "Most developed countries don't allow private financing of elections. US campaigns should be publicly financed, and last like 1/3 of the time they currently do.  It's a massive waste of resources and an obvious conflict of interests to do otherwise.",
            "title_similarity": "0.84502923",
            "sentiment_compound": -0.3107
        },
        {
            "id": "gvv08wl",
            "score": 1,
            "text": "This is the case in french presidential elections. Ex-president Sarkozy just got sentenced for infringing this law during his former campain.",
            "title_similarity": "0.5256995",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvv0n9l",
            "score": 1,
            "text": "Celebrities rule the world.",
            "title_similarity": "0.25880057",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv1vvr",
            "score": 1,
            "text": "God I really hate this subreddit now. Bunch of low effort, circle jerk, echo chamber \"CMVs\".",
            "title_similarity": "0.4546513",
            "sentiment_compound": -0.7501
        },
        {
            "id": "gvv32f1",
            "score": 1,
            "text": "That's exactly how it works in the UK and we have free and fair elections! We've done freedom!\n\nExcept...\n\nThe current Conservative government is being \"accused\" of wide spread \"cronyism\" (corruption is a very hard word to say in the UK press)\n\nIf you fancy going down a rabbit hole on the matter, look at all the alleged cronyism in the last couple of years in the UK, especially with covid. Currently there is a huge scandal going on involving Dominic Cummings and matt handcock.\n\nI don't know how it works where you are from (presumably US but I'm sorry of I'm wrong) but no election in world history has actually been fair. There are too many loop holes that exist. And loop holes are deliberate. Outlawing \"obvious plan\" leads to \"less obvious plan\" leads to \"secret plan\"\n\nThe plan you're talking about treats the \"visable\" part of modern money based society. It won't fix the problem.\n\nIf you're a billionaire and someone comes up to you and says \"pay me 100m a year and I'll make you 1b a year and don't ask any questions\" you would do it. We all would.\n\nIf it would fix the problem that you perceive I would agree, but I don't think it would. Plus the fight to make it happen in the US would probably be \"Current Presidents\" big plan. So he couldn't have another big plan in the next 8 years \n\nUSA USa us....",
            "title_similarity": "0.73912334",
            "sentiment_compound": -0.6421
        },
        {
            "id": "gvv4gdn",
            "score": 1,
            "text": " It if they did that then they wouldn’t get a cushy VP job paying 100x from the very donators giving them money.",
            "title_similarity": "0.7054366",
            "sentiment_compound": 0.3976
        },
        {
            "id": "gvv4m0o",
            "score": 1,
            "text": "How do you plan on enforcing this? \n\nLets say Bob runs for president. You say ue can only spend 1 million on ads. What will he do?\n\nHe will spend 1 million on ads and then his good buddy, an oil tycoon, will spend another 1 million of his own money on ads. The cash will never be in Bob's hands, so he isnt going over his limit. \n\nThen his other buddy, a telecom giant, gives him free publicity on their news. Again, Bob isnt spending a dime.\n\nMeanwhile his opponent, who is grassroots and has no powerful allies, is capped at 1 million. \n\nHow do you propose to enforce it and prevent that almost certain outcome?",
            "title_similarity": "0.7206954",
            "sentiment_compound": 0.7442
        },
        {
            "id": "gvv63yi",
            "score": 1,
            "text": "They are.",
            "title_similarity": "-0.09337732",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv6l09",
            "score": 1,
            "text": "Also a hard cap on lawyers would help a lot",
            "title_similarity": "0.45085457",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvv9d92",
            "score": 1,
            "text": "So long as we have free speech, private individuals will be able to spend their own money to support or engage in political speech.\n\nIf we restrict direct donations, people will end run around this by supporting political action groups that advocate for changes they wish for... Which will inevitably fall along party lines and be little different than just donating directly to the politician.\n\nIs there a value in creating a law that it is so easy to do an end run around?",
            "title_similarity": "0.80644363",
            "sentiment_compound": 0.9659
        },
        {
            "id": "gvvb9vs",
            "score": 1,
            "text": "Everything for the government should be hard stuck to the national median wage, even the president!",
            "title_similarity": "0.67991364",
            "sentiment_compound": -0.4003
        },
        {
            "id": "gvvbk92",
            "score": 1,
            "text": "I agree with the idea and versions of it are tinkered with in some nations but I think that your end effects are incorrect. There are at least 2 other major mechanisms that would fill the void left by limiting campaigns and those are:\n- Lobbying for specific issues can be done without donating to politicians. Anti-climate change rhetoric comes from campaigns by oil companies and doesn’t necessarily pay candidates directly but gets the populous to believe something and gives politicians a platform to elevate themselves. I’d include think tanks here since this is often where they come from.\n- Huge media conglomerates such as NewsCorp run an absurd amount of popular outlets and even their consumers pit the outlets against each other thinking that one is quality journalism while the other isn’t. People may be more familiar with Sinclair’s effects on local media but while you have all those media outlets being controlled by one group you can’t have the effects you’re talking about.\n\nI’m not saying what you’re proposing is a bad idea by any means and I think it helps curate a healthy democracy by getting some of the money out of politics but the end result probably needs a bit larger and holistic of a push.",
            "title_similarity": "0.782531",
            "sentiment_compound": 0.8201
        },
        {
            "id": "gvvbpkg",
            "score": 1,
            "text": "In my country this is already a thing but it weighs with 2 other great rules in place one states all news must do it’s best to remain as neutral as possible.\nAnd the other is that volunteers are allowed (this helps circumvent the monetary cap) and it works out fine I done feel anyone is particularly favoured but in areas of one party being favoured there’s usually a lot more supporters and volunteers then other suburbs",
            "title_similarity": "0.70931745",
            "sentiment_compound": 0.9885
        },
        {
            "id": "gvvbxcb",
            "score": 1,
            "text": "I mean, say someone wanted to campaign in California and New York. That would cost more than just campaigning in nearby southern states. If a certain party is heavily spread out vs the other concentrated, this sort of policy can harm one political party and be seen as sort of coup legislation.",
            "title_similarity": "0.7009157",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvvc363",
            "score": 1,
            "text": "Counterpoint, there should be a hard cap for how much individuals are allowed to donate to a campaign.\n\nCanada does this, and it seems to work pretty well to level the playing field.  By doing it this way, candidates and parties need a broad base of public support to run a campaign and can't just self-fund their way into office à la Micheal Bloomberg or Donald Trump.  There are also no PACs which also helps.",
            "title_similarity": "0.83413243",
            "sentiment_compound": 0.8885
        },
        {
            "id": "gvvehy8",
            "score": 1,
            "text": "Isn't this a law in the UK?",
            "title_similarity": "0.30986375",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvf75q",
            "score": 1,
            "text": "I liked Andrew Yang's idea. Give every voter x amount of money that they'll be able to donate to any candidate, effectively drowning out any amount of money lobbyist can come up with, and instead they'll have to actually lobby the American people.",
            "title_similarity": "0.66580015",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gvvfjyz",
            "score": 1,
            "text": "Your idea is flawed in one major way:\n\n>- There is no limit on how much contributors can spend, only on what politicians can spend. As a consequence, there is a de facto limitation on what a contributor can spend because anything in excess of the spending limit is worthless.\n\nSo a contributor can go out, make and buy ads for this politician, buy signs and whatnot, so long as the money doesnt go directly to the politician's campaign bank.\n\nThis means itll be even more important to align with the wealthy, because theyre going to be the ones buying the stuff for your campaign, if and when you exceed your spending limit.\n\nThis means the donated dollars from individuals is worth way less, because once they align with a wealthy person or two, they now have a completely unregulated piggy bank of someone who will just spend money on their behalf, rather than give it directly.",
            "title_similarity": "0.91032016",
            "sentiment_compound": -0.3415
        },
        {
            "id": "gvvg0bv",
            "score": 1,
            "text": "This already is the case in the UK, goes down to even how much you can spend on pens for the people campaigning for you.\n\n I'm surprised it's not the case in the US.",
            "title_similarity": "0.7229964",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvvghjg",
            "score": 1,
            "text": "Let's say that I have a corporation, whether it's a coal mine, workers union, football club or house owners association doesn't matter, could we buy ads or print leaflets as much as we want? Paying it from our own pockets?\n\nIf no, that's a Huge limit to our freedom of speech.\n\nIf yes, does anything really change? One could just create hundreds of temporary corporations and everyone who wants to contribute would just give money to them instead of the candidates own campaign.",
            "title_similarity": "0.75698906",
            "sentiment_compound": 0.9015
        },
        {
            "id": "gvvhjip",
            "score": 1,
            "text": "I would go farther and say they are not allowed to spend their own money or campaign. The govt should give each X amount and that’s it. The millions raised fir campaigning in obscene. The vote is for sale.",
            "title_similarity": "0.80153716",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gvvi25p",
            "score": 1,
            "text": "Agree, but with the proviso that all donations must be declared. You should always know who actually owns your politicians.",
            "title_similarity": "0.53366363",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gvvifyv",
            "score": 1,
            "text": "The cap should be zero, elections should be publicly funded.",
            "title_similarity": "0.6026776",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvj1mw",
            "score": 1,
            "text": "I have heard it said that you can’t really stop the flow of money if it wants to get somewhere, all you can do is try to make it more transparent.  I think that is more true today than ever.  Regulations on spending or donations are like trying to plant trees on a hill to stop water from flowing down it.  You are at best just slowing the flow and making it harder to follow.\n\nLimiting campaigns to a dollar amount just drives any excess underground and those with more wealth will also have the connections and the means to hide these things as well.  I don’t think it will level the playing field much at all.",
            "title_similarity": "0.76917875",
            "sentiment_compound": 0.8955
        },
        {
            "id": "gvvl2zx",
            "score": 1,
            "text": "What if I, Jane Smith, am a billionaire and really love what Congressman Scrooge McDuck has to say? I could still (for example) pay celebrities to go on TV and talk about how much they love Congressman McDuck, or have his name painted on the side of a billboard, without consulting his campaign office. Would that count towards the limit?",
            "title_similarity": "0.61782813",
            "sentiment_compound": 0.8642
        },
        {
            "id": "gvvl7wh",
            "score": 1,
            "text": "How would we account for organizations that campaign on a politicians behalf? If you set a limit you’d have false organizations just spend a ton of money to campaign for a politician so they hit this limit much faster.",
            "title_similarity": "0.7814711",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvnr5r",
            "score": 1,
            "text": "Just ban TV advertising like is done in the UK. Major parties are then given equal TV time in the form of Party Political Broadcasts. They are given a limited amount of time to get across their policy agenda.\n\nIf you were to limit the campaign budget you would just get someone else buying TV time in a proxy campaign for the party they like best. Also how do you police that budget? By the time the campaign has been audited the election has been run and the winner announced.",
            "title_similarity": "0.7787943",
            "sentiment_compound": 0.9422
        },
        {
            "id": "gvvo71e",
            "score": 1,
            "text": "I don't think politicians should be able to accept donations at all. No campaigning is allowed, beyond debates or press conferences, and every candidate gets the same amount of time. \n\nFor candidates with a smaller following perhaps there could be online debates or interviews available, to give them a chance to compete without having every random person who managed to get a few signatures together. Maybe the public could vote online for a certain number of those smaller candidates to be invited to the bigger televised debates.",
            "title_similarity": "0.8086741",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvvqo4q",
            "score": 1,
            "text": "Wouldn't work.\n\nA way around it would be found, and you'd only be harming those who play by the rules.\n\nWhat's gonna stop their backers from coming together and making their own support for the candidate? You can't stop them from saying what they want to say of their own volition or \"their own volition\".",
            "title_similarity": "0.7279029",
            "sentiment_compound": 0.125
        },
        {
            "id": "gvvrb4v",
            "score": 1,
            "text": "I’m Mike Bloomberg, and I approve this message",
            "title_similarity": "0.12894043",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvs0tq",
            "score": 1,
            "text": "Yes there should,",
            "title_similarity": "-0.08156055",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvvsfj9",
            "score": 1,
            "text": "I'd like to add a line that says, \"You can only contribute to an election that you are legally eligible to vote in.\"",
            "title_similarity": "0.708197",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvvsw6e",
            "score": 1,
            "text": "It would absolutely work in *theory* but knowing how much they actually did receive would be extremely hard.",
            "title_similarity": "0.5186499",
            "sentiment_compound": -0.2592
        },
        {
            "id": "gvvuj8m",
            "score": 1,
            "text": "There's nothing stopping me from spending my own money on politicians. I could even form a club of others and pool our money to get the word out.",
            "title_similarity": "0.61178696",
            "sentiment_compound": 0.1139
        },
        {
            "id": "gvvuo76",
            "score": 1,
            "text": "How would you judge \"in-kind\" contributions to the campaign? If a person spends months organizing events and lending the campaign all kinds of equipment it needs to hold those events, but at no charge, is that a contribution? Super PACs handle most of the expensive activities during campaigns, so do they just handle more now?",
            "title_similarity": "0.66272455",
            "sentiment_compound": 0.6237
        },
        {
            "id": "gvvw31r",
            "score": 3,
            "text": ">The playing ground for campaigning is equalized\n\nThe playing ground for campaigning is *not* equalized.   A candidate who has other ways of getting attention, such as\n\n* incumbency (*98%* of all Congresspeople who run for reelection win)\n* celebrity (you think that Arnold Schwarzenegger won the governorship based on his campaign spending, let alone his actual qualifications?)\n* wealthy friends or allies who will spend money on their behalf\n\nYou know what all those things have in common: they favor the ruling class.  \n\nMoney is the great equalizer. \n\n>There would no longer be an incentive for politicians to submit to corrupt, evil corporations\n\nNo, they would get to be the corrupt, evil ones.\n\nYou might not like corporations but here is the thing: they represent people.  A corporation has no interests of its own; it only has the collective interests of its stockholders, employees, customers, and vendors.  If a corporation is trying to influence an election, it is only because those people, those very real people, are affected by the election.\n\n>Politicians are no longer able to cheese an election simply by throwing money at their campaign. \n\nHave you ever heard of Michael Bloomberg?  He used to be the mayor of New York.  He thought you could buy an election too.\n\nHe spent $500,000,000 — of his own money, mind you — on getting nominated for president and got... bupkis.  That isn’t quite true: he won American Samoa.   I didn’t know American Samoa could vote in presidential primaries.\n\nMoney does not buy votes.  It buys attention.  People notice you.  They look at you.  Whether they like what they see is another question.",
            "title_similarity": "0.7748283",
            "sentiment_compound": 0.9511
        },
        {
            "id": "gvvxgt2",
            "score": 1,
            "text": "There should be a hard cap (of zero) on how much politicians are allowed to lie and not face consequences.",
            "title_similarity": "0.7660185",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvvxn68",
            "score": 1,
            "text": "This is so easy to work around....\n\n\nAs others have already pointed out the media would have more sway.\n\nThe other is there is a tax write off for political contributions, companies could just pay to campaign on their behalf.\n\nWhat's to stop for example someone who is an ardent trump supporter from registering their own company, the politicians refering people to the company and the company doing campaigning?\n\nOr how about what if a politician promises favors to a company if elected and then the company buys advertising? No money is spent.",
            "title_similarity": "0.8150643",
            "sentiment_compound": 0.8443
        },
        {
            "id": "gvvy49r",
            "score": 1,
            "text": "In theory, it's not bad.. like many ideas.. but consider the following:\n\n\\- How do you guarantee equal buying power for each campaign? Does a dollar for Red or Blue equal the same or are their connections able to grant them better per-dollar spend?\n\n\\- Building off of the above, invisible donations are possible by discounting how that campaign money is spent. Maybe their advertisements are printed at 10% of the cost, the air time is 1% of the cost, etc etc etc. This paves the way to enhanced corruption as the people who control the levers (industry and media) have near control of the outcome. Lobbying still exists in this case and is perhaps enhanced. This also proves connections are in fact not nullified. Who sets the rates for these things? Is it wrong for someone to print at reduced price, or even at a loss? Further, how do you prove it? Even without such egregious markdowns, 10% on an equal playing ground would make a large difference.\n\n\\- Biased sources would have more ability to say what they want and wouldn't be restricted by this. Today we see almost all of our media from news to sports have picked one side or another, their platforms will have disproportionate reach to send messaging they want which may require response from opposing campaigns, this would be a good way to drain the opposing campaigns limited funds.\n\nAll of this said... I think the current system sucks and a new solution is needed but the solution is likely multifaceted and will take a lot of combined brainpower to figure out.",
            "title_similarity": "0.6504046",
            "sentiment_compound": 0.936
        },
        {
            "id": "gvw0ok3",
            "score": 1,
            "text": "[There is very little money in politics.](https://slatestarcodex.com/2019/09/18/too-much-dark-money-in-almonds/) It's probably more than the ideal amount of money, but if money in politics were as powerful as people act like it is, there'd be more money in politics than almonds. It's clearly not just about who throws the most cash at the wall, and that component probably isn't doing much damage.\n\nIt's very difficult to control how much money goes into it. Suppose a politician appears in a commercial for another politician. They don't say anything about themselves. Does it still count as a commercial for them? There's tons of other things you could do to straddle the line. Who says what counts and what doesn't? What happens if the person who says that is biased?\n\nI think a better way to equalize it would be to just give all the politicians a certain amount for campaigning. Presumably there's diminishing returns in campaign contributions, so that would minimize the benefit a lot of money could give you over someone with no money. But the problem here is that you can't just let everyone decide to campaign and use up all the money, so you still have to have some way to decide who gets money, and then that seems like it would just make things worse.",
            "title_similarity": "0.7976657",
            "sentiment_compound": 0.929
        },
        {
            "id": "gvw1cps",
            "score": 1,
            "text": "Off the top of my head, it would give the incumbent an even larger advantage.\n\nThey can send newsletters to their constituents every week full of propaganda and it wouldn’t be considered a campaign expense since it’s part of their job as a politician currently in office.\n\nThere are a lot of ways to spend money to benefit a campaign that wouldn’t be considered a campaign expense. For example, if a candidate is widely known to support a particular issue, running an ad attacking that issue is sort of an attack on the candidate even if the ad doesn’t mention them by name.\n\nUnrestricted spending is not perfect, but it’s the best way to truly level the playing field, since after a certain amount of money spent (which varies depending on the race and the candidates), money doesn’t matter anymore.",
            "title_similarity": "0.7925271",
            "sentiment_compound": 0.9288
        },
        {
            "id": "gvw1osv",
            "score": 2,
            "text": "Hello, I would like to sell you advertising valued at $2mill for a penny*\n\n*see our lobbyists",
            "title_similarity": "0.5286736",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gvw2vou",
            "score": 1,
            "text": "My first question would be how money prevents voters from judging a candidate solely based on merit in the first place? \n\nOr more importantly, if people can be convinced to vote on something other than merit, how does minimizing candidate campaign spending change that?  How will minimizing campaign spending limit all relevant attributes to just \"merit\".  What do you mean by merit?\n\nOr why isn't the ability of a candidate to marshal under his control a great deal of financial resources for their campaign merit?\n\nI think in reality your only reasons for suggesting this are your own self interest.  You know that republicans tend to get their money from a smaller group of more wealthy supporters and democrats tend to get their support from a larger number of less well off supporters.  And that by neutralizing money as a differentiating factor you hope to favor one side over the other.\n\nChange my mind.",
            "title_similarity": "0.8305261",
            "sentiment_compound": 0.9916
        },
        {
            "id": "gvw3659",
            "score": 1,
            "text": "There should be a hard cap on Politician Salaries & Benefits.  Exempting themselves from laws should be illegal.  Salaries shoild be the mean of US gross income.",
            "title_similarity": "0.8495662",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gvw3akd",
            "score": 1,
            "text": "So... what if I am a billionaire and I want to spend 10 million,\nIndependently, on media with advertising to show my support for a candidate . It is my money and I am buying the ads. It is just me exercising my free speech.",
            "title_similarity": "0.6301997",
            "sentiment_compound": 0.743
        },
        {
            "id": "gvw8g5r",
            "score": 1,
            "text": "What is the part of the US political system that lets special interest groups like the anti-public health crowd to block anything close to a medicare system from happening, even when President Obama was trying it didn’t seem to get far at all... \n\nI also think the NRA & the whole gun issue in the US seems to be a nightmare, but I can also see that it’s an issue with two sides and is complex.. \n\nBut public healthcare for your citizens & a medicare system has been shown to be the best way to do things in literally every country that has it.. so how does it get blocked so easily in the US without anyone who does so being asked to explain *why they* are doing so?",
            "title_similarity": "0.7814195",
            "sentiment_compound": 0.8827
        },
        {
            "id": "gvw92jp",
            "score": 1,
            "text": "Politicians should have no right to privacy.",
            "title_similarity": "0.6291795",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvwc4v1",
            "score": 1,
            "text": "This doesn’t really address the issue at hand.  Limiting how much a politician can spend doesn’t impact Super PACs or anything like that.",
            "title_similarity": "0.7377262",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gvwhivf",
            "score": 1,
            "text": "I don't disagree, just want to help you by saying there are countries which already do have these kinds of rules in place and they seem to work relatively well",
            "title_similarity": "0.32654798",
            "sentiment_compound": 0.6968
        },
        {
            "id": "gvwj9cj",
            "score": 1,
            "text": "I think no cap if its all your money and every debate and add and whatever if other ppl have given you money has to beging with the corps and lobbyists that have given it to you and their special interests and connections. Also term fucking limits",
            "title_similarity": "0.77060467",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvwjm7u",
            "score": 1,
            "text": "The issue is still the Citizens United Supreme Court ruling, so your idea, while good, would fail.\n\nCitizens United basically says corporations have free speech, so politicians can be limited in contributions and even use a general fund, but then comes corporations.\n\nCorporations and other groups can flood the airwaves with ads year round. \n\nPoliticians who receive assistance from corporations will be obligated (informally) to play favorites or sacrifice future assistance. \n\nWhile a senator might hesitate to spend $1 million on ads, a corporation won’t give a flying fuck about spending $5 million to help a senator lose.\n\nAdding to the issue is also that a large swatch of this country has to deal with Sinclair media.  Sinclair is a conservative group that can prioritize conservative groups and causes.  That also makes various races less equitable and fair.\n\nSimply focusing on the politicians is missing a huge component in the problem.",
            "title_similarity": "0.8243174",
            "sentiment_compound": 0.1912
        },
        {
            "id": "gvwjt1y",
            "score": 1,
            "text": "Lobbying is not just pay for play. A lot of lobbying is a trade off between a company and constituents. The elected official brokers the deal bringing a chemical plant to his district and 1000s of jobs with it. The chemical plant dumps in the local lake but the effects won't be felt until the politician is retired years from now. \n\nSuper PACs also get around your hard cap idea. Candidate doesn't need the money himself to spend on ads if his backers are spending their own money on his behalf. \n\nI admire your intentions. But I don't see your points fixing the problems you are trying to solve. \n\nI'd like to suggest one solution so this isn't just a negative post. I'd like to see an independent group compile candidate profiles before each election. Everything on these profiles would need to be verified. Voters could use these profiles to learn about the candidates from as much of an unbiased POV as possible. Big questions from the other party would be noted at the bottom to help voters understand why people may not be wanting to vote for this candidate. Instead of living in an obviously biased marketing campaign for elected office and trying to cap the spending.... why not offer up a more trustworthy source of information about all candidates that no amount of money could sway?",
            "title_similarity": "0.7072951",
            "sentiment_compound": 0.9827
        },
        {
            "id": "gvwm79p",
            "score": 1,
            "text": "I don’t think that this is really an argument or something that needs to have a view changed.  Your argument leaves out the fact that any candidate can just use their own money.  Also, it would be challenged constitutionally.",
            "title_similarity": "0.73762906",
            "sentiment_compound": -0.6887
        },
        {
            "id": "gvwmxg4",
            "score": 1,
            "text": "The biggest reason I could think that it would never pass is the amount of money services and businesses would lose. According to this [NY Times article](https://www.nytimes.com/2020/10/28/us/politics/2020-race-money.html), it was $14 billion for the federal races alone. Besides paid staff that money was spent on businesses for printing campaign materials, mailers, etc.\n\nIt's also one of the reasons you won't see the primaries change their format. States early in the primaries see a tremendous influx of cash just to advertise. If you're a battleground state, here's another check.\n\nSo while I believe there should be a lot more done to control and limit spending, it's also significantly unlikely that spending will be limited because it directly affects the businesses which support campaigns and that would also reduce the collection of state and local sales taxes.\n\nThree other approach rather than limiting spending altogether would be to make it a voucher system, so that candidates are given public money from a limited pool. I've seen this attempted, but it wasn't mandatory and major candidates who opted in were at a disadvantage if their opponents didn't agree. It certainly was seen to help behance the playing field for lesser known candidates, but it also wasn't applicable to federal races.",
            "title_similarity": "0.81838655",
            "sentiment_compound": -0.7752
        },
        {
            "id": "gvwn20b",
            "score": 1,
            "text": "We have this in the UK. It works",
            "title_similarity": "0.086839914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwq6mj",
            "score": 1,
            "text": "There is if you take the publicly funded option. It's $103.7 million. The issue is that your opponent isn't going to take that, and that's not a lot of money for a campaign. Unless they remove the option to fundraise yourself, we're stuck.",
            "title_similarity": "0.80476034",
            "sentiment_compound": -0.25
        },
        {
            "id": "gvwts04",
            "score": 1,
            "text": "No they should be aloud to spend and promise as much as they want! But they should get a year end review like every other worker out there.\n\nYou promised better health care.... and did not deliver that is gonna come off your wages\n\nYou promised to not piss away money.... oh hoho that was a big lie. That is really gonna hurt any chance of a bonus or raise and your probably going to jail for fraud, theft, and paying your family an unreasonable salary for nothing.\n\n&#x200B;\n\nYOu know maybe let them be treat like regular people, instead of the ELITIST ASSHOLES they act like and treat themselves as such. Also Politician should be a life long career.",
            "title_similarity": "0.7144335",
            "sentiment_compound": 0.9739
        },
        {
            "id": "gvwubs8",
            "score": 1,
            "text": "A cap on campaign spending just makes it a marketing challenge, whichever politician/party has the more frugal/efficient marketing team has an advantage. \n\nInstead what if the actual campaign infrastructure was restricted, for example each party gets 3 nationalized speeches, 2000 Posters, invited to 2 debates, one website. This way both or all parties have exactly the same platform.",
            "title_similarity": "0.75105333",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvwuxd9",
            "score": 1,
            "text": "This is the case in the UK, though unfortunately *some* parties try to skirt the laws around this and apparently face no consequences for their blatantly illegal activities. Enforcement is key.",
            "title_similarity": "0.61046314",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gvwxjpk",
            "score": 1,
            "text": "Greeting from France,\n\nHere it's how it's works. Expense in campaigning are limited to a amount depending of the election. For example, presidential election's expense are limited to 20 millions euros per candidate(something around).\n\nA large part of it is given by the state, on a percent depending on the election result. Morale people can't give anything to political party.\n\nPaying advertising are forbidden for political party. ( Only during campaign duration I suppose ) . And media exposition's time are limited for each candidate.\n\nWe had a lot of problem with party's funding since a least the 70s, the legislation have been improved frequently.\n\nedit: grammar",
            "title_similarity": "0.7681309",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvwza2c",
            "score": 1,
            "text": "It works similar to this in the UK. Read up on our election laws, they're not perfect but they have the spending side almost down.",
            "title_similarity": "0.6671177",
            "sentiment_compound": -0.2498
        },
        {
            "id": "gvx03n6",
            "score": 1,
            "text": "Ok so I know this technically isn’t allowed since every comment needs to disagree with the OP’s argument but I just want to point out that the United Kingdom basically already does a version of this.\n\nEdit: I disagree with the OP’s view because I don’t think making elections more interesting should be a goal we should be going for\n\nThere that should cover me",
            "title_similarity": "0.779216",
            "sentiment_compound": 0.5844
        },
        {
            "id": "gvx22am",
            "score": 1,
            "text": "What are they gonna do about it? Seems like it would be super easy to get around this via some sort of indirect spending",
            "title_similarity": "0.34123975",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gvx2wss",
            "score": 1,
            "text": "The issue is more the amount politicians receive in donations, rather than spending. Corporations shouldn't be able to send candidates hundreds of thousands of dollars when average joe can only afford far less",
            "title_similarity": "0.8388187",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvx78j6",
            "score": 1,
            "text": "I see issues with 2 out of your 3 methods to execute this plan. \n\n1. Fundraised money doesn't carry over...   So you are relying on the campaign to refund every $5 donation above your arbitrary cap.  Can you imagine the level of effort, and expense to do this?  Refunding $5, may cost $7 to do.   The net effect is that politicians will look for fewer high value contributors concentrating the influence over the politician.   This could end up making the little guy feel disenfranchised.  A better solution might be to donate the excess money to a non political non profit, but even there I, as a contributor, may not support whatever non profit was picked. Maybe the excess goes to the Feds to pay down the debt??  \n2. No contributor limit - You doubled down on the previous problem.   A single contributor could \"buy\" a politician.  Imagine a politician not having to waste time fund raising when 1 person/org fully funds them on day 1.  Think that person/org would have some influence over the politician?\n\nYou go on to state how your regulation will eliminate corruption, when I see it encouraging it.  It would be very easy to forego 95% of all fundraising and just court a few deep pockets to fill my war chest and be done with the process after a few handshakes and promises.",
            "title_similarity": "0.77882075",
            "sentiment_compound": 0.7852
        },
        {
            "id": "gvx82gj",
            "score": 1,
            "text": "They also shouldn't be able to take donations from large corporations. We're a country ran by the businesses that are destroying us.",
            "title_similarity": "0.76904505",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvxdf4e",
            "score": 1,
            "text": "The lack of an individual donation limit is a huge problem, potentially. What if a politician had a wealthy donor who donated the entire amount allowed for the whole campaign? That donor would essentially own that politician if they won. \n\nI don't disagree with the idea of an overall spending cap but it needs to come with strict limits on both personal and corporate donations AND the reinstatement of the Fairness Doctrine. In 2016, Donald Trump got as much free air time as Clinton,  Sanders, Cruz, and Rubio COMBINED. That's ridiculous and it needs to change.",
            "title_similarity": "0.82855755",
            "sentiment_compound": 0.6177
        },
        {
            "id": "gvxg3t6",
            "score": 1,
            "text": "Are you talking about US?\n\nAtleast in Czech Republic there is a hard cap already.",
            "title_similarity": "0.4388841",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvxjomx",
            "score": 1,
            "text": "You're making the same mistake as everyone else. You're assuming that the money is the cause of the corruption in our politics.\n\nThe large amounts of money are the consequence of the real problem, and that problem is that the officials in our government simply have too much power. They have the power to throw billions of dollars at a problem. They have the power to tax and regulate **any** business out of existence.\n\nGet the politics out of our money, and you will see the money get out of our politics.",
            "title_similarity": "0.74850714",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gvxkqgx",
            "score": 1,
            "text": "I feel like if anything this will further intrench things like swing states, which will now have almost all of a campaigns funds thrown to it. When money is tight, every dollar must go to where’s the most effective.\n\nI would also like a study into the actual effectiveness of ad campaigns compared to the impact the media and now even social media can have on voters. I personally have never been swayed by ads, but whether I’ve been swayed by the news I watch is another question.",
            "title_similarity": "0.80324763",
            "sentiment_compound": 0.6648
        },
        {
            "id": "gvz5m6u",
            "score": 1,
            "text": "Agreed. Across the board agree.",
            "title_similarity": "0.04484795",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gw2bbbz",
            "score": 1,
            "text": "Yep. We have it in Austria. It's not perfect (nor can such a system ever be) but it at least hinders US conditions",
            "title_similarity": "0.66296303",
            "sentiment_compound": -0.1025
        },
        {
            "id": "gw435si",
            "score": 1,
            "text": "This sounds similar to England's policy, and they only have 6 weeks to campaign, and you can only use specific advertising methods.  That way their country isn't drowning in constant toxic political campaigning.   There is a loophole there where boris johnson basically supported the brexit cause, and was able to get his name out in the public more because he could advertise about brexit with his name and face attached because they weren't directly tied to his campaign. In the same way he could also skirt funding limitations.   \n\nSo basically you could still end up with loopholes and people that abuse the system, and still end up with horrible people as the leader because they got more hidden money from corporations.  \n\nI am all for removing corporate money from politics. It will require analyzing how to set it up and close off loopholes after they are found.",
            "title_similarity": "0.7556758",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gwdcjtq",
            "score": 1,
            "text": "It is a free speech thing. As long as bribes are literally legal this stuff seems moot.",
            "title_similarity": "0.58870006",
            "sentiment_compound": 0.5859
        }
    ]
}