{
    "CMV: Elon Musk is an asshole for naming his kid X Æ A-XII Musk\nWhy would anyone name a child something like that? To me, this seems similar to naming a kid \"Hitler\" or \"Barbie\". The name is unpronounceable, would always make the kid a target of unnecessary attention (eg. bullying), and has no other real meaning or use other then helping Daddy Musk stay relevant in the news for one more cycle. Add onto this his murky history of personal relationships (eg. Justine), and there is absolutely no defense for what he's doing. \n\nCMV: Elon Musk is an asshole for condemning his child to unnecessary troubles, just so that he could be more relevant for one news cycle. The name is unpronounceable, might cause difficulties in the future when agencies/websites don't support special characters, and might make Musk junior the target of bullying.\n\nEdit: 3-4 people claimed that this name was not the true \"legal\" name and that the legal name was something more vanilla. As far as I can tell, \"X AE A-XII Musk\" is the legal name:\n\n> On the birth certificate, it states that the baby’s first name is “X”, it’s middle name is “AE A-XII” and its last name is “Musk”.\n\nSource: https://www.independent.co.uk/life-style/elon-musk-baby-name-change-snl-b1839659.html\n\n> The name has now been officially recorded on his birth certificate as X AE A-XII Musk\n\nSource: https://www.ndtv.com/world-news/elon-musk-grimes-baby-legal-name-x-ae-a-12-revealed-on-birth-certificate-report-2247563\n\nEdit 2: multiple people have pointed out that it was Grimes who came up with the name, and not Elon Musk. My bad - I got to know about this whole incident from Elon Musk's Twitter feed, and news articles that reported on Musk, so I assumed (incorrectly) that he contributed in the naming process. However, even if the name was initially proposed by Grimes, I feel it's inaccurate to say that Musk had 0% responsibility in it, because, at the end of the day he's one of the parents too. If you want this to read more logically, just change the title to \"CMV: Elon Musk and Grimes....\".": [
        {
            "id": "gwn84yj",
            "score": 1,
            "text": "/u/ardula99 (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/n33vmq/deltas_awarded_in_cmv_elon_musk_is_an_asshole_for/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.46773696",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwnfmqu",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwnm0yb",
            "score": 6,
            "text": "There's just one kind of asshole and one source of problem in this issue: People who have a reaction like yours.\n\nEverybody could just be like \"Oh, cool. That's weird and unique, what ever.\"\n\nBut you hate Musk and you have to have a vitriolic reaction to anything he does, especially when it doesn't concern you in the slightest. You have to be the kind of person to bully the kid.",
            "title_similarity": "0.8119658",
            "sentiment_compound": -0.9267
        },
        {
            "id": "gwn52n4",
            "score": 28,
            "text": "The purpose of a name is to distinguish one person from another.\n\nThis accomplishes that goal.\n\nI believe this is a form of victim blaming, Elon Musk cannot be held accountable for other people being assholes because of a strange name.\n\nEdit: Anyone want to reply? I'd love to read why you disagree with this take. I didn't think 'not giving into bullies' was such a controversial thing to say.",
            "title_similarity": "0.69776475",
            "sentiment_compound": -0.6005
        },
        {
            "id": "gwni9kg",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwnjswm",
            "score": 41,
            "text": "I see a ton of names come across my desk that seem to fit your criteria - nearly impossible to pronounce and opens the kid up to unecessary bullying or discrimination - yet anyone who would dare call the parent an asshole for that is thought of as a blatant racist.\n\nCan you explain the difference to me?",
            "title_similarity": "0.80954915",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gwn7pik",
            "score": 51,
            "text": "[removed]",
            "title_similarity": "0.170061"
        },
        {
            "id": "gwnf415",
            "score": 2,
            "text": "Elon Musk is an asshole in general. The name of the child is just the icing on the cake.",
            "title_similarity": "0.6850636",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnhwkt",
            "score": -1,
            "text": "You are gullible to think his kid is actually named that. \n\nHis kid has a regular name, it’s just not known to the public.",
            "title_similarity": "0.71663016",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwnjir8",
            "score": -3,
            "text": "Actually he is not an asshole. He is one of the richest men in the world. His kid is set for life. He is a loving parent and done the work so his kid don’t have to eat ramen and worry about the rent. Can you tell the same about your loser parents? Very few parents love like elon do.",
            "title_similarity": "0.5276179",
            "sentiment_compound": 0.8387
        },
        {
            "id": "gwnl84q",
            "score": 21,
            "text": "I don’t know if this will change your mind but I’m kinda of curious.\nWhy are you only getting mad at Elon? \nWhy does another person child’s name upset you so much? \n\nEdit: Went through the comments and found the answers to these questions.\n\nEdit 2: I couldn't help but think, isn't calling an infants dad an ass hole just as bad of bullying than if you were to make fun of the child's name directly.",
            "title_similarity": "0.8219959",
            "sentiment_compound": -0.9675
        },
        {
            "id": "gwndyye",
            "score": 32,
            "text": ">The name is unpronounceable, might cause difficulties in the future when agencies/websites don't support special characters\n\nThis one in particular is kind of not a point for your argument. A lot of people have special characters in their names, and they can usually be replaced. For example, the German ä, ö, ü and ß can be replaced with ae, oe, ue and ss respectively. So in this case, the Æ can be replaced with AE as well.",
            "title_similarity": "0.6582527",
            "sentiment_compound": -0.2537
        },
        {
            "id": "gwnk9ks",
            "score": 4,
            "text": "It literally doesn't matter what you name your kid. \n\n1. Kids will go by what they're called. Family, friends, peers and others will rename, nickname, and organically designate you as you grow.  Your legal birthname may be a foundation for that, but it's certainly no limit. Maybe this is just a part of my community and my Caribbean background, but as a teacher, I'm sure that this is not uncommon.\n\n2. As I have found with my child, he'll rename himself based on mood or the story he's read or the movie he's most recently seen. This past 2 months, its \"Littlefoot\". He'll answer to nothing else.\n\nOdds are, this kid will go by \"Ash\" for a while. Then, \"Dozen\", or \"Doze\" if he's particularly lethargic.  \"Xash\" —pronounced \"cash\" in my head — is another option that just popped to mind. \n\nIn the end, he'll be Lord Musk of Texarkana.\n\nCome back to this comment in 15 years.  We'll see what happens.",
            "title_similarity": "0.5404091",
            "sentiment_compound": 0.3124
        },
        {
            "id": "gwnks2z",
            "score": 2,
            "text": "I think of him more as a douche bag than an asshole. Naming his cars Models S3XY is something an edgy teenager would do. The dude's maturity hasn't caught up to his intelligence yet.",
            "title_similarity": "0.66683996",
            "sentiment_compound": 0.0865
        },
        {
            "id": "gwnd87u",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwngom6",
            "score": 177,
            "text": "Let’s be honest, this is Grimes’ doing. I love her though",
            "title_similarity": "0.27007052",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gwntmzd",
            "score": 0,
            "text": "H",
            "title_similarity": "-0.10456957",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnu5rn",
            "score": 0,
            "text": "It's not your kid so don't worry about it. Mind your own business.",
            "title_similarity": "0.4295897",
            "sentiment_compound": 0.3988
        },
        {
            "id": "gwnysvs",
            "score": 0,
            "text": "Ppl invested so much in other ppls lives... smh",
            "title_similarity": "0.2683643",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwo2ass",
            "score": 0,
            "text": "Who cares his kid will grow up to be a douche just like him.",
            "title_similarity": "0.7576375",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwo2y11",
            "score": 0,
            "text": "Why does it matter to you? Why does it bother you that you have to make a post about it? CMC: OP has no life, needs a job and just makes posts about complaints. I don't understand these type of petty posts.",
            "title_similarity": "0.714026",
            "sentiment_compound": -0.8105
        },
        {
            "id": "gwo3eob",
            "score": 0,
            "text": "Elon Musk commits workers right violations constantly, willfully keeps his factories unsafe, has spread misinformation about the current pandemic, refused to let his staff stay safe during said pandemic, steals the credit for Tesla and SpaceX from the engineers who make it possible, benefits from child labor and imperialist coups, he literally got his inheritance from an apartheid emerald mine run with slave labor, and much, much more but yes he is an asshole for giving his kid an incredibly stupid name and the kid will 100% be bullied for it.",
            "title_similarity": "0.8476553",
            "sentiment_compound": -0.7665
        },
        {
            "id": "gwo3oa0",
            "score": 0,
            "text": "Who gives a fuck about another persons kid",
            "title_similarity": "0.43049622",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwo3qp9",
            "score": 0,
            "text": "Upvoted for the first five words, based",
            "title_similarity": "0.05100262",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo4zqj",
            "score": 0,
            "text": "hes probobly being caled by a regular name and XE is just for press",
            "title_similarity": "0.37922278",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo5xjd",
            "score": 0,
            "text": "Well… My great grandfather was named Adolf and my high school girlfriend was named Barbie. So why not go you fuck yourself with your stupid ass opinions. I think it would just save people a lot of time if you did that.",
            "title_similarity": "0.7413664",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gwo6bc9",
            "score": 0,
            "text": "Elon is the high with high IQ and i think he knows what he is doing (more than you and me)",
            "title_similarity": "0.29088503",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo6qbk",
            "score": 0,
            "text": "I've got a weird name. It's ancient irish. When people don't say it correctly, I correct them. Over and over until they get it right. It's a fucking name, if you're that fucking stupid that you can't pronounce a name properly, you shouldn't have a job.",
            "title_similarity": "0.674844",
            "sentiment_compound": -0.659
        },
        {
            "id": "gwp9nwz",
            "score": 0,
            "text": "Could have stopped that statement  at \"Elon Musk is an asshole.\"",
            "title_similarity": "0.5474508",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwpa7x4",
            "score": 0,
            "text": "He's an asshole for many, many other reasons than just for naming his child bully bait.",
            "title_similarity": "0.7822889",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwprbfx",
            "score": 0,
            "text": "His son is one of the richest babies in the world. Why would he care what other people think of his name? It is a one of a kind name that is surely gonna be remembered from today to his death. I think it’s crazy cool to be called X.. \n\nBtw my nephew’s name is Elon. Because me and my brother are fans.",
            "title_similarity": "0.58793384",
            "sentiment_compound": 0.836
        },
        {
            "id": "gwq2smx",
            "score": 0,
            "text": "How is this pronounced?\nAt least blanket is a real word",
            "title_similarity": "0.07338987",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq2syh",
            "score": 0,
            "text": "celebrities naming their kids stupid things is common af, but the thing is they are rich and famous they won't face any of the repercussions of having a stupid ass name. they wouldn't give their kids stupid names if they weren't in the positions they're in.\n\nalso it's so easy to just adopt a nickname.",
            "title_similarity": "0.63432556",
            "sentiment_compound": -0.6234
        },
        {
            "id": "gwqdpbr",
            "score": 0,
            "text": "If i got to be elon musks son i wouldn't give a fuck if i was named Hitler id love my life",
            "title_similarity": "0.71196496",
            "sentiment_compound": 0.7935
        },
        {
            "id": "gxda0v3",
            "score": 0,
            "text": "Haters! Why do you care how he name his children. I'm 100% sure that the child will not have any problems Stop worrying about Him and try to make the world a better placè",
            "title_similarity": "0.7335144",
            "sentiment_compound": 0.4854
        },
        {
            "id": "gxdadbk",
            "score": 0,
            "text": "Who cares, what his name is, ok its a bit unusual but still, a name is a name... I wonder how Elon and Claire will call him when they made dinner and the boy is playing videogames upstairs...  \n\"X Æ A-12!! Stop playing your videogame! It's time for dinner X Æ A-12!\"",
            "title_similarity": "0.64977324",
            "sentiment_compound": 0.6562
        },
        {
            "id": "gxhvqyn",
            "score": 0,
            "text": "Hi mr Elon musk please Borrow me 2 million £ I work with this money, i will pay you back in the next 10 years I am a worker, I will return your money to you happily I say this sincerely from the bottom of my heart My recommend someone see my letter can all laughing.thanks Elon musk please If any of you are friends with this gentleman Elon musk Deliver my message thanks lots \n\n‎‏Gentlemen, it is my request to accept it or not, it is up to you \n‎‏I tell you honestly, your money will not be lost I am a wise man but I am not very good financially\n\n‎‏My writing is not very good, thanks safi.                                             with endless greetings dear mr Elon musk  I hope you're well and healthy. I know how to work in construction I am good at construction, full bath fitter Now I am struggling with the hardships of life I want to find someone to invest with me to have a better life Buy old houses, renovate them, sell them at a reasonable price in the market I can do this in a good way, what I do not have is money And they need someone to take my hand, and I believe they will succeed Sorry if there is a mistake in writing, forgive me thanks lots safi",
            "title_similarity": "0.5631677",
            "sentiment_compound": 0.9915
        },
        {
            "id": "gxxl5zi",
            "score": 0,
            "text": "His kid is called Kyle",
            "title_similarity": "0.21045935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02usiu",
            "score": 0,
            "text": "Naming your child Barbie is bad? It’s short for Barbra",
            "title_similarity": "0.6844354",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h033pae",
            "score": 0,
            "text": "Put that last bit to the top",
            "title_similarity": "0.021683041",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwnh4pl",
            "score": 71,
            "text": "This is not akin to naming a kid Hitler, I’m sorry, but that is hilarious. I’m pretty sure they have a normal name they call them, but I thought the whole point of it was just a placeholder. The reason being the kid can just go change their name to whatever they want when they are older.\n\nAlso how tf are you going to bully somebody’s name when you can’t even pronounce it? Are his peers just going to start speaking Wingdings at him like they’re channeling a demon? Also, are we going to pretend the kid is going to go to some public school where that would actually happen?  He is going to be bullied regardless for being a rich kid born to a guy a lot of people hate. His name is the least of his worries.",
            "title_similarity": "0.83214307",
            "sentiment_compound": -0.3798
        },
        {
            "id": "gwnf6sg",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwnhw3l",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.18962361"
        },
        {
            "id": "gwnja5x",
            "score": 1,
            "text": "say you have someone named kira. how do you pronounce that? is it kīra? kēra? kē-are-a? if someone has to read the name and say it out loud (which in my mind is the only time a name like this, or X is an issue) and mispronounces it, they can just be corrected and move on. if you have a name that is not 100% clear how to pronounce it it’s the same as naming your kid X. in a strictly verbal situation it’s a non issue.",
            "title_similarity": "0.5578207",
            "sentiment_compound": 0.3129
        },
        {
            "id": "gwnkeb0",
            "score": 1,
            "text": "Musk is a pos",
            "title_similarity": "0.2191845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnknci",
            "score": 1,
            "text": "Naming your kid something as a joke is a selfish move. It’s like getting the joker or a weed leaf tattooed on your face except it’s someone else’s.",
            "title_similarity": "0.70068514",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwnlk28",
            "score": 1,
            "text": "This probably isn't contrary enough to your view, but: at least Barbie is a nickname for Barbara, and still a name by right. Hitler.. While that would be questionable (*why?* are you a nazi? Are you trying to reclaim the name?) it's still an actual name, at least. Names with negative associations can lose them over time, but not names are.. Well, not names.\n\nAt least other \"not names\" that have been used or became common are pronounceable - and some are symbolic or chosen because of their association to the natural world; floral names, for example. I'll even concede that Apple is an acceptable name at this point.\n\nI guess I'm trying to change your view that \"Barbie\" and \"Hitler\" are inherently bad, because they aren't really (well, Hitler probably still needs a few centuries to not bring *that Hitler* immediately to mind), and the novelty of having a crappy/quirky name does wear off.\n\nMusk's nonsense name is terrible, though, and when I've had a conversation about it I've just called the kid \"dot executable\" because that was the closest thing I could remember it being. *That kid already has the nickname .exe from a random asshole now,* at least give them a vanilla middle name to use.",
            "title_similarity": "0.6435634",
            "sentiment_compound": -0.9749
        },
        {
            "id": "gwnllog",
            "score": 1,
            "text": "Wrong. Elon Musk is just an asshole",
            "title_similarity": "0.54984987",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwnnx2f",
            "score": 1,
            "text": "Elon Musk is just an asshole in general",
            "title_similarity": "0.5574245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnpe5g",
            "score": 1,
            "text": "I just want to point out that people do name their kids Barbie and it's perfectly acceptable because Barbie didn't commit genocide (that we know of)\n\nAlso, personally, I like the kids name. It's unique and harmless. I could think of worse names that would make this child's life a nightmare. Like...Stalin, Hitler, Judas, Lucifer, Palpatine, Gollum, Umbridge...",
            "title_similarity": "0.64473903",
            "sentiment_compound": 0.744
        },
        {
            "id": "gwnrxj7",
            "score": 1,
            "text": "I concur. There must be a pronouncement though? Like what do they say to get its attention?",
            "title_similarity": "0.25306728",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gwnvo4z",
            "score": 1,
            "text": "I mean Elon and his wife are narcissistic assholes. Let’s not leave her out of this.",
            "title_similarity": "0.73703724",
            "sentiment_compound": -0.565
        },
        {
            "id": "gwpo17i",
            "score": 1,
            "text": "Everything he does makes him an asshole.",
            "title_similarity": "0.60082436",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpsgy1",
            "score": 1,
            "text": "Musk is a white privileged asshole so of course he's going be a dick about everything.",
            "title_similarity": "0.7395332",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwnsocq",
            "score": 7,
            "text": "u/ardula99 what a bizarre amount of effort put into something that clearly pisses you off but nobody else is losing sleep over. just go live your life and calm down",
            "title_similarity": "0.6928368",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gwn8els",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwnj3h1",
            "score": 2,
            "text": "Elon built his own school for his kids and some other hyper rich kids. He will never be bullied. He also got World famous without doing anything. I‘m sure he will get a nick name and noone will bat an eye.\n\nNormal kids would get bullied obviously.",
            "title_similarity": "0.7187565",
            "sentiment_compound": 0.6242
        },
        {
            "id": "gwnzkcd",
            "score": 2,
            "text": "An interesting hypothetical... \n\nLet's imagine for the moment that Musk had mixed Germanic/Chinese parentage, and decided to use a partially Chinese pinyin spelling for a relatively normal-sounding name like \"Asher\"... (purported to be the kids actual use-name, shortened to Ash). \n\nIn Mandarin pinyin, \"X\" is pronounced \"sh\", and the vowel \"i\" is often pronounced \"er\", and sometimes \"uh\", making the kid's middle name \"Asher\" (and the initial X combined with it could be \"Sasha\"). And Germanic languages use \"AE\" as a short \"a\" (as in animal) sound. \n\nN.B.: I'm not saying this is the case, as it clearly isn't. \n\nI'm just wondering: would a hypothetical Chinese parent naming their kid something *pronounced* relatively normal in Western countries, but *spelled* in accordance with their heritage which would be ridiculous-looking to Western eyes, be \"an asshole\"? A more straightforward pinyin spelling of \"Sasha\" would be Qaxi, if that helps make the example seem more \"real\".\n\nBecause, ultimately, Musk/Grimes' assertion is that this is just a very non-standard (geeky/iconoclastic) spelling for something fairly normal. And I wonder if their considering \"geek\" to be their \"culture\" rather than some nationality (which would be mixed anyway) is really all that wrong. I mean... it's certainly *accurate*.",
            "title_similarity": "0.49175066",
            "sentiment_compound": 0.4947
        },
        {
            "id": "gwnzrbi",
            "score": 3,
            "text": "Hold up, people still think that's the kids actual name??? He literally has forgotten his child's name in interviews how is it not obvious he doesn't want people to know his kids actual name so the kid can be left alone in life?",
            "title_similarity": "0.79325205",
            "sentiment_compound": -0.6227
        },
        {
            "id": "gwo1zpo",
            "score": 3,
            "text": "I have this theory that that is not actually his name and he just did that to troll the world. Besides even if that is his real name, his father is the most powerful man in the world right now so he has nothing to worry about.",
            "title_similarity": "0.69083977",
            "sentiment_compound": 0.6704
        },
        {
            "id": "gwnfzl6",
            "score": 13,
            "text": "It's a terrible name in all fairness but he's a celebrity and he's rich so he can do anything that he wants. Nobody is gonna bully him about the name if they can be friends with one of the richest kids in the planet instead.",
            "title_similarity": "0.56551784",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gwnm64k",
            "score": 4,
            "text": "Well because he is Musks son that already opens him up to bullying and ridicule from the media already. And if his legal name is actually “X” that’s kinda cool in my opinion and something he could definitely go by without being bullied. Of course kids are cruel sometimes and if they found out the middle name they might make fun of it for sure. But I’m sure they’d be funding out everyone else’s middle names after seeing the attendance sheet or something and see others with maybe feminine male middle names or something. \n\nSo maybe he’s bit of an attention whore for actually naming his kid that, but at least he saved him from making that whole thing his first name and instead can legally just go by X for his first name",
            "title_similarity": "0.8033792",
            "sentiment_compound": 0.3717
        },
        {
            "id": "gwn6vt3",
            "score": 313,
            "text": "I thought it had a really sensible nickname, something like \"Ash\"? I've already forgotten what the kids name actually is, but it struck me as reasonably sensible when I saw the explanation of what it means and \"Ash\" seemed like a cute name.",
            "title_similarity": "0.4542607",
            "sentiment_compound": 0.7227
        },
        {
            "id": "gwnqv3t",
            "score": 7,
            "text": "The name is not unpronounceable. It's an extremely edgy spelling of Kyle",
            "title_similarity": "0.38458443",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwn5ao4",
            "score": 5187,
            "text": "All that would be valid if the kid wasn't born in a multi billion rich household. Normal rules don't apply to those people and nothing would change the kid's future even if was named Crap McFucker.\n\nHe doesn't condemn his child to any kind of trouble. He's still an asshole tho, because forcing people to bend around your petty games is a way to assert power. It's the modern day equivalent of Caligula naming his horse senator.",
            "title_similarity": "0.77294767",
            "sentiment_compound": -0.1553
        },
        {
            "id": "gwni7bg",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwn7s4w",
            "score": 691,
            "text": "The kid is going to receive ridiculous amounts of attention whatever his name is, just because of being Elon Musk's kid. He'll almost surely have a nickname which is easier on everyone's ears. Sure, there will be downsides, some people will probably make some snide remarks. But there will be benefits too, he's going to have a fun conversation starter and be able to decide for himself what he's going to be called. In the grand scheme of things it all doesn't really matter because his wealth and prestige are going to shelter him from most of the consequences.",
            "title_similarity": "0.5937183",
            "sentiment_compound": 0.9602
        },
        {
            "id": "gwnnx28",
            "score": 12,
            "text": "I have a chinese name people found hard to pronounce, they call me by my english name, how does that not apply here? I think the only difficulty is the hassle of confirming your name on official documents or something like that but considering his parentage, his circumstance would probably be known already. \n\nAlso, not sure how difficult it is on the states but names can be changed.\n\nI’m not saying it is right but it’s not that bad",
            "title_similarity": "0.63707066",
            "sentiment_compound": 0.5923
        },
        {
            "id": "gwnf1hw",
            "score": 2,
            "text": "Yepp. And I also thought it was very weird, until I relished he'd hooked up with Grimes and then it made a lot more sense.",
            "title_similarity": "0.5533529",
            "sentiment_compound": -0.4576
        },
        {
            "id": "gwni6u0",
            "score": 1,
            "text": "Wasn't it primarily Grimes that came up with the name? Elon just kinda went with it afaik.",
            "title_similarity": "0.33478144",
            "sentiment_compound": 0.1877
        },
        {
            "id": "gwnjz6o",
            "score": 2,
            "text": "I dont think that the kid will have negative consiquences because of it, most people his age will think its cool and he will probably indroduce himself with a normal name",
            "title_similarity": "0.55740446",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwnk1y6",
            "score": 2,
            "text": "I disagree. I think he's an asshole for acting like Elon Must",
            "title_similarity": "0.6332296",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwnmuwv",
            "score": 7,
            "text": "Names aren't permanent. They aren't even strictly adhered to since nicknames are very common.\n\nIt would be much worse, imo, if parents performed any permanent physical modifications. Circumcision comes to mind as something particularly more egregious than a name.",
            "title_similarity": "0.8098113",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwnn6ob",
            "score": 2,
            "text": "It's just him trying to be excentric.",
            "title_similarity": "0.37693456",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnnsu4",
            "score": 2,
            "text": "Not really. It not like the kid will ever work a day it's life anyway, or go to college or really do anything except work for daddy or become a Kardashian...And with how trendy it's becoming to change genders,  pronouns, and leaving one's \"dead name\" behind, the kid will probably go through a name change at some point. *\n\n*I have zero problem with people declaring new genders, pronouns, or names regardless of why they choose to do so. These things are all trivial anyway.",
            "title_similarity": "0.75037086",
            "sentiment_compound": -0.8581
        },
        {
            "id": "gwno777",
            "score": 2,
            "text": "On joe rogans podcast he explained grimes chose X Ae and he chose A VII after an airplane",
            "title_similarity": "0.34739468",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwno9p3",
            "score": 1,
            "text": "It was his wife. You’re a moron. Elon makes fun of the name constantly",
            "title_similarity": "0.63132125",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwnoh4m",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwnolgi",
            "score": 1,
            "text": "*Elon Musk is an asshole",
            "title_similarity": "0.5243145",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnonuy",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwnoqj9",
            "score": 1,
            "text": "He didn't though. It was a way to get press. A reporter asked him about it like a month ago like \"how's X Aesh 12\" or however it's pronounced and he was like wut..? And after a few seconds he said oh hah you mean my kid.",
            "title_similarity": "0.6140546",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gwnp2gj",
            "score": 1,
            "text": "He's not an asshole he's a dick.He is Humanity's dick and he will fuck Mars with it.",
            "title_similarity": "0.5891503",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gwnpv73",
            "score": 1,
            "text": "Also (and I might be wrong) but isn’t the kids “real name” Ash? I don’t think that’s a shitty name. \n\nAlso if he’s an asshole then isn’t everyone who spells names unconventionally? So Dyana instead of Diana or I recently had an uber driver named Kelvin instead of Calvin? Surely those parents are assholes too if this makes Musk an asshole? If not, then I want to throw it back to you: where is the line between weird spelling of “good” names being ok and being an asshole?",
            "title_similarity": "0.8277538",
            "sentiment_compound": -0.8703
        },
        {
            "id": "gwnq1pn",
            "score": 2,
            "text": "I don’t think Elon was the one who chose the name, I am pretty sure it was his wife. Correct me if I’m wrong though.",
            "title_similarity": "0.5277493",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwnq9ku",
            "score": 2,
            "text": "He's an asshole for more reasons than that",
            "title_similarity": "0.4964203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnqmkp",
            "score": 1,
            "text": "How can everyone fall for this like... you really believe he would name his child that way ? Like please understand both of the parents are public personalities, they name it that way so he can stay anonymous because this kid didn't ask for any publicity and probably will live avoiding public craze, paparazzi or whatever bs celebrities and influential personas faces. Truth is, the kid's probably named Charles or John but they publicly state a ridiculous name so when he presents himself as \"John Musk\" he can just play around saying he's distant family not ELON MUSK FUCKING SON. \n\nWhy does that make sense to me only ? You'd never want your children to be recognised in public as a personality, not even considering education or mental issues, superiority or inferiority complexes, ego etc.. He'll be a nobody until he wants to be somebody and if he never wants to be one then the choice is his. The name is a publicity stunt and/or a way to keep the children private name to themselves.\n\nduh?",
            "title_similarity": "0.84171593",
            "sentiment_compound": 0.6646
        },
        {
            "id": "gwnqz3t",
            "score": 3,
            "text": "Should have just named it \"Elons Kid\" because thats what people will call him at this point.",
            "title_similarity": "0.51073146",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnr7cc",
            "score": 1,
            "text": "The name officially being recorded on the birth certificate was sourced to TMZ which is not at all reliable. I’ve read somewhere the name was code for some normal name like Steve; like SR-72 T1000 5 5 5. The sr-72 is a famous plan and starts with S. The t1000 is a future AI Android, E is the fifth letter of the alphabet and V is the Roman numeral for 5. \n\nShit like that.  Saying the name in code for the public was a publicity stunt and the kid has a normal name to go by.",
            "title_similarity": "0.68089944",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwnraor",
            "score": 1,
            "text": "It's peonounced ' Kyle '",
            "title_similarity": "0.12199342",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnrbib",
            "score": 3,
            "text": "In normal cases you are absolutely right. But you are talking about elon musk's kid. I dont think bullying over a weird name is gonna be a problem for the child of the richest man in the world.",
            "title_similarity": "0.62864",
            "sentiment_compound": 0.6392
        },
        {
            "id": "gwnrbr1",
            "score": 2,
            "text": "Normal countries have laws against such atrocities...  \nThis is attention whoring 101!",
            "title_similarity": "0.5048623",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnrhpy",
            "score": 1,
            "text": "I wouldn't mind being named dick tingler if my father was world's richest man.. Every single thing musk does is to look different.. Naturally his baby name choice follows the pattern.. Nothing to get worked up over.",
            "title_similarity": "0.60442126",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwnrium",
            "score": 1,
            "text": "I'm not trying to defend it its a stupid fucking name BUT Musk has said from the beginning the name was Grimes' idea not his so while I agree with everything you've said you need to shift the blame from Elon to her.",
            "title_similarity": "0.68140155",
            "sentiment_compound": -0.4861
        },
        {
            "id": "gwnscy0",
            "score": 1,
            "text": "Iirc, the name itself is supposed to be pronounced as “Kyle”.  The symbols are supposed to represent different letters of the alphabet.",
            "title_similarity": "0.27424037",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnsrwy",
            "score": 1,
            "text": "The fact that his father is Musk will probably stop any bullying tho. Still agree",
            "title_similarity": "0.55152607",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwntl99",
            "score": 1,
            "text": "That is the least asshole thing elon has done.  He's an asshole because he doesn't pay his workers and is afraid of unions, while planning trips to mars and the moon.  He's also got a whole melody of missinformed tweets that prove he's just a moron with money.",
            "title_similarity": "0.7847066",
            "sentiment_compound": -0.4412
        },
        {
            "id": "gwntuwp",
            "score": 1,
            "text": "Tbh, Musk was an ass hole waaaay before that.",
            "title_similarity": "0.49594033",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwnuo21",
            "score": 1,
            "text": "Elon Musk is an asshole. Period.",
            "title_similarity": "0.52209365",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnv8a3",
            "score": 2,
            "text": "My legal middle name has punctuation and a space in it, although in a way that's traditional and not a stunt on the part of my parents. Nevertheless it's something that tends to jam up a lot of software systems that expect that all human names draw from a limited set of ASCII character encodings, and since I write software too, I've always found it a very useful reminder not to impose my artificial constraints on how I think human beings get to name each other and themselves.",
            "title_similarity": "0.69389975",
            "sentiment_compound": 0.5692
        },
        {
            "id": "gwnv8um",
            "score": 1,
            "text": "I think it translates to Ash.  Which is a cool name.",
            "title_similarity": "0.15436341",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwnvoq3",
            "score": 1,
            "text": "He’s not an asshole because Ae is pronounced “Ash” which is a pretty cool & normal nickname and is likely what he would be referred to as.\n\nIt would be the same as if your friend said his name was “Will.” People would just assume it’s short for “William” and not “Willywompus III.”",
            "title_similarity": "0.48395965",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gwnw1gq",
            "score": 2,
            "text": "I'm a male named Saleem. I liked growing up with an unusual name. It was a good conversation starter with people asking me what it means and what culture it comes from. Plus, it was fun for my friends to come up with their own nicknames, like Leemy, or Sale. As someone who struggled with social interaction as a kid, it genuinely helped me. Perhaps Elon noticed the same benefit from his unusual name, and so he wanted his kid to have an unusual name too.\n\nIn Penn Jillette's podcast, Sunday School, he's talked about how he enjoyed having an unusual name, and everyone he knows who has one expresses the same sentiment. This is why he named his kids Moxy and Zoltan. I've been listening to Penn for years and I know he doesn't give a shit about getting media attention for this. He wanted to give his kids the same good experience he had.",
            "title_similarity": "0.54003125",
            "sentiment_compound": 0.9751
        },
        {
            "id": "gwnw9zd",
            "score": 1,
            "text": "Poor kid is doomed to be the kid of Elon Musk regardless of name. Elon probably knew this, thus the fuck-it name.",
            "title_similarity": "0.6861341",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gwnwhm9",
            "score": 2,
            "text": "I mean the kids name is X its not that bad. Weird middle name but no worse than 'Gertrude' (no offense) his name that he write on tests is X Musk on attendance callouts he is Musk, X its not crazy honestly",
            "title_similarity": "0.63664526",
            "sentiment_compound": 0.3289
        },
        {
            "id": "gwnwr8y",
            "score": 1,
            "text": "He's ensuring his name get's on Rick and Morty some more.",
            "title_similarity": "0.41723025",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwnwwgx",
            "score": 3,
            "text": "X is a dope name and musk literally built his kid’s school and hired hand selected teachers. No ones bullying this kid",
            "title_similarity": "0.5795281",
            "sentiment_compound": 0.6305
        },
        {
            "id": "gwnxese",
            "score": 1,
            "text": "Even if it was a dick move, why is it an issue for you? You’re finding things to be mad about that have no bearing on your life.",
            "title_similarity": "0.7162241",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gwnxk8i",
            "score": 1,
            "text": "Alt title, Elon Musk is an asshole *full stop*",
            "title_similarity": "0.5527537",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwnxpmb",
            "score": 1,
            "text": "Go easy on him\n\nI mean, HIS parents named hin Elongated Muskrat, maybe he's just dealing with that",
            "title_similarity": "0.55213165",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwny1by",
            "score": 1,
            "text": "I kept asking my son to name his newborn boy Goser or Zuul, but he wouldnt go for it.\n\nEven popular names like Mao, Xi, Vladimir, Stalin, Og the Slayer, Genghis, or even Kali...but nope.\n\n&#x200B;\n\nBob...so much selection and you go for 'bob'.",
            "title_similarity": "0.7857249",
            "sentiment_compound": 0.7876
        },
        {
            "id": "gwnynvx",
            "score": 1,
            "text": "I have the most common male name in America for the year I was born. But I like most of friends don't like my middle name. So I think we need to judge first and middle name sperately. The first name is way more important than the middle name. And a first name of \"X\"? That sounds like a badass to me.",
            "title_similarity": "0.7345278",
            "sentiment_compound": 0.9342
        },
        {
            "id": "gwnz0v6",
            "score": 1,
            "text": "Hey, I'll take that name for that kind of a trust fund.",
            "title_similarity": "0.1261391",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwnz87o",
            "score": 1,
            "text": "This child will never step foot into a school.  They will be privately tutored.  \n\nAlso, I hate to do this but your argument is based on a false narrative that you have developed around WHY they did it.   Don’t forget, the mother is an artist and people who think differently do different things.  \n\nI think you will need more I formation about how they came to this conclusion.   If you make up a fake reason for why the. You can easily base any extended arguments on that foundation.",
            "title_similarity": "0.7935891",
            "sentiment_compound": -0.9109
        },
        {
            "id": "gwnz8d5",
            "score": 1,
            "text": "He can name his kid whatever he wants though, why are you so triggered? Get over it bud",
            "title_similarity": "0.52985436",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnz9sa",
            "score": 1,
            "text": "It’s pronounced Kyle",
            "title_similarity": "0.005223641",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwnzc0h",
            "score": 1,
            "text": "That kid won’t be going to a public school first of all.. so he prob won’t get bullied but yea, who gives a fuck",
            "title_similarity": "0.692333",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gwnzfdt",
            "score": 1,
            "text": "Stopped reading at the spot of unneccessary attention....he's elons son if his name was carl hed still get unneccessary attention",
            "title_similarity": "0.61591697",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwo02kx",
            "score": 1,
            "text": "How is it pronounced?",
            "title_similarity": "-0.020944752",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo04cr",
            "score": 1,
            "text": "The bullying part is u realistic. This kid is gonna grow up super shelter and either attend some super rich kid school or be home schooled. Maybe they’ll get bullied online but I’m assuming they’ll build up his esteem enough where they won’t give a shit what randos say online.\n\nDefinitely a weird name though",
            "title_similarity": "0.7321197",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwo068r",
            "score": 3,
            "text": "To say they will be bullied for their name is nothing short of speculation and assumption. You have no idea how ANYONE in the future will react to their name. Hell your arguement that he will be ridiculed and bullied is equally as strong as the arguement that it will spark great conversations and be a cool icebreaker that will soften people up to them. Its not even an arguement for debate at that point if the possibility equally exists that it will make him bullied and gain him friends. What matter is it then?\n\nBoth of those arguements are formed from assumptions of peoples behaviors and attitudes, and thats not even factoring in fluctuations of social norms and behaviors.\n\nIts easy to make the assumption he will be bullied or treated negatively based on how people have acted in the past but that is no way predictive of where we might be when the child grows up.\n\nIts well and good to do things to try to ease potential problems but thats all just well wishing crystal ball gazing. No one can predict the future, no one can say what will or will not happen.\n\nYoure point about troubles with the name not formatting properly with other things i cant speak on but i feel like if it was a formatting issue it would have been brought up at the hospital, not several years later in the childs life",
            "title_similarity": "0.8086618",
            "sentiment_compound": -0.3071
        },
        {
            "id": "gwo0thr",
            "score": 1,
            "text": "How dare he not give him an unoriginal name! /s",
            "title_similarity": "0.6354246",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo0v1h",
            "score": 1,
            "text": "I have a (whacky) theory that it has something to do with Nueralink. At some point we'll be connected to a network and comunicating basically telepathically. We'll probably use someones name to send them info. \n\nBut it's possible we'll need a password to connect to certain networks and it might end up being peopel's names; so really, his son's name is just really good cyber security for the future.",
            "title_similarity": "0.5889751",
            "sentiment_compound": 0.8869
        },
        {
            "id": "gwo0zpb",
            "score": 1,
            "text": "He's an asshole anyways, but that's the cherry on top",
            "title_similarity": "0.5946605",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwo1amq",
            "score": 2,
            "text": "I grew up with a weird name, and was bullied a lot, but it was never over my name. \n\nAlso, as Frank Zappa responded when he was addressing similar concerns when he named his kid Moon Unit, kids will find a way to bully other kids whether the name is weird or not.\n\nPersonally, I'd rather see more unique names rather than the same old boring generic ones anyway.",
            "title_similarity": "0.851688",
            "sentiment_compound": -0.9042
        },
        {
            "id": "gwo1nuj",
            "score": 1,
            "text": "It’s probably a fake placeholder name so paparazzi don’t know the baby’s real name",
            "title_similarity": "0.69168353",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwo1uwx",
            "score": 2,
            "text": "Yea not an asshole, the name is easy to pronounce if you can read english. It's Kyle and he only drinks monster energy mixed with rocket fuel",
            "title_similarity": "0.44856045",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwo20a7",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwo21gy",
            "score": 1,
            "text": "Didn’t he say something like “his dad is so rich and famous, and he’ll live such a privileged upper class life that I had to give the other kids _something_ to make fun of him for so he grows up relatively socialized”",
            "title_similarity": "0.5857362",
            "sentiment_compound": 0.9234
        },
        {
            "id": "gwo2tmk",
            "score": 1,
            "text": "People will take a simple name with simple spelling and change it and combine it with another name and call it to their children. Teachers can’t  pronounce anyones name anymore. Our own actions make us special not our name. Your child isn’t special because you named it Specwial.",
            "title_similarity": "0.75893784",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwo310d",
            "score": 1,
            "text": "You gotta realize as well that this kid will have everything he ever needs and can pursue to the fullest whatever he loves. Which would result in him really not giving a fuck what his name is",
            "title_similarity": "0.5596844",
            "sentiment_compound": 0.7458
        },
        {
            "id": "gwo32hm",
            "score": 1,
            "text": "What you’re saying is irrelevant because Elon musk is a Robot",
            "title_similarity": "0.5379914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo3iaw",
            "score": 1,
            "text": "Shit I think Elon is a bit of an out of touch asshole regardless what he named his kid.",
            "title_similarity": "0.7666834",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwo4gsq",
            "score": 2,
            "text": "Do you know that they plan on actually calling the kid that? I mean, I can imagine it being a sort of privacy thing. His official name is weird and impossible, but personal acquaintances will know his “real” name which is likely more typical. I know some people who have done this with a first name that’s a family member, and the middle name is their “real” name. Then based on what someone calls you you know if they’re a personal contact or someone who looked you up.",
            "title_similarity": "0.62009346",
            "sentiment_compound": -0.09
        },
        {
            "id": "gwo4jda",
            "score": 1,
            "text": "That kid is never going to work a single day in his life. I am sure they’ll be fine!",
            "title_similarity": "0.52514327",
            "sentiment_compound": 0.5255
        },
        {
            "id": "gwo5eej",
            "score": 2,
            "text": "he’s automatically gonna get unnecessary attention bc of who his father is. at least it’s not the name of one of the most notorious war criminals in history",
            "title_similarity": "0.7879087",
            "sentiment_compound": -0.9069
        },
        {
            "id": "gwo5ryv",
            "score": 1,
            "text": "Do you honestly believe that child will ever be in an environment where he will have even the slightest negative experience because of his name? The name Musk protects him from all of that.        \n\nLet Elon name his kids whatever he wants.",
            "title_similarity": "0.7466339",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwo659a",
            "score": 3,
            "text": "Kids nowadays are way more understanding, the times are changing, our kids are going to be similar age of his son and i believe our community will educate their kids way better in terms of bullying. Also i dont think Elon will send his son in some random school, as far as im concerned he is developing pretty futuristic education model. Happy Holidays!",
            "title_similarity": "0.61322325",
            "sentiment_compound": 0.8313
        },
        {
            "id": "gwo73fx",
            "score": 2,
            "text": "Anybody who names their kids weird and unusual names (or spelling a normal name weirdly for uniqueness) is an asshole. Bullies are ruthless and there's no way the parents don't know that it'll cause bullying.",
            "title_similarity": "0.8531978",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gwo76ly",
            "score": 1,
            "text": "Maybe try learning how to pronounce it before dogging it and relating it to buttholes.",
            "title_similarity": "0.34249595",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo7f2i",
            "score": 1,
            "text": "I'm still worried that in the future he will basically be the dictator of the U.S. He already has a cultist fanbase that is worse than Trump's, is extremely smart and completely full of himself at this point. If he doesn't already think the world revolves around him, he will soon like most of his fans.",
            "title_similarity": "0.66797125",
            "sentiment_compound": 0.0498
        },
        {
            "id": "gwo7mud",
            "score": 1,
            "text": "No different than your typical black names. Sinsir is my favorite.",
            "title_similarity": "0.29362437",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwo7vlh",
            "score": 1,
            "text": "Lmao mans really compared that to being called Hitler? You’re just mad he’s a billionaire capitalist",
            "title_similarity": "0.64897585",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwo7y1h",
            "score": 2,
            "text": "Fun Fact: I have a girl named Barbie in my class. Cute little chubby girl with gorgeous brown, thick hair. The name is so not fitting her, it makes me sad.",
            "title_similarity": "0.601658",
            "sentiment_compound": 0.802
        },
        {
            "id": "gwo807q",
            "score": 1,
            "text": "Who gives af what parents decide to name their child... why does it bother so many people LOL weirdos",
            "title_similarity": "0.73966664",
            "sentiment_compound": 0.0764
        },
        {
            "id": "gwo88uy",
            "score": 2,
            "text": "You could be called “shitface mccockhead” but when you’re born into billions it really doesn’t matter.",
            "title_similarity": "0.52930444",
            "sentiment_compound": 0.145
        },
        {
            "id": "gwo8bo6",
            "score": 1,
            "text": "There's nothing stopping his kid from adopting a nickname for daily life.",
            "title_similarity": "0.46745944",
            "sentiment_compound": 0.1139
        },
        {
            "id": "gwo8h5o",
            "score": 3,
            "text": "There was a girl in my school named Barbie, and I am betting the kid will be fine and called X for short. Also an heir to billions. What about Tallulah, scout, rumor Willis, or Apple, blue ivy, blanket I mean if your rich your name is worn Loud and proud with no lasting trauma.",
            "title_similarity": "0.47141543",
            "sentiment_compound": 0.753
        },
        {
            "id": "gwo8mdo",
            "score": 1,
            "text": "Maybe it’s a strange effort to advocate for self naming",
            "title_similarity": "0.35565075",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwo8pma",
            "score": 1,
            "text": "I just generally despise that fucker. Don’t even know why. His stupid face maybe?",
            "title_similarity": "0.6624558",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gwo8ua5",
            "score": 3,
            "text": "You're stretching your argument to absurdity by comparing Elon's kid's name to Hitler. While the name might be cryptic, it is not offensive and is not named after a genocidal mass murderer.\n\nDo you also feel equally judgmental about parents from different ethnicities who name their children with hard to pronounce and harder to spell ethnic names?\n\nThen what's the difference between parents using ethnic beliefs to name their child vs parents using some other belief system to name their child?",
            "title_similarity": "0.7618354",
            "sentiment_compound": -0.7491
        },
        {
            "id": "gwo9jjf",
            "score": 1,
            "text": "Elon Musk is an asshole in general",
            "title_similarity": "0.52849805",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo9k9r",
            "score": 1,
            "text": "He is an asshole for so many other reasons.",
            "title_similarity": "0.50676584",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwo9o68",
            "score": 1,
            "text": "If I'm set to inherit billions of dollars, you can call me whatever the fuck you want. Name me in assembly machine code for all I care.",
            "title_similarity": "0.44567096",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwoaz3q",
            "score": 1,
            "text": "Doesn’t this mean Kyle ?",
            "title_similarity": "0.15951186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwob97h",
            "score": 1,
            "text": "He isn't, his kid is rich, it doesn't matter. He won't get bullied, he will get educated with other kids with dumb retarded names.",
            "title_similarity": "0.5251386",
            "sentiment_compound": -0.0464
        },
        {
            "id": "gwobxot",
            "score": 1,
            "text": "Can someone just pronounce it for me? Please lol",
            "title_similarity": "0.22516663",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwoc7ke",
            "score": 1,
            "text": "I think its just a story and the real reason is he doesn't want people to know his sons name.",
            "title_similarity": "0.7714112",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gwoch12",
            "score": 1,
            "text": "I recommend freakonomics podcasts about weird names:\n\nhttps://freakonomics.com/podcast/name-rebroadcast/\n\nhttps://freakonomics.com/podcast/marijuana-pepsi/\n\nTurns out that people can have weird names, like it, have no or very little problems with that. Discrimination in job hunting is one potential problem I can imagine (\"let's just not hire this guy with weird/fake name\") but it's very unlikely for a wealthy and known person. Also less and less common with so many weird names from all around the world you can't pronounce. That's actually more likely to happen to random guy with name stereotypically thought of as \"black\" or \"redneck\", than to an unusual name.\n\nThis guy will probably just be called X by his peers, which isn't much different from kids' names E and Yo from the podcast, that are completely fine and like their names. He'll also have much easier \"middle names\" than either E or Yo. Those are the most similar situations of weird names that I can think of. Do you know of any examples that would seem similar to X but have detrimental effects? If not, you're not rational with your accusation. Seems as if you reject it because it's weird and you wouldn't do it yourself, then make up problems it would cause.\n\nThere might be some downsides, there also might be some upsides. Both are similar, kids making fun of a weird name, or others finding the name interesting and cool. Neither is that important. You just assume negative reaction.",
            "title_similarity": "0.6863936",
            "sentiment_compound": -0.1187
        },
        {
            "id": "gwocxgk",
            "score": 1,
            "text": "It was discussed on a different Reddit thread that she might have a real normal name too and this was just sorta trolling",
            "title_similarity": "0.4674595",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwocy1s",
            "score": 1,
            "text": "Memes are more important than children",
            "title_similarity": "0.37688747",
            "sentiment_compound": 0.2716
        },
        {
            "id": "gwod4d9",
            "score": 1,
            "text": "I can’t wait to watch this kid grow up. Gonna be an absolute mess",
            "title_similarity": "0.6531905",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwodep7",
            "score": 1,
            "text": "You could have stopped after *asshole* and it'd be enough.",
            "title_similarity": "0.31164795",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwodlpv",
            "score": 1,
            "text": "Counterpoint: Elon Musk giving his kid a weird name is probably near the bottom of assholish things he's done.",
            "title_similarity": "0.70464796",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwodzmn",
            "score": 1,
            "text": "It was grimes who named it, musk added his last name and she insisted he contributed so he named the most badass thing he could (for the middle name) xII after the stealth jet...",
            "title_similarity": "0.64419407",
            "sentiment_compound": 0.101
        },
        {
            "id": "gwoe8wl",
            "score": 1,
            "text": "Both parents are jerks but more so Musk considering he has 6 other kids with normal enough names. You have a 49 yo man with a 33 yo woman, how has Musks relationship changed with his other kids since Grimes came into the family??  Yes his xtreme wealth is nice but there is no guarantee that Musk (or Grimes) will stay this wealthy decades down the line. Private school aside, what about sibling bullying?? Musk created a situation where his other  children may bully this child because of the name and the new family dynamic with Grimes. Yeah both parents suck but Musk takes the cake cuz this isn't his first child while it is for Grimes.",
            "title_similarity": "0.7718081",
            "sentiment_compound": -0.4692
        },
        {
            "id": "gwoe9ay",
            "score": 1,
            "text": "Idk if I’d say he’s an asshole for naming his kid that. But pretentious, yes. It’s like they were really going out of their way to make a “unique” name for their kid but in reality it just sounds dumb. To me it’s just like how all these celebrities try to give their kids weird names like Apple, North, Rocket, etc. to be unique. It’s pretentious but I wouldn’t say being an asshole",
            "title_similarity": "0.8580344",
            "sentiment_compound": 0.765
        },
        {
            "id": "gwoee19",
            "score": 1,
            "text": "Dude, there is no way this kid, when he growrows up wont be all like: \"Hi, my name is... ...whatever...  ...just call me Bob...",
            "title_similarity": "0.62867117",
            "sentiment_compound": -0.5122
        },
        {
            "id": "gwoefni",
            "score": 1,
            "text": "I agree, but the kid is also going to have the easiest life beyond that. He will never want for anything (except maybe his father's attention). And he'll easily be able to afford therapy should he ever need it.",
            "title_similarity": "0.524913",
            "sentiment_compound": 0.8029
        },
        {
            "id": "gwoegep",
            "score": 2,
            "text": "To be fair, as everyone else has already said, the kid is being born richer than any of us here can even imagine, I doubt he'll have too many problems with his birth certificate name, which literally means nothing anyway, I mean they'll call him by his regular basic name anyway.",
            "title_similarity": "0.60851",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwoegr4",
            "score": 2,
            "text": "Have you tried not giving a fuck about Elon Musk? Try it out, works wonders. \n\nThe real change my mind should be \"Elon Musk is a douche, change my mind\"",
            "title_similarity": "0.6132171",
            "sentiment_compound": -0.1744
        },
        {
            "id": "gwoelec",
            "score": 1,
            "text": "Barbie is an actual name though, it was long before the doll.",
            "title_similarity": "0.43638343",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwof5g2",
            "score": 1,
            "text": "You’re going after the wrong parent with this post.",
            "title_similarity": "0.62208396",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwofrgp",
            "score": 1,
            "text": "He should have went with something American like “Jaquain” or “Bugatti”",
            "title_similarity": "0.38580674",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwog3ky",
            "score": 1,
            "text": "It seems most people here are just hating on Elon’s success lol you really just compared this to naming his child hitler? Ahahaha so silly.",
            "title_similarity": "0.82599217",
            "sentiment_compound": 0.5706
        },
        {
            "id": "gwognyb",
            "score": 1,
            "text": "No chance they actually address the child by this name. Putting a ridiculous name on the government documents is par for the course for Elon's trolling. The guy drew an art deco Tesla symbol on the DOGE ticker today. He plays 5D chess because he can. The world is his ant farm.",
            "title_similarity": "0.6547617",
            "sentiment_compound": -0.3049
        },
        {
            "id": "gwognzk",
            "score": 1,
            "text": "If he becomes a professor he could just be known as professor x. Lol",
            "title_similarity": "0.24081431",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwohl4p",
            "score": 1,
            "text": "That’s not his real name dumb fuck.",
            "title_similarity": "0.4253348",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gwohlj2",
            "score": 1,
            "text": "You do realize his kid is going to BE the bully right?? He’s the only child of a hundred billionaire...",
            "title_similarity": "0.68677986",
            "sentiment_compound": -0.5514
        },
        {
            "id": "gwohvqe",
            "score": 1,
            "text": "I tried to make it make sense in my head like maybe its pronounced \"ex-aye-dash-ah-wan-tu\" but it looks as though it is what it is. Id still like to think I'm somewhat close. But Elon is an Alien so.. as long as he keeps up his awesome work, he can name his kid wtf ever he wants. Maybe he's starting a base name for anyone born on Mars. Everyone will be named similarly to his son, so his son will be a mars God.",
            "title_similarity": "0.60750425",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gwohz3l",
            "score": 1,
            "text": "He's an out of touch billionaire that grew up with emerald mine money and is an asshole in general. Dumb middle class youths have glorified him into some tech cowboy icon, but he's just as clueless as and detrimental as all the other wealth hoarders.",
            "title_similarity": "0.7530433",
            "sentiment_compound": 0.2617
        },
        {
            "id": "gwoi4i8",
            "score": 1,
            "text": "I heard it was just a fake name so the kids real name wouldn’t be ruined by Internet Memes",
            "title_similarity": "0.6074872",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gwoipz2",
            "score": 1,
            "text": "He will prob just a have a nickname lol",
            "title_similarity": "0.22933882",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwoitbe",
            "score": 1,
            "text": "The man is one of the most famous people on the planet. I highly doubt his kid is actually called that. He probably just announced it because he didn't want to tell the world his kids real name.",
            "title_similarity": "0.7098948",
            "sentiment_compound": -0.4615
        },
        {
            "id": "gwoj4m9",
            "score": 1,
            "text": "Yeah dude I feel bad for the son of a billionaire",
            "title_similarity": "0.6109212",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwol8rx",
            "score": 1,
            "text": "I just want to know how you pronounce it. Tbh I’m kinda glad he’s got a stupid fucking name.",
            "title_similarity": "0.5236361",
            "sentiment_compound": -0.101
        },
        {
            "id": "gwolae7",
            "score": 1,
            "text": "Half the kids in my grandsons class have fucked off names..like parents take 2 names and  splice them together .",
            "title_similarity": "0.59717596",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gwolhwq",
            "score": 1,
            "text": "Elon is a reptile trying his hardest to imitate a hip Gen Z kid",
            "title_similarity": "0.5902542",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwolist",
            "score": 1,
            "text": "Little mad for no reason eh?",
            "title_similarity": "0.49046385",
            "sentiment_compound": -0.5918
        },
        {
            "id": "gwollvl",
            "score": 1,
            "text": "OK, consider this. Consider that Elon Musk is NOT an asshole for naming his kid  **X Æ A-XII Musk** consider that Elon Musk is an asshole for calling the dude responsible for saving a bunch of kids trapped in a cave a pedophile because his over-the-top \"lookatmewhileItrytobeTonyStark\" cave submarine didn't win the good-deed race.",
            "title_similarity": "0.79665667",
            "sentiment_compound": -0.6336
        },
        {
            "id": "gwolr2s",
            "score": 1,
            "text": "Why is elon an asshole and not george foreman? He named half his kids george 5 sons and a daughter",
            "title_similarity": "0.59151846",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwom0ce",
            "score": 1,
            "text": "There’s a lot of other reasons he’s an asshole",
            "title_similarity": "0.47516194",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwom33a",
            "score": 1,
            "text": "When you have a baby, you can name itwhatever stupid name you want. One of the few perks.",
            "title_similarity": "0.50539553",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwomnlb",
            "score": 1,
            "text": "Could have stopped after \"Elon Musk is an asshole\" and I'd still agree",
            "title_similarity": "0.49183",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwompzp",
            "score": 1,
            "text": "That kid is gonna be bullied so fucking hard, I feel bad for him already. That name is a curse on his existence. Elon Musk had one blunt too many on Joe Rogan's podcast.",
            "title_similarity": "0.8043982",
            "sentiment_compound": -0.9197
        },
        {
            "id": "gwomz9i",
            "score": 1,
            "text": "1- he probably doesnt call the kid that, they probably have a name that they actually use at home\n2- having a name that is basically ungoogleable if you dont already have it written down gives the kid an element of anonymity that a normal name might not.\n3- elon musk is probably just being an asshole for asshole's sake and didnt consider either 1 or 2.",
            "title_similarity": "0.7686955",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwon51v",
            "score": 1,
            "text": "\"X\" is honestly not that strange for a first name. Only his teachers and close friends would ever have to know his middle name. So for all intents and purposes, his name is just \"X Musk\" which honestly isn't that bad.",
            "title_similarity": "0.6346021",
            "sentiment_compound": 0.9108
        },
        {
            "id": "gwonpiz",
            "score": 1,
            "text": "How do you pronounce that?",
            "title_similarity": "0.07502759",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwoo9fo",
            "score": 1,
            "text": "Elon Musk is an a-hole for being Elon Musk. Naming his child is just an act of an asshole and not the defining attribute.",
            "title_similarity": "0.79950243",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwoosx4",
            "score": 1,
            "text": "Doesn't matter. It's his kid, both he and his spouse can choose to name their child whatever they wish too. It's not your choice to make. Call him names and throw a bit of the dirt of anger/hate his way, bit in the end -he and I suspect his spouse are doing positive and beneficial things that contribute to humanity progressing forward in a positive way. If his child is angry about the name, he can change it at the age of consent or as a minor, both his parents agree to it. It's as simple as that",
            "title_similarity": "0.7197509",
            "sentiment_compound": 0.8491
        },
        {
            "id": "gwop02o",
            "score": 1,
            "text": "It’s a joke Karen, what does the kid have to do with you at all? Worry about your own life 😂",
            "title_similarity": "0.7100555",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwop2z0",
            "score": 1,
            "text": "Stfup that's the coolest name eveeeer little dude will feel like a superhero 🤠",
            "title_similarity": "0.38089898",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwoq1pz",
            "score": 1,
            "text": "i actually entirely agree but barbie is a very common name, lol. short for barbara",
            "title_similarity": "0.3015783",
            "sentiment_compound": 0.7177
        },
        {
            "id": "gwoq88a",
            "score": 1,
            "text": "Musk has his own school, nobody is going to be brave enough to bully that kid.",
            "title_similarity": "0.7153115",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gwoqegg",
            "score": 1,
            "text": "It's pronounced X-Ash-A-12. I'm sure he'll go by X or Ash.",
            "title_similarity": "0.29190126",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwoqg35",
            "score": 1,
            "text": "perhaps subjecting the kid to bullying was the point - To build character. Same thing probably happened to Ellen - I mean Elon... and look where that got him.",
            "title_similarity": "0.6023309",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gwoqjyz",
            "score": 1,
            "text": "Moon Unit, Apple, Bluebell, Blue Ivy, Kal-el, Blanket, Moxie Crimefighter, Ivanka...Famous wealthy people have been naming kids stupid shit for a long time and it’s the last thing that’s going to fuck them up.",
            "title_similarity": "0.7323304",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gwoqm14",
            "score": 1,
            "text": "He was an idiot long before giving his child that name.",
            "title_similarity": "0.70201004",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwoqobb",
            "score": 1,
            "text": "Firstly you dont understand law in the United States. Per federal regulation a person may not receive a name at birth nor legal name change displaying any numbers at all, and only 2 symbol characters are permitted, an \" ' \" (apostrophe) and an \" - \"(hyphen). The computers do not permit it in any state, the irs, and social security administration follow that same policy and their computers will not allow this either. So your sources are bullshit, including Elon. \n\nThat said, if you think that's bad, you have no idea whats happening with \"unique\" names generation. Open a dictionary to any page and stab it with a pen. Write down the word you hit. Now close it and do it again on another random page. Take the two words and either combine them or combine half of them, and there's a 85%(+-10%) chance that you have written down the name of someone born after 2005.\n\nEdit:\nAlso to note, the father has no baring on what the mother names the child. The nurses and doctors do not take dads signature, they take moms. While dad can fill out the form, he cannot choose the name of a child or deny the choosing against the will of the mother. So again your entire view is wrong. Go back to school",
            "title_similarity": "0.7393776",
            "sentiment_compound": -0.9417
        },
        {
            "id": "gwoqvyh",
            "score": 1,
            "text": "\nAll names are made up. Every single one. I’ve had many names in my life. Not only is English not my first language ( and that makes my name impossible to pronounce in English ) but it has to be different for every culture so they can find a way to say what sounds like my name. Did my parents think of that when naming me? Of course not, they named me after a long gone character of the 14th century that inspired them to be better people. As it turns out Elon and his wife had similar intent. Truth his, his sons name is just in a language you don’t speak. I’ll even add, you never heard it being pronounced. How many artist have names that don’t actually sound like it’s written? Legions! \nI’ll finish by saying, stop telling other parents how to raise their kids.Get your own kids and set the example by your own actions. Being offended by this show some level of pettiness that, I’m sure, you would live a better life without.",
            "title_similarity": "0.7719667",
            "sentiment_compound": 0.9672
        },
        {
            "id": "gwoqw1o",
            "score": 1,
            "text": "Just let other people do their own thing. You are the only person who has control over your life.",
            "title_similarity": "0.3356407",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwor5b4",
            "score": 1,
            "text": "they could just call him Ash",
            "title_similarity": "0.18903174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwor8hf",
            "score": 1,
            "text": "Elon Musk is an asshole\n\nFTFY",
            "title_similarity": "0.5392834",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwori90",
            "score": 1,
            "text": ">dit 2: multiple people have pointed out that it was Grimes who came up with the name, and not Elon Musk. My bad - I got to know about this whole incident from Elon Musk's Twitter feed, and news articles that reported on Musk, so I assumed (incorrectly) that he contributed in the naming process. \n\nReddit in a nutshell",
            "title_similarity": "0.6456367",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gworix5",
            "score": 1,
            "text": "He is the best and can name his kids whatever he wants",
            "title_similarity": "0.31348747",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gworka3",
            "score": 1,
            "text": "dude, why do you care",
            "title_similarity": "0.2947902",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gworziv",
            "score": 1,
            "text": "I understand where you’re coming from but comparing it to a name like hitler is just fucking stupid",
            "title_similarity": "0.70742726",
            "sentiment_compound": -0.4194
        },
        {
            "id": "gwosrpc",
            "score": 1,
            "text": "His dad is so fukn rich he could change his name once a day for the rest of his life.",
            "title_similarity": "0.4670632",
            "sentiment_compound": 0.5965
        },
        {
            "id": "gwosvzs",
            "score": 1,
            "text": "There are plenty of people that have like 7 first names and just go by their own nickname. Maybe that was his intension here.",
            "title_similarity": "0.31259084",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwotdn0",
            "score": 1,
            "text": "He’s first name won’t matter with a last name like that",
            "title_similarity": "0.39341146",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwoti6f",
            "score": 1,
            "text": "Its just a name, get the fuck over it. Kid can be called w/e they want as a nickname.",
            "title_similarity": "0.47384438",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwotpr2",
            "score": 1,
            "text": ">implying the son of billionares will interact with the poors in childhood, or ever\n\nhes already going to be socially fucked being born into such wealth",
            "title_similarity": "0.66825914",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwou5qc",
            "score": 1,
            "text": "I’m pretty sure you can’t use characters outside of the A-Z alphabet. It wouldn’t be hard to imagine if this was fake.",
            "title_similarity": "0.5260619",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwou5wh",
            "score": 1,
            "text": "Personally I think using  Æ is cool and would love to see it come back.   But that might just be me.",
            "title_similarity": "0.29479188",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gwounny",
            "score": 1,
            "text": "He's more an asshole for his union busting, for inheriting his wealth through apartheid, for acting like he's a self made billionaire, for helping car companies bypass environmental incentives by selling carbon credits, which accounts for the success of Tesla...\n\nHe can call his kid what he wants, it's the least of his shitiness.",
            "title_similarity": "0.6605625",
            "sentiment_compound": 0.9371
        },
        {
            "id": "gwov8q4",
            "score": 1,
            "text": "Why does it matter. This kid is literally going to be one of the most privileged human beings on the planet. He will live a life 100x more fruitful than anyone is this comment section will ever live. The kid will literally inherit billions, but he is going to get a retarded name that can be changed at any time. Musk isn't condemning him to shit other than a life like a king. Now for the fact that elon has a bit of an ego, yeah no shit. If i was competing for the richest man in the US, I too would think my dick would be made out of gold. Any and almost all rich people are douchey to some extent.",
            "title_similarity": "0.5579925",
            "sentiment_compound": 0.697
        },
        {
            "id": "gwovijs",
            "score": 1,
            "text": "I agree, nothing else to say.",
            "title_similarity": "0.0808045",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwow42y",
            "score": 1,
            "text": "Not a hot take. Elon’s definitely a douche for that.",
            "title_similarity": "0.5891665",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gwoxcn2",
            "score": 1,
            "text": "What does the name mean? Why did Grimes suggest it? Anyone know?",
            "title_similarity": "0.32726318",
            "sentiment_compound": -0.3695
        },
        {
            "id": "gwoxh7s",
            "score": 1,
            "text": "Stopped reading when you compared it to Hitler",
            "title_similarity": "0.54728895",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwoyboe",
            "score": 1,
            "text": "Do we know that's the kid's legal name?",
            "title_similarity": "0.23247042",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwoyg4n",
            "score": 1,
            "text": "Everyone will call him X.",
            "title_similarity": "0.21621102",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwoyrg3",
            "score": 1,
            "text": "I don't work for the superrich, but I have wealthy clients.. the richer they are, the more likely they are to use more than one name. This is something they do for protection. So don't assume \"X Æ A-XII Musk\" is the name this person will go by, like \"Jane Doe\", or like you and I have our relatively short names. \n\n\"X Æ A-XII\" likely to just be part of a very long string of names (many parts of which will never be made public), and will likely have little bearing on their everyday lives.",
            "title_similarity": "0.6849028",
            "sentiment_compound": 0.9366
        },
        {
            "id": "gwoyulr",
            "score": 1,
            "text": "Besides all of this, ultimately birth names are just gifts and we're free to give them up if we want to.\n\nMy birth name was based on one of the members of the Moody Blues.  I got rid of it and named myself something much better, in time.  And there's nothing to say this kid won't use it, or get rid of it, or use his own pronunciation (I have a friend who pronounced it Zhe-ah Twelve, which is rather pretty to me).\n\nI know kids named America and Freedom and Doobie and Cutter and Goblin and Halfling and Topher and Clutch and Hemi... and they only really got teased for their names as much as they were outsiders socially (Notably, Freedom was captain of the cheer squad and Goblin played soccer and was Prom King).\n\nBut I doubt this kid will be publicly schooled, which is where a lot of this might come up...",
            "title_similarity": "0.59685016",
            "sentiment_compound": 0.8299
        },
        {
            "id": "gwoz3dq",
            "score": 1,
            "text": "Why do you care what he names his child?",
            "title_similarity": "0.6396706",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwozml7",
            "score": 1,
            "text": "I think it would be cool to have an unconventional name like that, especially when you are going to have an unconventional life. I don't understand what's your problem with it?",
            "title_similarity": "0.408988",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwozmrl",
            "score": 1,
            "text": "I remember reading somewhere that that name somehow translates to, and it is pronounced like Kevin.",
            "title_similarity": "0.102638595",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwp0asb",
            "score": 1,
            "text": "If you make fun of him, you won't be invited to his birthday party on Mars, where they will ironically have a Jupiter Jump.",
            "title_similarity": "0.61144316",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gwp0cfc",
            "score": 1,
            "text": "This is one of those examples of people giving too much of a fuck what other peaceful people do that led us to where we are now and where we are going. You get your opinion; I think it's weird too, but you are the asshole here for being so bothered that you made a Reddit post",
            "title_similarity": "0.7170956",
            "sentiment_compound": -0.5841
        },
        {
            "id": "gwp0cpz",
            "score": 1,
            "text": "They literally call him “X” or “Ash” all the time, that’s way more pronounceable than **ANY** Irish name..",
            "title_similarity": "0.46625373",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwp0g6g",
            "score": 1,
            "text": "I mean, being named Elon in 1971 want exactly common",
            "title_similarity": "0.14962453",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwp0rjg",
            "score": 1,
            "text": "His kid won’t have any issues.  Musk has stated his dislike of the school system so his kid will be home schooled",
            "title_similarity": "0.62955976",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gwp0v29",
            "score": 1,
            "text": "Elon musk is just an asshole all round anyway.",
            "title_similarity": "0.6224072",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwp1bzz",
            "score": 1,
            "text": "condemning his child to unnecessary troubles? Unnecessary trouble will probably not happen in this individual's future.",
            "title_similarity": "0.6100496",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gwp1g1m",
            "score": 1,
            "text": "You guys forgot that each and every one of his billionair neighbors kids wouldn’t make fun of him because the parents brainwash them to think musk is god himself and anything he does is right.",
            "title_similarity": "0.8452693",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwp1igm",
            "score": 1,
            "text": "We are all assholes for giving a shit what that robot does with their life or their offspring robot children.",
            "title_similarity": "0.79119325",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gwp2bzy",
            "score": 1,
            "text": "My mans named his kid the project code of a goddamn airplane. Bruh the engineers working on the thing wouldn't have named the airplane that if they didn't have to, they probably name it \"bob\" or somethin. Elon should have some respect for his own kid at least man, imagine what he'd have to go through to enter his actual name into a computer. Now that is hell. Mans wouldn't be able to fill the My name is section in his nursery book till he atleast 10 or some shit. Dude I don't care if you a multi bajonkaloire, give the kid a name, not a code",
            "title_similarity": "0.7681965",
            "sentiment_compound": -0.8963
        },
        {
            "id": "gwp2d26",
            "score": 1,
            "text": "The title could've stopped and \"Elon Musk is an asshole\" and still been accurate",
            "title_similarity": "0.5172704",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwp2iqe",
            "score": 1,
            "text": "CMV: Elon Musk is an asshole.\nFTFY",
            "title_similarity": "0.5654055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwp2kq2",
            "score": 1,
            "text": "\"I feel it's inaccurate to say that Musk had 0% responsibility in it, because, at the end of the day he's one of the parents too.\"\n\n\nHaha. You think Elon is actually going to parent that kid! That wouldn't be very Musk like for Elon to start now.",
            "title_similarity": "0.7201652",
            "sentiment_compound": 0.7245
        },
        {
            "id": "gwp2mtj",
            "score": 1,
            "text": "I thought all that was just a joke and that the babies name so Kyle.",
            "title_similarity": "0.5873569",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwp338p",
            "score": 1,
            "text": "Who gives fuck Kid is not going to ever want for anything, TBH being called Mr X is fucking cool.   \n\n\nIf you read the breakdown of what it means they have put things in their own lives they care about into a name for their child.   \n \n\nX being the unknown variable often seen in mathematics.\n\nÆ refers to the elven spelling of Ai, which is short for Artificial Intelligence and also means love in Japanese.\n\nLastly, A-12, which is now A-Xii, is the couple's favourite aircraft -  a Lockheed - and a precursor to an SR-17, better known as Blackbird.",
            "title_similarity": "0.66499996",
            "sentiment_compound": 0.9152
        },
        {
            "id": "gwp3cwd",
            "score": 1,
            "text": "They call me sue , kid will grow up strong. And we’ll rich \n\nhttps://youtu.be/ZR5XGTpophI",
            "title_similarity": "0.37995532",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gwp3gvm",
            "score": 1,
            "text": "It’s his kid, he can name him ugene George  mcgee, if the kid doesn’t like the name he can get it changed, and I bet you his parents would change it if he wanted.",
            "title_similarity": "0.6147047",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwp4zs4",
            "score": 1,
            "text": "Lol this happened like a year ago where have you been?",
            "title_similarity": "0.16356206",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwp53hx",
            "score": 1,
            "text": "His kid can change the name when he gets older but it is indeed cruel to your kid. I saw a lot of samsung and iphone names for their kids. It has been a laughing stocks for the Internet, and I couldn't imagine how they grow up.",
            "title_similarity": "0.7479631",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwp55zt",
            "score": 1,
            "text": "In my opinion not really it just asserts his dominance",
            "title_similarity": "0.3461017",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwp5aar",
            "score": 1,
            "text": "I challange that THIS is why he is an asshole. He was an asshole long before. Fighting against his workers safety. Dodging taxes. Recieving a government bailout during the pandemic while he was becoming the richest man.  The rumored slave mining that he is involved with. He was an asshole before, as far as asshole things he has done or is doint, naming his kid something like this rates pretty low tbh.",
            "title_similarity": "0.732324",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gwp5bw2",
            "score": 1,
            "text": "My moms name is Barbie how fucking dare you.",
            "title_similarity": "0.6545458",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwp5vs2",
            "score": 1,
            "text": "Elon’s not an asshole for naming his kid a dumb name.  He’s an asshole for playing off the bootstraps trope while being the son of a gem trader from South Africa.  He’s an asshole for treating his staff like shit and being condescending to anyone who doesn’t agree with him, stealing ideas and railroading friends and colleagues for the sake of personal advancement.  He’s also an asshole for buying a McLaren F1 and treating it worse than a rented focus.\n\nLegal names are impermanent and all of Elon’s kids will be rich beyond all of our fathomable comprehension... there is nothing that tells me that any of his kids will suffer unless it’s some level self-imposed martyrdom like most other rich kids.",
            "title_similarity": "0.8012771",
            "sentiment_compound": 0.2911
        },
        {
            "id": "gwp63kw",
            "score": 1,
            "text": "You sound like a whiny Reddit pussy mad that someone else has money and you don't",
            "title_similarity": "0.6944106",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwp6i7t",
            "score": 1,
            "text": "He’s leaving behind a fortune, multiple successful companies and possibly Mars. I doubt the kid cares.",
            "title_similarity": "0.5937023",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwp6o3e",
            "score": 1,
            "text": "You pronounce his name Ash, not that big of a deal, he will be going to his fathers school and taught well. I don't see it as an issue.",
            "title_similarity": "0.54877335",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwp6oct",
            "score": 1,
            "text": "Nobody is going to call the child by that name. You are a gullible idiot who took the bait. In daily live he is going to have some lame American name, like Jonny.",
            "title_similarity": "0.84685206",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gwp6v00",
            "score": 1,
            "text": "That kid is a billionaire, set for life and will be put in charge of any company he chooses on the fart smell of a chance he will be like his father. \n\nElon could name him “Hitler reincarnated” and he will still have a much better life than you or i.",
            "title_similarity": "0.566949",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gwp7m12",
            "score": 1,
            "text": "Because people with power like that think they can do anything and get away with anything. But it could also mean he wants his kid to be unique. Prince did that. So did Kanye.",
            "title_similarity": "0.6381831",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gwp7mrg",
            "score": 1,
            "text": "He's an egomaniac and a sociopath and the people here are his personal cult of personality. They'll go to any lengths to defend the actions of their lord and savior. Brainwashed and deluded, calling him Elon like he's their local pub buddy.\n\nReddit is a bubble. If you spread the bullsh\\*t that's popular around here in the real world, you'll quickly realize how bizarre most of the views in here are.",
            "title_similarity": "0.753551",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwp7no1",
            "score": 1,
            "text": "Sometimes it feels like Elon Musk is actually 7 years old",
            "title_similarity": "0.17938711",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwp7v4j",
            "score": 1,
            "text": "Elon Musk is an asshole period.",
            "title_similarity": "0.49777055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwp8nqp",
            "score": 1,
            "text": "It's pronounced Kyle\n\nAnd his son will never go to a public school anyway",
            "title_similarity": "0.66926193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwp8tks",
            "score": 1,
            "text": "He’s also an asshole for firing any employees for taking a COVID sick break, he makes kids in Africa mine lithium, and he had America coup Bolivia for resources for his company. He’s an evil asshole.",
            "title_similarity": "0.7617998",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gwp8wn2",
            "score": 1,
            "text": "Reddit's hatred and love of musk is hilarious",
            "title_similarity": "0.52957535",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwp90cj",
            "score": 1,
            "text": "I knew a kid when I was very young named C3 after C3PO. Parents who do that shit are setting their kids up for a childhood full of teasing. But at least that was a movie. This is a pure ego feeding move. What a douche. People born into massive wealth are always such assholes.",
            "title_similarity": "0.7366071",
            "sentiment_compound": -0.765
        },
        {
            "id": "gwp93oy",
            "score": 1,
            "text": "I know you’ve already been convinced that the fact that he’s Elon’s son makes a difference, but here’s a slightly different take: Elon is known for being a big personality who does crazy things. His son being named this will tie his reputation of being an eccentric genius with his girlfriends reputation of being an artistic genius into his son. People will see the name and think great things. It’s basically taking what LA celebrities do (North West, etc.) and changing it to the tech nerd industry.",
            "title_similarity": "0.68960166",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwp9kcw",
            "score": 1,
            "text": "Elon Musk is just a plain asshole, nothing more to say.",
            "title_similarity": "0.5700766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwp9n5a",
            "score": 1,
            "text": "Oh please.  This child's dad is the richest man on earth.  Cry me a river for the tough times that lay ahead for him.",
            "title_similarity": "0.5472988",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwp9p7o",
            "score": 1,
            "text": "Naming someone an unorthodox name is akin to naming them hitler? Lol you must be joking... I mean I get his name is weird but he is Elon Musk's son, I'm sure he will be fine. Certainly is nothing like hitler tho... Im willing to bet he will tell everyone to call him \"Ash\" Which is the way the middle symbol is pronounced.",
            "title_similarity": "0.82168376",
            "sentiment_compound": 0.7639
        },
        {
            "id": "gwpaajh",
            "score": 1,
            "text": "Musk and Grimes are very rich.  This kind of hardship builds character.  There aren’t many ways for billionaire babies to build character otherwise.  I can’t think of any actually besides Illness, disfigurement, or war.",
            "title_similarity": "0.5838225",
            "sentiment_compound": -0.743
        },
        {
            "id": "gwpaakx",
            "score": 1,
            "text": "Ever watch the movie Triple X? X gonna give it to you.",
            "title_similarity": "0.31528112",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpacc2",
            "score": 1,
            "text": "bullying may happen less on average in paid schools, but the bullying that does happen is more vicious and psychopathic, and has a greater effect on the victim, because of the importance of stoicism/not rocking the boat, parents absent on business trips, and more shame if your reputation is dragged in the dirt (higher expectations in life to ruin). A lot of rich kids develop serial-killer level social tendencies. Sharks of the social ladder and experts in ridiculing, subverting, undermining and destroying people’s very soul in a tactical game of chess. Source: can imagine that to be true. But you’re right a wacky name might not cause that bullying, they have lots of wacky names. Still a disservice to the kid for being objectified with a name like that, almost like a product. But he could still make the most of it and become a literal rockstar.",
            "title_similarity": "0.7338276",
            "sentiment_compound": -0.9413
        },
        {
            "id": "gwpaeru",
            "score": 1,
            "text": "He’s going to obviously have a nickname... what a stupid hill to stand on.",
            "title_similarity": "0.5854733",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwpayna",
            "score": 1,
            "text": "You’re worried about what someone else names THEIR baby? LOL that’s cute.",
            "title_similarity": "0.5222217",
            "sentiment_compound": 0.6523
        },
        {
            "id": "gwpb0lw",
            "score": 1,
            "text": "How is his kid any of your business?",
            "title_similarity": "0.39726317",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpb9bq",
            "score": 1,
            "text": "Nah you're the asshole for caring what anyone names their kid. Care about your kid. Care about the name you give them. Leave EVERYONE else's kids name out your mouth.",
            "title_similarity": "0.8086188",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gwpbj3t",
            "score": 1,
            "text": "Some many people in here with an itchy trigger finger to judge someone mostly for being rich.  Nothing this kid could be named are going to overcompensate for the overwhelming advantages being musks kid will likely being, this may down play whatever disadvantages being the child of an ultra wealthy weirdo like musk might bring but I think it’s fair.\n\nYou and all the rest of the people in here casting stones at musk surely enjoy the anonymity of being nameless and faceless as you do so.  I doubt you would fair so well if you were in the position he finds himself in.  So maybe focus your energy elsewhere.",
            "title_similarity": "0.71181464",
            "sentiment_compound": 0.9566
        },
        {
            "id": "gwpbksh",
            "score": 1,
            "text": "I think Elon’s child will have a different life regardless of his name. Even if his name was Robert, things are going to be unique for that child.",
            "title_similarity": "0.5839954",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpcnis",
            "score": 1,
            "text": "Honestly I think drake naming his kid Adonis is worse.",
            "title_similarity": "0.7391499",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwpcnnn",
            "score": 1,
            "text": "A-12 was his contribution. He thinks it’s a cool plane. Grimes did the rest",
            "title_similarity": "0.32320923",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwpcyh9",
            "score": 1,
            "text": "All these upvotes and deltas as if there isnt an interview where someone says elons child's name and he has no clue what they were talking about, maybe bc its not the child's actual name",
            "title_similarity": "0.68190444",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwpd8rx",
            "score": 1,
            "text": "He is an asshole for literally billions of reasons.",
            "title_similarity": "0.53315914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpdd91",
            "score": 1,
            "text": "Yeah his name is Kyle",
            "title_similarity": "0.067383766",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwpddw1",
            "score": 1,
            "text": "He's not an asshole for naming his kid that, your legally allowed to change your name if your unhappy with it.\nAny name is a good name as long as your proud of it, not if some guy on reddit thinks it fits his standards.",
            "title_similarity": "0.61999595",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gwpdgz8",
            "score": 1,
            "text": "He’s an asshole for a lot more than that",
            "title_similarity": "0.49296278",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpdhuu",
            "score": 1,
            "text": "That's not the only reason he's an asshole",
            "title_similarity": "0.4561785",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpdkcy",
            "score": 1,
            "text": "In the end it won't matter. A good chunk of us don't use our first names anyway. They will call him something phonetically when speaking to him and he will use that as his name. But when non-verbal media speaks about him, it will be a pain. Kind of genius really.",
            "title_similarity": "0.7133623",
            "sentiment_compound": -0.7343
        },
        {
            "id": "gwpe5d9",
            "score": 1,
            "text": "Hex trying to fit in with the Chinese market where people name their kid #harambe or horrible words in English",
            "title_similarity": "0.59213865",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwpec0d",
            "score": 1,
            "text": "Who cares honestly. It doesn’t matter, and he will certainly gain a nickname as time moves on. Personally, I don’t call people assholes unless they’ve done something valid enough to earn the title.",
            "title_similarity": "0.5379143",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gwpeiar",
            "score": 1,
            "text": "I honestly feel like the kids name\nIs Alex or something. Someone kinda figured out it was a code name. Probably wrong",
            "title_similarity": "0.55570805",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwpep2q",
            "score": 1,
            "text": "Bro obviously this is the right take but likening it to Hitler and then saying its unpronounceable  are terribly dumb points. \n\n1. You can pronounce Hitler so like, what are you even trying to say?\n2. Naming a kid a weird name and they get bullied for it is vastly different then naming him after one of the most vile humans on the planet. Weird doesnt equal evil.",
            "title_similarity": "0.8197243",
            "sentiment_compound": -0.9521
        },
        {
            "id": "gwpeuvg",
            "score": 1,
            "text": "Xxx",
            "title_similarity": "0.043973714",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpev3g",
            "score": 1,
            "text": "Elon is an asshole regardless anyway",
            "title_similarity": "0.50939643",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpf9ak",
            "score": 1,
            "text": "So they named their kid  X Musk?\n\nIs it pronounced Christmask?",
            "title_similarity": "0.4259129",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpfa5s",
            "score": 1,
            "text": "Isn't his name actually Kyle? I believe it is as one time Elon was asked about it and he didn't recognize the crazy name at first. It was a cypher. Therefore he isn't an asshole for naming his kid that because he didn't name his kid that.",
            "title_similarity": "0.7291565",
            "sentiment_compound": 0.2584
        },
        {
            "id": "gwpfc2u",
            "score": 1,
            "text": "There are a million reasons why Elon is an asshole, but sure let's focus on what he named his crotch fruit.",
            "title_similarity": "0.7206446",
            "sentiment_compound": 0.4497
        },
        {
            "id": "gwpff2q",
            "score": 1,
            "text": "This kid will never have a normal life anyway. He will be afforded privileges and luxuries very few people will ever experience a fraction of. He’s not going to go to a normal school with other kids with normal names. Elon and his wife are completely detached from the average person and I imagine the parents of the children that this child will consort with are similarly detached.",
            "title_similarity": "0.770662",
            "sentiment_compound": 0.079
        },
        {
            "id": "gwpfy06",
            "score": 1,
            "text": "I doubt that’s the kids name. That what they wrote on the paperwork because they knew it would be public for the lulz. It’s like $250 to change it, and they can call him by his real name only they know. Having your kids names be public probably been a problem for the rich in the past.",
            "title_similarity": "0.7012253",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gwpg1fr",
            "score": 1,
            "text": "Wow you should have posted this on the unoopular opinion sub, they love things like that",
            "title_similarity": "0.3445615",
            "sentiment_compound": 0.8885
        },
        {
            "id": "gwpgc9a",
            "score": 1,
            "text": " **CMV: Elon Musk is an asshole** .",
            "title_similarity": "0.55683446",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpgfqi",
            "score": 1,
            "text": "Its to show his kid that his name doesnt matter.  In contrast to lebron who regrets naming his kid junior because of the pressure it has put on him.",
            "title_similarity": "0.7463807",
            "sentiment_compound": -0.5823
        },
        {
            "id": "gwpgipy",
            "score": 1,
            "text": "I don't think he gives a shit about being in the news tbh, it seems more like an amusement to him than a goal. Him and Grimes are just weird AF and do weird things.\n\nAlso you can't really disprove your point here, it's all speculation, even my rebuttal.",
            "title_similarity": "0.7391676",
            "sentiment_compound": -0.3492
        },
        {
            "id": "gwpgm67",
            "score": 1,
            "text": "bullying by who ? considering they will l8ve in their IvoryTowers bathing in cryptocurrency, who will they socialize with ?",
            "title_similarity": "0.6376151",
            "sentiment_compound": -0.644
        },
        {
            "id": "gwpgnej",
            "score": 1,
            "text": "Rule #1 of parenting: \n\nNever give a kid a name that will get them bullied or mocked just for having that name.",
            "title_similarity": "0.7563225",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gwpgww8",
            "score": 1,
            "text": "Bullies don’t bully because of the victim’s name. I have a very unusual name (neither Barbie nor Hitler, but I’ve never met another person with my name), and aside from some very minor and friendly/jokey childhood name-calling, I’ve never been bullied, nor have I experienced any negative repercussions whatsoever due to my name. If anything, having a unique name has helped me define my own personality and become a unique person.",
            "title_similarity": "0.6532978",
            "sentiment_compound": -0.4037
        },
        {
            "id": "gwphjw5",
            "score": 1,
            "text": "“CMV: Elon Musk is an asshole...” full stop. Upvote.",
            "title_similarity": "0.5906511",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwphm9t",
            "score": 1,
            "text": "You should be really careful comparing stuff noone cares about to Hitler. There are very few examples where you could compared something to Hitler but in most cases its just disrespectful so watch your mouth.",
            "title_similarity": "0.7322596",
            "sentiment_compound": 0.3499
        },
        {
            "id": "gwphqu1",
            "score": 1,
            "text": "Wait the minute that kid turn 18 they'll change their name. I have 2 nieces that got stupid names and the second they could legally change it they did.",
            "title_similarity": "0.56652284",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gwpie7u",
            "score": 1,
            "text": "At age 18 the kid will rebel and legally change his name to John.",
            "title_similarity": "0.4822124",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwpih00",
            "score": 1,
            "text": "Pretty sure he's just an asshole anyway you look at it",
            "title_similarity": "0.46521723",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gwpiuoi",
            "score": 1,
            "text": "don’t think the son of the richest man in the world is going to be bullied by anyone lmao. i think he will be fine, i’d surely rather be named some stupid shit like that and be the son of the richest man in the world than being named brent with 500$ in my bank account lol",
            "title_similarity": "0.67870057",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gwpiypn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwpjhpd",
            "score": 1,
            "text": "As someone with a weird, arguably 'made up' ethnic sounding name...\n\nI agree you really shouldn't give your kids weird names. Or stick to weird middle names and a normal first name. \n\nHaving teachers argue with you over what your name is, is just a shitty way to go for a first grader. It was the early 80's so maybe it wouldn't go down like that nowadays.  But still, it's putting a target on your kid's back. \n\nI suppose it does guarantee SEO supremacy if your kid becomes a public figure. And if you're lucky like me google will misattribute the authorship of a university textbook on poetry to them, even if it was written by a distant cousin...",
            "title_similarity": "0.7956948",
            "sentiment_compound": 0.6592
        },
        {
            "id": "gwpkdel",
            "score": 1,
            "text": "I’m pretty sure the the name is just a secret code for a normal name.",
            "title_similarity": "0.44376746",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gwpkdtb",
            "score": 1,
            "text": "He's asshole for much more than that",
            "title_similarity": "0.50184834",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpkmov",
            "score": 2,
            "text": "why the fuck do you care what elon musk names his kid? also it doesn't matter what he names him because that kid is already worth more than everyone on this thread combined.",
            "title_similarity": "0.6636448",
            "sentiment_compound": 0.1346
        },
        {
            "id": "gwpkok3",
            "score": 1,
            "text": "Yeah must be hard growing up with a weird name and billions of dollars.",
            "title_similarity": "0.50324637",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwpkrhq",
            "score": 1,
            "text": "Oh you had me at Elon Musk is an asshole.",
            "title_similarity": "0.59169483",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpl2l7",
            "score": 1,
            "text": "Elon did mention the kid’s name is pronounced Ash for short.",
            "title_similarity": "0.25178835",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwplds4",
            "score": 1,
            "text": "Fuck Elon Musk",
            "title_similarity": "0.31845468",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwpm49c",
            "score": 1,
            "text": "Noone can bully him because he would go home and cut their grandma's neuralink, turn off the starlink connection to their house and stop access to their family car from tesla superchargers just saying",
            "title_similarity": "0.7793952",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gwpmio1",
            "score": 1,
            "text": "I like Musk but he's a total tool naming his kid that. And Grimes thinking it's profound...yes, profoundly stupid. Poor kid is destined for a drug addiction.",
            "title_similarity": "0.7369188",
            "sentiment_compound": -0.8885
        },
        {
            "id": "gwpmryc",
            "score": 1,
            "text": "Shwah?",
            "title_similarity": "0.032275856",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpnd3f",
            "score": 1,
            "text": "Changing warped views is way too much a challenge",
            "title_similarity": "0.48955318",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwpnhew",
            "score": 1,
            "text": "I feel well situated to share some perspective here. I have a fairly unconventional name. Not completely wild, but my first name is actually typically a surname. As a result, I have been able to confirm through public records that I am likely the only person with my name who is alive today.\nAs a kid, it sucked. I hated the first day of school, because no teacher could pronounce my name. I knew, when the teacher hesitated, that I learned to just say here, and tell them my nickname. It was annoying, but I got used to it.\nAs an adult though, I have shifted away from my nickname and back to my given name. I like the uniqueness. If I hear my name, there is a 100% chance the person is referring to me. It also has a nice unintended effect: it makes it very easy for me to manage my public online presence, since every single Google result for my name is in fact me.\nHere's another benefit there: if an employer Googles me, there is no risk that some bad press from a person with the same name as me will affect my employment consideration. On the flip side, I have to own everything on the internet that is me.\nJust my two cents...",
            "title_similarity": "0.75327206",
            "sentiment_compound": -0.0873
        },
        {
            "id": "gwpnm1k",
            "score": 1,
            "text": "I presume people will just refer to him as x, or something like that\n\nPretty sure he was doomed from the start anyway with the last name musk, at least he’s born into a multi million dollar family so it probably won’t be as hard\n\nNot saying he’ll have the perfect life just cause he’s rich, but he’ll have resources that will severely lessen any bullying",
            "title_similarity": "0.6903672",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gwpnw2s",
            "score": 1,
            "text": "So your worried about the kid being bully because of he’s name? It makes you boils so much to make a post about it? The kid will grow wealthy and no boundary will be keep him from becoming who it wants to be. Why are you actually trigger about?",
            "title_similarity": "0.7516319",
            "sentiment_compound": -0.7112
        },
        {
            "id": "gwpnwgy",
            "score": 1,
            "text": "I think you’re putting way to much thought into something that has literally no impact on you. People can do whatever they want (I.e. naming THEIR kid whatever THEY want) and whatever challenges you are making up for the kid won’t effect you and I’m sure won’t be anywhere close to as extreme as you are making them. I promise the billionaires kid is going to be just fine and you will too. Not to mention you know nothing about gimes and musk personally outside of a few posts on social media or however a few news articles choose to frame them, I think it’s unfair to call someone an asshole when you’ve never meet them.",
            "title_similarity": "0.672886",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwpo6gx",
            "score": 1,
            "text": "No one needs to change your mind. He is a ducking asshole.",
            "title_similarity": "0.5061501",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwpocz1",
            "score": 1,
            "text": "This kid wasnt named for earth, elons gonna be sending him up to rule mars with a law forcing weird names for newborns",
            "title_similarity": "0.6372075",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwpozmn",
            "score": 1,
            "text": "A kid named Blue Ivy won a Grammy",
            "title_similarity": "0.23111422",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gwpp48r",
            "score": 1,
            "text": "I would love a sick name like that",
            "title_similarity": "0.30016696",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwppn56",
            "score": 2,
            "text": "It is 2031. An 11-year-old boy anxiously sits in the front row of a courtroom just north of Austin. He’s been awaiting this moment since he first gained consciousness, and is equally nervous and thrilled to hear the words that would undoubtedly change his life.\n\nThe judge is an elderly man who lost his right arm during a laser-related civilian incident in the Second Civil War, having it replaced with a bionic gavel.  He asks the boy to stand up and looks down at him from his bench, slowly but warmly smiling.  He sees decades of dashed hopes and dreams - both real and virtual - in the young man’s eyes.\n\n“It is within the powers vested in me by the Nation of Texas,” said the judge to the boy, “That I hereby declare your birth name stricken from the records and replaced with your new chosen name. Congratulations, Dave Musk.”\n\nIn the back of the courtroom, Dave’s father quietly emits a single drop of ultra-salinated liquid from the corner of his left multispectral ocular device.",
            "title_similarity": "0.6320265",
            "sentiment_compound": 0.9274
        },
        {
            "id": "gwpptoa",
            "score": 1,
            "text": "I thought I was high when I found this out.",
            "title_similarity": "0.116600886",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwppuis",
            "score": 1,
            "text": "Regardless of the kids name, he will get private everything from school to healthcare to car service and everything in between. No one will be near that kid that isnt trying to royally kiss his ass. He'll never realize how fucked up that name is because he'll never be afforded the peasant life that would bully it into his reality.\n\nI wouldnt concern myself with what that kids life will be, because it will only be spoiled.",
            "title_similarity": "0.78849757",
            "sentiment_compound": -0.3786
        },
        {
            "id": "gwppvuo",
            "score": 1,
            "text": "Pronunciation??",
            "title_similarity": "0.026104502",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpq3fc",
            "score": 1,
            "text": "Its pronounced kyle. Kid will probably just write it like that for a while. Seems fine",
            "title_similarity": "0.19661374",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwpq3t2",
            "score": 1,
            "text": "The kid will never get touched by a bully cuz his dad would have given him a flamethrower and seat to send that bully to space",
            "title_similarity": "0.7429571",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gwpqfzd",
            "score": 1,
            "text": "Trust me, no one is giving that kid shit. He will have Mr Beast money and he will likely wear his name with pride if he wants to. If not the. Whatever name the kid wants to go by they will likely go by it. It’s Not like Elon is sending his kid to a public school.",
            "title_similarity": "0.71420753",
            "sentiment_compound": 0.049
        },
        {
            "id": "gwpqlp9",
            "score": 1,
            "text": "It’s just a name....",
            "title_similarity": "0.06893909",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpqpte",
            "score": 1,
            "text": "X gonna give it to ya.",
            "title_similarity": "0.083649956",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpr04h",
            "score": 1,
            "text": "Not really also this is so irrelevant literally his kid and no one knows how the kid work react to his name. People are assholes for even caring at all tbh",
            "title_similarity": "0.8308237",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gwpris3",
            "score": 1,
            "text": "Pretty sure it was cocaine",
            "title_similarity": "0.23208895",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gwps57o",
            "score": 1,
            "text": "Yeah, that's Grimes. Musk contributed the \"A-12\" part of it but Grimes added the \"X Æ\" part. As far aa names go, this is not too much different than other unique name trends lately. Like finding a unique way to spell Kaitlyn \"KVIIIlyn\" for example. Or L-a. Or whatever stupid bullshit people can come up with. If his first name is just X, he'll be fine. It doesn't matter what his name would have been anyway even if it was something normal like Todd because everyone would have known Todd Musk as the son of Elon and Grimes anyway, his reputation would have preceded him. X Musk is fine. Even Exash Musk would be fine.",
            "title_similarity": "0.61698407",
            "sentiment_compound": -0.5734
        },
        {
            "id": "gwps6xg",
            "score": 1,
            "text": "He will always be baby musk or diet musk to me.",
            "title_similarity": "0.36698616",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpsd3q",
            "score": 1,
            "text": "Elon Musk is an Æ-hole for many reasons worse than the name of his child. Worst and most dangerous person on the planet.",
            "title_similarity": "0.7349247",
            "sentiment_compound": -0.8908
        },
        {
            "id": "gwpshdw",
            "score": 1,
            "text": "Well, i mean... its a robot.... so... the name is kinda... nice...",
            "title_similarity": "0.16047487",
            "sentiment_compound": 0.5584
        },
        {
            "id": "gwpsl3x",
            "score": 1,
            "text": "Eat the rich",
            "title_similarity": "0.16054024",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gwpslvi",
            "score": 1,
            "text": "I hope he’s on the first one-way flight to Mars. I think there is a high likelihood his wife is from there.",
            "title_similarity": "0.3752113",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwpspb3",
            "score": 1,
            "text": "It’s definitely a pretty terrible name. But seeing that their first name according to the birth certificate is X, it’s not that bad. That’s actually a pretty cool first name in my opinion. Hardly anyone cares about your middle name most of the time. My middle name is Michael (that’s where the m in my username comes from) but few people know that and even fewer people care. I wouldn’t want my first name to be the full X AE A-XII but I wouldn’t be upset going by X.\n\nThat’s obviously just my opinion so maybe you wouldn’t want the name X. And the middle name is still pretty crazy.",
            "title_similarity": "0.7162314",
            "sentiment_compound": 0.9662
        },
        {
            "id": "gwpt11n",
            "score": 1,
            "text": "Isn't it like a code for kyle?",
            "title_similarity": "0.21000224",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gwpte7p",
            "score": 1,
            "text": "We would all be assholes if we were multibillionaires and had extremes amount of power. It’s just human nature.",
            "title_similarity": "0.678205",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gwptmss",
            "score": 1,
            "text": "Names change all the time. Who cares. Bullying? Really? I always see this, kids will find a way whether or not they’re name is funny. I’d be curious to see the creative insults on this one. We are moving toward a stranger and stranger future and I’ve heard way worse names that are directly cringe worthy for our current time. This one needs a whole mew level of creative bullying.",
            "title_similarity": "0.7479149",
            "sentiment_compound": 0.3736
        },
        {
            "id": "gwptyf4",
            "score": 1,
            "text": "As someone with a non evangelical name in America, I disagree. People can't pronounce my name because its in the language of my parent's home country.\nI think assholes are parents who name their kids john. \nTheres a million johns,way to make your kid not memorable.",
            "title_similarity": "0.84649014",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gwptzmn",
            "score": 1,
            "text": "Has anyone seen the child’s birth certificate? This is probably a way to keep his actual name private",
            "title_similarity": "0.53876936",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpu5ja",
            "score": 1,
            "text": "Horrible name. I have a son and went out of my way to give him a pretty common, solid first name. This kid is silver spoon material for sure but nothing wrong with giving them a common name. Life is hard enough at school as a kid without people making fun of your name.",
            "title_similarity": "0.730457",
            "sentiment_compound": -0.3769
        },
        {
            "id": "gwpuons",
            "score": 1,
            "text": "I am sure it was grimes.",
            "title_similarity": "0.067412734",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwpuvb9",
            "score": 1,
            "text": "Who gives a shit what he names his kids? There are plenty of ridiculous names out there, most of which dont belong to the children of celebrities.  \n\nLong live Moon Unit Zappa",
            "title_similarity": "0.7675631",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gwpv060",
            "score": 1,
            "text": "He’s an asshole for putting chips in Monkey’s brains and calling someone trying to rescue children trapped in a cave a ‘pedo’. This pales in comparison for me",
            "title_similarity": "0.7201071",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwpv0l2",
            "score": 1,
            "text": "He's going to grow up on Mars, so normal names can be whatever Musk says they are there.  /s",
            "title_similarity": "0.30761528",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpv295",
            "score": 1,
            "text": "Elon Musk is an asshole. There fixed your title",
            "title_similarity": "0.57124734",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpv7up",
            "score": 1,
            "text": "My friends Wonderful Terrific  and Yachtzee have entered the room",
            "title_similarity": "0.20285037",
            "sentiment_compound": 0.872
        },
        {
            "id": "gwpvnxd",
            "score": 1,
            "text": "It’s pronounced Ash. The kid will probably just use that as his name so not really a big deal.",
            "title_similarity": "0.5152633",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpvriq",
            "score": 1,
            "text": "It's been scientifically proven that stupid names only have a negative affect on your life if you're poor. Somehow I think his kid will be alright...",
            "title_similarity": "0.62888384",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gwpvsn5",
            "score": 1,
            "text": "He didn’t really name his kid that.  Just did that to give his kid privacy",
            "title_similarity": "0.5731393",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpw0mz",
            "score": 1,
            "text": "Should’ve named the kid Ash. It would’ve been cute.",
            "title_similarity": "0.34198147",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwpw5ut",
            "score": 1,
            "text": "Giving your kid a weird first name is fine if it's something meaningful to you, just give them a normal middle name. They can use the middle name if they prefer. IDK the story behind this name for Elon, though.",
            "title_similarity": "0.51491225",
            "sentiment_compound": 0.3954
        },
        {
            "id": "gwpwrz1",
            "score": 1,
            "text": "He was also one of the causes for major problems in Depp and heards relationship. he was actively fucking amber in Johnny's house while they were still together",
            "title_similarity": "0.6819341",
            "sentiment_compound": -0.1761
        },
        {
            "id": "gwpwv66",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwpx094",
            "score": 1,
            "text": "Your just mad because you didn't think of it",
            "title_similarity": "0.57154083",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwpx9h7",
            "score": 1,
            "text": "X Musk is not a bad name",
            "title_similarity": "0.15617788",
            "sentiment_compound": 0.431
        },
        {
            "id": "gwpxhwr",
            "score": 1,
            "text": "I follow tech news and Elon Musk makes headlines every week.  I honestly had forgotten his son had a weird name.  Personally it doesn't seem like a PR stunt, it seems like he and Grimes are kind of weird people.\n\nAll that said, his kid's name is X, its pronounced like the letter. its X.  its not hard to pronounce and its what you would guess if you saw it written.  I know a J, a Z and a V... doesn't seem weird.\n\nI could see a middle class kid in public school with a name like X getting made fun of but we're talking about the son of richest man on the planet, I don't want to say hes not gonna have problems, but hes not gonna have regular people problems.\n\nLastly... how is X like Hitler?  I don't know any mass murderers named X.... Xerxes?",
            "title_similarity": "0.7519227",
            "sentiment_compound": 0.5747
        },
        {
            "id": "gwpxqo1",
            "score": 1,
            "text": "How is this name pronounced?",
            "title_similarity": "0.04367569",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpxyie",
            "score": 1,
            "text": "I dont know. Why do you have such strong opinions on what strangers do? Maybe just focus on yourself.",
            "title_similarity": "0.568338",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwpy2ra",
            "score": 1,
            "text": "He’s an asshole because he did it for yet another publicity stunt. You think this guys means anything he says? He’s just marketing 99.999% of the time.",
            "title_similarity": "0.6627947",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpy2zn",
            "score": 1,
            "text": "The name ‘X’ is pretty sweet.\n\nMy dawg DMX made good use of it. RIP",
            "title_similarity": "0.35829234",
            "sentiment_compound": 0.8442
        },
        {
            "id": "gwpy7y6",
            "score": 1,
            "text": "He was an asshole before that",
            "title_similarity": "0.4457574",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpyilo",
            "score": 1,
            "text": "It’s his kid he can do what he wants. Clearly does not care about your opinion",
            "title_similarity": "0.590556",
            "sentiment_compound": 0.0186
        },
        {
            "id": "gwpz28j",
            "score": 1,
            "text": "When people asked about why he named his children such odd things as 'Dweezil' and 'Moon Unit', Frank Zappa said, \"It's not the first name that will be the problem.\" \n\nMusk's kid is going to grow up in the middle of celebrity. I wouldn't be surprised if he has a reality show by the time he's 18. Maybe even before 12. The pressures from the ultra-rich lifestyle and ultra-online style of his parents are going to do a lot more to shape his personality than a strange name.",
            "title_similarity": "0.7248436",
            "sentiment_compound": -0.8301
        },
        {
            "id": "gwpz4pp",
            "score": 1,
            "text": "Kid's gonna get called Musky anyway",
            "title_similarity": "0.30508357",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpza0g",
            "score": 1,
            "text": "Wait, someone actually slept with him?!",
            "title_similarity": "0.40784281",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpzhdr",
            "score": 1,
            "text": "If u watched the news and stuff you would learn to pronounce it's not that hard either",
            "title_similarity": "0.29920486",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gwpzim2",
            "score": 1,
            "text": "You gotta reconsider your priorities. Who cares?",
            "title_similarity": "0.38313526",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwpzit2",
            "score": 1,
            "text": "Have you ever heard or read anything Musk has ever said?  Worrying about the experiences of others is a blip that never crosses his screen.",
            "title_similarity": "0.70188296",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwpzpv0",
            "score": 1,
            "text": "Yeah I agree it's kind of rude because his kid is not just an extension of himself but his own complete person. In his case I bet it's controlling narcissist move.",
            "title_similarity": "0.78619766",
            "sentiment_compound": 0.0525
        },
        {
            "id": "gwpzstq",
            "score": 1,
            "text": "lol. Not worth it bud. Not worth it.",
            "title_similarity": "0.45988303",
            "sentiment_compound": 0.12
        },
        {
            "id": "gwpzuhz",
            "score": 1,
            "text": "Elon musk is an asshole. \n\nThat’s all you needed to say lol",
            "title_similarity": "0.6417174",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwpzw89",
            "score": 1,
            "text": "It’s not akin to naming his child anything egregious. \n\nAnd the reality is that it will most likely help his son stay famous/relevant just by having such a unique name. \n\nI’m the other hand, we don’t know whether or not Elon’s son will like the attention. For all we know, the boy could be naturally introverted.",
            "title_similarity": "0.7126175",
            "sentiment_compound": 0.8261
        },
        {
            "id": "gwpzwto",
            "score": 1,
            "text": "He was an asshole long before that let's be real",
            "title_similarity": "0.5972551",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpzytz",
            "score": 1,
            "text": "Hard lives make stronger people. Maybe they recognised that many of the children of powerful people in this world are weak, if not very corrupt people because of the unconditional power they are given by their parents. There seems to be a pattern in one generation being the relatively honourable entrepreneurs that make the money and then their kids inherit it all and surprise surprise, turn out to be really scummy people.\n\nHaving a silly name might just teach the child some humility. If things get out of hand the parents can probably step in and sort it.",
            "title_similarity": "0.6704285",
            "sentiment_compound": 0.8934
        },
        {
            "id": "gwpzzgf",
            "score": 1,
            "text": "Exaeoneyy-seven?",
            "title_similarity": "0.06714705",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq05qc",
            "score": 1,
            "text": "PRETTY SURE Paul Ennis, Morgan Lester (rest in peace moe), Dr.. Shit Fun Chew, Chrystal Methven, Tokyo Sexwhale, Congressman Dick Sweet, and thousands of others would love that name instead of what they have",
            "title_similarity": "0.56168914",
            "sentiment_compound": 0.9333
        },
        {
            "id": "gwq0etj",
            "score": 1,
            "text": "Elon Musk is an asshole for most of the things he does, but I definitely agree that setting up his child for a life of bullying falls under that.",
            "title_similarity": "0.77028906",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gwq0y62",
            "score": 1,
            "text": "Musk is a raging asshole for many reasons including this one. Every lackey of his are sad pieces of shit and the whole lot do nothing more than disappoint me.",
            "title_similarity": "0.69717693",
            "sentiment_compound": -0.8242
        },
        {
            "id": "gwq1i33",
            "score": 1,
            "text": "For $200B I’ll change my name to anything Elon wants after he adopts me.  Bring on the bullying",
            "title_similarity": "0.5383904",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwq1set",
            "score": 1,
            "text": "Guess I’m in the minority cause I thought “wow what a cool name!” Kinda wish it was mine... that’s a conversation starter for sure.",
            "title_similarity": "0.36562407",
            "sentiment_compound": 0.743
        },
        {
            "id": "gwq1xzd",
            "score": 1,
            "text": "When you have a kid you can name it whatever dumbass name you want to name it. That's one of the *joys* of being a parent.",
            "title_similarity": "0.5026982",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwq1zfw",
            "score": 1,
            "text": "Ah good ol’ Grimey",
            "title_similarity": "0.21208458",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwq29xq",
            "score": 1,
            "text": "I agree with you that the name is stupid and is silly for him to do. But I doubt the kid will get bullied. He is Elon’s kid. Every other kid wants to be invited to that birthday party or get to go play at musk house.",
            "title_similarity": "0.7632359",
            "sentiment_compound": -0.5647
        },
        {
            "id": "gwq2nwv",
            "score": 1,
            "text": "I mean, he’s an asshole for a lot of reasons",
            "title_similarity": "0.49369764",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq2o53",
            "score": 1,
            "text": "You could’ve just stopped at Elon Musk is an asshole. I like his vision of a clean energy future but the dude is a piece of shit.",
            "title_similarity": "0.6687537",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwq2o9b",
            "score": 2,
            "text": "For sure. My real name is weird, I'm 40 and it's done no favors. Even in places where I'm waiting to for my name to be called and there's all kinds of ethnic names, I can tell by their face when they get to mine. It's even easy to spell and the words are in english. I think when is read, they just don't want to accept that it's my legal name. It sounds like a hippy tried to name me an analogue of sunshine. I'd just say it but last time I checked I was the only person in America with this name. It's been used as a nickname by some. Most people who don't know it's my real name just think I like to call myself that. Nope, it's been a pain in the ass. I like Bob. Wish my name was just Bob.",
            "title_similarity": "0.66024184",
            "sentiment_compound": 0.4814
        },
        {
            "id": "gwq2scz",
            "score": 1,
            "text": "His name is Kyle. \n\n- X is the Greek letter Chi, which has a K sound\n- Æ makes an “ai” sound,\n- A-12 refers to L, or the 12th letter of the alphabet.",
            "title_similarity": "0.2899536",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq2t14",
            "score": 1,
            "text": "He’s a huge douche regarding everything and everyone around him 🤷🏻‍♂️",
            "title_similarity": "0.55504555",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwq2yhi",
            "score": 1,
            "text": "He was an asshole long before that.",
            "title_similarity": "0.49778053",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq2z4v",
            "score": 1,
            "text": "how do you say it phonetically?",
            "title_similarity": "0.053733036",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq338y",
            "score": 1,
            "text": "He’s a white South African rich kid who profiteered from apartheid and larp as a self made man. He bought Tesla and forced a founders title. He also thinks he is a cool meme lord from the year 2013. He also is super anti-labor. He is a walking homunculi of all that is terrible if fake meritocracy of late capitalism and he propegates it more for his own baby dick ego.\n\nHe’s an asshole for literally a dozen reasons. And yah naming a kid that is shitty as hell. Grimes sucks too for being with a decrepit hair plug ghoul when she markets herself as some pixie pop girl.",
            "title_similarity": "0.7791076",
            "sentiment_compound": -0.936
        },
        {
            "id": "gwq36b7",
            "score": 1,
            "text": "That is a joke thechild has a real name",
            "title_similarity": "0.3624683",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwq3bf8",
            "score": 1,
            "text": "I think op is the asshole",
            "title_similarity": "0.39916146",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq3cyk",
            "score": 1,
            "text": "I don't wanna change your view. He's an asshole for a lot more than his kids name.",
            "title_similarity": "0.77451515",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq3jgg",
            "score": 1,
            "text": "Its not an Earthling name. Its Martian.",
            "title_similarity": "0.299719",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq3l8u",
            "score": 1,
            "text": "Who the fuck is one human to tell another human what to name their child?",
            "title_similarity": "0.51726055",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwq3mw7",
            "score": 1,
            "text": "Hater. You all need something to distract you from the realities of your own life.",
            "title_similarity": "0.5976922",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gwq3qdh",
            "score": 1,
            "text": "There is one connotation where I can see this not being bad, however, as much publicity as he's gotten over it, I'm in doubts. However....\n\nMichael Jackson had named his son Blanket and while the world ridiculed him for it, until his death, his son lived a normal anonymous life under a different assumed name. Blanket was there to throw off the search for Michael Jackson's son, and until he died Blanket was hidden. What his family did after is, IMO, unforgivable, thrusting Blanket into the limelight and now everyone knows what he looks like and who he is.\n\nI'm not a fan of MJ, but he wanted his kid to have a normal kids childhood, something he couldn't have, and if Elon is doing that here, then more power to him, but I have serious doubts.",
            "title_similarity": "0.7589387",
            "sentiment_compound": -0.7996
        },
        {
            "id": "gwq488s",
            "score": 1,
            "text": "*Elon is an asshole. People really need to stop idolizing him",
            "title_similarity": "0.71273464",
            "sentiment_compound": -0.3535
        },
        {
            "id": "gwq4jbr",
            "score": 1,
            "text": "Im pretty sure that he only did this so that people wouldn’t know his kids actual name to get them more privacy, but that kinda went downhill when he publicly announced it was called xæ 12",
            "title_similarity": "0.793092",
            "sentiment_compound": 0.4118
        },
        {
            "id": "gwq4l36",
            "score": 1,
            "text": "You think Bob is normal. I think Bomple is normal. I mean my daughter hasn't complained yet...",
            "title_similarity": "0.34462377",
            "sentiment_compound": 0.3089
        },
        {
            "id": "gwq4wwy",
            "score": 1,
            "text": "Twitter @guyrhytm13 check it,",
            "title_similarity": "0.26765335",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq4ywe",
            "score": 1,
            "text": "I agree but if you think Elon’s kid is getting bullied, you are wrong.",
            "title_similarity": "0.6856318",
            "sentiment_compound": -0.8765
        },
        {
            "id": "gwq4zdj",
            "score": 1,
            "text": "He is a donkey, it is well known.",
            "title_similarity": "0.2348763",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwq5ckh",
            "score": 1,
            "text": "The most relevant name of their name isn't \"X Æ A-XII\".\n\nIt's \"Musk\".\n\nThey will live a life save from bullies, and will receive plenty of chances kids with the best of names will not have, just because of who they are: the child of one of the richest men on earth.",
            "title_similarity": "0.653848",
            "sentiment_compound": 0.9118
        },
        {
            "id": "gwq5xot",
            "score": 1,
            "text": "Grimes and Elon connected when Elon came up with some super obscure joke, when he came up with it he decided to investigate to see if anyone had made the same joke and after some internet sleuthing found out that not only had Grimes thought of the joke but one of her song names was a direct reference to it. It only makes sense that they would name their child some super obscure name because they themselves fell in love over something super obscure.\n\nPlus I bet the kid will come up with his/her (I honestly don't know the sex of the child) own nickname once it can understand the concept. \n\nAll that said, I bet the name has an important meaning for them and the kid will likely only use it for legal documents.",
            "title_similarity": "0.7392427",
            "sentiment_compound": 0.9843
        },
        {
            "id": "gwq5zg1",
            "score": 1,
            "text": "Everybody wants to take down a superstar. But you can't disagree Elon musk is doing the most amazing things.",
            "title_similarity": "0.6569364",
            "sentiment_compound": 0.8561
        },
        {
            "id": "gwq620t",
            "score": 1,
            "text": "I wonder how Key is going to pronounce their name when they go to school.",
            "title_similarity": "0.4368376",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq6kmd",
            "score": 1,
            "text": "“Your name is stupid”\n\n“My dad is the richest man in the world fuck off”",
            "title_similarity": "0.55268323",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwq6yj0",
            "score": 1,
            "text": "Elon Misk is an asshole for a lot more than that",
            "title_similarity": "0.54611343",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq7f9h",
            "score": 1,
            "text": "Obviously",
            "title_similarity": "-0.07640963",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq7gg9",
            "score": 1,
            "text": "How do you say that name?",
            "title_similarity": "0.08235288",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq7ka5",
            "score": 1,
            "text": "And he has the audacity to say that pronouns are hard to pronounce and remember...smh",
            "title_similarity": "0.5071931",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwq7vf6",
            "score": 1,
            "text": "It is nothing compared to Mr and Mrs Dickus calling their son Bigus.",
            "title_similarity": "0.5930012",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq8469",
            "score": 2,
            "text": "Not arguing with your statement, just curious why you thought \"Barbie\" is such an abhorrent name lmao. I knew a few barbies irl and from what I can tell, they've never really been ridiculed because of it.",
            "title_similarity": "0.6602485",
            "sentiment_compound": 0.7092
        },
        {
            "id": "gwq89bh",
            "score": 1,
            "text": "You had me at “Elon Musk is an asshole.”",
            "title_similarity": "0.5560428",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq8q0i",
            "score": 1,
            "text": "Its simple. Think of not Elon Musk and his life...ok your good now, you got no problem.",
            "title_similarity": "0.3295527",
            "sentiment_compound": 0.6319
        },
        {
            "id": "gwq93x1",
            "score": 1,
            "text": "How about, \"Apple?\" I'd rather have an unpronounceable name, than be called a fucking, \"Apple\" of all things...",
            "title_similarity": "0.6004785",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq99ao",
            "score": 1,
            "text": "He’s so annoying.",
            "title_similarity": "0.40821224",
            "sentiment_compound": -0.4576
        },
        {
            "id": "gwq9bd7",
            "score": 1,
            "text": "Why you so mad over such trivial thing? Just the title tells me you hate Elon, not the name specially (it’s not only his child after all) Yes. The name is stupid. Will that remain his name? Probably no. Will he be bullied? He is Elon Muks’s son. People will line up to be his friend, he is only worry will be to find true happiness when the whole world is just trying to be too nice to him bc of his wealth and father.",
            "title_similarity": "0.8714241",
            "sentiment_compound": -0.3728
        },
        {
            "id": "gwq9n06",
            "score": 1,
            "text": "Why does this thread have comments lol",
            "title_similarity": "0.1940734",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwq9o42",
            "score": 1,
            "text": "Your view is partially correct.  You should have just said elon musk is an asshole.",
            "title_similarity": "0.48979232",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq9sdd",
            "score": 1,
            "text": "Elon Musk is an asshole, period.",
            "title_similarity": "0.5436053",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwq9sr7",
            "score": 1,
            "text": "There have been cases throughout history where people have had 'weird' names. We live in a world where people move around and bring strong cultural names with them. So having something that is made up ( just like every other name was at some point) is nothing.",
            "title_similarity": "0.57090074",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwq9zsa",
            "score": 1,
            "text": "Elon was an asshole even before this. There's this cult based around him because he's a \"memelord,\" but he's just another businessman who treats his employees like shit.",
            "title_similarity": "0.71482754",
            "sentiment_compound": -0.3919
        },
        {
            "id": "gwqa7x3",
            "score": 1,
            "text": "Father criticized for naming his child.",
            "title_similarity": "0.65693194",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwqak8f",
            "score": 1,
            "text": "Let parents name their kids whatever unique name they come up with. When kid grows, can change the name. In this case the kid at least wasn't named South West (copyright infringement) or Blanket (too common). Plus who tells you all those satellites dad placed in orbit aren't equipped with lasers. This kid will evaporate bullies by GPS and remote control.",
            "title_similarity": "0.7600589",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwqakvk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwqarf9",
            "score": 1,
            "text": "Good thing there are dicks in this world, because dicks fuck assholes",
            "title_similarity": "0.55596536",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gwqb0tr",
            "score": 1,
            "text": "Good luck getting a mini license plate from Disneyland kid!",
            "title_similarity": "0.33857954",
            "sentiment_compound": 0.7345
        },
        {
            "id": "gwqb73a",
            "score": 1,
            "text": "He's an asshole for a lot more reasons than just this.",
            "title_similarity": "0.48625243",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqbbc0",
            "score": 1,
            "text": "Dude is an A-hole for plenty of reasons. \n\nThis is just one more. 👍🏼",
            "title_similarity": "0.5856067",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqbkfu",
            "score": 2,
            "text": "Barbie is a common name btw, it’s a nickname for Barbara.",
            "title_similarity": "0.3181662",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqblny",
            "score": 1,
            "text": "It's not Christmas it's X musk",
            "title_similarity": "0.29296917",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqc8rz",
            "score": 1,
            "text": "It's pronounced Kyle iirc, and his school will probably have it written as Kyle or something like that, and he will introduce himself to people as Kyle. It's not nearly as big of a deal as you're making it out. Naming your kid Hitler is way worse.",
            "title_similarity": "0.74644303",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwqcdbe",
            "score": 1,
            "text": "Or maybe the best parent ever by ensuring his kid wouldn’t be searchable/queryable on the internet?",
            "title_similarity": "0.7088705",
            "sentiment_compound": 0.743
        },
        {
            "id": "gwqcfqq",
            "score": 1,
            "text": "Imagine caring about the name of a child you will never meet.",
            "title_similarity": "0.6166243",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwqcokl",
            "score": 1,
            "text": "Black people make up bizarre names all the time too",
            "title_similarity": "0.41513857",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwqcpzq",
            "score": 1,
            "text": "Sometimes I think he’s just trolling everyone with that name and it’s what he told the public so his kid could have some anonymity",
            "title_similarity": "0.67634654",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqcwp3",
            "score": 1,
            "text": "I think he legit thinks he’s an alien or some shit.",
            "title_similarity": "0.46453202",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwqdao5",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwqdqwi",
            "score": 2,
            "text": "Elon knew he wouldn't be around to raise the kid so he gave him this name to make him tough",
            "title_similarity": "0.75962067",
            "sentiment_compound": -0.128
        },
        {
            "id": "gwqepgj",
            "score": 1,
            "text": "He will get a nick name like every Richard.",
            "title_similarity": "0.30829623",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwqf01j",
            "score": 1,
            "text": "Did anyone think Elon was a good person to begin with ?",
            "title_similarity": "0.28192192",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwqf1zw",
            "score": 1,
            "text": "Despite grimes coming up with the name, he's still a bastard. Good piece on him that smashed my midlife crisis dream of buying a tesla. \n https://www.iheart.com/podcast/105-behind-the-bastards-29236323/episode/part-one-i-do-not-like-63419860/",
            "title_similarity": "0.76437414",
            "sentiment_compound": -0.4515
        },
        {
            "id": "gwqgsnp",
            "score": 1,
            "text": "Has anyone seen the birth certificate ? \n— I always guessed Elon was trolling everyone while simultaneously giving his child privacy.",
            "title_similarity": "0.67901754",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwqi2mx",
            "score": 1,
            "text": "His child has just inherited billions of dollars and you think people won’t be about to pronounce it? You think he’ll be bullied? I’m sorry, what “normal” world do you think this child is going to be growing up in, lol.\n\nLegit everyone will def pronounce his name right as he’s a billionaire... and he will be home schooled or probably implanted with some kind of learning microchip or some shit.\n\nPeople giving a shit about this kids name are disconnected in what world they think he’s growing up in... he could be called God and it’ll still work.",
            "title_similarity": "0.7734715",
            "sentiment_compound": -0.644
        },
        {
            "id": "gwqintb",
            "score": 1,
            "text": "Named after a planet (I think), a God, a plane, and into a billionaire family??? I think he'll be fine.",
            "title_similarity": "0.30544704",
            "sentiment_compound": 0.533
        },
        {
            "id": "gwqivvk",
            "score": 1,
            "text": "Middle name should have been “underscore” just to make online life easier",
            "title_similarity": "0.3681075",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwqix49",
            "score": 1,
            "text": "Musk said it him self can't say it say ash not that hard also what they said⬆️⬇️",
            "title_similarity": "0.5799023",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gwqj846",
            "score": 1,
            "text": "Ash Musk sounds like a fragrance",
            "title_similarity": "0.12152319",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwqjcom",
            "score": 1,
            "text": "I bet it's meant to be pronounced sexy 🙄, just like the Tesla cars are models S, 3 X and Y",
            "title_similarity": "0.3195008",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gwqjcvw",
            "score": 1,
            "text": "I enjoy that you believe the son of Grimes was exclusively named by Elon, whose children by all other women have completely normal names.\n\nIn his Joe Rogan interview he even tells listeners that his only contribution to the name is reference to the blackbirds predecessor. The rest was all her. But I guess people just want to light torches and attack Elon regardless. It really is amazing the depths to which people will stoop to try and pretend this guy is a villain. If doing everything within your power to advance EV and space flight technology makes you a villain sign me up.",
            "title_similarity": "0.746068",
            "sentiment_compound": -0.8352
        },
        {
            "id": "gwqjj9w",
            "score": 1,
            "text": "Wouldn't want the children to be exposed to any \"unnecessary troubles\"",
            "title_similarity": "0.51659155",
            "sentiment_compound": -0.5457
        },
        {
            "id": "gwqjlok",
            "score": 1,
            "text": "Cool name for a martian emperor though",
            "title_similarity": "0.28461063",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwqjtxw",
            "score": 1,
            "text": "Barbie is a real name",
            "title_similarity": "0.22144699",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqk9iw",
            "score": 1,
            "text": "I’m pretty sure it was his wife who named their child. I can recall from some video where someone asks how his son is and he said “oh, my wife named him” but still, I agree that it’s completely stupid and outrageous",
            "title_similarity": "0.77012634",
            "sentiment_compound": -0.6635
        },
        {
            "id": "gwqkje0",
            "score": 1,
            "text": "Haven’t you heard? Little X AE A-XII is going to go by Tim.",
            "title_similarity": "0.33046818",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqktyh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17006096"
        },
        {
            "id": "gwqkv77",
            "score": 1,
            "text": "Not really, jokes like that get old pretty quick, few people will actually keep mocking his name after the announcement and he probably won't meet most of them.",
            "title_similarity": "0.6229294",
            "sentiment_compound": -0.4162
        },
        {
            "id": "gwqkvzd",
            "score": 1,
            "text": "X gon give it to ya",
            "title_similarity": "0.10834186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqlb7w",
            "score": 1,
            "text": "Are black people assholes for naming their kids outrageously cartoonish names nobody wants to hire for their company?",
            "title_similarity": "0.8049918",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gwqle22",
            "score": 1,
            "text": "Naming his kid like that is just the tip of the Elon assholeberg.",
            "title_similarity": "0.6801628",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwqm7wc",
            "score": 1,
            "text": "How do you even spell that out on a scan-tron form? Oh wait, I guess he won’t have to.",
            "title_similarity": "0.4327256",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqmdz2",
            "score": 1,
            "text": "I don’t know how to say his name.",
            "title_similarity": "0.37662208",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqme40",
            "score": 1,
            "text": "Why the fuck do you care? Why is a child’s birth certificate public?",
            "title_similarity": "0.53971875",
            "sentiment_compound": -0.168
        },
        {
            "id": "gwqmihy",
            "score": 1,
            "text": "Elon Musk is an asshole ~~for naming his child  X Æ A-XII Musk~~\n\n&#x200B;\n\n&#x200B;\n\nFTFY",
            "title_similarity": "0.8074638",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqmmc2",
            "score": 1,
            "text": "[https://www.youtube.com/watch?v=ZR5XGTpophI](https://www.youtube.com/watch?v=ZR5XGTpophI)",
            "title_similarity": "0.22870228",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqmqrt",
            "score": 1,
            "text": "It has a pretty nice pronunciation. It’s like my name (for privacy reason I won’t write it here) it has 12 useless letter but it’s pronounced “Keven”. I believe his son’s name is pronounced “x ash-a12 musk” it isn’t that bad. “Hello, nice to meet you! I’m X”",
            "title_similarity": "0.64888394",
            "sentiment_compound": 0.2714
        },
        {
            "id": "gwqn58s",
            "score": 1,
            "text": "Elon and grimes have publicly lied several times just for fun. They think it’s funny seeing people freak out about them.",
            "title_similarity": "0.6844763",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gwqn6o1",
            "score": 1,
            "text": "when your broke and jealous of musk you need to get outside more and enjoy life",
            "title_similarity": "0.41697878",
            "sentiment_compound": -0.323
        },
        {
            "id": "gwqnfis",
            "score": 1,
            "text": "Holy shit people will hate Musk over anything. Get over yourself dude lol",
            "title_similarity": "0.7306335",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gwqnha5",
            "score": 1,
            "text": "You really wrote all of this for what? No one cares lol",
            "title_similarity": "0.4668367",
            "sentiment_compound": -0.2216
        },
        {
            "id": "gwqnrbs",
            "score": 1,
            "text": "It’s not like this kid is ever going to public school. He’ll be fine growing up in his mansion.",
            "title_similarity": "0.49480507",
            "sentiment_compound": 0.1002
        },
        {
            "id": "gwqnse7",
            "score": 1,
            "text": "It was not Elon musks idea to nea me his child that, it was the mother’s idea, her name is grimes",
            "title_similarity": "0.5997374",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwqo2k1",
            "score": 1,
            "text": "What concern is this really? To anyone?",
            "title_similarity": "0.30102137",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqo9z1",
            "score": 1,
            "text": "He didnt name the kid for the benefit of the kid. He named the kid so he'd get more attention on social media and that is the definition of asshole.",
            "title_similarity": "0.70434797",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwqot5t",
            "score": 1,
            "text": "I think he and his wife seem awfully insecure for billionaire overlords.",
            "title_similarity": "0.6876118",
            "sentiment_compound": -0.4754
        },
        {
            "id": "gwqoxvb",
            "score": 1,
            "text": "This isn't the worst thing that could happen to a child.",
            "title_similarity": "0.31218207",
            "sentiment_compound": 0.5096
        },
        {
            "id": "gwqplmb",
            "score": 1,
            "text": "Other people have made most relevant points, but “Barbie” is just short for “Barbra.” It’s a real name. I know more than one person who goes by it.",
            "title_similarity": "0.41267222",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqpshg",
            "score": 1,
            "text": "Well I know of someone who has teardrop tattoos and a spider web tattooed on his head.  He just had his 4th child and named him Killua Baby Gangsta.  No shit.  It’s on the birth certificate and everything.  That’s the boys middle name.  Baby Gangsta.  Yep.  Talk about a self fulfilling prophecy.",
            "title_similarity": "0.61870104",
            "sentiment_compound": 0.7371
        },
        {
            "id": "gwqpxcq",
            "score": 1,
            "text": "And who cares.  It’s not your kid.  It’s his.  Maybe that will be how everyone writes their names In the future when the aliens decide we’ve failed as a society.",
            "title_similarity": "0.7023518",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gwqpywh",
            "score": 1,
            "text": "He's an asshole regardless what he named his kid.",
            "title_similarity": "0.72802806",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqq3tg",
            "score": 1,
            "text": "How the heck does the name \"Barbie\" stack up to the other two? It's just a nickname for Barbara.",
            "title_similarity": "0.49107143",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqq51v",
            "score": 1,
            "text": "It’s a common name on his planet.",
            "title_similarity": "0.17059283",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqqcim",
            "score": 2,
            "text": "Let's decode the name, and then we'll get to 'why'.\n\n\nSo: X (chi), Æ (A-XII, Alphabetical-12, 'L', el) chi-Æ-el, Kyle\n\n\nHe (the baby) is going to be treated differently by everyone he meets because of the family he comes from. Obfuscating his name this way will give their child an better opportunity to be a normal person in his day to day life. He can introduce himself to people by saying \"hey I'm Kyle\", and most people wouldn't connect him to Elon & Grimes, as they don't understand what the name is phonetically.",
            "title_similarity": "0.6821511",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gwqqei0",
            "score": 1,
            "text": "He is Elon’s son. Will be fine.",
            "title_similarity": "0.28103185",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwqqoe7",
            "score": 1,
            "text": "He did it to hide his kid. They probably have seperate name for him",
            "title_similarity": "0.5687863",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwqr5w8",
            "score": 1,
            "text": "I feel those doing the bullying are more to blame if the kid gets bullied.",
            "title_similarity": "0.6245184",
            "sentiment_compound": -0.8928
        },
        {
            "id": "gwqs3hz",
            "score": 1,
            "text": "10/10 biggest shit post of the year ,",
            "title_similarity": "0.31419247",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwqsa7x",
            "score": 1,
            "text": "Why? He's super rich, and Grimes is famous in not as rich. The kid will be fine. Reality will realign for him and he'll have some nick name that works for him. Tend to your lane.",
            "title_similarity": "0.5519108",
            "sentiment_compound": 0.6571
        },
        {
            "id": "gwqss69",
            "score": 1,
            "text": "I don’t even know how to pronounce it",
            "title_similarity": "0.39337486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqtqot",
            "score": 1,
            "text": "Easy argument. That’s Elon Musk’s kid. All normal rules will go out the door. By the time the kid is old enough, Elon quite literally will have developed enough neural link type devices his kid will be cyborg anyway.",
            "title_similarity": "0.54685736",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gwqu2ph",
            "score": 1,
            "text": "true\n\nbut gawd, I hate babies anyway, so..",
            "title_similarity": "0.70227754",
            "sentiment_compound": -0.631
        },
        {
            "id": "gwqu51v",
            "score": 1,
            "text": "The kid's name will be X. \n\nIt's cool to have your name be X. \n\nI wish my name was X.",
            "title_similarity": "0.36064792",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwqu8vf",
            "score": 1,
            "text": "Why do you care?",
            "title_similarity": "0.19614242",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwqueic",
            "score": 1,
            "text": "You actually nailed it with the first 5 words. The kid is just collateral at this point.",
            "title_similarity": "0.3590607",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqvt7p",
            "score": 1,
            "text": "Yes, slightly weird, but, the kid's name is X. Not bad compared to your examples.",
            "title_similarity": "0.30315527",
            "sentiment_compound": 0.6621
        },
        {
            "id": "gwqx7ys",
            "score": 1,
            "text": "AE = American Eagle",
            "title_similarity": "0.13841125",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwqzvkn",
            "score": 1,
            "text": "The mom is to blame. His other kids from Justine Musk have normie names.",
            "title_similarity": "0.6954606",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwr22sl",
            "score": 1,
            "text": "The meme is that it’s pronounced Kyle. His sons name is Kyle.",
            "title_similarity": "0.37276804",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwr2ctr",
            "score": 1,
            "text": "subject to unnecessary troubles and bullying...\n\nYour father is a billionaire and one of the richest people on earth, I think you’re going to be just fine, nothing a little therapy can’t fix and I know you can afford it. gtfoh",
            "title_similarity": "0.46469694",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwr2uit",
            "score": 2,
            "text": "I'm not going to change your view but I swear it seems like the dude (elon musk) and the baby mama might be on the spectrum so that just might offer a little explanation. If their brains work different from the average person's that might explain why they thought it was an okay name.",
            "title_similarity": "0.6354456",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwr3o9q",
            "score": 1,
            "text": "What did you expect from a pedophile and a gerontofile? Elon is 20 years older than his mistress, I can‘t even call them a couple, because they look so vomit-inducing.",
            "title_similarity": "0.71042407",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwr6bxy",
            "score": 1,
            "text": "\n>would always make the kid a target of unnecessary attention (eg. bullying)\n\nThis is victim shaming. Only bullies are responsible for bullying, just like murderers are fully responsible for murders and rapists are fully responsible for rapes.",
            "title_similarity": "0.75187445",
            "sentiment_compound": -0.9663
        },
        {
            "id": "gwr6jp5",
            "score": 1,
            "text": "As far as I know X Æ A-XII isn't even a human",
            "title_similarity": "0.41620725",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwr6qi9",
            "score": 1,
            "text": "Tbh he's called Ash\n\nThat weird name is basically just his stage name\n\nSource : Musk said this on Joe Rogan's podcast",
            "title_similarity": "0.52512527",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwr74hk",
            "score": 1,
            "text": "That child is going to end up murdering him in his sleep.",
            "title_similarity": "0.5774864",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gwr8mi9",
            "score": 1,
            "text": "I agree with you! So I refuse to change your view",
            "title_similarity": "0.2161952",
            "sentiment_compound": 0.0807
        },
        {
            "id": "gwr8pkr",
            "score": 1,
            "text": "Really? *That's* the part that bothers you? Not him being a bitch to his employees and stealing the value that they produce?",
            "title_similarity": "0.6742724",
            "sentiment_compound": -0.8146
        },
        {
            "id": "gwr8s2e",
            "score": 1,
            "text": "If my dad were a billionaire like Elon, he can name me Anus Tart or whatever the fuck they like",
            "title_similarity": "0.48273093",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwr90aa",
            "score": 1,
            "text": "Well, he most probably will be called \"X\", which sounds pretty badass to me.",
            "title_similarity": "0.61213195",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gwr91qn",
            "score": 1,
            "text": "I love how he underpays his workers, pollutes the environment, but people focus on the name he gave his kid",
            "title_similarity": "0.7011862",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwr9o4r",
            "score": 2,
            "text": "Meh, a common name with an uncommon spelling irks me more, like Kevyn or Jessyca.\n\nThis is a famous kid with a famous name. By the time he is in school, everyone will know who he is, I mean, he already has a post about him in r/changemyview and he's not even a year old yet. No one will be making fun of his name, just think of his name as if it is an online alias, like u/ardula99. I don't even know what Gallowboob's real name is, so if I ever refer to him in any context, it would be as Gallowboob. And at least in the reddit universe, no one will be questioning his name choice. He's Gallowboob, no big deal.",
            "title_similarity": "0.76902163",
            "sentiment_compound": 0.3167
        },
        {
            "id": "gwra2lr",
            "score": 1,
            "text": "Wow, I never knew any of this happened, and now I regret learning about it.",
            "title_similarity": "0.6268422",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwrbdmy",
            "score": 1,
            "text": "If his middle name is the complicated part just use his first name which is X. It’s not as bad as AE A-XII",
            "title_similarity": "0.44623095",
            "sentiment_compound": 0.431
        },
        {
            "id": "gwrcw29",
            "score": 1,
            "text": "i think its a way to make it harder for people to remember/ talk about his childs name. basically makes it simple for people to keep his name out of their mouths. \n\n\ni wouldnt be surprised if that was just his legal name, and that they call him something normal behind closed doors.",
            "title_similarity": "0.67851794",
            "sentiment_compound": -0.0428
        },
        {
            "id": "gwrdnuh",
            "score": 1,
            "text": "The naming of a child is the responsibility of both parents. I think its a fallacy to single out elon musk.\n\n\nSecondly, this child is not going to be born into the same world as you, they are going to belong to the super-elite, and aren't going to be bullied over their name from within their own circle. Theyre going to live in a bubble world of the super rich, and its illogical to think the same rules apply to them.",
            "title_similarity": "0.7421745",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwrfyz8",
            "score": 1,
            "text": "This is all theater",
            "title_similarity": "0.16753909",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwrgu16",
            "score": 1,
            "text": "I have never seen a kid being bullied solely for their name throughout my childhood. People get bullied for their personality and image, I.e they’re the weird kid, the smelly kid, the poor kid, the nerdy kid, insulting their name is just a way to preform the bullying and you can turn almost any normal name into an insult by rhyming it. The kid is going to be rich as fuck, is not only Elon musk’s kid but Grime’s kid too, so will likely have an interesting and cool personality, people will want to be associated with him and hence his name will not be used as ammo for bullying, in fact he will probably hear how cool it is for most of his life. Now if he turns out to be a weirdo and it invites bullying then yes the name would not be ideal, but the majority of the time people don’t get solely bullied for their name unless it’s as bully worthy as “gaylord focker”",
            "title_similarity": "0.79615784",
            "sentiment_compound": -0.9804
        },
        {
            "id": "gwriv0j",
            "score": 1,
            "text": "Elon can call me whatever degenerating term he wants, if he gives me one of his billions.",
            "title_similarity": "0.29515418",
            "sentiment_compound": 0.0
        },
        {
            "id": "gws63h6",
            "score": 1,
            "text": "I think it is okay as the child would have the option to change his name when he grows up",
            "title_similarity": "0.27972037",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gws9bls",
            "score": 1,
            "text": "Elon musk is an asshole for more reasons than this. This is pretty dumb but not in his top 10",
            "title_similarity": "0.6839007",
            "sentiment_compound": -0.2354
        },
        {
            "id": "gwsood9",
            "score": 1,
            "text": "i don't think it changes anything on the future of the child but he is still an asshole",
            "title_similarity": "0.64686817",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwtcc9e",
            "score": 1,
            "text": ">Elon Musk is an asshole for condemning his child to unnecessary troubles\n\nDoes the fact that he will be raised in a billionaire household offset that in anyway?",
            "title_similarity": "0.81434023",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gwteq1b",
            "score": 1,
            "text": "elon musk is an asshole because he is a shill and a fraud not because he gave his son a dumbass name.",
            "title_similarity": "0.8014095",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gwtnr9i",
            "score": 1,
            "text": "Grimes calls him \"little x\" so I'll go with that.\n\nSpeaking of x RIP DMX",
            "title_similarity": "0.47950616",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwtw3s4",
            "score": 1,
            "text": "parents fuck up trying to be too unique. i don’t think a name like “saint” or “north” is a cute name because what personification do those names have? i also don’t like names like “journey” it’s crZy, but a cute name Azara or something would suffice, then again, i can’t tell anyone what to name their kids 🙃",
            "title_similarity": "0.83083344",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gwvrvmj",
            "score": 1,
            "text": "So his name is pronounced H AY A 12 or KS AYA KS eeeeeeee?",
            "title_similarity": "0.23454672",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwvyrnb",
            "score": 1,
            "text": "His contribution was the A-XII bit",
            "title_similarity": "0.16315342",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx0n9ig",
            "score": 1,
            "text": "A name defines ones identity. Later in life, if he wants to change it, it is up to him. Unfortunately, he will probably choose a nick name like many others.",
            "title_similarity": "0.51832354",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gxddm4c",
            "score": 1,
            "text": "he'll probably change his name to ash as soon as possible since I think the name is just pronounced \"Ash\"",
            "title_similarity": "0.4188279",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxdl39e",
            "score": 1,
            "text": "elon is an asshole for endless reasons.",
            "title_similarity": "0.58850026",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxi6uu3",
            "score": 1,
            "text": "Just a thing rich and unique people do. No different then moon unit, blanket, Jermajesty, Sigríðurjóna, names weirdly attempting to combine the mothers and fathers name, having multiple commas, including the name exaviar etc etc. my mom couldn’t pronounce her name for years and changed it later. I feel like people are just hating on elon and forgetting lower millionaire celebrities suck too.",
            "title_similarity": "0.7618437",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gy0u6ta",
            "score": 1,
            "text": "You’re right. He should have gone with Bob. Bob Musk.",
            "title_similarity": "0.3732838",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzcqbjh",
            "score": 1,
            "text": "https://youtu.be/UrqyrNIBS3M\nLo siento my opinion",
            "title_similarity": "0.1263996",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzcqdof",
            "score": 1,
            "text": "https://youtu.be/UrqyrNIBS3M\nMy opinión is that the baby going to has a los if problems",
            "title_similarity": "0.4303671",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h02s1rw",
            "score": 1,
            "text": "You're right. What a couple of arseholes. I can see the kid picking a more conventional name, then divorcing the parents for being such arseholes.",
            "title_similarity": "0.69296473",
            "sentiment_compound": 0.0
        },
        {
            "id": "h416s7s",
            "score": 1,
            "text": "There's actually a deeper/ darker meaning to his child's name... It's connected to the back of the dollar bill....",
            "title_similarity": "0.4390511",
            "sentiment_compound": 0.0
        }
    ]
}