{
    "CMV: it's a good thing that birth rates are declining\nDeclining birth rates have been in the news lately, and most of the reporting I've read has centered around the resulting demographic shift causing economic difficulties. While I'm sure there will be economic difficulties to overcome, I think it's necessary to do so, and now is a better time than later.\n\nAn economy that requires a continuously increasing population is not sustainable indefinitely. Eventually, we'll have enough people that we need more of some resource we don't have a good way to get more of and be forced into the sorts of decisions that form the basis of [dystopian sci-fi](https://en.wikipedia.org/wiki/Category:Overpopulation_fiction). That people are voluntarily having fewer children solves the problem before it becomes a crisis.\n\nFewer people means that each person can have a larger share of limited resources. Each person's labor becomes more valuable due to reduced competition, which is well-timed as automation reduces the demand for low-skill, low-pay labor. Of course owners of businesses that currently profit from inexpensive labor might not be thrilled about it, but as long as the world still has people living in extreme poverty, I suspect there are ways to fill any remaining demand for cheap labor.\n\n# Deltas:\n\n* Sperm counts have been dropping continually in western men for decades, so reduced births aren't necessarily voluntary. While there are some solid suspects, we don't know why for certain, and that's scary.\n* Too much of a good thing is possible, and Japan may have it with an exceptionally low birth rate *and* a low immigration rate leading to no viable way to support its elderly.\n* There is an education bottleneck for nursing in the US, resulting in a shortage that will only get worse as the population ages unless solved.": [
        {
            "id": "gx0zxk8",
            "score": 1,
            "text": "/u/Zak (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/n5gpco/deltas_awarded_in_cmv_its_a_good_thing_that_birth/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.42359632",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gx181qf",
            "score": -2,
            "text": "I could begin to look at this opinion only after immigration is reduced to zero.",
            "title_similarity": "0.43492076",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx0xux0",
            "score": 329,
            "text": ">fewer people means that each person can have a larger share of limited resources\n\nNo. People *make* resources consumable. Fewer people = fewer resources.\n\nFor example, did everyone on earth 100 years ago have more water (quantity or availability), or more gold, or more natural gas, oil, or any other resource? No, they had less.",
            "title_similarity": "0.60500264",
            "sentiment_compound": 0.4754
        },
        {
            "id": "gx1015l",
            "score": -3,
            "text": "I mean, I'd be okay with it if I didn't have you know who trying to force immigration down my throat as to the \"solution\" to a problem that doesn't exist.\n\nCase in point Fando1234.",
            "title_similarity": "0.5452572",
            "sentiment_compound": 0.128
        },
        {
            "id": "gx1fvi8",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx1mrkt",
            "score": 2,
            "text": ">While I'm sure there will be economic difficulties to overcome, I think  it's necessary to do so, and now is a better time than later.\n\nI'm guessing, as is always the case with this kind of argument, that you won't be volunteering yourself to try and overcome said difficulties? You sound like Ebenezer Scrooge. And why, exactly, is now better than later?\n\n&#x200B;\n\n>An economy that requires a continuously increasing population is not sustainable indefinitely.\n\nAre we there now? I don't think so. Nowhere near in fact. There is plenty to go around, just now at least. Is the distribution unfair? You're good goddamn right it is.\n\n&#x200B;\n\n>Each person's labor becomes more valuable due to reduced competition\n\nAs long as capitalism exists, this will never happen. See all those homeless people? They are there for a reason, so you don't ask for better. Even if you reduce the population significantly, they will still exist. The system needs changed, not the number of people.\n\nHaving written all that, I'm not convinced you're not a troll.\n\nEDIT formatting.",
            "title_similarity": "0.847523",
            "sentiment_compound": -0.3283
        },
        {
            "id": "gx10rr0",
            "score": 28,
            "text": "Well, _right now_ it's good that birth rates are declining, because we are facing issues like overpopulation and eventually we won't have enough resources for everyone, as you said.\n\nBut you have to question _what is the reason_ this is happening.\n\nI believe birth rates declining is a good thing as long as they climb back up to replacement level (IIRC ~2 childern per woman) once the population is brought down to a decent, sustainable size. If this doesn't happen, well, who's to say the population won't just keep shrinking until humanity goes extinct?\n\nAre the people who choose to have only one or no children doing so because they are good Samaritans who don't want to put strain on society? Or is it personal reasons? What if the reason is simply the fact that raising kids is deemed too much of a hassle, as you often hear people say these days? What if it is because in our modern world, it really is difficult, perhaps financially more than anything, to raise more than one child? What if it's because people are having children way later in life than they did for most of history? What if it's actual biological infertility? It too is on the rise, male sperm counts are half of what they used to be 5 decades ago in the West (and they are still going down). \n\nWill any of these issues be automatically solved once the population has dropped down? If yes, then that's good thing. If not, then this population decline IS something to worry about and try to rectify, as these problems will eventually threaten our existence as a species.",
            "title_similarity": "0.8740387",
            "sentiment_compound": 0.4288
        },
        {
            "id": "gx19jek",
            "score": -1,
            "text": "Okay, Thanos…",
            "title_similarity": "-0.044740714",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gx1a9rt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx1c81k",
            "score": -1,
            "text": "Another way to look at this ‘crisis’ is that so much of the worlds resources are hoarded by so few. It’s not that it’s scarce, it’s that a select few have adequate access whilst so many don’t. Of course, an increasing population in this current system will lead to conflict over resources but we should really be looking at a fair distribution model. You’d be surprised at how much there is to go around.",
            "title_similarity": "0.80531025",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gx0ys5m",
            "score": 169,
            "text": "So, I generally agree with you that a declining birthrate is a good thing, and that most of the issues brought up about it generally fall into two buckets: \n\nEconomic: [How do we care for all these old people?](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4545628/)\n\nDemographic: [Won't someone think of the white people!?](https://en.wikipedia.org/wiki/Great_Replacement)\n\nThe economic arguments can be addressed by reallocating our resources or reevaluating how we treat the elderly in our societies, so we don't really have to encourage more babies to get these issues fixed. It is just that \"more babies\" is the option that doesn't require massive reorganization of our society to value and care for the elderly (speaking from a US perspective) so it gets pushed more. \n\nThe demographic arguments are just stupid. So there are more brown people than white people. I personally don't give a shit, we are all just people. Boo-Hoo we aren't a racial supermajority any more.\n\nBut, all this is operating with the general assumption that people are having less children now due to choice, or economic realities, or improving infant mortality rates, or better medical care, or whatever. Basically, they just don't want to have as many kids as they used to. \n\nWhat if it isn't that, but it is that people *can't* have as many kids as they used to. And maybe, the number of people who can't have kids, even when they want to, is growing. [This seems to be the case](https://www.theguardian.com/science/2017/jul/29/infertility-crisis-sperm-counts-halved), and as of yet, we do not know why. \"According to scientists at the Hebrew University of Jerusalem, sperm counts among men in the west have more than halved in the past 40 years and are currently falling by an average of 1.4% a year\"\n\nThis was brought to my attention during a similar conversation here, and while I do not think it is anything to get alarmed about yet, it introduces a variable that hasn't been brought up much.\n\nLess people is probably good, as long as we are choosing to have less people. If we are consistently having less people as a result of some outside factor that we have not identified, that could conceivable be a problem in the future.",
            "title_similarity": "0.81466454",
            "sentiment_compound": 0.9544
        },
        {
            "id": "gx14ovi",
            "score": 9,
            "text": "You cant look the entire world as one same place. There are places that need more people and other places that are overpopulated.",
            "title_similarity": "0.5811807",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx1e8qz",
            "score": 5,
            "text": ">An economy that requires a continuously increasing population is not sustainable indefinitely. Eventually, we'll have enough people that we need more of some resource we don't have a good way to get more of and be forced into the sorts of decisions that form the basis of dystopian sci-fi. That people are voluntarily having fewer children solves the problem before it becomes a crisis.\n\nIt's not sustainable indefinitely, but there's absolutely no evidence that it will stop being sustainable in the near or distant future. Given the chance, each living person is capable of producing more than enough resources for their own survival in the modern day. This means that any population increase increases the amount or resources beyond what they consume. The idea that we would suddenly run out of possible resources goes back to 18th century, but Malthusian economics has been proven wrong because it does not take technological advancement into account. Not only does our technology, which has grown exponentially and not linearly, drastically increase the amount of people we can sustain, but more people leads to faster scientific discovery. If one person out of a billion will double the amount of resources everyone else can produce, then it's economically worth it to have an additional billion people. Declining population growth means fewer resources and fewer people to advance our technological knowledge.\n\n>Fewer people means that each person can have a larger share of limited resources. Each person's labor becomes more valuable due to reduced competition, which is well-timed as automation reduces the demand for low-skill, low-pay labor. Of course owners of businesses that currently profit from inexpensive labor might not be thrilled about it, but as long as the world still has people living in extreme poverty, I suspect there are ways to fill any remaining demand for cheap labor.\n\nIf the resources were limited in any practical sense this would be true, but as of yet there's no evidence that we are anywhere near the limit. If there are fewer people, then there is also a smaller demand for labor. As it stands, you're actually right that population increases drive down the cost of labor, but that's only because developing rather than developed nations are experiencing population increases. The lower value of labor is actually caused by the low birth rates of first world countries. \n\nEssentially, all historical information points to the fact that the more people we have the more exponentially our resources output and scientific knowledge increases. There's no solid evidence to justify the idea that we will run out of resources or that scientific advancement will stagnate anytime soon. Until there is such evidence, there's no reason to resort to dystopian thinking, especially because that thinking actually slows down the drastic decrease in poverty, disease, and general unpleasantness caused by population that we've all been lucky enough to experience over the last couple centuries.",
            "title_similarity": "0.80528146",
            "sentiment_compound": -0.9447
        },
        {
            "id": "gx0x13f",
            "score": -5,
            "text": "People aren’t worried about the declining birth rate effecting the economy. The concern, especially around more right-wing circles, tends to be about the low birth rate leading to more immigration",
            "title_similarity": "0.746515",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gx145af",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx1px0x",
            "score": 2,
            "text": "Too bad they're declining in rich countries, while in the Third World (is it still ok to call it that?) they're still  breeding like rabbits, which, neddless to say, is a huge issue in places where life isn't particularly easy. Or long. Or comfortable.\n\nI feel the enthusiasm about anti-natalism is a very skewed perception of a reality that is far too complex to be reduced to \"fewer births = good\".\n\nHaving fewer Americans or Europeans won't benefit much the whole environment/sustainable life argument if African countries have a 100% growth in the short span of only a couple of years.",
            "title_similarity": "0.8043079",
            "sentiment_compound": 0.8806
        },
        {
            "id": "gx11rew",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.12978615"
        },
        {
            "id": "gx1mved",
            "score": 0,
            "text": "You're ignoring that humans produce surplus value and that innovation is a factor of population growth.\n\nAs the population grows, there are more brains, more brains mean more ideas, more ideas mean more solutions, and more solutions mean less scarcity. Overpopulation is a pseudoscience meme.",
            "title_similarity": "0.7246659",
            "sentiment_compound": 0.6894
        },
        {
            "id": "gx1xrmn",
            "score": 0,
            "text": "There is this weird thing where people freak out about 1st world countries (like USA and Japan) having low birth rates, but cheat on African countries (rightfully so) as a massive improvement if birth rates decline. \n\nI think it’s because in USA social security will collapse with a shrinking labor pool to put taxes and ever increasing number or retirees. On those poor countries the low birth rate is actually a byproduct of low infant mortality. They also have small economies so population explosions are untenable. \n\nIn my humble opinion: We could move so many people out of poverty with low birthdates + sane immigration policies. Unfortunately the 2nd part of the equation will probably never happen.\n\nEdit: just realized that I agree with you. The counter argument is normally about paying for the social safety net.",
            "title_similarity": "0.8492483",
            "sentiment_compound": -0.9577
        },
        {
            "id": "gx20b0w",
            "score": 0,
            "text": "Most smart people say it’s population collapse we should be worried about. (Elon musk for example) idk myself tho",
            "title_similarity": "0.70072365",
            "sentiment_compound": -0.4228
        },
        {
            "id": "gx241z6",
            "score": 0,
            "text": "Counterpoint: as birth rates decline, the United States will be taken over by homeschooled Quiverfull children who weren't taught science or history, thus leading to first, the loss of all the industrial, scientific, and medical gains we've made in the last 100 years, then second, a nuclear catastrophe that wipes out humanity.",
            "title_similarity": "0.6560408",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gx254jp",
            "score": 0,
            "text": "Overpopulation is a myth",
            "title_similarity": "0.43989837",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx264hf",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.12978615"
        },
        {
            "id": "gx2eo4k",
            "score": 0,
            "text": "Despite millenia of doomsayers, the (inflation adjusted) economic growth per capita has historically *increased* as as population grows. Economic growth comes from division of labor, the division of labour is limited by the extent of the market and the size of the workforce, and the workforce and market are limited by the population. \n\nInnovations are another factor, and more innovators mean more innovation. Though the most important part of an innovation is \"is it economically viable?\" And the economic viability of an innovation depends, again, on the scale of the market.  If you want to be a baker making 20 loaves per day for $5/loaf in a town of 100, that's probably viable. But if you happened to build a bread factory that produces 100,000 loaves per day at $1/loaf, that business cannot survive because there aren't enough mouths to eat that much bread. Sliced bread has been known for thousands of years, but not economically viable as a business until the 1920s, because that's when enough people had the money for it and division of labor expanded to make that niche product profitable. \n\nSimilarly, with the idea of \"limited resources\", there was no oil industry in 1850 because there weren't enough buyers or infrastructure to make free oil economically useful. Resources are developed invented with scale of the market. There's plenty of potential resources that are not economically viable today that would become economically viable when the population and market increases. Solar panels just recently became economically viable because of expanding markets. Resources like methane clathrate mining still have yet to become viable. \"Resources\" is not a fixed set of things, but rather an evolving set that grows larger as the market makes more possibilities viable.",
            "title_similarity": "0.79747355",
            "sentiment_compound": 0.9605
        },
        {
            "id": "gx2k217",
            "score": 0,
            "text": "Well it seems like birth rates may be declining because more eco-conscious people are deciding that it's best to not have kids. People who care about the environment are overwhelmingly liberal, and conservative people are still having kids at an alarming rate (ew). \n\nSo if we really think about it, it's not great that birth rates are declining. There will be less liberal children and we all know that right leaning people will spout their garbage ideals and beliefs onto their offspring, leading to a worse world where eventually the right will outweigh the left.",
            "title_similarity": "0.810109",
            "sentiment_compound": 0.6604
        },
        {
            "id": "gx2kadm",
            "score": 0,
            "text": "Malthus?",
            "title_similarity": "0.1401759",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx2xev2",
            "score": 0,
            "text": "I think you make some good points, but the rate of decline is obviously really important. If it’s a very abrupt decline the economy can’t absorb the decrease in labor supply because it’s just too quick.",
            "title_similarity": "0.8480072",
            "sentiment_compound": 0.5558
        },
        {
            "id": "gx30sc7",
            "score": 0,
            "text": "I cannot. Less stupid people in the world is a net gain in my book. As long as we forget about the lack of labor pool in the future for growth we are good. Throw the possibility of going extinct in the future from \"progressivism\" and such.",
            "title_similarity": "0.7031229",
            "sentiment_compound": 0.8052
        },
        {
            "id": "gx0zirk",
            "score": 15,
            "text": "> An economy that requires a continuously increasing population is not sustainable indefinitely. Eventually, we'll have enough people that we need more of some resource we don't have a good way to get more of and be forced into the sorts of decisions that form the basis of [dystopian sci-fi](https://en.wikipedia.org/wiki/Category:Overpopulation_fiction). That people are voluntarily having fewer children solves the problem before it becomes a crisis. \n\nThe problem is not with our population - it's with the rate of consumption. The emissions of carbon dioxide and other greenhouse gases give us a good indication of how high consumption is in a city. There are several high income cities which have extremely high carbon footprints ( Hong Kong, Singapore, Chicago, New York, and Los Angeles ), while others ( Cairo, Jakarta, and Tokyo ) had lower carbon footprints despite having a high population. Therefore, the population could keep decreasing while the pressure on resources continues to increase, partially due to greed and because we tend to use everything we have, irrespective of the population\n\nThe disadvantages that arise from low population growth such a lower workers, lower consumers, increased need for automation etc. can all be avoided by continuing at the current rate of population growth while advocating for sustainable consumption in developed and developing countries.",
            "title_similarity": "0.85995704",
            "sentiment_compound": -0.9517
        },
        {
            "id": "gx10ojf",
            "score": 102,
            "text": "[deleted]",
            "title_similarity": "0.12978616"
        },
        {
            "id": "gx153ip",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.10183136"
        },
        {
            "id": "gx1b1xc",
            "score": -1,
            "text": "Why do you think there is a finite number of resources?  The world can easily sustain far more people today than it could in the 1600s.",
            "title_similarity": "0.59306383",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gx1ftlt",
            "score": 1,
            "text": "https://youtu.be/VIANLddo-ec\n\nWatch you get a different perspective",
            "title_similarity": "0.20988837",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx1i23k",
            "score": -1,
            "text": "I disagree from a United States perspective. Birth rates should be increasing and the United States should hope to have a billion people. The only reason China is a threat is because of its people. If China had the same amount of citizens as the US it would just be another Asian country with fancy cities. But because it has 3-4x the population of America it is a gold mine for companies and has a never ending work force, and an endless supply of soldiers.\n\nIf the United States had a population of 1 billion people it would give us the population density of countries like France, Germany, and the UK who are by no means over crowded and all of lovely country sides.",
            "title_similarity": "0.7274818",
            "sentiment_compound": 0.9231
        },
        {
            "id": "gx1n49z",
            "score": 1,
            "text": "Well like others before you like Paul R. Erlich (wrote the Population bomb, predicted world wide famine in the 1970s/80s), you think there aren’t enough recourses, but you are wrong, mostly. Overpopulation is not a world wide problem, because resources aren’t shared word wide, overpopulation is true in some places (mostly underdeveloped places that can’t care for people). But in Western developed countries, overpopulation is not happening (under population is maybe a bigger problem). \n\nYou and Mr. Erlich are missing one very important factor, the development of technology that can and has been able to produce more food. In 1973 GMOs were invented and that has greatly been able to feed more people. \n\nAnd now, and in the future, vertical farming seems to be a promising technology that would be able to massively increase food production, which could be between 10x and 20x better than current farming.",
            "title_similarity": "0.7923893",
            "sentiment_compound": 0.8998
        },
        {
            "id": "gx1poid",
            "score": 1,
            "text": "Your argument is not what the govt or big pharma wants to hear. You’re ideals are cutting into their profits.",
            "title_similarity": "0.65831625",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gx1q5tf",
            "score": 1,
            "text": ">Fewer people means that each person can have a larger share of limited resources. Each person's labor becomes more valuable due to reduced competition, which is well-timed as automation reduces the demand for low-skill, low-pay labor. \n\nYour argument falls when you see that the number of people living in poverty has decreased as the population increased.\n\nLess people does not mean better shared resources.\n\nIt means less people to go get the resources, less companies with money to explore this resources, and overall less resources.\n\nIt's not a solution and we do not live in an overpopulated planet. That myth has beem busted a long time ago.\n\nPeople should be having kids. And that's a problem for yesterday.",
            "title_similarity": "0.8167038",
            "sentiment_compound": -0.808
        },
        {
            "id": "gx25q6t",
            "score": 1,
            "text": "ITT: Declining birth rate bad for economy and boomer pensions. Excellent for the planet and our species.",
            "title_similarity": "0.8055352",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gx2tixt",
            "score": 1,
            "text": "> Each person's labor becomes more valuable due to reduced competition, which is well-timed as automation reduces the demand for low-skill, low-pay labor. \n\nThat's not how it works. Your labor increases in value as you become more productive, and productivity increases with specialization. Competition increases specialization. Competition gives options. You WANT competition. \n\nIf you have an engine issue with a classic muscle car, would you rather go to a \"we fix anything that moves\" mechanic or a \"we specialize in classic muscle car engines\" mechanic? The first mechanic is the type to say \"Your problem is the car is old\" and the second is the type to say \"I heard that misfiring Impala cylinder before you parked it, buddy\". Which service would you value more? If there's only one mechanic in town, you have the first mechanic, and maybe the 100th shop creates the niche of the second mechanic. \n\n\"Cheap labor\" is not a problem of too much competition, but rather too little.  No one says \"I will fight to the death for this minimum wage job!\" People take minimum wage jobs out of desperation, and will gladly take any alternative that pays more and will accept them. You frequently see job markets (including the US right now) where higher paying jobs sit empty while people who could do those jobs are in too much need for income to leave their objectively worse job to free up the time to search, apply and interview. That's not because people are so desirous of the low wage jobs, but rather the higher paying jobs have more difficulty differentiating good candidates from poor candidates because those jobs people do compete over (and thus, workers have difficulty determining who will hire them for more money and who will waste their time). With low wage jobs, the risks are low to the employer and the standards are low and the competition for the job is low, so the employee can be reasonably sure they'll get something at least with minimal effort, while the employer will often complain about people being \"too lazy\" to take their shit job offer.",
            "title_similarity": "0.74020934",
            "sentiment_compound": -0.9886
        },
        {
            "id": "gx14zc9",
            "score": 14,
            "text": "Baby boomers set a bad precedent. We won’t ever have that again IMO. so declining is relative, it will go back up again but hopefully stabilize. countries like the US and Japan and others are dealing with disproportionately large  older populations affecting a smorgasbord of resources (health care, social security, pensions, working longer, housing, etc)",
            "title_similarity": "0.8704133",
            "sentiment_compound": 0.9178
        },
        {
            "id": "gx1vcvi",
            "score": 5,
            "text": "I 100% agree with you that birth rates declining is a good thing. I think humans are the worst thing for our planet. Don't get me wrong, there are many amazing people, but there is a desire in people to want more and more (whether that be an extra sugar rush, an extra few beers, or more money). \n\nI think many people are happy to ignore the damage of what they choose to do as long as it benefits them. Pollution, global warming, the fishing, meat, and dairy industries - largely driven by people wanting to maximise their profits at the expense of the planet or causing suffering to non-human inhabitants of the planet. \n\nI personally think what is the point of chasing money to this extent? I can't imagine spending it all and then what... you leave it to your children? This only goes on and your future generations can only enjoy the money if there is a planet to spend it on. \n\nOne example that jumps out to me is Dupont, the chemical company subject to the 2019 film Dark Waters. They knowingly poisoned drinking water for financial reasons which resulted in causing cancer and other health issues in many people and wildlife.\n\nI'm sure you can see examples of human greed wherever you look and I think it would be good if the human population were to significantly reduce for the sake of our planet.",
            "title_similarity": "0.7824302",
            "sentiment_compound": 0.7216
        },
        {
            "id": "gx1ctbs",
            "score": 4,
            "text": "It's a good news for overpopulated places like India and China, but not good news for places like Japan where most of the population is aging and not many people don't have kids.",
            "title_similarity": "0.7481917",
            "sentiment_compound": 0.4293
        },
        {
            "id": "gx1cspo",
            "score": 14,
            "text": "I have been and will always be of the belief that human capital is the most valuable form of capital towards human progress and all other human endeavors. \n\nYes, the current allocation of physical resources and the use of those resources as it currently stands is societally unjust, systemically inefficient, and destructive towards the environment. \n\nHowever, the fewer people that are born today means that there are fewer people putting their minds towards solving those problems tomorrow. \n\nThere are many futurists that believe that with better city planning, resource allocation, and better designs of skyscrapers and vertical farms that earth could easily house a population of 1 trillion humans, each with very spacious accommodations, and still leave over half of the land in the world untouched or for the purposes of wild land reclamation projects. \n\nIMO, the dystopian visions of an overcrowded future are either not very imaginative, or is more of a condemnation of capitalism and unfair distribution of resources than it is of purely overpopulation. \n\nI encourage you to check out Isaac Arthur’s YouTube channel and his Earth 2.0 series where he talks about the sheer enormity of how high the population could theoretically go before we start running into serious limits. (IIRC it’s something into the quadrillions)\n\nhttps://youtube.com/playlist?list=PLIIOUpOge0Lv9Y_4Vmcgaxue0jyZG3_4K\n\nIdk, don’t despair. And maybe with more minds, we can get out of this mess quicker.",
            "title_similarity": "0.752758",
            "sentiment_compound": -0.0726
        },
        {
            "id": "gx12ls1",
            "score": 40,
            "text": "> Fewer people means that each person can have a larger share of limited resources.  \n\nwhile i am inclined to agree with your general assessment, this assertion made repeatedly by many people has been disproven as many times as it has been asserted. \n\ningenuity not only makes more of the rare resources available it also creates competitive alternatives that frequently outperform existing resources. for example, it had been asserted by all the foremost experts that the world's oil supply was peaked and that we would have little to no oil by 2050 (even 2020 by some historical estimates), it turned out that with innovations in fracking and electrical vehicles that the oil supply became a non-issue. the misestimate happened with the food supply and farming. it seems the more people we have the more innovation that occurs.\n\nanother oversight is that the earth's population of humans cannot physically exceed that which the earth can support. if there is not enough water then it becomes too expensive to have more children, if there is not enough food then people cannot produce children. the limit on resources will determine the population size. government is not required to intervene.\n\nit does however alarm me that certain resources that are essential to quality of life and the integrity of our ecosystems will not handle our demand. specifically, i am worried about the ecosystems in our oceans and large rivers. these commons areas have extreme pressure toward abuse and no single government seems to be strong enough to protect them, I have doubts that all governments acting together would be sufficient to protect the oceans and rivers from irreversible abuse.",
            "title_similarity": "0.80800354",
            "sentiment_compound": 0.2227
        },
        {
            "id": "gx1dam7",
            "score": 5,
            "text": "I guess it depends on what you consider \"good\". \n\nCombined with increasing automation, this problem is essentially going to make something like Communism absolutely necessary, because there will be too high a burden of people unable or un-needed to work that society will essentially have to take over production of goods and services. \n\nEventually there won't be enough people that need to work to be paid enough to support all the people that can't to support an economy structured like we have now. \n\nAnd if we let that be completely controlled by the people that own capital, we will end up quickly in a dystopia that you can't even imagine..\n\nSo... maybe you think the Communism is a good thing, and if an aging population forces that along, all the better.\n\nBut the problem is the people that have to implement it. So far, every time it's been tried it's ended up in mass democide.",
            "title_similarity": "0.8190527",
            "sentiment_compound": 0.0022
        },
        {
            "id": "gx1bivp",
            "score": 18,
            "text": "I think you may be thinking too specific here. Yeah, birth rate is declining, which may seem good on the surface until you look into WHY. Generally the theory is that people are less independent (financially), have higher rates of depression, and general uncertainty about the future. The birth rate is not declining in order to save the planet, it is declining because of the decay of the societal norms. \n\nIf this were a plan - and people were having less kids to \"do their part\" I would agree with you, but this is (in my eyes) a symptom of a greater disease. Since this is not a controlled fall - I think it should be viewed with caution, or as a bad thing. If we were to extrapolate, a declining birth rate can't be good if taken to the extreme (lets say 1 birth per couple, halving the population by generation). \n\nA bad analogy would be looking at a little global warming as a GOOD thing after a decade of below average cold temperatures. Maybe it would be a good thing at the moment, but it is indicative of a greater problem.",
            "title_similarity": "0.8451812",
            "sentiment_compound": 0.0317
        },
        {
            "id": "gx0ydd2",
            "score": 161,
            "text": ">Each person's labor becomes more valuable due to reduced competition \n\nThis is not how economics work. Less people means that yes, the supply of labor is lower, but it also means that the demand for labor is lower, because there are less people that need good and services. The point about the same amount of natural resources being used for less people is fair, but the value of each persons labor should not really be impacted by a mere reduction in population.",
            "title_similarity": "0.7271714",
            "sentiment_compound": 0.8922
        },
        {
            "id": "gx0th1x",
            "score": 1430,
            "text": "Depends where you look. on a macro/resource level you have a point.\n\nBut if you look at countries like Japan their issue is they have such an old population, and there isn't enough young people to do all the necessary jobs to look after the elderly.\n\nA lot of western countries are facing similar impending crisis. Mainly around how populations are aging and there isn't enough money in pension pots to support them.\n\nWhilst it may seem good the population as a whole is decreasing. The birth rate decreasing comes with a major problem... Not enough young people to look after the old.",
            "title_similarity": "0.8075389",
            "sentiment_compound": 0.0027
        },
        {
            "id": "gx1gq92",
            "score": 39,
            "text": "Declining populations isn't necessarily a negative, but how it shifts demographics is a massive problem all developed countries are/will be facing.\n\nIn human geography, there's something called the Demographic Transition Model (DTM) and it outlines the 5 phases of development and how they affect birth and death rates, as well as total population. It works pretty well as a model but isn't too in depth. The 5th stage is relatively new and is when the previously stable b/d rates change as the birth rate drops. This shifts the population to be more elderly over 10-30 years. [DTM](https://populationeducation.org/what-demographic-transition-model/)\n\nSomeone below claims that demographic arguments aren't relevant, however, the issue isn't with race, but **age** demographics. From a total population, your broad inputs are from people aged 18 to \\~65(depending on age of retirement). Anyone who isn't paying taxes is taking away from the net total. The more retired people you have proportionally to your total population, the more is being taken out. This is known as the dependency ratio. Many developed countries had large population booms as they went through stage 3 and into stage 4. Average life expectancy has gone up by 10-20 years in many of these countries since they were born.\n\nA very good example of this is Japan. It's [Population Pyramid](https://www.populationpyramid.net/japan/2020/) shows very clearly the change to their age demographics. Over the next 50 years they are predicted to lose nearly 30 million people. **30 million.** 126 to 98 million. That's a massive economic hole to fill and babies are barely being born. The replacement rate is 2.1 babies per woman, Japan is at 1.42. Here's some stats. There's a large town north of Tokyo that has a population of about 30,000 that shut down its Maternity Ward bc there were 3 babies born a year. More nappies are sold to the elderly than babies. There are separate prisons for over 65s with handrails, carers and everything. The result of this is that the amount of money needed to fund all this will be 5 times larger than the entire Japanese economy. That's insane. Before any other spending they will already be only accounting for 20% of welfare costs.\n\nChina is expected to be even worse in the future. They enacted the One Child Policy to try to lower the drain on resources in 1979. They stopped an estimated 400 million people being born. While it has successfully stopped uncontrollable growth as they moved from stage 2-4 of the DTM, it has created a larger future problem. As the 100s of millions of workers born in the 50s, 60s and 70s age, they will have unsustainability worse than Japan. It has also resulted in a skew of 60 million more boys than girls being born bc parents wanted the traditional \\`man\\` to carry on the family name yadayadayada. This has led to a very large kidnapping industry of girls from neighbouring country's rural borders to be sold as brides. [It's horrific](https://www.bbc.co.uk/news/in-pictures-42619927)\n\nOther countries like the UK and US have birth rates of 1.68 and 1.73 respectively, below the sustainable replacement rate of 2.1. But because of large waves of migration , the final birth rate is brought up to 2.23 ( this is somewhat disputed but no lower than 2.1).\n\nItaly and Germany are facing similar problems of a lesser scale - think migrant crisis of 2016, Germany let in 1 million migrants to fill their population hole since economic migrants are typically quite young. France gives 5% tax breaks per child up to 3 children.\n\nMost if not all developed countries view declining birth rates as one of the most serious problems, up there with climate change - and the 2 are linked.\n\nLow BR = aging population = unbalanced dependency ratio = massive economic debt to pay for welfare.",
            "title_similarity": "0.84782386",
            "sentiment_compound": -0.9803
        },
        {
            "id": "gx14oji",
            "score": 5,
            "text": "Even with the availability resources point, there is a caveat. A decline of population doesn't necessarily mean a reduction of the use of resources. Developed societies are often characterized by mass consumption of energy, mainly in the U.S.A. For example, a child born in the U.S.A will on average consume 200 times the energy for a child in from Bangladesh in it's lifetime. And, that doesn't really account for fossil fuels and other energy sources, which will obviously still be strained as newer technologies inevitably surface in the future. The most conservative method (in my opinion) to save resources is sustainability and the education and establishment of practices to help the impoverished and industrial nations of the world decrease their environmental footprint. And if developed nations split resources and helped develop poor countries genuinely, and sustainability this could also slow the consumption. (although this is a very far-fetched task the dependent nature of the world economy wouldn't really support)\n\ntl;dr I don't think the use of resources has to do with the declining birthrate as much as you are saying it does.",
            "title_similarity": "0.7935724",
            "sentiment_compound": 0.4451
        },
        {
            "id": "gx16v06",
            "score": 3,
            "text": "It’s important to consider the reasons for declining birth rates in addition to the sex ratio at birth for societies in which the birth rate is declining. A decline in the birth rate due to a skewed sex ratio of 150 - 100 male to female births will most definitely lead to problems for society. I think that there is a certainly a middle ground and it is situational based on the cause of declining birth rates",
            "title_similarity": "0.8242868",
            "sentiment_compound": 0.5413
        },
        {
            "id": "gx1b6ab",
            "score": 26,
            "text": "Birth rates among rich, educated families are declining the most. This will enable wealth inequality to persist and grow.\n\nMeanwhile, birth rates in poorer segments of society aren't declining nearly as much. So, educational and other life improving opportunities will not be as available to those in lower socio economic classes.\n\nAdding to those two points, fewer well paying careers will be available in the future, as automation and outsourcing accelerates.\n\nThere could be a tipping point where society is reformed to account for these macro factors, but until then, there will be much suffering for the lower 3/4 of society.",
            "title_similarity": "0.8956913",
            "sentiment_compound": -0.3919
        },
        {
            "id": "gx1bmsu",
            "score": 10,
            "text": "Lots of interesting thoughts here already, but I just wanted to throw another idea into the mix - social security or pensions. A poster below alluded to the fact that a declining population puts a burden on the working age population, to which you responded with a clarification question about whether it is the economic or output burden that matters. While the distinction is important, I would argue it is mostly a factor of a dropping economic output ratio - how many people are taking up resources on pensions and social security vs how many people are currently paying into pensions and social security. \n\n&#x200B;\n\nIt doesn't have to be this way, but the way such systems typically work in OECD countries relies fundamentally on a continuous stream of people to pay into the system. You don't pay ahead of time for your future spending - if you are paying into the system, you are paying to cover current old peoples' care expenses. This becomes a problem if the ratio between the number of people in care and the number of people paying taxes shifts too far from where the system was planned. Granted, this is not an absolute barrier, but practically speaking our governments need to fund themselves so this is a huge practical economic concern. Perhaps in 50 years time this will be less of an issue, but as things stand, it would be *disastrous* for the birth rate to drop too quickly. \n\n&#x200B;\n\nQuick note - I'm not trying to say there are no upsides to an aging population (which is what dropping birth rates leads to) but there are some very specific, very important downsides that are being felt especially strongly in a bunch of countries around the world already, as other posters have mentioned (Japan, France, Germany). \n\n&#x200B;\n\nFor a bit more formal knowledge on this, check out [https://www.oecd.org/berlin/47570029.pdf](https://www.oecd.org/berlin/47570029.pdf)",
            "title_similarity": "0.8615708",
            "sentiment_compound": 0.8327
        },
        {
            "id": "gx1dkyp",
            "score": 3,
            "text": "Demographic decline in Europe means that an always greater share of the population is composed of former colonial subjects. \n\nWhether this is good, bad, or irrelevant, that is up to debate of course, but the fact that Europeans are in denial of the process is very informative in itself. \n\nAs a result, teaching evolution, gender equality and freedom of expression is harder now in French and English classrooms, than it was a generation ago.",
            "title_similarity": "0.8435087",
            "sentiment_compound": 0.8338
        },
        {
            "id": "gx1f2dl",
            "score": 2,
            "text": "This book makes a great case that if we use resources and energy in the right way we can continue to grow. https://www.amazon.com/One-Billion-Americans-Thinking-Bigger-ebook/dp/B082ZR6827/ref=nodl_",
            "title_similarity": "0.55828",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gx1fxbo",
            "score": 1,
            "text": "Read about population implosion happening in Japan :)",
            "title_similarity": "0.44331312",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gx1haym",
            "score": 2,
            "text": "You are mistaken, it simply is not as bad as if they were not declining at all. \n\nDeclining birthrates are not sufficient to counteract the deleterious effects of humanity on itself and its environment.\n\nSo, better, but not good.",
            "title_similarity": "0.6407264",
            "sentiment_compound": -0.2462
        },
        {
            "id": "gx1hdxp",
            "score": 1,
            "text": "It is usual a sign of prosperity. I doubt this is unpopular",
            "title_similarity": "0.35228902",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gx1hrfz",
            "score": 8,
            "text": "Certainly declining birthrates are good for the world on the whole, but the circumstances that brought these declining birthrates about (see COVID and economic collapse) are very much not ideal.\n\nSustainable declines in birth rates are noted in modernizing countries that see a rising standard of living. As things like income, sanitation, life expectancy, and infant/early childhood mortality all change for the better, birth rates slow because the impetus that keeps them high has been removed. Families no longer need a gaggle of kids to help provide for the household. Parents don't need to churn out a few extra kids because others aren't tragically being lost to illness or malnourishment. \n\nThe declines we are seeing presently are in response to the shock of COVID grinding the economy (and frankly, the dating scene) to a halt, creating a lot of uncertainty, making hospitals ideal to avoid if possible, and plunging families into poverty very suddenly. We should see the birthrate climb once these circumstances fade, but if they do not (I can scarcely see covid-related widespread poverty being solved), then we'll see it climb again rapidly in countries without (or with lax) child labor laws because children will be a needed source of economic income.\n\nBirthrates falling are good. But the way birthrates are falling presently are disastrous.",
            "title_similarity": "0.85326236",
            "sentiment_compound": -0.8562
        },
        {
            "id": "gx1j6ou",
            "score": 1,
            "text": "Part of the Global Reset",
            "title_similarity": "0.34051555",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx1kyvv",
            "score": 1,
            "text": "> An economy that requires a continuously increasing population is not sustainable indefinitely.\n\nOur entire economic model  of perpetual growth with perpetual consumption is not sustainable",
            "title_similarity": "0.71378386",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gx1m76l",
            "score": 2,
            "text": "I agree with the notion that a decreasing population is good for the overall planet. It’s a good thing that our fertility rates are declining because we are per person producing tons of CO2 and harming our very fragile planet.  I would argue that the issue is we are decreasing our fertility too fast in the first world. In a perfect world the fertility rate would be between 2 to 1.9, every generation would lose a small portion of its population, and eventually our planet can get to a stable human population. \n\nThe issue is that its way below that in someplace. Currently in South Korea it below 1, which is also great for our planet but terrible for Koreans in 40 years. If a fertility rate is below 1 that means the generation being born into the planet today will have to pay double the taxes to support the elderly in the future than the previous generation, assuming the previous generation had a fertility of 2. One of the solutions many western countries have had is immigration, but it’s just a short term solution and only works if you have continuous immigration. In countries like America this works kinda because America is a country of immigrants. In countries in Europe and Asia, continuous immigration rarely works because it cause ethnic tension in a country, and puts pressures on the native cultures of the country. \n\nFurthermore the earth will have a fertility rate below 2.1 (which is the replacement level), once that happens some countries will be hurt when have more double the elderly compared to the working class. You can actually look at Ukraine if you want a prime example of how this hurts a country. Ukraine hit a fertility below replace a while ago, their country was stabilizing with population but because of bad economic opportunity and a ongoing war in the east. Now the birth rate is at an all-time low, and more young people are leaving the country because there are no opportunities, what’s worse is the elderly is staying so the youth that wants to stay get taxed heavier to take care of the old, this causing a vacuum effect because it pushes more people to move out of the country. So all the middle class educated people get to leave legally and then the poor lower skilled people either get lucky and immigrate, cross the EU border illegally, or stay and suffer. \n\nLastly I want to clarify I am not supporting high fertility rates, high rates never help the economy because the government has to focus on providing more housing and schooling for a larger population. If the fertility is 4, that means in the next 20 years the country has build double the schools and double the houses and apartments.",
            "title_similarity": "0.83341146",
            "sentiment_compound": -0.9822
        },
        {
            "id": "gx1n7ll",
            "score": 1,
            "text": "How will you handle pensions? Should poor old people just die?",
            "title_similarity": "0.5742421",
            "sentiment_compound": -0.8105
        },
        {
            "id": "gx1nka3",
            "score": 1,
            "text": "What you said is technically true. However, the reason people are becoming concerned over declining birth rates is that having a birth rate below replacement level will eventually come back to bite you. At first, it is good because you have less useless children lying around, but soon you will have too few producers and too many retirees. To be clear, retiring by itself is fine, it's just that when you have a disproportionate amount of retirees to workers, the economy tanks because too many people are consuming and too few people are producing. If your birth rate is significantly below replacement level, like 1.2 per family, you will get a very unbalanced population. Again, the problem is not the total number of people, but the balance of population ages.\n\nPersonally I think the decreasing birthrate is on the whole a good thing, but I do understand why people are concerned.",
            "title_similarity": "0.90278715",
            "sentiment_compound": 0.8186
        },
        {
            "id": "gx1q4le",
            "score": 1,
            "text": "A nation needs a steady supply of \"new,\" people (as the cliche goes \\[though it is actually true\\], \"Our most valuable resource is our people.\")\n\nAs for the supply of those new people; you either have to birth them or import them...\n\nWith a screwed-up immigration policy and the declining birthrate, America is doing neither of these very well and is going to face some big problems down the road.\n\nThis is both the truth and just another reason why today's GOP with its retrograde immigration policies and its treatment of women as baby factories (w/o actual regard for either the women or the babies, and no rational strategy for the future) has got to go.",
            "title_similarity": "0.80053955",
            "sentiment_compound": 0.7172
        },
        {
            "id": "gx1qqsv",
            "score": 1,
            "text": "A lot of countries are worried about declining populations because they worry about losing their culture. Most of what I’ve heard of this centers around European nations. Many of those nations are small, with boundaries that roughly overlap with a distinctive cultural community. If the population of people currently living there gets smaller, it roughly means the population of that unique culture gets smaller. However, that’s not the only thing threatening traditions and culture, and it doesn’t automatically mean people have the right to a culturally or racially homogenous nation.",
            "title_similarity": "0.7558787",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gx1qzyf",
            "score": 1,
            "text": "An ageing population means less people will pay taxes and work, but people still get old and need support, who's going to pay for their pension?",
            "title_similarity": "0.7638062",
            "sentiment_compound": 0.437
        },
        {
            "id": "gx1tjvw",
            "score": 1,
            "text": "It's probably better for the environment in the long-term, if humanity survives long enough for it to make a difference. But all the people now who are going to get old and need long-term care will be a problem when there aren't enough young people to look after them. But euthanasia is becoming a more accepted practice. My prediction is that it won't be more than about 20 years before it becomes almost a social expectation to voluntarily end our lives if we need long-term care. It will become socially irresponsible to be seen as a \"burden.\"",
            "title_similarity": "0.8012272",
            "sentiment_compound": 0.3377
        },
        {
            "id": "gx1txuy",
            "score": 1,
            "text": "The main issue is how will working society support a larger population of elderly people who don’t work. Would you propose raising the retirement age?",
            "title_similarity": "0.7391462",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gx1v7jh",
            "score": 1,
            "text": ">Fewer people means that each person can have a larger share of limited resources\n\nOr, it means the ultrawealthy have less people to compete with to control a greater percentage of resources.",
            "title_similarity": "0.6559662",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gx1yqdw",
            "score": 1,
            "text": "And just like that we all figured out why this forever growth model our society is built on is broke and will come crashing down.",
            "title_similarity": "0.65030813",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gx1z8hc",
            "score": 1,
            "text": "I disagree with your reasoning. The world will not turn into a sci-fi dystopia. There is a biological theory that proposes when a population reaches its max level of sustainability, the population will naturally plateau, rather than continue to climb. So your reasoning is most likely false.",
            "title_similarity": "0.6425803",
            "sentiment_compound": -0.34
        },
        {
            "id": "gx1zqea",
            "score": 1,
            "text": "It doesn't sound like youve given much thought to the fact that people dies. Yes the population may increase but its not so this system can survive which requires it. Its so there will be less preventable deaths. \n\nConsider also that there will be less people in jobs that help sustain life, less people around to accompany and enjoy life with, less people who can figure out how to make life worth living. Life is never a numbers game except for economists and strategists who never much like getting their hands in the mud and finding out things are messier than their formulas and theories supposed. \n\nA good deal of what you seem to want could happen simply if people stopped moving to big cities and spread out across the world.",
            "title_similarity": "0.7710786",
            "sentiment_compound": 0.9087
        },
        {
            "id": "gx21wvk",
            "score": 1,
            "text": "Except they’re going to replace the declining birth rate with immigration, so you get he same result but your people are slowly replaced.",
            "title_similarity": "0.77758765",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx24f9c",
            "score": 1,
            "text": "Right now, it seems to me that birth rates are dropping in part because of economic pressure, societal instability, and individuals simply not being mentally ready or prepared to become a parent. These, I would argue, are not good things, the declining birth rates seem to be a consequence of these things happening.\n\nYes, preventing our population from exploding is a good thing, and improves the sustainability of the planet. But the way it is being done is deeply inequitable, and I don't think anyone's really in control of it or able to positively influence it.\n\nI argue that instead of uncontrolled population decline due to factors largely outside everyone's control, we would devise policies (that most everyone could agree on) that would be invoked to help keep that population stable. This is truly a decision for the whole population, not lawmakers, not representatives, not leaders. Once we have some good policies, it would be smarter if we measured how many humans can exist sustainably, then say, try to maintain at 5-10% below that (or whatever is deemed safe to endure unexpected strife).",
            "title_similarity": "0.8691417",
            "sentiment_compound": 0.98
        },
        {
            "id": "gx2701q",
            "score": 1,
            "text": "Declining birth rates may be a sign of shrinking economy, but it’s indistinguishable at a macro level from declining birth rates due to decreased viability of the earth to support human life. Pollution, particularly of forever chemicals, is a major concern and one that will almost certainly effect lower birth rates eventually if it hasn’t begun to already.",
            "title_similarity": "0.8608179",
            "sentiment_compound": 0.5867
        },
        {
            "id": "gx291zb",
            "score": 1,
            "text": "Shown by demographic studies, human race will peak at about 11 billion and then population will decrease to a more stable level. So in the long run it doesn't even matter.",
            "title_similarity": "0.64401126",
            "sentiment_compound": 0.344
        },
        {
            "id": "gx29qsm",
            "score": 1,
            "text": "The reason behind birthrates declining is the real issue. For boomers raising 4 kids on a single salary was expected. Now days a single salary can only really support a single person.",
            "title_similarity": "0.7081675",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gx2ai4t",
            "score": 2,
            "text": "In theory? It's good. Every since women entered the workforce in mass, they're has been an issue with there being more people then there are jobs, which caused wage stagnation (in the west). Couple that with mass immigration and a high birth rate, jobs could afford to keep paying next to nothing, because there was always  plenty of people to do it. \n\nIf we take away the birth rates though, without stemming mass immigration of low skilled workers. The program doesn't get solved, and it creates an entirely new problem of cultural divide, as the low skilled foreign immigrants out reproduce the locals, and with them comes their separate culture, and in some cases even separate language.\n\nSo yes and no, it sounds good to shrink the workforce, but that workforce will just be replaced by another one without taking other steps.",
            "title_similarity": "0.8424768",
            "sentiment_compound": 0.2958
        },
        {
            "id": "gx2ajpa",
            "score": 2,
            "text": "You are right, but at the same time, our economic policy and many of our economic ideas are 100% based on an assumption of growth. Capital economics are fucked and I expect some major life changing crashes to happen once we come around to the fact that we cannot/will not have an always expanding population.",
            "title_similarity": "0.7795677",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gx2bbk3",
            "score": 1,
            "text": "I think an important factor to consider is why this is happening. More micro plastics in our diet and a wilting planet and sick society do not look good for the home team, so to speak. I feel like looking at a falling birth rate as a good thing is missing some more context.",
            "title_similarity": "0.82797164",
            "sentiment_compound": -0.3195
        },
        {
            "id": "gx2c3ii",
            "score": 2,
            "text": "You seem to assume that the \"limited resources\" are just there for the taking.  My point is, the amount of people it takes to harvest, mine, purify, or assemble the resources at their current capacity will likely decline if there are less people to take up the jobs.",
            "title_similarity": "0.75087667",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gx2cgqi",
            "score": 1,
            "text": "It's a good thing on paper.\n\nIt's a bad thing for all of us alive now, living in countries and participating in economies built around the idea of continued growth.",
            "title_similarity": "0.75100917",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gx2f3t0",
            "score": 1,
            "text": "To say human births should decline is to say human life has little value. If each person is valuable, you should want more of them.",
            "title_similarity": "0.6397127",
            "sentiment_compound": 0.6712
        },
        {
            "id": "gx2g6ag",
            "score": 3,
            "text": "I'd generally agree, but it will mean non-trivial re-organization of our society.\n\nFor example, Social security only works if the birth rate stays high.  Because it's not a savings account, it's direct redistribution from the young to the old.  If the ratio of young to old people changes, then we will have to significantly increase the tax or significantly cut social security (I'm speaking specifically of the US, because that's where I'm familiar, but afaik it's the same elsewhere).",
            "title_similarity": "0.7752991",
            "sentiment_compound": 0.8047
        },
        {
            "id": "gx2guoh",
            "score": 1,
            "text": "It’s because we’re all becoming sterile due to soft plastics being in all our food. Humans will be extinct by 2200 I think if we don’t do something about it.",
            "title_similarity": "0.6246056",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx2idzw",
            "score": 1,
            "text": "Why would I wanna change your view? I agree with you!",
            "title_similarity": "0.24901567",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gx2iv00",
            "score": 1,
            "text": "Yes, yes, yes. All day this.",
            "title_similarity": "0.074245475",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gx2jbqt",
            "score": 1,
            "text": "It is not. Most social welfare programs are ponzi schemes. Once you have less people paying in than people withdrawing funds, it collapses.",
            "title_similarity": "0.69510746",
            "sentiment_compound": -0.296
        },
        {
            "id": "gx2oac5",
            "score": 1,
            "text": "It may be good for overall birth rates to decline evenly across demographics, at least until populations are within sustainable levels, but the problem with what we're experiencing is that it's not evenly distributed. To use a crude example, it's like idiocracy where the redneck trash has more kids than educated people. But the problem here isn't those demographics per se, but follow more closely with economic trends. Despite popular belief, there is a moderate correlation between economic success and children produced, where the more successful have more kids. And since (at least in the US) more people of color or minorities tend to fall in the less successful section, those populations are shrinking faster, almost like a passive genocide. (There is an exception, hispanic populations are still growing faster than anything but it's possible those numbers are because of how the data is collected).",
            "title_similarity": "0.8289192",
            "sentiment_compound": 0.9035
        },
        {
            "id": "gx2p2ja",
            "score": 1,
            "text": "Economic difficulty’s because there won’t be enough peasants having to work their arses off for the rich. I once upon a time wanting a child but why would I want to bring a kid into this world",
            "title_similarity": "0.71313125",
            "sentiment_compound": 0.4118
        },
        {
            "id": "gx2pcl2",
            "score": 1,
            "text": "I get your point but the thing is that we have a lot of resources. We have more houses than homeless people (about 31 vacant housing units for each homeless person in the US), more than enough food goes to waste instead of feeding the starving. The problem isn't overpopulation, the problem is a system that values profit over universal well-being. \n\nFewer people doesn't mean each person has more resources because so many people don't have access to resources. The good thing about declining birth rates though is that we can use that to promote better conditions to have kids.",
            "title_similarity": "0.82249695",
            "sentiment_compound": 0.8869
        },
        {
            "id": "gx2sgd7",
            "score": 1,
            "text": "Declining birthrates were intended and predicted. It's a side effect of having both empowered women and moving past subsistence farming. There's nothing to discuss here.",
            "title_similarity": "0.61008483",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx2shgb",
            "score": 1,
            "text": "We’ll see how it pans out. Japan and America are definitely where it’s happening. If it happens in other more numerous countries we’ll see a decline in population. Seeing as people can’t shake their addiction to technology and that technology keeps receiving funding to improve, it might not affect much even if it happens.",
            "title_similarity": "0.8202355",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gx2sv13",
            "score": 1,
            "text": "The baby boomer generation is about to retire and collect social security within the next 5-10 years, social security isn't some bank account where the tax money you put in gets saved/invested, it is immediately spent on other people who are already retired or spent on some other program. Having few young people to pay social security will result in either taxes skyrocketing or loads of money being printed to cover the SS payments. If you're young this means it will be harder to buy a house, keep savings, have less money after taxes, commodities will be more expensive. This could be somewhat avoided if there were more young people.",
            "title_similarity": "0.77524126",
            "sentiment_compound": 0.5709
        },
        {
            "id": "gx2wt0y",
            "score": 1,
            "text": "I am not aiming necessarily to change your view but low (and negative) population growth is terrible for the economy, especially in developed countries. When you add the higher percentage of retired population (which you have mentioned), the consequences can be really dire.",
            "title_similarity": "0.8712459",
            "sentiment_compound": -0.9311
        },
        {
            "id": "gx2xpy0",
            "score": 1,
            "text": "I would say it could be a good thing if not for these facts:  \n\nOur government spending and entitlements are not declining, meaning a decreasing population will have the burden of paying more taxes. Meanwhile our culture has grown increasingly entitled and complacent, thinking we can afford everything. We're in a democracy, so our culture elects our leaders. Therefore, no end is in sight to this spending problem.  \n\nOur country is competing idealogically with other countries that have systems that have proven to be less sustainable and/or generate more widespread human suffering. If China, for example, keeps birthrate high, keeps growing population, economy, and cultural influence, and successfully spreads to become some sort of existential threat to us while we shrink, the world may have a bad time in the end.  The most successful, sustainable, prosperity-producing, suffering-reducing society kind of has a moral imperitive to spread wide and far. Good people can argue which society that is, but I'm damn sure it's not an authoritarian regime that quashes dissidents and inflicts genocide on certain ethnic groups.",
            "title_similarity": "0.8097178",
            "sentiment_compound": -0.3883
        },
        {
            "id": "gx2xypg",
            "score": 1,
            "text": "The hardest choice require the strongest of wills",
            "title_similarity": "0.35935462",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gx2zjwn",
            "score": 1,
            "text": "Have you heard of the Silver Tsunami? [+]",
            "title_similarity": "0.2869258",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx3148y",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10183136"
        },
        {
            "id": "gx32agp",
            "score": 1,
            "text": "The birth rates European countries is not the issue of rising population. \n\nAsian and African countries where it is typical to have 10+ children- is. And it won’t change until the countries become more developed; the same as what happened after the industrial revolution in Europe and then birth rates dropped.",
            "title_similarity": "0.67018783",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx32dbe",
            "score": 1,
            "text": "It’s not only a good thing that birth rates decline, it’s part of a natural algorithm. Numberphile does a video on this about rabbits. \n\nAlso, the natural/inevitable decline in birth rates renders any eugenicist’s view (muh overpopulation), null.",
            "title_similarity": "0.6710294",
            "sentiment_compound": 0.0243
        },
        {
            "id": "gx336bx",
            "score": 1,
            "text": "Let's just do the Thanos.",
            "title_similarity": "0.109585635",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx34klj",
            "score": 1,
            "text": " It’s a good thing",
            "title_similarity": "0.09571994",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gx34rw4",
            "score": 3,
            "text": "You're viewing this as if technology will not progress. You're taking the common sense approach influenced by Malthus of \"We need to reduce birth rates otherwise we're all gonna die.\"\n\n&#x200B;\n\nI'll give you another theory, Boserup's theory of population. People are the most useful resource to a county. The more there are the faster it will progress. If we have a hypothetical birth rate of 3 (Far higher than current birth rates in the West) we will have a much greater number of young people to older retired people. This new mob of people will than go into fields like science, manufacturing and Economics.\n\n&#x200B;\n\nIf you imagine the world as a game of civilization than Boserup makes sense, we'll have more productive young adults to \"Give us more research points per turn\" society would progress much faster than if we stuck to Malthusian thought of \"there's a hard cap on population that once reached people will starve to death\"\n\n&#x200B;\n\nTo give a example of what im talking about. Europe had a population boom in the 18th century, Europe's population in 1800AD was almost double what it was in 1700AD. The 17th century was famous for the beginning of industrialisation, the enlighntment and the scientific revolution. Malthus was proven wrong in that this higher population actually made the general standard of living far higher than what it was a century ago.\n\n&#x200B;\n\n(Im not advocating for a population boom, if we do it too quickly we might actually have mass starvation) but for the reasons i have mentioned a birth rate high enough to ensure that young adults are a significant minority/majority of society would help us rapidly progress as a species. It could help us combat climate change, cure diseases like Covid much faster than what we saw and other advances i couldn't possibly describe.\n\n&#x200B;\n\nI hope i've convinced you, if you have any questions or want me to go over something again. Please let me know",
            "title_similarity": "0.8176317",
            "sentiment_compound": 0.9772
        },
        {
            "id": "gx35b3q",
            "score": 1,
            "text": "It depends on the country. In countries where the population is booming or about to boom, such as countries in sub-Saharan Africa. However, in aging populations like those we see in Western Europe, it can be a real problem, as there aren't enough workers. The problem is, only Western Europe, Japan, and other highly developed nations have declining birth rates while nations in sub-Saharan Africa have much higher birth rates due to less medical infrastructure, as children will die more. So depending on the nation and demographic, a declining birth rate can be good or bad",
            "title_similarity": "0.8692889",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gx36aph",
            "score": 1,
            "text": "It's not a good thing for big business in general because the supply of labor is going down that means they'll have to pay workers more.  \nIt's not a good thing for organized religion because it cuts down on their income and their influence.",
            "title_similarity": "0.80177844",
            "sentiment_compound": -0.7515
        },
        {
            "id": "gx38kzc",
            "score": 1,
            "text": "China wants the US to have a lower population. They have a consumer base that is 1.9 billion strong and growing larger everyday. They’re able to wield this as a weapon to force major companies to cater to them, even if that is against the interests of the US. While there are many benefits to less people, we’re quickly entering a time when we have to be very skeptical of the motives of corporations which are in the Chinese market. If we thought Russian interference in elections was a big deal, just imagine Chinese interference in our marketplaces and even our culture, driving political division, weakening us from the inside out.",
            "title_similarity": "0.8042501",
            "sentiment_compound": 0.079
        },
        {
            "id": "gx38shr",
            "score": 1,
            "text": "I think we’re gonna see a COVID baby boom. I know at least 10 women personally that are pregnant right now, due within July-December.",
            "title_similarity": "0.46252766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx392zo",
            "score": 1,
            "text": "Malthusian economics were disproved decades ago. More people is a good thing for the economy not a bad thing.",
            "title_similarity": "0.76502925",
            "sentiment_compound": 0.6956
        },
        {
            "id": "gx39uwu",
            "score": 1,
            "text": "The economy would be completely fine if the government did a better job actually enforcing against large companies using anticompetitive practices.  The USA is \\*huge\\* and a good, huge portion of the USA is completely undeveloped.  It's just that cities are becoming more and more overpopulated.",
            "title_similarity": "0.7118037",
            "sentiment_compound": 0.8883
        },
        {
            "id": "gx3a2c0",
            "score": 1,
            "text": "Birth rates among religious nutcases aren't. And if everyone else's are, you'll end up with a world ruled by them.",
            "title_similarity": "0.50942105",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx3a7h9",
            "score": 1,
            "text": "The bad thing is the wrong people are still the ones breeding.  People who should not have kids in the first place having 4 or 5.",
            "title_similarity": "0.62409747",
            "sentiment_compound": -0.765
        },
        {
            "id": "gx3a8bx",
            "score": 1,
            "text": "Shalom!",
            "title_similarity": "0.0017212406",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx3ae2d",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.12978615"
        },
        {
            "id": "gx3f7fu",
            "score": 1,
            "text": "There are easier and more humane ways to lower births and achieve population reduction.  And it would be nice if financially savvy people could have as many kids as overly religious ones.",
            "title_similarity": "0.65457356",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gx3fkdt",
            "score": 1,
            "text": "We live on a planet where we haven’t even explored maybe 20% of it. We’re good on resources. So I’m gonna have my 8 kids, be happy and encourage my friends to do the same.",
            "title_similarity": "0.58839464",
            "sentiment_compound": 0.9186
        },
        {
            "id": "gx3gbgw",
            "score": 1,
            "text": "A lot of younger adults aren't having children because they can't forsee a future where they could afford it. So, yeah. That's not good.",
            "title_similarity": "0.6700076",
            "sentiment_compound": -0.0531
        },
        {
            "id": "gx3h57j",
            "score": 1,
            "text": "Ever watch idiocracy?",
            "title_similarity": "0.37161845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx3hwio",
            "score": 1,
            "text": "NOOO! Think of the economy! 😠",
            "title_similarity": "0.41036513",
            "sentiment_compound": -0.5972
        },
        {
            "id": "gx3ib75",
            "score": 1,
            "text": "Got it backward. Its good things that make the birth rate go down. Hans Rosling explains in one of the most iconic Ted Talks:\n\nhttps://youtu.be/hVimVzgtD6w",
            "title_similarity": "0.6592324",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gx3iwcs",
            "score": 2,
            "text": "It's about countries. Nations like South Korea and Japan are literally dissapearing slowly. And secondly the place with the most highest birthplace is Africa. So you are literally saying it's good for western and Asian countries to die out so that Africans can have more kids",
            "title_similarity": "0.65096366",
            "sentiment_compound": 0.128
        },
        {
            "id": "gx3j47o",
            "score": 1,
            "text": "You’re wrong for the key reason that the birth rates are declining **among well educated people most notably.** Maybe there would an argument to be made that we need fewer humans in aggregate (though I resist that argument) but since the numbers are dropping for smart people & generally not dropping or not dropping as sharply for stupider people this will ultimately only empower the aristocracy, weaken the middle class, & result in more suffering person to person worldwide. \n\nThe best thing any of us can do is ensure we leave the world with more competent stewards.",
            "title_similarity": "0.85949373",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gx3ki31",
            "score": 1,
            "text": "They only are falling for white people so essentially you’re saying it’s good white people are declining",
            "title_similarity": "0.5294497",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gx3ldus",
            "score": 1,
            "text": "Your argument is: It's good that there's fewer white people.",
            "title_similarity": "0.45013455",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gx3m5uc",
            "score": 1,
            "text": "I'm not going to tackle your other points as others have done so already but I'll add my share to the table.\n\nUsually when the news talk about birth rate decline, they mean the birth rate of their own respective countries or a bigger area of countries, like Europe. As it has been mentioned before, sperm count has been dropping dramatically for many decades now lowering birth rate, but this mainly affects the western world.\n\nIn there, it's extremely bad that the birth rate is dropping as age pyramid starts to get top heavy and, at some point, countries will lose most of their workforce without much warning as all the old ones retire. I agree that economy built to be dependent on population growth is unsustainable. But even if these bad practices were to stop, we would still be left with vacant positions in jobs that just couldn't be filled.\n\nIt gets even worse as the neighbouring countries have the same problem, so importing workforce is near impossible.\n\nAnd don't you worry, it gets EVEN worse. Birth rates are ONLY declining in welfare states. We have always had countries with booming population growth, as a couple of years back it was India and China (funny as China had literal birth control policies but they still made the cut). Now the most booming area is Africa. I think it could be safe to say that for every baby we lose in the west, two are born in Africa.\n\nSo birth rates are declining but really it's just rising exponentially elsewhere. This planet is pretty much doomed to run out of resources whatsoever.\n\nTo sum up. Birth rates are mainly declining in the western world and it will be really bad for both the economy and society, and it can't be easily fixed as you would have to import workforce from far, far away. This also might give a nudge towards exporting industries to countries with workforce, that might even be cheaper, and we all know how that story ends. Also, earth wise, it doesn't matter if birth rates are declining somewhere as areas like India and Africa are booming without a pause. This continues to bloat our already high population of 7 billion and life will get tight in more ways than one. We will run out of resources and one planet is not enough for us all.",
            "title_similarity": "0.86490273",
            "sentiment_compound": -0.7529
        },
        {
            "id": "gx3osjs",
            "score": 1,
            "text": "lmao no, birth rates are declining in 1st world developed countries, countries where you WANT stable birth rates, not necessarily increasing birth rates, but birth rates where new generations can sufficiently replace older generations at a pace that keeps the economy and progress afloat. However, you've got poverty stricken countries where birth rates are extremely high because human capital is the only thing sustaining them, ironically enough it's also a contributing reason to their impoverishment, and it's unfortunate that they're stuck in this cycle. If your problem is with pollution, then reassess your perspective to fit the fact that China and it's neighboring Asian countries produce more than half of it. If your problem is poverty then reassess your perspective to fit countries like Uganda, Mali, Niger, India.\n\nDeclining birth rates in western countries, and Japan would have no impact on a global scale, because those aren't the problem areas. Sure, we've got issues, but I'd say we're faring much better in regards to accommodating our problems than any of the problem countries.",
            "title_similarity": "0.8959311",
            "sentiment_compound": -0.9031
        },
        {
            "id": "gx3pjq2",
            "score": 1,
            "text": "We know very well why sperm count and firtility is going down.  Microplastics.",
            "title_similarity": "0.46964782",
            "sentiment_compound": 0.3384
        },
        {
            "id": "gx3psvk",
            "score": 1,
            "text": "I find it really funny that my wife and I have always been against having children due to our perceived bleak future for humanity and general overpopulation and we’re expecting out first and only child in September. What a world.",
            "title_similarity": "0.6072205",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gx3qjjo",
            "score": 1,
            "text": "The top thread on this post is talking about decreasing quality of life compared to what we have now in industrialized countries. Unfortunately that's not something we have a choice in if we don't slow down the earth's population growth. I encourage everyone to take a look at [How many Earths do you need?](https://www.footprintcalculator.org/) You might think that the estimate is a bit high, but the bottom line is that no one I know has gotten the answer of 1 Earth, or even less than 2 Earths. And the higher that number is, the more quality of life is going to decrease for the old AND young if we continue on this track.",
            "title_similarity": "0.789363",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gx3qkp4",
            "score": 1,
            "text": "It’s called bye bye old people. The ones alive in the 1% now took everything",
            "title_similarity": "0.41377413",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gx3racg",
            "score": 1,
            "text": "Money, the economy, capitalism is really just a mechanism for allocating good and services.  Pensions and savings are just a more advanced version of tick marks on a cave wall.  There is a real argument that from an ecological point of view that declining birth rates may be good.\n\nBut I think you should ask yourself, is there a real problem in the productive capacity in the economy?  Is the real problem a shortage of labor?  If that was true, wouldn’t there be plenty of well paying jobs, reduced economic uncertainty, and a more stable willingness and desire to reproduce in the west?\n\nTo put it more concretely, I think that the nursing shortage in the US is artificial.  If there was a way to train on the job for it, you’d get a lot more people willing to try it.  As somebody that has a master’s degree in an unrelated field, I’d still have to go back and take undergrad prereqs and the fight for a spot at an expensive school all for the opportunity to get a job paying way less.   Why take the risk unless it’s a passion?   What if you don’t like it?\n\nIn reality, the US economy is really inflexible.  There are huge barriers to getting a job and when you get one your healthcare, and sometimes your family’s healthcare, are tied to your job.\n\nIn the end, I think the economy is more of a risk to birth rates than the other way around.  Capital owners are gonna be fine, and the baton is getting passed from globalization to automation.",
            "title_similarity": "0.8028732",
            "sentiment_compound": 0.9147
        },
        {
            "id": "gx3tig2",
            "score": 1,
            "text": ">An economy that requires a continuously increasing population is not sustainable indefinitely.\n\nHow is that relevant to a topic about a population about to decline rapidly?\n\nAnyway, the USA is screwed because you are so indebted (and taking on more in mindboggling pace), in addition to all the unfinanced liabilities. How you imagine you will be able to finance the debt burden in addition to all the other costs coming online with an aging population I know not. You don't seem to have made any particular preparation for an age of an aging USA. Are you just going to throw all that debt and obligations on the shoulders of a decrease younger population, to be carried around their necks like a yoke, and think that is ok, or that they'll be ok with it?",
            "title_similarity": "0.85811466",
            "sentiment_compound": -0.8205
        },
        {
            "id": "gx3tq17",
            "score": 1,
            "text": "I don’t like that declining birth rates are in part due to the ever increasing financial burden having children represents. I don’t think it appropriate that a persons wealth should play a significant role in whether they decide to have children. I’m not saying it shouldn’t have an economic cost to parents but governments should recognise that people raising children are creating the next generation of tax payers & workers & consumers. These are essential economic components of our societies. Education of children should be free. Healthcare should be free for children. It’s trite but true that children are the future. PS I have no kids, very glad other people choose to have them. 😉",
            "title_similarity": "0.7470075",
            "sentiment_compound": 0.963
        },
        {
            "id": "gx3vr6p",
            "score": 1,
            "text": "why do people post “correct” views here lmao like bro, you want someone to help narrow your mind?",
            "title_similarity": "0.4998457",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gx3w856",
            "score": 1,
            "text": "Well, the math for this is pretty clear. We are burning through finite natural resources at a dramatic rate at our current rate of consumption. Wishing the next fifty years, there is likely to be widespread ecological collapse, which means insane human suffering. Fish stocks have already largely collapsed, wilderness is being obliterated, 15 billion trees are being cut down a year, etc.\n\nIt is very obvious that our current population at our current lifestyle is not sustainable whatsoever. It’s going to end badly and people on this thread will be young enough to see it. Stuff like ‘the economy will grow more slowly’ or ‘we’ll have too many elderly’ is trivial compared to the scale of challenges. It’s going to be bad.\n\nBut here is the thing - while we burn through all these resources and operate wildly unsustainably, our lives are luxurious. Many people live in lots of climate controlled square footage, eat plenty of resource intensive animal protein, travel long distances for fun and work, and consume vast amounts of resources for convenience, entertainment and incremental comfort.\n\nSure, it all blows up eventually, but the next question is - what do we owe the future? I’m playing devil’s advocate here, but if you can live more comfortably then what do you care about hardship in the future? Having more children is part of that luxury. \n\nYou are making a value statement that we owe something to the future. That is not objectively true.",
            "title_similarity": "0.78290987",
            "sentiment_compound": 0.9568
        },
        {
            "id": "gx3wclv",
            "score": 1,
            "text": "Sperm counts are dropping due to plastics",
            "title_similarity": "0.5838256",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx41309",
            "score": 1,
            "text": "I’m confused by part of your statement, please clarify.\n\nif the remaining people end up consuming MORE resources because there’s less people around, how’s that any different than maintaining the population? \n\nisn’t having a shrinking pop. only going to make a diff. if remaining people maintain their normal level of resource consumption (or lower it, even better)?",
            "title_similarity": "0.78848404",
            "sentiment_compound": 0.264
        },
        {
            "id": "gx41ei1",
            "score": 1,
            "text": "All Imma say is: it’s easier to solve the problems of demographic imbalance than it is to solve us running out of food and water and ruining the planet",
            "title_similarity": "0.7119",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gx45zgy",
            "score": 1,
            "text": "I took a south East Asian Econ class in college. Honestly all of the economic models were only improved by lower birth rates. This is not the case for developed economies. Need to move some of those kiddos around.",
            "title_similarity": "0.6889366",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gx46p8l",
            "score": 1,
            "text": "There's a really good NOVA documentary on this called \"The People Paradox\".\n[link](https://www.pbs.org/wgbh/nova/transcripts/3108_worldbal.html)",
            "title_similarity": "0.46009147",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gx49u66",
            "score": 1,
            "text": "People are living longer and it costs money to keep the elderly alive. If there will be a lot of elderly, that will be a lot of money. Also, there will not be enough young people to take care of the elderly? There is also the social security issue, they say it might run out? By the time the younger generation grows old they won't have social security?",
            "title_similarity": "0.8207137",
            "sentiment_compound": 0.772
        },
        {
            "id": "gx4b9um",
            "score": 1,
            "text": "The level of technological advancement is directly linked to the population size. More people you have, more people you can spare of going to work the fields and dedicate to science and tech.\n\nSure, we have plenty of robots now (also in the literal fields), but we still need people in the interim.\n\n&#x200B;\n\nPlus, all of the numbers of how much people can we sustainably have is just a wild guess which depends a lot on other factors, like how clean is our energy and how efficient can we make food, both of which have technical solutions. We are just not there yet.\n\n&#x200B;\n\nIf we switched to renewables+nuclear and managed to economically produce cultured meat, and had better GMO crops, we could sustain a much larger population than we do now. All of these we will have, IF social roadblocks for them can be overcome.",
            "title_similarity": "0.67851377",
            "sentiment_compound": 0.9623
        },
        {
            "id": "gx4bceg",
            "score": 1,
            "text": "Yeah except every dumb fuck I know is having kids.",
            "title_similarity": "0.3693976",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gx4bw69",
            "score": 1,
            "text": "It's a good thing because it serves an economy that's not serving us?\nThis kind of anti-natalism is merely fatalism in respect to late-capitalism.",
            "title_similarity": "0.7011615",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gx4cehr",
            "score": 1,
            "text": "If you've watched the intro of the movie 'Idiocracy', that would summarize my point.\n\nPoint being... Yes, people are having fewer children. But the people who are actively planning their families in order to provide better for their children are generally the more educated, more health conscious, more wealthy, etc. From an economic point of view you want more of these people in your country. \n\nHowever, the ones who are having more children, many unplanned, are generally less educated, less healthy, offer less to the economy in general.  Yes, your population is reducing, but the percentage of your 'desired' population (economically) is reducing to a greater extent.",
            "title_similarity": "0.8307406",
            "sentiment_compound": 0.9749
        },
        {
            "id": "gx4dc3d",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx4di4v",
            "score": 1,
            "text": "Looks like most things have been covered. The main points are:\n\nBirth rates are only declining in first world countries. They are going up in most third world countries.\n\nThere is an impending crisis in which the old will outnumber the young to such a degree that taxpayers money will not be enough to offer a state pension. This is slightly more UK specific but still a major issue.\n\nIf the world's birth rate was declining then that would be a good thing I think, to a degree at least. But the world's birth rate is increasing exponentially and it's only in first world countries that it is declining.",
            "title_similarity": "0.89707476",
            "sentiment_compound": 0.4678
        },
        {
            "id": "gx4dwbe",
            "score": 1,
            "text": "Isn't 80% of the worlds resources and plastic and pollution caused by the rich 1%? And if so, what good would reduction in working class and lower class people cause other than more poverty?\n\nIdk bruh. Mass genocide of the elite sounds nice.",
            "title_similarity": "0.7358265",
            "sentiment_compound": 0.492
        },
        {
            "id": "gx4e0jw",
            "score": 1,
            "text": "The demographic transition model is a base for how advanced a civilization or country is and been higher is been more successful.\n\nThe first has significant high birth but high death due to poor medical help Examples been the stone age.\n\nNext is the decreasing of the death rate but birth still been higher\n\nNext is a gradual drop in both to where a significant amount of deaths are now from elderly instead of child mortality.\n\nStage 4 is most of europe where families usually have between 1 and 3 children and are expected to reach ages of 70 80 and 90.\n\n5 is where women and men focus a lot more on success and materialism so may have 1 or no children. This can be seen in Germany \n\nThis is why countries are having massive foreign immigration to keep there economys going. In the UK this is having some bad effects with house prices rising dramatically and having some strain on NHS and police and schools with language barriers. Most of these communities also don't integrate and end up with us vs them mentality on locals and locals back on them.\n\n\nJust wanted to say I'm not racist or blaming problems on immigration its just factors that are keeping economies up and that allow ageing population to have cheaper care but comes with downsides.",
            "title_similarity": "0.8157213",
            "sentiment_compound": -0.169
        },
        {
            "id": "gx4emna",
            "score": 1,
            "text": "I suppose a fertility around the replacement level of 2.3 is pretty good. Below that and I’d be really worried about social security and how our economy will function without a large number of workers.",
            "title_similarity": "0.7959762",
            "sentiment_compound": 0.6989
        },
        {
            "id": "gx4f42y",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx4f9lv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx4h8t8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx4j14d",
            "score": 1,
            "text": "OK but do we know that reduced sperm count leads to less pregnancy? It's not like a low sperm count means it's impossible to get pregnant if you want to, it takes one sperm.",
            "title_similarity": "0.63294077",
            "sentiment_compound": 0.2435
        },
        {
            "id": "gx4n45l",
            "score": 1,
            "text": "As long as they don't drop below the replacement rate. But it's a kinda bad thing unless we can make headway on rejuvenation medicine. The proportion of the population of working age will shrink.",
            "title_similarity": "0.7887763",
            "sentiment_compound": -0.5998
        },
        {
            "id": "gx4oc6j",
            "score": 1,
            "text": "It will make the pyramid scheme that is social security grind to a halt.",
            "title_similarity": "0.53460574",
            "sentiment_compound": 0.34
        },
        {
            "id": "gx4oj8r",
            "score": 1,
            "text": "Its probably a good thing but it’s also a signal of either a population that feels resources will be scarce in the future or a population that is just generally thinking the future looks bad. The fist can be ok. Maybe acting on a future where things are more scarce is fine because it helps the population maintain quality of life with less. But the latter is not a good situation. And I’m guessing it’s this one that’s mostly at play.",
            "title_similarity": "0.7287352",
            "sentiment_compound": 0.1948
        },
        {
            "id": "gx4q7bk",
            "score": 2,
            "text": "The birth rates are declining... with SMART PEOPLE.\n\n&#x200B;\n\nDumb fucks get 10 kids still.",
            "title_similarity": "0.67359835",
            "sentiment_compound": -0.4528
        },
        {
            "id": "gx4sxkl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx4xag3",
            "score": 1,
            "text": "Your third paragraph could be an argument for getting women out of the workplace (or men, idk) and going back to single income households. Would it be necessary to have the birth rate be lower to achieve that? Does the availability of alternatives still mean that low birth rates are good?",
            "title_similarity": "0.6911159",
            "sentiment_compound": -0.5661
        },
        {
            "id": "gx4za86",
            "score": 1,
            "text": "Aging population with declining birth rates can cause all kinds of issues down the road. From lack of elderly care as the population continues to get older to transfer of knowledge. \n\nThe current retirement system was created in such a way so that current retirees could live comfortably while the younger generations foot the bill. What happens when the next generations aren’t as populous as the older generation? You get a massive drain on resources and the trust set up to handle the drain can’t handle the load of retirees vs younger generation. Which is what we see today with the current social security system. By the time the millennial generation reaches retirement, the social security trust will be empty. \n\nThere’s also knowledge transfer interruptions. What has been the biggest drop off in knowledge over the last 20 years? Trades. And it’s only getting worse as the boomer generation retires without having enough successors to take up the knowledge gap. Add on to the push for college education and you’ve got a wider gap in trade knowledge transfer. Things like plumbers, electricians, etc, are struggling to find people. \n\nSimilarly if you have a country that has low birth, aging population and lack of immigration, it puts a massive strain on the country as a whole since there are job gaps. Japan is struggling with said issue. It’s causing more than just knowledge gaps, it’s also putting a strain on the economic and financial system since production is down while cost for elderly care is up. \n\nSo while there are benefits to declining population, it can also be an extreme detriment to other generations.",
            "title_similarity": "0.85157514",
            "sentiment_compound": 0.7224
        },
        {
            "id": "gx53myk",
            "score": 1,
            "text": "We’re running out of space on earth, and overpopulation causes so many problems. Until we colonise the moon or Mars, I agree. We need more space in order for the birth rate to even have the chance to rise, I guess.",
            "title_similarity": "0.65389585",
            "sentiment_compound": 0.1335
        },
        {
            "id": "gx53uyf",
            "score": 1,
            "text": "Japan's declining birth rate is actually a bad thing. Think about it. IIRC there's a town somewhere that consists of, ***Literally***, mostly dolls due to the fact that there aren't enough people having children.When the people left there get too old, who is going to take care of them? eventually, the only thing that will be left in that town are the dolls themselves.\n\n&#x200B;\n\nI think it's good that it's declining in America, though.. Women are able to focus more on their careers, and if they land a job in that career they will be much happier in that job without having a child.\n\nBut this also goes back to Japan's situation in a way\\*\\*. When we get old, who's going to take care of us\\*\\*?....\n\nI'll be dead far before I get old, So I'm not stressing it.",
            "title_similarity": "0.79580927",
            "sentiment_compound": 0.5818
        },
        {
            "id": "gx5419k",
            "score": 1,
            "text": "Question for you: do you live in a heavily populated area? This seems to be the primary determining factor on a person’s belief that there are “too many people”.",
            "title_similarity": "0.56346077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx54owv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx5upbm",
            "score": 1,
            "text": "One thing that should probably be clarified first is how much of an impact does less sperm count have on the birthrate overall?  \n\n\nThe way I see it, in this day and age if you leave in a western country, you will probably stop having more babies by choice at 1 or 2 children, so how big of an issue is the lower sperm count compared to people just choosing not to have children?   \n\n\nIs it effecting us so much we should worry about it at all before the socio-economic issue of parents not even choosing to have bigger families?",
            "title_similarity": "0.7820219",
            "sentiment_compound": -0.7929
        },
        {
            "id": "gx625fv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10183132"
        },
        {
            "id": "gx6e66w",
            "score": 1,
            "text": "I think declining birth rates are a symptom of a bad problem. People are choosing not to have kids because it's too expensive and our society is putting too much economic pressure against having kids for the following reasons:\n\n1. 2 parent income required. It's great women have a choice to work rather than stay at home. However, we are reaching the point that families cannot afford single income households.\n\n2. Cost of childcare, food, and housing has increased. Economic pressure on people to not have kids.\n\n3. The college scam. College is almost required to obtain a job with a decent wage but could take 4+ years to finish with increasing debt placed on families. College is whole other issue, but I believe e it's totally unnecessary for the majority of jobs.\n\n4. Immigration. Instead of the government fixing the issues of cost, the government pushes both legal and illegal immigration to replace workers caused by low birth rates. The government would rather help big business get cheap labor rather than fix the terrible social issues that could cost the business money.\n\nWays to fix:\n\n1. Reduce immigration, It's simple economics. Less labor pool means business would have to increase wages to compete. Better wages means families can afford to have kids.\n\n2. College scam. The cost and time \nof college is a major factor affecting the birth rate of younger generations. \n\n3. Institute increased tax breaks or income to push families to have more kids.",
            "title_similarity": "0.8545163",
            "sentiment_compound": -0.886
        },
        {
            "id": "gx6xwm9",
            "score": 1,
            "text": "Birth rates in the western countries are declining, in the rest of the world they're trough the roof. The resources are doomed.",
            "title_similarity": "0.76139355",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gxcgzir",
            "score": 1,
            "text": "The problem isn’t a low birth rate. It’s the fact that there’s a low birth rate AND (in many first world low birth rate countries) an incredibly high and long living elderly population.\n\nYou need young people to supply the economy, work, defend the nation, and pay for that constantly rising elderly population.",
            "title_similarity": "0.7745508",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gxihryw",
            "score": 1,
            "text": "I agree completely. It's not like the world has a shortage of humans. This is also good for the environment.",
            "title_similarity": "0.32963544",
            "sentiment_compound": 0.2561
        },
        {
            "id": "gyfwbry",
            "score": 1,
            "text": "Birth rates declining is good spesifically because you think we will consume too many resources and will run out of them or the ability to provide to all?\n\nThis has literally been debated by classical economists. This argument is literally the malthusian theory. Link to a wiki page below\n\nIn short, economists by large have pretty much communally agreed this theory is outdated, a relic to the \"Adam Smith runs supreme\" days. I think the first mass adoption of debunking this theory (in North America at least) comes early as the 1880s by Henry George. I may be wrong, there may be others before him. He literally devotes one whe chapter explaining why the malthusian theory is based on flawed logic in his most influential book, progress and poverty. That book outsold all but the Bible, so his ideas were very popular amongst the population and still with modern economists and \"thought leaders\" (even if spesific parts of his theories are dated now too). Yes, economics is as much \"social science\" than science, but the general consensus is:\n\nMore people = more labor. More labor means more means to extract resources in a FAIRLY 1:1 relationship, as does consumption. If resources of a class run out (I.e coal), that labor does not \"go away\"; it gets put into the manpower required to start farming \"close to perfect subsitutes\" (I.e, natural gas) , or starts getting invested into reasonable alternatives (I.e, hydro dams)\n\nIt does also not account for quantum leaps into new technology. Like maybe nuclear fusion or slow breeding thorium reactors. Those quantum leaps require \"labor\" input from smart people (and a higher chance of getting those smart people with better educatuon, less poverty and a LARGER POPULATION) and overall actually make the output of one's labor MORE efficient due to the new use of tools/production methods (I.e, using a tractor to farm vs doing it by hand). I agree, these leaps are not \"guaranteed\", but humans are pretty reliable at getting themselves out of sticky situations in a crisis\n\nAnd imagine a crisis where we ran out of all macro resources and there is no technological innovations (except food, let's assume that we can still farm). Even though global wealth decreases, we would still have more labor to provide food for more people. Just more inefficiently and poorer overall\n\nNot addressing poverty with a rise in population is terrible and I think you're confusing with a rise of population as the sole cause of that. But an increase in population is not the sole cause of those issues; it's government, private industry and financier mismamagement\n\nPopulation increases if handled properly are good. What's more important to focus on is \"can we increase the average PER-POPULATION GDP through a change in our labor workforce by using more efficient tools or producing products at a comparative advantage for trade?\", \"can we make sure that most reap the benifits of this increase in wealth, not extreme inequality?\" and \"can we make sure we don't have a skewed aging demographic curve through immigration, child tax benifits, other factors?\"\n\nEdit: worth noting too, as countries develop, fertility rates (children per couple) usually goes below 2. Globally, it was 5 in 1960. Now? 2.4. US, Canada, France, UK? Below 2. It's actually a national problem for Canada because we want MORE people to power our economy. The federal government literally has a whole plan to try to make immigration as easy and seamless for integration as possible to address it\n\nhttps://en.m.wikipedia.org/wiki/Malthusianism",
            "title_similarity": "0.844972",
            "sentiment_compound": 0.9969
        },
        {
            "id": "gyyd8q2",
            "score": 1,
            "text": "Its balancing itself out. People dont have kids because they cant afford them. As a result all the systems that rely on surplus of labor hands will start collapsing well get a nice war or two and things will be back to normal. Eu is letting other cultures invade just to prop up the bottom line when the problem really is overpriced housing. If a person has a home the future is secured but if they have to work 20-30 years to pay it off thats just nonsense especially when 40 years ago it cost 6-12 months of wages to do the same thing.",
            "title_similarity": "0.812567",
            "sentiment_compound": -0.6956
        }
    ]
}