{
    "CMV: All these new cryptos plastered all over the front page are no different than your classic MLMs\nPretty much title. All the shit that is constantly being upvoted in the crypto moonshot sub and everywhere else that are constantly at the top of /r/all are no different than your classic MLMs. You’re hoping you can trick a bunch of people into buying after you so you can sell and make money at their expense.  \n\nApparently my first time I posted this it wasn’t long enough, so I’ll go on for a little bit longer to avoid having my post automatically removed. \n\nTL;DR \n\nIf you see people pushing obvious bullshit like $YEET, be smart and don’t believe everything you read.": [
        {
            "id": "gxnuup5",
            "score": 1,
            "text": "/u/corneliusthunderrod (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/n9hu5l/deltas_awarded_in_cmv_all_these_new_cryptos/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.66522133",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gxnwp18",
            "score": 0,
            "text": "Crypto is confused for a pump-and-dump or MLM all the time. Even by the creator of bitcoin.\n\nIn reality, the value of crypto comes from the fact that it's a currency that is less likely to be fucked with.\n\nLook at the insane amounts of dollars printed in this year and the last. Inflation is eating everyone's savings. We've learned that centralized currency is pretty bad for the citizen, as we can get effectively taxed through misrepresentation of wealth without knowing it or having any control over it.\n\nYes, part of the reason it skyrocketed is because of the pump-and-dump mentality, but we shouldn't ignore the value of having a decentralized currency either that can't be seized by government.\n\nWhat if the creators of these currencies start fucking with it? Well simply dump them and get another. That's the beauty of it, if the creators fuck with their currency, it becomes worthless, and there's no bond forcing people to use it.\n\nEdit: Grammar",
            "title_similarity": "0.79703724",
            "sentiment_compound": -0.8504
        },
        {
            "id": "gxnle9j",
            "score": 99,
            "text": "Cryptocurrencies add actual value by being a means of transaction.  Just like how PayPal is a real company with a real product that people willingly pay fees for and is worth 290 billion dollars and all they do is facilitate transactions.  Cryptocurrencies are actually worth something and provide real value by facilitating transactions.\n\nWhile I agree with you that the market has become oversaturated, I'd compare it more to the dot com bubble or the beanie baby craze rather than an MLM.",
            "title_similarity": "0.72226286",
            "sentiment_compound": 0.7556
        },
        {
            "id": "gxo550h",
            "score": 4,
            "text": "Oh no it is much worse, because cryptos have no intrinsic value, are wasting a ton of energy and carbon, and quantum computing will likely make it obsolete/high risk in a few years (https://www2.deloitte.com/nl/nl/pages/innovatie/artikelen/quantum-computers-and-the-bitcoin-blockchain.html).",
            "title_similarity": "0.6501405",
            "sentiment_compound": -0.8817
        },
        {
            "id": "gxnyckv",
            "score": 6,
            "text": "When you live as long as I do, you realize the whole damn economy is a Ponzi Scheme.\n\nHousing market, Ponzi Scheme.\n\nStock market, Ponzie Scheme.\n\nBachelors degree, Ponzie Scheme.\n\nCapitalism, Ponzie Scheme.",
            "title_similarity": "0.6466263",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxnwbwl",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxnvhkt",
            "score": 1,
            "text": "Cryptocurrencies in general are operating more like regular currencies with an extremely limited supply (eg if people were actually paying for things with gold). If people believed that we were about to start paying for everything with gold, or they believed that other people were about to believe that, or so on, the price of gold would skyrocket.\n\nThe fundamental difference is whether the recruitment is direct or indirect, and how much your own \"work\" in convincing can benefit you directly. If I bought a bunch of dogecoin, and then went around a convinced a few of my friends to invest in dogecoin, it would hardly move the price of dogecoin. But that's how you make money in an MLM. Conversely, if people who are not \"below you\" in an MLM sign up other people, it doesn't benefit you. But if someone else convinces their friends to invest in dogecoin, it benefits you. You can buy into a cryptocurrency and make tons of money (or lose money) even if you don't help convince people of its value.\n\nIn other words, cryptocurrencies are just highly speculative markets, which is not the same as a hierarchical structure of an MLM. Like most currencies (and even gold, outside of its functional value as a conductor), the currencies are only valuable because some people agree they're valuable.",
            "title_similarity": "0.74822646",
            "sentiment_compound": 0.9235
        },
        {
            "id": "gxof3vf",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxnl6zs",
            "score": 20,
            "text": "> MLMs. You’re hoping you can trick a bunch of people into buying after you so you can sell and make money at their expense.\n\nThat's not what MLM is at all.\n\nMLM is recruiting sales people and then when those sales people (or the sales people they recruit, etc.) make sales, you get a little piece of the sale.  I'm not sure how that relates to Crypto.  If I make a post promoting Dogecoin and then you sell some Dogecoin, I don't get a percentage of your proceeds.",
            "title_similarity": "0.7200775",
            "sentiment_compound": 0.3784
        },
        {
            "id": "gxoak5c",
            "score": -2,
            "text": "You are right until you are wrong, DOGE was told to be a pump and dump since forever, nobody would ever tell you it would make to $0,1 when it was $0,000001 or something in 2018, many people lost money at the time and many people lose money today... Until they don't, you could buy millions of DOGE with $10 back in 2018, those people are now millionaires, have in mind DOGE was created in 2013, nobody could predict this.",
            "title_similarity": "0.7731284",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gxozuav",
            "score": 2,
            "text": "Bitcoin was created as a way for ppl to store wealth without worrying about FED fucking up the dollar (like bailing banks and printing 10 billions in 3 years).\nSo decentralized finance does have its value by itself.\n\nBut when we look at Ethereum blockchain, it's a totally new game level.\nUnlike bitcoin, Ethereum blockchain wasn't created just as a way to store value, but as a platform that has so many more uses because of its blockchain's property of authenticity.\nYou can have unique tokens, you can develop smart contracts, NFTs and so much more we haven't even discovered yet.\nSo ethereum is a blockchain for multi use that happens to use Ether(the coin) as a way to pay the ppl who maintain it, which is valued because of the blockchain's usefulness.\n\nEthereum is like the first web browser,, we had no idea the potential of web browsers. Now we can't imagine a world without it. Ethereum-like blockchain will be the same. \n\nAlso these cryptos themselves are all based on hard science (computer science and math), it's a technology being developed by actual smart people, while MLM are just dumb idiots who are incompetent and unable to work on anything else but to con ppl into buying stuff NOT BASED on science. \n\nBut I know where you're coming from, con artist are seeing crypts as these magical stuff that will make you rich. No. \nCrypto must be treated more as \"how your life can be improved with blockchains\" than \"get rich quick\". \n\nThe price spike you are seeing now are the hyped up investors speculating on the crypto market having no clue on what what is crypto or its applications. \n Eventually they will leave I think, but crypto will keep going and be a good long term thing for our lives and investment. It maybe it's just ppl realizing ethereum's potential.\n\n\nAs of other cryptos, yeah, there are a lot of shit coins out there, but it's hardly something as worse as MLM where you are directly hurting other people financially on purpose.",
            "title_similarity": "0.76246184",
            "sentiment_compound": 0.7817
        },
        {
            "id": "gxnuu0h",
            "score": -4,
            "text": "I disagree and here is why.  Crypto is not as simple as \"hurr durr buy this crypto so it will go up\".  Crypto has been around long before it hit mainstream and had a use. A use that not many people know about,  BTC was the primary current used on silk road and all other transactions on the dark web. Now since BTC can be tracked most to all dark web transactions have moved to Ethereum.  Ethereum, BTC, litecoin all are  currency being traded for material goods which in turn gives them value and not just a stock price.  If doge turns out to untraceable it could very well move to dark web transactions but was created as a joke.  BTC only has a limited value at 21M bitcoins in the world ever and Ethereum has a cap way higher.  Most to all people who buy Crypto as a stock to make a quick buck is about how many sites are indexed ie \\~1%.  That was a value pulled out of my ass but I am getting at not many people buy Crypto just for stocks.",
            "title_similarity": "0.77817905",
            "sentiment_compound": 0.6119
        },
        {
            "id": "gxo6hmg",
            "score": 0,
            "text": "So what do you think of more traditional investing excluding crypto?",
            "title_similarity": "0.44361734",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxojtol",
            "score": 4,
            "text": "All crypto shit should be banned on reddit just the same as any other advertising/scams",
            "title_similarity": "0.6001499",
            "sentiment_compound": -0.765
        },
        {
            "id": "gxoks93",
            "score": 0,
            "text": "I feel the same about Doge and Ethereum",
            "title_similarity": "0.12479022",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoloa0",
            "score": 0,
            "text": "Clearly you haven’t studied what blockchain is and how it can help. Sure, some “coins” are this, but not most. But either way, you do you, and the rest of will keep making our gains.\n\nEdit: perhaps look into what Blockchain is and how it’s helping Africa right now. Especially with their education system. And if your looking at “crypto moon shots” subreddit, of course this is what you’ll think. That subreddit is no where near the reality of what crypto is. It’s basically the same as comparing an average/normal business to an MLM scheme",
            "title_similarity": "0.6486274",
            "sentiment_compound": 0.3073
        },
        {
            "id": "gye3u05",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gzgk2fd",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gzglfoh",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxnt4xf",
            "score": 14,
            "text": "The difference between cryptocurrency and MLM is that for crypto, an economy of scale to reach sustainability *does exist*.  If a given blockchain has enough users, it will be stable and through that stability, it can provide value.  \n\nAn MLM is inherently unstable.  It must continue to grow in order to redistribute money, but it cannot - on its own - create value as a factor of operating.  Cryptocurrencies *can*.  Whether they *will or won't* is yet to be seen, but they have the ability.",
            "title_similarity": "0.6436366",
            "sentiment_compound": 0.7325
        },
        {
            "id": "gxoc5sk",
            "score": 1,
            "text": "no your views are correct",
            "title_similarity": "0.057766594",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxohat7",
            "score": -1,
            "text": "I think what the poster is trying to say is that the  price of many of these coins is being pumped up by hype and marketing dollars. Does that mean it’s a scam? No. Is it a sound investment? Who knows. The market is the market.",
            "title_similarity": "0.6464677",
            "sentiment_compound": -0.6199
        },
        {
            "id": "gxopkg1",
            "score": 1,
            "text": "You'll have to be more specific for me. For example, ethereum is being used by the United Nations and the European Investment Bank. Dogecoin, on the other hand, has no utility.",
            "title_similarity": "0.5386205",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxnqnc7",
            "score": 9,
            "text": "The issue with your assumption is that these new coins are created with the business model of scamming people.  So let's compare this to the dot com bubble.  While I'm sure there were companies set up to scam people, most were trying to address an issue or corner a market.  E-toys tried to do the online toy store thing while Pets.com did the pet thing.  Both made some people a lot of money and lost even more people a lot of money.  However, you can't call them scams since they were not set up only to achieve that result.   Same with a lot of these new coins.  Some are addressing issues in the current system like high transaction fees, long transaction time, security, actual use case, etc.   Of course, not all of these, or even most of these will survive in the long run, but labeling all of them a scam is akin to labeling all the new .com companies a scam in the 1998-2000 era.\n\nHowever, that's not to say there are no scams in crypto right now.  The biggest one is rug pulls.  Here' people buy into the coin, while the founders have a huge amount of the coin. When enough people buy in and the price of the coin goes up, They pull liquidity so retail investors  can't sell, and they dump all their coins at market price.  Something like this is designed from the get-go to be a scam and these coins are out there.",
            "title_similarity": "0.80089927",
            "sentiment_compound": -0.8227
        },
        {
            "id": "gxnu3ay",
            "score": 2,
            "text": "So.......\nWhat's an MLM?",
            "title_similarity": "0.07669701",
            "sentiment_compound": -0.4824
        },
        {
            "id": "gxodlm2",
            "score": 2,
            "text": "Just want to point out that a lot of people are making the same mistake about misindentifying what a \"pyramid scheme\" is. What some have described is a multilevel marketing scheme, which really isn't the same thing as a pyramid scheme (though they have the same structure).\n\nWhich isn't the same as a ponzi scheme, quite... \n\nPonzi schemes are more like social security (with a key difference): rather than there being any kind of underlying investment, a ponzi scheme involves paying dividends to the previous investors from the money taken in from later investors. There doesn't have to be any kind of \"link\" between you and those later investors to make it a ponzi scheme (the most famous, Bernie Madoff's, didn't involve recruitment payoffs).\n\nThe key difference between social security and a \"ponzi scheme\" or between a \"pyramid scheme\" and multi-level marketing is one additional requirement, which is that a \nponzi or pyramid scheme must fraudulently be claiming there is an underlying investment. Multi-level marketing is legal as long as it doesn't defraud anyone. \n\nCrypto coins very rarely make that fraudulent claim, either.\n\nWhat crypto coins offer is a transaction service that is paid for by \"mining\" (or claiming stake in) the coins.\n\nThere is definitely a ponzi/pyramid-scheme like flavor to this, but it's not actually a ponzi/pyramid scheme, nor is it (usually) a multi-level marketing scheme. There's usually not \"fraud\", in that this scheme is laid out accurately, and it's rare that there is a multi-level payoff scheme.\n\nInstead, it's a service-based commodity investment... kind of like US currency. US currency is not backed by anything \"real\", either... what it's backed by is the service the US government provides in return for the taxes that must be paid in those dollars (plus enforcement, i.e. a bit of extortion, that people must use dollar-based accounting for income in the US).\n\nMost of the new coins aren't any of these... they're just terrible investments in currencies/commodities that few people will want, backed by a service few people will use.",
            "title_similarity": "0.68939984",
            "sentiment_compound": 0.8735
        },
        {
            "id": "gxonjr9",
            "score": -2,
            "text": "Your front page is not the same as others.  You literally mold your front page.",
            "title_similarity": "0.54393524",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoqc4i",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxnncdu",
            "score": 85,
            "text": "It isn't really a MLM. It's closer to a Ponzi scheme crossed with the greater fool theory.\n\nJoin this crypto for untold gains etc... Each 'investor' makes money of the next person buying it as each new investor inflates the price. This is like a Ponzi where an investor makes money off the next investor and so on (until they can't anymore and the whole scheme collapses). \n\nThe greater fool theory says there will always be another fool to buy after you. But the problem is a lot of the time you are the last fool, or you hold until the last fool. \n\nI don't think most people 'investing' in things like doge realise this.\n\nMost cryptos are worthless, some are very valuable.\n\nCombine the above and most people lose a lot of in the long run money. \n\nI would love to be proved wrong in the future but I really don't think I will.",
            "title_similarity": "0.8250815",
            "sentiment_compound": -0.8394
        },
        {
            "id": "gxnmf7j",
            "score": 6,
            "text": "Any crypto is nothing more than speculation until it can be used commonly as a currency, that includes bitcoin. To me, that means a somewhat stable price, widespread acceptance by vendors, and widespread acceptance that it is a currency. No crypto as of yet has all three",
            "title_similarity": "0.6416454",
            "sentiment_compound": 0.6915
        },
        {
            "id": "gxp4cs3",
            "score": 10,
            "text": "Way back when, credit cards were new fangled technology.  Most people scoffed at them.  How was a piece of plastic going to replace cold hard cash!  What a buncha weirdos.\n\nTurns out credit cards are doing just fine.\n\nCrypto currency is new and weird.  It is not understood.  But ask yourself if you understand the concept: money that is entirely digital and secure, to match a world that is increasingly more digital.\n\nYou don't have to understand how it works to understand that it could work.  I don't know how my car truly works in all its parts.  But I trust it to get me where I wanna go.  It isn't mid level marketing.  It is new money and they are asking for investors just like Visa, back in the day, needed funding to open an office building to get started.",
            "title_similarity": "0.76678973",
            "sentiment_compound": 0.9534
        },
        {
            "id": "gxnkugh",
            "score": 1764,
            "text": "MLMs are not the same as pump-and-dumps. They are wildly different business models.  \n\nEDIT: Posting here for clarity since like over a dozen people now have made the terrible argument \"bitcoin is not like gold because gold is used for circuits\". Gold was valuable way before circuits. \n\nEDIT 2: No, it's not historically valuable because of its marginal uses in dentistry either. It's shiny and rare, does not oxidate (meaning you can transport it without losing any) and is in vaguely fixed supply. It can also be easily arbitrarily subdivided fractionally and is very difficult to forge. These properties cemented it as a universal store of value, not its usefulness. Someone even tried telling me it's valuable because you can build a house out of it in an emergency (lol?).",
            "title_similarity": "0.6976881",
            "sentiment_compound": 0.5631
        },
        {
            "id": "gxoki5w",
            "score": 12,
            "text": "They're literally just posting trying to hype up trash coins to inflate value even just a tiny bit and then dump them for profit which usually tanks them right back down. And honestly anyone who doesn't recognize it as a pump and dump kinda deserves to lose their investment.\n\nA fool and his money are soon parted.\n\nI'd also argue that subs like r/CryptoMoonshot should be banned, or at the very least quarantined until their moderation team gets a better grip on the pump and dump posts. There is absolutely zero due diligence in 90% of the posts there, and by and large most are actually straight up scams. \n\nThe first like 5 posts when you look the sub right now are coins that are less than a week old. With outrageous claims on return rates. Shady links and obfuscated code, posts made by super shady accounts. Posts that look like obvious money laundering attempts.\n\nIf they were doing this with actual stocks it'd be illegal\n\nEdit: it looks like I posted a sub that was copying the name a and has since privated itself.\n\nBut I'll say it about r/CryptoMoonShots proper as well By and large these are pump and dumps. Pump up the hype for the coin, then dump all their holdings tanking the price. Be incredibly wary of things promising insane 1000x returns or posts heavily laden with jargon it sounds sophisticated but the majority of it is literal nonsense. Be prepared to completely lose your investment.\n\nAnd I'll reiterate if this was a stock what they're doing would be highly illegal.",
            "title_similarity": "0.7208911",
            "sentiment_compound": -0.9147
        },
        {
            "id": "gxofddq",
            "score": 15,
            "text": "It is a little weird for cryptos in general since the value is almost entirely in speculation. There is little understanding of how any of it works by most of the people, even those involved in mining/buying/selling crypto, they just seek profits with stuff like bitcoin as the dream, turning into millionaires overnight.\n\nMost stocks you'd call it a pump and dump because you normally wouldn't need to goad people to buy in to inflate the value of your stock since the stocks value should be determined by the actual profitability of the company, but with cryptos there's no motivation for people to buy into any crypto at all unless people demonstrate interest in it, so even for genuine users that intend to hold, they need to spread awareness about crypto being a thing and convince people to buy and use it, or it won't ever take off. (But yes, there are *also* people who are just trying to pump and dump)\n\nThere's definitely a vocal portion of the population that genuinely wants cryptos to become mainstream, under the belief that if the average person starts using it to buy things and to receive their paychecks, the value will stabilize and it'll become a \"real currency\". However there is also obviously a massive chunk of people that are only in it for profit, and couldn't care less about that.",
            "title_similarity": "0.74771976",
            "sentiment_compound": 0.9565
        },
        {
            "id": "gxol0dq",
            "score": 15,
            "text": "There was a book written in 1976 called The Denationalization of Money that was strangely prescient about the development of crypto currency. The author was dissatisfied with how money production was monopolized by governments and manipulated for the benefit of insiders and he proposed allowing private entities to create and circulate their own currencies. Currency issuers would compete in a \"free market for currency\" - just like markets for other goods. The idea was to let market forces determine which currencies have the best properties and which people want to use.\n\nIt's really only the advent of the internet and blockchain and the open source movement that made a marketplace of currencies possible. Bitcoin is appreciating because its supply is fixed, while the supply of fiat currency is increasing rapidly. On the critical dimension of supply or scarcity, bitcoin is out competing the US dollar.",
            "title_similarity": "0.71167886",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gxnm8wr",
            "score": 362,
            "text": "It's not so much like a pyramid scheme because there aren't actual kickbacks for getting people to sign up. It is closer to inflating the value of garbage stocks then dumping them before they tank.\n\nIf I start selling essential oils and energy balancing crystals, then convince 20 of my closest friends and family to do the same, I would get a kick back for every one of them that signed up under me and bought a starter kit or whatever. I then get a smaller kickback for everyone THEY sign up, encouraging me to help them push the magic. As long as i am first, I'm getting money for everyone downstream. \n\nIf I bought a bunch of crypto currency, then talked 20 of my closest friends into doing the same, the value might go up slightly, but I'm not getting a kick back when they buy. I get a bigger return for buying in early before the price goes up, but that's it. It is equivalent to a boiler room scam for stocks. Buy a whole bunch of penny stocks. Get a bunch of guys pushing that specific penny stock. The sudden interest prompts the value to spike. Once it does, sell yours and get out before the bubble pops. Shut down the operation and move to a new office and start over.",
            "title_similarity": "0.7707488",
            "sentiment_compound": 0.8534
        },
        {
            "id": "gxoaw8x",
            "score": 49,
            "text": "I can't stand r/all lately.  So many get rich quick people pumping their posts up.  It's just all so sleazy and shitty.",
            "title_similarity": "0.6876138",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnkwt9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxnxoqo",
            "score": 1,
            "text": "It was rare.",
            "title_similarity": "0.10094029",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnz82w",
            "score": 1,
            "text": "But Panther..",
            "title_similarity": "0.04423289",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnz9sh",
            "score": 3,
            "text": "These are more of a Ponzi scheme than an MLM.",
            "title_similarity": "0.40790665",
            "sentiment_compound": -0.4824
        },
        {
            "id": "gxodd2c",
            "score": 1,
            "text": "Are you referring to Dogecoin?",
            "title_similarity": "0.048590966",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoh4ci",
            "score": 2,
            "text": "Anyone else get invites from friends for \"minepi\"?",
            "title_similarity": "0.39929423",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gxoh9qq",
            "score": 1,
            "text": "Duh",
            "title_similarity": "-0.045893863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxohtqi",
            "score": 1,
            "text": "I only buy and never sell so no I don’t plan on selling later. Maybe spending it but not for a long time.",
            "title_similarity": "0.5053351",
            "sentiment_compound": -0.2342
        },
        {
            "id": "gxoi2rj",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxoipgq",
            "score": 3,
            "text": "I completely 100% agree with you, crypto, to me at least, seems like the mlm for the nerds/ nerdy crowd. To a layman like me, they seem like they still rely too heavily on exiting currency to get me to “buy” in. \n\nMy $0.02",
            "title_similarity": "0.77124983",
            "sentiment_compound": 0.7703
        },
        {
            "id": "gxom6g9",
            "score": 2,
            "text": "Not like MLMs at all. MLMs have products to sell.",
            "title_similarity": "0.48655984",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gxon6iq",
            "score": 2,
            "text": "MLM’s sell products at least, crypto currency just sells the idea that you own an imaginary currency that almost no one accepts\n\na far more apt comparison would be that crypto currency is like selling stocks of a company that doesn’t exist",
            "title_similarity": "0.7007278",
            "sentiment_compound": -0.0272
        },
        {
            "id": "gxonndh",
            "score": 2,
            "text": "I use ublock and other adblocks, what cryptos?",
            "title_similarity": "0.56032884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoqgbi",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxoqlas",
            "score": 2,
            "text": "They’re not the same “business model” as MLMs, but they are both scams, yeah.",
            "title_similarity": "0.4970467",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gxorzyu",
            "score": 1,
            "text": "MLMs actually take some effort to set up their cons. Some guy is there churning out a dozen crypto coins a day, complete with fake Reddit accounts, bots, bought upvotes, discord and such. Probably has a whole team from India doing web presence, Facebook, reviews, and fake PR too.",
            "title_similarity": "0.7717302",
            "sentiment_compound": -0.836
        },
        {
            "id": "gxos0fc",
            "score": 3,
            "text": "There are certainly some cryptos that are scams, but there are plenty of real projects out there that are revolutionizing how we approach technology and finance. \n\nIf you want to say that SafeDogeElonMoon is an MLM, fine. But don’t say something like Ethereum is an MLM. That would be laughable. Because something like Eth has a lot of practical utility. It is more than just a coin - it is essentially a platform that other decentralized finance (DeFi) projects run on. That is where its real value comes from. \n\nThere are other cryptos that have real utility as well. VeChain, for example, enhances supply chain management. Cardano is implementing smart contracts. Similar cryptos like Stellar and XRP offer instantaneous transaction speeds that are actually cheaper and less energy intensive than what we currently have in place.  \n\nIronically, bitcoin does not really serve much practical utility anymore. I believe it’s only the top crypto because it has been around the longest. \n\nTL;DR buy cryptos like Ethereum and VeChain that offer real practical utility - these aren’t going away. You can pass on SafeDogeElonMoon and probably Bitcoin too at this point. My opinion",
            "title_similarity": "0.77139306",
            "sentiment_compound": 0.9556
        },
        {
            "id": "gxos66o",
            "score": 2,
            "text": "God I'm so tired of seeing safemoon shit. Literally 90% of the comments are from bots with accounts made days ago and their only activity is sucking off safemoon. They bought a billboard in time square. Whoever is behind it is gonna make millions when they pull the rug",
            "title_similarity": "0.7955401",
            "sentiment_compound": -0.6901
        },
        {
            "id": "gxoubd1",
            "score": 1,
            "text": "Pump and dump or ponzis are more apt.",
            "title_similarity": "0.3519992",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gxovhg0",
            "score": 4,
            "text": " I am reading the comments and change my view seems to have evolved into insult the view and the person will never see another side because Reddit is full of flaming assholes incapable of normal discourse. And I have crypto. There were a handful of intelligent responses as to the operations of coins and the rest was I am making money so ha ha.",
            "title_similarity": "0.8265555",
            "sentiment_compound": -0.555
        },
        {
            "id": "gxoxi59",
            "score": 1,
            "text": "What does MLM stand for?",
            "title_similarity": "0.026905939",
            "sentiment_compound": -0.4824
        },
        {
            "id": "gxp29d7",
            "score": 1,
            "text": "There is not guy at the top profiting from you buying Bitcoin with a false return promise. It’s essentially internet gold you invest in. Its literally no different then saying “I’m gonna use dollar bills to represent gold” but instead of gold it is kind of backed by privacy.",
            "title_similarity": "0.62451065",
            "sentiment_compound": 0.2407
        },
        {
            "id": "gxp2ygl",
            "score": 1,
            "text": "Similar to the GameStop situation.",
            "title_similarity": "0.18828344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxp3hwy",
            "score": 1,
            "text": "Agreed. It's just another scam, this time catering to zoomers with memes and bullshit.",
            "title_similarity": "0.55468786",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gxp4jxu",
            "score": 1,
            "text": "All the forced hype and cultishnes feels to me like a real life version of RuneScape merch clan.",
            "title_similarity": "0.6764704",
            "sentiment_compound": -0.128
        },
        {
            "id": "gxp6ox8",
            "score": 1,
            "text": "I don't know how people visit r/all. But I would argue crypto is much more like a stock than an mlm.\n\nI don't follow most crypto news or communities so I don't hear about all the little random ones. But when I do it just makes me think it's like a penny stock. Especially considering most of them aren't traded on the main crypto exchanges. The only one I actively use is NDAX, and I'm in Canada. And even then I only joined it to buy doge for memes. \n\nDue diligence is the name of the game in any financial product though. And a lot of MLMs offer legit services or products. But they're not going to be for everyone and some of the people pushing them on you are morally questionable. Proceed with caution.",
            "title_similarity": "0.6675215",
            "sentiment_compound": 0.2238
        },
        {
            "id": "gxp809j",
            "score": 1,
            "text": "Guess why Elon wants to make Doge popular. Because he literally bought a bunch of it low and will sell high. Higher than any of these crypto cucks will ever see in a lifetime",
            "title_similarity": "0.7255924",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gxp81c6",
            "score": 1,
            "text": "I felt the same when I joined the Doge subreddit since the mood there reminds me of MLMs.",
            "title_similarity": "0.3307638",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpc8q1",
            "score": 1,
            "text": "In 2018 it was ICOs 2021 it's shitcoins and NFTs. It's a trendy bubble that forms when people want to get rich quick by hopping on a crashing wave. Anyone that was in crypto in 2019 or 2020 are taking profits, same as did all the smart WSB guys when GME reached 200$, 250$ because they knew what they were doing. \n\nCryptos are wild west and if someone comes in and throws around money thinking it will all make profit without any risk, they are easy pray. But saying that these vultures that eat up stupid money represent all crypto is unfair. It would be the same as saying all businesses that sell something are MLMs and all investing firms are ponzi schemes.",
            "title_similarity": "0.8084283",
            "sentiment_compound": -0.5095
        },
        {
            "id": "gxpddq9",
            "score": 1,
            "text": "Duh? What do you think we’ve been doing for years? You make up some bullshit, hype it as the next big thing, inflate the value, sell, and leave all the stupid normies holding the bag.",
            "title_similarity": "0.7621201",
            "sentiment_compound": -0.7476
        },
        {
            "id": "gxpdzfk",
            "score": 1,
            "text": "Telling someone stupid enough to buy something called YEET to be smart is like telling a paraplegic to learn how to walk. I don’t think anyone who buys that shit has a “dammit, that was really stupid of me, wasn’t it” moment it unless they FOMO in at the top ask lose half their “investment”... and even then I’m pretty sure the vast majority of them just move on to the next one.\n\nThere might be an extremely small minority of average or smarter people who’re extremely new to crypto that can be helped by advice like this, but for the vast majority, they basically just have to get rekt. That and watching things like DOGE dumping 20%+ for two two days in a row while BTC dips 10% in the same amount of time is enough for most people to figure out why meme coins are basically just a ponzu lottery, but for the ones that don’t learn after that, fuck em. They were just gonna lose the money some other dumb way.",
            "title_similarity": "0.72738636",
            "sentiment_compound": -0.8846
        },
        {
            "id": "gxpehu1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxpgosl",
            "score": 1,
            "text": "I think the main thing they have in common is the cult-like behavior of their users who all seem to have to constantly reconfirm their hype with everybody else to sustain the mass delusion.",
            "title_similarity": "0.7067684",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpgsrj",
            "score": 3,
            "text": "I can smell the collapse from here. Oh you can argue about exactly how and why it's a scam, but it's still there. It's within in the next few months, the giant glut of savings from people with jobs still and nowhere to put cash since they can't buy a new GPU starts to dry up. The fuel for the stupidity fire starts to dwindle, the smartest few can smell it coming and have already sold their fungible digicoin shit. Others start thinking about cashing out too, the market starts to tip. Where are the buyers, there's been buyers for months! Ok will they sell for lower? Lower than that? Lower still?\n\nSome morons thinking to \"buy the dip\" go in, but that doesn't stop it for long. All stimulus money is gone into dumbasscoin already, there's no more money to \"buy the dip!\". The price starts dropping again, more, then more. The market goes into a panic, the pyramid scheme is up and if you don't get out now you'll lose everything! The entire thing goes bust, then another coin, then another. The great ditchfire of 2021, it'll be a site to see.",
            "title_similarity": "0.7138972",
            "sentiment_compound": -0.9729
        },
        {
            "id": "gxph584",
            "score": 1,
            "text": "Yep.",
            "title_similarity": "-0.051480524",
            "sentiment_compound": 0.296
        },
        {
            "id": "gxpjkig",
            "score": 1,
            "text": "Okay, you don't have to understand it but that doesn't mean it's a scam.",
            "title_similarity": "0.23488313",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gxpjw1r",
            "score": 1,
            "text": "You perhaps are talking about shitcoins (coins which have no development and add no more value.) which are a communal pump and dump, for example DOGE. But most of the people holding DOGE already know its meant as a joke currency, and is much better wasting money on betting on shitcoins than, say slot machines.\nMeanwhile, that doesnt mean that everything is bullshit in crypto world. There are governance tokens which could be a big deal say in for stockholders, where 0.001% stake holder could still directly vote on company matters. Then there are smart contracts, where you have potential to replace large part of financial services from banks to a middleman free environment that is more in line with market conditions. Companies can issue their own coins, like BNB for binance which give different benefits for its holders.\nIn short, there are many inherently useless cryptos indeed, but there are many which really do add value too.",
            "title_similarity": "0.75075126",
            "sentiment_compound": 0.833
        },
        {
            "id": "gxpkqk0",
            "score": 1,
            "text": "Nobody is using Crypto the way it's supposed to. You're supposed to get paid with crypto and then buy your groceries with it. Nobody is doing that.",
            "title_similarity": "0.62151605",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpm05f",
            "score": 1,
            "text": "Except they kind of work. That said I expect those cryptos to have an insane crash eventually",
            "title_similarity": "0.66124034",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gxpnfzi",
            "score": 1,
            "text": "Beanie babies, Tulip mania, South sea bubble, dot com share crash, plus a plethora of other bubble. But  crypto currencies don't seem to be following the normal trend of these other bubbles, in that the other bubbles were much shorter in duration.",
            "title_similarity": "0.61219347",
            "sentiment_compound": -0.0644
        },
        {
            "id": "gxpsf3k",
            "score": 1,
            "text": "Crypto is just a global online game of hot potato. For every dollar that someone makes, someone must lose a dollar. It's just a gamble of which will you be.",
            "title_similarity": "0.64179325",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxpy4x2",
            "score": 1,
            "text": "The reason so many people are paying for ads and posting about new cryptos is a \"pump and dump\" scam. The market is so speculative, it's easy to convince people they will make money from investing. This scam is different from MLM in the payment structure. You get direct payment for signing someone else up for an MLM. For crypto, individuals don't have the same incentive to get their own acquaintances to buy in. It takes a massive scale to actually raise the price, so the only way to make money is market manipulation through ads and posts. Still a scam, but a different structure.\n\nI know your post specifically says \"new cryptos\" but cryptos as a whole aren't as much of a scam as MLMs. Direct decentralized payment is actually a service that creates value, unlike healing crystals. So any new cryptos that actually improve on the existing systems could be a worthwhile investment. DOGE for instance has a few key differences from existing cryptos (many wouldn't consider it an improvement, but some might)",
            "title_similarity": "0.81292677",
            "sentiment_compound": 0.5415
        },
        {
            "id": "gxpypy2",
            "score": 1,
            "text": "I think that is true of 90% of them, but there are some that are doing innovative shit with technology or have some cool idea.\n\nFor instance $HAPPY is donating money every Friday to a different mental health charity and also redistributes the transaction taxes to the holders of the coin. Will it be the next BTC? No, I doubt it but as long as they keep donating money to something I care about then I'm happy.\n\nAlso when $DOGE first hit the scene this was exactly what people said about it and look where it is now. It's impossible to predict what will be a pump and dump vs something that will actually grow in value.\n\nThere's importance behind doing your due diligence whenever you're investing in anything and then the more risky the investment the less you should stake. If I lose a couple hundred bucks in a shitcoin then I'm not gonna be devastated.\n\nBut I do agree that 90% of the cryptos, maybe even higher, are scams.",
            "title_similarity": "0.7197979",
            "sentiment_compound": 0.9633
        },
        {
            "id": "gxpzjxs",
            "score": 1,
            "text": "ITT: Bag holders trying to justify spending $1000 on absolutely useless shit. \n\nIt is all a scam. No one will ever use these coins in a store. Their only utility is buying drugs off dark net markets, and trading, which is just gambling at this point. It is fueled by FOMO because we saw a few people get obscenely rich by pure chance.",
            "title_similarity": "0.7093979",
            "sentiment_compound": -0.8059
        },
        {
            "id": "gxq02xw",
            "score": 1,
            "text": "I will give you that MOST of these new cryptos are just greedy people who love the idea of printing their own money.  Especially coins that are just capitalizing on a trend of backed by some random celebrity or company probably aren’t interested in the crypto technology.\n\nThat said there are some crypto currencies that actually are trying to innovate and add value to the space.  People are only beginning to discover the potential of what this technology can do.  Take NFTs for example, the hype is a bit overblown but the technology is actually really useful.  If you are an artist writing a song or making a movie without a big publisher to back you, imagine putting your original song out to the world with an NFT attached to it and any time someone resells or recreates something with your data you are guaranteed a cut of their profits.  That is huge for the space, and even if companies like Spotify or Apple don’t like getting cut out of the action  NFTs are undeniably powerful for artists.\n\nImagine being able to hard code how the banks have to operate and in order to change the rules you need the holders of the currency’s governance token to vote it through (see Cardano).  This is only the tip of the iceberg of what you can do when you PROGRAM how the money moves. \n\nA healthy grain of skepticism is definitely warranted but don’t dismiss all of them as scams.",
            "title_similarity": "0.79331326",
            "sentiment_compound": 0.9732
        },
        {
            "id": "gxq1w65",
            "score": 1,
            "text": "There are ample posts n here showing that DOGE is worthless and can never be anything but worthless.  I feel so bad for these kids who are like YEAH TO THE MOON.  Lessons will be learned, I suppose, but FFS there are actual cryptos that are crushing it with sound fundamentals",
            "title_similarity": "0.6904588",
            "sentiment_compound": -0.9472
        },
        {
            "id": "gxq2hm7",
            "score": 1,
            "text": "It reminds me of [Dutch Tulip Mania](https://www.history.com/.amp/news/tulip-mania-financial-crash-holland).",
            "title_similarity": "0.53220737",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxq545z",
            "score": 2,
            "text": "MLM is a ponzi scheeme that pretends to be a business. Or it is the advertisement wing of a \"legitimate\" business.\n\nCrypto is a pump and dump scheme.\n\nTotally different.\n\nThe MLM is a lie that says this is a job you can make money at. 97+% effectively pay to work. It is insudious because it tells people that they aren't good enough or try hard enough to make it work while they burn friendships and strain familial relations.\n\nCrypto is a shitty investment that you may or may not benefit from the pump and dump. A lot of the posts I see they call each other various versions of idiot for investing. A lot of people are going to lose money that stoke the pump.",
            "title_similarity": "0.7208616",
            "sentiment_compound": -0.9687
        },
        {
            "id": "gxq67ng",
            "score": 1,
            "text": "Here’s why I think crypto is ultimately bull: they always list the value in non-crypto currency. If a nation’s currency fluctuated the way crypto did, no one would use it. It’s less currency and more stocks or gambling. What if your paycheck could pay your rent one month, buy your house next year, then barely buy groceries 6 months later? Oh and if you don’t cash it out at the right time, you’re fucked.",
            "title_similarity": "0.7636864",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gxq6s6m",
            "score": 1,
            "text": "How is any crypto more valuable than another crypto if they're all worthy of replacing the global financial system",
            "title_similarity": "0.6266709",
            "sentiment_compound": 0.7425
        },
        {
            "id": "gxq9z61",
            "score": 1,
            "text": "All the old cryptos always have been, too.  The new ones are no more faddish, no less useless, and no more of a pyramid scheme of speculative manipulation.",
            "title_similarity": "0.6740035",
            "sentiment_compound": -0.657
        },
        {
            "id": "gxqbxar",
            "score": 1,
            "text": "Well said.  Absolutely",
            "title_similarity": "-0.028509345",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxqenx7",
            "score": 1,
            "text": "Most MLMs aren't as devastating to the environment or PC gaming.",
            "title_similarity": "0.35901076",
            "sentiment_compound": 0.5334
        },
        {
            "id": "gxqeucf",
            "score": 1,
            "text": "What annoys me more is the \"currency\" part. Can't buy dick with dogecoin or moonshit",
            "title_similarity": "0.5490733",
            "sentiment_compound": -0.0253
        },
        {
            "id": "gxqjsbw",
            "score": 1,
            "text": "I think it’s closer to the .com bubble.",
            "title_similarity": "0.21452743",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxqjwgs",
            "score": 1,
            "text": "They are different in the business model, but the same as they are likely a poor investment of money",
            "title_similarity": "0.40731153",
            "sentiment_compound": -0.631
        },
        {
            "id": "gxqm46m",
            "score": 1,
            "text": "Shiba coin go moon",
            "title_similarity": "0.1811206",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxqyria",
            "score": 1,
            "text": "Doge coin yes is just a meme many other cryptos have to do with data. Some cryptos are even trying to work and create a decentralized currency which would be great. No transaction fees, the transactions are kept by the system and coin so no need for companies to audit it and charge crazy prices, helps smaller countries that don’t have a stable currency. Now there are a bunch of scammers that are making cryptos with what you have said so do your research because there are very many positive ones but there are just as many negative ones. If you see a influencer talking about a smaller crypto it most likely is a pump n dump but he’s trying to get people to buy in so the rest can essentially be ripped off. Mutahar on you tube has a good video where he calls out these people.",
            "title_similarity": "0.75459385",
            "sentiment_compound": -0.0113
        },
        {
            "id": "gxr0ac3",
            "score": 1,
            "text": " \n\n[https://np.reddit.com/r/WhiteFalcon/comments/n9xbq3/whitefalcon\\_presale\\_started/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/WhiteFalcon/comments/n9xbq3/whitefalcon_presale_started/?utm_source=share&utm_medium=web2x&context=3)\n\nBuy Now WhiteFalcon Coin\n\nIf you Missed Akita,Safemars Than dont miss WhiteFalcon\n\nCheck Out And Join Presale And Participate in 20000$ Giveaway",
            "title_similarity": "0.4571145",
            "sentiment_compound": 0.2033
        },
        {
            "id": "gxr14df",
            "score": 1,
            "text": "WhiteFalcon Is the Next Crypto moon\n\nJoin Telegram - @ WhiteFalconOfficial  \n\nPresale Started So Join Fast Before it ends And Participate in 20000$ Giveaway \n\nif you Missed Akita,Doge,Safemoon Than Dont Miss WhiteFalcon",
            "title_similarity": "0.67101693",
            "sentiment_compound": 0.5123
        },
        {
            "id": "gxr3gaj",
            "score": 1,
            "text": "I dunno, I treat it like gambling and thought I threw $1000 away in ETH, but it’s up to $4k now.",
            "title_similarity": "0.6264851",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxr4ego",
            "score": 1,
            "text": "Be fearful when others are greedy",
            "title_similarity": "0.40275127",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gxrcxn6",
            "score": 1,
            "text": "They're as bad as MLMs, if that's what you mean. Cryptocurrencies today have little genuine use; they're basically vehicles for speculation, the latest digital [tulip bulbs](https://en.wikipedia.org/wiki/Tulip_mania). Those pushing the schemes want new buyers to push up prices, so they can profit just before inducing a downturn in the market. If a new cryptocurrency is being pushed at all, you didn't get in early, and so you should stay away.",
            "title_similarity": "0.787773",
            "sentiment_compound": -0.0094
        },
        {
            "id": "gxryzin",
            "score": 1,
            "text": "How To Buy and token info :  MOONESTATE a brand new token is coming! \nDecentralised exclusive MOON virtual reality world.\nWe are going to live on the moon, so there is no way back!\nLet's make some money to buy a piece of it 🌔\n\n🕐Just launshed less then hour ago🕐\n\n🛡Innovative dynamic anti whale protection:\n- Under 50 holders max wallet amount - 0.5%.\n- 50-500 holders max wallet amount - 1%.\n- More then 500 holders max wallet amount - 5%\n🛡Max transaction amount - 0.5% of total supply.\n🚀Fair launch. \n✅ No Presale.\n✅ Ownership renounced.\n♨️100% Liquidity locked.\n♻️5% from transaction goes to LP.\n♻️5% from transaction back to holders.\n\n👉TG: https://t.me/moonestate\n🌐https://moonestate.xyz\n\nPancakeSwap : https://exchange.pancakeswap.finance/#/swap?outputCurrency=0xf2e0ac6b26bbf744f2044071aef5b2ccba1c7e24\n\nContract: 0xf2e0ac6b26bbf744f2044071aef5b2ccba1c7e24\n\nLP Locked:  https://dxsale.app/app/pages/dxlockview?id=0&add=0x73d9610825CD0A58067138250488C6c8B3F9B036&type=lplock&chain=BSC\n\nOwnership renounced: https://bscscan.com/tx/0xaa8d67557d28debc9ef54fb0d502482a5072cf12f599f1662d1d540743d298ba",
            "title_similarity": "0.5799389",
            "sentiment_compound": -0.5869
        },
        {
            "id": "gxt07hp",
            "score": 1,
            "text": "Wow... super interesting to see some who literally don’t understand the value or block chain technology just be like \n“MLM” “ponzi” “smoke and mirrors”. The “I don’t understand it so it must be a scam” mentality crack me up.",
            "title_similarity": "0.69411296",
            "sentiment_compound": 0.9081
        },
        {
            "id": "gxv3eyy",
            "score": 1,
            "text": "Just one i got into with safemoon. This one has a few protections against pump and dumps. The first is every transaction is taxed 10%. 5% of the tax is burned lowering the supply, the other 5% is redistributed to all other holders. \n\nBasically it penalizes high volume traders and rewards those that hodl. I put 1k in early on and im at about 20k now... Even if i lose it it was throw away meme money but its anything but a scam",
            "title_similarity": "0.70447016",
            "sentiment_compound": -0.802
        },
        {
            "id": "gxw8vu0",
            "score": 1,
            "text": "🍯HONEYROCKET ⚡️JUST LAUNCHED!!! MOONING!!!\r  \n\r  \n🐝1,000,000 HNYR\r  \n\r  \n➡️Telegram: t.me/honeyrocketfinance\r  \n\r  \n♨️ LPs BURNED\r  \n\r  \n🥞PancakeSwap: https://exchange.pancakeswap.finance/#/swap?outputCurrency=0x88877bf8d5012c161918f5a5e25d9b584b698ed2&inputCurrency=BNB",
            "title_similarity": "0.5971043",
            "sentiment_compound": 0.5269
        },
        {
            "id": "gxzcadr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gxzcu8z",
            "score": 1,
            "text": "Those memes coins aren't useful at all that why I prefer invest in projects like LINK, PMON,ADA etc.",
            "title_similarity": "0.540195",
            "sentiment_compound": 0.0243
        },
        {
            "id": "gxzypar",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gy84bt6",
            "score": 1,
            "text": "It's honestly disgraceful. I'm currently working with a team of 7 guys to change this narrative. We have a charity based crypto which originated with a basic goerli testnet. This was a springboard to a great charity based idea set to hopefully bring the idea of crypto to everyday hard working people and to crush the narrative you are talking about. It's set to begin actual development shortly. We are currently working out much of the details but once it is released, you will finally know what a truly honest small based crypto looks like. So disgraceful how people are using crypto to rip people off.",
            "title_similarity": "0.78794867",
            "sentiment_compound": 0.9598
        },
        {
            "id": "gz5p2ju",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gz65k0p",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "gzcy3k1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03816454"
        },
        {
            "id": "h0rjckr",
            "score": 1,
            "text": "Different type of scam. The cryptos are more like naturally occuring ponzi schemes.",
            "title_similarity": "0.5617383",
            "sentiment_compound": -0.228
        },
        {
            "id": "h1ia9g6",
            "score": 1,
            "text": "0xd97743f07cd903fabbc7f87616d4e549274441c5",
            "title_similarity": "0.2747439",
            "sentiment_compound": 0.0
        },
        {
            "id": "h66r7jq",
            "score": 1,
            "text": "I am building a decentralized malware detection network. I am finalizing my white paper now and I am building a very involved community. Anyone interested in joining from a dev or investment interest we would love to have you. We have a discord https://discord.gg/R92rAQVN\n\nAs well as a twitter netxforce!!!!",
            "title_similarity": "0.6570952",
            "sentiment_compound": 0.8877
        }
    ]
}