{
    "CMV: The body positivity movement is a failure and always will be, because it says that \"everyone is beautiful\" when it should say \"your worth is not dependent on beauty\".\nHistorically, Western women's worth was tied to their beauty, because according to society their role inife was to attract a good man, marry him and make him happy. The problem is that even after women started  being recognized as equal to men and entered the workforce, their beauty continued to be unjustly tied to their personal worth  in a way that's just not true for men. (Consider the much harsher standards of physical appearance that female politicians have to endure.) \n\nThe modern body positivity movement reacted to this problem by trying to expand the definition of beautiful, and telling everyone that they are attractive. Instead, it should have told women \"your attractiveness is irrelevant, your intelligence, courage, and skill are what matter.\" I don't worry about my appearance too much besides dating, health, and basic hygeine, and I think my life is better off for it.\n\nExpanding the definition of beautiful isn't wrong, but it seems impossible to me. I get that beauty standards are subjective and have changed before, but that evolution has always been organic. I don't think Instagram influencers and activists are going to change people's perceptions of what bodies are beautiful, but they could make a difference by admitting that physical beauty is a worthless goal.\n\nNow you might be thinking, \"body positivity isn't about changing cultural expectations, it's about helping individuals accept themselves\". But I'd argue that self-worth is always based, at least to a point, on social feedback. Humans are social creatures, and I am never going to be able to think of myself as attractive if other people (especially the ones I'm attracted to) don't treat me that way. \n\nHow can you possibly convince someone who's overweight and struggling to find a date that they are just as attractive as a supermodel, when the actions of the people around them tell them the exact opposite? You can't. What you can tell them is this: You are not as attractive as a supermodel, but you have other good qualities.\n\nTo sum up, body positivity asserts that everyone is equally beautiful in tbeir own way, but the truth is that some people are more attractive than others, and that's okay, because your physical beauty doesn't define you.\n\nEdit: To clarify, I'm not against body positivity in general. What I'm trying to say is that it is less effective that it could be, and it would be better to acknowledge that attractiveness is pretty much worthless. I'm arguing against the strategy, not the desired outcome.\n\nEdit 2: When I say attractiveness is worthless, I mean that it is worthless to society, not to the attractive person. Obviously being seen as attractive comes with personal advantages, but (a) telling people they are attractive does not confer those advantages unless everyone believes you and (b) it does not benefit other people in the same way that intelligence, courage, kindness or countless other virtues do.\n\nEdit 3: Thank you to everyone who commented, I'm going to bed and I'll see how many comments I can get to in the morning.": [
        {
            "id": "gxwisj4",
            "score": 1,
            "text": "/u/matt846264 (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nazopp/deltas_awarded_in_cmv_the_body_positivity/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.41899255",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gxwk83g",
            "score": -9,
            "text": "\"You are not as attractive as a supermodel, but you have other good qualities\"\n\nImagine having a friend tell you this and they actually think they're giving you a compliment. I'd set that person on fire.",
            "title_similarity": "0.7309135",
            "sentiment_compound": 0.9117
        },
        {
            "id": "gxwmwp4",
            "score": 5,
            "text": "If being fat was beautiful you wouldn’t have to say it. People would just inherently know your beautiful but your not.\n\nI know beauty is subjective but no one is calling anyone on the “my 500 lbs life” beautiful,",
            "title_similarity": "0.72838426",
            "sentiment_compound": 0.5175
        },
        {
            "id": "gxwodo5",
            "score": 0,
            "text": "Let fat people believe they are healthy. It’s free comedy",
            "title_similarity": "0.4684663",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gxwve2f",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07498749"
        },
        {
            "id": "gxwp0dh",
            "score": 2,
            "text": "Also it encourages an unhealthy lifestyle people will literally die from",
            "title_similarity": "0.5403184",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gxwaj8p",
            "score": -10,
            "text": "Body positivity movement was created for burn victims, people disfigured from accidents, people/veterans missing limbs etc. \n\nThat's what Body Positivity started off as to help people and encourage people to be comfortable in their own SKIN/BODIES. (Permanent changes that cannot be reversed)\n\nNot fat people, not ugly people etc. Body positivity was a genuine cause that got hijacked by losers.",
            "title_similarity": "0.69970393",
            "sentiment_compound": 0.9287
        },
        {
            "id": "gxw96rx",
            "score": -5,
            "text": " >To sum up, body positivity asserts that everyone is equally beautiful in tbeir own way, but the truth is that some people are more attractive than others, and that's okay, because your physical beauty doesn't define you.\n\nCMV: This is the only thing you should have posted because everything else you wrote sounds like you pulled it out of your arse.",
            "title_similarity": "0.8629143",
            "sentiment_compound": 0.9707
        },
        {
            "id": "gxwdhqv",
            "score": 2,
            "text": "I agree that a movement that says \"everyone is beautiful\" is a failure. If everyone is beautiful, then as a result, no one is beautiful either. There simply would not be any category for being beautiful. \n\n>The modern body positivity movement reacted to this problem by trying to expand the definition of beautiful, and telling everyone that they are attractive\n\n. That being said, you mix up beauty and attractiveness. Some people feel attracted to very overweight or very old people and these people are in most cases not beautiful but they simply feel attracted to them. On the other side, people are not necessarily attracted to someone they'd consider to be beautiful.",
            "title_similarity": "0.8749861",
            "sentiment_compound": 0.9642
        },
        {
            "id": "gxwtavv",
            "score": 3,
            "text": "It’s also promotes very unhealthy lifestyles.",
            "title_similarity": "0.41799858",
            "sentiment_compound": -0.3167
        },
        {
            "id": "gxwvisw",
            "score": 2,
            "text": "People who say everyone is beautiful are the most patronizing disingenuous fucks around.",
            "title_similarity": "0.692058",
            "sentiment_compound": 0.1372
        },
        {
            "id": "gxwvvo5",
            "score": 1,
            "text": ">everyone is beautiful\n\nIs a lie. \n\n>your worth is not dependent on beauty\n\nIs also a lie(at least partially).\n\nWhy does accepting objective reality is so difficult?",
            "title_similarity": "0.7491406",
            "sentiment_compound": 0.2702
        },
        {
            "id": "gxxeub6",
            "score": 3,
            "text": "I don't wanna delve too deep because I don't wanna lose too much karma after saying this, but one thing to keep in mind is WHY we find thinner people more attractive. Its biology. People assume that we have evolved far past our ancestors, but thats not true. We have a lot of biological triggers that we go for because that's what helped us survive. Someone who is thinner is more healthy, and more likely to survive, and thats how its been for centuries. The body positivity movement is trying to go against years of evolution, and I agree that this isn't the way we need to be going. I'm going to be stoned for saying this, but being fat is not healthy and we should not celebrate that and I think thats the way we should be more moving towards. Less acceptance of life threatening behavior, and more acceptance of getting people the help they need. There is disgust against overweight people from many, but there isn't a lot of people that are willing to be there and help them become healthy. And when you work hard on something like losing weight, damn that shit feels good. And you can totally be proud of yourself and boost your self confidence",
            "title_similarity": "0.7347811",
            "sentiment_compound": 0.9657
        },
        {
            "id": "gxw8un0",
            "score": 1567,
            "text": "The problem is that \"your worth is not dependent on beauty\" isn't a good counter to people that have been told all their lives \"your worthless because you're ugly\".  You can't counterbalance that kind of message with indifference telling them \"Well, those people who said you're worthless are wrong... you're not worthwhile or worthless!\".\n\nIf half the people say \"You suck because you're ugly\" and the other half of people are saying, \"I'm indifferent to ugliness\" it still nets out to a very negative experience.\n\n> who's overweight and struggling to find a date that they are just as attractive as a supermodel\n\nI think you've made a mistake a lot of people do about how successful the body positivity movement is.  I agree that if body positivity was the ONLY viewpoint out there, that it is unnecessarily positive.  But the reality is you're dealing with people that have been shamed their whole lives and made to feel worthless.  And that shame has gone way past the point where it could be helpful and is to the point where it is counterproductive because it isolates people and can often even make them turn to more eating for comfort.\n\nHaving a small community that say, \"You know what? You're big and I love that about you\" doesn't make overweight people suddenly forget that there is a whole world of ridicule waiting for them in the outside world.  But it does help them stand up against the sometimes unbearable pressure of shame they might face the next day.  Even if it is just one person they can tell themselves, \"Well, Jeff thinks I'm big and beautiful, to hell with what everyone else thinks\".  Don't worry, they'll still feel PLENTY of shame, but this is about giving them some degree of acceptance to help lessen that overwhelming shame.",
            "title_similarity": "0.7919227",
            "sentiment_compound": -0.934
        },
        {
            "id": "gxw7f47",
            "score": 3,
            "text": "Doesn't being beautiful in the \"everyone is beautiful\" sense include things like \"being beautiful on the inside\" or \"having a beautiful personality\". Aren't we already in the realm of \"things besides physical beauty matter\" realm when we invoke \"everyone is beautiful\"? \n\nAlso, even that aside, isn't body positivity about being happy with whom is in the mirror, which isn't inherently interpersonal? The beauty being preached is entirely self assessed and quite often not even physical in nature.",
            "title_similarity": "0.7681594",
            "sentiment_compound": 0.9777
        },
        {
            "id": "gxwjsxx",
            "score": 0,
            "text": "Saying beautifull to me had absolutley no meaning towards physical appearence.",
            "title_similarity": "0.5112002",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxwtppi",
            "score": 0,
            "text": "Edit: my wording near the end was not as clear as intended so I've rephrased what I meant by \"every person's healthy body is beautiful\".\n\n\n\nThe movement fails for a simple reason.\n\nWe should be encouraging people to love themselves for who they are AND that loving yourself means taking care of yourself.\n\n[You can be big and still be active and healthy\n](https://www.reddit.com/r/BeAmazed/comments/bfk2vb/big_boy_can_break_dance/)\n\nThe problem is body shaming made people hate themselves and take on unhealthy habits as a result.\n\nThis new movement is trying to change the self hate but with the wrong message being delivered.\n\nLoving yourself is important.\n\nBut loving yourself means taking care of yourself and your health.\n\nIf your a big boned or thicc person there's nothing wrong with that, love yourself and do not change but there's a huge difference between being naturally big and eating yourself to being big.\n\nEvery person's HEALTHY body is beautiful.\n\nYour natural body.\nIf you have or are born with a condition it is also a part of what makes you, you.\n\nNothing you're born with makes you unbeautiful.\n\nAnd loving yourself enough to take care of yourself? Well thats just damn sexy.\n\nBut obsessions like over and undereating to make yourself thin or huge?\n\nPutting your body through stress and sickness from forced diets to try to adhere to what another person's standard of beauty is especially when beauty and perfection are by definition an opinion and change from person to person therefore making it impossible to achieve by any other definition than your own and what you deem to be \"perfect\".\n\nEvery person's version of perfection is different and guaranteed you are perfect to many people just the way you are.",
            "title_similarity": "0.8359431",
            "sentiment_compound": 0.9982
        },
        {
            "id": "gxwudq6",
            "score": 0,
            "text": "Your right the acceptance of one where they let themselves be worse then they could possibly be namely in fitness where it impacts so many other aspects of day to day life literally a movement of gluttony and self pride could be corrupted easily to the point the vocal minority has bullied doctors to be unable to help in a variety of ways",
            "title_similarity": "0.7478217",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gxwys5o",
            "score": 0,
            "text": "sooooooo braaaaaaavvvvvvvv",
            "title_similarity": "0.22980224",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwzinz",
            "score": 0,
            "text": "My issue is telling people that being overweight is healthy. I have no problem with people being overweight. Im overweight. But it is Proven over and over again that obesity causes a laundry list of health issues.",
            "title_similarity": "0.64891326",
            "sentiment_compound": -0.1952
        },
        {
            "id": "gxx17jc",
            "score": 0,
            "text": "I hate the normalization of actually unhealthy traits. While I agree you shouldn't be bullying and being rude to fat people, you definitely shouldn't be encouraging their lifestyles",
            "title_similarity": "0.67248917",
            "sentiment_compound": -0.6736
        },
        {
            "id": "gxx6ets",
            "score": 0,
            "text": "You’re wrong, but not for the reason you think. The body positivity movement not because they tried to move the goalpost for what is considered conventionally beautiful, but because of internalized misogyny that pushes curvy as beautiful but shames women who are skinny. Inherent in the whole “fat is beautiful” messaging is the idea that “skinny is ugly.” You can see this in the way social media celebrates women’s bodies differently. Fat women are celebrated. Skinny women are attacked.",
            "title_similarity": "0.82211465",
            "sentiment_compound": 0.962
        },
        {
            "id": "gxx9h8s",
            "score": 0,
            "text": "The two are not mutually exclusive, you can be beautiful while simultaneously not having your worth be judged by that beauty.",
            "title_similarity": "0.62222886",
            "sentiment_compound": 0.7693
        },
        {
            "id": "gxw8v44",
            "score": 6,
            "text": "Which branch of their movement?\n\nAre you assuming the whole movement is like this? If so, based on what?\n\nAdvocating acceptance isn't the same thing expanding the definition of beauty. Nor is it telling everyone that they're attractive. It's that people, and society, need to accept people for how they are. And, to focus on all those positive traits you've listed.\n\nBut, like every movement (Feminism or BLM for instance) you get people trying to say what the movement is about based on a single branch.  Does it seem rational to assume the whole movement is the sum of a few?",
            "title_similarity": "0.77513564",
            "sentiment_compound": 0.9247
        },
        {
            "id": "gxwe962",
            "score": 1,
            "text": "Is it wrong that I've viewed it as an over consumption problem? Everyone has a different metabolism so we need to adjust, eat enough and try not to over consume. I struggle with it myself as I'm getting older I don't need to eat as much anymore and I still eat like I'm 20 sometimes.",
            "title_similarity": "0.5775565",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gxwhr1v",
            "score": 1,
            "text": "I think \"beauty\" is a very subjective concept. We all have potential, and so I think we could say that we are all beautiful. But I also see what you mean by the idea that the movement could still lead to an unhealthy obsession with beauty and it can be difficult to redefine beauty in a meaningful way and yet still have it relate to something we'd consider to be beautiful. Δ",
            "title_similarity": "0.80150986",
            "sentiment_compound": 0.9274
        },
        {
            "id": "gxwitrm",
            "score": 1,
            "text": "So are you willing to create a now solid definition of what “ugly” is. Shit like that varies with time and culture. Even if it wasn’t, are you willing to give bullies the ammo to use on a kid with “you’re objectively ugly. Like, even society agrees on this”\n\nCan you imagine how damaging that will be?\n\nHow do you know you’re whole, “but your value as a person isn’t dependent on being beautiful” won’t come off as equally patronizing?",
            "title_similarity": "0.76001906",
            "sentiment_compound": -0.168
        },
        {
            "id": "gxx2bal",
            "score": 1,
            "text": "OP really just said you’re ugly but that’s okay",
            "title_similarity": "0.49511132",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gxx4xdz",
            "score": 1,
            "text": "Being obese isn’t a good thing, sorry.",
            "title_similarity": "0.4178364",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxx9h30",
            "score": 1,
            "text": "My problem with the body positivity movement is that it encourages people to not even try. Be happy with what you cant change about yourself, but everyone should strive to be the fittest and healthiest version of themselves they can be.",
            "title_similarity": "0.802472",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gxxh57k",
            "score": 1,
            "text": "Being overweight is dangerous and unhealthy. It puts you in the high risk category for Covid, as well as a number of other potentially life altering and fatal ailments. What is the meaning of \"value\" if it is not dependent on actual attributes which effect the quality of one's lived experience as well as the output one is capable of. Being overweight literally reduces your value, by the definition of the word, as a human when weighed in absolute measurements.",
            "title_similarity": "0.62566006",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gxxnkhc",
            "score": -1,
            "text": "The OP is an idiot and the entire argument is based in nothing historical or rational. There, problem solved.",
            "title_similarity": "0.5424",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gxxoztk",
            "score": 1,
            "text": "I’m seeing a lot of answers that are basically saying “Yes, people shouldn’t rely on beauty, but since they do anyway we should coddle them to make them feel better” \n\nInstead of learning to be self-reliant, we’re encouraging others to create a dependency on positive feedback.",
            "title_similarity": "0.7119404",
            "sentiment_compound": 0.9387
        },
        {
            "id": "gxxujmc",
            "score": 1,
            "text": "It should be \"not everyone is beautiful, and that's ok\"",
            "title_similarity": "0.44986802",
            "sentiment_compound": -0.4847
        },
        {
            "id": "gxy7rev",
            "score": 1,
            "text": "Most probably offtopic, but: body positivity simply sucks, it's one huge bull... load.\n\nI never understood why the 'body positivity' movement is promoted mostly around overweight people (I have nothing against them). What about disabled people? what about midgets/dwarfs?\n\nI am fat - ok. I am just as beautiful/attractive/handsome as a Victoria's Secret model. I might believe that.\n\nI am missing both my legs. Ok, am I just as  beautiful/attractive/handsome as a Victoria's Secret model? I don't believe that crap.\n\nThe only thing 'body positivity' does, is focus on your appearance, instead of telling you bluntly: welp, you're ugly, there's no fixing that. But, you can always be smart, it's never too late for that.",
            "title_similarity": "0.7342516",
            "sentiment_compound": 0.9065
        },
        {
            "id": "gxylg49",
            "score": -1,
            "text": "I had a long detailed response, but honestly it’s so hard and irritating to keep explaining this to everyone. If you don’t get it, research it. Ask an array people what that body positivity movement has done for them. I feel like the OP just wanted to argue instead of having a view changed.",
            "title_similarity": "0.6587934",
            "sentiment_compound": 0.4879
        },
        {
            "id": "gxwd7wc",
            "score": 84,
            "text": "The flaw in this construct is that it dismisses beauty standards rather than reframing or expanding them, which can’t work for most people as they have a deeply internalized belief that beauty *does* matter. It’s not just external either, they probably notice *others* and consider them beautiful or ugly, so to say “beauty standards don’t matter for your worth” is an incoherent idea when the person being spoken to is still using beauty standards to judge *others’* worth. \n\nTake it from a former fat person: fatphobia is just as prominent among fat people as it is among skinny people. There is a tremendous amount of self-hatred that is projected onto others, which in turn feeds their own self-hatred. It’s a vicious cycle. \n\nSo you can’t say “beauty doesn’t matter”, as that will be received as a bold-faced lie. Beauty *does* matter, otherwise the idea of beauty wouldn’t occupy so much thought and discourse. The relevant question here isn’t whether it matters or not, it’s what defines beauty and what it means. \n\nConsider the idea of having a “type”. There are countless men out there who *prefer* heavier women as sexual partners, it’s *more* attractive to them. So to say “you are not as attractive as a supermodel” begs the question - attractive to who? To you? To the editors of fashion magazines? \n\nIf I were to tell Kendall Jenner “you’re not as attractive as a heavy woman, but that’s okay, because you have other good qualities” would that not be plainly cruel and misleading even if I’m saying my personal truth? Who are we to be arbiters of what is beautiful and what is not when beauty itself isn’t a concept that can be objectively defined? \n\nIf you acknowledge the idea of a beauty hierarchy, especially on a skinny-fat continuum, but say it *personally* shouldn’t matter...you still get men who are attracted to fat women but don’t date them because they’re afraid of the way it would be perceived, same with women and fat men. You still get people who adopt eating disorders to pursue an acting or modeling career. You still get children who are afraid to go to school because others will regard them as ugly. \n\nIn others words - it’s not a solution. It’s a dismissal of the problem.",
            "title_similarity": "0.84996057",
            "sentiment_compound": 0.9805
        },
        {
            "id": "gxwm83b",
            "score": 2,
            "text": "Women being valued for their youth and beauty is not a \"western\" thing, it is universal, and it is very much still with us regardless of what lip service is paid otherwise.  And looks aren't something exclusive to females. Telling unattractive people that looks don't matter is very condescending and unhelpful when it is clearly untrue for anyone who's ever socialized with others.\n\nIn terms of \"body positive\", I think the push is more to accept obesity. This won't work because obesity is objectively bad, and usually suggestive of poor health and a slew of risk factors. It's unfortunate that some people have to work harder to maintain a health weight, and for some it is almost impossible, but the benefits of doing so extend far more beyond superficial appearance.",
            "title_similarity": "0.85488546",
            "sentiment_compound": 0.7703
        },
        {
            "id": "gxwxhi6",
            "score": 2,
            "text": "the issue with bodypositivity and loose movements like that is: the loud obnoxious ones always get the pole position. Body positivity should be about inherent worth, yet its championed by unhealthy people like Tess Holiday and other healthy at all sizes people. No youre not healthy at all sizes.",
            "title_similarity": "0.7921708",
            "sentiment_compound": 0.5635
        },
        {
            "id": "gxx8kle",
            "score": 2,
            "text": "Do ugly guys really get more pass than ugly girls?  Who's setting this \"standard of physical appearance\"?  \n\nThe truth is, AGE is the limiting factor because women will run out of eggs while men can still ejaculate geriatric sperms.  That is where root of all unfairness we see manifested at the surface.  In an alternate reality where men becomes sterile after 18 you can easily imagine that world to have all men married off young or have their seeds preserved and single older men are all laborer incapable of finding mate if she wants to rear a child no matter how handsome or rich he is.  Or that civilization will have a portion of older men raising other boys' children.\n\nWhich segue into the fact that physical appearance is directly related to age, which creates this mirage that seems like women's physical beauty is the question at hand when it's not.\n\nGuys don't want to go after girls they find ugly, no problem.  Neither do girls have to pay any attention to guys they find ugly.  That includes body weight, be it over or under.\n\nI don't subscribe to the \"body positive\" movement as: \"fat is beautiful too\", that is the result of terrible messaging at best, or a bad faith caricature at worst.\n\nIt should have never been: \"it's how you look\" it should always be: \"it's how old you are\" and since men gets that huge biological advantage what can you realistically do.  (I'll include here that older men's geriatric sperm of course don't provide the ideal odds for a healthy baby but still it's better than running empty.)",
            "title_similarity": "0.82768047",
            "sentiment_compound": 0.896
        },
        {
            "id": "gxwscir",
            "score": 3,
            "text": "Worth is not dependent on anything.\n\nBody positivity is about rejecting standards of beauty that are generated outside of self and embracing self created beauty. Beauty is generated from within not an outside set of standards one needs to conform to. \n\nBeauty is about celebration and self acceptance. Beauty is an intimate relationship you have with yourself that you can share with others.\n\nIf other ppl evaluate your beauty that is a reflection about how they feel about themselves.",
            "title_similarity": "0.7696531",
            "sentiment_compound": 0.9851
        },
        {
            "id": "gxx4p4u",
            "score": 3,
            "text": "The body positive movement is a success.\n\nMy children see people of all shapes and sizes in movies and on television.  The fat kid isn't the butt of an endless stream of lazy jokes.  Body size isn't just accepted as a personal failure.\n\n10 year olds shouldn't be on diets so they can feel worthy of love.  Athletic, healthy people shouldn't either.",
            "title_similarity": "0.6901942",
            "sentiment_compound": 0.9097
        },
        {
            "id": "gxwbm14",
            "score": 29,
            "text": ">I don't worry about my appearance too much besides dating\n\n\"I don't worry about my appearance too much besides finding love and affection, aka something that many people consider to be one of the most important parts of their lives and which many people are afraid of never finding because they've been repeatedly told that their appearance is disgusting and wrong.\"",
            "title_similarity": "0.82679343",
            "sentiment_compound": 0.7909
        },
        {
            "id": "gxwaqpb",
            "score": 772,
            "text": ">The body positivity movement is a failure and always will be, because it says that \"everyone is beautiful\" when it should say \"your worth is not dependent on beauty\".\n\nI think it's hard to describe the body positivity movement as a failure. US culture around beauty has changed drastically in the last decade.\n\nI've been watching old seasons of America's Next Top Model recently and the difference is shocking. Obviously that's a show all about being conventionally attractive, but even with that lens it's easy to see the differences.\n\nThey frequently have people on the show they call \"plus size\" models only because they sort of have an ass. Models, all of whom are rail thin, are congratulated when they lose weight on the show.\n\nThat would never happen now. I'm sure it happens backstage, but you would never hear any television personality go on TV and talk about beauty in the way they do on the show.\n\nWhen I'm shopping online, I consistently see larger models modeling clothes. Brands are shamed if they don't make clothes in certain sizes and they apologize when called out.\n\nI don't think the body positivity movement has accomplished all its goals, but it seems like it has drastically changed the conversation around beauty.\n\nThat's why there are so many people online mad about the body positivity movement, because it's a real part of the world now and some people disagree with it.\n\n>To sum up, body positivity asserts that everyone is equally beautiful in tbeir own way, but the truth is that some people are more attractive than others, and that's okay, because your physical beauty doesn't define you.\n\nI think you are sort of missing the point of the body positivity movement. We were born into a world with a ridiculous amount of open disgust for fat people.\n\nI remember finding girls attractive when I was in high school, but not being interested in talking to them because they were too overweight. It wasn't that I wasn't attracted to them, it's that I didn't think they were attractive.\n\nThat's an important distinction. I was physically attracted to them, but mentally I didn't label them as attractive because they didn't fit my model of what \"attractive\" meant.\n\nI was ashamed of my stomach until I started dating someone who was happy I have a bit of a gut and was/is disappointed when I started dieting because they find a few extra pounds really attractive.\n\nPart of the body positivity movement is recognizing that there is no one standard for what people find attractive.\n\nOne of my friends has exclusively dated girls who are short and chubby. It's crazy. All his girlfriends look exactly the same in a dim room. Same hair, same height, same body.\n\nThat's clearly his type. It isn't society's favorite type, but it's his.\n\nYes, there is a societal standard of beauty, but that standard will change.\n\nThere was a long time in America where being tan was considered unattractive, then that entirely flipped. \n\nThere was a long time where being thin as a board was the hottest thing for women. That's not true now. Now our culture want a fat ass and curves.\n\nPart of the idea of body positivity is saying that every body is beautiful in its own way as a way of pushing back against a single societal standard.\n\nHonestly, this has somehow worked on me. I think of different people as hot for different reasons.\n\nI don't think this is the norm. I think that our societal standards of beauty are still in play, but they've shifted drastically in the last ten years and they are still changing.\n\nI think it's too early to call the movement a failure. It's been working really well for a long time, I anticipate it will continue to influence American culture over the next decade.",
            "title_similarity": "0.87113464",
            "sentiment_compound": 0.9975
        },
        {
            "id": "gxxfqny",
            "score": 7,
            "text": "Attractiveness being worthless is fantasy. Physical attractiveness determines a great deal of your options in life. Even your day to day interactions with strangers vary tremendously based on attractiveness (for better or worse people pay more attention to you if you're attractive and actively try to interact with you). Regardless of everything else this statement you added couldn't be further from the truth and it's childish to think so.",
            "title_similarity": "0.8138324",
            "sentiment_compound": 0.9269
        },
        {
            "id": "gxw72kb",
            "score": 22,
            "text": ">I don't think Instagram influencers and activists are going to change people's perceptions of what bodies are beautiful...\n\nI have seen data that suggests exposure to images of bigger bodies actually does change these perceptions.\n\nThis is the first study that came up in my quick search: [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5990741/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5990741/)\n\n\"In conclusion, our results put forward a strong public health message that increasing the number of normal and larger women in the media may reduce levels of body dissatisfaction in the population, and thus would have the potential to reduce rates of weight gain, obesity and eating disorders.\"",
            "title_similarity": "0.63267887",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gxw7zxo",
            "score": 41,
            "text": "> I get that beauty standards are subjective and have changed before, but that evolution has always been organic. \n\nWhat do you mean, here?  I can think of plenty of examples where a single high profile person or a small group of people had a huge influence over whether or not people thought something was attractive.  Jennifer Aniston made people think THE RACHEL was attractive.\n\n> But I'd argue that self-worth is always based, at least to a point, on social feedback. Humans are social creatures, and I am never going to be able to think of myself as attractive if other people (especially the ones I'm attracted to) don't treat me that way.\n\nYou're starting somewhere reasonable \"self-worth is always to a degree based on social feedback\" and then extrapolating to an unreasonable conclusion: \"No one should think of themselves as attractive unless they receive A LOT of feedback that it's true from A LOT of different people.\"\n\nBecause the message is, \"Every body type is *potentially* beautiful.\"  To some people, under some circumstances.  And you're trying to say that somehow doesn't count unless it reaches some arbitrary threshold of enough people digging you.\n\nPulling back, you don't actually say this, but a lot of your post reminds me of a sentiment I've seen expressed  a lot, where people have this strong discomfort with the idea that something like attractiveness isn't objectively rankable.  It's like, they'd rather KNOW they're ugly than to have it be ambiguous what ugliness really is.  But that's impossible.  This shit's vague.  No way around it.",
            "title_similarity": "0.82668966",
            "sentiment_compound": 0.9813
        },
        {
            "id": "gxxbwz5",
            "score": 43,
            "text": "It's important here to understand how intellectualizing this issue divorces one from the experience of it. The experience of being made to feel worthless because of your weight is far more than intellectual; it's a felt experience ingrained in habits, emotive responses, AND conscious thoughts.\n\nPsychological approaches that only deal with reprogramming thought do not adequately treat the former. You can't just talk yourself into feeling better about self-worth, because self-worth is a felt thing. Similarly to how you can't talk yourself into falling in love with someone.\n\nThe body positivity movement focuses far more on the felt-experience of self-acceptance; allowing yourself to feel beautiful, something you've been deprived of for most of your life, is far more powerful for a person deprived of that thing than the intellectual exercise of dispelling physical ideas of worth as a whole.\n\nRemember that ideas of worth are FAR more than just our intellectualized ideas of them. They're embodied ideas that extend far beyond us and impact us in ways beyond thought. Someone may put in the work of rejecting physical traits as bases for worth, but they're inevtibly going to exist in a world that continues to tell them otherwise for the rest of their life.",
            "title_similarity": "0.7822658",
            "sentiment_compound": 0.8752
        },
        {
            "id": "gxw9g9r",
            "score": 389,
            "text": "I find the idea that beauty standards have always changed organically to be hilarious. Ads have changed our beauty standards for a lot longer than the internet or the body positive movement has been around. You can literally trace the history of underarm and leg shaving in the United States back to specific ad campaigns that came out in Harpers Bazaar in the early 20th century. \n\nKnowing that advertisements are perfectly capable of restricting beauty standards, it seems logical that they can be capable of expanding them too. I don’t see anyone except speciality tumblr bloggers claiming that fat is actually healthy, only that you’re still a valid and worthy person even if you’re fat. And when people feel like they are worth it, they’re more willing to work on themselves.",
            "title_similarity": "0.74718213",
            "sentiment_compound": 0.9885
        },
        {
            "id": "gxwfpuw",
            "score": 76,
            "text": "Your framing is completely wrong.\n\nThe body positivity movement did not start out as some feel-good session for ugly women. Body positivity was about scarred and disfigured people, and not allowing themselves to be defined by what they had lost.\n\nI don't think people can really appreciate the damage scars can do. I've never considered myself all that attractive, and I've generally preferred to keep my shirt on because there's not a lot of muscle to show. Now, there's not only the guilty paunch of a man who'd rather be drinking beer than lifting weights, but there's also a significant amount of scar tissue.\n\nThose surgical wounds did little for my self-esteem, especially when factoring in the other consequences of my operation. The drive home was enough to leave me in agony, I couldn't walk the dog because doing a lap of the housing estate broke me, and food I used to enjoy now made me violently sick. Because the surgery had altered my digestive tract I suffered from irritable bowels, which also made me paranoid about leaving the house in case I'd soil myself.\n\nI am fortunate in that the worst of my symptoms passed with time, and I don't mind the scars anymore. But it means that I have some inkling of what it might be like to go through something worse - something that won't heal.\n\nYou don't always get better - I didn't, not back to where I began. But I can easily hide my scars, internal and external. Body positivity was meant to be for the people who can't do that - whose suffering is on display for the world to see, and for whom their 'new normal' is a marked deviation from what they had. Lost limbs, severe facial scarring, mastectomies; the kind of injury that makes people stop and stare. The kind of injury that not only upends your day to day life, but also completely changes how the world looks at you.\n\nIt's not about beauty, and it never was - it's about helping people understand that they are not a freak. They are not a one-breasted woman, or a skin graft. They are a person, and they can learn to love themselves again.",
            "title_similarity": "0.7916262",
            "sentiment_compound": -0.9894
        },
        {
            "id": "gxwfd0g",
            "score": 12,
            "text": "FWIW, it is not true that women’s roles historically were to marry a man and keep him happy.  Happiness was beside the point until the late 19th century.   Upper class women married for dynastic reasons.   Lower class women married to provide labor and to have children who would provide labor.   Love, sex and attractiveness were utterly irrelevant to marriage s, most of which were de facto arranged.",
            "title_similarity": "0.82674515",
            "sentiment_compound": 0.8949
        },
        {
            "id": "gxwfbxc",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.096666336"
        },
        {
            "id": "gxwhn41",
            "score": 3,
            "text": "I think it's really hard to deny that we as human are drawn to the aesthetics of things, and I think body positivity strives to expand what we view as beautiful. I think caring less about beauty is good too, but it can be attacked from both ends, let's widen our definition of beauty and acknowledge that beauty isn't everything.",
            "title_similarity": "0.7781781",
            "sentiment_compound": 0.9411
        },
        {
            "id": "gxwlchz",
            "score": 2,
            "text": "Well you know on the one hand I agree some people are just blessed with smokin' hot bods.\n\nBut I think you'd be surprised how often you can do alot with alittle. Also if you feel unattractive, try exercising regularly - it doesn't have to be a triathlon, a walk will do. Also consider asking for advice about your haircut, makeup or cosmetics from someone who seems knowledgeable. With a bit of effort, you can bump yourself up 2 or 3 points like that.\n\nYou can be f\\*ck-ugly and still do alright, especially if you do the physical stuff and can be funny or interesting.\n\nBecause yes while it's true, with some people it's just \"daaaaammnnn\", I also think ugly people should still f\\*ck. And that means relaxing and wearing cool clothes and also not always going after the most attractive guy/gal and immediately getting discouraged when s/he isn't interested.\n\nI respect anyone trying to hitting out of their league, but don't freak out if it doesn't work, and consider connecting with other less conventionally attractive people.\n\nBecause personally, I think everyone's got a bit of \"beauty\" to use. Even f\\*ck ugly people can use their weird features to their advantage.",
            "title_similarity": "0.67098486",
            "sentiment_compound": 0.9831
        },
        {
            "id": "gxwld1c",
            "score": 1,
            "text": "Your premise is flawed. The body positivity movement doesn’t try to expand the societal definition of beauty, but rather, it tries to decouple societal standards of beauty from self-worth.",
            "title_similarity": "0.7475166",
            "sentiment_compound": 0.8537
        },
        {
            "id": "gxwog40",
            "score": 4,
            "text": "A lot of these responses are strictly about fat vs. thin but the body positivity movement has also helped people appreciate certain traits that used to be considered unattractive or at the very least “non-traditional.” The more obvious examples are things like vitiligo or poliosis. The less obvious include height (with woman over a certain height being considered *too* tall), curly and natural hair, or a Roman/aquiline nose and similar “strong features”. \n\nI have two of these: poliosis (I always called myself a low rent Rogue) and a Roman nose. It used to be that people would encourage me to dye my hair streak and think getting a nose job was *probably* a good idea. Now people say don’t you dare dye your hair streak and why would you want to change your nose? I never tied my looks to my self worth and nobody has ever called me unattractive (at least to my face) BUT I was still hyper critical of myself. The movement has normalized embracing what makes us unique instead of editing it. It has helped me accept those things I used to hate about myself and stop being so damn critical. For me, that’s a win, and I’m not alone.",
            "title_similarity": "0.6861117",
            "sentiment_compound": 0.9202
        },
        {
            "id": "gxwphl7",
            "score": 1,
            "text": "I’m only arguing on the particular statement/view that attractiveness is worthless. Attractiveness is an extremely valuable asset. It has been proven time and again that attractive people have many advantages in life based solely on their physical beauty. Both in the ability to attract romantic partners, friendships and procure business opportunities. Aesthetics are an important metric of which we value things, unfortunately human beings included.\n\nNow I’m not particularly for body positivity in all it’s forms either as I feel like there are risks in minimising or denying the health consequences involved with weight gain that could lead to more harm. But I don’t think body shaming is healthy either and some form of balance needs to be struck to maximise the potential for a healthier society but also not unhelpfully berating people for being in the body they currently inhabit. The body positivity movement is at least a genuine effort to address the former.",
            "title_similarity": "0.8438945",
            "sentiment_compound": 0.9697
        },
        {
            "id": "gxwqrp5",
            "score": 13,
            "text": "The most striking part of your post to me was where you said that “your attractiveness is irrelevant, your intelligence, courage and skill are what matter.” Just like how humans have a different range of what we consider beautiful, we also have a different range when it comes to intelligence, skill and courage. Not everyone has the same intelligence nor are we all capable of having the same intelligence. The same goes for courage and skill. Not everyone has the skill to play fighting games for example. So are we to shit on people that don’t match the new standard for intelligence, skill and courage? How is that going to help anyone? It’s better to say that everyone is relevant no matter what their qualities. That the content of their character is more important than these other unimportant aspects that for the most part, can’t be controlled. I think your post is much worse and more harmful than simply saying, everyone is beautiful.",
            "title_similarity": "0.7494144",
            "sentiment_compound": 0.9911
        },
        {
            "id": "gxwuz8f",
            "score": 1,
            "text": "Physical beauty isn’t a worthless goal. There’s been studies to show attractive people make more money and live happier lives. Now while beauty isn’t everything and you can be happy and successful without it, that doesn’t make irrelevant the fact that it does in fact help along with being healthy from diet and exercise. I agree that we aren’t our bodies but pretending beauty is irrelevant is dodging the issue just as much as pretending we’re all beautiful. We should be able to encourage everyone to live healthier lives and attain better physique without it coming across as attacking a person’s character much like telling someone they shouldn’t smoke because it’s bad for them",
            "title_similarity": "0.7904383",
            "sentiment_compound": 0.982
        },
        {
            "id": "gxwvxtt",
            "score": 1,
            "text": "Our society definitely bestows additional rewards for being beautiful, so to say your worth is not dependent on your beauty is sort of hollow. Your worth isn’t really dependent on any one factor. And worth is split into three categories, really: self worth, inherent worth, and worth to others. If you have any self esteem then you should have some self worth. On top of that you have inherent worth in being a living human being, which is basically our societal respect for human life as something sacred and which we project as a universal value. Then there’s worth to others, and this is what others see in you as valuable to them. Others see value in what you commit to relationships, in your labor, and yes, in your sex appeal, among other things. When someone has very little sex appeal, especially when our society values it so much more than it should, they’re getting very little worth to others in the area of sex appeal and they’re missing out on the many rewards our society imparts on people with sex appeal. Redefining “beauty” to mean something broader about the human condition is one way to make those people feel better about a lack of worth to others that they don’t have and may not ever have in the area of sex appeal. Saying that someone’s worth is not dependent on their beauty is just the first step to someone learning that, in each person’s own way, we can all find ourselves beautiful.",
            "title_similarity": "0.7146466",
            "sentiment_compound": 0.9954
        },
        {
            "id": "gxwwil1",
            "score": 5,
            "text": "I think that the best thing the body positivity movement isn't saying \"everyone's beautiful\" but to say that conventional beauty isn't the only standard, and also that mainstream media is pushing a view of the body (mostly for women) that doesn't apply to most women and that's ok. Stretch marks are ok, scars are ok, a body fat is ok: not everyone is a 1.8 metres thin blonde russian top model and that's ok. It's ok to be you and you should feel beautiful in your body because it's what you get and many people are like you",
            "title_similarity": "0.8037218",
            "sentiment_compound": 0.9701
        },
        {
            "id": "gxwz88o",
            "score": 2,
            "text": "If you can’t see the infinite worth and cosmically self-evident beauty that composes your being you will never be able to see it in others and say it to them and yourself honestly.  \n\nYou ARE beautiful.  Everyone IS beautiful.  \n\nSaying it as an affirmation you don’t understand is one thing.   Seeking to see it in yourself and everyone else in every moment is something else entirely.",
            "title_similarity": "0.7496129",
            "sentiment_compound": 0.9477
        },
        {
            "id": "gxx0vnq",
            "score": 1,
            "text": "Well said 👏",
            "title_similarity": "0.005998471",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxx10wu",
            "score": 2,
            "text": "The “body positivity” movement is not one movement. But I really don’t think the majority of people who consider themselves body positive are going to say “everyone is beautiful” full stop. The phrase “conventionally attractive” has become commonplace precisely because the body positive movement recognizes that society views certain body types as more attractive than others *in general*. \n\nThere are also 7 billion people in the world, so the phrase “everyone is beautiful” is not exactly *wrong*. Beauty is entirely subjective, and the odds that any given person would not be attractive to anyone else on the planet is virtually zero. But, that’s also beside the point.\n\nTo answer the question you have about how you can convince a fat person they are just as attractive as a supermodel...body positivity tends to frown on comparisons like that. You don’t have to convince someone they are just as attractive as anyone else, because the whole idea of comparison is toxic AF. The body positive movement, by and large, would not try to convince anyone they are more or less or just as attractive as anyone else. \n\nWhat body positivity is about is loving your body, which is different than believing you’re attractive. Loving your body is really about loving yourself, because we identify with our bodies.  It’s about not comparing ourselves to others, and being proud of the bodies we have whether or not they are considered conventionally attractive. (I also think that the fact the body positivity movement uses the phrase “conventionally attractive” says there is a general understanding that society views some bodies, generally, as more attractive than others, while highlighting the subjectivity of beauty standards)",
            "title_similarity": "0.7949123",
            "sentiment_compound": 0.9982
        },
        {
            "id": "gxx1svq",
            "score": 1,
            "text": "blá blá nobody complains when woman do surgery to put silicone on the breasts",
            "title_similarity": "0.5516869",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gxx1x9e",
            "score": 1,
            "text": "The title alone is a fallacy because it assumes that if one is true, the other must be false. There is no binary relationship between those two statements. Both can simultaneously be true or false. They are not dependent on each other.",
            "title_similarity": "0.5510535",
            "sentiment_compound": 0.34
        },
        {
            "id": "gxx2y24",
            "score": 1,
            "text": "You’re underestimating intentional modification of public thought. It’s just applied psychology. I’m not entirely certain what sort of balance I should have in links/explanations, but you’re already having your mind changed all the time; it has been going on for over a century. They started applying psychology and sociology to doing it better as soon as those fields existed. \n\nStarting on a failure, there’s the DARE Program and the closely associated “Just Say No”. Now, the greater question of if it was intentionally bad to serve the War on Drugs is impossible to solve for the foreseeable future, but assuming the program was enacted in good faith, it is a notorious example of a program doing the exact opposite of its goals. What went wrong?\n\nThe first mistake is that the cluster of anti-drug programs DARE belongs to was most kids’ first exposure to drugs. It made drugs sound cool and implored you to choose being an outcast and a loser in the eyes of your peers. Obviously, the message kids got instead was “do drugs, unless you’re a loser and want to be an outcast”. Their descriptions of drugs didn’t help either. \n\n> “Two-thirds of what we buy in the supermarket we had no intention of buying,” says consumer expert Paco Underhill, author of Why We Buy: The Science of Shopping. Supermarkets not only rely on such behavior; they encourage it. Every aspect of a store’s layout—from the produce display near the entrance to the dairy case in the back to the candy at the register—is designed to stimulate shopping serendipity.\n\n[The Secrets Behind Your Grocery Store’s Layout](https://www.realsimple.com/food-recipes/shopping-storing/more-shopping-storing/grocery-store-layout?)\n\nSupermarkets aren’t as well known, but this is such a more successful example of the same thing. Supermarkets have sunk more money than most towns will ever see into optimizing their layouts in order to make you sell the most. It is designed to cause as many possible situations which raise your chances of making an impulse purchase as possible. It’s one of the largest scale, most successful, most common uses of massive psychological manipulation. It costs consumers billions of dollars every year. And most people don’t even care, because it’s done well.\n\nNow, supermarkets aren’t a cultural shift. To really establish that this is more possible, we would have to show an intentional effort at making a change in public consciousness created a statistically significant change in public belief. Oh right, [the DARE Program](https://dualdiagnosis.org/drug-addiction/dare-program-work/) failed so hard it was successful in doing the opposite. Technically, you have found a functioning methodology there, it’s just that what you tried was a complete failure at its goal.\n\nSo, I would argue that the question has never been “can we?”, it’s “how do we?” Well, if we conceptualize DARE as a pro-drug program, it’s a roadmap itself. You introduce people to the concept young, you tell them it’s already accepted by their peers, and you tell them they’ll be unaccepted for refusing. The rest of the program was just worthless; it’s how they surrendered that ground to drugs that this effect came in. So, is the body positivity movement using the “intentionally pro-drug DARE” method? I’d say yeah.",
            "title_similarity": "0.6796043",
            "sentiment_compound": 0.9471
        },
        {
            "id": "gxx3rno",
            "score": 1,
            "text": "Amen",
            "title_similarity": "-0.017483374",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxx52ca",
            "score": 1,
            "text": "I would say that's still not true. Lots of people's worth is dependent, at least somewhat, on their beauty. And definitely ugly people have experienced firsthand how true that is. We even experience this with non-people; cute dogs are treated better than ugly dogs.\n\nSelf worth is based on a lot of things. Definitely beauty, style, whatever you got all contribute to that feeling. Nothing wrong with loving yourself for being beautiful. That's a great reason to love something. We love sunsets for that reason.\n\nThe problem with both statements is they're both effectively lies to make someone feel better.  Everyone is not beautiful. Some people's worth is dependent on beauty.\n\nPeople should learn to feel better with the direct truth, which is that it's okay to be ugly. \n\nLots of evidence for the fact that being ugly (or let's \"less than strictly beautiful\") is figureoutable. Lots of homely looking people do great in life. They just have to find worth outside of beauty.\n\nAnd being beautiful is nice, but it's not everything. Lots of beautiful people screw up their lives.\n\nYou can also do a lot to make yourself more \"beautiful\" and doing so will help you in life. Lose weight, dress better, eat right, get a little sun. You'll change the way people react to you. Telling yourself you're beautiful all the time is not a great use of time. But also implying that it's not a big deal isn't helpful either.\n\nSo in short, I think the first part of your statement is true. \"Body positivity\" as a kind of delusional self love is foolish. But I would replace it with direct truth. People are tough and can handle it.",
            "title_similarity": "0.81276834",
            "sentiment_compound": 0.9954
        },
        {
            "id": "gxx5h7r",
            "score": 7,
            "text": "Telling someone their intelligence, courage, and skill are what matter is hardly any better than telling someone their abs are what matter. All of those qualities are largely inherited and influenced by factors beyond your control, and even the factors you think you can control were in fact influenced by factors you had no hand in. Why elevate someone's mental faculties and not their physical? You're just virtue swapping based on social norms. \n\nWhat you really should be saying is NONE of your mutable or immutable qualities have even the remotest of connections to your worth and value as a human. You could be the dumbest, laziest, fattest coward on the planet, and you are absolutely still just as worthy of love and compassion and happiness as the most accomplished person up ever live.",
            "title_similarity": "0.73114455",
            "sentiment_compound": 0.9612
        },
        {
            "id": "gxx5sl1",
            "score": 2,
            "text": "I would say I agree, but I would slightly change that to \"should not be\" instead of \"is not.\"  The  large majority of people assign worth or devalue others, a lot of the time without realizing it, based on appearance.  A better thing to say maybe is that someone's self worth should not be determined by how others perceive them, but it absolutely can help and it's often much more challenging to feel good about yourself when you have been told and truly feel like you are not normal looking, let alone beautiful.",
            "title_similarity": "0.7801125",
            "sentiment_compound": 0.9815
        },
        {
            "id": "gxx6bfn",
            "score": 1,
            "text": "I have always thought the body positivity movement was about celebration of our bodies and appreciation of them for more than just what they look like. I have legs that walk me down the street, I have a brain that can solve complex problems, I have a mouth that can talk and sing, my eyes can appreciate art, my hands can create, my womb carried a child for 9 months and my breasts kept that child alive for a year after that. My body is worth so much more than what impossible beauty standards say it is worth. Also, appreciate what IS beautiful about it-- I have cellulite and pale skin, but I have a perfect smile, perky boobs and full lips. I appreciate those qualities. I can't lose sight of all these good things about my body -- including some of the things that are beautiful about it--and just focus on the fact that I'm 15lbs overweight and have spidervwins on my thighs and dimples on my ass.",
            "title_similarity": "0.64216006",
            "sentiment_compound": 0.9839
        },
        {
            "id": "gxx6tpx",
            "score": 1,
            "text": "2% positivity was concerning - we’re cookin!”",
            "title_similarity": "0.35482198",
            "sentiment_compound": 0.5562
        },
        {
            "id": "gxx80jg",
            "score": 3,
            "text": "I agree with this.  I realized years and years ago that I am not attractive so I focused on other areas of my life.  In fact, if anyone tries to bullshit me and tell me I’m pretty I find it annoying.  If I had to choose I would love for someone to compliment me on my character or accomplishments because I need encouragement in those areas to know that I’m even accomplishing what I have set out to do.  I know people who stress about their looks, and over on the rosacea board there is a lot of suicidal talk.  I feel real bad for them.  Even for women that are naturally beautiful it will absolutely go away one day with age, Illness, etc.  you need to find your worth elsewhere and early on, because that’s what will last.  And be in your control more so then your looks.",
            "title_similarity": "0.8534937",
            "sentiment_compound": 0.2668
        },
        {
            "id": "gxx81n0",
            "score": 2,
            "text": "Not sure if this will change your view, but have you considered that most of those body positivity posts are not actually about helping the world or achieving body positivity, but about attention?\n\nHonestly, of all the body positivity posts on instagram I have seen, they have all been of beautiful women using it as an excuse to show off. Its never actually been a ugly or fat girl doing it.\n\nTo me it seems that the body positivity movement was created, and was then sabotaged by this instagram models using it as an excuse to show off.\n\nSo the body positivity movement you are arguing against isn’t really the real body positivity movement.\n\nWhenever I see someone actually talking about body positicity and trying to push that, and not just showing off their bodies, they views tend to be more in line with what you are saying about not giving that much importance to beauty.\n\nMy argument is that the body positivity movement is already what you say it should be, but the second superficial instagram “body positivity movement” isn’t.",
            "title_similarity": "0.7623223",
            "sentiment_compound": 0.9928
        },
        {
            "id": "gxx9msb",
            "score": 1,
            "text": "I disagree.\n\nThese days body acceptance has gone too far in that it's creating an obesity epidemic especially in North America. \n\nStrive for excellence, don't settle for acceptance.\n\nEdit: As long as you're in the normal BMI range for yourself then you're fine. But if you're overweight or anorexic then it's a problem and you should better yourself, for yourself.",
            "title_similarity": "0.7042636",
            "sentiment_compound": 0.0155
        },
        {
            "id": "gxx9p4a",
            "score": 1,
            "text": "Physical beauty is not a worthless goal. It makes more sense to tell people that beauty is subjective, which is true, than to tell people that beauty isn’t important when it so obviously is.",
            "title_similarity": "0.640677",
            "sentiment_compound": 0.9546
        },
        {
            "id": "gxxacu3",
            "score": 1,
            "text": "You know, I suppose this will be deleted, but I have read a lot about the fat acceptance movement and wrote an entire grad paper on the subject, but it's always SO OBVIOUS in this threads that redditors have never engaged with the movement or read anything by anyone involved. You're all always arguing against a straw man created by reddit. Your ideas of what the fat acceptance and HAES movements and such that you are arguing against are third hand. It's just a massive circle jerk of arguing via third hand information.\n\nBecause of this it's really hard to ever want to engage in these threads.",
            "title_similarity": "0.64985967",
            "sentiment_compound": 0.5608
        },
        {
            "id": "gxxash5",
            "score": 1,
            "text": "If everything is something then something is nothing.",
            "title_similarity": "0.15402058",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxby7d",
            "score": 1,
            "text": "Why not both? Your worth isn't dependant on beauty, *and* people outside of the white supremacist, cisheterosexist, and classist ideal are beautiful. \n\nNo one's worth is based on whether I or anyone else finds them aesthetically pleasing. And yet, I still think it's important to expand what we, as a society, glorify as aesthetically pleasing. \n\nWhen my mom grew up, pretty people all looked like siblings. Nowadays pretty people don't all look *exactly* the same. I still can't tell most famous people apart, so we still have a long way to go, but it's getting better.",
            "title_similarity": "0.8471999",
            "sentiment_compound": 0.9451
        },
        {
            "id": "gxxc07p",
            "score": 1,
            "text": "It’s all stupid anyways. The people that are all for the “body positivity movement” are the same people that constantly bring up celebrities, who’s the most attractive and other comments that uphold beauty standards. \n\nSeriously. Every plus size person I’ve heard bring up how beauty standards are unrealistic and how badly they want to be accepted...those are the same ones “simping” (for lack of a better term) over people that they don’t realize are caked in makeup and don’t get to eat more than 200 calories a day leading up to big roles or photo shoots\n\nDon’t even get me started on the hypocrisy of Instagram.",
            "title_similarity": "0.80396616",
            "sentiment_compound": 0.8313
        },
        {
            "id": "gxxc3wf",
            "score": 1,
            "text": "I’m getting real tired of being told 375 pound women are beautiful",
            "title_similarity": "0.6436166",
            "sentiment_compound": 0.25
        },
        {
            "id": "gxxcgnu",
            "score": 2,
            "text": "A friend of mine recently declared she was going to focus on \"body neutrality\" instead of \"body positivity\" and damn if I don't think about that every day.",
            "title_similarity": "0.5615121",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxxdn7g",
            "score": 1,
            "text": "Nah the slogan should really be “everybody can’t look the same”",
            "title_similarity": "0.48856807",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gxxeka9",
            "score": 1,
            "text": "Body  neutrality is the answer youre looking for.",
            "title_similarity": "0.3189215",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxelz0",
            "score": 1,
            "text": "Well I agree with some of what you said, but you should also consider that some people actually do find bigger people just as beautiful. So in a sense the definition of beauty didn’t need to be expanded at all, just the people that already thought that were given a larger platform. Though my problem with the movement relates Mostly to the fact that overall it’s unhealthy, especially as someone who is overweight I see the impacts it has on my health and am working to improve it.",
            "title_similarity": "0.7942588",
            "sentiment_compound": 0.743
        },
        {
            "id": "gxxfdsk",
            "score": 1,
            "text": "You’re beautiful for writing this.",
            "title_similarity": "0.30315787",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gxxflm6",
            "score": 1,
            "text": "Holy wall of text...\n\nThe biggest problem of Body Positivity is that it makes people think the being very overweight or obese is Ok. It’s extremely unhealthy in pretty much every way imaginable.",
            "title_similarity": "0.6984824",
            "sentiment_compound": -0.3447
        },
        {
            "id": "gxxfr8n",
            "score": 1,
            "text": "I disagree just from a marketing perspective, people would rather hear that they are beautiful and valuable just the way they are rather than hear that they are ugly and valuable",
            "title_similarity": "0.775468",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxxg8s9",
            "score": 1,
            "text": "The primary purpose of social movements is always to get people talking. The reason every social problem took this long was because the majority of the population pretended they don't exist or simply hadn't thought about their possible ramifications. I personally would agree that \"everyone is beautiful\" is the wrong counterpoint to make, but the idea of making a counterpoint at all is a lot more impactful. At the end of the day, starting a discussion on body image with a widely read Reddit post is doing more good than the specific wording is doing harm.",
            "title_similarity": "0.80555236",
            "sentiment_compound": -0.0414
        },
        {
            "id": "gxxg9xt",
            "score": 1,
            "text": "Big Yes!",
            "title_similarity": "0.05377023",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gxxggd9",
            "score": 1,
            "text": "What if the value should be its okay if your value is determined by your body and its okay if its not too?",
            "title_similarity": "0.4055676",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gxxgoga",
            "score": 1,
            "text": "I like \"overweight\" women more than super models.",
            "title_similarity": "0.57311213",
            "sentiment_compound": 0.6344
        },
        {
            "id": "gxxh9if",
            "score": 1,
            "text": "Sure, but then how would they sell you something that is designed to enhance beauty?",
            "title_similarity": "0.5101658",
            "sentiment_compound": 0.7814
        },
        {
            "id": "gxxhf06",
            "score": 1,
            "text": "The biggest problem I have with the body positivity movement is how much it’s taken away from being healthy.",
            "title_similarity": "0.6078143",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxxhwox",
            "score": 2,
            "text": "Discrimination by attractiveness applies to all genders and attractive, tall, physically strong people are seen as leaders above anyone else. It's how we were programmed by many thousands of years of tribal evolution. That doesn't make it right, but it is absolutely true for men that for the most part males who demonstrate physical fitness and are outwardly attractive and financially successful will be chosen over other men because they are seen as more capable. \n\nStereotypes apply to all genders and can harm and influence all genders. Being good-looking is nearly always an advantage, it's just that women are much more able to \"marry up\" if they are very physically attractive and smart. Men are FAR less able to do so. Less attractive males HAVE to be financially successful or they generally don't attract good-looking women. \n\nYou are absolutely right that the \"body positivity\" movement has the wrong focus and I deeply agree with you on that. But even babies with zero real-life experience are studied and shown to be biased toward conventionally attractive people, meaning it's almost certainly biological.",
            "title_similarity": "0.7761349",
            "sentiment_compound": 0.9928
        },
        {
            "id": "gxxhwyp",
            "score": 1,
            "text": "Or, it’s unhealthy to be morbidly obese and you should do everything you can do be healthier if you can do so to help.",
            "title_similarity": "0.6429208",
            "sentiment_compound": -0.1082
        },
        {
            "id": "gxxih41",
            "score": 1,
            "text": "Two things. First, is this really just a western phenomenon? Was beauty not historically been valued in Eastern cultures? And currently?\n\nSecond: if you are evaluating things based on a set of metrics and all of those things have the same value for a given metric, then can't you just eliminate that metric from the equation? \n\nFor instance say I am buying a car and the things that are important to me are color, number of doors, and cargo capacity. Now say I shop around and all the cars in my area are black. I can effectively eliminate color from my valuation of the cars I'm looking at. They're all the same color.\n\nNow let's look at your question. If we say everyone should be positive about their bodies because everyone is beautiful (and actually believe it) then we can eliminate beauty from our valuation of people, because we're all the same in that regard. \n\nI think you're just skipping a step. The end result of expanding the definition of beauty to say everyone is beautiful is that beauty is removed from consideration , which is, I think,, what you're advocating for. This is provided everyone can get to the point where they consider all to be equally beautiful (which is a big if as you alluded to).\n\nSo yeah, maybe we should just skip that step altogether. But convincing people to not be critical about beauty is going to be nearly impossible. So maybe just getting a few people to be more positive about their looks is enough for now?\n\nDon't know, just thinking out loud while my ugly ass sits on the toilet.",
            "title_similarity": "0.6097752",
            "sentiment_compound": 0.9817
        },
        {
            "id": "gxxihfd",
            "score": 2,
            "text": "Please convince me otherwise but I believe there is an issue with too much body positivity for body types that are very unhealthy. I don't think we should encourage people too have unhealthy bodies (too thin or too thick). It's like saying yellow teeth due to not brushing teeth or a black smoker lung is pretty as well",
            "title_similarity": "0.7269806",
            "sentiment_compound": 0.8912
        },
        {
            "id": "gxxivfz",
            "score": 1,
            "text": "Heres what i learned over the years. Eat healthy lean foods, water should be 80% of your liquid intake, avoid refined sugars and exercise regularly. Everything else (your weight, your size, or how you look physically) its all just BS. Vanity is fleeting, A good healthy body and mind is forever.",
            "title_similarity": "0.58653224",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxxjlyj",
            "score": 1,
            "text": "Being overweight used to be considered attractive. Beauty is in the eye of the beholder. That's not just an idiom, it's true. Plenty of things considered attractive now were not only a bit ago. The only thing we need to be attracted to somebody is to know they can have our children, being skinny, having bit tits, having a big butt, they mean nothing relatively. You could argue that if society had good enough marketing for it, we could make having acne be attractive and people would rub mud on their face to get it",
            "title_similarity": "0.8047241",
            "sentiment_compound": 0.9349
        },
        {
            "id": "gxxkehl",
            "score": 1,
            "text": "The body positivity movement has been tremendously successful in a few ways that are important to a previously shit-upon portion of the population: women who are overweight.\n\nIt used to be socially acceptable to overlook someone's character, skills, competence, and personal virtues if they were fat. You see it reflected in shows like Seinfeld in the 90s where making fun of fat people was so ingrained into mainstream humor that people weren't listened to if they spoke up about it.\n\nAside from it being okay to treat fat people like second class citizens, mainstream media did not represent overweight people or acknowledge that beauty includes so much more than the lack of fat present on a body.\n\nIn reality, people's idea of beauty falls along a wide spectrum.  Many \\*like\\* or don't mind when a person isn't thin or athletic.  There was a time where they would be shamed for expressing that. Body positivity is about acknowledging that beauty includes many other types of bodies.\n\nThe positive changes happened over time, and are continuing to happen: Now it is not acceptable to show prejudice to someone who is overweight. Now overweight people have more options at major stores for decent clothes that fit them (previously it was special \"plus size\" stores only.) Now it's not a source of shame to date a fat person. Expanding the definition of beauty has not \\*hurt\\* the idea that people should be judged by their behavior. It has widened the pool of acceptability for body types.",
            "title_similarity": "0.82241917",
            "sentiment_compound": 0.991
        },
        {
            "id": "gxxlk5y",
            "score": 1,
            "text": "Just say your body positivity movement is  \"your worth is not dependent on beauty\".",
            "title_similarity": "0.4906599",
            "sentiment_compound": 0.2796
        },
        {
            "id": "gxxllz9",
            "score": 1,
            "text": "And some people want to be healthy and look for a partner who can go along with them on that journey. That super obesity and shit is really just people living in excess and selfishness. Huge red flag for friend or other.",
            "title_similarity": "0.737894",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gxxm3uo",
            "score": 1,
            "text": "I disagree because it's silly to believe that most of us don't value people based on how they look. We most definitely do. The body positive movement is a failure regardless of what the catchphrase is. Let's assume \"your worth is not dependent on beauty\" is the slogan and has been this entire time. Everyone will still place value on how they look ESPECIALLY women.",
            "title_similarity": "0.8946962",
            "sentiment_compound": -0.0039
        },
        {
            "id": "gxxm4or",
            "score": 1,
            "text": "For me, the biggest issue with the Body Positivity Movement is that Everyone Gets A Trophy. And we all know how that turns out. \n\nWe need to focus more on what’s considered medically healthy. To that end, we can’t support people who are medically overweight or underweight. Doing so does them a disservice by normalizing unhealthy eating.",
            "title_similarity": "0.7483121",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxxmdth",
            "score": 1,
            "text": "The destruction of objective beauty standards that has accompanied the body positivity movement is the biggest damage that has been done to human health since the invention of coco cola",
            "title_similarity": "0.6326012",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gxxn9by",
            "score": 1,
            "text": "That is not the message of the body positivity movement.",
            "title_similarity": "0.2791807",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxxnd5z",
            "score": 1,
            "text": "Is this just a Western thing?",
            "title_similarity": "0.2135421",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxnewm",
            "score": 1,
            "text": "I think body positivity is important tool to combat body dysmorphia and similar conditions but certainly not the only tool. I don’t think the movement really represents the idea of “everyone is beautiful” but more “everyone’s bodies are ok”. Unfortunately it has been hijacked to some extent and become somewhat part of the problem it was intended to aid in addressing.",
            "title_similarity": "0.7776929",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxxo37d",
            "score": 1,
            "text": "Glorifying obesity",
            "title_similarity": "0.30798987",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gxxodzi",
            "score": 1,
            "text": "We also need to be preaching that you will feel much better about yourself if you’re healthier.",
            "title_similarity": "0.52342165",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxxogwh",
            "score": 1,
            "text": "It’s honestly all a shit show, the focus should 100% be on health and not on “beauty”. Regardless every individual person has their own idea of beauty and society shouldn’t tell us what beautiful is. However, being healthy and the correct weight for your height, age, etc is very important. There are so many studies done that show the massive increased health risks with obesity. Now, before everyone starts freaking out there is even more to this. Obviously body shaming is not okay, but the problem with this runs even deeper in the country. Many people can not afford to live a healthy diet (or are uneducated about one). We have created a society where it is cheaper to eat shit food than it is to eat Whole Foods. Thus the rising rate of obesity, thus the need to have more campaigns making people feel better about themselves to continue to pursue an unhealthy lifestyle for the profit of enormous corporations. Everyone (government included) is turning a blind eye because money outweighs the well being of the nations people. This is also linked to the rising in healthcare costs as well.",
            "title_similarity": "0.7771255",
            "sentiment_compound": 0.4877
        },
        {
            "id": "gxxptqe",
            "score": 2,
            "text": "The concept of women being viewed as eye candy, brightening up or colouring the workspace exists everywhere. \nAlso it hits you only much later that beauty is all about being confident and making those budgets around you that this confidence is beautiful. If we could do help people understand that concept of beauty, perhaps it’ll be a pivot in another direction.",
            "title_similarity": "0.72682524",
            "sentiment_compound": 0.9771
        },
        {
            "id": "gxxqfrj",
            "score": 1,
            "text": "The problem is that beauty is a made up concept that means absolutely nothing and changes over time.  Heavyset, pale white women were considered the pinnacle of beauty not so long ago.",
            "title_similarity": "0.6741893",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gxxqimn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07498749"
        },
        {
            "id": "gxxqnr2",
            "score": 1,
            "text": "I think body positivity is too focused on fat.  There are many other physical attributes that have also fallen victim to fashion trends.   The internet has led to  the development of an almost universal set of \"must-haves\" such as inflated, pouty lips, huge breasts, ultrawide hips, big bums, impossibly-cinched  waists, artificial eyelashes, sculpted eyebrows, perfect teeth etc. to the extent where all so-called attractive women now look pretty much the same.  I'm waiting and hoping for the world to get as bored with that mass-produced look as I am, and start appreciating the natural individuality, variety and charm that's now only seen in old photos.",
            "title_similarity": "0.73672783",
            "sentiment_compound": 0.969
        },
        {
            "id": "gxxqtv0",
            "score": 1,
            "text": "“And sin, young man, is when you treat people as things. Including yourself. That’s what sin is.’ ‘It’s a lot more complicated than that—’ ‘No. It ain’t. When people say things are a lot more complicated than that, they means they’re getting worried that they won’t like the truth. People as things, that’s where it starts.’ ‘Oh, I’m sure there are worse crimes—’ ‘But they start with thinking about people as things...” - Robert Heinlein,  \"Stranger in a Strange Land\"",
            "title_similarity": "0.6894488",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gxxqy3p",
            "score": 1,
            "text": "The body positivity campaign is a failure because it’s not actually “body positivity.”It’a fat aggressiveness. You could be ugly af and amazingly thin, and the “body positivity” group will still attack you.",
            "title_similarity": "0.74034095",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gxxrz5a",
            "score": 1,
            "text": "I feel like this comes up at least 1 time a week",
            "title_similarity": "0.06285632",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxxsyiq",
            "score": 1,
            "text": "“Beauty is only skin deep, but ugly goes all the way to the bone”",
            "title_similarity": "0.5542375",
            "sentiment_compound": -0.6652
        },
        {
            "id": "gxxti49",
            "score": 1,
            "text": "Yep.",
            "title_similarity": "-0.07982743",
            "sentiment_compound": 0.296
        },
        {
            "id": "gxxtjck",
            "score": 1,
            "text": "Physical beauty is an indicator of health.\n\nAccording to all scientific literature your market value is dependent on physical beauty.\n\nTo claim otherwise is just cruel to people. It's better to tell people the world isn't fair and prepare them for that reality when they are young.",
            "title_similarity": "0.80244505",
            "sentiment_compound": 0.7985
        },
        {
            "id": "gxxtl87",
            "score": 1,
            "text": "But that's what the body positivity movement is all about...\nYou know what, I'm tired. \nIt's really exhausting to see people change things to what was not meant.",
            "title_similarity": "0.6062343",
            "sentiment_compound": -0.4748
        },
        {
            "id": "gxxugyi",
            "score": 1,
            "text": "UGGs run the internet, that's why it even exist",
            "title_similarity": "0.30048186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxuhcx",
            "score": 1,
            "text": "This is utter shit.",
            "title_similarity": "0.1634697",
            "sentiment_compound": -0.5984
        },
        {
            "id": "gxxuwdw",
            "score": 1,
            "text": "It sounds like you got called out for not thinking a plus sized person was pretty and concocted a world view so you didn’t have to feel bad about yourself.  \n\nYou don’t have to be attracted to anybody, just don’t be mean.  Honesty is great but that’s not the same as being blunt.  If you have nothing good to say about somebody and somebody else is complimenting them then say nothing. I guarantee your negative thoughts on their figure are not needed and your image will suffer.  If asked then just find a way to compliment them in some way. Simple flattery is a skill all people should practice. \n\nWhat is the purpose of having a real moment and saying “Yup your gross”.  That doesn’t help anybody.  \n\nAs with any good movement, though, everybody will have their own interpretation. Somebody will take it to the extreme and get featured on Fox News for ratings. They are not the whole movement and they likely don’t even represent the feelings of the masses. Some special people just have a talent for making anything positive completely unpalatable to the unconverted.  \n\ni.e. I have a particular family member... let’s just say she can have really loud opinions.  My other more conservative family members usually can’t handle it because they get defensive.  They do listen to another similar minded family member, however, because she’s a little more delicate.  Same objective different approach. Families are hard.",
            "title_similarity": "0.78159547",
            "sentiment_compound": 0.9672
        },
        {
            "id": "gxxvhm8",
            "score": 1,
            "text": "The body positivity movement was invented by fat \"celebrities\" to mask the work needed to get fit.  Funny how many of them hire a trainer to loose wait once they become \"semi-known.\"",
            "title_similarity": "0.75141656",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gxxvufw",
            "score": 1,
            "text": "Except attractiveness does matter, even for men and even at work or social life. It matters a lot.\n\nIt can't determine your personal self-worth, but it can determine hoe society and work sees and treats you, and ultimately hoe they value you.\n\nIt is as pointless as body positivity as it tries to teach women something that isn't true and makes them even less prepared for the real world.\n\nThe truth is that beauty and body matter, even for men. \n\nThis is an article about why CEO's tend to be taller than average:\n\n\n*Highly attractive people of both sexes tend to earn at least 12% more than less attractive coworkers. In fact, physical attractiveness has a greater impact on  job qualification...*\n\nhttps://m.economictimes.com/the-necktie-syndrome-why-ceos-tend-to-be-significantly-taller-than-the-average-male/articleshow/10178115.cms\n\nBy the way, this website is stupid. You can't even copy/paste for fair use.  They've gone backwards and somehow don't want to be part of the internet, again.",
            "title_similarity": "0.86864746",
            "sentiment_compound": 0.9831
        },
        {
            "id": "gxxw7q2",
            "score": 1,
            "text": "I *almost* entirely agree with you, but if you are approaching this from the \"let's not kid ourselves and be realistic\" angle, why say \"attractiveness is pretty much worthless\"?  Is it really *worthless*?  I think it's pretty clearly worth something in virtually every culture in existence.  \n\nI think the better formulation is \"your looks don't define you / your worth as a human being.\"",
            "title_similarity": "0.80092",
            "sentiment_compound": 0.9544
        },
        {
            "id": "gxxy3ol",
            "score": 1,
            "text": "Amazing that even a common sense view like that redditors are disagreeing with it... Fuck me man you guys are ridiculous.",
            "title_similarity": "0.5654844",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gxxz0fs",
            "score": 1,
            "text": "No, it's a failure because it tries to spin unhealthy lifestyle as normal, and that everyone should accept it because we gotta be positive.",
            "title_similarity": "0.7348755",
            "sentiment_compound": -0.128
        },
        {
            "id": "gxxz591",
            "score": 1,
            "text": "There is probably 15 comments on here that say this more clearly but in my opinion statements meant to uplift should not include a negative.",
            "title_similarity": "0.38791496",
            "sentiment_compound": 0.7179
        },
        {
            "id": "gxxzp1l",
            "score": 1,
            "text": "This is an amazing post, OP. Salute",
            "title_similarity": "0.19949713",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxxzq6g",
            "score": 1,
            "text": "Only needed to read the title.... \nanyway yeah i mean this applies to basically everything tho....race...sex....gender..... whatever bro as long as you can contribute to the advancement and progression of the human race in a positive way....",
            "title_similarity": "0.57501507",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxxzxhx",
            "score": 1,
            "text": "I think a lot of people miss the point of body positivity. The real goal is not to convince people they are perfect as they are, but an attempt at giving overweight people the self esteem to believe that being fat doesn't make them worthless. Thus empowering them to make positive changes in their lives. Speaking as someone who has been overweight all my life, the biggest obstacle I run into starting/maintaining lifestyle improvements is the feeling that I'm a worthless piece of shit who is not worth saving. Body positivity tells me: \"Hey, being fat doesn't make you bad, you have worth!\"",
            "title_similarity": "0.82306594",
            "sentiment_compound": 0.8405
        },
        {
            "id": "gxy1vya",
            "score": 1,
            "text": "I’m all for people loving themselves and accepting who they are.  The issue I have with body positivity is that there’s a point where extra weight is unhealthy.  It can actually kill you.  So while it’s wonderful to be comfortable in your own skin, I think there has to be a goal to be healthy inside and out.  As you get older, carrying around extra weight can ruin your knees and you feel like crap.  It’s a quality of life issue which seems to be the goal of this movement.",
            "title_similarity": "0.76202613",
            "sentiment_compound": 0.7759
        },
        {
            "id": "gxy1xsy",
            "score": 1,
            "text": "Maybe it does say that and you’ve simply misunderstood",
            "title_similarity": "0.34383178",
            "sentiment_compound": -0.34
        },
        {
            "id": "gxy23w9",
            "score": 1,
            "text": "Around the end of sleeping beauty",
            "title_similarity": "0.17292619",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxy2eko",
            "score": 1,
            "text": "This conversation says a lot about how much our standard of living has improved in the last 10,000 years. So before you write a heated response, just take a second to think about the fact that if your body wasn't a certain way way back, you'd prob get mauled by a tiger or something. Shit, even if you did fit the bill to a T, you'd prob still get mauled by a tiger! :P Live and let live my good people of reddit.",
            "title_similarity": "0.6283235",
            "sentiment_compound": 0.7279
        },
        {
            "id": "gxy2sam",
            "score": 1,
            "text": "Traditional concepts of beauty are reliably associated with notions of reproductive health.\n\nThe gynoid body distribution, wherein female body fat is concentrated around hips, thighs, and breasts, is, at least from an evolutionary perspective, \"beautiful\" because it signals sexual maturity, general health, and, most importantly, reproductive health.\n\nThis is not a social statement: it is an evolutionary one.",
            "title_similarity": "0.7292625",
            "sentiment_compound": 0.8832
        },
        {
            "id": "gxy38h7",
            "score": 1,
            "text": "THIS EXACTLY",
            "title_similarity": "-0.061008688",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxy5j0x",
            "score": 1,
            "text": "I agree. The movement used to be all about how your worth is not dependent on your physical apprehended, but now it’s all about claims that you can be 400 lbs and still healthy. So dumb.",
            "title_similarity": "0.6557598",
            "sentiment_compound": -0.2759
        },
        {
            "id": "gxy5or3",
            "score": 1,
            "text": "Interesting discussion - haven't read all the posts - but to a point I somewhat agree with the OP, in principle.\n\nThere are physical aspects of attractiveness and there are other aspects too - such as personality/etc.\n\nBut personal or societal worth is a separate issue. When I read a book or listen to music, I don't look for the creator's picture, their value to me is in their creation. When I go to a doctor, their ability to help me with my health problems is my first consideration, not their appearance (ever notice many receptionists are physically attractive?). Many of the people I value (doctors, financial advisors, other service providers), I have never met or rarely meet in person.\n\nAs for physical \"beauty\" - it is generally fleeting. Everyone gets old, and most of us do not age such that we are anywhere near as physically attractive as we were when we were in our physical prime. I am 67, a little overweight (at 6'6\", I used to be very skinny) and out of shape, not to mention my skin is wrinkled and spotted, plus I am now mostly bald. While I would prefer to be young and attractive again, I really don't care what other people think about my appearance.\n\nIf someone isn't physically attractive to me for whatever reason, I don't shame them - I look past their physical appearance, just as I prefer that they do the same for me. But telling me that I have to find them physically attractive to me, when they are not, isn't going to work for me.\n\nI think that people who do the shaming are projecting their own insecurities on others, whether it is due to their own fear of being physically unattractive to someone (or themselves) or they sense their own inner ugliness that they are expressing by shaming others.",
            "title_similarity": "0.73066086",
            "sentiment_compound": 0.9569
        },
        {
            "id": "gxy8w6m",
            "score": 3,
            "text": "Well this one is easy.\n\nThey just have to change the message to \"your worth is not dependent on your body. \"",
            "title_similarity": "0.4507422",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gxy9gzc",
            "score": 1,
            "text": "Exactly I think a lot of people misinterpret body positivity and they start to encourage people who are unhealthy to continue being unhealthy and just accept it. Like no, body positivity is about finding enough courage to accept yourself and then find the motivation to make a healthy change in your life.",
            "title_similarity": "0.7321978",
            "sentiment_compound": 0.9524
        },
        {
            "id": "gxy9vze",
            "score": 1,
            "text": "You're worth isn't dependent on your definition of beauty or how literal you take your life to be... Everyone is beautiful... Everyone has worth one way or another. Love and be loved. You deserve it whether you think so or not",
            "title_similarity": "0.61192465",
            "sentiment_compound": 0.9618
        },
        {
            "id": "gxya9qu",
            "score": 1,
            "text": "I think body positivity resolves a seperate problem from gender inequalities.\n\nPeople want to be confident around people they know. They also want to settle down with someone, if ya know what I mean. Body positivity at its best is about saying that there are people out there who will find your body good looking and not repulsive. It's not just women who have to deal with unpopularity in this regard. People with mental and physical disorders have to deal with this too. People with bad teeth too.\n\nThe fact that taller and prettier folks get paid more is really a seperate issue. Many financial biases exist in Western society. Also, it is true for men. It's rarer for a short person to be a CEO, for instance.\n\nThe fact that Instagram influencers make bank isn't a problem in my opinion, but this is debatable.",
            "title_similarity": "0.8232105",
            "sentiment_compound": 0.8773
        },
        {
            "id": "gxyahcb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07498749"
        },
        {
            "id": "gxyb7l2",
            "score": 2,
            "text": "It seems to me that your theory is that an individual can't find themselves attractive if other people don't treat them like they are attractive, so unattractive individuals should instead focus on the fact that they do have many good qualities besides physical attractiveness that make them \"worthy\" (of love, affection, whatever). \n\nHowever, this foundation rests on the fact that unattractive people ARE treated differently than attractive ones. And if we can agree that the way attractive people are treated is, everything else being equal, better than the way unattractive people are treated, then it must be true that attractiveness has value. The value is based on the opportunities that attractiveness provides to those who have it. Unattractive people may have other qualities that provide other opportunities, but they are not the same opportunities that attractiveness provides. Therefore those qualities will provide no comfort to those who yearn for the benefits that come from being smoking hot.\n\nChanging your own perspective does not change the way that others treat you. It's true that a person could decide that they don't care whether other people find them attractive because deep down they know themselves to be a worthwhile individual. But if they instead decide that they still want the same treatment as the hotties, they could instead try to change EVERYONE's perspective. Much like the infamous American political practice of gerrymandering the 'Unattractives' can attempt to redraw the lines of what is considered Hot, or Not. In this way they can seize for themselves the value that society has otherwise not felt fit to bestow upon them.",
            "title_similarity": "0.81091326",
            "sentiment_compound": 0.9829
        },
        {
            "id": "gxybatv",
            "score": 1,
            "text": "This is called body neutrality and you’re right it is a far superior movement compared to the body positivity movement.",
            "title_similarity": "0.46433276",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gxybgql",
            "score": 1,
            "text": "Both are a failure tbh.\n\nWomens worth IS based on their attractiveness because attractiveness is connected to sex appeal and sex is the worlds most valuable commodity.\n\nDoesnt matter if you are an oscar winning nobel laureate modern mothet theresa. That doesnt make dick hard and what you have sex with. Physical attractiveness is.\n\nPeoples value is based on what they offer you. Men have zero innate value, attractive women have huge innatr value because they are literally the focus of all straight mens existence",
            "title_similarity": "0.8684282",
            "sentiment_compound": 0.9799
        },
        {
            "id": "gxyd35j",
            "score": 1,
            "text": "Is the body positivity movement about expanding physical attractiveness, or expanding acceptance? I'm no expert in this area, but it seems the end goal is not to claim that everyone has the same level of physical attractiveness, but to ensure that everyone is accepted by society regardless of how they look. It's in the name: create a positive attitude towards all bodies. The movement isn't called \"Everyone's a Model\".\n\nI think it comes down to terminology. \"beautiful\" could mean \"physically attractive\" or \"viewed positively.\" I interpret the \"everyone is beautiful\" slogan as referring mostly to the second meaning.",
            "title_similarity": "0.76103115",
            "sentiment_compound": 0.9917
        },
        {
            "id": "gxydpuh",
            "score": 1,
            "text": "Calling everyone beautiful no matter their looks will not get us anywhere. I think we should accept that some people look better than others, and that looks isn't something important when it comes to being a good part for our society.",
            "title_similarity": "0.75382984",
            "sentiment_compound": 0.8918
        },
        {
            "id": "gxydux1",
            "score": 1,
            "text": "But wouldn't that mean that \n\nSkinny = attractive?\n\nI have seen many skinny people who are not attractive at all. To me that is. And I think that is the point.\n\nWeight is not the only factor when it comes to being attractive. By no means. There are many other factors.\n\nI thought the Body positivity thing was supposed to make everyone see the good sides of their body. Their beautiful hair, their eyes or their cheekbones. Otherwise if they lose weight they will still feel very ugly. There are lots of skinny beautiful people who feel very ugly and are extremely unhappy with their bodies.\n\nI also don't think body positivity lead to fat people believing they don't have to lose weight. Those people have existed before.\n\nWhat people need to understand is that fat people have to lose the weight for themselves to be healthier and not for anyone else who thinks of them as ugly and disgusting.",
            "title_similarity": "0.7504973",
            "sentiment_compound": -0.8733
        },
        {
            "id": "gxydvnf",
            "score": 1,
            "text": "> I don't think Instagram influencers and activists are going to change people's perceptions of what bodies are beautiful\n\nI'm sure they do, just not in the way they hope. They just reinforce the existing by parading freaks in images distorted by digital trickery or, worse, botched surgery.",
            "title_similarity": "0.7480496",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gxyfbcx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07498749"
        },
        {
            "id": "gxyflnw",
            "score": 1,
            "text": "I just don’t understand why people push this body positive stuff for the obese movement. I understand it’s importance when it’s pertaining to other body issues like for example, Instagram vs reality sub. But If you make your body a priority you’ll feel positive about it. If you ignore your body and don’t take care of it you’ll never feel positive about it regardless if somehow the entire world jumped on board w the obese body positive movement. \nYour subconscious knows you’re overweight and it’s not healthy and that’s why you can’t convince yourself it’s okay. There’s no need to change the narrative of obese acceptance Bc that’s impossible and will never work. It’s much easier to just lose weight than to try to change the world. I have no fat phobia and I personally don’t think anyone should be treated differently Bc they’re overweight. Everyone deserves respect, but respect isn’t the same thing as ignoring science when it says it’s unhealthy. I would never just go up to a bigger person and say hey you’re fat, but if someone asks me my honest opinion on weight issues I wouldn’t sugarcoat it either. That’s not disrespect, it’s common sense.",
            "title_similarity": "0.7750572",
            "sentiment_compound": 0.9528
        },
        {
            "id": "gxyfx1h",
            "score": 1,
            "text": "Well Id say body positivity has gone too far. Obesity isnt sexy or ideal and young people shouldnt be showing off a gut and a fat ass. There’s no need to fat shame but posting 250 pound cellulite ass on Insta... puhlease",
            "title_similarity": "0.72622097",
            "sentiment_compound": -0.8666
        },
        {
            "id": "gxyhri5",
            "score": 1,
            "text": "Seeing different types of bodies helps people ease their anxieties about their body image. Feeling comfortable in one's body should be the ultimate goal in my opinion. Self worth definitely shouldn't be tied to beauty, but it was for a long time, and that should be addressed instead of glossed over, and that's what's happening.",
            "title_similarity": "0.75162435",
            "sentiment_compound": 0.81
        },
        {
            "id": "gxyi40h",
            "score": 1,
            "text": "You can't have beautiful people without ugly people to compare to.",
            "title_similarity": "0.6814504",
            "sentiment_compound": -0.1139
        },
        {
            "id": "gxyiy6m",
            "score": 1,
            "text": "We all love to bullshit ourselves sometimes.\n\nThat whole body positivity movement is taking that bullshit to a whole new level.\n\nYou don't want to work for a better body? That's cool. No one cares. You want me to rearrange my genes to find your unfit body beuatiful? Oh, you want to push pictures of you on me through various outlets?\n\n😂😂😂😂😂😂😂\n\nNo.",
            "title_similarity": "0.7682742",
            "sentiment_compound": 0.9667
        },
        {
            "id": "gxyj6gv",
            "score": 1,
            "text": "So you want society to be the judge of what's beautiful instead of letting people decide for themselves what's beautiful",
            "title_similarity": "0.63758355",
            "sentiment_compound": 0.8548
        },
        {
            "id": "gxyk4se",
            "score": 1,
            "text": "I agree with your main statement, that the body positivity movement should work a lot differently, but there are 2 things you said that i do not agree with.\n\nFirst, you said back in the day women's only purpose whas their buty, and they had to use it to land with a rich man. I agree that a lot of beautiful women (and a couple of men) used their beauty to mary themselves up a few scales, this is definitely not always the case. I dont know what exact time period you are talking about, but women's work always mattered. Although they usually did other things, it whas not considered \"less\". From stone age to now, women ans men had the same work devidement. Women had to watch children, so it made sense that they did work close to house. Men where physically stronger, so it made sense they hunted, fought, and worked in factories. Picking berries and watching kids whas not considered less then hunting and fighting in the stone age.\n\nSecond, you say females have higher beauty standards, which i also do not agree with. The reason i think standards are higher for men, lies in nature. In nature, if a female and a male get a kid, the male leaves. This is because for him it takes 5 minutes to make sure his genes get passed on. This means, he is able to get kids with multiple females, allowing him to pass on his genes on multiple kids. Females on the other hand, can only do this, with most animals, once a year. Thats why they have to choose very carefully who they do it with. Thats why a lot of male animals fight or have crazy colors, (having colors takes extra calories, and puts a target on your back, if you can still survive with all that, you must have great genes). Given, we are no longer in the stone age, but this still unconsiously plays a role in dating. Thats why men still have to ask women out, still have to buy her nice things, (shows of rich, which means he must be smart or hard working, good genes). And thats also why they have higher beauty standards. 6 pack, 6ft, rich, etc, etc. (By the way, 6ft is an often accuring standard, even though only 15% of US males are 6ft+)",
            "title_similarity": "0.847891",
            "sentiment_compound": 0.9956
        },
        {
            "id": "gxylexd",
            "score": 1,
            "text": "I sniff my own farts",
            "title_similarity": "0.23254725",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxylipm",
            "score": 1,
            "text": "Not really, your post title is still equating 'beauty' with 'physical appearance', when the while point of the body positivity movement is that there is more to beauty than just that.",
            "title_similarity": "0.6583562",
            "sentiment_compound": 0.9038
        },
        {
            "id": "gxymmcy",
            "score": 1,
            "text": "Let's try to understand it from the perspective of natural and developed attributes.\n\nImagine yourself to be a smart kid. You score 80/100 in a particular subject. You have a natrual attribute and you work hard to develop to the level of 95/100. But there are some kids in your class who only score 30/100. Some people judge them because of it. One day a counsellor comes and says that the marks are irrelevant and you should not judge yourself by them. How would you feel?\n\nI would feel irritated because even though it was my natural attribute, I still worked hard to develop it. There are not just many kinds of attributes but also sub-categories in them. Example smart could mean book smart, street smart, witty, knowledgable, wise etc. So a better counsellor should use that and guide the kids that the test score is not the only kind of smartness in the world and that we are all smart in our own ways. We have to find it and develop it. At the end of the day, we all want to feel smart!\n\nSimilarly we all want to feel beautiful and we can all achieve that only when we realise that there are multiple kinds of beauties :D\n\nWe do need the body positivity movement to expand the definition of beauty.\n\nP.S. - A big lump of rock could also be beautiful (moon), so why can't everyone be?",
            "title_similarity": "0.7149048",
            "sentiment_compound": 0.997
        },
        {
            "id": "gxynzq2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07498749"
        },
        {
            "id": "gxyp9lp",
            "score": 1,
            "text": "Except both statements are false.",
            "title_similarity": "0.34127983",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxyq6sf",
            "score": 1,
            "text": "I'd like to add an additional perspective.\n\n Body positivity mighty be a good thing. And here why: being obese (48% of US citizens are obese) is pretty unhealthy. But some people don't go to sports or a fitness center because they are ashamed of being fat. \n\nAnd this is where body positivity is a good thing: hey you are ok, even if you are fat. Join us at the fitness club! That is the right thing to do. Noone is laughing about you. Instead we think you are brave and do the right thing!",
            "title_similarity": "0.7522673",
            "sentiment_compound": 0.9761
        },
        {
            "id": "gxyqxfs",
            "score": 1,
            "text": "It's wonderful that you care less about the outward appearance than the content of someone's character, that's a commendable trait.\n\nHowever, the body positivity movement is less about convincing others that you are beautiful than it is convincing yourself that you are, or that if you prefer to be of a body type not typical of what society thinks you ought to have, that's okay.\n\nI am quite short (4'10\") and a lot of media depiction of short women is to be pixie-like. But, I'd rather be like Wonder Woman - muscular Wonder Woman - and have found positivity in my height and thick legs. I dead-lift easier, leg exercises (particularly squats and leg presses) are easier for me. Having calves and quads for days makes me feel beautiful. Having muscular arms and shoulders makes me feel even more beautiful because that's a lot harder for me to build and maintain. To hell what others think short women should be.",
            "title_similarity": "0.76790035",
            "sentiment_compound": 0.9847
        },
        {
            "id": "gxyt322",
            "score": 1,
            "text": "As a man that has been raised in western society I must disagree, in many many many cases a woman's worth is exclusively tied to her looks. Now is that ok? Obviously not, but as a society we want our women sexy and fuckable. Smart and creative? Nah who cares they are meat right? I mean that seems to be how we think anyway.\n\nThat's one thing I will say for kids these days like Billie that musician, she doesn't sexualize herself she's an artist not a piece of meat.",
            "title_similarity": "0.8535956",
            "sentiment_compound": 0.9652
        },
        {
            "id": "gxyu1qs",
            "score": 1,
            "text": "It has also harmed a lot of people. Obesity is directly linked to cancer, type 2 diabetes, heart disease, etc. we need to stress health, not looks. Body positivity for me is people loving themselves as they are-no matter who else sees it. Amputees are a big one. Burn victims, etc. I think the biggest failure of it all is thinking you can force and shame someone to believe as you do. I personally don’t find severely obese people attractive. However, my opinion of them should not affect how they view themselves. I have dated an amputee, and he was hilarious because he didn’t let people feel sorry for him. I think we need to start with changing our views of ourselves, instead of others",
            "title_similarity": "0.8028486",
            "sentiment_compound": -0.8807
        },
        {
            "id": "gxyu3qt",
            "score": 1,
            "text": "i know at this point its so popular that my comment is barely visible but this reminds me of a similar view on buddhism. One aspect there is \"non judgement\". But still some prefer to positivly judge something like a cold rainy day. This actually goes against this strict non judgement way (which is IMO the next step) but it is still better than a negative judgement, even if both judgements are aesthetically valid.\n\nIMO an inbetween move would be to differentiate between aesthetics and emotions.\n\n&#x200B;\n\nI don't know what you consider failing. its better than nothing. But its worse than the \"perfect solution\" (or the best known alternative). But the thing is that people can't go from 0 to 100. You can't teach a child about generalized relativity theory if you don't explain light first. Life is a progress and different people need different ideas and experiences to grow.",
            "title_similarity": "0.7026676",
            "sentiment_compound": 0.9754
        },
        {
            "id": "gxyu8lx",
            "score": 1,
            "text": "I kinda have the same opinion. Not sure if these comments can change my mind. The biggest problem is that it promotes obesity, which is actually a big health risk. Especially saying that it is healthy, as many COVID deaths can be traced to obesity. And on a primal level, most recent fashion changes are not that different from evolutionary instincts, but fat people never was. Especially since they cast them as models, it seems like they just pity them. If everyone is beautiful, no one is beautiful. \n\nNot tryna get downvoted, just more of some debate topics",
            "title_similarity": "0.7761269",
            "sentiment_compound": 0.8756
        },
        {
            "id": "gxyu8ql",
            "score": 1,
            "text": "I think it could also be argued that a movement where physical beauty isn’t acknowledged probably isn’t sustainable, at least in our lifetime or the next few. There are too many lifestyles, too many cultures, too many experiences to try to convert. Social media will probably never allow this to be possible based on the obsession in certain areas with physical appearance, to the point where there is a new almost unattainable standard that has never been there before (perfect body, hair, clothes, mostly due to photoshop.) What I find most frustrating is the need to homogenize how people view certain things about the world in general. I would discourage any sort of slander, superficiality, or biases about physical appearance but I wouldn’t discourage views on life that don’t affect another’s negatively in regards to beauty. There are multiple outlets for people to feel worthy in this world, and I think that’s better than just having one universal movement or answer to high self esteem.",
            "title_similarity": "0.73137754",
            "sentiment_compound": 0.8826
        },
        {
            "id": "gxyukcb",
            "score": 1,
            "text": "I don't know if I'm an exception, but what I see with my eyes isn't what I judge as beautiful or ugly.\n\nLike how some people seem to experience sound with colors, or feel colors and emotion with numbers, I strongly feel someone's beauty or ugliness based on their personality.\n\nIt's impossible to see someone as beautiful without knowing them. I would describe someone who's deceptive, lying, egocentric etc. as ugly and it doesn't matter how they look.\n\nThere's a pitfall here however: someone is too busy chasing beauty standards is probably not doing well in that regard and can also turn grumpy and self absorbed. Someone who has the looks might be surrounded only with positivity and thus learns that giving positivity is always good.\n\nSo looks and beauty aren't mutually exclusive but will probably have impact.\n\nSo I personally I feel it's more like \"Your beauty is not based on your looks\", rather than having to do with worth. Calling everyone beautiful doesn't work for me either, because I think some people are ugly and should do some self-reflection to work on themselves.\n\nIn raw understandable terms, here's two example scenes:\n\nA kid hugging a dog is a beautiful sight to behold.\nA fashion model kicking a cat is disgustingly ugly from the inside.",
            "title_similarity": "0.81125647",
            "sentiment_compound": 0.9917
        },
        {
            "id": "gxyumwc",
            "score": 1,
            "text": "Some people like ugly women",
            "title_similarity": "0.5267285",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gxyup3f",
            "score": 1,
            "text": "Unhealthy=unattractive. There’s just no getting away from that.",
            "title_similarity": "0.43147272",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxyurtv",
            "score": 1,
            "text": "The movement is to do away with one societal standard of beauty, particularly as it’s not accurate. You might be 150kg and find someone who finds you incredibly attractive, even though societal standards deem that impossible. This body positivity movement is to create a wider range of standards of attraction which is fantastic. As an anecdote, I’ve been told time and time again by friends and acquaintances that men in their lives (and themselves) refuse to date the body type they’re attracted to when the woman is overweight due to judgement from their peers. How sad is that? \n\nYou’re even claiming that the deviation from standard views of external beauty is ugly despite ‘not caring about it’. Not to mention the fact that intelligence, personality, mental stability, etc. have huge variables themselves. Surely you can see that there are societal standards in place for every aspect of simply existing as a human. \n\nYou’ve gone to the extreme and done away with judging yourself on appearance entirely. Is that acceptance or avoidance? Think about all the young women and men who had to grow up being told that a certain body type is attractive even when it’s impossible for them to attain due to the body type they were born with. Now think of all the young women and men growing up being told that multiple shapes and sizes are beautiful and you don’t have to feel ugly simply for existing.",
            "title_similarity": "0.85921854",
            "sentiment_compound": 0.9841
        },
        {
            "id": "gxyvd7k",
            "score": 1,
            "text": "its really a failure because it can't fix ugly. \n\nI agree with OP fundamentally- worth isnt dependant on beauty- but we live in a sex obsessed world and watching the hideous try to reclaim something because of the body positive movement has been largely an event of unwanted sexual advances. Theyre still looking for validation and that proves the movement is illegitimate. \n\nPeople should look within for the love they feel is missing. the person you need to love you unconditionally is you. thats beautiful.",
            "title_similarity": "0.8766656",
            "sentiment_compound": 0.9605
        },
        {
            "id": "gxyvn77",
            "score": 2,
            "text": "Some people are really beautiful and some people are ugly, it’s just the way God made us. Islam teaches us to be modest so we don’t focus on looks rather the inside.",
            "title_similarity": "0.7022786",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gxyvofr",
            "score": 1,
            "text": "I feel like Kung Fu Panda has done more for body positively than any campaign",
            "title_similarity": "0.55431366",
            "sentiment_compound": 0.1189
        },
        {
            "id": "gxyvowl",
            "score": 1,
            "text": "It’s exactly the same for BLM. The problem with BLM is the message should be about all Police abuse of power. BLM is a given and is not the real issue.",
            "title_similarity": "0.587715",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gxywja2",
            "score": 1,
            "text": "I’ve been on both ‘sides’ of this. I was overweight as a kid/early teen and do think it’s difficult for a regular weight person to understand how horrible you get treated as a fat person. Like, growing up for me was hell. At the same time, I think it’s indicative of a problem our society has; we alienate or trash anyone that doesn’t fit in with us culturally. I was addicted to opiates in my early 20’s and experienced how that behavior also applies to addicts. It really sucks being attacked for something about your physical appearance. \n\nBut, I don’t think it’s healthy to do the same thing that was done to me as a child to normal weighted people. A lot of the more extreme body positivity movements do exactly that.  There are a lot of problematic movements (like haes) that demonize people for their weight. Which is ironic, as theyre just continuing a cycle of bullying.",
            "title_similarity": "0.70879334",
            "sentiment_compound": -0.7554
        },
        {
            "id": "gxywo0c",
            "score": 1,
            "text": "Its almost exclusively perpetuated by unhealthy people to justify their unhealthy lifestyle. Edit- Unhealthy can mean many things, but I know what you all thought of first",
            "title_similarity": "0.6203687",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gxyxdsx",
            "score": 2,
            "text": "It should never have been about body positivity but instead treating all sizes with decency and respect. It got even worse when they started pushing “fat is beautiful”. Because we all know it’s not, and there’s nothing wrong with that. But I give the movement another 10 years or so when their beauty catches up to them.",
            "title_similarity": "0.7983301",
            "sentiment_compound": 0.9017
        },
        {
            "id": "gxyz51q",
            "score": 1,
            "text": "“If everyone is super(special, beautiful, etc.), no one will be.”- Syndrome [The Incredibles]",
            "title_similarity": "0.4653275",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxz0c03",
            "score": 1,
            "text": "No one cares if you hate fat women OP. All of them get laid way more than you do.",
            "title_similarity": "0.7100465",
            "sentiment_compound": -0.8116
        },
        {
            "id": "gxz0nbp",
            "score": 1,
            "text": "I wonder if this would even be an issue if everyone spent half as much time eating right and exercising as they do typing out some of these responses?",
            "title_similarity": "0.5008557",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxz0wi2",
            "score": 1,
            "text": "there is an aversion for obesity, and that s what the body positive movement tries to change. I dont like their methods but I do think we should accept obese people for what they are, without constantly reminding them that they are different and ugly. \"Oh but that ll make them lose weight if I bully them!\" is not a good argument",
            "title_similarity": "0.7434245",
            "sentiment_compound": -0.8966
        },
        {
            "id": "gxz1q57",
            "score": 1,
            "text": "You are assuming beauty <> value to society when we are surrounded by such examples.  It rings hollow.\n\nThere’s a reason people don’t like Brutalist buildings. They serve their function as buildings perfectly fine but most humans react poorly to working and living in them.\n\nFerraris are not designed purely for aerodynamic qualities, there’s a certain amount of styling involved to beautify the car.\n\nWhen presented with a cute puppy and an ugly puppy, most people would prefer to take home the cute one - with a minority of contrarians taking the literal underdog.\n\nBlockbuster movies are not filled with ugly people in lead roles, due to market forces.\n\nMona Lisa, objectively, is just a bunch of oil paint slapped on a canvas if we didn’t care about beauty.\n\nThis isn’t “corporations” telling people what to like - people are people and generally want to be surrounded by nice things, animals and other people if given a choice.\n\nSo body positivity saying “you are beautiful” is extremely important in trying to adjust the worldview of others to find beauty in non-typical appearances.",
            "title_similarity": "0.759182",
            "sentiment_compound": 0.9958
        },
        {
            "id": "gxz25j8",
            "score": 1,
            "text": "not gonna change your view, you're absolutely right in a way I nearly never read about.",
            "title_similarity": "0.43055287",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxz3u7i",
            "score": 1,
            "text": "Ideally you are right but in reality you are incorrect. Attractiveness is highly valued in relationships and in business. We are driven to embrace symmetry, strength, and beauty as signals of health and even fertility.  to ignore that is more work than our natural instincts.\n\nSo your real view is \"in the modern world where everyone is far healthier than our ancestors because of modern medicine and food, we don't need beauty or fitness anymore as indicators of health\".  True.  But people will like what they like.",
            "title_similarity": "0.8007891",
            "sentiment_compound": 0.985
        },
        {
            "id": "gxz3vdd",
            "score": 1,
            "text": "The movement is not a failure, Its quite successful in fact. It’s managed to harness denial of fact as a virtue, like every major religion. It’ll be here forever because a comforting lie is more convenient than a harsh truth and it creates a market segment of the perpetually obese and all their co-morbidities to be taken advantage of (also like every major religion).",
            "title_similarity": "0.7407222",
            "sentiment_compound": 0.9571
        },
        {
            "id": "gxz42sn",
            "score": 1,
            "text": "There is a bell curve for intelligence, beauty, strength and all other attributes... There will always be people unsatisfied with their position on the curve...  people just need to grow up and accept their position. Life isn't perfect and neither are you or me.",
            "title_similarity": "0.74371517",
            "sentiment_compound": 0.7907
        },
        {
            "id": "gxz5qau",
            "score": 1,
            "text": "People prefer to put bandaids on symptoms rather than taking the time to root out and address the fundamental problem",
            "title_similarity": "0.50335324",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxz9b5j",
            "score": 1,
            "text": "My take away in so many of these discussions, including political ones, is that short catch-phrases are a flawed and insufficient means of conveying meaning. We should focus on improving communication for a better understanding of each other rather than immediately choosing sides and lambasting those for or against a given phrase. \n\nTo this extent I agree with you, but as another user said, I think some see a value in plainly telling everyone they are beautiful. I expect that even among those who are not popularly considered beautiful, there would be disagreement as to whether they want to be called beautiful. Some would say it's \"patronizing\", others that it feels good to acknowledge beauty in themselves.",
            "title_similarity": "0.7688529",
            "sentiment_compound": 0.9544
        },
        {
            "id": "gxz9r4p",
            "score": 1,
            "text": "Also: not everyone is beautiful or worthwhile.",
            "title_similarity": "0.43288577",
            "sentiment_compound": -0.1891
        },
        {
            "id": "gxz9y9g",
            "score": 1,
            "text": "Here's the thing: if you tell someone their worth isn't at least partially dependent on your physical attractiveness in our society, you're just lying to them. Now admittedly, you are also just lying to some people if you tell them they are beautiful. What we really need to tell people is \"you're not going to possess every positive attribute that exists in a human and that is ok\".",
            "title_similarity": "0.8250694",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gxza4qs",
            "score": 1,
            "text": "Hmm, seeing as you are saying you agree with a lot of the movement.. This feels like more of a language issue. Particularly between \"attractive/beautiful\". Because there are qualities that make people attractive regardless of their weight e.g. confidence, and they can still have conventionally beautiful features! And I feel that the movement is trying to break the idea that there is only one way to be considered beautiful.",
            "title_similarity": "0.7363075",
            "sentiment_compound": 0.9601
        },
        {
            "id": "gxzb79r",
            "score": 1,
            "text": "Do you have any data to suggest that the body positivity movement is causing people to be less healthy? A reduction in anxiety via acceptance can make it easier to lose weight so it’s not necessarily a given that body positivity makes people more fat.... unless you have some evidence of this?",
            "title_similarity": "0.6099725",
            "sentiment_compound": 0.8949
        },
        {
            "id": "gxzblyt",
            "score": 1,
            "text": "Female politicians? Have you seen some if the female ministers of health around the world? No expectations lol",
            "title_similarity": "0.6003187",
            "sentiment_compound": -0.5983
        },
        {
            "id": "gxzbry6",
            "score": 1,
            "text": "Late to the discussion, but it's a very simple idea I wanted to throw out. When you're trying to pull a heavy object, you don't stand on the spot you want to move it to. You have to pull past that spot and drag the object behind you. This is doubly true if you have a lot of inertia or people pulling it in the other direction.\n\nAfter years of being told their appearance is negatively tied to their worth, you can't get them to a neutral place by telling them to ignore it, you have to step beyond that to positivity in order to pull them out of the negative.",
            "title_similarity": "0.66529155",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gxzcavn",
            "score": 1,
            "text": "What a lot of people seem to forget is that fat people and overweight people KNOW THEY ARE FAT AND OVERWEIGHT. They don't need to be constantly reminded or that. They live it! It effects every part of their live a lot of the time. \n\nBody positivity goal is to allow these people to just know they are worthy and how this world was built with them not in mind but they can still survive,  strive, and feel worthy and beautiful and sexual. It allows space for those to Express their experiences and share with other about their traumas and ways to navigate and find communities to where yes they are fat but they are more than that. Fat people can dance, do yoga, so pole dancing, be models, etc. They can do these things and should be recognized for it. Because representation matters as well as inspiring young people who may struggle with fluctuating weight but wont let that stop them. \n\nLet fat people decide how to represent themselves and what movements they wish to contribute to, and respect them as people with feelings, lives, and worth.",
            "title_similarity": "0.7012148",
            "sentiment_compound": 0.9812
        },
        {
            "id": "gxzcget",
            "score": 1,
            "text": "I was a 90s teen.  The trend was being thinner than a stick.\n\nWhen I was a freshman in HS, I was about a size 4-6.  It was the summer and I was about to head out with friends.  I had a pair of denim shorts on.\n\nMy mom stopped me before heading out and told me that my legs looked like tree stumps.  I walked up to my bedroom in shame and put jeans on.  20 years later, the only time I've worn shorts have been to the gym or to bed.  I still have her voice in my head telling me that.",
            "title_similarity": "0.431785",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxzcvgq",
            "score": 1,
            "text": "Be careful, the Reddit hive mind doesn’t take kindly to logical thought.",
            "title_similarity": "0.58767754",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxzfj4o",
            "score": 1,
            "text": "I was raised to believe beautiful meant more than being attractive. In fact, it didn't have anything to do with looks. Everyone IS beautiful. Except for serial killers, they're ugly.",
            "title_similarity": "0.7987087",
            "sentiment_compound": 0.5209
        },
        {
            "id": "gxzg621",
            "score": 1,
            "text": "I think I agree that Body Positivity has failed, or maybe people haven't bought it  but I don't think your alternative message is any better.\n\nI hope this isn't too controversial and I'm not trying to have a poke at anyone...\n\nI don't have numbers to back any of this up but I believe studies have shown that more attractive people tend to be more successful and obesitey is allegedly not good for health. Now you can argue as to if that's the case or how it's measured etc. but if it is true then if anything, telling people who are overweight that it's OK is actually more harmful to them.\n\nMaybe rather than a movement to reassure people, what would be better for them (and the health service and possibly society if their success pays back into community) is spending the time to try to help the people who aren't happy being overweight to get back to what's considered a healthy/attractive weight\n\n&#x200B;\n\nTLDR: if attractivness is an indicator for success and BMI an indicator for health, maybe the message shouldn't be about making people feel comfortable in their bodies but helping people who are uncomfortable to change",
            "title_similarity": "0.7775388",
            "sentiment_compound": 0.9925
        },
        {
            "id": "gxzgn59",
            "score": 1,
            "text": "The body positivity movement will always fail because there ARE ideals and the further you are from them the less favourable you are in society\n\nThis applies to literally every animal afaik and you can’t get rid of it by telling people they shouldn’t feel that way, that’s not how that works",
            "title_similarity": "0.74369025",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxzi25y",
            "score": 1,
            "text": "Exactly! Not everyone is beautiful and it's disingenuous to say they are. Do people have nice features? Yes. But even If they don't so fucking what?? Ugly people should be allowed to exist without the pressure to participate in this beauty parade. \n\nThe current movement creates people like that Trainor chick who is also toxic but is like \"actually no being fat is what's beautiful you other boney girls suck no one wants you\". Normalize stretch marks etc but don't be like \"they're beautiful and fierce\" they just fucking are and that's fine.",
            "title_similarity": "0.8645299",
            "sentiment_compound": 0.9498
        },
        {
            "id": "gxzikvo",
            "score": 1,
            "text": "You're a hero. Europe needs to hear this. They're the worst nowadays. Especially italy",
            "title_similarity": "0.5403657",
            "sentiment_compound": -0.128
        },
        {
            "id": "gxziqde",
            "score": 1,
            "text": "That's literally what they're saying already.",
            "title_similarity": "0.11136308",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxziv7v",
            "score": 1,
            "text": "Everyone is beautiful to someone, but someone might not be beautiful to everyone. Really the only way for me to try and explain it.",
            "title_similarity": "0.66272527",
            "sentiment_compound": -0.4155
        },
        {
            "id": "gxzjh7e",
            "score": 1,
            "text": "Beauty is in the eye of the beholder. While outward beauty is easy to see, inner beauty can be faked or hidden making it harder to trust. I think people know how bad we can be but trust what they can see and feel. It sucks but that is the reality of it. Outward beauty represents an ability to take care of yourself to the naked eye. If you look even remotely good you get a date right away if you don’t you get passed up because if they see you not taking care of yourself they wonder if they can rely on you to not only take care off yourself but also *them*.\n\nSomeone said something along these lines to me when I was depressed and ugly from lack of self care. I truly hated myself at that time but I made a lot of changes because I needed to change. I’ve had this typed out but I didn’t push reply because I’m sure that I’ll take flak for it but it really helped me.",
            "title_similarity": "0.85236806",
            "sentiment_compound": 0.9025
        },
        {
            "id": "gxzjr14",
            "score": 1,
            "text": "Oh this post again? On Reddit? No way how original, OP! I support body positivity. However, I do not support brain dead morons who make the same rehashed post on here and r/unpopularopinion every other god damn day acting like they have a unique opinion. I don't want you to feel okay about yourself. You are not beautiful and no one loves you.",
            "title_similarity": "0.75772595",
            "sentiment_compound": 0.607
        },
        {
            "id": "gxzjynb",
            "score": 1,
            "text": "The body positivity movement failed because fat people who refused to address their rapidly declining health, co- opted the BPM more or less, attracting more people of that persuasion and alienating people who the BPM was originally meant for. I'd imagine the alienation was because obese people took over the movement, and when any single group becomes a majority in a movement, they turn it into a \"x\" person only club.\n\nTLDR fat ppl ruined the fun for everyone.",
            "title_similarity": "0.7799308",
            "sentiment_compound": -0.0076
        },
        {
            "id": "gxzk1iv",
            "score": 1,
            "text": "There is no body positivity movement for men. If you’re short, obese, have a small penis, or are not a traditionally handsome man, then it is likely that you will be ostracized for it. It is entirely socially acceptable to do so.\n\nIn pop culture we talk about how celebrities like the Kardashians, toys like barbies, and sexual advertisements have a negative effect on a young woman’s body image, but we never talk about how aspects of culture may effect a young man’s body image and self-worth. IE The vast majority of Hollywood action stars use performance enhancing drugs, use extreme diet practices, and diuretics to achieve a physique that can only be maintained for a couple of hours. Action figures like superheroes, GI Joe, or WWE wrestlers have 20 inch biceps, a giant chest, and an ever present 12 pack, etc. Some of these beauty standards are not possible regardless of one’s drug use, cosmetic surgery, or genetic potential. A significant amount if not a vast majority of elite athletes are also on performance enhancing drugs to achieve excellence as perceived by society. A huge amount of teen boys take useless supplements that are marketed by drug abusers who lie about their performance enhancing drug use while saying that if you take this product, then you too can achieve this physique that the PED user was only able to maintain for a single photo shoot. Many of these grey market supplements contain exotic anabolic steroids that are formulated to bypass laws and regulations. A young boy could cause permanent developmental problems while taking these compounds. The vast majority of people in the fitness industry take performance enhancing drugs and the vast majority lie about their use. Most men and women in-general have no idea what the maximum genetic potential of a natural physique even looks like because so many influencers are on the sauce.\n\nSource: I am a man who has taken every performance enhancing drug in every magnitude of dose and logical combination. Started strength and conditioning training in elementary school.\n\nIf a young man approaches me in the gym and asks me for advice, then I always tell the truth. Men under 25 shouldn’t take performance enhancing drugs. I started 3 weeks before my 21st birthday. I’m 26 now. I don’t regret it, but most don’t have the knowledge of biomedical science that I do, nor do they hire a medical doctor who is nationally ranked bodybuilder to help with harm reduction. It is impossible to know if my drug use caused any developmental changes to my brain or the rest of my physiology.",
            "title_similarity": "0.7794299",
            "sentiment_compound": 0.8928
        },
        {
            "id": "gxzkobf",
            "score": 1,
            "text": "People always have and always will be judged based on their sexual attractiveness. Both men and women.\n\nIt's a nice thought but it's never gonna happen.",
            "title_similarity": "0.8245655",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxzlgtu",
            "score": 1,
            "text": "OP, I just want to thank you for this. I've needed to hear this my whole life.  <3",
            "title_similarity": "0.35146853",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gxzlkij",
            "score": 1,
            "text": "I think it’s a good idea to frame beauty in an evolutional lens. Beauty is shorthand for health. Symmetry begins in utero. A mothers nutrition, health, and stress affects a developing fetus. Acne can signals poor diet, hormone imbalance, lack of hygiene or stress. In cultures where food is scarce, being curvier is seen as beautiful. In our culture, where there is an abundance of high sugar low nutrition foods, thinness is seen as attentive. Pale skin was seen as the ideal because it meant that you were wealth enough to not have to do back breaking labor in the sun. Now when everyone is inside all the time, tans are see as attentive because it signals you have a lifestyle where you have time to be outside. Beauty is one part biological signaling, one part cultural norms, and one part personal preference. \nTo say morbidly obese people are beautiful denies the biological factor. At the same time, being cruel to those people doesn’t help them believe they can change and help them live healthier lives. \nNo one should base their worth on their looks but that is not really why beauty is important socially. Beauty is a signaling device to help the animals we are to pick healthy mates for the chances of having health offspring.",
            "title_similarity": "0.755814",
            "sentiment_compound": 0.963
        },
        {
            "id": "gxzog9w",
            "score": 2,
            "text": "I think there’s different approaches to body positivity/acceptance that work for different people, and as long as they aren‘t devaluing to other people‘s bodies or types, they‘re all „good“ in their own right. \n\nThere are people who find most inspiration and comfort in seeing large people pose in swimsuits. There are women who learn how to accept themselves when a woman with a slim body type shows what her body looks like in pictures when she’s not posing. There’s people that don’t find either of those very helpful, but instead like when stretch marks are bedazzled or written into poetry. There‘s people that really do find it more natural to take a pragmatic „just because something doesn’t look nice doesn’t mean it’s „bad“ approach to things, but that probably won’t work for the person that responds to things like „tiger marks“. \n\nNo approach is perfect or befits all people, but I think as long as their respective audience benefits from them, it’s fine and not a „failure“.",
            "title_similarity": "0.69675666",
            "sentiment_compound": 0.9855
        },
        {
            "id": "gxzr6hn",
            "score": 2,
            "text": "Who are you to say who is beautiful and who isn't? What standards are you basing this on? \n\nPersonally, I think everyone has some beauty to someone.",
            "title_similarity": "0.6524457",
            "sentiment_compound": 0.8426
        },
        {
            "id": "gxzrtzh",
            "score": 1,
            "text": "You should not should",
            "title_similarity": "0.22491628",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxzs757",
            "score": 1,
            "text": "What do I get if I change your mind?",
            "title_similarity": "0.14443064",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxzz02u",
            "score": 1,
            "text": "Two things. You can have someone feel like they're beautiful for being fat, and also think they're worthwhile for being smart etc.\n\nAlso, beauty isn't separable from health. Health is generally a measure of how you get along with the ecosystem, if you have a variety diet and social enmeshment with your own and other species, you'll thrive. since we are going through a period of ecosystem loss and mass extinctions, the measures of health have been distorted.",
            "title_similarity": "0.7091993",
            "sentiment_compound": 0.8834
        },
        {
            "id": "gy030nk",
            "score": 1,
            "text": ">(Consider the much harsher standards of physical appearance that female politicians have to endure.)\n\nWhat is your evidence of this?",
            "title_similarity": "0.6641467",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gy033u2",
            "score": 1,
            "text": "Welp this is a shit show.",
            "title_similarity": "0.3084922",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gy08lh1",
            "score": 1,
            "text": "Beautiful women  have incredible privilege. What you do with that privilege is where character comes into the equation. Some will use that privilege to build an amazing life and grow as a person, others will use it solely for material possession and be bitter when their looks go and the privilege goes with it.",
            "title_similarity": "0.75804794",
            "sentiment_compound": 0.9348
        },
        {
            "id": "gy3bwsx",
            "score": 1,
            "text": "Western society is far to focused on not hurting someone's feelings, even if it's for their own good. Sometimes you just have to tell someone put down the spoon. Shame is a powerful tool when used right",
            "title_similarity": "0.7129769",
            "sentiment_compound": 0.7549
        },
        {
            "id": "gybad0w",
            "score": 1,
            "text": "Yeah face plays a big part there’s some big ass people with very attractive faces but huge bodies",
            "title_similarity": "0.33036786",
            "sentiment_compound": 0.5989
        },
        {
            "id": "gyd4b8l",
            "score": 1,
            "text": "Plus obesity  contributes to a myriad of actual interpersonal and health problems.  It should not be vaunted.  Accepted, yes.  But if everything boils down to \"beauty\" then ask yourself if obese or fit sex is better... People can actually hurt themselves during sex if they are working with an obese partner.  Obesity shouldn't be punished.  Health should be actively pursued, though.  Duh...",
            "title_similarity": "0.7753229",
            "sentiment_compound": 0.9255
        },
        {
            "id": "gydekuk",
            "score": 1,
            "text": "It's so easy to be disatisfied with your own body, when we are bombarded with unrealistic models of perfection all around us.  This leads to a lot of needless unhappiness.  It's a really positive thing to see throught this manipulation and to be able to appreciate that there is beauty in every body.   However, to say that \"your worth is not dependent on your beauty\" is just wishful thinking.  In this world beauty has value and those who are lucky enough to be born more beautiful (both women and men) will enjoy many benefits including a whole bunch of improved life outcomes.    Life is not fair, we get dealt a hand of cards when we are born and some people get better cards than others.   We might not like it, but that's how it is.   As a society we can try to redress some of this unfairness - in effect by getting the more successful to subsidise the less successful.  That's probably a good way to manage a democratic society, but we must not fool ourselves by denying that differences exist.   \n\nSo to summarize:  I'd disagree with you that \"body positive\" is a failure, it is good to appreciate the beauty in every body.    I also have to disagree when you say that \"your worth is not dependent on your beauty\" - not all of your worth for sure, but some of it is.",
            "title_similarity": "0.83353615",
            "sentiment_compound": 0.9951
        },
        {
            "id": "gzpudp0",
            "score": 1,
            "text": "It’s just hard to believe that beauty doesn’t matter when all the beautiful people are with other beautiful people ( obviously it’s a bell curve but bear with me)\n\nIf an ugly person had the chance to be beautiful and risk nothing personal I find it hard to believe they would pass it up. \nAs for ‘society’ telling people that their beauty is important I’m afraid to say that’s their inner voice telling them that. Nobody goes around saying I look like a bag of ass. I just know I look like a bag of ass. And when I get my act together and put effort in my looks I’m also the one telling myself I look good.",
            "title_similarity": "0.8756516",
            "sentiment_compound": 0.9267
        },
        {
            "id": "gzyyksd",
            "score": 1,
            "text": "I think it's probably been said here a lot already but I agree that to simply say \"beauty is worthless\" just creates a void that needs filling. But I also think saying, \" you're bigness is worthwhile\" is also unhelpful. I think you need to have a concrete, objective reason to say that beauty is worthless and something else is worthwhile, because our culture still very much disagrees and values beauty highly and subjectively.\nI have what I believe is objective reasonings but I don't think many would like it.",
            "title_similarity": "0.81441736",
            "sentiment_compound": 0.9762
        },
        {
            "id": "h0qkeuq",
            "score": 1,
            "text": "In the past three months, the way I see myself has changed drastically, but my appearance hasn't. \n\nI just started posting nudes on reddit and admitting in the comments all the insecurities I had, and gravitating toward the people who could explain exactly why my \"variations from the average\" are sexy to them. Then I began to find the subreddits dedicated to them and posting there. (shout-out r/hangingtits lol)\n\nThe ONLY thing that changed is that I started frequently hearing compliments, and I learned that variations in human bodies are not simply \"the pretty kind\"  or \"the ugly kind.\" There are preferences. The people with preferences for my body think I'm pretty, and they tell me, and without changing anything about how I look, I believe it now. \n\nSo it turns out what needed to change was *my ability to broaden what I personally understood beauty to mean* to include myself. That's what the body positivity movement is - it's not about \"In the past three months, the way I see myself has changed drastically, but nothing about my appearance has changed.  \n\nThat's what the body positivity movement is - it's not about \"making ugly people believe they're hot\", it's about teaching that there are tons of options for what hot can be.\n\nWhile having preferences is perfectly normal, deciding that those who don't fit your preferences are \"ugly\" is immature and unnecessary. That especially goes for self-talk! 💜💕",
            "title_similarity": "0.70442057",
            "sentiment_compound": 0.9951
        },
        {
            "id": "h0rsfcf",
            "score": 1,
            "text": "In response, the body positivity movement has never said that \"everyone is beautiful.\" The movement's goal is to promote a healthy body image.",
            "title_similarity": "0.59761107",
            "sentiment_compound": 0.91
        },
        {
            "id": "h2hwi5b",
            "score": 1,
            "text": "I think an analogy might help this common misunderstanding. Let’s say everyone pressures students to go into law, medicine, or engineering, and there’s lots of pressure to fit into one of those molds to be successful. A career positivity movement might say, “there’s lots of other ways to be successful other than doctor, engineer, or lawyer. Let’s be inclusive and mention other professions that are just as fulfilling!”\n\nDoes this mean the “career positivity movement” is saying that a person who graduated Harvard Med and is a famous neurosurgeon is just as successful as a person in a minimum wage, dead end job with loads of debt? Obviously not. It’s telling the kid who finds engineering boring that they don’t have to change who they are to measure up. Maybe they’re an awesome artist that can run an art museum, do interior design, draw for a cartoon, design ads for companies, etc.\n\nSimilarly, the phrase “you don’t have to be stick thin to be beautiful” doesn’t mean you have to find morbidly obese people as gorgeous as Angelina Jolie. It’s encouraging women who are curvier to look up to people like Christina Hendricks for beauty goals, rather than trying to emulate Kate Moss. Similarly, it’s encouraging women who have a lightning fast metabolism and can’t put on weight to avoid getting risky butt implants so she can look like Kim Kardashian. Like, there’s plenty of reknowned beauties that don’t have hourglass figures.",
            "title_similarity": "0.6679504",
            "sentiment_compound": 0.9879
        },
        {
            "id": "h6ovibk",
            "score": 1,
            "text": "The problem with snuffing out an ideal is that there's nowhere to go when its gone but down. It's totally dishonest to say that \"everybody is beautiful by default\" when there are scientific measures of it...symmetry for one. Why not chain smoke 20 years in direct sunlight if beauty no longer exists? Because everybody acts as if it does and these rationalizations are just a way to play the game of universal popularity...as if having no morality at all is an ideal. That magnanimous lie will fall apart if your friend tells you he wants to start smoking meth. If you have a shred of humanity left at least.",
            "title_similarity": "0.76139045",
            "sentiment_compound": 0.9301
        },
        {
            "id": "hc9itbe",
            "score": 1,
            "text": "One very wise man once told me, \"if everything is, then nothing is\"\n\nIf we all are blind, no one is blind. It is only the ones who have eyes who are sighted.\n\nIf everyone is beatiful, nobody is. Simple as that. But they insist on focusing on the is instead of the isnt.",
            "title_similarity": "0.6017288",
            "sentiment_compound": -0.274
        }
    ]
}