{
    "CMV: It should be illegal for huge media company's like CNN or Fox News to magnify or spread false information.\nThere is absolutely no point in doing so. It only makes the world worse.  People rely on the news for everything. You look at the news for weather, information on presidential candidates, information on what's going on around your city, and SOO much more. False information like this really fucks with people's lives and their opinions on important issues. I'm not saying one media company is good to watch and one wrong but look at how many lies fox news has said about the election. If a newscaster wants to state their opinion, they should be obligated to say it is only an OPINION.  Im open to people CMV.": [
        {
            "id": "gy1ullf",
            "score": 1,
            "text": "/u/skrtskrt1221 (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nbxfv5/deltas_awarded_in_cmv_it_should_be_illegal_for/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.49055958",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gy26qc5",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1386511"
        },
        {
            "id": "gy1tnxw",
            "score": 0,
            "text": "CMV: It should be illegal for huge media company's like CNN or Fox News to magnify or spread false information.\n\nLet us try rephrasing that a little:\n\n1. “It should be illegal for huge media companies like CNN or Fox News to magnify or spread false information.”\n2. “Huge media companies like CNN or Fox News should be prosecuted for magnifying or spreading false information.”\n3. “The Department of Justice should prosecute huge media companies like CNN or Fox News for magnifying or spreading false information.”\n4. “The head of the Department of Justice (the Attorney General) should prosecute huge media companies like CNN or Fox News for magnifying or spreading false information.”\n5. “William Barr should have prosecuted huge media companies like CNN or Fox News for magnifying or spreading false information.”\n6. “Trump minion William Barr should have prosecuted huge media companies like CNN or Fox News for magnifying or spreading false information.”\n7. “Trump minion William Barr should have prosecuted huge media companies like MSNBC for magnifying or spreading false information.”\n\nIs that what you are hoping for, that Trump could have shut down MSNBC?  If not, where do you think the chain would have ended?",
            "title_similarity": "0.88508224",
            "sentiment_compound": 0.9587
        },
        {
            "id": "gy36c47",
            "score": 0,
            "text": "Please don't \"both sides\" serious issues like this. It just feeds into the same misinformation you claim to want to fight. \n\n&#x200B;\n\nCNN might thrive off of the 24hour news cycle but they are very clear when they are dealing with news and opinion. They verify their sources and reporting. To make the claim that CNN is just \"Left Wing Fox\" is completely off base. \n\nFox news has a news division that nobody watches. These reporters are \"generally\" good. The issue with Fox news is that they promote their opinion people and then claim to be \"fair and balanced\" while arguing in court that no reasonable person would believe it. \n\n&#x200B;\n\nThis is not a \"media\" problem, this is a fox news problem. Don't claim otherwise.",
            "title_similarity": "0.8661834",
            "sentiment_compound": 0.7775
        },
        {
            "id": "gy2z3yc",
            "score": -1,
            "text": "Stop putting cnn and Fox News in the same boat. That is the issue. That Fox News has tricked you all into putting them on an actually news channels level. \n\nIt’s not “even”. It’s not the “same on both sides”. Stop it.",
            "title_similarity": "0.8499127",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gy21xl8",
            "score": 0,
            "text": "Who gonna be the arbiter of “false information”? Zuck? Ted Cruz? AOC? TucKKKer? Qanon Marjorie?",
            "title_similarity": "0.53051955",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy271u8",
            "score": 0,
            "text": "Fox started as a tabloid network. That’s why their reports are slanted and weird. I half believe their anchors know it’s all baloney but just do it for the ratings. As long as they can find people who believe it’s real, it’s good for ratings. I’ll bet there’s a lot of laughter about their viewers behind the scenes.",
            "title_similarity": "0.6717513",
            "sentiment_compound": 0.8316
        },
        {
            "id": "gy364b8",
            "score": 0,
            "text": "What sort of disinformation is CNN pushing? I dont see CNN as comparable to fox when it comes to blatant lies",
            "title_similarity": "0.74742156",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gy21ns3",
            "score": 0,
            "text": "Says the guy that says \"company's\"",
            "title_similarity": "0.2029673",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2asf3",
            "score": 8,
            "text": "The media is tearing the world apart",
            "title_similarity": "0.55999523",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy30ki2",
            "score": 4,
            "text": "CNN is too dirty to even wipe my butt with, but more laws and more gov't shouldn't be the solution to every problem.",
            "title_similarity": "0.8592679",
            "sentiment_compound": -0.7872
        },
        {
            "id": "gy3xc5m",
            "score": 5,
            "text": "I agree. I hate CNN because of their clear bias but conservative news networks aren’t innocent in doing the same thing. The crusade against Trump was a prime example of this. Someone being “mean” is not a relevant topic when it comes to doing their job. Trump did his job as a president and he did it well. You don’t have to like someone or think they’re nice for them to do their job well. There are plenty of people that are nice and people like that are terrible at their jobs.\n\nLook at all of the shit going on right now that has resulted from the Biden administration. The gas prices, the shortages of shit, the jobs, the debt, etc. Not everything that sounds good or sounds like “the right thing to do” is a good idea and we’re suffering because of it. It is not the job of the American president to make up for the lack of leadership of other countries. Why is it the American presidents job to take care of Mexican nationals? Why isn’t the Mexican president getting shit for that? An American can’t go to Mexico illegally and have it be fine and dandy so why should the opposite be true?",
            "title_similarity": "0.878502",
            "sentiment_compound": 0.9701
        },
        {
            "id": "gy2vywr",
            "score": 5,
            "text": "The media is destroying and dividing our society.  Only way to combat this is to setup a system wear they pay dearly, in $, when they act irresponsibly.  Go after their wallets and this era of fake news will end.  \n\nCNN at this point is literally manufacturing fake news at will.  That spa shooting turned “Asian hate” was a complete lie.  Authorities never tied anything racial to that shooting.  NOTHING.  Yet CNN printed article after article pitting white supremists against innocent Asians.  They sowed anger and hatred and divided people.  \n\nTHIS WAS PLAIN WRONG and should be illegal. Please, how do we fix this and save our children?",
            "title_similarity": "0.8807321",
            "sentiment_compound": -0.9597
        },
        {
            "id": "gy2w03p",
            "score": -48,
            "text": "After reading some comments here, I just have to say WOW. It actually works pretty good if you make it illegal to spread false information. Here in Germany it is against the law. For example you are not allowed to deny the holocaust. And that is fucking good. You all are scared, that the government could control to much? Your press is controlled by a few people who can write and show whatever they want. Even though you can say whatever you want (except fuck or anything else they don't like because they will censor that) the USA is far behind Germany when it comes to freedom. Let that sink in. Even though you can say everything you want you still have [less](https://rsf.org/en/ranking) freedom. Sounds paradox right? Maybe you all are worried because you know that there is so much wrong in this country. I mean in Germany isn't everything perfect, there are some shitty things as well, however everything you critice, works perfectly well here..\n\n\n\nEdit:\nI will not answer anything anymore because it doesn't lead to anything.\n[Here ] (https://worldpopulationreview.com/country-rankings/freest-countries)  you can see that Germany is indeed really free and in personal und Human freedom it is more free than the US.\nThe fucking point is: If you ban hate speech and fake news it doesn't lead to less freedom. In this comment are two links, but if you search for more you'll see that I'm right. So peace out.",
            "title_similarity": "0.7925562",
            "sentiment_compound": 0.9323
        },
        {
            "id": "gy1tp3h",
            "score": 14,
            "text": "On the contrary, Fox went to court, and won, the right to call itself entertainment, not news.  So it gets to lie all it wants.  That ship has sailed, OP.  I believe you owe me a delta.",
            "title_similarity": "0.6178305",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gy1r62r",
            "score": 117,
            "text": "It already is illegal, it's called slander. Fox News is being sued right now by Smartmatic and Dominion for alleged misinformation Fox pundits promoted over their voting machines.",
            "title_similarity": "0.82070315",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gy226ww",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.1386511"
        },
        {
            "id": "gy2jgtv",
            "score": 0,
            "text": "Define truth. Without using other synonyms or antonyms. [+]",
            "title_similarity": "0.27882767",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy2ku4t",
            "score": 0,
            "text": "This isn’t even debatable. Only opposition is capitalistic financial gain. Not opposed to capitalism, but this factor of it is the parasitism that leads to it’s downfall. Exploitation, though fair game within the rules. We should be better than this.",
            "title_similarity": "0.5669894",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gy2lw69",
            "score": 0,
            "text": "They don’t force you to watch, and you don’t have to be compelled by anything they produce. Seek out journalism you deem fair and ignore the nonsense.",
            "title_similarity": "0.5164112",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy2mvkf",
            "score": 0,
            "text": "They’re doing this with the ethnic cleansing of Palestinian people as we type",
            "title_similarity": "0.39525414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2r9o8",
            "score": 0,
            "text": "Sigh.\n\n*companies",
            "title_similarity": "0.123890266",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gy2r9yf",
            "score": 0,
            "text": "True. But I think the problem is defining “false information”...CNN and FOX would define it VERY differently",
            "title_similarity": "0.6719371",
            "sentiment_compound": -0.3919
        },
        {
            "id": "gy3mzlz",
            "score": 0,
            "text": "You sound like a conservative.",
            "title_similarity": "0.16009802",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy3owhf",
            "score": 0,
            "text": "CNN is not the equivalent to Fox News though",
            "title_similarity": "0.5689914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy42u1h",
            "score": 0,
            "text": "Hilarious that you lumped these two networks together as though they are equally guilty of this behaviour.",
            "title_similarity": "0.514952",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gy431wk",
            "score": 0,
            "text": "It already is illegal. Whew that was easy.",
            "title_similarity": "0.2926749",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gy49qfc",
            "score": 0,
            "text": "CNN doesn't",
            "title_similarity": "0.36582208",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy4b7eo",
            "score": 0,
            "text": "Trump supporters: “ummmm yeahhhh",
            "title_similarity": "0.2986375",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy4d3xa",
            "score": 0,
            "text": "This is already what they do - it's why the \"Tucker Carlson/Rachel Maddow\" defense works. When they say, \"No reasonable person would believe this was a truth claim,\" they are saying that the folks watching this show reasonably should understand this is just the talking head's opinion.\n\nAnd Fox News isn't really news - they simply SEEM like they are news when they are mostly shows about the news. That individuals need to pay more attention to details, such as when an article is an \"opinion editorial\" versus when it is \"reporting\", is a result of the difficulty in prioritizing free speech over true speech so that the truth cannot be CONCEALED as was done in this past administration (yes, other administrations too, but we've got Watergate Levels of corruption being released thanks to FOIA filings).  \n\n\nIt's actually already illegal for media companies to spread false information - that's what the Dominion lawsuits with Fox and OAN are accomplishing. They are suing them for defamation, and it will be costly to be sure.   \n\n\nIf you want more truth in reporting, you need to support legislation that eliminates the ability for politicians to make money promoting legislation at the end of the day. Because what you are seeing is a result of how news media is monetized because of corporate spending to influence governmental legislation.  \n\n\nWhether its an election or just AT&T wanting to raise the rates on folks watching YouTube videos and not paying for Cable, news organizations get paid for writing about what's going on in the world. So news organizations and media companies are incentivized to make things as scary as possible to get as many people as curious as possible to read their stories. That way, they have more readers, and more advertisers are willing to spend to get their ads where the readers have their eyeballs. But it goes deeper than that even, thanks to how much money there is in influencing legislation via promotions, such as paying pundits to shape the conversation: [https://www.jacobinmag.com/2020/11/tucker-carlson-speaking-fees-private-equity](https://www.jacobinmag.com/2020/11/tucker-carlson-speaking-fees-private-equity)\n\n&#x200B;\n\nHowever, publicly funded elections, and limiting political advertising only to public channels such as PBS, local radio, and town hall meetings would drastically change things. After all, while any news reporter could choose to do a story on a candidate if they'd like, media companies would not be able to take money for an opinion  editorial that would influence a vote or legislation. Fox News wouldn't be able to be so nakedly partisan, because instead of getting paid by \"Citizens For Trump\" they would have to rely on advertising dollars.",
            "title_similarity": "0.8051073",
            "sentiment_compound": 0.9703
        },
        {
            "id": "gy4hs70",
            "score": 0,
            "text": "I like how you put CNN and FOX in the same sentence like they peddle anywhere near the same amount of misinformation.",
            "title_similarity": "0.4413352",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gy4mzcs",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.1386511"
        },
        {
            "id": "gy4o8ba",
            "score": 0,
            "text": "And who would constitute what is true ? The government? Sounds a bit orwellian. The thing is that no one is capable of unbiased reporting or always knowing the truth because sometimes it's really hard to reach. What I think would help though is if news sources were transparent and stopped masquerading as unbiased and rather stated their biases and political leanings upfront and then you may get an understanding trough what kind of lens they view the world and then you will be able to know where they might be misleading.",
            "title_similarity": "0.8151052",
            "sentiment_compound": 0.5316
        },
        {
            "id": "gy4qo4q",
            "score": 0,
            "text": "Why’d you put “CNN”? What false information have they put out? Sounds like a shitty attempt at both siding a one sided issue.",
            "title_similarity": "0.75758654",
            "sentiment_compound": -0.3527
        },
        {
            "id": "gy1r11p",
            "score": 16,
            "text": "I agree in theory the issue is the nitty gritty of enforcing such a thing. \n\nDId they deliberately lie or were they misinformed? \n\nWas it a lie or a joke? \n\nwe dont want to prosecute people for mistakes or jokes and its hard to know the difference without being able to read minds. \n\nSomething i think would be more reasonable is make it so that news sources are obligated to publicly correct themselves when they are shown to have said something untrue. This should be obligated to be in the same format as the lie was told so they cant hide the correction.",
            "title_similarity": "0.7536986",
            "sentiment_compound": 0.5232
        },
        {
            "id": "gy1voq5",
            "score": 10,
            "text": "Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, *or of the press*; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.",
            "title_similarity": "0.70746934",
            "sentiment_compound": 0.6336
        },
        {
            "id": "gy1t9v3",
            "score": 7,
            "text": "Imagine a politician determining what is Truth and what is false information?  That is a power that would be abused Day one.  You could say that an independent body should oversee but who appoints and oversees said 'independent body'.  Look how the SCOTUS has been politicized.",
            "title_similarity": "0.68817246",
            "sentiment_compound": -0.128
        },
        {
            "id": "gy1us31",
            "score": 1,
            "text": "It use to be until the Reagan administration eliminated the Fairness Doctrine",
            "title_similarity": "0.41179803",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1xixm",
            "score": 1,
            "text": "The issue is that sets a president where the government decides what's true... like say the ministry of truth... and well anyone who knows anything about history knows how horrific that gets.",
            "title_similarity": "0.69584244",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gy215nr",
            "score": 1,
            "text": "I agree with you. The issue everyone seems to have with this is \"WHO GETS TO DECIDE THE TRUTH!!\" which in itself exposes the major issue...there is no real truth for some people. If we are deciding it, if other people can ignore it, if its open for debate, you could argue that people don't want the truth; or like in a few good men , \"You can't handle the truth.\"\n\nLies politically are so powerful. It's easier to manipulate people to do what you want than reason with them. It seems like people are more motivated by hate than love.\n\nI say all of this because people in the comments are saying, \"Who decides the truth.\"\n\nIf I became the god of truth tomorrow and knew everything, was omniscient and all that good stuff- say I opened up a test where people could ask me anything and I had a 100% accuracy rating. People who didn't like my answers would still doubt me, call me a liar and say I was spreading fake news.\n\nthe truth is decided by evidence, data, logic, reason. There are people who would scream, \"WHERE'S THE DATA COMING FROM!!!\" People look at the truth, look at the proof and choose the lie.\n\nIf the government formed an office called , \"the bureau of truth\" and had 100,000 computers fact checking and the most educated minds obligated the job regardless of political belief, people would still doubt the truth.\n\nfor this reason, you are right, the media should be punished for spreading lies because some people lack the ability to form thoughts based on logic and reasoning. \n\n\"BUT WHO DECIDES WHAT'S THE TRUTH.\"\n\nand we are back to the start.\n\nIn Idiocracy, when the plants finally started to grow the people were like ,\"WOW PLANTS, water works,\" and they started to use water. Are we dumber than those people? I think so.",
            "title_similarity": "0.7523613",
            "sentiment_compound": 0.9432
        },
        {
            "id": "gy243l9",
            "score": 1,
            "text": "Have you ever heard of the fairness doctrine that was repealed by the Reagan administration?",
            "title_similarity": "0.46059394",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2cpwc",
            "score": -1,
            "text": "I’ve started to land on two thoughts on this issue. \n\nFirst, everyone always jumps immediately to the issue of ‘who decides what is true?’ This is absolutely an important issue. But I think this misses the main issue. There are some things that are really easy to demonstrate as false, untrue, or mischaracterized by being taken out of context. For example: did Hillary operate a sex trafficking ring out of a pizza parlour? No. Has Matt Gaetz been credibly accused of giving money to minors for sex? Yes.\n\nSecond, I think how information is conveyed is important. If you assert something is true without evidence, you are an idiot or a ideologue. It’s irresponsible for powerful media players to claim something is true without actually confirming/trying to confirm that it is true. They should be obligated to fact check, and if they don’t have proper evidence, they shouldn’t report or they should be clear in saying they do not know something is a fact. They should be required to diligently follow up and find the facts, to the best of their abilities. If something that is asserted on a media platform that is later proven to be false by way of evidence, there should be consequences.\n\nWho decides? I don’t know. For some issues it’ll be easier to hold liars accountable because the evidence will be easier to come by. I think it’s probably in our best interest to deal with the easily provable problems while we look for ways to deciding on issues where what is true or false are not as clear.",
            "title_similarity": "0.6536964",
            "sentiment_compound": 0.992
        },
        {
            "id": "gy2gwmn",
            "score": 1,
            "text": "I agree with you. People tend to confuse \"freedom of speech,\" with \"freedom to lie with impunity.\"\n\nThere are a few ways I could see carrying this out. \n\n1. As I've previously proposed on here, the idea of licensing journalists seem like it could be promising. Similar to how several states don't allow you to have \"Engineering\" in your biz name unless you are a licensed Professional Engineer, why not the same thing with \"Journalist\" or \"Reporter?\" \n2. Even something as simple as bringing back the [Fairness Doctrine](https://en.wikipedia.org/wiki/FCC_fairness_doctrine) would go a long way. And it's not like it's a new idea - we had it here in the US until Reagan began dismantling it in the 80s. This is what allowed things like Talk Radio and Fox News to grow. \n\n>The 1987 repeal of the fairness doctrine enabled the rise of talk radio that has been described as \"unfiltered\" divisive and/or vicious: \"In 1988, a savvy former ABC Radio executive named Ed McLaughlin signed Rush Limbaugh — then working at a little-known Sacramento station — to a nationwide syndication contract. McLaughlin offered Limbaugh to stations at an unbeatable price: free. All they had to do to carry his program was to set aside four minutes per hour for ads that McLaughlin’s company sold to national sponsors. The stations got to sell the remaining commercial time to local advertisers.\" \"From his earliest days on the air, Limbaugh trafficked in conspiracy theories, divisiveness, even viciousness\" (e.g., \"feminazis\").\\[36\\] Prior to 1987 people using much less controversial verbiage had been taken off the air as obvious violations of the fairness doctrine.\n\nThe UK has a similar standard to tFD in place for broadcast media. Fox News tried to get started over there, but the venture was very short lived. The official statement from Fox was low viewership, but no one believes that.",
            "title_similarity": "0.6611166",
            "sentiment_compound": -0.188
        },
        {
            "id": "gy2h0ez",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.1386511"
        },
        {
            "id": "gy3om2j",
            "score": -1,
            "text": "How can anyone even take this view seriously. But nothing on Reddit surprises me. Redditors can be a dense lot sometimes",
            "title_similarity": "0.6842209",
            "sentiment_compound": -0.3289
        },
        {
            "id": "gy3ovgr",
            "score": -1,
            "text": "I think it’s a stretch to always slam CNN.  We are always looking to pit one side against the other but Fox News is clearly a propaganda machine and CNN is not the same for the left.",
            "title_similarity": "0.83785117",
            "sentiment_compound": 0.0644
        },
        {
            "id": "gy4kfn5",
            "score": -1,
            "text": "What I’m honestly tired of hearing is that all media is culpable of spreading lies as if they are equally doing it.  CNN isn’t even close to the insanity of lies and deliberate propaganda coming from FOX and other alt-right “news” sources.  Stop acting like this is a media problem, it’s a “right wing” problem.",
            "title_similarity": "0.8977593",
            "sentiment_compound": -0.936
        },
        {
            "id": "gy25d7c",
            "score": 48,
            "text": "[deleted]",
            "title_similarity": "0.17222627"
        },
        {
            "id": "gy24opc",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.1386511"
        },
        {
            "id": "gy2dlpa",
            "score": 2,
            "text": "Why would anyone want to change your view? This is a popular opinion. Karma farming",
            "title_similarity": "0.5236869",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gy2e2j4",
            "score": -2,
            "text": "You can thank Obama for this. He told the media it's okay for them to lie.",
            "title_similarity": "0.51287675",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gy1r00x",
            "score": 2164,
            "text": "Who/what should be in charge of deciding what is false information? Because while I agree with everything you’ve written about how damaging false information is, I also don’t know that I trust any government institution to be the arbiter of what is and isn’t false, especially given who our last president was and how his party still seems committed to calling blatantly false information “truth.”\n\nEdit: since this has blown up and I’m getting a lot of replies misunderstanding what I’m saying, I am *not* saying that truth doesn’t exist, or that we can’t have experts evaluate what is true. I put my faith in politifact and expertise generally.\n\nI am saying I do not trust our political system to *choose those arbiters of truth responsibly*. Donald Trump and republicans are not going to choose politifact when they have the power to choose who decides what’s true.\n\nEdit edit: in case it’s not clear already, I’ve had literally hundreds of commenters reply to this saying basically the same things over and over again. I have stopped responding because I certainly can’t reply to all of you.",
            "title_similarity": "0.844124",
            "sentiment_compound": 0.8339
        },
        {
            "id": "gy2782o",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.1386511"
        },
        {
            "id": "gy43hhq",
            "score": 4,
            "text": "As others pointed out, it's often not possible to say what is \"true\".\n\nHere's a common one:\n\n\"The election was stolen\".\n\nThe left calls this a \"lie\".\n\nBut many states have created voting systems where it is not possible to detect fraudulent votes being cast, at least in some cases.  In at least Texas and California, you can register to vote with no ID, and you can vote using a utility bill as an ID.  \n\nThis means that if you are ineligible to vote in those places (say a convicted felon or a non-citizen), you can easily vote if you wanted to.  *In theory*, the state could track down everyone who votes with no ID and vet them.  But the people with no ID are the ones these states are bending over backwards to help vote.  The very last thing these states are going to do is go hassle people who voted with no ID.\n\nSo, it is impossible to know how many people are voting fraudulently in those states.\n\nSo, it is **absolutely true** that in at least some states it's very hard to detect if ineligible voters are voting.\n\nIt is **probably true** that it's not happening on a scale sufficient to matter.\n\nBut because it's not possible to know one way or the other, neither side can claim to be \"the truth\".",
            "title_similarity": "0.72267413",
            "sentiment_compound": 0.5187
        },
        {
            "id": "gy1sc65",
            "score": 72,
            "text": "> If a newscaster wants to state their opinion, they should be obligated to say it is only an OPINION. Im open to people CMV.\n\nAnd that's exactly why the law won't work. Southpark is the best example: https://www.youtube.com/watch?v=Zd0p96miSK8\n\nFirst of all, who is the arbiter of true information? The jury in the court? Really? How about experts? But there are many experts, and everyone can bring their own experts to back their version of truth. Or maybe let's get the REAL experts. But who is to give certifications whether or not an expert is real or not?\n\nNext is that news have been diligent is adding the phrase \"believe\" and \"reporting\", like in the examples. We are not reporting falsehood, we are reporting that our sources says that this is true, which turned out to be false.",
            "title_similarity": "0.6950406",
            "sentiment_compound": 0.9367
        },
        {
            "id": "gy36x6j",
            "score": 7,
            "text": "I think project veritas has just shown us the way.\n\nAlso, I don't believe any news outlet should be owned by any conglomerate. There should be some kind of anti trust law to keep ownership independent. \n\nBig money should not influence journalistic integrity.\n\nOne point of interest: Fox is owned privately by the Murdoch's while CNN is owned by Warner Media and the Disney corporation. (I don't know how or if that plays in, but it stinks of conflict of interest)\n\nLastly: had anyone followed the FOIA release that showed the govt of California was actively engaging FB and Twitter to take down posts that went against their narrative? Source: Judicial Watch. I'd say the government is already knee deep in this.",
            "title_similarity": "0.8648033",
            "sentiment_compound": 0.7821
        },
        {
            "id": "gy2wk6l",
            "score": 9,
            "text": "Best thing you can do RIGHT NOW is to turn off the TV and NEVER, EVER visit the CNN or Fox website.  Ever.  \n\nEvery time you load up a webpage, you’re supporting these organizations that spread fake news and hate.  It’s time to stop.  \n\nIf you need information, try and find alternative sources.  Don’t be weak and load up their homepages because you’re bored or want to sift through the headlines.  Just don’t do it.  FIGHT BACK NOW.",
            "title_similarity": "0.8550766",
            "sentiment_compound": -0.8374
        },
        {
            "id": "gy1r6ue",
            "score": 225,
            "text": "The problem with this will always be who gets to decide what is false information? What happens when some government agency decides a situation was too embarrassing or makes them look bad and says it didn't happen?",
            "title_similarity": "0.75382334",
            "sentiment_compound": -0.8466
        },
        {
            "id": "gy1t91c",
            "score": 1,
            "text": "There are laws against libel, slander and false advertising.",
            "title_similarity": "0.52975035",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1twkk",
            "score": 1,
            "text": "1. There is a difference between being wrong and lying. News reporters can only report on things to the best of their knowledge and ability, but making spreading false information illegal would also punish them for times when they were doing their job but had incomplete information, were lied to themselves, or just happened to make a mistake.\n2. Opinion pieces are a part of journalism.\n3. They already frame stories in such a way as to not outright claim certain things are facts but to heavily suggest that they are. They make sure they don't cross that line and therefore always have plausible deniability. Any law which punishes spreading 'false# information is going to have to deal with the fact that you can use a lot of rhetorical tricks to make something sound true even if it isn't, and you don't outright claim it to be.",
            "title_similarity": "0.8026774",
            "sentiment_compound": -0.955
        },
        {
            "id": "gy1up7e",
            "score": 1,
            "text": "So you want politicians to decide what the news is and isn't able to say...about politicians?\n\nLet's take the 2020 election, for example. What would have stopped Donald Trump from declaring that his rigged election claims were \"true,\" and news stations were only allowed to report that he was the rightful winner of the election?",
            "title_similarity": "0.72930527",
            "sentiment_compound": 0.6296
        },
        {
            "id": "gy1yblh",
            "score": 1,
            "text": "it’s fox new",
            "title_similarity": "0.09142027",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1zuej",
            "score": 8,
            "text": "The news media is the unofficial 4th branch of government and is integral to influencing the masses regardless of their left/right bias. The media is used as a tool of polarization and influence, among other things like celebrities and sports. \n\nIf the news were more fact based and politically neutral, they would have less viewers and supporters. This means less ad revenue and less influential power. We are pawns in a game of chess. We had localized gas shortages that were mainly fueled by hysteria and panic induced by the media, even though there was no physical shortage of gas. The same thing happened with meat during lockdown; no actual shortage of supply, just localized meat shortages fueled by media and hysteria. Media is a facet of control. Companies exist to make money. If they have the media under their arms they have influence over the pool of consumers. If politicians have the media under their arm, they have influence on votes. It’s all a fugazzi, which is why I don’t vote.",
            "title_similarity": "0.7896427",
            "sentiment_compound": -0.7074
        },
        {
            "id": "gy1zxa6",
            "score": 1,
            "text": "Part of the issue behind false reporting is the incredible demand for attention from the public. \n\nThe 24 hour news cycle was the leading edge of this when news companies realized there isn’t 24 hours of interesting stuff. So then commentary became news. \n\nOnce commentary became news, the line between opinion and fact got even harder to pull apart. Early on they used real experts but that was boring so then came the firebrand personalities. \n\nThis increased news consumption and drove more need for fast reporting and even more outrageous content. \n\nFast forward today and there’s so much bullshit because there’s marginal barrier to entry. \n\nIt should be illegal for false news to be spread and companies should be held liable for the damage they cause if their false reporting causes issues. The problem is blame attribution is difficult and litigating claims would be incredibly difficult to do. \n\nI imagine such a system would become overwhelmed by the volume of BS. This would necessitate a centralized authority to validate and approve or pursue claims and as everyone else said, can’t really trust any government to take that on.",
            "title_similarity": "0.8163416",
            "sentiment_compound": -0.9769
        },
        {
            "id": "gy2195i",
            "score": 1,
            "text": "Well, if they would of never removed the Smith Mundt Act that kept the country from promoting propaganda to its own people, this wouldn’t be happening.",
            "title_similarity": "0.73881495",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gy21p2w",
            "score": 1,
            "text": "The issue that I find making it illegal to report possible fake news is that it would take away the possibility of people to form their own opinions wether they are right or wrong. It would also take away from the news’s ability to generate news rapidly. Likewise there wouldn’t be any intriguing or consistent news to be reported if they only reported the facts of certain situations. Many individuals would simply get bored with the news and begin to tune out from the stations which could cause a negative impact on the amount of news and knowledge we consume.",
            "title_similarity": "0.85480106",
            "sentiment_compound": -0.9042
        },
        {
            "id": "gy22j20",
            "score": 1,
            "text": "Yeah but who is the one to say what is false information? You? Your uncle? Your crazy ex? The government? I mean in some countries false information can be literally anything to swing a viewpoint of the population to be more socialized. Look at North Korea. What do you think false information is there? While I might not agree with a lot of things people say or spread, they should be free to spread or say whatever they want.",
            "title_similarity": "0.74661314",
            "sentiment_compound": 0.4009
        },
        {
            "id": "gy255jc",
            "score": 1,
            "text": "We have that, it’s called fact checkers remember? During the election.",
            "title_similarity": "0.34691453",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy25v7g",
            "score": 1,
            "text": "Western democracies and most of the relatively free societies in the work have \"free speech\", It allows people to openly exchange ideas and debate these. The greater good this achieves is that we have a better understanding of the world and our society and can more effectively identify and confront our problems. It can also inspire people to come up with solutions. In democracies the mechanism is that public opinion will be informed by this debate and will shift as a result which will in turn influence politicians to adopt appropriate policies and laws. This all assumes both the participants in the debate and the regulators of the debate (the media) are honest and attempt to give a fair (or at least attempt to do so) resulting ultimately in better societies.. \n\nLess free societies tend to restrict this debate in significant ways. This helps to hide divisions, injusticies, government corruption and/or incompetence and gives the society temporal stabiltity. The challange is that problems are not discussed, debated or dealt with when these are in sensitive areas. Dealing with manageable problems like a new infectious virus outbreak in one city by locking up the messengers results in bigger problems, like a global pandemic in the future. The mechanism to deal with problems and create better societies is partially or fully disabled in these societies.. \n\nNote that all free societies do restrict \"free speech\" in multiple ways. In many places it's illegal to incite violence, or slanders people's names and these rules do vary. However these are restrictions that generally don't affect the greater debate and may even serve to keep it healthy. \n\nThe mechanism by which free speech ultimately results in better societies can break down in many ways (all societies have problems they have failed to deal with effectively).\n\nYou just identified one actual problem that can break this mechanism. A healthy debate requires that participants and news organizations act in good faith and try to honestly participate in the national debate. One of the organizations you mention is not an actual news organizations but a propaganda machine with its own political goals that just feeds its audience with what it wants to hear and what supports its political goals. The other one has its own challenges too. \n\nThe problem with your idea is that trying to solve the problem you identified by regulating what \"news organizations\" may or may not publish risks destroying the mechanism we desperately need to better our societies. \n\nPeronally I believe it's a better idea to restrict ownership and concentation and mandate editorial independence for media companies, This ensures not one company or person (Rupert Murdock) can shape a nation's debate to suit his/her interests or views.",
            "title_similarity": "0.5413999",
            "sentiment_compound": 0.9638
        },
        {
            "id": "gy28k6n",
            "score": 1,
            "text": "I'll add to that by saying it should also be illegal for them to spread more opinions than facts.",
            "title_similarity": "0.62168396",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gy28y9e",
            "score": 6,
            "text": "Make every article provide 3 sources of their information unless it's raw video footage. If they can't, it's not officially news and must be labeled as such in large bold font",
            "title_similarity": "0.5836196",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gy29eeh",
            "score": 1,
            "text": "I think we just need to be holding them accountable.   \nWhen one gets caught posting \"election was stolen\" or \"black jogger killed by white supremacists in a pickup truck for jogging in the wrong neighborhood\" the other networks should be calling them out and showing everybody that they are liars.   \nI think:   \n1. They are worried about libel lawsuits. If it's true that they lied and pushed a false story, it's not libel to point it out. But just to fight the case will cost money.   \n2. They are afraid that if they call the other network out for lying, they won't be able to lie and get away with it.   \n   \nIt's sickening but true. They let the other network get away with lying, because they are afraid that if they call them out... then THEY will be called out on the next bullshit \"story\" they are about to run.   \nThey allow lies from the \"other side\" in order to have a free marketplace of lies.   \n   \nThere needs to be another media, which isn't lying. Therefore is not afraid to call out lying.",
            "title_similarity": "0.8112316",
            "sentiment_compound": -0.9867
        },
        {
            "id": "gy29nbv",
            "score": 3,
            "text": "A government that has the authority to censor the media has a stronger incentive to censor media that is more critical of it.",
            "title_similarity": "0.5395044",
            "sentiment_compound": -0.4927
        },
        {
            "id": "gy29u9t",
            "score": 1,
            "text": "It used to be like that until 1987 - https://en.m.wikipedia.org/wiki/FCC_fairness_doctrine",
            "title_similarity": "0.32067043",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy2a0br",
            "score": 1,
            "text": "AGREE",
            "title_similarity": "-0.19196832",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy2bfvc",
            "score": 1,
            "text": "Making it illegal, just means that the people who enforce the laws get to decide what is allowed to be spread and not.  Say something the cops consider \"false\" and end up in trouble.  It is rife for abuses.  \n\n\nRemember, a ban isn't a magic wand, it is just saying that someone (likely someone official)  has an excuse to do bad things to the person they successfully accuse of doing the thing.  Essentially, you are saying that the cops should go around decided what is opinion and fact... that is a very, very terrifying idea.",
            "title_similarity": "0.816877",
            "sentiment_compound": -0.9616
        },
        {
            "id": "gy2byad",
            "score": 1,
            "text": "How do you prevent sources to reporters from lying?",
            "title_similarity": "0.5755324",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gy2c8bl",
            "score": 1,
            "text": "It's the responsibility of the individual to decide what is truth and fiction.",
            "title_similarity": "0.40290043",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy2caeq",
            "score": 1,
            "text": "Do you really want there to be a “bureau of truth?” If there had been one 4 years ago Donald Trump would have likely been the boss of it. No thanks.",
            "title_similarity": "0.56353164",
            "sentiment_compound": -0.2054
        },
        {
            "id": "gy2dhjt",
            "score": 1,
            "text": "In a perfect world it would be great if nobody ever spread misinformation, but when you outlaw speech you start to get into really mucky territory. What if what they said was actually true, but went against popular opinion, and was prosecuted as misinformation? What if they didn't know it was misinformation? How do you prove that it was intentional? What if the government starts using it in a tyrranical way by labeling dissenting speech as \"misinformation\" so that they can legally squash dissent?\n\nThere's a good reason freedom of speech exists. You can't wish for a utopia, you have to take the responsibility of doing your research, fully listening to all points of view in an unbiased way, and checking your sources, upon yourself.",
            "title_similarity": "0.7646525",
            "sentiment_compound": 0.8616
        },
        {
            "id": "gy2et9w",
            "score": 1,
            "text": "You are not wrong with that thought but the problem is with execution.\n\nThere will never be a non-biased body that can control this, for example if we assume there is a separated body to handle this that get through election; the democrats or republicans they will push their own agenda and the media will not be free.",
            "title_similarity": "0.8218099",
            "sentiment_compound": -0.745
        },
        {
            "id": "gy2f2j1",
            "score": 1,
            "text": "You're forgetting that most news is opinion anymore. Not to mention their audiences shrink daily. Saying speech even by a news outlet is illegal goes against our very 1st amendment.",
            "title_similarity": "0.8311209",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gy2hbos",
            "score": 1,
            "text": "Do you want a Ministry of Truth?",
            "title_similarity": "0.17367387",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gy2j0f3",
            "score": 1,
            "text": "Let's say there was some perfect system for determining truth and lies, so we have the ability to penalize liars (as many others pointed out, this probably isn't possible, but let's pretend). It wouldn't really help. Fox News and CNN and others don't create bias by lying (very often), they create bias by choosing what to cover and what not. \n\nFor instance, let's say you want to create vaccine hesitancy in your audience. You don't have to lie about problems the vaccine causes, you just have to spend a bunch of time on the real (but rare) side effects. Do a special on the woman who died from the blood clot. Follow someone who got COVID after they were fully vaccinated. Talk about all the people who got bad side effects after their second shot. All of these things would be true, but you've still painted a dishonest picture.",
            "title_similarity": "0.755546",
            "sentiment_compound": -0.9555
        },
        {
            "id": "gy2jioi",
            "score": 1,
            "text": "Freedom of speech.",
            "title_similarity": "0.08031407",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy2ju3j",
            "score": 1,
            "text": "It shouldn’t be because the standards will be implemented based on who’s in power",
            "title_similarity": "0.51122093",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2kdu1",
            "score": 1,
            "text": "Look at North Korean media",
            "title_similarity": "0.2017685",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2knp2",
            "score": 2,
            "text": "I don't know if you're also referring to media houses outside the US, but at least within the country, media outlets are protected by the 1st Amendment, which basically allows them to do what they want. It is near impossible to change this Amendment to allow media company's to be punished for publicising false information because they will fight this change with everything they have (and invariably win). And unless there is proven false information being propagated (which is A LOT), these companies will continue having a leg to stand on. Moreover, opinions and thoughts put out on important issues are too subjective to point out right and wrong. Drawing up rules to control opinions isn't how a democracy works. So whether you like it or not, media companies are supremely influential, even though they put out content with the aim of making their viewers conform to a certain agenda.",
            "title_similarity": "0.8137394",
            "sentiment_compound": 0.9565
        },
        {
            "id": "gy2kqp3",
            "score": 1,
            "text": "I wrote a post on this jus the other day. The idea is that deliberate acts of Disinformation could be made illegal. And not just illegal, but perpetrators would have unlimited liability in a lawsuit brought by anyone who cares to make the case.\n\nThis would include foreign governments of course, but also companies in the tobacco, oil, chemical, and numerous other industries who have already been proven to have engaged in deliberate campaigns to harm the health of their customers going back over 50 years.\n\nNow we have companies like Fox, Facebook, Google, and a ton of others who have built billion dollar companies based partially or entirely on selling proven lies for their private gain.\n\nThis law would have limits. You would have to prove an intent to deceive and damage a group of people for personal/corporate gain by repeating information that has been scientifically proven to be false. It would vary for foreign governments of course. There would be no assigned committee subject to political manipulation, each party would have to prove it's case beyond a reasonable doubt. Pretty easy if you are suing Fox or many members of the Rupublican party. Not just lies on the campaign trail, but a deliberate campaign to deceive voters telling the same lies for months on end. \n\nIt would still be legal to be ignorant, lie, etc., just not to do it in an organized, intentional way over time for private interest or damaging to US democracy.\n\n I know there would be first amendment issues , but I still think that it could be written to satisfy the courts in the same way as incitement to riot. Not to mention it would halt the exact type of creeping undermining of Democracy that we a currently experiencing.",
            "title_similarity": "0.7629374",
            "sentiment_compound": -0.8267
        },
        {
            "id": "gy2l85n",
            "score": 1,
            "text": "In my country “news” tv media is regulated by an independent body and must provide a fair view.",
            "title_similarity": "0.4600926",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy2l9gb",
            "score": 1,
            "text": "So I don't know if this has been expressed yet but you also have to leave some room for reporting that may be wrong with no malicious intent.  With the legality issue you may inadvertently suppress journalism under the fear that something may be false information.",
            "title_similarity": "0.64878047",
            "sentiment_compound": -0.9109
        },
        {
            "id": "gy2m092",
            "score": 1,
            "text": "I have been saying this about the UK too. It isn’t as bad here but still a problem. News should be fact without opinion and if new information comes to light or they find out the facts were wrong, they should state that ‘this information was incorrect, we now know XYZ’. Any news organisation giving opinion is a talk show and shouldn’t be allowed to be branded as news. \n\nFOX news should be legally forced to change its name given its legal defence of ‘we are an entertainment show, not a news show’ to get away with it.",
            "title_similarity": "0.8277056",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gy2mhhi",
            "score": 1,
            "text": "SUE THEM",
            "title_similarity": "0.25861788",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2ms0o",
            "score": 1,
            "text": "Also, one spreads waaaaaaay more false/actively dishonest info than another..",
            "title_similarity": "0.4547453",
            "sentiment_compound": -0.6096
        },
        {
            "id": "gy2nvuy",
            "score": 1,
            "text": "And omit news for the same reason and non objective agendas",
            "title_similarity": "0.5910231",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2os40",
            "score": 1,
            "text": "Who the hell gets to decide what’s truth, half-truth, half-lie, and lie? Exactly the kind of people you don’t want, is who.",
            "title_similarity": "0.6047111",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gy2ouj8",
            "score": 1,
            "text": "All sides not just networks are doing the same thing🤷🏿‍♂️",
            "title_similarity": "0.07098459",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2pg68",
            "score": 1,
            "text": "How are these channels going to get clicks then?:",
            "title_similarity": "0.147082",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2pkec",
            "score": 1,
            "text": "No. It should be legal, but not because it's good but because the legislation forbidding it would be worse. People need to learn how to think for themselves. Who will be the arbiter of truth? If that arbiter is wrong, all that is going to happen is that their lies will be spread instead.",
            "title_similarity": "0.7093482",
            "sentiment_compound": -0.9498
        },
        {
            "id": "gy2qmt3",
            "score": 1,
            "text": "It is in countries like Germany, idk why American press doesn’t have *any* responsibilities at all",
            "title_similarity": "0.6319945",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy2qxwh",
            "score": 1,
            "text": "Who will determine what is false information? Democrats or Republicans in power can use such law to silence the opposition news.\n\nI understand where you are coming from but your proposal will have the opposite effect in reality.",
            "title_similarity": "0.7688615",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2rf2y",
            "score": 1,
            "text": "Didn't the FCC used to regulate the news? I'm pretty old but maybe too young to remember what it was actually called.",
            "title_similarity": "0.5333021",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy2rtp9",
            "score": 1,
            "text": "We’ve moved into a period in history where even factual information is seen as false by some, the baseline has shifted and there is no real barometer of fact. \n\nWe’ve seen privatisation, corporations, new media manipulate the views of billions for the sake of billions ($).",
            "title_similarity": "0.7031926",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy2rvy9",
            "score": 1,
            "text": "There is this Indian Youtuber : Dhruv Rathee - who faced the same issue whenever he spoke his mind on several issues. \n\nHis solution - He puts up an “OPINION” sticker on the screen whenever he is telling his understanding on a topic. \n\nA very simple and clever solution.",
            "title_similarity": "0.3216682",
            "sentiment_compound": 0.7823
        },
        {
            "id": "gy2so5o",
            "score": 4,
            "text": "Well there's that whole first amendment thing which protects everyone's speech and once you start pointing at someone and saying \"What they say is false, arrest them\" and they get arrested, it's only a matter of time before points that finger at you and says the same and you won't like that.  If you've ever had watched two people with opposing worldviews discuss politics, it can be clear that they view the world through different lenses and it's not always a matter of right or wrong, only perspective. When you start to target one's perspective, you invite tyrrany. You might think this isn't so bad but eventually it envelopes every side.  \n\n\nI think a better way would be to give platforms to more grassroots media, without all the money and influence and let people decide.",
            "title_similarity": "0.7646767",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gy2spel",
            "score": 1,
            "text": "There used to be two laws that prevented this: “The 777 Law” and the other was “The Fair News Act”. Those aren’t the actual names for either I believe, but in media studies, these are taught as a large part of why disinformation is allowed to spread. One was repealed under Reagan, and the other under Clinton. Please let me know if I am wrong. But these two laws had been in place since the 30s and the 50s, respectively, and regulated media companies against anti-competitive practices and news-media against too much bias by taking a hands-off approach. I think the 777 law was repealed under Clinton, as many depression-era reforms were, and the Fair News Act under Reagan.",
            "title_similarity": "0.71954125",
            "sentiment_compound": 0.6059
        },
        {
            "id": "gy2sxtm",
            "score": 1,
            "text": "those alternative facts are just like your opinion bro",
            "title_similarity": "0.120543666",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy2sz2y",
            "score": 1,
            "text": "This would violate the first amendment. Such a law would be unconstitutional, and unethical. While it I'd unethical to publish fake news, who decides? What if it was a mistake or miscommunication?",
            "title_similarity": "0.71982163",
            "sentiment_compound": -0.9399
        },
        {
            "id": "gy2tsen",
            "score": 1,
            "text": "Who defines what is or what isn't false information? What if the person or institution that defines this deliberately define false as true and true as false?",
            "title_similarity": "0.4765175",
            "sentiment_compound": 0.7149
        },
        {
            "id": "gy2twi4",
            "score": 1,
            "text": "I agree with what you've said, and disagree with the many people who feel we cannot determine truth.\n\nThere are many occasions where there are multiple possible truths or the evidence isn't clear, but there are also a huge number of things where the truth or evidence is clear.\n\nThe judicial system is literally built to sort out what is true from what is false, so making it illegal to spread false information is a good and necessary idea - but as information regularly changes and we don't want to smack the little guy, I think your proposal should be limited.\n\nLet's make it a crime for organisations or persons with over 1 million regular viewers/listeners to knowingly spread false information. The burden would be on the prosecution to show the spreader had known the information was false at the time of spreading it. Let's make the penalties a % of that person/organisations turnover for it to mean something.\n\nThat should fix the worst cases by hitting them where it matters, in their profit, while leaving the cases where things are grey.",
            "title_similarity": "0.7435258",
            "sentiment_compound": -0.7993
        },
        {
            "id": "gy2v8zp",
            "score": 1,
            "text": "I dont think media is public enemy #1 anymore. I think I lean more towards fb being more of an issue. Generationally it is spread over most of them so has a far reaching of the populous.",
            "title_similarity": "0.53725666",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy2vg2h",
            "score": 1,
            "text": "\"bUt fReEdOm oF sPeEcH.\" yeah of course spreading false information should be illegal. This has nothing to do with freedom of speech.",
            "title_similarity": "0.7003403",
            "sentiment_compound": 0.8885
        },
        {
            "id": "gy2wumj",
            "score": 1,
            "text": "It used to be. Look up the Fairness Doctrine.",
            "title_similarity": "0.14091586",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2wv4w",
            "score": 1,
            "text": "LOOK AT THIS SHT!!!   Saw this trending. It never stops.  \n\nhttps://www.npr.org/2021/05/13/996570855/disinformation-dozen-test-facebooks-twitters-ability-to-curb-vaccine-hoaxes?utm_source=twitter.com&utm_medium=social&utm_term=nprnews&utm_campaign=npr",
            "title_similarity": "0.50530195",
            "sentiment_compound": 0.3226
        },
        {
            "id": "gy2xj60",
            "score": 1,
            "text": "How do you decide what news is false or true?",
            "title_similarity": "0.4285344",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy2xu4o",
            "score": 1,
            "text": "There are two ways to be an idiot.\n\n1. Believe lies are truth.\n\n2. Believe truths are lies.\n\nCnn and fox news could spread the truth but idiots would still find a way to be idiots and make up comforting lies to believe instead of the truth.",
            "title_similarity": "0.72727597",
            "sentiment_compound": 0.2617
        },
        {
            "id": "gy2xwjc",
            "score": 1,
            "text": "It is illegal and they get sued on daily basis. I don't know exactly where I should your mind here, maybe you just didn't do any research before posting? Maybe I can change your mind in stopping using reddit as google?",
            "title_similarity": "0.8010189",
            "sentiment_compound": -0.6767
        },
        {
            "id": "gy2xyxl",
            "score": 3,
            "text": "You would be surprised on the lack of journalistic integrity (e.g. lack of fact checking, framing) of BBC and CNN depending on the source, even for incredibly important news that can for example affect war decisions.",
            "title_similarity": "0.8540288",
            "sentiment_compound": -0.4417
        },
        {
            "id": "gy2yf0l",
            "score": 1,
            "text": "The real problem is that new media can get away with this. YouTube, Facebook, Netflix. People finding their news there has lead to traditional media being just as dumb.",
            "title_similarity": "0.74971074",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gy2z8ui",
            "score": 1,
            "text": "A lot of comments have already addressed the issue of who gets to decide what is fake (though it should be obvious). Another thing to consider is that we’ve already are media companies (Fox in particular) win court cases by arguing their content is opinion and no reasonable person would think what they are saying is news. This would be hard to enforce for that reason alone - can’t spread fake news if you claim it’s just opinion.",
            "title_similarity": "0.8282747",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gy2zkae",
            "score": 1,
            "text": ">If a newscaster wants to state their opinion, they should be obligated to say it is only an OPINION. \n\nLet's for a moment assume such a law would exist and be enforced and offending media would be heavily fined. What would the most likely outcome be? Less false information? A better understanding of truth/facts in the population?  \n\n\nI can tell you what I would rather bet on: We would see/hear disclaimer-like ribbons, statements etc. with every broadcast which would very quickly standardize in a way that everybody simply ignores them. Just like \"terms & conditions\" on virtually any online contract or action.  \n\n\nSo no, I don't think a lot of effort, time and tax-money should go into your suggestion. I don't need each and every report to start with a mumbled \"I'm legally informing you that the following is just a personal opinion\" statement or similar.   \n\n\nWhat I would rather like to see, is legislation towards a fact-checking bureau that gives out (mandatory)  'credibility scores' for media companies based *after* the fact. It wouldn't prevent immediate false news, but I'm confident those companies would be rather concerned if they evaluation significantly worse than their competition and this objective score would be publicly shown at each and every corner.  \nI also think it is much easier to have a fact-checking afterwards and apply strictly formulated criteria for the evaluation than to try to put any rule to immediate broadcasts. Things are not always clear right up-front.",
            "title_similarity": "0.75172824",
            "sentiment_compound": 0.5686
        },
        {
            "id": "gy2zx3o",
            "score": 1,
            "text": "While your concerns are certainly sound, the solution sounds far to broad and undeveloped to perpetuate any unambiguously positive resolution.\n\nYes, major media outlets do manipulate and contort bodies of information to a point of absurdity but it’s only due to common ignorance that these news sources maintain a degree of relevance. If what was proposed came to fruition and untruthful publications were decisively banned, it still wouldn’t make any discernible impact.\n\nThis issue has never been rooted in any quantifiable fallacy; their inaccurate accounts are simply a byproduct. In all actuality, the true reason why major media outlets prove mendacious rests in their uncontested manipulative standard which in their favor, invokes emotions, gains traction, and as a result, accentuates revenue. \n\nNot only do their manipulation tactics lie in false information, but also in hidden premises, carefully selected topics, and deliberate out-of-context reports. \n\nIf there proves any chance at unhinging major news networks from their pedestals, the only recognizably sensible way would be to raise awareness of their practices and encourage others to boycott their publications. It may hold some variety of risk (considering they remain the major means of communication between government affairs and the people) but if their larger source of income is cut clean, any additional funding would discontinue and as a result, so would their relevancy.",
            "title_similarity": "0.7856635",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gy2zxke",
            "score": 1,
            "text": "Or the White House",
            "title_similarity": "0.12901999",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy30xwk",
            "score": 1,
            "text": "Just tell me the facts, let me make my own mind up.",
            "title_similarity": "0.2537848",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy31519",
            "score": 1,
            "text": "It’s not even about false information. A lot of times what is worse than false information is that they report half of the truth, half of the story, and then you can’t call them liars but they are still lying on purpose about the truth.",
            "title_similarity": "0.68363434",
            "sentiment_compound": -0.6428
        },
        {
            "id": "gy31d1y",
            "score": 1,
            "text": "Should there be some official mechanism for holding a media company to blame? Sure, great idea.  Now HOW do you do so?  Even ignoring the 1st Amendment issue, who gets to decide what 'truth is?  Do you honestly think that in 2020 a Trump administration would have acted to rein in Fox or Newsmax?  Do you honestly think that a corrupt administration WOULDN'T use a law like this to attack their opponents?  Prior to 2017, I might have said \"checks and balances will prevent such a thing\"  \n\nYes, media broadcasting lies is a problem.  But until the country rewrites the Constitution to have ACTUAL limits on Presidential power, there is no effective way to do it.\n\nUltimately, I'm more concerned with politicians feeling free to promote antidemocratic lies than I am about the media.  Media does it to cultivate customers, politicians do it to take away freedom.",
            "title_similarity": "0.76068974",
            "sentiment_compound": 0.9257
        },
        {
            "id": "gy31g5j",
            "score": 1,
            "text": "What the fuck?\nIt's not illegal already?",
            "title_similarity": "0.12710692",
            "sentiment_compound": -0.2349
        },
        {
            "id": "gy31rdk",
            "score": 1,
            "text": "We shouldn't rely on other people to tell us the truth. It would be nice, and they have more resources than the average person, but it is ultimately up to people to use reliable news sources. If people can't even do that, I doubt regulating huge news networks will be that helpful.",
            "title_similarity": "0.7000685",
            "sentiment_compound": 0.714
        },
        {
            "id": "gy31s2g",
            "score": 1,
            "text": "hold them in check with liablity like always",
            "title_similarity": "0.120628715",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy32jeb",
            "score": 1,
            "text": "Smith-mundt act…",
            "title_similarity": "0.011213131",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy33cmg",
            "score": 1,
            "text": "The problem with this is enforcement of this rule... WHO determines WHAT is is not false information? Let’s say there’s a “watchdog committee” set up and funded. Who funds this? What interests do they have? \n\nIt will become a game of “who watches the watchdogs?” This will never work in country that has freedom of speech. \n\nIMO, the fact that the “news” has become a business of selling advertising real estate to the highest bidder is the problem. They’ve copied the social media model of engagement. Outrage, anger, fear, all the negative emotions of “what the other side will do” or “is doing to take away your freedoms” is keeping people engaged. It’s a fucked up place to be at the moment",
            "title_similarity": "0.8180326",
            "sentiment_compound": -0.9295
        },
        {
            "id": "gy33uxn",
            "score": 1,
            "text": "That’s your problem right there “people rely on the news for everything” would you pay attention to some crazy hobo throwing poop at pigeons? Probably not. You know he’s crazy and you probably wouldn’t listen to him for any advice you’d probably just avoid eye contact and go about your day. We know that msm is doinky. Just ignore them,stop watching their dumb shit and the problem will solve itself👍🏻",
            "title_similarity": "0.81281936",
            "sentiment_compound": -0.9607
        },
        {
            "id": "gy33ws6",
            "score": 6,
            "text": "Cable news is opinion. 100% of it. Local news still tends to cover things objectively like \"Earlier today, the gas station on 4th Street was robbed by two armed males. Here is a picture, if you see them call 911.\" National cable news only exists to provide commentary about the story. You won't see CNN or Fox say \"Earlier today, President Biden signed HR39 into law.\" They say \"Earlier today, Biden signed HR39 into law and with us today to talk about what that means for everyday Americans is Joe Smith, legal scholar with XYZ institution...\"\n\nYou just need to lower your expectations. Don't expect objective coverage from any cable news outlet period, full stop. If you want objective coverage of government, that's just CSPAN.",
            "title_similarity": "0.67947245",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gy34wsz",
            "score": 1,
            "text": "I believe it used to be illegal due to the Fairness Doctrine and had been since the 40’s but in the late 80’s after Reagan struck it down then the opposition passed its re-instatement but then Reagan Vetoed it and within a few year Fox News appeared.  \nI have no idea why this can’t be re-instated now other than it would mean FOX and CNN and most media would look very different overnight. Which may divide us even more. I guess it boils down to wether Media is considered a dispensation of fact or tool for gain wether the media company or the relevant political branch just like propaganda",
            "title_similarity": "0.79064095",
            "sentiment_compound": -0.0644
        },
        {
            "id": "gy353sx",
            "score": 1,
            "text": "Giving one political party the power to decide what is \"true\" and prosecute others  for saying things you deem as \"false\" would be an absolute nightmare. The government calling something true/false doesn't make that statement any more true/false.",
            "title_similarity": "0.83368397",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy35f5f",
            "score": 1,
            "text": "It used to be but I think Regan was like fuck it",
            "title_similarity": "0.33038723",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gy35s0r",
            "score": 1,
            "text": ">There is absolutely no point in doing so\n\nSure there is. It's called .... money. News outlets aren't in the business of delivering news per se. They are in the business to sell advertising space. The more controversial the story, the more viewers, the more clicks. \n\nIf news outlets tried to make money on selling news, we'd be back to three outlets and Walter Cronkite every evening for 30 minutes because that's about how long it takes to report real news.",
            "title_similarity": "0.77508986",
            "sentiment_compound": -0.1518
        },
        {
            "id": "gy369ti",
            "score": 1,
            "text": "With proper editing I can create a narrative that implies anything I want  by emphasizing some facts and omitting others. \n\nexample:   \n\nEllen DeGeneres did have some people accuse her of being mean. That's a fact. When you did down you realize the accusations are that she didn't thank her assigned bodyguard one time. She also didn't know all the names of her shows interns that are constantly replaced.\n\nA trans person complained that she was only allowed to use the assigned guest bathrooms and it was spun like Ellen is transphobic. . That's actually standard operating procedure on most sets, TV talent has their own dressing areas and that's a \"sacred\" space where they get ready to perform.  Imagine going to a party with someone you don't really know and asking if you can use their master bathroom. That would be rude AF. \n\nThe actual facts were hidden but the narrative was that Ellen is a \"terror\" because of some random tweets.  With enough repetition Ellen decided to quit her show. \n\nNo one lied, but it was an effective PR hit job. \n\n70% of shared new links the sender only reads the headline.",
            "title_similarity": "0.7313469",
            "sentiment_compound": 0.5028
        },
        {
            "id": "gy36gj1",
            "score": 1,
            "text": "Ye but it's a private company or something. Which kinds means they can do whatever they want",
            "title_similarity": "0.25715494",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gy36idg",
            "score": 1,
            "text": "You're going down a slippery slope if you do that\nFree speech is sacred and false information should only be combated by true information and the viewer should make up their own mind about what they want to believe\nDo you really want to have the government interpret what counts as false information?\nI think that would be a horrible situation to be in",
            "title_similarity": "0.7880987",
            "sentiment_compound": 0.5413
        },
        {
            "id": "gy36n7n",
            "score": 1,
            "text": "I don't think it should be illegal. I think if you want to advertise yourself as news, you should get a license, and every year or couple years your news stories should be examined by nonpartisan experts in your field, and if it's found that your news doesn't meet a standard set by these experts for truth, then you should lose your license to advertise yourself as a news organization. You can continue to broadcast, but you have to say - this is entertainment, not news, or something to that effect, at the beginning and end of any program that would otherwise be looked at as news.\n\nFox entertainment would have a different effect than Fox news.",
            "title_similarity": "0.78774166",
            "sentiment_compound": 0.7227
        },
        {
            "id": "gy36r8e",
            "score": 1,
            "text": "The better way to solve the problem of \"arbiters of truth\" is to have reasonable checks and balances on the scale of power like a democracy should. The reason that doesn't exist in America is because 90% of the market on media is owned by 5 companies.",
            "title_similarity": "0.5252238",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gy389x4",
            "score": 1,
            "text": "Lies drive clicks, clicks make money. That's the only thing these corporations care about.",
            "title_similarity": "0.6003409",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gy38jte",
            "score": 1,
            "text": "You can easily manipulate people by choosing which events you talk about and which aspects of the events you are mentioning. You do not need to lie. Throw in a few small points that make your side look bad and you seem somewhat objective too. \n\nThis in addition to what has been said, that any censorship powers will eventually be abused",
            "title_similarity": "0.5761701",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gy38ose",
            "score": 1,
            "text": "I think the issue is more that people need to be taught instead how to critically examine information. You saw a post on Facebook about how eggs can cure cancer? Hmmm probably just a headline to get you to click and read.\n\nIt's always good to see different viewpoints because the truth is going to be somewhere in the middle. Every news outlet is somewhat biased. There's a great graphic out there showing the biases of different news providers. People tend to gravitate towards the outlet that feeds their beliefs and say \"well it was on the news so it's true\".\n\nBut ideally we need to teach people how to think for themselves and use news outlets as a part of their research on topics but not the be all and end all. And also to be open minded about viewpoints too to understand where others are coming from. They might not have the full picture, they might have a very skewed understanding because of whatever outlet they follow. And also you might be misinformed!",
            "title_similarity": "0.6967603",
            "sentiment_compound": 0.6402
        },
        {
            "id": "gy38riw",
            "score": 1,
            "text": "It's all about money my guy",
            "title_similarity": "0.28628778",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy39kzv",
            "score": 1,
            "text": "The \"news\" is not now, and never has been about informing people. They are businesses that exist to make money. In addition to that, whether a news organization is state-owned or is a private enterprise, they all serve some function in propagandaizing the population.",
            "title_similarity": "0.6902777",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3a2oi",
            "score": 1,
            "text": "Unfortunately, one of the biggest problems with wanting to do this (and don't get me wrong. I wish we could too) is how it could be implemented without stepping on the right to free speech and freedom of the press. \n\nFox and other networks haven't gone without consequences for some of their lies but they get away with it in others, [like in the case of Tucker Carlson](https://www.npr.org/2020/09/29/917747123/you-literally-cant-believe-the-facts-tucker-carlson-tells-you-so-say-fox-s-lawye) where the attorneys for Fox News insisted that the very tone of Carlson's show should make it obvious to viewers that he's not stating facts. \n\nBy claiming **only** in these legal scenarios that the network has hosts constantly making up lies, and subsequently getting away with it, they've basically made it clear that every viewer should know better than to trust them or expect the truth. However, their hosts continue to insist on each of their shows that they are the network to trust to bring their viewers the truth. \n\nThat problem aside, it's the fact that this country needs a far better education system. We continue to have people who, if we managed to make it illegal to spread propaganda, would be angry because they believe that propaganda. They haven't been educated in a system that teaches you how to think critically, how to recognize biased reporting, etc.",
            "title_similarity": "0.78649795",
            "sentiment_compound": 0.7892
        },
        {
            "id": "gy3a3p2",
            "score": 1,
            "text": "and who gets to determine if something is fake news? i take it you would want people who you agree with to be on thought crime committee? \n\nThis is just fascism in the vein of stopping fake news. i see lots of stupid opinions on reddit that people are convinced is not fake news. \n\nThis is just fascism and you just want to block messages you don't like. now i expect to get downvoted by the fringe as a republican. post history says otherwise. There is a reason non-crazy democrats do not support something like this.",
            "title_similarity": "0.81661224",
            "sentiment_compound": -0.9335
        },
        {
            "id": "gy3ajt3",
            "score": 1,
            "text": "It's impossible to make it illegal, because you would need to create a ministry of truth to decide what is false information.\n\nIt would totally suffice if they did't get rich by spreading false information.",
            "title_similarity": "0.7817393",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gy3c3rx",
            "score": 1,
            "text": "What if I told you the people who own the news also own the politicians who make the laws.",
            "title_similarity": "0.58769023",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3ckbu",
            "score": 1,
            "text": "There is already a law. Those \"news\" outlets that get away with it are labeled \"opinion shows\" and therefore they're able to say whatever they want. Typically, news outlets will quote a story or journalist and it puts the legality on who wrote the story rather than who reported it. Our laws will still allow a contraction before real punishments are handed out. See fox news and the dominion company recently and it'll show what the law rly is.",
            "title_similarity": "0.6463021",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gy3cxz7",
            "score": 1,
            "text": "CNN and Fox are both full of shit, spewing what their base wants to hear.",
            "title_similarity": "0.63353336",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gy3d05f",
            "score": 1,
            "text": "It used to be, look at the Reagan administration and the FCC Fairness Doctrine.. they just took away the rules saying they had to report the news without bias.",
            "title_similarity": "0.6735735",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gy3dj1k",
            "score": 1,
            "text": "We, as sovereign individuals, have a responsibility to determine what is true or false.  We make this judgment based upon our own reason, research, and view as to the credibility of a news source.  Creating a law would be simply shifting the responsibility from one biased source (CNN, Fox) to another (politicians).  The responsibility is with the individual.",
            "title_similarity": "0.67902595",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy3e9c6",
            "score": 1,
            "text": "The problem is, it's not claimed to be true. It's really everybody else's problem for being so gullible and stupid.",
            "title_similarity": "0.66850096",
            "sentiment_compound": -0.868
        },
        {
            "id": "gy3eb5u",
            "score": 1,
            "text": "You either want a free press or you don't.",
            "title_similarity": "0.39401847",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gy3eks1",
            "score": 1,
            "text": "  Not illegal: BUT we should be able to file a class action lawsuit against them.",
            "title_similarity": "0.4370777",
            "sentiment_compound": -0.0997
        },
        {
            "id": "gy3fk9s",
            "score": 1,
            "text": "It used to be, then the FCC repealed the Fairness Doctrine.\n\nFox 'news' was practically founded the next day.",
            "title_similarity": "0.5998645",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3g2bp",
            "score": 1,
            "text": "It actually used to be. Sadly, we managed to screw that up.",
            "title_similarity": "0.40054327",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gy3g2nw",
            "score": 1,
            "text": "You say there is no point, but it is self-evident that spreading false information makes media companies far more money. People pay far more attention to things that they perceive to be threats, than they do to positivity. People do not feel like they need to watch the news when nothing bad is happening. So news stations will blow up negative news, and pump up the fear factor to the max, just to maintain viewers and therefore money. It's greedy and morally corrupt, sure, but if a system can be exploited it will be. There are far better reasons to keep reporting free, so that when corruption occurs, it can be called out.",
            "title_similarity": "0.74011385",
            "sentiment_compound": -0.699
        },
        {
            "id": "gy3goid",
            "score": 1,
            "text": "A) what you're describing is government censorship like they have in China and B) there's no effective way to differentiate between \"huge\" and small; you're going to end up ensnaring everyone who gets something wrong on the Internet (i.e. all of us).",
            "title_similarity": "0.8510661",
            "sentiment_compound": -0.2153
        },
        {
            "id": "gy3hall",
            "score": 1,
            "text": "What a useless point. You know we all agree with you lol.",
            "title_similarity": "0.27071387",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy3hp1z",
            "score": 1,
            "text": "Person 1: Fox news lies and CNN tells the truth\n\nPerson 2: CNN lies and Fox news tells the truth\n\nand on and on and on forever. \n\nGood Luck with this one. News should be completely impartial and give people the facts of the situation. We're too far past that point.",
            "title_similarity": "0.763173",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gy3i1gj",
            "score": 2,
            "text": "Like saying the Vax is safe, when in reality studies and experience says it's not, but some people have an opinion that it is? You're right. Media needs to stop the propaganda. All it takes is for people to stop watching it. Can't sell what isn't bought.",
            "title_similarity": "0.8049132",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gy3i8gm",
            "score": 1,
            "text": "Tv is like a trial in a courtroom there’s no absolute true info  there’s just your narrative against other’s and according to the ideological bias of the nation the news will be flexible",
            "title_similarity": "0.7493826",
            "sentiment_compound": -0.1361
        },
        {
            "id": "gy3iaos",
            "score": 1,
            "text": "> There is absolutely no point in doing so\n\nUnfortunately, that is where you are very, very wrong.\n\nThink about how vehemently conspiracy theorists cling to their ideas, and how that intensity only seems to grow when they are presented with evidence refuting their claims.  Companies like Fox News that knowingly and willingly peddle lies as \"facts\" know that their target audience doesn't care about the truth, they only care about hearing what they *want* to hear.  And the more reality detached eyes they can bring to their screen, the more ad revenue they can sell.  So sadly, there absolutely is a point to doing so.  A very dirty, cynical, calculated point.",
            "title_similarity": "0.8621758",
            "sentiment_compound": -0.9651
        },
        {
            "id": "gy3j7ib",
            "score": 1,
            "text": "Just make it contingent on “intent”.",
            "title_similarity": "0.07993321",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3jexo",
            "score": 1,
            "text": "Isn't it already illegal? Just a matter of someone providing proof to make a case then hold them accountable?",
            "title_similarity": "0.55557865",
            "sentiment_compound": 0.5242
        },
        {
            "id": "gy3ji7s",
            "score": 2,
            "text": "the media has always been a tool of the rulling class. look at yellow journalism and the spanish american war. accidental boiler explosion, journalist makes up a story about american spies that was false. starts an entire war to sell papers. they name an award after him. \n\n\nabsolute pieces of shit with no regard for human life.\n\nhttps://youtu.be/fKRQsePy7r0 worth a watch.",
            "title_similarity": "0.75415933",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gy3kt8q",
            "score": 1,
            "text": "It actually used to be illegal for the news to spread bullshit like they do. We have the Reagan administration to thank for that. We shouldn't be able to tell a news anchors' personal opinions on anything.",
            "title_similarity": "0.8002043",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gy3l3a5",
            "score": 1,
            "text": "Arent they? European news agencies are fined for spreading false or unreliable information. Its like item safety laws in usa, but for information publishing - if there might be something wrong, prepare to get sued, fined and bankrupted. Because somebody will find a flaw.",
            "title_similarity": "0.7851552",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gy3m9wm",
            "score": 1,
            "text": "It is. However nobody cares to stop them.",
            "title_similarity": "0.24409588",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gy3n4wo",
            "score": 1,
            "text": "Where do you draw the line? \n\nShould it be illegal for advertising to use fine print or asterisks?",
            "title_similarity": "0.5662489",
            "sentiment_compound": -0.4871
        },
        {
            "id": "gy3n5sw",
            "score": 1,
            "text": "Add all social media platforms as well and I’m on board with that view.  The trick is: who decides what is true?",
            "title_similarity": "0.25088075",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gy3nouz",
            "score": 1,
            "text": "Freedom of the press, freedom of speech.",
            "title_similarity": "0.20903015",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gy3p4d5",
            "score": 1,
            "text": "As everyone said, this could be a dangerous slippery slope. China is currently cracking down on the free press in Hong Kong under the pretense of “false information”. When in reality, they simply want to control the narrative. In China, any information on the tianeman square massacre is censured. Back in the 1960’s cable news was seen as a public service, and [reporting the news did not have a profit motive ](https://niemanreports.org/articles/the-transformation-of-network-news/). Now a days, news is sensational for the purpose of drawing viewers in for profit. The best solution would be to pass a law encouraging news to be non-profit. Not entirely sure what that law would look like, but it would help",
            "title_similarity": "0.811737",
            "sentiment_compound": 0.8644
        },
        {
            "id": "gy3q02a",
            "score": 1,
            "text": "I fundamentally agree with you. To a point.\n\nPart of the issue is the fact that its \"the news\" it has to by virtue attempt to be current. So sometimes mistakes will be made, i would say as long as such mistakes are loudly and clearly admitted to when new information comes to light than they shouldn't  be fined for it.\n\nAlthough there are clear examples of both sides running with dubious information that shouldnt be on the air.",
            "title_similarity": "0.63849497",
            "sentiment_compound": 0.4976
        },
        {
            "id": "gy3tayf",
            "score": 1,
            "text": "News agencies would quit reporting on pretty much everything.  It would open up too many liabilities, even if they tried to avoid fake news, there would be a constant barrage of lawsuits.  Reporters would sniff a new story, and decide not to investigate because they don’t want to risk a fake news accusation.",
            "title_similarity": "0.8598082",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gy3tszl",
            "score": 1,
            "text": "It is, which is why real news agencies have to submit retractions",
            "title_similarity": "0.43185773",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3ucqz",
            "score": 1,
            "text": "News outlets should have to operate independently. Garbage news is allowed to exist because news outlets are owned by wealthy media conglomerates. The media conglomerates make enough money to offset any losses from their news outlets.\n\nSaid another way, if news outlets had to make a profit on their own to remain in business, then they would have to give the people what they want (unbiased, real news).",
            "title_similarity": "0.71466005",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy3ufmx",
            "score": 1,
            "text": "The solution to false information is having an educated population who culturally values truth and honesty. If everyone recognized CNN and Fox as the cancerous wastes of time they are and ignored them, this wouldn’t be an issue. They would lose viewers and go out of business.\n\nRelying on a central authority to regulate information and speech is a recipe for disaster, as others have mentioned",
            "title_similarity": "0.8254119",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gy3vb95",
            "score": 1,
            "text": "it should be illegal for everyone.",
            "title_similarity": "0.6135781",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gy3weic",
            "score": 1,
            "text": "I think what would fix a lot of news is if they moved opinion hosts off of news into their own channels",
            "title_similarity": "0.5826451",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3x0vg",
            "score": 1,
            "text": "You mean Disney who owns fox. They are the bigger problem with media.",
            "title_similarity": "0.6656035",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy3yksr",
            "score": 1,
            "text": "It should be illegal for people to use apostrophes to make words plural.",
            "title_similarity": "0.63863295",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gy3yrai",
            "score": 1,
            "text": "We have this things called laws, specifically against slander and libel, but if they aren’t applied they mean nothing.",
            "title_similarity": "0.68157244",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3yvk9",
            "score": 1,
            "text": "Wasn’t there a rule way back when about news presenting both sides of an argument?",
            "title_similarity": "0.47297072",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gy3zlv8",
            "score": 1,
            "text": "This is what we call a slippery slope. Who decides",
            "title_similarity": "0.21003094",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3zoys",
            "score": 1,
            "text": "Change that to demonstrably false and I'm onboard.  If you can demonstrate someone is lying, like in Fox News lawsuits, that should be enough.\n\nBasically just remove the \"I'm obviously lying, if you believe me then you are unreasonable\" O'Reilly and Carlson defense.\n\nIt's only worked 4 damn times in court.... Maybe the court needs to recognize the sheer number of unreasonable people that exist.",
            "title_similarity": "0.74165034",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gy41la7",
            "score": 1,
            "text": "Or give incredibly biased views based on their audience/their own opinion. Just. Give. The. News.",
            "title_similarity": "0.6681746",
            "sentiment_compound": -0.3384
        },
        {
            "id": "gy42066",
            "score": 1,
            "text": "Is part of the problem from getting rid of the rule of 7's?",
            "title_similarity": "0.48080403",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy424z5",
            "score": 1,
            "text": "Great example of a great idea that is extremely hard to implement. Instead it is better to remove profit from the news cycle. If they aren’t trying to entertain there is less incentive to dramatize their messages or have stupid shout matches throughout the news piece. Just provide the information they have at the time and move on to the next part. It’s why publicly funded news channels like bbc don’t have nearly as much of this kind of stuff going on, or at least no where near the same capacity. Private sector news is what causes our current predicament in the states, having a publicly funded version that doesn’t have the incentive to be vastly entertaining or dramatic would do a lot for people.",
            "title_similarity": "0.7978966",
            "sentiment_compound": 0.959
        },
        {
            "id": "gy42d4i",
            "score": 1,
            "text": "The biggest issue from a legal perspective is that this is a 1st amendment issue a d those have to be handled with care. According to the Supreme Court a lie is non-protected and thus is can be made illegal. The problem is that traditionally a lie requires intent, ie I can say the sky is purple and as long as I believe that to be true with good faith then I am not telling a lie I am just mistaken. So as long as Fox News can provide evidence that they believed the statements in good faith, or that they are opinions and not statements of fact, then they are protected under the constitution.",
            "title_similarity": "0.7281635",
            "sentiment_compound": 0.9393
        },
        {
            "id": "gy42kad",
            "score": 1,
            "text": "How do you determine what’s false information and what’s ‘spin’ ? Cause you can take a factual clip of a speech out of context and make it come to a  conclusion the original clip didn’t come to but it was still based on a factual speech",
            "title_similarity": "0.52035564",
            "sentiment_compound": 0.1655
        },
        {
            "id": "gy42pc8",
            "score": 1,
            "text": "I think that is illegal in some countries. I could be wrong",
            "title_similarity": "0.4784063",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gy4330b",
            "score": 1,
            "text": "You say this like theres no benefit for them sensationalizing news. Of course there is. Yeah it's bad for the general population but you're forgetting who's in charge of media companies. We have literally no say as a population how the media gets handled. \n\nCrazier/scarier stories = more ratings = more money. They literally have a reason to not stop doing what you're saying. Not trying to change your view bc I agree with you but it's so subjective what you're saying. \n\nI'm convinced that news media \"journalists\" are taught how to sensationalize in school or in training. They're the kind of people who tell you this crazy opener to their story like \"wow I wonder what hes gonna tell me\" and then it ends up being exaggerated bullshit.",
            "title_similarity": "0.8806839",
            "sentiment_compound": 0.6
        },
        {
            "id": "gy433mn",
            "score": 1,
            "text": "I'm all for requiring that companies that wish themselves to be arbiters of news to be required to spend twice as much time in the following episodes, during the same slot, reiterating that they fucked up and what actually is the truth when presented with clarifying information.  At some point this will get to the point where either they're spending all day every day rectifying their fuckups, and therefore telling the truth, or they'll decide to no longer be a news channel, which removes both the credentials and their responsibilities.",
            "title_similarity": "0.70158297",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gy436dc",
            "score": 1,
            "text": "I'm going to go full devils advocate here.  My conclusion: it should not be illegal, it should be encouraged and slander laws should be repealed entirely.  How I get there: \n\n1.  News media is an obsolete institution and for the last 20 years there is no reason for anyone to trust anything they say.  Every reader has access to the same source information a reporter has and can check their work (it's virtually always wrong).  Then every time they spread a false story, people trust them less and thier audiences get smaller.  Removing the remaining guardrails will hasten their demise, and demand for synthesized news can be filled by new providers incentivized to get the story correct rather than steering stories to slow audience decline.\n\n2.  The tools used for slander are the same tools that can be used for your personal defense.  They are also the tools that are easily used to disprove false, hyperbolic, or sensationalized stories.  We don't live in the world where if the local paper prints something and refuses to print the counterargument nothing can be done.  Content from bloggers who are experts in their fields will always demolish a reporter who's only been trained to write in AP format.  Over time, this will shift the default state for everyone in society from confirmation biased zombies back to people who think about what they hear rather than just react to it.\n\n\"The man who reads nothing at all is better educated than the man who reads nothing but newspapers\" - Thomas Jefferson",
            "title_similarity": "0.827118",
            "sentiment_compound": 0.3637
        },
        {
            "id": "gy43s44",
            "score": 1,
            "text": "The main issue is that we really don't want the government being the arbiters of truth. It's turned out really disastrous before. Sure, it's all well and good when someone you like is in power, but do you really want some Christian fundamentalist making it illegal to claim that that there's no god, or some anti-religious leader to make it illegal to claim that there is one? \n\nNote: I just used the god claim as an example. We could have used plenty of other examples. There are a lot of areas where people disagree, where there is no real way to know what is and is not true, where there's a lot of debate within the scientific community, etc. \n\nThe point is, we really don't want a few people in power to control the narrative. We don't want a \"counsel of truth.\" Or at least people shouldn't want that. Let's just teach people to become better analyzers of information. Let's teach people to think critically, vet sources, etc.",
            "title_similarity": "0.7889727",
            "sentiment_compound": -0.8875
        },
        {
            "id": "gy43y3b",
            "score": 1,
            "text": "It should definitely be harshly punished if it's clearly done with malicious intend. Like, jail time for  the ones in charge.",
            "title_similarity": "0.5426115",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gy44zsf",
            "score": 1,
            "text": "Lets also not forget that Fox News isn't news. Its entertainment that shouldn't be taken seriously. \n\nhttps://www.npr.org/2020/09/29/917747123/you-literally-cant-believe-the-facts-tucker-carlson-tells-you-so-say-fox-s-lawye",
            "title_similarity": "0.74293447",
            "sentiment_compound": -0.0382
        },
        {
            "id": "gy45dmq",
            "score": 3,
            "text": "So I have a first hand experience with this, I’ll try to keep it short but it might give you a different outlook on things. \n\nWhen I was 18 in high school, my senior project was to job shadow a digital forensics analyst at the State Police. He got called out to a scene and I rode along with him. A man barricaded himself inside his house and was shooting at the police. The police Bearcats (armored trucks) showed up and there were bullet holes directly in the driver and passenger parts of the windshield. The man held his dog out the window and they shot his dog. He ended up getting shot by a “sniper” in the head. Idk if they meant they had an actual bolt action rifle or just a good marksman. When they opened the front door and axe swung down at them, he had other booby traps inside the house. He had hand grenades, weapons, and other flammable substances in his bathroom. It was crazy. \n\nBut after this whole ordeal, they had a press conference...  what the police told the media was not entirely true, big portions were left out or altered. Later that night when I heard it on the news, the media changed it even more, it sounded much more interesting but it wasn’t correct. \n\nYears later I asked my friends that work down for the Capitol Police why the cops do that, one guy said 2 reasons. 1. They don’t want people calling in thinking it is there neighbor, etc, and they want the caller to give more information about the person.  And 2. Copy cat criminals. He said that really is a thing, these people hear things and get these ideas from others and try to either replicate it or use portions of it in whatever situation they want to do. \n\nTldr: shooting happened. cops did not tell the truth. media altered it even more.",
            "title_similarity": "0.5951379",
            "sentiment_compound": 0.1958
        },
        {
            "id": "gy46i6j",
            "score": 1,
            "text": "Easy fix if it does become.illegal...you break up the \"huge\" media companies into smaller satellite companies...boom, now you can spread misinformation again.",
            "title_similarity": "0.62545097",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy46y8c",
            "score": 1,
            "text": "I’d like to be more exposed to scientists and how they conduct experiments. \n\nEven in science most scientists don’t consider themselves or their experiments right or wrong. They just gather evidence to support their theories.\n\nHaving access to notes or some sort of visualization on how experiments are conducted could be useful. At this point I trust supporting evidence over word of mouth",
            "title_similarity": "0.58964217",
            "sentiment_compound": 0.8627
        },
        {
            "id": "gy4714u",
            "score": 1,
            "text": "thank reagan for getting rid of the fairness doctrine.",
            "title_similarity": "0.38846004",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy478w6",
            "score": 1,
            "text": "I suggest education vs legislation. \nRather than making it illegal, let’s make sure that it’s called opinion news instead of news.",
            "title_similarity": "0.5607704",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy4797n",
            "score": 1,
            "text": "Uhh it is?",
            "title_similarity": "-0.18900418",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy47kff",
            "score": 1,
            "text": "how is it going to happen?",
            "title_similarity": "0.012310073",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy47s1i",
            "score": 3,
            "text": "How else are they going to get you to hate your neighbor and ban family members from Thanksgiving?",
            "title_similarity": "0.69975424",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gy48wms",
            "score": 1,
            "text": "News used to have standards.  They had to report as objectively as possible.  NPR still does this.  They explain both sides as best they can.  For being fair, they're labelled as \"liberal media\" though.  What we have now is entertainment and opinion.  It's not even close to news.  We don't have an issue with people not knowing the truth.  We have an issue with people profiting from spreading lies and fear.",
            "title_similarity": "0.7405045",
            "sentiment_compound": 0.6044
        },
        {
            "id": "gy48y0t",
            "score": 1,
            "text": "You know, I’ve mentioned this to other people but outrage sells. I think what we need is to look at journalism differently and remove the incentives for selling narratives and story telling (looking at you bloggers/youtubers). One way to do it is (in my opinion of course) to remove the market from this and make journalism like education and make it publicly funded. CNN and Fox News are trash because they are trying to sell news not tell news, they want you glued to the TV and watching everything through their channels. Removing that incentive is imperative to better and cleaner news and information. Sure, there will be nuance but the incentive for agenda driven story telling will be removed while the public reviews all the info provided by newscasters committed to just relaying the information as it comes readily available and understood.",
            "title_similarity": "0.8535208",
            "sentiment_compound": 0.9595
        },
        {
            "id": "gy497j7",
            "score": 1,
            "text": "Information is inherently belief. This amounts to legislated punishment against blasphemy.",
            "title_similarity": "0.44262844",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gy49auy",
            "score": 1,
            "text": "In a country based in Capitalism, the news media stations are simply trying to improve their bottom line.  Truth often gets viewers, but sensationalized articles get more, which results in more sponsors and more profit.  When they start reporting based on what their viewer base wants to hear, they solidify their viewership.  When they sensationalize what their viewers want to hear, their viewers become cash cows.  Feed the cash cow, make money, fact and fiction matter less and less when the profits go through the roof.",
            "title_similarity": "0.6224023",
            "sentiment_compound": 0.8989
        },
        {
            "id": "gy4ajrj",
            "score": 1,
            "text": "At the end of the day, news outlets are still a business that “need” product to sell. What happens when you run out of product? Produce more. It’s messed up but something I came to realize especially within this past year. I do agree that it should be illegal.",
            "title_similarity": "0.7123989",
            "sentiment_compound": -0.5407
        },
        {
            "id": "gy4awa4",
            "score": 1,
            "text": "Fake news is more about obscuring context than saying provably false things. We can never get rid of fake news just by fact checking because virtually all lies have a kernel of truth and all true news statements invoke untestable claims. Fact checking does little against fake news because true things can be extremely misleading and there is no objective way to tell if the “right” amount of context is provided. Even if we had totally reliable arbiters of truth, they would be very poor at determining if enough context is given to that piece of news to be meaningful for the audience. And then you have to ask which audience is this information meaningful for?",
            "title_similarity": "0.8234707",
            "sentiment_compound": -0.7655
        },
        {
            "id": "gy4b5vb",
            "score": 1,
            "text": "if there are ‘two sides’ won’t one always be false(r)",
            "title_similarity": "0.23883134",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy4b8l7",
            "score": 1,
            "text": "\"Situation under control. Only one dead from yesterday's minor gas leak accident\" or \"Situation getting critical! Another innocent soul has perished from the uncontrolable deadly gas poisoning leakage spreading through the city center\". Same news. You dont need to lie to make the truth appear different.",
            "title_similarity": "0.6474426",
            "sentiment_compound": -0.9098
        },
        {
            "id": "gy4bubf",
            "score": 1,
            "text": "Whilst a lot of people have mentioned who gets to decide, what they aren't addressing is that there are some things that are simply facts. The earth is a globe, 5g doesn't cause covid, etc etc. Whilst I can see the point for some more uncertain topics, for somethings there simply should not even be a debate.",
            "title_similarity": "0.60038364",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gy4cnew",
            "score": 1,
            "text": "It is: [https://www.fcc.gov/consumers/guides/broadcasting-false-information](https://www.fcc.gov/consumers/guides/broadcasting-false-information). The problem is that news broadcasters know exactly how to phrase their lies to avoid legal action. \"It's being reported\", \"sources say\", \"anonymous reporting\".. all designed to shift ownership and responsibility. Another of these are \"opinions\", where the entire network yields it's stance to a personal opinion of a panelist.\n\nThe latest trick, especially on one particular network, is skirting responsibility by calling their fake news programs \"entertainment\" instead of \"news\".\n\nEven if they are caught red handed, they will simply issue a \"correction\" and move on. They are never prosecuted [anymore](https://en.wikipedia.org/wiki/FCC_fairness_doctrine#Application_of_the_doctrine_by_the_FCC).",
            "title_similarity": "0.7820361",
            "sentiment_compound": -0.6722
        },
        {
            "id": "gy4czh1",
            "score": 1,
            "text": "The real question is how do you achieve this from a social standpoint. Wouldn't it be easier to just form a metric for objective truthfulness in reporting, verified by hindsight, and the brands that failed to score high on objective truthfulness standards would get publicly shunned. \n\nEnough of this system that we come to rely on it and then you could involve the legality aspect, with say, sanctions, taxes or disbandment of offenders that sink past a set bar of tolerance.",
            "title_similarity": "0.7216296",
            "sentiment_compound": -0.1361
        },
        {
            "id": "gy4dj9l",
            "score": 1,
            "text": "**companies*",
            "title_similarity": "0.14460438",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy4doh5",
            "score": 1,
            "text": "Well, it is, isn't it? Take that guy who \"enhanced\" 911 photos for instance.",
            "title_similarity": "0.30288637",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy4eiw6",
            "score": 1,
            "text": "The rich people depend on their misinformation stations to keep us from collectively realizing that literally every problem our society suffers from is their fucking fault.",
            "title_similarity": "0.7917942",
            "sentiment_compound": -0.7574
        },
        {
            "id": "gy4ejwi",
            "score": 1,
            "text": "Should be yes. But now power is held by organizations and the government is made up of elected officials who were out there by the campaign contributions of these companies.",
            "title_similarity": "0.44348776",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gy4gdbm",
            "score": 1,
            "text": "Fox has been sued multiple times for not using sources and shit lmao",
            "title_similarity": "0.64016414",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gy4gqb9",
            "score": 1,
            "text": "I just wanted to give OP props for listing both CNN and Fox. Refreshing.",
            "title_similarity": "0.5021063",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy4ij9u",
            "score": 1,
            "text": "There should be a hefty fine issued for sure",
            "title_similarity": "0.23870265",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gy4jxc0",
            "score": 1,
            "text": "Sounds great in theory. \n\nBut as long as we have our society artificially steered into two opposed \"left /right\" ideological camps, there's no way to ever reliably give power to a \"neutral\" fact checking source.\n\nThere are also many many ways to be deceptive without outright telling lies (although they certainly all lie). \n\nYou can lie by omission for example, or cherry pick specific information to support a narrative, or give opinion pieces.\n\nUnfortunately, it must fall on the individual to sort out truth on his or her own. There is no one you can trust to do this for you.",
            "title_similarity": "0.82461846",
            "sentiment_compound": 0.8979
        },
        {
            "id": "gy4kh14",
            "score": 1,
            "text": "The big issue with this situation ironically is because of the First Amendment. The First Amendment protects virtually all forms of speech with a few obvious exceptions,(hate speech etc.). According to the Supreme Court, this also means that potentially false information published by news media (and the exception here really only exists for journalism in this case) is also technically protected by the First Amendment. This sounds incredibly dumb at face value, but there is a point to it. In this current landscape, a news media outlet can publish a false story under a few stipulations: it can't be something that be proven to be considered malicious or published with malicious intent (generally something documented and straightforward here needs to be present to really prove that), it can't be something that they know ahead of time to be certainly false (again generally some sort of internal documented proof from the media outlet in question needs to exist for this to qualify), or in some cases negligence/reckless disregard for the truth needs to have occurred. What this means however is that a news media outlet can technically publish a story that is PROBABLY untrue as long as they don't continue to publish the story once it has been proven false, and as long as they have done enough of what is considered to be \"due diligence\" on their end to verify the likelihood of it being true or false. In a lot of real life examples you will see a singular news outlet (New York Post)  publish something very polarizing (Hunter Biden Laptop Story), that catches like wildfire subsequently with other media outlets reporting on it, which then leads to the story eventually being for the most part debunked, and then the end result is radio silence as the media outlet moves on to another story/topic, as attempting to follow-up or continue to push that story could place them in hot water legally speaking. All of this taken together sounds like an incredibly poor system, and for the general public, when people follow inherit bias and tend be under or uneducated respective to their peers, it does create poor results like the spread of misinformation.\n\nHowever, the problem is that this issue is a multifaceted problem, and that attempting to remedy this problem can in turn create new unintended problems. Following that train of thought, let's say truthiness of an article or story now has to be verified. Who is qualified to verify it? Does it come from directly from the government? Or a regulatory body created by the government? If it doesn't come from the government then how do you form that regulatory body? Or even if you do form it then how do they have the power to properly execute the proper procedures of what is essentially a government body? The issue with this is now that you create an unintended \"chilling effect\" on journalism, where now stories that are most likely false don't get pushed as frequently due to the fear of repercussions, but stories that are potentially true that media outlets aren't able to verify with 100% certainty might not ever get out to the public due to the fear of punishment by the law or retaliation from the government itself. This is what the Supreme Court overall has argued for in favor of generally not regulating the truthfulness of journalism, that all types of news media should exist and it be up to the general public and their better judgement to determine whether or not something is or isn't completely true. A fair bit of cases in the Late 1900's tend to highlight the Supreme Court's general disdain towards attempting to control \"Free Speech\" as per the First Amendment. If you have governmental regulation of speech like this then things like the Pentagon Papers that the Nixon Administration tried to block regarding the US involvement of Vietnam would have probably never been released during the public. As a result there can be a few unintended consequences that attempt trying to directly address problems like this which is why in most cases we now have supplementary sources of information, things like fact checkers, that assist in determining what news is or isn't actually true or false.",
            "title_similarity": "0.77802557",
            "sentiment_compound": 0.94
        },
        {
            "id": "gy4kvb7",
            "score": 1,
            "text": "I would agree with that. I actually read an excerpt by Claire Booth Luce about this topic. It isn't valid to do this. It is very ingenuine. We should have the valid news possible in order to fact check information very well.",
            "title_similarity": "0.66537666",
            "sentiment_compound": 0.5984
        },
        {
            "id": "gy4l3fw",
            "score": 2,
            "text": "It's already illegal to knowingly spread misinformation... the problem is that it's *really hard* to actually prove someone is willfully spreading misinformation.",
            "title_similarity": "0.69775844",
            "sentiment_compound": -0.8908
        },
        {
            "id": "gy4l9rx",
            "score": 5,
            "text": "It should be illegal for all media to report and repeat lies. CNN, FOX, ABC, Google, Facebook, Buzzfeed, YouTube, Sinclair, etcetera. \n\nTheir privilege to broadcast on TV, radio, print and online should be taken away for spreading false and misleading information.",
            "title_similarity": "0.86506057",
            "sentiment_compound": -0.765
        },
        {
            "id": "gy4lpc9",
            "score": 1,
            "text": "Lmao solid idea, let the government step in and fully control what companies can or can’t do with regards to speech.",
            "title_similarity": "0.56122994",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gy4ly0g",
            "score": 1,
            "text": "Its not news!!! ITS ENTERTAINMENT!!! by a court order nonetheless!",
            "title_similarity": "0.43877935",
            "sentiment_compound": -0.6177
        },
        {
            "id": "gy4mbhc",
            "score": 1,
            "text": "It is, it’s called libel",
            "title_similarity": "0.2893762",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy4mdso",
            "score": 1,
            "text": "It already IS illegal. There’s just no repercussions because they’re owned by billionaires above the law",
            "title_similarity": "0.64814824",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gy4n5hk",
            "score": 2,
            "text": "I miss the days when news was on at 9 and 11, so journalists had all day to fact-check their sources and focus on what was truly important. Now that everything is 24/7 and ratings-based it's a race to see how many eyeballs you can capture at any given time.",
            "title_similarity": "0.66141224",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gy4od5f",
            "score": 1,
            "text": "Truth, as best known, used to matter a great deal in both printed and other media.  I'm looking forward to Fox Soi-disant News getting sued for their willful defamation of dominion voting company.",
            "title_similarity": "0.6506962",
            "sentiment_compound": 0.8934
        },
        {
            "id": "gy4oqkw",
            "score": 1,
            "text": "People should stop thinking of news as entertainment",
            "title_similarity": "0.66205394",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy4otst",
            "score": 2,
            "text": "Equating CNN to Faux News is absolutely asinine.\n\n[https://www.businessinsider.com/study-watching-fox-news-makes-you-less-informed-than-watching-no-news-at-all-2012-5](https://www.businessinsider.com/study-watching-fox-news-makes-you-less-informed-than-watching-no-news-at-all-2012-5)\n\nOne is news, the other propaganda.\n\n[https://www.huffingtonpost.ca/2017/04/01/fox-news-for-entertainment-purposes-only-disclaimer\\_n\\_15727044.html](https://www.huffingtonpost.ca/2017/04/01/fox-news-for-entertainment-purposes-only-disclaimer_n_15727044.html)",
            "title_similarity": "0.85055953",
            "sentiment_compound": -0.25
        },
        {
            "id": "gy4pbms",
            "score": 2,
            "text": "It should be less about media companies spreading false information, and instead making a much clearer (and consistent) line between opinion and news. News can get it wrong, and that is understood. But when you can't tell if what you are watching is news or opinion, that is when there is a real problem.",
            "title_similarity": "0.675127",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gy4pv5x",
            "score": 1,
            "text": "Illegal is a strong word. I believe the news media should have wide access to present the news as they see it, but there should also be sharp repercussions for editorializing regular news content. Keep the opinions on the opinion page.\n\nI of course I have no specific ideas for how to accomplish this. Normally I would be a fan of the free market but it seems the free market has brought us where we are now. The problem is the news is consumed not to gain knowledge, but for entertainment. Companies like CNN and Fox are profiting off providing entertainment disguised as news.",
            "title_similarity": "0.8253464",
            "sentiment_compound": 0.9571
        },
        {
            "id": "gy4qd61",
            "score": 1,
            "text": "Are they magnifying false information? Do they just state slander as questions to avoid scrutiny? Do all pundits not suffer, but revel in coprophilia? The answers to these questions after the break. Now, sports!",
            "title_similarity": "0.7237284",
            "sentiment_compound": 0.2862
        },
        {
            "id": "gy4qen9",
            "score": 2,
            "text": "bUt my fIRst AmuNdMuNt riGhTs",
            "title_similarity": "0.01942736",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy4qmx4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1386511"
        },
        {
            "id": "gy4qpoo",
            "score": 1,
            "text": "Apparently the courts will be deciding this. Fox News , specifically Tucker gnarlson, was sued for defamation and misinformation and ended up getting the case dropped because no intelligent adult would take anything tucker gnarlson says as fact. \n\nhttps://www.npr.org/2020/09/29/917747123/you-literally-cant-believe-the-facts-tucker-carlson-tells-you-so-say-fox-s-lawye \n\nThey are also being sued by dominion for misinformation mad defamation regarding the supposed election fraud and also by a transparency group over covid-19 coverage. \n\nhttps://missoulacurrent.com/government/2020/04/fox-news-coronavirus/?print=print \n\nWe will find out how “illegal” it is but my guess is, as long as they’re asking “questions” then it’s not factual statement. “Some people says Tucker Garlson is fascist. I’m not saying he is but how do we know he’s not??”  \n\nSee season 13 South Park Dances with Smurf’s episode",
            "title_similarity": "0.84533054",
            "sentiment_compound": -0.9182
        },
        {
            "id": "gy4qqmc",
            "score": 1,
            "text": "Ffs this is like all the popular opinions on /r/unpopularopinion. You know damn well what you're saying is a view held by most of this website you're just a karmawhore.",
            "title_similarity": "0.55658686",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gy4qqos",
            "score": 1,
            "text": "The problem with limiting speach is this:\n\nThe people in charge of limiting the speach will be changing regularly and their opinions will be applied in such widely different ways that fairly quickly freedom of expression will be a memory. \n\nNo speach should be limited. Even if we hate the message. Because people may hate your message some day and then your opinion is used against you.",
            "title_similarity": "0.7580472",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gy4qsz2",
            "score": 1,
            "text": "Bringing back the fairness doctrine would solve many of the problems of media distortion.",
            "title_similarity": "0.45374072",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gy4rvd2",
            "score": 1,
            "text": "I agree. News stations have been taken to court over misinformation and let off the hook by stating in so many words \"only a moron would think we broadcast actual news, were not a news company, were an entertainment company...\"\n\nThere would need to be an impartial, international bipartisan, nonprofit,  science based institution that would audit new stations to determine fact from fiction and fine stations that vertify themselves to be distributors of factual news who publish false information and do not correct themselves when notified by these institutions.",
            "title_similarity": "0.8357733",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy4rvqc",
            "score": 2,
            "text": "I feel like we should ban all the opinion portions from news networks. Everyone from Tucker Carlson to Rachel Maddow. This to me is one of the biggest factors in the divide between parties and the facts they believe. Opinion isn’t fact, it’s opinion, and should not be included in major news networks.",
            "title_similarity": "0.87486935",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy4s7fj",
            "score": 1,
            "text": "I don’t trust cnn or fox to decide what is true or not.  That’s up to each of us.",
            "title_similarity": "0.7693102",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gy4stf7",
            "score": 1,
            "text": "Well first there absolutely is a point in doing so. It's not altruistic or honorable reasons you might say, but still, there's always someone making profit from spreading disinformation.thats the whole point. \nSecondly ,making something illegal is not a solution by itself. How do you enforce that? How do you decide what is and is not false information? Even better, how do you clearly define what is considered \"illegal false information\" vs making honest mistakes or discovering more facts along the way? And better yet, who gets to decide what is true and what is false?? I see our come from good intentions, but what you propose will create way more problems than it could solve. And even make the situation its supposed to solve, become potentially a lot worse.",
            "title_similarity": "0.6917753",
            "sentiment_compound": 0.878
        },
        {
            "id": "gy4ufhe",
            "score": 1,
            "text": "This describes a literal suppression of the freedom of speech/ freedom of press. As others have said “who decides what is ‘false?”\n\nI once suggested, that instead of that, any show that discusses “news” or “politics” would need a disclaimer saying how much of the show\nFeatured verified facts.",
            "title_similarity": "0.7329452",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gy4uqxi",
            "score": 1,
            "text": "I agree that there has been some wild cases of misinformation spread online by media companies in the past few decades (or even further back). However, implementing a law against the spreading of misinformation is very difficult.\n\nThe way I could see a law like this being implemented is as a branch of the judicial justice system. It seems like the executive or legislative branches of the US government would be quite biased if they were making the call.\n\nAlright, so the judicial system handles these cases. How do we take down or place strikes against media broadcasters who are spreading misinformation equitably? Hard to say, and who will decide this unbiasedly? Certainly not the aforementioned legislators.\n\nMy point is that it's very difficult to equitably enforce this law without coming at odds with free speech. However, I do think you're getting at something here. Perhaps governments should begin treated the free speech of companies different from the free speech of individuals, even if the speech from the company was from a single individual.\nin regards to treating free speech from the individual as different from the free speech of a company.\n\nI do believe that some of the offending broadcasting companies like Fox News should be sanctioned or even dismantled. However, the specifics of implementing a system like this is very difficult. So I don't think it should be illegal for a huge media company like CNN or Fox News to magnify or spread misinformation *WITHIN THE CURRENT GOVERNMENTAL SYSTEM*, because it sets a precedent that the current government can hobble any speech against it.\n\nEdit: As I scroll down the comments here, I realize that almost everyone made this counterargument. Welp ¯\\_(ツ)_/¯.\n\nI'd also just like to make my point clear: in theory the law proposed would be great, however, in practicality, whoever gets to enforce this law will have lots of power over the free speech of companies, which may lead to even more misinformation.",
            "title_similarity": "0.77249277",
            "sentiment_compound": 0.9686
        },
        {
            "id": "gy4w36v",
            "score": 1,
            "text": "OP should read « Manufacturing consent » by Noam Chomsky, a lot of the original post’s naive takes will be explained.",
            "title_similarity": "0.39600497",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy4zzlg",
            "score": 3,
            "text": "Yeah, but who determines what “false information “ is? I don’t think it’s wise to give\nThe government that sorry of authority. It’s to tempting to redefine what “false” means. History has shown when governments do have that power “false” just means anything they don’t want the people to know. \n\nThere is also the matter of points of view. While I agree there is usually an absolute truth in a matter I also understand that there are different perceptions of a truth. It can be easy to say someone’s perception is “false” when in reality both sides have a valid point. If the people who determine what’s “false” have a certain perception on something they my censor the other perception even though it’s not really false. \n\nI think it’s best to allow free flow of information even at the risk of false information. Censorship has a bad history of abuse.",
            "title_similarity": "0.6994786",
            "sentiment_compound": 0.9481
        },
        {
            "id": "gy53hvk",
            "score": 1,
            "text": "The moment you start policing speech for any reason you are on a fast track to a totalitarian regime.",
            "title_similarity": "0.5427016",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gy5463s",
            "score": 1,
            "text": "Everyone is entitled to share their opinion. \nThere’s no person or committee that I would trust to arbitrate what is true and what isn’t. \nOne of those cases where we have a problem, but the solution is more problematic than the problem itself.",
            "title_similarity": "0.6735305",
            "sentiment_compound": -0.4835
        },
        {
            "id": "gy55mja",
            "score": 1,
            "text": "How would this be enforced? Certainly we can't stop EVERYONE from lying, so who/how do we decide who gets to lie?",
            "title_similarity": "0.6176719",
            "sentiment_compound": -0.121
        },
        {
            "id": "gy55xrk",
            "score": 1,
            "text": "Fox isn't news though. They themselves classified the station as entertainment purposes only to avoid getting in some very hot water.",
            "title_similarity": "0.7638507",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy585q7",
            "score": 1,
            "text": "“Congress shall make no law…abridging the freedom of speech, or of the press…”",
            "title_similarity": "0.6135419",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gy5955j",
            "score": 1,
            "text": "I think it kind of is, with holes of course. To my knowledge, neither of them have given \"fake news.\" They are telling a one-sided story. They tell the truth from a biased perspective.",
            "title_similarity": "0.62101126",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gy5ampj",
            "score": 1,
            "text": "It was once.",
            "title_similarity": "-0.17844671",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy5aofl",
            "score": 2,
            "text": "Ok i hear you, and understand your frustrations... but who decides what is truthful?\n\nDo you trust the government to decide what is true? A company? A vote? All these sound like a direct ticket to alt facts.",
            "title_similarity": "0.6191782",
            "sentiment_compound": 0.9514
        },
        {
            "id": "gy5betb",
            "score": 1,
            "text": "Mainstream is dogshit and always will be. Look up operation mockingbird.",
            "title_similarity": "0.28928328",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy5e1m3",
            "score": 2,
            "text": "Real news is typically so unbearably dry that people tune out when hearing it. Not saying they are 100% accurate, but channels like CSPAN are typically more legitimate for that reason, and why no one watches them, because there's not usually a spin for viewership. Local news channels are also more accurate/less speculative.",
            "title_similarity": "0.71441615",
            "sentiment_compound": 0.3543
        },
        {
            "id": "gy5ehuq",
            "score": 1,
            "text": "I'm from Canada but grew up on US media.\n\nMy first job was delivering newspapers and my Dad was always reading the paper or watching the news.\n\nRead up on Marshall McLuhan and the Global Village and how media influences us.\n\n> World War 3 is a guerrilla information war with no division between military and civilian participation.\n\nInformation is the most valuable asset in war and the public is losing the battle.\n\nIn the 80s, the US government colluded with the media conglomerates to phase out negative war coverage. By the time the Gulf War started, outlets like CNN were working as propaganda fronts for the military. The end goal was to eliminate the youth antiwar movement which succeeded since the war industry is in a 2 decade war.\n\nFOX News started in 1996 when the FCC dumped 70 year old anti-monopoly laws to allow the big media companies the ability to expand without restraint.\n\nPrior to 1996, the US media spectrum was non-partisan and news was held accountable by the viewers who were on both sides of the political spectrum.\n\nYou can't regulate opinions, you can only argue facts. That's why journalism needs to be non partisan and objective so people can argue the facts rather than being trapped in opinion based echo chambers.",
            "title_similarity": "0.7452688",
            "sentiment_compound": -0.9945
        },
        {
            "id": "gy5ghi8",
            "score": 1,
            "text": "Honestly they should be rebranded as \"news entertainment\" because that is what all the major 24 hour news networks are. \n\nJust like the WWE is sports entertainment. \n\nI really haven't watched either network for a long time, but I still read CNN's website. I noticed CNN doesn't spread false information. But it does omit details, to be fair NPR does as well. While I only notice it when talking about firearms, emergency services and security it is pervasive. \n\nI don't think that's intentional however, it's just a the journalists need to get something out fast. So they report surface level details because they don't fully understand. I think the most relevant example (and I wish I could remember it better) was NPRs radio reporting on Heartbleed and OpenSSL. The reporting was as such that you would walk away thinking OpenSSL and open source was somehow 'bad'. \n\nThe other thing they are guilty of (and this could be algorithmic) is composition of information. You see this more with gun violence. In an article that talks about a murder (like that football player who kill the doctor and the family) they will list other major events and opinion pieces. It is very easy for someone to assume that the foot player used an AR-15 or similar due to how it's put together. \n\nOf course I'm only picking these things out because I happen to know a bit more about them. In print or web it's a bit easier to ignore. But the Heartbleed reporting bothered me a lot since I was used to trusting NPRs reporting, and it made me wonder about conclusions I drew when they discussed something I didn't know much about.",
            "title_similarity": "0.72306824",
            "sentiment_compound": -0.8509
        },
        {
            "id": "gy5ncw0",
            "score": 1,
            "text": "Or you could be an adult and not blindly trust what you see on the television. I stopped watching televised news in my mid 20’s because I’m not a moron.",
            "title_similarity": "0.65707755",
            "sentiment_compound": -0.2439
        },
        {
            "id": "gy5nke2",
            "score": 1,
            "text": "Re-Introduce the FCC Fairness Doctrine.",
            "title_similarity": "0.2235645",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy5pdp8",
            "score": 1,
            "text": "Why would someone want to change this view it seems like common sense lol",
            "title_similarity": "0.39452413",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gy5sek5",
            "score": 1,
            "text": "There used to be regulations about this foreign forcing journalistic ethics, such as the fairness doctrine, which were rolled back by Republicans in a series of legislative maneuvers that led to the ability of these networks to consolidate and proliferate without paying any heat and to accuracy of reporting. Shameful.",
            "title_similarity": "0.7359802",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gy5up7p",
            "score": 1,
            "text": "You show me five false stories on CNN and I’ll show you five hundred false stories on Fox News.",
            "title_similarity": "0.5207391",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy618yz",
            "score": 1,
            "text": "The usually don’t spread entirely false information- it is much more dangerous than that.  They deliberately spread intentionally inflammatory information presented in the most extreme way possible.\n\nIt is absolutely disgusting that they call themselves journalism.",
            "title_similarity": "0.76612264",
            "sentiment_compound": -0.7956
        },
        {
            "id": "gy61xxl",
            "score": 1,
            "text": "But who will define \"false information\"? The government? If that's the case then what's stopping them from considering anything negative about them \"fake news\" and anything positive real news? Same with state-funded news stations.\n\nEDIT: damn guess a thousand other people said the same damn thing lol. Glad to see a lot of us understand that fascism isn't just \"party I don't like being praised/party I like being denounced.\"",
            "title_similarity": "0.83815527",
            "sentiment_compound": -0.8147
        },
        {
            "id": "gy8fhxd",
            "score": 1,
            "text": "Make the judicial system more efficient. I find that for these kind of things there are actually laws about spreading misinformation but it's almost impossible to execute it because of the time it takes, the money it will cost, how it's worded, the loopholes.etc. Right now you file a lawsuit and your waiting like 5 years for it to some to some sort of resolution. It's a waste of time and resources for the average citizen. \n\nIt's not a well thought out answer. My bad.",
            "title_similarity": "0.7541994",
            "sentiment_compound": -0.8546
        },
        {
            "id": "gys4r5s",
            "score": 1,
            "text": "Should...hmm, maybe. But possible? No.  The loophole would just be rewording any media statements in the form of an “opinion piece” and according to the author. This would be protected over the freedom of speech and rightfully so! We would never want to lose our freedom of speech so this could never play out in reality.",
            "title_similarity": "0.6831267",
            "sentiment_compound": 0.9568
        },
        {
            "id": "gywukcd",
            "score": 1,
            "text": "Wow great idea! I'm sure a law like that wouldn't be abused by those in power or anything",
            "title_similarity": "0.48003465",
            "sentiment_compound": 0.9402
        },
        {
            "id": "gzdkps5",
            "score": 2,
            "text": "Exemple of how this can go wrong Trump doenst believe in climate change. So for him its false news. Now no media outlet is allowde to report on it.",
            "title_similarity": "0.82982147",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h02s6na",
            "score": 2,
            "text": "Yup. True.\n\nAlso shouldn't be too much to ask.",
            "title_similarity": "0.22129005",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h6ddh5w",
            "score": 1,
            "text": "The government should not decide what is the truth.",
            "title_similarity": "0.62392527",
            "sentiment_compound": 0.3182
        }
    ]
}