{
    "CMV: Everyone running for office, in office, or in a position that requires legislative confirmation should be required to publicly release their taxes (with redactions for excessively personal information).\nEnsuring that the individuals making up the government are protected from outside influence, whether by businesses or by foreign actors, is a critical part of ensuring a democracy remains strong.  By requiring the taxes be released, it allows them to be reviewed for signs of undue influence.  By requiring the release to be public, it prevents corrupt individuals within the government from selectively pursuing and/or ignoring the individuals that do become involved in malfeasance.  And by requiring the releases to be done by everyone in the upper levels of government, it allows for a completely party neutral approach.": [
        {
            "id": "gyrkd2i",
            "score": 1,
            "text": "Hi /u/ExceptionCollection! You're not in trouble, don't worry. This is just a **Rules Reminder for All Users.** \n\n---\n\n**All users, (including mods, OP, and commenters) are required to follow the rules of this sub at all times.** If you see a user violate the rules of the sub, please report that comment/post and a human moderator will review it. We understand that some topics posted here may touch on sensitive or contentious issues. We ask that all users **remember the human** and **assume good faith**. \n\n**Notice to all users:**\n\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\n\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \n\n\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\n\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\n\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\n\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.621456",
            "sentiment_compound": 0.8371
        },
        {
            "id": "gylkvll",
            "score": -1,
            "text": "i would say zero redactions for those holding any federal office and that would include annual reports on anyone currently in office, not simply those who are running for office. i would make exceptions for any politician in local and state office except governors. i am also tempted to say that their browser history should be public record.",
            "title_similarity": "0.66996956",
            "sentiment_compound": 0.0
        },
        {
            "id": "gylmnuw",
            "score": 660,
            "text": "I’ll do you one better and say that anybody running for elected office must go through a mandatory IRS audit of their past 5 years of tax returns. Sadly, I think Donald Trump made it abundantly clear that a substantial portion of the population really doesn’t care if the guy they support cheats on his taxes; the IRS, however, does.",
            "title_similarity": "0.7491642",
            "sentiment_compound": 0.8008
        },
        {
            "id": "gymdm8e",
            "score": 0,
            "text": "I agree!\n\nAnd more than taxes, I would like to have our politicians vetted for foreign/malign influence. Find out who they owe money and favors to.\n\nEspecially for something like President - let's have the intelligence agencies do a full review and release their findings in a report for the public.\n\nEvery politician should consent to having their finances investigated routinely. The risks of having politicians who are bought out by enemies is too dang high - we need to regulate this shit and make politics a boring ass, efficient job - not place to launder cash and influence.",
            "title_similarity": "0.8941345",
            "sentiment_compound": 0.1295
        },
        {
            "id": "gyn5vrc",
            "score": 0,
            "text": "anyone who cares about the integrity of the political system should agree with this imo",
            "title_similarity": "0.48838747",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gyncihi",
            "score": 0,
            "text": "I think, if anything, choosing to take office means you are accepting responsibility that comes with authority. You should not be entitled to a private life during the time that you serve the public, as such no redactions should be allowed, and further more you should be under public scrutiny 24hrs a day for the period that you are serving in office.\n\nYour internet search history, your conversations, everything should be on record, cameras rolling 24/7 on you and your family.\n\nIf this is too much for you, then no, dont go into office. There are those brave enough and with enough conviction to serve the greater good rather than their own interests.",
            "title_similarity": "0.773906",
            "sentiment_compound": 0.8653
        },
        {
            "id": "gynmlgb",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.028166901"
        },
        {
            "id": "gylisif",
            "score": 32,
            "text": "But whats the point? No way joe schmo 1 and 2 are gonna be able to find things a legal body wouldnt, so whats the point of making it public?\n\nIf you wanna say they should be analyzed and overlooked by a team of professionals to find any of this stuff and release their findings, sure i could see that but i dont understand the point of it being public.",
            "title_similarity": "0.64933693",
            "sentiment_compound": 0.2755
        },
        {
            "id": "gymgyjw",
            "score": 5,
            "text": "Here’s the problem. The IRS is a government agency, made up of people. People who are also corruptible. This would politicize the IRS as they can be used as a weapon to prevent political careers. \n\nIf the IRS can end political careers, there’s going to be a massive incentive to gain control of the IRS from a political stand-point. Now who’s the say that these IRS reviews won’t just be used as a way to let bad people pass through and good people back?",
            "title_similarity": "0.866954",
            "sentiment_compound": 0.128
        },
        {
            "id": "gym1nq0",
            "score": -1,
            "text": "I would go further and demand complete transparency about the person and who will rule over me. The voter should be the able to decide what levels of degeneracy is acceptable for them. Positions of power should be as unappealing as possible because right now they are just vehicles to enrich yourself. The injustice you're trying to lessen should be the sole motivator for what should be an ordeal.",
            "title_similarity": "0.7452048",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gym7l1q",
            "score": 1,
            "text": "I think this is reasonable, but doesn't go far enough. \n\nI'd actually prefer the [Norwegian model](https://www.forbes.com/sites/davidnikel/2020/09/04/in-norway-tax-returns-are-a-matter-of-public-record/?sh=493195de7931) where all citizens' tax returns are public. It makes it easier for everyone, and provides more data to talk to your employer about how you may be paid unfairly compared to your peers.\n\nIncluding things like wealth in the return also helps to combat a common thread I've heard in this thread, which is that there's a lot of bullshit you can do with your taxes that doesn't show up on a return. Including wealth allows you to more easily control for \"hey this politician makes 100k/year, but is worth 18 million dollars? We should investigate more\"",
            "title_similarity": "0.6724682",
            "sentiment_compound": 0.9509
        },
        {
            "id": "gyn5xc2",
            "score": 1,
            "text": "I would rather they get audited *after* they leave office than before they get elected.\n\nHow did Obama make so much money on a president's salary?",
            "title_similarity": "0.73141074",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gymf64w",
            "score": 10,
            "text": "Lets game this out a little bit.\n\nI think the first thing to note here is that the United States (which I think you're from) is not a democracy, but a democratic republic. This is a critical distinction because the US system is designed to give Unequal weights to votes (a vote in nebraska is more valuable than a vote in California).\n\nThe second thing to note would be that politics is by its very nature influenced by outsiders. Large businesses want things, large associations like worker's unions want things, international organizations like the WHO wants things. The job of a politician is quite literally weighing the needs and wants of all groups that are trying to influence them, and making (or arguing for) decisions that would best benefit the desires of all these groups according to their views. In other words; politicians would be *incapable of doing their jobs* if they were not being influenced by outsiders.\n\nThe qualm you more specifically want to address is that large actors have more resources to put pressure on the politician to act in their favour. (Be this through legitimate or corrupt means.)\n\nHowever, releasing redacted tax returns does not solve this issue. If I'm from Big Corp. I would be able to buy all the billboards on the politician's commute, or fund their campaign, or support one of their favourite charities. None of these things would ever show up on tax returns but still influence the politician.\n\nThe flipside of this is of course that releasing tax returns is an enormous breach of privacy. Even when redacted, it would give the average joe a lot of insight into the financial situation of politicians, not to mention how social engineering experts could use this kind of information for identity theft.\n\nAll in all, you'd end up in a situation where you're adding a rule with limited upside (it doesn't adequately address the issue it's trying to solve), while coming at a great personal cost.\n\nWe also shouldn't forget here that, in the end, being a politician is still just a job. Granted, one with a lot of power and responsibility, but still a (minority) part of a larger life.",
            "title_similarity": "0.72799367",
            "sentiment_compound": 0.985
        },
        {
            "id": "gylkevu",
            "score": 130,
            "text": "There are plenty of ways to engage in financial shenanigans that won't show up on your taxes.",
            "title_similarity": "0.65461826",
            "sentiment_compound": 0.34
        },
        {
            "id": "gyln9ad",
            "score": 14,
            "text": "We have something similar in Czech republic. It's not a bad idea. Currently minister of health is very close to being swapped for someone else over this. Because in his previous position he hid vast majority of his income and fortune.\n\nBut I don't think it's very useful in preventing terrible people from running for office. Just look at Czech prime minister. That guy should be in jail but many people just don't care.",
            "title_similarity": "0.7023369",
            "sentiment_compound": -0.4807
        },
        {
            "id": "gym6nnm",
            "score": 53,
            "text": "I'm far more interested in the people who went into office and became millionaires on a 200k salary than I am interested in the millionaire who went into office.",
            "title_similarity": "0.5148847",
            "sentiment_compound": 0.6901
        },
        {
            "id": "gyn26ts",
            "score": 3,
            "text": "As a counter point, this is a bit of a virtue signal legislation that won’t actually curb corruption or anything like that. Few, if any Americans, are going to read any Politician’s tax returns. There would be such a heap, few have time for that. \n\nFurther, the political bend to what will be highlighted by the media will be enormous. A fleck on Trump’s returns will be broadcast. A scandal on Biden’s will be swept under the rug.\n\nKnowing this, no one will believe any of the reporting of the tax returns. And I generally think that tax returns are private information. I’m not sure the public is actually entitled to it. Actually I know for a fact they are not.",
            "title_similarity": "0.7534883",
            "sentiment_compound": 0.0098
        },
        {
            "id": "gyln178",
            "score": 31,
            "text": "The releasing of taxes should be a factor in an individual decision for whom to vote for.\n\nIf a person doesn’t care if a candidate releases or doesn’t release their taxes, they shouldn’t be deprived of the ability to vote for their candidate.\n\nIf a person cares about the releasing of taxes, they can decide not to vote for a candidate due to not releasing their taxes. \n\nThe IRS will come after someone who violates the tax code. If someone is following the law on their taxes, it shouldn’t matter.",
            "title_similarity": "0.7940442",
            "sentiment_compound": 0.296
        },
        {
            "id": "gymgbpl",
            "score": 94,
            "text": "I don't think you fully understand what tax returns show with what you're claiming.  Tax returns aren't long forms describing details of what a person has done.  It doesn't even describe the work done.  So if you see a line item of $500,000 from Raytheon - was the payment for a speech they gave, a course they taught to some employees, a bribe for access, payment for an idea or service provided?  All of the above?\n\nTax records aren't some great bastion of detail that give you detailed information.  It is literally a list of dollars and payers.  You can't tell if the person was a janitor, a CEO, a lawyer, or just plain old corruption.\n\nAnd I'm sure your response would be \"Well we would investigate it!\", which is a great sentiment, but ultimately useless.  Most investigation just involves straight up asking \"What was this for\" and no one is going to say \"Oh yeah, that was a bribe to ensure this new bill passes should they get elected\".",
            "title_similarity": "0.5851717",
            "sentiment_compound": 0.4029
        },
        {
            "id": "gyltn4m",
            "score": 1,
            "text": "There's quite a bit of a difference between elected positions and positions that require legislative confirmation (some of which are truly quite minor).  \n\nAppointed officials are already required to file financial disclosures and comply with ethics requirements -- this is probably pretty close to what redacted tax returns would show.  These list sources of income, assets, liabilities, and so on (you can see the specific information [here)](https://www.oge.gov/web/278eguide.nsf/Chapters/Public%20Financial%20Disclosure%20Guide?opendocument).\n\nFor most positions, these are probably good enough.  Do you really need more information than that about the Librarian of Congress, the US Marshal for Southern District of West Virginia, or the members of the Amtrak Reform Board?",
            "title_similarity": "0.7901387",
            "sentiment_compound": 0.8504
        },
        {
            "id": "gym5wws",
            "score": 2,
            "text": "What about this practice would stop the person running from having their spouse accept all \"donations\" in their name? Or their children, especially if minors and not filing taxes yet? Or their siblings? Their parents? Or their private LLC or nonprofit using a FEIN instead of social security number? \n\nI love the idea of transparency, but for couples who don't file jointly this is a super easy workaround for that.",
            "title_similarity": "0.6896572",
            "sentiment_compound": 0.9414
        },
        {
            "id": "gym7iy6",
            "score": 5,
            "text": "Do you believe that tax returns being released would materially affect how people vote? Would Trump’s taxes have prevented him from winning the election in 2016? Unless you have evidence otherwise, I don’t see how releasing taxes will affect voting enough to require disclosure. And if it’s not making a difference, then why require it? We could also require all candidates to participate in a free throw shooting contest and make everyone do it so it’s party neutral, but that also won’t move the needle for the voting public (probably).",
            "title_similarity": "0.750713",
            "sentiment_compound": 0.7122
        },
        {
            "id": "gym8t1e",
            "score": 2,
            "text": "This is all great but you don’t understand this is not how our politicians are bought. Two main ways is through stock purchases at employee rates and campaign contributions. Neither of which have a trail.",
            "title_similarity": "0.64867234",
            "sentiment_compound": 0.3716
        },
        {
            "id": "gym9cvg",
            "score": 1,
            "text": "Politicians should also get an education..",
            "title_similarity": "0.47997606",
            "sentiment_compound": 0.0
        },
        {
            "id": "gym9yyw",
            "score": 13,
            "text": "Why not all public employees? What makes legislative positions so special?  Non-elected executive and judicial corruption is arguably even worse.  And if you're okay with all public employees, why not just make all tax records public records?  \n\nThe sacrifices people already have to make to run for office are more than most reasonable people would want to endure.  Voters have a chance to get rid of bad and corrupt representatives every election and if they want to vote for someone who's finances are out in the open or not that seems fine to me.",
            "title_similarity": "0.829754",
            "sentiment_compound": -0.41
        },
        {
            "id": "gymcmmb",
            "score": 1,
            "text": "Can you give some examples of what such corruption, malfeasance, or undue influence would look like on a tax return? I'm having a hard time seeing how it would show such things. I could see it helping identify certain conflicts of interest (something you don't mention), but not actually any of the stuff you do mention.",
            "title_similarity": "0.68306327",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gymefr7",
            "score": 1,
            "text": "If your intent is to prove there is no undue influence, then publishing tax information will not accomplish that. Through redactions, NDAs, shell companies, etc, you aren’t going to ensure there isn’t undue influence.",
            "title_similarity": "0.6303555",
            "sentiment_compound": -0.234
        },
        {
            "id": "gymeqtn",
            "score": 1,
            "text": "Isn't it still legal to insider trade for people in these positions? aren't most of them not regulated for conflicts of interest? Don't a ton of them go into lobbying after? Isn't it literally legal to bribe officials?",
            "title_similarity": "0.7597432",
            "sentiment_compound": 0.5113
        },
        {
            "id": "gymff8f",
            "score": 1,
            "text": "I support a candidate’s “right to choose” whether or not to release their tax returns.",
            "title_similarity": "0.651203",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gymfl58",
            "score": 1,
            "text": "It also discourages people from entering politics, and, honestly it could put leaders at risk to their person and property. Leaks of sensitive information and unfair media coverage/libel/character assassination already discourage plenty of people from throwing their hats in the ring as it is. You could make the argument that a smaller pool of potential candidates might ensure that leaders of quality ascend to high offices but I’m not really persuaded. I think most of us have rightly diagnosed problems in politics to stem from the fact that only a certain type of affluent or connected person (from a small pool of candidates) runs and is elected to serve in government. So if you raise the barriers of entry too high, you’ll shrink the political class to an even smaller, more elite group. \n\nI think it should continue to remain discretionary for these reasons, especially since political careers can often be so short lived due to turnover.",
            "title_similarity": "0.7567235",
            "sentiment_compound": -0.775
        },
        {
            "id": "gymhe7o",
            "score": 1,
            "text": "If we have a separation of church and state, we need a separation of business and state.",
            "title_similarity": "0.59888756",
            "sentiment_compound": 0.0
        },
        {
            "id": "gymi8n8",
            "score": 1,
            "text": "Assets, income, and debt are already made public through their FEC filings. Campaign contributions are public as well. The president and vice president face mandatory audits every year. What other information do you hope to gain from the tax return that isn't already public and justifies the violation of privacy?",
            "title_similarity": "0.7982845",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gymk3hd",
            "score": 1,
            "text": "Or don't have taxes",
            "title_similarity": "0.24220732",
            "sentiment_compound": 0.0
        },
        {
            "id": "gymk3kb",
            "score": 1,
            "text": "Easier solution than looking at tax filings is just to remove all deductions and tax revenue instead of profits. Easier to track hard to hide and we could save everyone a ton of money and time.",
            "title_similarity": "0.63619167",
            "sentiment_compound": 0.8979
        },
        {
            "id": "gymkjsm",
            "score": 2,
            "text": "The trouble is public service really really sucks, and it's hard for the government to attract top talent when they can't pay as well as the private sector. Having to show all your financials will make it even harder to, say, get a treasury secretary who actually knows what they're doing.\n\nIn Billions, it's a running gag how all the public sector lawyers could leave and immediately get a job with quintuple their current salary.\n\nWe're in this catch 22 where the more accountable you make the government, the harder it is to hire competent people. Were you to require releasing taxes for cabinet positions, you're going to see even more politicians in those roles, instead of academics.",
            "title_similarity": "0.7760984",
            "sentiment_compound": -0.0231
        },
        {
            "id": "gymlbq1",
            "score": 1,
            "text": "Not just taxes but everything. They are running as our employee but with caveat that when hired their decisions will control our lives. I want to know everything as far back as possible.",
            "title_similarity": "0.71930987",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gymlhyw",
            "score": 1,
            "text": "They need to have drug tests",
            "title_similarity": "0.4397586",
            "sentiment_compound": 0.0
        },
        {
            "id": "gymoueq",
            "score": 1,
            "text": "I'm not sure how a tax return would automatically reveal \"undue influence.\" Taxes are owed to our OWN government, or at least, the taxes mentioned in your OP are.",
            "title_similarity": "0.7222836",
            "sentiment_compound": -0.2411
        },
        {
            "id": "gymqlfu",
            "score": 4,
            "text": "These people are elected officials who (ideally) are running for the good of the people, and with their blessing. They should not have to volunteer any information a normal citizen does not, and we should not \"force\" a person to do anything that isn't expected of a citizen. We have a reasonable way to do this - don't vote for people who choose not to release... If it's an issue it will fix itself. I don't want my candidate pool reduced, but I will choose not to vote for those I suspect may have untoward interests, and may ask to see said returns on a case by case basis. \n\n\nI am concerned that 90% of the time this info will mostly be used to spread fear and disinformation a la Qanon and typical political superpac ads. I don't want every person who runs to be subjected to that.",
            "title_similarity": "0.7531865",
            "sentiment_compound": -0.2718
        },
        {
            "id": "gymqu2e",
            "score": 1,
            "text": "Private companies have access to average citizens taxes anyway. It is just leveling the playing field.",
            "title_similarity": "0.55423677",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gymt2ro",
            "score": 1,
            "text": "The obsession with taxes in this case should be overridden wit an obsession for full transactions.",
            "title_similarity": "0.70918536",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gymuzux",
            "score": 1,
            "text": "What you would run into with publicly releasing the information is that unless you are into the business world and specifically finance/accounting or if you have done personal research on the subject you wouldn’t know the laws regarding many of the situations which allow people to avoid taxes. This can be an ethical issue for some, but for example if someone is the owner of a small business that is genuinely struggling and needs the tax breaks or tax credits then they should not be scrutinized for legally not having to pay taxes. \n\nWhat I propose as a preferred alternative would be having the IRS certify all public officials finances and taxes to guarantee they are in good legal standing. This would allow the public to know they haven’t been cheating the system, while also not opening up every official to scrutiny over what is the most personal aspect of most people’s lives, their finances.",
            "title_similarity": "0.8239807",
            "sentiment_compound": 0.7306
        },
        {
            "id": "gymwtq7",
            "score": 1,
            "text": "I’ll see that and I’ll raise you everyone running for office must be sworn in and remain under oath for all public statements material to the campaign.",
            "title_similarity": "0.65321696",
            "sentiment_compound": 0.0
        },
        {
            "id": "gymxpun",
            "score": 1,
            "text": ">Ensuring that the individuals making up the government are protected from outside influence, whether by businesses or by foreign actors, is a critical part of ensuring a democracy remains strong. \n\nYour tax return will not give you any information about any of these potential influences. \n\nNow the financial disclosure documents you must submit, regarding investments and income, those do.  And they are required to turn those in.\n\nTaxes only tell of your sources of income.  Investments are only disclosed if you sell or receive a dividend.  However the financial disclosure forms do require you to claim all of your investments.",
            "title_similarity": "0.85717905",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gymxvxf",
            "score": 1,
            "text": "They have to in most 1st world countries",
            "title_similarity": "0.20494217",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyn2vjv",
            "score": 1,
            "text": "Washington state has a better system for financial transparency of elected officials, in my opinion, than just releasing tax forms. The Public Disclosure Commission (PDC) requires each state or local elected officials and lobbyists to file a financial disclosure which includes rough values for real estate owned, debts (rough values and who owed), investments (rough values, stock or mutual fund names), job information, family member finances and jobs, and a few other things. \n\nSource: I’m a local elected Councilmember for a small city who has to fill out this disclosure every year.",
            "title_similarity": "0.6996912",
            "sentiment_compound": 0.875
        },
        {
            "id": "gyn2zzh",
            "score": 1,
            "text": "How would that help businesses and individuals funnel money and buy them off through Super PACs?",
            "title_similarity": "0.6639477",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gyn3ghq",
            "score": 2,
            "text": "What kinds of signs of undue influence are you thinking you'd find? It sounds like you're expecting to see \"Wages made from Corporate Espionage: $423,000...).  If I have a private business (let's say I'm a consultant specializing in corporate and government espionage), I'd have an LLC, S-Corp, and Inc that I'd be conducting business from. And that's where you would see WHOM I'm making money from via 1099s, etc. But that business is not running for President, the person is, and thus those businesses financial and tax records would not be subject to this Presidential Audit. If they were, you'd be opening a whole new can of worms (like now prove that it was this member of the company and not someone else conducting bad deeds, etc etc).\n\n\nFurthermore, when do you audit? While they're a candidate or after elected but before they take office? If it's while they're a candidate you probably going to see much fewer people running. \nIf after, what is the recourse if they refuse? Are they going to forfeit their spot and have the country run a new election? Correct me if I'm wrong, but there isn't a single thing that can be \"found out\" about an elected President that could \"invalidate\" their victory. Even if you found out they were a serial killer, I'm pretty sure you'd still have to go through an impeachment process to get rid of them. But I'd love for someone to school me on the actual procedure here because I'm not 100% sure.",
            "title_similarity": "0.70418304",
            "sentiment_compound": -0.6128
        },
        {
            "id": "gyn7yae",
            "score": 1,
            "text": "No, if you want to know that they did something wrong you’re not gonna find it on their tax returns. They aren’t stupid enough to self report criminality. Also, taxation is theft so we should just outlaw taxes.",
            "title_similarity": "0.7270706",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gyn7yvu",
            "score": 1,
            "text": "How about we just get rid of half the politicians and only allow them to do anything once every 5 years",
            "title_similarity": "0.35665888",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gyn8gdp",
            "score": 1,
            "text": "Yep! And they should be vetted for security clearance before people vote.. so it's not an obligation and 'rush'.. if they can't pass a security check and show their financial ties - get off the ballot!",
            "title_similarity": "0.7652458",
            "sentiment_compound": 0.485
        },
        {
            "id": "gyn8thx",
            "score": 1,
            "text": "Who pays for someone to go back through their taxes to check for issues before release? Rich nominees can do that whenever, folks without as much money will struggle.",
            "title_similarity": "0.7516398",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gynf2lz",
            "score": 2,
            "text": "It is nonsensical to think that you can solve corruption by forcing people to disclose their tax returns. And if that was truly the case, you don't need to force politicians to do this and compromise their financial privacy. You can have a law that lets an independent body, maybe headed by a judge or court of law, examine the financials and keep the findings private. Courts do this all the time.\n\nAnd at any rate, this is not how you solve corruption. What you need are laws and strong oversight and strong neutral and politically independent bodies that ensure corruption doesn't happen, and if it does, it gets detected and punished.",
            "title_similarity": "0.78943634",
            "sentiment_compound": 0.8522
        },
        {
            "id": "gynhje4",
            "score": 1,
            "text": "I don’t think the “public” is qualified to judge the validity of tax returns within the context of what your view is.  However, there are plenty of experts who are.  Would you agree that it might make sense for a team of non-partisan experts to conduct the review you’re proposing?  Would you also agree that publicly released documents such as tax returns would be used by the opposite party to find fault and be unfairly critical?\n\nIf so, and the goal is actually what you mentioned, then your view should absolutely change from a “public release” to a limited audit by actual experts.",
            "title_similarity": "0.7702921",
            "sentiment_compound": 0.2869
        },
        {
            "id": "gynk2yu",
            "score": 1,
            "text": "All candidates and members of Congress, their top staffers, the President, and most appointees have to file yearly financial disclosures that reveal a lot more information than a normal tax return. It lists assets down to the stock in most cases, liabilities (who they owe money to), transactions, etc. Members of Congress must also report the sale or purchase of assets within a couple weeks. \n\nThese are all publicly available. For example, you can search members of the House here — https://disclosures-clerk.house.gov/PublicDisclosure/FinancialDisclosure\n\nThere is certainly ways this can be improved, but there is already a lot of transparency in the finances of public officials.",
            "title_similarity": "0.64939296",
            "sentiment_compound": 0.5124
        },
        {
            "id": "gynkbpg",
            "score": 1,
            "text": "It would be much easier and hell of a lot more effective to repeal the laws that allow lobbyists to buy off elected officials. Then close the loopholes on taxes.\n\nIts not one party or the other, both sides are very corrupt, if they aren't collecting it themselves then they are funneling it off to someone else in exchange for backdoor deals. Anyone who thinks biden is any less or more corrupt than trump is foolish. both sites are playing in the dirty money pit.",
            "title_similarity": "0.79439163",
            "sentiment_compound": -0.4705
        },
        {
            "id": "gynltrs",
            "score": 1,
            "text": "I think they should all have to wear a sponsor suit, like NASCAR drivers do. Then we would know who is paying them off.",
            "title_similarity": "0.6258298",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gynm112",
            "score": 1,
            "text": "Hate to break it to you but, bribes don’t always show up on a W-2",
            "title_similarity": "0.51774955",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gynnqdb",
            "score": 1,
            "text": "If they're in violation of tax law, wouldn't the IRS going after them be enough?\n\nAs a matter of preference, I believe the better option is to not vote for someone who isn't transparent.",
            "title_similarity": "0.7301198",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gynogzt",
            "score": 1,
            "text": "And get drug tested",
            "title_similarity": "0.29058594",
            "sentiment_compound": 0.0
        },
        {
            "id": "gynq8rt",
            "score": 1,
            "text": "A person's tax returns will not show that they are free of outside influence. A bribe to a politician can be easily disguised as revenue to a business that the politician owns. Unless the company is publicly traded no audit is necessary, the tax return does not require complex financial statements, no income statement, no sales journal, no accounts receivable ledger.",
            "title_similarity": "0.6855167",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gynr6it",
            "score": 1,
            "text": " This is merely wishful thinking. Your argument is incredibly weak and I'd dare say you're merely karma farming. \n\nAdditionally politicians do have to disclose financial information/disclosures that are not released to avoid a conflict of interest once in office. This information is not public. \n\nLastly, once in senators have sixty days (or 30 going from memory) to disclose recent stock buys or sells.",
            "title_similarity": "0.73032665",
            "sentiment_compound": -0.4775
        },
        {
            "id": "gyns4df",
            "score": 1,
            "text": "Doesn't the IRS have a responsibility to make sure people paying their taxes are done so legally/properly?  Do we not trust the IRS to do their jobs?",
            "title_similarity": "0.7512671",
            "sentiment_compound": -0.193
        },
        {
            "id": "gynu71s",
            "score": 1,
            "text": "If you have nothing to hide, then what's the problem",
            "title_similarity": "0.2690739",
            "sentiment_compound": -0.2919
        },
        {
            "id": "gynwzrf",
            "score": 1,
            "text": "Almost all federal government employees, including federal politicians have financial reporting requirements. This covers a lot more than just tax returns. This has been the law for decades",
            "title_similarity": "0.51860905",
            "sentiment_compound": 0.0
        },
        {
            "id": "gynz8m5",
            "score": 1,
            "text": "Since you are speaking about elected officials, I think it should boil down to whether the electorate is interested in it. At the moment, any candidate is free to release their tax returns, and ideally it should give them the advantage over the opponent who concealed their income. But in reality nobody cares. The present day US politics is so polarized, that most voters would be willing to close their eyes to moderate (and sometimes not so moderate) corruption of the candidate from their side.",
            "title_similarity": "0.8132936",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gyo0079",
            "score": 2,
            "text": "I live in finland, and *everyone's* taxes are available to the public. Never heard anyone complain, it just makes life easier for everyone",
            "title_similarity": "0.3912565",
            "sentiment_compound": 0.6007
        },
        {
            "id": "gyo0vbm",
            "score": 1,
            "text": "On paper it sounds like a good idea, based in the premise that anyone running for office should not be a fraudster and should not be excessively indebted to lobbies or other financial powers.\n\nHowever, would it stop someone from just being better at hiding their fraud, and still pass the confirmation?\n\nMoreover, the price of a political campaign (especially in the US, but it's true of other places as well) being what it is, how would you stop a candidate from using various other schemes (PACs, for example) and still be bankrolled by interest groups?\n\nAll of this to say that attempting to control who can run for office is necessary but an extremely complex issue which would require more than just a couple of tax documents going public.\n\nFinally, and that's perhaps the most critical aspect: do people actually care? In France where I live there's a plethora of examples that seem to indicate most voters simply don't give a rat's ass whether their favourite candidate is a criminal or not: we've had mayors reelected many times despite being accused (and sometimes convicted) of tampering with the election, tax fraud, misusing public funds, using political leverage in order to get a friend some government contract or position, etc. Hell, even the far-right figurehead has been accused of siphoning EU money through forged work contracts and she still is a serious contender for the upcoming presidential election. \n\nWhich raises an honest, albeit a little cynical, question: if people don't seem to care about corruption, is having a non-elected body determine who can and can't run based on tax returns or some other document really democratic?",
            "title_similarity": "0.83514357",
            "sentiment_compound": -0.9061
        },
        {
            "id": "gyo2349",
            "score": 1,
            "text": "And should not be allowed to use insider information to trade stock",
            "title_similarity": "0.5248537",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyoe6b2",
            "score": 1,
            "text": "I don't disagree but I also don't think anybody cares. \n\nI honestly wouldn't have given a shit if Biden fucked his taxes vs Donald Trump. And obviously most trumpets don't care Donald Trump fucked his taxes",
            "title_similarity": "0.5585846",
            "sentiment_compound": -0.9704
        },
        {
            "id": "gyoiiff",
            "score": 1,
            "text": "I think that’s a great idea. I’d love to see how some of these 40+ year Congress fucks end up multi-millionaires owning vineyards and shit.",
            "title_similarity": "0.48416138",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gyon6qj",
            "score": 1,
            "text": "Here is Biden’s 2020 tax return. It honesty doesn’t say that much...\n\nhttps://www.whitehouse.gov/wp-content/uploads/2021/05/2021.05.17-POTUS-Redacted-2020-Federal-and-State-Returns.pdf",
            "title_similarity": "0.47016445",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gyoode8",
            "score": 1,
            "text": "I think you overestimate the power of tax returns to protect against corruption. Hillary Clinton and Joe Biden are corrupt as they come and they both released their returns. There are many things that are Uber corrupt that would not show up on a tax return, such as favors for friends and family or “donations” to a “foundation” for a speech at an event, or large purchases of securities right before announcing a new policy. \n\nAdditionally, how far do you want this to go? Do you want the elected zoning board member in a town of 3000 to have to release their tax returns to the world before running for office?\n\nHere’s an example: let’s say I promise to give your company a favorable policy and you sell me a million dollar home for $50k. That would not show up on my tax return because I would not have to report income unless I realized a gain by selling the home for more than $50k. On top of that, gifts are not considered income and would not show up on a tax return.",
            "title_similarity": "0.83429754",
            "sentiment_compound": 0.961
        },
        {
            "id": "gyoolql",
            "score": 1,
            "text": "Who gets to decide what's \"excessively personal\"? Sounds like a good way for people to hide wrongdoing.",
            "title_similarity": "0.57424206",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gyoqbk3",
            "score": 1,
            "text": "Ok sure sounds reasonable, you don't want people that commit fraud and dodge taxes to run for office and hold power.\n\nSo what's are (potential) downsides;\n\n\\- some honest, decent hardworking and competent people may not be comfortable releasing their tax records to the wider public. You might end up with lower quality of public officials as the recruitment pool is smaller, or you might have to pay more to mitigate the ordeal of public scrutiny (Less money for other things, like food for hungry poor children, education)\n\n\\- define higher levels of government, and  think of how corrupt people could circumvent  your definition to still have real power but are not covered by this rule\n\n\\- who is going to look at all these tax records and determine who is fit or unfit for public office? How would you prevent this process being arbitrary or subject to abuse?\n\nThe strength of a democracy does not depend on rules like these. It depends on the civic virtues of it's citizens and leaders (and some other things too) A people without civic virtue that seeks to slavishly follow a corrupt and venal leader will not be swayed by tax returns that show fraud and tax evasion.",
            "title_similarity": "0.8023987",
            "sentiment_compound": -0.2429
        },
        {
            "id": "gyox5yv",
            "score": 1,
            "text": "No need to change.\n\nI would also like to add that they must show competency by passing a test showing they actually know how the government works.",
            "title_similarity": "0.6634396",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gyoybds",
            "score": 1,
            "text": "And a background check, full psychological profile, and disclosure of business/government ties and relationships as well.",
            "title_similarity": "0.57826555",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gyp2hsz",
            "score": 1,
            "text": "I like the concept, especially as it applies to currently serving politicians.  a private businessmans taxes can be pretty convoluted with all the loopholes, but a public servants should be pretty clear.  It should be a rule,   and not an unwritten rule as it currently is.  listening to the left whine for 5 years demanding to see trumps tax records is stupid.  it is not required, there is no law or rule.  going forward it should be for candidates and sitting members.",
            "title_similarity": "0.722285",
            "sentiment_compound": -0.3506
        },
        {
            "id": "gyp9prz",
            "score": 1,
            "text": "We also need to take a look at their portfolios. I wanna know what companies my politicians are invested in.",
            "title_similarity": "0.70911974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gypcyr7",
            "score": 1,
            "text": "And honestly, what stock they own needs to be disclosed to the IRS, & the public honestly, so we may know just what is influencing representatives and policies.\nIf these people are holding office, they should not get to keep such pertinent information private. We need to know who is really running our country and who the paid pawns are. ^*ahem*GOP",
            "title_similarity": "0.8606535",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gypczkz",
            "score": 1,
            "text": "Do you think if they are being paid that they will report that tax money? I think there are hundreds of different ways to launder money that does not include taxable income.",
            "title_similarity": "0.55369914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gypf36z",
            "score": 1,
            "text": "If you think releasing tax returns is going to expose all the nefarious shit elected officials partake in, you’re nuts.  Tax releases are a smoke screen.",
            "title_similarity": "0.7861885",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gypk2io",
            "score": 1,
            "text": "Here is a thought: if you think someone’s character is such that their decisions in public office could be influenced by their private concerns, you should not vote for them regardless of what their private concerns are (and regardless of whether or not they even have any). If you don’t think they’re like that, it doesn’t matter what exactly their private concerns are.",
            "title_similarity": "0.68421423",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gypndk5",
            "score": 1,
            "text": "I heard someone once say the reason politicians like to make a big deal about releasing tax returns is because professional politicians make sure their tax returns will look good when released while any average American who tries to run against them will not have done so. \n\nWhen I do my taxes, I don't worry about how whether how much I donated to charity will look good to others this year and I take what ever tax breaks I'm eligible for. Politicians put on a show when they do their taxes -- donate the right amount to just the right charities, maybe pay more than they really need to, etc...\n\nIn effect, this is just a way for career politicians to try to keep regular people from daring to run against them.",
            "title_similarity": "0.79144275",
            "sentiment_compound": 0.959
        },
        {
            "id": "gyq0n9s",
            "score": 1,
            "text": "1. They would just abuse the redactions, at which point this would be a useless requirement.\n\n2. They could use other people to hide whatever they don't want us to see. A sibling, a personal lawyer,  etc would not be compelled to release their taxes.\n\nI could come up with other points but I guess my main point is that the requirement wouldn't work. There are too many loopholes/workarounds.",
            "title_similarity": "0.73044693",
            "sentiment_compound": -0.6168
        },
        {
            "id": "gyq3wik",
            "score": 1,
            "text": "I don’t give a shit if a politician evades taxes, the government sucks and if someone is smart enough to opt out of funding Middle Eastern forever wars and bank bailouts, good for them. Everyone should evade as much tax as possible.",
            "title_similarity": "0.7954974",
            "sentiment_compound": -0.6249
        }
    ]
}