{
    "CMV: Decorative glitter/sparkles below a certain diameter should be legally defined as a microplastic pollutant and controlled.\n**My view:** \n\nGlitter and sparkles, below a certain diameter, pose enough ecological, ethical, and human health problems to warrant legal control. \n\n**My reasons:** \n\n1. Ecological- Glitter and sparkles are ostensibly no different than [microbead plastics](https://www.fda.gov/cosmetics/cosmetics-laws-regulations/microbead-free-waters-act-faqs) which were banned for ecological concerns. Microbeads were traveling through the water systems and ending up in the guts of fish. Glitter and sparkles, while visually distinct, are used in many of the same aplications. Glitter, along with its many other applications, is used in bath bombs and make-up, both of which end up in the sink.\n\n2. Ethical- Glitter and sparkles do not ask for consent. Everyone knows that glitter and sparkles get everywhere and are almost impossible to fully remove. It's so well known, that [Mark Rober used glitter and sparkles as a non-lethal booby trap](https://www.youtube.com/watch?v=h4T_LlK1VE4) against porch pirates. Glitter can leave whatever surface it is on and attach itself to you. Pick up one piece of glitter paper, or a Christmas ornament you didn't know had glitter on it? Well, now it's on your hands and everything else you touch. Washing your hands vigorously rarely removes all the glitter, and it now is going back to problem 1. You've washed microplastics into the ocean. Cool. If you don't get the glitter off your hands, it can end up in your food, on your phone, in your electronics, in your clothes, and maybe even in your personal projects, paintings, or other work. While glitter *can* be sealed, preventing the non-consensual spread, it rarely is. I have had to throw out entire reams of paper because glitter touched them and now I can't put them through my printer without damaging it. \n\n      Subpoint- imagine it was legal to leave a wet layer of paint on merchandise in the store. The paint MAY be dry, it MAY not be dry. You don't know until you touch it. That sounds insane, right? Well, it's the same thing with glitter. You don't know if it's sealed until you touch it, at which point it's too late. \n\n3. Health- Glitter has been known to be a [health hazard and can be lethal](https://www.womenshealthmag.com/health/a19943746/woman-with-glitter-stuck-in-eye/), or at least dangerous, if not treated quickly. Glitter and sparkles below a certain diameter can end up consumed, adding to [microplastics that are](https://www.theguardian.com/environment/2020/aug/17/microplastic-particles-discovered-in-human-organs#:~:text=People%20are%20also%20known%20to,traces%20of%20plastic%20in%20tissue.) already building up in our systems. It's inarguable that glitter and sparkles, by their very shape and size, are not contributing to this problem. \n\n**What will not change my mind:**\n\n*Whataboutism arguments saying*, \"Well this thing is also a microplastic, should that not be controlled?\" I would simply say, \"yes, it should. \" I believe microplastics and other plastic waste is a danger on all fronts and should have more controls. \n\n*Claims that glitter can be easily cleaned and managed* if you \"just do this...\". No. It really can't. Companies often do not seal their glitter products. If glitter was easy to control and remove, then it wouldn't be used as an annoying trap.\n\n*Victim blaming* statements like, \"just don't buy glitter products\".  Even if you went through life not buying or purposely touching glitter, you would still touch it at some point. It's on art supplies, children's toys, and knickknacks. It's in holiday decorations, soaps, makeup, and cheap T-shirts. If a product on the shelf is within two or three feet of something with glitter on it. It will also be contaminated. \n\n*Sentimental* arguments like \"glitter is pretty\" or \"it's useful for decoration\". I did not say ALL glitter should be a controlled substance, just below a certain diameter. It should not be possible to pick up extremely fine glitter particles (diameter TBD) without also purchasing a sealer or other substance to manage the application and spread of the glitter. It should not be possible to buy fine glitter particles in any basic store like Walmart. It should be an 18+ product purchased at a more specialized store, similar to how flammable substances are handled. If someone wants to decorate with glitter, I would absolutely say that they can, but only with larger particles that are more easily seen and managed. Additionally, companies could still use glitter in products but MUST be required to seal those products with a varnish or glue. \n\n**Things that WILL change my mind:**\n\nEvidence that a law already exists to curtail the current use of glitter and sparkles. \n\nEvidence that glitter and sparkles are *all* biodegradable, and currently do not pose a microplastic threat. (Although this does not address the other two concerns) They must break down in the environment to a sufficient degree that they do not pose a threat. \n\n\nEvidence that legal control of microplastic substances is ineffective and that more harsh measures should be used. We all know that companies will do what they must to make a buck, so it's likely that any law about glitter or sparkles would be circumvented quickly. Evidence that a legal restriction, like the one on microbeads, would be ineffective would help change my view, but it would only make me feel more strongly that glitter and sparkles are dangerous and problematic. \n\nEvidence that glitter and sparkles are used in scientific applications to such a degree that easy access to them is requisite for some very important task. \n\nEvidence that glitter is not a health risk to humans in any way, and that previous examples of glitter damaging humans, or contributing to human microplastic contamination is not happening. \n\nOther logical arguments I haven't thought of. \n\nThank you for reading- Please change my view.\n\n(No TLDR because I don't want to waste time answering questions that have been answered in my post)\n\nEdit: I am seeing many responses that are not taking into account some of the details of my position. I am NOT suggesting the outright ban of glitter in any sense. I am suggesting that it be controlled in some way. HOW it is controlled is up for debate as is whether or not it truly needs to new controlled, but that, admittedly, is a harder view to sway.\n\nEdit2: thank you for you responses and thoughts. It's been a good conversation and I have some new perspectives. I can't respond anymore at this time but I will read the responses later when I can.\n\nEdit 3: I responded to a couple more posts and gave deltas as needed. My view has changed quite a bit. I definitely see the glitter situation as part of a larger issue of plastic waste  this view has been enforced. \n\nI now know a little more about what microplastics are and where they come from. \n\nI see a \"sin tax\" as a better alternative than an EPA-style control. \n\nI now know there is already legislation in California that handles the use of glitter in some fashion. \n\nThank you all! Turning off notifications so my phone stops blowing up.": [
        {
            "id": "gz24prm",
            "score": 1,
            "text": "/u/Luke_Orlando (OP) has awarded 8 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nijxng/deltas_awarded_in_cmv_decorative_glittersparkles/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.52797014",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gz23ez0",
            "score": 3,
            "text": "Man you really hate glitter.",
            "title_similarity": "0.4231371",
            "sentiment_compound": -0.6115
        },
        {
            "id": "gz2qnwm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.24097861"
        },
        {
            "id": "gz25dgg",
            "score": 5,
            "text": "Dude I 100% agree, as a Park Ranger we had some smart family do some bullshit glitter art on rocks on top of a picnic table, then left the rocks. So no I have 4 large stones with glitter glued to them, and a picnic table that I had to vacuum to clean, and still couldn't get everything. It's like they just never once thought about the fact that there will be another family to use this space after they leave. The art didn't even look good, just straight up pink rocks. Wtf",
            "title_similarity": "0.543237",
            "sentiment_compound": -0.2435
        },
        {
            "id": "gz29hmf",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.24097861"
        },
        {
            "id": "gz22f78",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.24097861"
        },
        {
            "id": "gz2g55e",
            "score": 5,
            "text": "Glitter isn’t a particularly big contributor to micro plastic issues. Banning glitter risks people inflating how bad it is. This may seem like it’s a good thing, but it can end up causing people to ignore bigger contributors as they demonise glitter. \n\nFor example, plastic straws have been under a lot of fire lately because of plastic waste ending up in the ocean. People see them as a major problem and danger (even going to far as to shame people who need to use them) when in reality they only make up about 1% of the plastic in the ocean. This focus has meant that there isn’t as much awareness about sources which are a much bigger problem, such as fishing gear (which is about 80% of the waste). \n\nIf we ban small glitters we run the risk of people ignoring other - larger - sources such as textiles and car tyres.\nInstead, it would be a better idea to implement a financial incentive for companies to produce (or people to buy) environmentally friendly alternatives.",
            "title_similarity": "0.69235396",
            "sentiment_compound": -0.9852
        },
        {
            "id": "gz243wg",
            "score": 195,
            "text": "Banning things that people want tends not to work (think alchool or the war on drugs).\n\nLike most enviromental concerns it's better to tax (thus building into the price the externalities) then to ban/restrict.",
            "title_similarity": "0.71396434",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gz2054i",
            "score": 566,
            "text": "The time and effort involved to legislate glitter would be a waste because it’s not a substantial enough problem. Most of the micro plastic comes from plastic refuse breaking down in the environment. Banning glitter would not help our micro plastic problem in a substantial way, would waste energy and resources, and would give people a false sense of having made progress, which will impede real progress.",
            "title_similarity": "0.7074786",
            "sentiment_compound": -0.7615
        },
        {
            "id": "gz24742",
            "score": 174,
            "text": "[deleted]",
            "title_similarity": "0.25070822"
        },
        {
            "id": "gz34p4r",
            "score": 3,
            "text": "If you want to get super technical, then absolutely EVERYTHING can be considered dangerous to someone.   \n\nBut just because a few people have a hard time with a product doesn’t mean we need a law around it. If from what I’ve heard is true in Canada, forks are illegal. And iced coffee. Correct me if I’m wrong.",
            "title_similarity": "0.66259015",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gz2h8hm",
            "score": 24,
            "text": "Have you considered that it might be better to win hearts and minds in the crusade against glitter as an alternative to, or at least prerequisite to, legislation? If you don't have popular opinion firmly on your side then it becomes a liability to any politician who might support it. But if people start to universally hate glitter then legislation becomes unnecessary; consumers will simply boycott companies that use glitter.",
            "title_similarity": "0.68726754",
            "sentiment_compound": -0.4966
        },
        {
            "id": "gz2f5qk",
            "score": 3,
            "text": "Glitter shouldn’t be made- not because of environmental reasons, but because it’s a shitty fucking decoration. \n\nIt would take quite a bit to target it specifically, so I’d rather see efforts put forward in arenas that matter more, and that we would see glitter disappear as a side affect of other problem products being targeted by legislation",
            "title_similarity": "0.72736335",
            "sentiment_compound": -0.8922
        },
        {
            "id": "gz23stf",
            "score": 6,
            "text": "I know festival folks that have stopped the glitter thing.",
            "title_similarity": "0.4480235",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gz2i9cm",
            "score": 9,
            "text": "Point 1 - I agree with you that glitter used in makeup and bath bombs would indeed seem to pose the exact same ecological risk as microbeads plastics designed for exfoliation. It is interesting that the current law does not outlaw them. Do you have any insight into why these were left out?\n\nPoint 3 - you need better supporting evidence that glitter poses a serious health hazard above and beyond wood mulch which is cited in your linked article as posing the same or worse health hazard. Further the FDA link for the existing law specifically says they don’t have any evidence human health is an issue. \n\n“The new law does not address consumer safety, and we do not have evidence suggesting that plastic microbeads, as used in cosmetics, pose a human health concern.”\n\nI think the biggest difference I see between the current law against microbead plastics and general purpose glitter is that the microbead plastics meant for exfoliation are designed for the purpose of being washed down the sink and into our water supply so it’s a pretty direct route from them to fish and shellfish. General purpose glitter is not designed for that purpose and according to your own experience ends up overwhelmingly in the trash to go to our solid waste landfill system. \n\nSo as I see it you have sort of two separate things. You’ve got the glitter in bath bombs that would seem to have a very clear and direct ecological impact as far as I know. And you’ve got general purpose (art) glitter that ends up in the solid waste system for the most part. The first one seems like a slam dunk but in both cases I think to get broad acceptance we need an acceptable replacement. Additionally I think the second one (art glitter) would best be handled not by an outright ban or law controlling their use but by waging a public campaign about how bad it is and to get people to switch to an alternative (similar to “please use reusable bags instead of the brown plastic bags because it’s better for the environment” or “smoking is bad for you and causes cancer, etc”). I credit the huge drop in smoking rates to broad PR campaigns and a changing public opinion that adopted the view that smoking is bad. I think the best way to get rid of art glitter is similar. Look at how many weddings don’t throw rice anymore because of the broadly accepted myth that it would kill birds.\n\n(Edited to replace “ban” with “ban or law controlling use”)",
            "title_similarity": "0.895375",
            "sentiment_compound": -0.5086
        },
        {
            "id": "gz386z6",
            "score": 9,
            "text": "First let's define some chemistry.\n\nIn cosmetics there are two types of glitter.  \"Pearl\" and plastic glitter.\n\nPearl is a mineral product and has been shown to be RAS, AKA reasonably assumed safe. It's primarily threw minerals, iron oxide, titanium dioxide and mica. In the biz it's called titanated mica.\n\nThe FDA has already limited it's use for anything above 100 microns around the eye. Also few plastic glitters are allowed for use around the eye because of the health Hazzard.\n\nReasonably this kind of glitter is ecologically the same as dirt. No harm, no foul. It easily breaks down and is harmless in the environment.\n\nThe other kind of glitter? If it's used in personal care products it's often used outside the scope of the law aka illegally.\n\nMost your problem would be solved with better enforcement and moving to titanated mica solely.",
            "title_similarity": "0.78867245",
            "sentiment_compound": 0.8992
        },
        {
            "id": "gz25zkw",
            "score": 16,
            "text": "How would you feel about making companies use biodegradable glitter instead? It may still stick to everything but helps the envoirmental factor.",
            "title_similarity": "0.727709",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gz26nu9",
            "score": 80,
            "text": "In general, I'm a little hesitant to outright ban things that are harmful for a particular use, simply because there might be other, perfectly legitimate uses for the same thing. For example, this is a perfectly valid use of glitter: \n\nhttps://en.m.wikipedia.org/wiki/Optically_variable_ink\n\nIn this particular application, plastics are necessary to make sure that the optocal properties of the ink do not degrade over time. Glitter might also be useful in signage, to make certain objects more optically visible. There are probably other scientific or industrial uses of glitter that I haven't thought of, and to ban glitter outright seems a little hasty.\n\nThat being said, microbeads are banned for use particularly in soaps and shampoos (the beads in ball-point pens are still perfectly legal, on the other hand). In the same way, we could ban plastic glitter just for recreational purposes.\n\nAs it turns out, biodegradable glitter exists. A law could be passed requiring all recreational uses of glitter to be biodegradable. Other applications, such as when someone wants to change the optical characteristics of something, would still have unfettered access to plastic glitter.",
            "title_similarity": "0.7740381",
            "sentiment_compound": 0.8885
        },
        {
            "id": "gz24dyr",
            "score": 2,
            "text": "Anyone hosting an event knows that glitter/sparkles is a no no. You'll be finding them fuckers years after.",
            "title_similarity": "0.4583219",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gz2c1xg",
            "score": 6,
            "text": "I love glitter and I hate glitter. I love the look and applications of it, but hate the unconsented glitter and the microplastics aspect. Does it stop me from using it, no. But I definitely wouldn't buy a glittery/shimmery bath bomb, and just wash it down the drain.",
            "title_similarity": "0.7060733",
            "sentiment_compound": -0.775
        },
        {
            "id": "gz2dlzz",
            "score": 2,
            "text": "Agreed.",
            "title_similarity": "0.06879862",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gz2e41s",
            "score": 2,
            "text": "Ban from all greeting/holiday cards.",
            "title_similarity": "0.414042",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gz2m815",
            "score": 2,
            "text": "Wouldnt it be better to just legislate out plastics for certain purposes? For example, plastic for glitter isnt needed. There are biodegradable alternatives that work perfectly fine for the vast majority of applications, they are just a little more expensive.",
            "title_similarity": "0.6895906",
            "sentiment_compound": 0.6902
        },
        {
            "id": "gz2mewg",
            "score": 2,
            "text": "Ban polyethylene and polypropylene version and mandate a biodegradeable one like poly-lactic acid be used instead. First gotta kick out the members of congress and the EPA with donkey brains. Hint, they're Republicans.",
            "title_similarity": "0.6015855",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gz2nlvw",
            "score": 3,
            "text": "How about enforcing that, as with the exfoliant additives in products in the UK (no microbeads but some alternative like ground oats or coffee), that all glitter has to be made our of a biodegradable, plastic free alternative?\n\nI've started to see the rise in biodegradable glitter and it may be a good compromise. Kids can still use it in school, it can still be used in make up, etc. Just rules around how it's made and what from.",
            "title_similarity": "0.7900872",
            "sentiment_compound": 0.9109
        },
        {
            "id": "gz2poep",
            "score": 2,
            "text": "I am so with you, my wife and family teases me for my disdain for glitter, it gets everywhere, when that stuff is on wrapping paper I find glitter in the house for months afterwards",
            "title_similarity": "0.41678604",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gz2pqyw",
            "score": 3,
            "text": "I hate glitter as much as you, but I don't really think what you're suggesting is the way to go about it.\n\nA better way would be to force manufacturing companies to use biodegradabable materials. The consumer doesn't notice any change, stores don't notice any change, but the environment certainly does. \n\nWe could also force the manufacturers to seal glitter before shipping it to the stores. Another thing we could do is to force manufacturers of soap and other products to add a label to their products when they use glitter.\n\nAs for glitter getting everywhere, yeah glitter is a very shitty decoration, but there's not much we can do about it. All we can do is manage it so the environment doesn't suffer more than it already is. Adding it as a controlled material is something that would probably never happen, but controlling the way it is made sounds much more feasible and IIRC it has already been done with other materials.",
            "title_similarity": "0.7636821",
            "sentiment_compound": 0.7037
        },
        {
            "id": "gz2s5p3",
            "score": 3,
            "text": "Glitter is less than .0001% of 1% of plastic products.  The big problem with microplastics are from the decay of larger plastic products.  Glitter that does make it into the environment is usually in a matrix with some form of adhesive, thereby encasing the glitter.",
            "title_similarity": "0.644942",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gz2twei",
            "score": 2,
            "text": "All glitter should be considered this.",
            "title_similarity": "0.36462328",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2vhgk",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.24097861"
        },
        {
            "id": "gz2wci3",
            "score": 2,
            "text": "I disagree 100%.\n\nAll glitter should be banned.",
            "title_similarity": "0.5204648",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gz30j42",
            "score": 2,
            "text": "The number one cause of micro plastics near waterways is from car tyres. This is the major problem.",
            "title_similarity": "0.50011146",
            "sentiment_compound": -0.4005
        },
        {
            "id": "gz31o30",
            "score": 2,
            "text": "Glitter / sparkles of every diameter should be defined as pollutant. End of story",
            "title_similarity": "0.59508514",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gz339r5",
            "score": 2,
            "text": "I hate glitter\n\nIt should be banned",
            "title_similarity": "0.56138784",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gz35lbo",
            "score": 3,
            "text": "As someone who has worked in the makeup industry, I HATE glitter. There have been several instances where cheap products have gotten into people’s eyes and scratched their corneas. Or after doing a look with it, you can never fully remove it. It’s the herpes of the makeup world because once it’s there, it’s there",
            "title_similarity": "0.6154917",
            "sentiment_compound": -0.6633
        },
        {
            "id": "gz36xpm",
            "score": 2,
            "text": "I don’t really like glitter",
            "title_similarity": "0.40540475",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gz3brcz",
            "score": 1,
            "text": "The Humanity! What will the strippers wear now???😂😂😂",
            "title_similarity": "0.32661635",
            "sentiment_compound": 0.8602
        },
        {
            "id": "gz3hghj",
            "score": 1,
            "text": "*strippers everywhere crying*",
            "title_similarity": "0.25310475",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gz3idaw",
            "score": 1,
            "text": "I think glitter is annoying as hell and I hate it in general, so I couldn't care less if glitter was banished from existence.",
            "title_similarity": "0.5785385",
            "sentiment_compound": -0.9312
        },
        {
            "id": "gz3j1x4",
            "score": 1,
            "text": "*angry strippers have entered the chat*",
            "title_similarity": "0.30737513",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gz3j517",
            "score": 1,
            "text": "Glitter is the worst of our humanity. Not talked about as often as it should. The devil shits glitter.",
            "title_similarity": "0.56193787",
            "sentiment_compound": -0.9118
        },
        {
            "id": "gz3jv7f",
            "score": 1,
            "text": "I’m not sure how effective a ban on smaller plastics would be, since larger plastics become smaller plastics over time.",
            "title_similarity": "0.46748352",
            "sentiment_compound": -0.7973
        },
        {
            "id": "gz3un8u",
            "score": 1,
            "text": "This is why glitter-manufacturer Glitterex refuses to disclose their biggest buyer. Seems to be involved in boat paint.",
            "title_similarity": "0.5985086",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3vnps",
            "score": 1,
            "text": "All glitter should be banned because glitter is one of the worst things ever made, especially when used appropriately.",
            "title_similarity": "0.57224166",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gz45uil",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.24097861"
        },
        {
            "id": "gz4bkju",
            "score": 1,
            "text": "Size shouldn't matter. It should all be biodegradable/digestible.",
            "title_similarity": "0.62682426",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gz4cb6b",
            "score": 1,
            "text": "I would just point out that Gary Glitter was already put in prison for some kind of serious crime, and I don't mean his music.",
            "title_similarity": "0.5046836",
            "sentiment_compound": -0.8122
        },
        {
            "id": "gz4gok4",
            "score": 1,
            "text": "Never thought about the ethical implication of glitter before but I must say I agree with op on the non consensual bit",
            "title_similarity": "0.59804934",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gz4h6n8",
            "score": 1,
            "text": "Personally I think just banning glitter below a certain  diameter is incredibly arbitrary and will fail due to it's arbitrary nature. Lobbiests will say \"all plastic becomes micro plastics so are we going to ban all plastics?\" It's important to note that all plastics actually become micro plastics relatively quickly so their argument isn't coming from nowhere. \n\nAs a marine biologist and environmentalist, I would love to say \"yes, ban all plastics\". Alas it's such a stupidly useful material, I doubt it will happen in my lifetime.the biggest thing I can see happening is regulations controlling plastic packaging and actual incentives for using environmentally friendly options.\n\nMy ideal world? Anything that is made to be disposable cannot have any plastics in it. Full stop. Of course we will see plastic companies argue about what is and isn't disposable so stipulations such as \"if you add plastic to your product in any form, you have to provide a way to properly recycle it\".\n\nIn conclusion banning glitter below a certain size is a bit of a drop of water in the big plastic ocean. It's an arbitrary and fairly useless ban all together, especially since all plastics degrade to be micro plastics. My biggest fear with your suggestion would be that companies would use their use of fully biodegradable glitter as a front to be like \"hey look at how environmentally friendly we are!!\". Sort of like how something like a coffee chain will remove plastic straws while still selling 101 other plastic filled and packaged items. I'd rather spend the time and effort on bigger changes that can make a far larger difference rather than give the plastic companies fuel to say the bans are trivial or frivolous.",
            "title_similarity": "0.7722596",
            "sentiment_compound": -0.8028
        },
        {
            "id": "gz4lsta",
            "score": 1,
            "text": "Is most glitter plastic now? The other day someone told me that a lot of glitter is made of mica. Maybe this is mostly the older varieties of it, or the biodegradable version?",
            "title_similarity": "0.62750876",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4om6y",
            "score": 1,
            "text": "I would add that glitter and confetti made of plastic shouldn't be allowed at all. Pointless trash",
            "title_similarity": "0.6239202",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4ynsz",
            "score": 1,
            "text": "I have a sneaking suspicion that my ex was responsible for throwing glitter all down the path and all over trees/stumps to Bagby hot springs . Regardless of that, yes, these should be controlled. No good for the environment.",
            "title_similarity": "0.6404459",
            "sentiment_compound": -0.0015
        },
        {
            "id": "gz51arm",
            "score": 1,
            "text": "How does this cross your mind?",
            "title_similarity": "0.13496657",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz5r9ac",
            "score": 1,
            "text": "1. Agree, plastic is killing us all. \n2. Glitter is the herpes of the craft world. \n3. As an early childhood educator and trainer, I never allow glitter of any kind with children under the age of three (and STRONGLY discourage its use for children older). Children put their hands on ANYTHING and then indiscriminately touch EVERY PART of their body with those same hands. You can very easily scratch (and lose in at least one case I saw) your eye/retina unknowingly with one small piece of glitter simply by rubbing your eye with the glitter on your hand.",
            "title_similarity": "0.5864694",
            "sentiment_compound": 0.4696
        },
        {
            "id": "gz5ve7r",
            "score": 1,
            "text": "Irrelevant view.\n\nAll plastics break down in landfills and are carried via Water Tables to the larger rivers and thus the Oceans, hence the 'Plastic' Pacific Gyre.",
            "title_similarity": "0.4860226",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz9ydx8",
            "score": 1,
            "text": "The control of glitter is not a very big problem. Over 46% of plastic in the ocean is fishing nets, so I feel like the government should focus on that first. While I do agree, microplastics are dangerous to the environment, they are not a very large part of the total plastic in the ocean. It's kind of like plastic straws. A lot of people say that they are very dangerous to the environment, but in fact, they make up about 0.1% of the total plastic floating around in the ocean.",
            "title_similarity": "0.66178536",
            "sentiment_compound": -0.2501
        }
    ]
}