{
    "CMV: We should be able to block subreddits just like we can block other users, or subs can block us.\nLet’s face it, the word civil on reddit can probably only be used to describe 5% or less of the posts on this site. With that in mind, straying outside of communities you’ve signed up for is already a bit risky. You never know when something you say could lead to you being harassed, and even having some comment made genuinely in the wrong sub leading to bunch of downvotes that only lead you to delete your post to avoid the stress of arguing with anonymous people on the internet. No one likes sticking around for a fight, and trying to make a genuine point can sometimes be a demoralizing and unnecessary outcome of saying what you think. That being said, some subs just pop up. \n\nDo you like following politics? Well on the news section of reddit, you will be forward posts from r/politics, which has one opinion that you can either agree with or be shunned. Don’t like what’s being posted on r/conservative? Too bad. They’re gonna come up whether you like them or not. I think telling reddit what we’d like to see also should come with the customizability to tell them what we don’t want to see. \n\nSometimes the news feeds of certain subs are littered with links to sites that have paywalls, and if I’m always being recommended posts from these subs, it can be irritating. \n\nWe talk about the dangers of eco chambers, but Reddit’s downvote system only serves to punish descent, so its not as though reddit isn’t a cluster of echo chambers. There is just the illusion that we deserve our fate for saying unpopular things. But what about the mental health of those involved? \n\nIronically, CMV is one of the only subs I see where people welcome each other to be challenging of each other’s views, and welcomes civil debate. There are others, but I feel like it’d be rather controversial to name names. \n \nReddit gives all these tools to allow subs to keep out unwanted guests, and I think that’s great. Its fine to say that’s if you are in a sub that is a support group for something, you would want to keep certain people, who are sure to exacerbate things, from posting there. So why not afford people, who are trying to keep their feed free of the negativity and vitriol of our current environment from that, for the purposes of their mental health? \n\nI understand that we should allow ourselves to be exposed to ideas with which we disagree, and that it is healthy to be open to different points of view, but if you can’t challenge your ideas by engaging in debate, you’re just going to get entrenched. We need the ability to talk things out rather than just be talked at, but since we’re not going to magically make everyone on reddit civil, maybe we can just have the ability to turn off certain subs, and better control our own experience.\n\n[edit] Thanks for the comments! I have to stress though that this wasn’t “how to” request. I think this should be an official Reddit feature. I think Reddit should allow it on principle. If you have any reason that Reddit should not allow this, please let me know...\n\n[edit 2] Wow... I just woke up and this exploded so... I’m gonna work my way through everyone’s comments! Please bear with me!": [
        {
            "id": "gze0z9z",
            "score": 1,
            "text": "/u/7in7turtles (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nkpt99/deltas_awarded_in_cmv_we_should_be_able_to_block/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5184938",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gz5l068",
            "score": -2,
            "text": "*clears throat* Fuck r/PoliticalHumor",
            "title_similarity": "0.4027567",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gz4ywdx",
            "score": 351,
            "text": "But... you can. The Apollo app for instance lets you do exactly this with a filter option.",
            "title_similarity": "0.16815741",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz5uc3x",
            "score": 0,
            "text": "I guess I don't fully understand. Is it considered difficult just to see posts from certain subs? Isn't it pretty easy to just scroll past anything without engaging?",
            "title_similarity": "0.61448693",
            "sentiment_compound": -0.7802
        },
        {
            "id": "gz4z0b9",
            "score": 1,
            "text": "Why not name names?  I want to know which other subs encourage civil debate.",
            "title_similarity": "0.55992514",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gz5iufo",
            "score": 44,
            "text": "What do you mean? Just browse /r/frontpage, it only shows you posts from subreddits that you subscribed.",
            "title_similarity": "0.4919961",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz5olq0",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz6yzvn",
            "score": 0,
            "text": "What a bold stance, OP",
            "title_similarity": "0.015050633",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gz7hif5",
            "score": 0,
            "text": "How the fuck did this get so many votes?",
            "title_similarity": "0.32494938",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gz5z2ja",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5zoex",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz65h13",
            "score": -1,
            "text": "You talk about not getting involved in a fight and ignoring people. If you get down voted or whatever all you have to do is delete the comment if you're worried about precious karma. Also, you can mute reply notifications. That way you can leave your comment up  and not worry about what people say.",
            "title_similarity": "0.7677578",
            "sentiment_compound": -0.1516
        },
        {
            "id": "gz6kk13",
            "score": -1,
            "text": "Waiting for the day they add that feature. R/atheism and r/conservative never have to be in my feed ever again.",
            "title_similarity": "0.44570193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz8hn5i",
            "score": -1,
            "text": "Sorry, u/7in7turtles – your submission has been removed for breaking Rule B: \n\n> You must personally hold the view and **demonstrate that you are open to it changing**. A post cannot be on behalf of others, playing devil's advocate, as any entity other than yourself, or 'soapboxing'. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_b).\n\nIf you would like to appeal, [**you must first read the list of soapboxing indicators and common mistakes in appeal**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_indicators_of_rule_b_violations), review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%20B%20Appeal%207in7turtles&message=7in7turtles%20would%20like%20to%20appeal%20the%20removal%20of%20\\[his/her%20post\\]\\(https://old.reddit.com/r/changemyview/comments/nj21xr/-/\\)%20because\\.\\.\\.) within one week of this notice being posted. \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
            "title_similarity": "0.7217859",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gz5pjqd",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5ppeo",
            "score": 2,
            "text": "How much I wish I could block 2 x chromosomes.\n\nI primarily browse reddit on mobile so that's important.",
            "title_similarity": "0.56051445",
            "sentiment_compound": 0.2212
        },
        {
            "id": "gz5jz75",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.2570324"
        },
        {
            "id": "gz5m0u9",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5rqbn",
            "score": 23,
            "text": "I never go on r/all for a reason. I just stay on what I've subbed to; that's it.",
            "title_similarity": "0.27635524",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz5qhiv",
            "score": 187,
            "text": "I'll provide a genuine counterpoint, since I don't see any others as of the time of posting: feeds from non-subscribed subreddits, however unintentionally and however small, provide some relief from the social media extremism that can result from *social media* *political bubbles*, and listening only to those we agree with and identify with.\n\nFor the sake of avoiding controversy, let's say my country has two major competing ideologies: Purple-ism and Violet-ism.  I identify a bit more as Violet than Purple, so I pop onto Reddit and start signing up for subreddits: r/Violet, r/AMoreVioletWorld, maybe r/PurplesCantMeme for jokes, et cetera.  Why not?  The area I live in is fairly mixed, and it feels good to spend time with people who agree with me where I don't have to justify everything I say for once.\n\nHere's the problem: the people in those subreddits don't actually feel like a community.  They seem to have much more radical views than I do; every time I express sympathy to Purple people (I live around them and know they're human, after all), I get called 'Purple adjacent' or a 'purple sympathizer,' or even get accused of being a Purple supporter just trolling their subs.  I admire these people and want them to admire me, so I emphasize what I agree with them, and begin to suppress my nuance and my empathy for people outside the group.  \n\nThis is how radicalization happens.\n\nIt's more of a problem on social media, because even though bubbles can and do happen, on extremes, outside of social media (from like-minded people choosing to only live around each other or only associate with each other), algorithms and features like belief-specific subreddits and the policing of those subreddits by ideology serve to actually *cultivate* extremism deliberately, rather than having it happen by accident.  If you're not extreme in whatever you believe, expect your subs to tell you that you're Redditing wrong, and perhaps even ban you for bringing nuance and doubt into their spaces.  There's a church for everything here, from political ideologies to how you season your steak, and they're *all* ultra-orthodox.\n\nI'm not arguing that Reddit occasionally letting you see a post from a different subreddit is a deliberate attempt to counter extremism or remind you that the other 'side' is still human - it's a profit mechanism, something to ensure there's always something fresh to look at and you never stop visiting, clicking and creating revenue.  But I would argue that it's one of very few social media features that leads *away* from radicalization rather than headlong into it, and that's a good thing.",
            "title_similarity": "0.6997574",
            "sentiment_compound": 0.8461
        },
        {
            "id": "gz5eomu",
            "score": 248,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5xhkg",
            "score": 20,
            "text": "I have 0 extensions installed and I have this feature, literally just go to /r/all and it's directly below the user name / control panel:\n\nhttps://i.imgur.com/JGg8xcI.png\n\nMy list is much bigger, and I never see these subs' posts when browsing /r/all. Am I going crazy? Nobody in the comments is talking about this, everyone's recommending to install other apps. It's literally a default feature of reddit as far as I know.",
            "title_similarity": "0.6739929",
            "sentiment_compound": -0.34
        },
        {
            "id": "gz5gt9w",
            "score": 28,
            "text": "I use the filter function on 'Reddit Enhancement Suite' for Google Chrome. It's amazing. You can browse r/all and when you hover over a subreddit you can click the filter button and you'll never have to look at dumb ass subreddits ever again. I blocked soooo much already, mostly politics.",
            "title_similarity": "0.58714855",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gz4yvl8",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5lcte",
            "score": 36,
            "text": "I use redditisfun exclusively and I've never had an issue blocking subreddits. It's really nice blocking out the weird and the stupid.",
            "title_similarity": "0.4279366",
            "sentiment_compound": -0.7569
        },
        {
            "id": "gz5q0g1",
            "score": 2,
            "text": "Block all crypto and invest subs pls",
            "title_similarity": "0.48697764",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gz5qrps",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5r77q",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5s5j2",
            "score": 1,
            "text": "You can filter subreddits from /r/all in the old design.",
            "title_similarity": "0.39971143",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz5t0ip",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5wc5h",
            "score": 2,
            "text": "I agree. Sometime I get gore videos creeping up in my popular tabs, is content from trashy or idiotsincars, noahgettheboat that I really would be better off without.",
            "title_similarity": "0.6968088",
            "sentiment_compound": 0.8158
        },
        {
            "id": "gz5xgal",
            "score": 3,
            "text": "You already can choose what subs you see by un/subscribing. If a post on some sub you're subscribed to leads to another sub that you don't like, well it's up to you to click the link. Or not. You are fully in control of seeing that content. This is all via the official desktop and mobile sites, no unofficial hacks needed.\n\nOn the other hand, it's *not* your choice whether or not a user replies to your posts/comments or directly sends you a message, so a block feature is appropriate.\n\nIMO it's a very marginal improvement over the status quo, and adding features has a cost both to implement it and to maintain it when doing other changes to the code.",
            "title_similarity": "0.58883274",
            "sentiment_compound": -0.2771
        },
        {
            "id": "gz5xx2h",
            "score": 1,
            "text": "Well, it should be a feature, but tbh it doesn't bother me, my brain just filters that stuff and I don't pay attention or energy to fighting someone, I just ignore them",
            "title_similarity": "0.4884228",
            "sentiment_compound": -0.0777
        },
        {
            "id": "gz5ydgk",
            "score": 1,
            "text": "I think you're looking for custom multireddits. They're still implemented, but only accessible on oldreddit. It's an official reddit feature, you can create a multi that's a feed of any combinations of subreddits, like the news feed is. It should definitely be updated for ease of access, but it technically does exist and it's not third-party.",
            "title_similarity": "0.59569585",
            "sentiment_compound": 0.9136
        },
        {
            "id": "gz5z67z",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.20727223"
        },
        {
            "id": "gz5zeea",
            "score": 1,
            "text": "“Displaying content from /r/all, except the following subreddits:\nadd“\n\nNot sure if that is what you are looking for?",
            "title_similarity": "0.50656605",
            "sentiment_compound": -0.2411
        },
        {
            "id": "gz6000r",
            "score": 1,
            "text": "Yeah you can just stop using the actual Reddit app and use one that's not trash. Sync ftw",
            "title_similarity": "0.5800108",
            "sentiment_compound": -0.357
        },
        {
            "id": "gz612io",
            "score": 3,
            "text": "I found the way to filter communities from /all but it was a little out of the way.\n\nFirst, visit r/all on old.reddit.com.  https://old.reddit.com/r/all/\r  \nNext, type in the name of the community you don’t want to see in the **filter subreddit box** (on the right) then click the + symbol.",
            "title_similarity": "0.717659",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gz61tig",
            "score": 2,
            "text": "I get your point, but I disagree. You’re not going to be able to change everyone and vice versa. Yes, when you get downvoted it sucks, but first... look at your opinion or whatever it is you said. Do you still stand by what you said? Then who cares, and if you do... why? If you don’t stand by it anymore, then what a great opportunity to grow even in a small way. The ads are annoying, but truly it’s whatever to me. I think ad space will just increase throughout our lives. Also, honestly if you’re someone who is depressed or just an angry person or even overly sensitive (not saying you are)... you gotta address that and realize that there are nerds who are gonna try to take you down and if you cant handle that stick to chill subs. I have stopped downvoting unless it’s false information, otherwise you’re feeding the trolls. Many people fish for downvotes, just don’t interact with them. And if you do, its pretty easy to assess whether they are there for a conversation or not after one reply. \n\nIn terms of seeing post you just don’t want to see, other than just scrolling past, there isn’t much of a work around. But my point to that is there is SOOOOO MANNNYYYYY SUBREDDITS. Maybe you only have a few on your list that you’re subbed to? But I have subbed to quite a few over my time on reddit and so sometimes I get recs for subreddits I had no idea about. It’s awesome. But also not awesome. I can’t tell you how many times they keep trying to get me into r/vegancirclejerk...no thanks. But lately, after scrolling past many times, I don’t see it. Also I saw you mention the search feature and that you use it, idk why or for what because that is the worst part of reddit in my opinion. Use a separate search engine and type reddit after, its more accurate depending what you’re looking for.  At the end of the day, its a huge social media platform still, just thrives on niche communities. Because of all this, I don’t really see a benefit in blocking all nonsense. Fix the problem not the symptoms of it.",
            "title_similarity": "0.650489",
            "sentiment_compound": 0.8819
        },
        {
            "id": "gz62odm",
            "score": 1,
            "text": "I mean in a way, I think you are, but I also think that’s totally fine! People harp on echo-chambers way way too much.\n\nLet’s say you’re a strong vegan. Who am I to say you shouldn’t surround yourself with vegan media??? So what if your stance gets stronger!\n\nAt the end of the day, I agree with you people should be able to freely restrict the content we see, especially when there are so many ways content is restricted from users without us having a choice",
            "title_similarity": "0.67366236",
            "sentiment_compound": 0.9172
        },
        {
            "id": "gz632k7",
            "score": 2,
            "text": "Unsubscribe from /r/politics, /r/news, /r/popular , /r/all, and /r/trending. These seem to be the ones that are causing you grief. Then browse using old.reddit.com. I never get the problems you describe in your post.",
            "title_similarity": "0.7298882",
            "sentiment_compound": -0.2363
        },
        {
            "id": "gz636jy",
            "score": 2,
            "text": "Why is it nowadays that people cant handle a viewpoint different than their own? If you create yourself an echo chamber, how can you grow as a person?",
            "title_similarity": "0.51999086",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gz65xiv",
            "score": 2,
            "text": "This.  In particular, quit \"recommending\" subs to me that I've already been permanently banned from with no explanation.",
            "title_similarity": "0.5161487",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gz6av5b",
            "score": 1,
            "text": "Do people not know about RES?",
            "title_similarity": "0.3802668",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz6b8p3",
            "score": 2,
            "text": "4th paragraph down - descent should be dissent.\n\nSorry. I know I'm annoying.",
            "title_similarity": "0.57589006",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gz6e3jp",
            "score": 1,
            "text": "That will result in an informational bubble that already exists today but not perfect and this will result in idiocracy because peoples' nature is non-stop conflicting with everything and everyone",
            "title_similarity": "0.6596725",
            "sentiment_compound": -0.8199
        },
        {
            "id": "gz6e93k",
            "score": 4,
            "text": ">We talk about the dangers of eco chambers\n\nby blocking content at a high level you are creating an echo chamber where dissent has no voice.",
            "title_similarity": "0.7150003",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gz6eenq",
            "score": 1,
            "text": "This is the biggest mobile user problem I've ever seen.",
            "title_similarity": "0.34636652",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gz6g26n",
            "score": 1,
            "text": "I don't know what Genshin Impact is, nor a dozen other subs that get recommended to me every day. I'm not into your game, please let me filter that out, thanks!",
            "title_similarity": "0.52069056",
            "sentiment_compound": 0.7424
        },
        {
            "id": "gz6ie87",
            "score": 1,
            "text": "Am I the only one who only see's the subs I subscribed to?",
            "title_similarity": "0.33032474",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz6jptf",
            "score": 1,
            "text": "Reddit does allow this in principle through it's API, try any unofficial reddit app as they all have this feature (Infinity, Apollo, Boost etc). Expecting a company to tailor their app to the needs of their users mental health is an unrealistic view, they literally benefit from keeping you engaged in dopamine loops which is the opposite of beneficial to your health as it builds an unhealthy addiction.\n\nYour main pont is that reddit would benefit from making their app more user friendly. Reddit serves it's shareholders and companies that buy adspace on it first and foremost, they are reddits customers. Reddit's users and their information are the product not the consumer in reddit's view.\n\n\nReddit benefits from not being user friendly, and keeping you engaged emotionally (Snapchat, Facebook, Instagram, Twitter, Tumblr, are all not customizable or user friendly in the slightest.) This is the same model that reddit is, to take advantage of it's users for the benefit of companies that buy what is effectively adspace and their users data.\n\n\nUsers mental health has never been social media apps intention, it's what social media apps are there to exploit. So why not use 3rd party apps (Boost, Apollo, Infinity etc.) which are open source and more cusomizable in every way and habe the users interest in mind instead of expecting the reddit app to be something it has not been or will ever be.",
            "title_similarity": "0.6984571",
            "sentiment_compound": 0.9836
        },
        {
            "id": "gz6jr0w",
            "score": 1,
            "text": "Just press \"Home\" instead of \"All\"?\n\nLike you have a reddit account. This is already possible to subscribe only to the subs you want.",
            "title_similarity": "0.5307481",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gz6kf4p",
            "score": 1,
            "text": "Joined CMV becase of Op's post.",
            "title_similarity": "0.20295337",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz6kkf8",
            "score": 1,
            "text": "I block them frequently",
            "title_similarity": "0.22255898",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gz6lxv4",
            "score": 2,
            "text": "You can.  Good god.",
            "title_similarity": "-0.015723927",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gz6nad4",
            "score": 1,
            "text": "yeah i fucking HATE seeing the popping subreddit show up. i get to each their own and im happy to fuck off an let them enjoy those videos by themselves but i do not want to fucking see that any bit at all and i think most would agree thats kind of reasonable",
            "title_similarity": "0.6457955",
            "sentiment_compound": 0.5059
        },
        {
            "id": "gz6og76",
            "score": 1,
            "text": "I get the sentiment and the argument.\n\nHowever if people are that fragile they shouldn't go on social media and expose themselves to possibly contradicting opinions, views, beliefs, and possibly even facts that they have a hard time accepting.\n\nIt's simple there generally is not a good reason for someone NEEDING to be on social media, just a want. \nFor kids I could understand if exceptions are made, but for adults I simply think they need to thoughen up or just stay away from social media.\n\nYou also can not block other users just ignore them, that's not really blocking them. Blocking means they can't see your posts or respond to you, not you not seeing what they post.",
            "title_similarity": "0.7201081",
            "sentiment_compound": -0.5405
        },
        {
            "id": "gz6q1tz",
            "score": 1,
            "text": "you can with joey. my filter list grows daily",
            "title_similarity": "0.095062934",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz6qsyw",
            "score": 1,
            "text": "I may go a little further and request a filter by tags inside a sub",
            "title_similarity": "0.3876961",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz6qz49",
            "score": 2,
            "text": "This is an official Reddit feature. It used to be only available as a feature for people who pay for Reddit Gold, but now it's available to everyone. I'm not sure how it works in your situation (which app you are using and phone vs. computer), but if you use Old Reddit on desktop and click on /r/all, you can see the filter feature on the top right side of the page. I usually use it to block subreddits about TV shows I'm watching to avoid spoilers. \n\nI'm sure it's available in the Reddit app somewhere. If you really can't find it in the app, you can login to the desktop site on a computer (or via your phone's browser), add the subreddits you want to filter there, and then logout. Your preferences will carry over to the app.\n\nUltimately, your point is that Reddit should allow people to block/filter subreddits. Reddit already allows you to do this officially. It seems like either you haven't found this setting in the app you use yet or Reddit's app is bad and doesn't have the feature like the website does. My guess is that it's the former. \n\nBut to actually argue against your view, the place where this applies is on /r/all. That's one of the few places where you can see what is actually popular online and not just what you customize for yourself in advance. One of the problems in society is that everyone sees customized stuff. When there was just one news agency reporting everything, everyone had the same information. Now people have filtered down to little blogs that only present information that confirms what they already think. There used to be just a few TV channels and everyone watched the same thing on TV. Now Netflix has shows aimed at just one small sliver of society. We no longer have the same information sources and cultural experiences, which is why the fabric of society is breaking down. Everyone looks for divisions instead of accepting what applies to the whole of society. This is a bad thing in the long term. Reddit allowing people to filter out /r/all, means people no longer see what is most popular overall, but what is most popular once the stuff they disagree with is blocked out is another example of this problem.\n\nEven if you think it's a good thing, it can lead to dangerous blind spots. Back in 2015/2016 when everyone thought Donald Trump was a joke, the fact his subreddit hit the top of /r/all multiple times was one of the first indicators that he was going to win the election. If you filtered that information out, you would have been completely blindsided when he won. It's more psychologically comforting in the short term to avoid information that makes us unhappy, but bad for us in the long term.",
            "title_similarity": "0.6903484",
            "sentiment_compound": -0.8092
        },
        {
            "id": "gz6rcxz",
            "score": 1,
            "text": "I don't know about the official Reddit mobile app, but the website _does_ have this feature. I have nearly 100 subs filtered from /r/all. Maybe it's only on old.reddit?",
            "title_similarity": "0.44974753",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz6uykq",
            "score": 1,
            "text": "Literally made my account for that lol\nUse Apollo app on iOS. It’s amazing.",
            "title_similarity": "0.25276783",
            "sentiment_compound": 0.765
        },
        {
            "id": "gz6vc1m",
            "score": 2,
            "text": "RES has this function via the filter button. Don't like a subreddit spamming your r/popular or r/all? add it to the filter.",
            "title_similarity": "0.68340194",
            "sentiment_compound": -0.6381
        },
        {
            "id": "gz6wl6d",
            "score": 1,
            "text": "The day I can block r/PewDiePieSubmissions and r/FemaleDatingStrategy will be the greatest day of my life.",
            "title_similarity": "0.43654525",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gz6xzzf",
            "score": 1,
            "text": "i don’t entirely disagree, but i think the reddit people’s time would be better spent prioritizing other things—namely, making the current block feature actually effective. on most other sites, blocking a user prevents them from seeing your account. reddit, however, didn’t get the memo as it’s version is basically a glorified mute button. they should fix that nightmare before moving onto other types of blocking.",
            "title_similarity": "0.8209923",
            "sentiment_compound": 0.2282
        },
        {
            "id": "gz6y4zc",
            "score": 1,
            "text": "Yes yes and yes! I’m getting so tired of seeing Dillon post from subs I’m not a part of. May if these subs I purposefully left them and don’t want to see them yet here they are..... still.",
            "title_similarity": "0.657076",
            "sentiment_compound": 0.606
        },
        {
            "id": "gz6yedj",
            "score": 1,
            "text": "Reddit wants money for adds so no.",
            "title_similarity": "0.59713876",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz6zbbj",
            "score": 1,
            "text": "I guess it really depends on how much you see  social media being responsible for what happens on their platform.\n\nBeing able to block even the hint of visibility that another viewpoint (subreddit) exists allows for people to fine-tune their own echo chambers.\n\nI would argue against a simple block/don’t block system, but I would love to see a sliding scale to fine tune Reddit’s “suggestions”.  Let us help balance our experience.",
            "title_similarity": "0.7633946",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gz704gj",
            "score": 1,
            "text": "YES FUCKING THANK YOU",
            "title_similarity": "-0.007536102",
            "sentiment_compound": 0.6697
        },
        {
            "id": "gz7119o",
            "score": 1,
            "text": "While I technically agree, I can also see how this isn't that important in the grand scheme.\n\nTalking about echo chambers and mental health when Reddit, and most of social media, is a voluntary experience that only affects you as much as you let it. You don't have to be here so any \"struggles\" you may face here are as problematic as dropping your ice cream on the ground.\n\nYour concerns aren't invalid, they're just moot. Nothing will change because it's not important enough to even consider.",
            "title_similarity": "0.67046154",
            "sentiment_compound": -0.3318
        },
        {
            "id": "gz74feb",
            "score": 1,
            "text": "I think what you want is a blacklist for subreddits while everyone is telling you reddit already has a whitelist for subreddits, which is practically the same feature, but easier. You choose your favourite subreddits instead of blocking thousands of them.\n\nOTOH, reddit's suggestions are just like ads. That won't go away any time soon. They will never implement a blacklist because the more subreddits you visit, the more time you'll spend on their website, and the more opportunities for them to send you more suggestions and more ads.",
            "title_similarity": "0.7223249",
            "sentiment_compound": 0.8196
        },
        {
            "id": "gz75lek",
            "score": 1,
            "text": "I agree with this. Some subs are just no good.",
            "title_similarity": "0.42549673",
            "sentiment_compound": 0.0243
        },
        {
            "id": "gz76d4f",
            "score": 1,
            "text": "Ehh, i just choose to ignore the stuff i don't like. It's the internet and it's really easy just not to read stuff",
            "title_similarity": "0.5308454",
            "sentiment_compound": -0.1071
        },
        {
            "id": "gz76k5z",
            "score": 1,
            "text": "I mean.... I just don’t subscribe to subs I don’t want to see and they don’t come up. If you’re scrolling your own feed you shouldn’t have this problem. Only when scrolling the “popular” feed do you lose that control. \n\nI guess I don’t understand what the issue is...",
            "title_similarity": "0.6939917",
            "sentiment_compound": -0.6731
        },
        {
            "id": "gz77ag9",
            "score": 1,
            "text": "USE BOOST. I atarted using the boost app after the official app keep hanging up on me. NEVER GOING BACK. you can block, words, domains, subreddits, users, flairs.. You name it... Love it.",
            "title_similarity": "0.50135124",
            "sentiment_compound": 0.8143
        },
        {
            "id": "gz77z42",
            "score": 1,
            "text": "They’re finally adding filtering subreddits:\n\nhttps://www.reddit.com/r/blog/comments/llhks0/simplified_posts_feature_glow_ups_and_continued/gnppcbs/\n\n> Dursai\n> \n> I’m not sure how this could be implemented, but I’d love a feature where you can block subreddits\n\n> [–]BurritoJusticeLeague\n>  \n> [S,A] 47 points \n> \n> **We've gotten this feedback from others, and it's something we're currently working on**. \n> \n> **Right now it's in design, and will go into development after Q1.**\n\nIn the meanwhile, use old Reddit and the Reddit Enhancement Suite extension.\n\nYou gain access to some useful features:\n\n**Filter subreddits**\n\n`RES settings console → Subreddits → filteReddit (filteReddit) → Filter Subreddits From (filterSubredditsFrom)`\n\nI can’t browse All without blocking subreddits.\n\n**Dashboard** \n\nhttps://www.reddit.com/r/Dashboard/#dashboardContents\n\nOn a single dashboard page, you can put the top 3 posts from one subreddit, top 5 posts from another subreddit, top 2 posts from another subreddit, etc.\n\n(Dashboard also works on multireddits like reddit.com/r/science+technology).\n\n**Default Comment Depth**\n\nComment Depth limit feature limits seeing replies to replies to replies.\n\n`RES settings console → Comments → Custom Comment Depth (commentDepth) → Default Comment Depth (defaultCommentDepth)`\n\nYou can change it for individual subreddits.\t\n\nIf it’s a popular subreddit with comments that have lots of replies, you can limit more of the depth.\n\nWith a smaller subreddit, you might be okay with having all comments expanded.\n\nYou can also have it activate on individual comment threads.\n\nWhen a single comment thread exceeds a certain amount of comments, it limits the expansion.\n\n**Bookmarklets**\n\nJavaScript Bookmarklets that you put in your bookmark toolbar are another option that only work on the old Reddit.\n\nClickable bookmark with the URL:\n\n    javascript:$('.commentarea .child ').toggle();void 0\n    \nThat would be the same as 1 = Root level.\n\nOnly see the parent comments. \n\n---\n\n    javascript:$('.commentarea .child .child').toggle();void 0\n    \nwould be the same as:\n\n2 = Only see the parents and the responses to root level",
            "title_similarity": "0.6847902",
            "sentiment_compound": 0.9838
        },
        {
            "id": "gz7ccc3",
            "score": 1,
            "text": "That's literally what the Home button is for.  You subscribe to what subs you want to see and don't see the ones you don't want to see.\n\nEDIT:  \n\n>Don’t like what’s being posted on r/conservative? Too bad.\n\nI've literally never seen a /r/conservative post unless I purposively go there to troll idiots.  (Well I'm banned now so I guess I can't do that)\n\n>Ironically, CMV is one of the only subs I see where people welcome each other to be challenging of each other’s views, and welcomes civil debate. There are others, but I feel like it’d be rather controversial to name names.f\n\nWhy is this ironic?  Do you know what ironic means?",
            "title_similarity": "0.74819577",
            "sentiment_compound": 0.2827
        },
        {
            "id": "gz7d1zx",
            "score": 1,
            "text": "You're looking for comfortable \"information  silos\"",
            "title_similarity": "0.21846548",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gz7enta",
            "score": 1,
            "text": "Why can’t people (in all directions) handle hearing something that they disagree with? I think it’s because our opinions are mostly ill-informed but for some reason we cling to them with cult-like fervor.",
            "title_similarity": "0.6402339",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gz7kv08",
            "score": 1,
            "text": "We shouldn't be able to block users - at least, only in DMs or chat, not in a way that hides their comments. Reddit is not meant to be another echo chamber like Facebook, where you close off to anything you don't want to hear, it's meant to be a collection of user-managed forums for open discussion.\n\nAs for sections, you were always supposed to manage that yourselves. Originally, this was only by the subreddits you subscribed to, but multireddits predate new reddit and you can make your own lists. If you don't like the lists you've got, make your own.",
            "title_similarity": "0.71290207",
            "sentiment_compound": -0.5149
        },
        {
            "id": "gz7py2d",
            "score": 1,
            "text": "I dont have any of the problems you desfribe. Contrary to your \"statistics\" I find reddit to be very civil. Have you consider that maybe this is a you problem and not a reddit problem. Maybe you are the one attracting all this negativity to yourself or subconciously seeking it out.",
            "title_similarity": "0.5934545",
            "sentiment_compound": -0.5175
        },
        {
            "id": "gz7vhbx",
            "score": 1,
            "text": "Apollo,  subscribe to Reddit Gold Ultra supreme deluxe season pass to receive your free wholesome award.",
            "title_similarity": "0.2928465",
            "sentiment_compound": 0.886
        },
        {
            "id": "gz82zki",
            "score": 1,
            "text": "Reddit is an echo chamber as it is. Most people, as you pointed out, already don't stray from their comfort zones.\n\nIn this dumb assholes honest opinion, dcho chambers are one of the most damaging things to society right now. Once upon a time, you could be mates with someone who had different opinions. But now, anyone who disagrees is an idiot or a nazi.\n\nObviously, you've recognised that that is the case, but don't you think giving people more tools to lock themselves in their little safe space, that never forces them to question their opinion, only validates their beliefs is probably a bad idea?\n\nWe could all do with a little nore nuance and tolerance, IMO.",
            "title_similarity": "0.7253736",
            "sentiment_compound": -0.8634
        },
        {
            "id": "gz84ia5",
            "score": 1,
            "text": "I already have this in Joey a Reddit app for Android, it's called filter, I can filter out posts from a user, a forum, or a flair.\n\nI can't comment in a few subreddit like teenagers or that black only sub, or women only, and they always pop up in r/all with terrible content so I just filtered those out together with American football, baseball, basketball, formula 1. And this makes the all stream much more useful for me.\n\nThen I also noticed most of  r/science is some Horoscope level bullshit people call Psychology but it's unreproducible newspaper columnist polls of teenagers disguised as science, so I banned them to great effect. Now my biggest issues are idiots that hide the same bullshit behavioral science polls as medicine even though it's not medical science but somehow it's about people who are antivax also drink bleach or some stupid thing like that.\n\nStill no idea how to just block/ignore comments of some user.",
            "title_similarity": "0.69954574",
            "sentiment_compound": -0.9249
        },
        {
            "id": "gzfimgc",
            "score": 1,
            "text": "As someone who doesn't really use reddit that often, i'm shocked this isn't a thing",
            "title_similarity": "0.4818516",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7k911d",
            "score": 1,
            "text": "How do I remove content on my homepage/dashboard from the subreddit that I unfollowed?\nI joined a gory subreddit while I was on antidepressant (got manic from the medication), unfollowed the subreddit, but the contents still show up on my dashboard",
            "title_similarity": "0.70898485",
            "sentiment_compound": 0.0
        }
    ]
}