{
    "CMV: we should stop throwing around the term \"socialism\" in mainstream American political discourse\nI believe \"socialism/socialist\" is a fuzzy term, at best, that often derails what could otherwise be useful political debates in the United States. When people on the political right say \"socialism,\" they typically have in mind a poorly-run welfare state at best and brutal totalitarianism at worst. I realize this is due to lingering effects of the Red Scare and our right-biased Overton Window, but it is the case regardless. On its own, this should be enough to discourage the use of this term if only one side of a debate really knows what it means, but I think it goes deeper than that.\n\nI also find that liberals and people who lean politically left in the US often have a fuzzy conception of \"socialism\" as well. They tend to lump AOC, Bernie Sanders, and Nordic countries all under this \"socialist\" umbrella, when what all of these have in common is *social democracy*, not socialism. Places like Sweden and Norway operate with capitalist economies and most of what AOC and Bernie push for is completely compatible with capitalism, albeit in a modified form.\n\nWhat I think is happening is that when people say \"socialist\" in the positive sense in the US, what they probably mean is *Keynesian* (i.e., the government doing stuff). That is, the focus tends to be on the role of government and social programs more than workplace power dynamics (e.g., labor vs. the owner class) and the fundamental incentive structure of the economy. To my understanding, basic socialist ideology is agnostic to the role and structure of government, ranging from radically democratic to decidedly-NOT democratic (hence why the left tends to split off into so many factions).\n\nI am not merely making this argument from the abstract \"words mean things\" stance (though this does partially motivate the argument because, of course). Controversy and lack of clarity have real world impacts on public views and political behavior. For instance, Americans broadly support progressive, social democratic labor laws, such as expanding the power of unions ([https://www.filesforprogress.org/memos/labor\\_unions.pdf](https://www.filesforprogress.org/memos/labor_unions.pdf)), whereas most Americans by and large tend to dislike things that are labelled as \"socialist/socialism\" ([https://news.gallup.com/opinion/polling-matters/287459/public-opinion-review-americans-word-socialism.aspx](https://news.gallup.com/opinion/polling-matters/287459/public-opinion-review-americans-word-socialism.aspx)). \n\nIn conclusion, I am not arguing for the literal censorship of the word \"socialism.\" Furthermore, I understand that words and concepts morph over time; however, I would argue that in the US \"socialism\" has evolved into splintered meanings, depending on political community, without consensus, making it a bad word for political debate. Thus, I am making a pragmatic argument -- we should avoid using a term in our discussions and debates that is misunderstood, loaded, and, in my opinion, beyond salvaging in our political context.\n\nChange my view.": [
        {
            "id": "gzgjwy5",
            "score": 1,
            "text": "/u/Karloz_Danger (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nl4mvd/deltas_awarded_in_cmv_we_should_stop_throwing/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.4159562",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzgrdcx",
            "score": 48,
            "text": "If you want that. I would urge the Democratic Party to stop throwing around the words fascist, nazi, and racist in the political realm too that is meant to demonize political opponents.",
            "title_similarity": "0.83005905",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gzg8euu",
            "score": 370,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gzg9grb",
            "score": 6,
            "text": "What about actual socialists",
            "title_similarity": "0.34835458",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzgato6",
            "score": 45,
            "text": ">I believe \"socialism/socialist\" is a fuzzy term, at best, that often derails what could otherwise be useful political debates in the United States.\n\nYa, but you are acting like that isn't the entire point. R's cry socialism at anything that helps people they don't like in the same way that Trump cried \"fake news\" at anything that was unflattering to him. \n\nIt is 100% to derail a substantitive debate. Assuming the other side is arguing in good faith is something that, sadly, you can no longer do.",
            "title_similarity": "0.9227749",
            "sentiment_compound": -0.9055
        },
        {
            "id": "gzgn2ej",
            "score": -1,
            "text": "People who are scared of the word socialism do not realize that the underlying nature of reality is organized like a community and that the selfishness being perpetuated in today's society is the reason we are always at odds with our nature. Almost every social issue spawns as a result of animals who are trying to leave the animal kingdom. That's literally what's going on and they expect people to just conform.",
            "title_similarity": "0.70163345",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzgdptn",
            "score": 133,
            "text": "Socialism isn't a fuzzy term. It has a clear definition. It is when the workers own the means of production. Anyone advocating for that is a socialist. Republicans calling everyone a socialist is at best ignorant and at worst dishonest slander.",
            "title_similarity": "0.70377564",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzgkme6",
            "score": 6,
            "text": "I would say socialism coming into the vernacular of mainstream politics helps provide ground to start a better discussion of the issue, and to break in Bernie and AOC folks into actual socialism. While there is not much socialist about voting to drop cobalt on Yugoslavia, or constantly getting behind foreign intervention, people like them constantly being on the progressive side of each issue helps people without much knowledge/interest of politics define the sides more concretely (even if it may be not very accurate)",
            "title_similarity": "0.78087974",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzgvdrf",
            "score": -3,
            "text": "Socialists played a role in shaping the legal, political, and social structure in Western European countries like Sweden.  \n\n\nSocialists in these countries advocated for and helped to implement public housing, drug liberalization, social welfare, worker protections, public healthcare, etc. These are policies that American socialists advocate for, albeit a few decades later. So what's the difference, in your mind?",
            "title_similarity": "0.5658348",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzguha7",
            "score": 7,
            "text": "I agree with you on the weight of words. I noticed that happens a lot with “racism”, “sexist” and “ intolerant”. These words are being torn away from their original meaning and it is making people ‘s discussions more hostil and heated than it needs to be.",
            "title_similarity": "0.6184828",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzgm060",
            "score": 0,
            "text": "Strictly speaking Socialism advocates shifting ownership from private individuals to the government or to groups of workers/laborers. There is nothing \n\nEffectively speaking having sufficient corporate taxes and union supporting laws creates the same effect.",
            "title_similarity": "0.72191596",
            "sentiment_compound": 0.3806
        },
        {
            "id": "gzgtqt2",
            "score": 0,
            "text": "I wish we could but since democrats are set on either being a socialist or communist country I’m not sure how we can just stop using the terms.",
            "title_similarity": "0.75385",
            "sentiment_compound": -0.5256
        },
        {
            "id": "gzgvrzo",
            "score": 0,
            "text": "Uhhhhh, socialism is the foundation of government. I know you mean \"as a pejorative tem\", but everything we do through government is the socialization of one action or another.\n\nThe problem is that most people who throw out \"socialism\" just want to make sure everyone know that they think xyz is more socialized than the average abc thing we do while, for obvious reasons, they want anyone dumb enough to do so simply to think of Stalinist Russia.",
            "title_similarity": "0.7920377",
            "sentiment_compound": -0.631
        },
        {
            "id": "gzh7isv",
            "score": 0,
            "text": "the problem is that people usually use the word \"socialism\" or \"socialist\" to describe a policy or politician when in reality the thing being accused of being \"socialism\" isn't. for example how trump and republicans said that a biden win in the election would lead to \"socialism\" and \"anarchism\". the thing is that these politicians know that its not really socialism, but its about scaring people into believing its socialism. its a tactic to delegitimise and smearing their opponents.",
            "title_similarity": "0.8931743",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzhjjka",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gzgxqw6",
            "score": -1,
            "text": "as an actual socialist,  I think we should be talking about socialism in the US (as in workers owning the means of production)   \n\n\nbut not when we're talking about social democracy.  \n\n\nI think that it's silly to advocate for social democracy if that's what you want in the US because at the end of the day social democracy in europe was historically built through coalitions of socialists and liberals not strong social democratic parties.   \n\n\nI've taken to outright arguing in favor of communism in the hopes that it becomes more normalized in the US and we can meet the far-right in the ACTUAL middle instead of the the social democrats meeting them at the center-right.",
            "title_similarity": "0.8434278",
            "sentiment_compound": 0.5923
        },
        {
            "id": "gzgbh1y",
            "score": 268,
            "text": "The problem is that you are arguing that people should stop using a tool that is political expedient for them.  You absolutely correct that the word can mean a million things and that it adds nothing to American political discourse because there's no agreed upon definition.  \n\nHowever, the word scares a lot of people on the right and if someone or something is described as \"socialist\", Republican politicians and pundits know that they don't have to engage with that particular issue any longer. \n\nAnd that's really useful.  Let's say you're Ted Cruz.  Why agree to an actual informed debate about the objective merits of student loan forgiveness or single-payer health insurance, something your financial backers are staunchly opposed to, when you can just label those polices as \"socialist\" say that if the U.S. adopts them, there will be food shortages as we see in Venezuela?\n\nIs it smart?  No.  Does it work? Yes.  Republicans are going to keep doing it.",
            "title_similarity": "0.8497187",
            "sentiment_compound": 0.524
        },
        {
            "id": "gzgzzvu",
            "score": 9,
            "text": "> To my understanding, basic socialist ideology is agnostic to the role and structure of government, ranging from radically democratic to decidedly-NOT democratic (hence why the left tends to split off into so many factions).\n\nAgnostic in what possible sense? People aren't going to naturally form a socialist society. There has to be a mechanism of enforcement, as evidenced by every government ever also having one. That limits the possible implementations of socialism down, and thus we can limit the discussion to only those which have a remote possibility of working, or really to zero, because it never works. \n\n> They tend to lump AOC, Bernie Sanders, and Nordic countries all under this \"socialist\" umbrella, when what all of these have in common is social democracy, not socialism.\n\nAOC and Bernies Sanders *are* democratic socialists.They want to see the [end of capitalism](https://www.vox.com/first-person/2018/8/1/17637028/bernie-sanders-alexandria-ocasio-cortez-cynthia-nixon-democratic-socialism-jacobin-dsa).\n\n> I’m a staff writer at the socialist magazine Jacobin and a member of DSA, and here’s the truth: **In the long run, democratic socialists want to end capitalism.** And we want to do that by pursuing a reform agenda today in an effort to revive a politics focused on class hierarchy and inequality in the United States. The eventual goal is to transform the world to promote everyone’s needs rather than to produce massive profits for a small handful of citizens. \n\nThe end of capitalism is fairly straight forward; no profit, no private property. You can sugar coat it in whatever flavorful language you want, but that's what it means to end capitalism; the outlawing of private ownership of the means of production.",
            "title_similarity": "0.82467496",
            "sentiment_compound": 0.822
        },
        {
            "id": "gzgq1yg",
            "score": -2,
            "text": "Commerce is buy and sell.\n\nSocialism is tax and spend.\n\nCapitalism is borrow and lend.\n\nThe reason Capitalism V Socialism is so heated is because there is a multi generational debate on what is the best way to fairly distribute wealth in a society.\n\nShould someone with so much wealth they don't know what.to do with it be taxed alot more to finance  public works like education or should they be free to lend it to people who need it to buy a house, car, start a business.",
            "title_similarity": "0.6845087",
            "sentiment_compound": 0.9492
        },
        {
            "id": "gzgoqx2",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.2717846"
        },
        {
            "id": "gzgvweo",
            "score": 52,
            "text": ">I believe \"socialism/socialist\" is a fuzzy term, at best, that often derails what could otherwise be useful political debates in the United States.\n\nsure\n\n>When people on the political right say \"socialism,\" they typically have in mind a poorly-run welfare state at best and brutal totalitarianism at worst.\n\nThis depends heavily on (as you would guess) political affiliation\n\n[https://www.forbes.com/sites/niallmccarthy/2020/10/06/the-most-socialist-countries-according-to-americans-infographic/?sh=349bcc5c5705](https://www.forbes.com/sites/niallmccarthy/2020/10/06/the-most-socialist-countries-according-to-americans-infographic/?sh=349bcc5c5705)\n\nDemocrats consider Sweden and Norway to be the most \"socialist nations\" while Republicans associate the term with Russia and Venezuela.\n\n>They tend to lump AOC, Bernie Sanders, and Nordic countries all under this \"socialist\" umbrella, when what all of these have in common is social democracy, not socialism. Places like Sweden and Norway operate with capitalist economies and most of what AOC and Bernie push for is completely compatible with capitalism, albeit in a modified form.\n\nSweden and Norway...are very different from Bernie or AOC's vision for America. The Scandinavian economies are heavily free trade, while Bernie is *very* protectionist. They also tend to have very pro-business regulation (Scandinavian countries consistently rank very highly on ease of doing business) and have low corporate taxes (Bernie supports very high corporate income taxes). You can certainly find similarities between Scandinavia's social safety net and many of Bernie's proposals, but many of his proposals go quite beyond the Scandinavian model, like his proposal for a universal jobs program and his healthcare plan which calls for eliminating all premiums, copays, and deductibles, among many other things. You can't really summarize it all in a post like this.\n\nBernie and AOC's vision is compatible with capitalism although that's also a vague term.\n\n>What I think is happening is that when people say \"socialist\" in the positive sense in the US, what they probably mean is Keynesian (i.e., the government doing stuff). That is, the focus tends to be on the role of government and social programs\n\nKeynesian economics as just the government just pushes with social programs is a very vague summarization. I would read this article for more details [https://www.imf.org/external/pubs/ft/fandd/2014/09/basics.htm#:\\~:text=British%20economist%20John%20Maynard%20Keynes,wage%20demands%20(see%20box)](https://www.imf.org/external/pubs/ft/fandd/2014/09/basics.htm#:~:text=British%20economist%20John%20Maynard%20Keynes,wage%20demands%20(see%20box)).\n\nBut to summarize, Keynesians advocate for counter-cyclical fiscal policy to help regulate the Business cycle (ie using deficit spending to finance strong fiscal stimulus during recessions while using higher taxes and other policies to deflate the economy during periods of abundant growth to avoid inflation). Keynesians have also integrated monetary ideas over the years.\n\n>more than workplace power dynamics (e.g., labor vs. the owner class) and the fundamental incentive structure of the economy. To my understanding, basic socialist ideology is agnostic to the role and structure of government, ranging from radically democratic to decidedly-NOT democratic (hence why the left tends to split off into so many factions).\n\nWell Bernie and AOC do focus a lot on workplace power dynamics, although I don't think that really makes them socialists (atleast the way I would define it).\n\n>I am not merely making this argument from the abstract \"words mean things\" stance (though this does partially motivate the argument because, of course). Controversy and lack of clarity have real world impacts on public views and political behavior. For instance, Americans broadly support progressive, social democratic labor laws, such as expanding the power of unions ([https://www.filesforprogress.org/memos/labor\\_unions.pdf](https://www.filesforprogress.org/memos/labor_unions.pdf)), whereas most Americans by and large tend to dislike things that are labelled as \"socialist/socialism\" ([https://news.gallup.com/opinion/polling-matters/287459/public-opinion-review-americans-word-socialism.aspx](https://news.gallup.com/opinion/polling-matters/287459/public-opinion-review-americans-word-socialism.aspx)).\n\nSocialist labels certainly due impact how Americans view policies.\n\n>In conclusion, I am not arguing for the literal censorship of the word \"socialism.\" Furthermore, I understand that words and concepts morph over time; however, I would argue that in the US \"socialism\" has evolved into splintered meanings, depending on political community, without consensus, making it a bad word for political debate. Thus, I am making a pragmatic argument -- we should avoid using a term in our discussions and debates that is misunderstood, loaded, and, in my opinion, beyond salvaging in our political context.\n\nI mean socialism is hardly the only term that is vaguely defined and can have a lot of different meanings to people. Terms like capitalist, social democratic, left, right, liberal are also poorly defined. Like you bring up social democracy, but honestly people seem to use that term to represent everything on the \"American left\" between centrist Democratic policies and full blown socialism.\n\nIn general I think it would be nice to move political discussion away from discussing vague terms and focus on debating actual specific policy.",
            "title_similarity": "0.8714695",
            "sentiment_compound": 0.9843
        },
        {
            "id": "gzga1t7",
            "score": 3,
            "text": "What will it mean if we stop using the term socialism? Is your argument that language sucks? I agree. But language is what it is and words often have different meanings to different people. And socialism itself has a history of fuzzy meanings. The difference between socialism and communism will differ based on who you ask; even those who study it will probably disagree. But, again, it's just the way that language works. We can't assume meaning because conveying our beliefs is hard. Even in your post, you referred to \"liberals and people who lean left\" when the fact of the matter is that most Democrats would be right of center on the political spectrum, and are only left in relevant comparison to the right. People throw around terms like \"terrorism\" as well.\n\nMy point is that it doesn't really matter what words we use. There will always be words that become weapons, and there are countless words to weaponize if one ceases to be effective. The way we properly communicate with one another is by explaining our positions completely with other people who aren't arguing in bad faith.",
            "title_similarity": "0.8564083",
            "sentiment_compound": 0.4971
        },
        {
            "id": "gzgm5yk",
            "score": 1,
            "text": "Forgive my ignorance, I'm confused about something - why did the nazis use the term socialist? Is socialism any way connected to communism? I know the nazis had beef with the communists.",
            "title_similarity": "0.7415089",
            "sentiment_compound": -0.4696
        },
        {
            "id": "gzgqt2q",
            "score": 1,
            "text": "I certainly do not agree with your premise of banning the phrase.  I would prefer people just knew what they were talking about, use the word correct and understand what it means\n\nPeople just need to stop being stupid and try and develop some knowledge on what they are talking about.  I would prefer we just stop including stupid people in our conversations.  However I doubt that is ever going to happen.",
            "title_similarity": "0.7490022",
            "sentiment_compound": -0.9083
        },
        {
            "id": "gzgty2u",
            "score": 1,
            "text": "Haha you right",
            "title_similarity": "-0.017453223",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzgv5v8",
            "score": 1,
            "text": "Maybe those on the right will stop indiscriminately throwing around the word “socialism”, and “commie”, if those on the left stopped indiscriminately throwing around the words; “Nazi”, “white supremacist”, “republikkkan”, and “alt-right extremist” to everyone on the right.",
            "title_similarity": "0.78192395",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzgxlki",
            "score": 1,
            "text": "Any little thing the government does to help it's people is deemed socialism.  It's fucking insane.  What the fuck else is the government there for other than the citizen?",
            "title_similarity": "0.7638913",
            "sentiment_compound": -0.5849
        },
        {
            "id": "gzgyzgi",
            "score": 3,
            "text": "Likewise can we stop throwing around blanket terms on the other end of the spectrum. All this political discourse just turns into name calling and it’s as bad as a children’s playground.",
            "title_similarity": "0.7425885",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzgz0i7",
            "score": 1,
            "text": "I'm gonna start calling people Capitalists, as if that's an insult too.",
            "title_similarity": "0.64590806",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzh13cy",
            "score": 1,
            "text": "We need to stop *misusing* the term socialism. \nAnd there are some people that definitely overreact as soon its mentioned, it's ridiculous",
            "title_similarity": "0.78121674",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzh15gj",
            "score": 1,
            "text": "I would suggest we just need a better understanding of the word, so it is used properly. Socialism has a capital ‘S’ version and a lowercase ‘s’ version\n\nBig S Socialism is an economic philosophy with a focus on workers owning the means of production as a way to distribute wealth. That idea was used as a basis for the narrative of Communism (which isn’t socialist). Even Communism isn’t Communism, because it always seems to get stuck at the Dictator phase. Regardless, Socialism as an economic model does not exist outside of theory. \n\nHowever, there are public governance policies that use some concepts that could be deemed socialism, in that they seek to achieve similar goals of equality through the system. \n\nSingle payer health care IS socialism, but it has absolutely nothing to do with the Red Scare Socialism straw man the right uses to oppose those policies. They would find it hard to debate popular policies on the merits, so they reframe the argument as being about an enemy. \n\nThe right has been misrepresenting this difference for so long that we have an entire generation that doesn’t know the difference. They hear policies they like on one side, and claims of Socialism on the other, and decide it must not be that bad to be Socialist- even though they don’t understand what that actually means. \n\nKnowing what socialism means in the proper context- without the enemy Red narrative- is key to understanding what the rest of the world means when they talk about socialist policy, Social Democracy, and Democratic Socialism. \n\nSo, all that for this attempt to change your view:\n\nIt isn’t that the word shouldn’t be used, but rather we should learn to use it properly. Distancing from the terms Democratic Socialism and socialist policy because some people misrepresent it in bad faith would also distance us from the exact same policies and terminology that are used successfully in most economically advanced countries. \n\nWe shouldn’t dumb down. We should teach up",
            "title_similarity": "0.7386185",
            "sentiment_compound": 0.8647
        },
        {
            "id": "gzh1g1q",
            "score": 1,
            "text": "I'm here to double down on the idea that words have meanings. Which they goddamn do. People ignoring and manipulating them is a whole different thing. I think we should use the term but use it correctly. Which similarly means using all new terms to describe our political spectrum because politics today are nothing like 100 years ago.",
            "title_similarity": "0.7448379",
            "sentiment_compound": -0.7442
        },
        {
            "id": "gzh2xdg",
            "score": 3,
            "text": "I’m not going to try to CYV, I just think the fuzziness is exactly why terms like “socialist” and “fascist” are pushed onto the political discourse. Most conversations are completely derailed into somewhat futile attempts to define those words while the fruit of the argument gets tossed out the window, and that benefits those who depend on the maintenance of a polarized sociopolitical status quo, I.e Fox, CNN, Wall St, K St, and the general “swamp” of both parties.\n\nSemi-related, there are many stripes of socialism which overlap or contradict to varying degrees but I think you can divide socialism into two general camps; there’s statist socialism, which ranges from vanguard state communism on the far left to Scandinavian style social democracy, which has plenty of overlap with capitalism. Then you have libertarian socialism, which is generally anti-state and has more in common with anarchism or even ancap-libertarianism if horseshoe theory is something you buy (I personally think it’s an oversimplification.\n\nBut yeah, the engines of mainstream discourse love to get people all twisted up with these loaded words because the last thing they want is for the general political right and left to realize their problems and goals are basically the same when it comes down to it",
            "title_similarity": "0.825968",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzh2xkb",
            "score": 1,
            "text": "Yet even though I’m a moderate you would probably call me a racist Nazi.",
            "title_similarity": "0.733512",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzh4105",
            "score": 1,
            "text": "The reason people throw that word around is that many see the state as \"the people.\" So when the state or \"the people\" own much of the means of production, as in the post office, the public schools, the money supply, public works, transit, it is seen as socialism (and bad because of its inherent inefficiency and indifference to wasting money/resources). Without a way to measure loss and profit, there can't be an efficient use of scarce resources. Shit I was on the metra the other day and they forgot to charge me and my friends. Nobody who had a worry about staying afloat until next year would do that. It has also been described as \"Statism\" by everyone on reddits favorite author Ayn Rand.",
            "title_similarity": "0.69850636",
            "sentiment_compound": -0.8049
        },
        {
            "id": "gzh4ghl",
            "score": 1,
            "text": "Only if we feel the same about fuzzy terms that don't actually mean what they are used for like \"sexism\", \"racism\", \"fascism\" or the worst offender \"misogyny\"",
            "title_similarity": "0.754426",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gzh4x17",
            "score": 1,
            "text": "You’re not wrong that the term “socialism” has been used incorrectly in the more technical sense to the extent that connotatively it is often not constructive to use it in political debate. But a large reason for this is that the Left will pitch socialist ideas in American vernacular in an attempt to garner support. That so many democratic socialists (or whatever you want to call them) will openly denounce capitalism as a tremendous evil shows that they’re not trying to work within a capitalist economic framework. They might do it out of political necessity, but it’s just a stepping stone to what they really want long-term. \n\nFar from abandoning the term, we should double down and make sure people know just how terrible socialism really is.",
            "title_similarity": "0.9274919",
            "sentiment_compound": -0.8616
        },
        {
            "id": "gzh6c1q",
            "score": 5,
            "text": "As a european resident, I understand your concern. However, the term \"socialism\" isn't being used according to its political history in the rest of the world either and I would argue that the political discourse isn't tainted by its misuse here. As I see it, you have three distinct situations in the world regarding \"Socialism:\n\n1. There are some \"true\" socialist countries, which we often call communist countries. Particularly in the US, this is considered the polar opposite of your political values.\n\n2. In Western Europe, \"socialism\" has become a catch-all for left-leaning capitalism, so much so that it's virtually indistinguishable from social democracy. There Is no european socialist party that I know of that defends colectivization of means of production, for example.\n\n3. In the US, Republicans use \"socialism\" as a fear mongering tactic, so they mean Nº1 and willfully ignore Nº2. People like Bernie and AOC, however, seem to use it as Nº2, I see them try and address this problem all the time. I would say that this is more in line with what the term has become rather than what it meant originally, but take your pick.\n\nThe trouble isn't the word itself, though it's that each side of the aisle is using it to mean different things. For Republicans, \"Socialism\" means \"Communism\". For left-leaning democrats, it means \"Social Democracy\". What I don't see is the word being a problem in Europe, where it's more or less agreed upon that \"socialism\" is Nº2 and not Nº1.",
            "title_similarity": "0.82603264",
            "sentiment_compound": -0.7754
        },
        {
            "id": "gzh7cg0",
            "score": 2,
            "text": "I don't disagree with the notion that socialism is poorly understood, but it is a manner of shorthand and it can't just be dismissed out of hand (on either side).  I'm going to take a two pronged approach to CYV:\n\nProng 1: The word is useful because it forms a basis of common understanding and actually does have real meaning:\n\nDepending on the polls you look at as many as 48% of Americans support socialism in some manner: [https://www.newsweek.com/socialism-america-gallup-poll-1431266](https://www.newsweek.com/socialism-america-gallup-poll-1431266)\n\nA non-trivial number of college students support outright communism: [https://www.washingtontimes.com/news/2017/nov/4/majority-millennials-want-live-socialist-fascist-o/](https://www.washingtontimes.com/news/2017/nov/4/majority-millennials-want-live-socialist-fascist-o/)\n\n[https://www.marketwatch.com/story/for-millennials-socialism-and-communism-are-hot-capitalism-is-not-2019-10-28](https://www.marketwatch.com/story/for-millennials-socialism-and-communism-are-hot-capitalism-is-not-2019-10-28)\n\nUnderneath all of that, of course, is Marxism, which is probably the word that *should* be used.  When I say \"socialism\" (not often) I mean any evolution of Marxism, and the more intellectual types tend to mean the same thing.  Most people know the term and have a general sense of what it means so it provides a basis of common understanding.  At that point it is up to the person using it to clarify their meaning - and that's not untrue of any complex conversation.  Marxism matters because, like most political ideologies, it works on paper (and is even appealing) but falters in practice because of what I call \"the ideal actor\" problem - which is it assumes that everyone is going to play the game fairly and that never happens.  There is no shortage of evidence that Marxism is not that great of a political philosophy (like the whole of the 20th century) and that's sort of important, so when people say they support socialism they've subscribed to a political ideology whether they understand it or not.  That is worth railing against.  (for the record capitalism and democracy suffer from the ideal actor problem too, just ask the Greeks)\n\nProng 2: Socialism isn't the only one, so your list is going to be long.\n\nIf you're going to pick out socialism for the reasons you stated, then you are going to have to throw in fascism, democracy and capitalism because those words are a) muddy, b) misused frequently and c) have splintered meaning depending on the community.  For every conservative that calls a liberal a socialism you'll find a liberal calling a conservative a fascist.  99.999% of the time it is inappropriate.  There are plenty of other words that fall into that category as well (Nazi anyone?).\n\n&#x200B;\n\nSo, maybe what you really want to do is make the other expressions more mainstream and correct people when they mean one and use the other.  Social Democracy is a great term, and has plenty of successful examples.  It's worth correcting that.  I tend to be more capitalist with my socio-economic thinking, but I also recognize the value in social democracy (I just don't know if it scales well, Norway has less people than each of the 6 largest US cities).  Preaching Social Democracy as not being socialist is true and will likely gain you more traction.\n\n&#x200B;\n\nAs a side note I'll add this in too - something I said in another CMV:\n\nThe US (and much of the world) tend to live in this really weird left / right dichotomy when it is almost completely useless.  Political systems have a broad range of impact from social policy to economic policy to general governance.  Totalitarianism isn't left or right, but it can be found on both sides.  If anything we need at least a 3 dimensional grid to plot political ideologies if we're going to be intellectually honest.\n\nTo that point political ideologies tend to be Venn diagrams in terms of what they cover.  Capitalism is almost purely economic, whereas Socialism is both economic and social policy with a tendency to lead to governance issues, Democracy is almost purely governance and fascism is social policy and governance.  You can't fairly compare Democracy to Fascism because they don't even cover the same things.  Some are compatible with each other so you can have Democratic Capitalism, and some overlap and are incompatible.\n\nSo, again, the problem isn't that the words exist and are misused per say, it is that some people are not making the effort to dig deeper into the conversation.\n\nedit: added some stuff.",
            "title_similarity": "0.7380697",
            "sentiment_compound": 0.9939
        },
        {
            "id": "gzh8dlg",
            "score": 1,
            "text": "Really there are two directions for this - from the right the term has been deliberately used to deride any social program they don't like. The recent counter from the left is to just accept that socialist will be used this way and try to reclaim the term to literally mean any such social programs and thus diffuse the term for younger generations.\n\nSo the question would be whether we're in this ambiguous space as a result of poor understanding, or as a result of a deliberate (partial) shift in usage, or some combination of the two.",
            "title_similarity": "0.8386538",
            "sentiment_compound": -0.5733
        },
        {
            "id": "gzh9dm7",
            "score": 1,
            "text": "It is a fuzzy and broad term, and that’s the very reason it’s used so much - it can mean a lot of things.",
            "title_similarity": "0.28438652",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzhbvii",
            "score": 2,
            "text": "We should just say LIKE CANADA.",
            "title_similarity": "0.24722913",
            "sentiment_compound": 0.4995
        },
        {
            "id": "gzhcv6n",
            "score": 1,
            "text": "Socialism is social, helping each other out.\n\nWTF is the big problem with that?",
            "title_similarity": "0.5128665",
            "sentiment_compound": -0.7213
        },
        {
            "id": "gzhd48e",
            "score": 1,
            "text": "Agreed, the problem is that politicians want us to connect the opposing parties with nazis and socialists. What a lot of people don’t know is the era we have deemed as the ideal, was in fact what many say is socialist. This is a war of traditional living that has been uprooted and messy modernity. And, the winner will be the side that creates the best brand.",
            "title_similarity": "0.7966604",
            "sentiment_compound": 0.8591
        },
        {
            "id": "gzhfq4o",
            "score": 1,
            "text": "We need to normalize the word socialist and detach it from communist, fascist, or authoritarian. All it entails is using tax money to solve problems. We currently do it.\n\nIf we keep it as a forbidden word then it’ll continue to be misused by the rich who want to lower their taxes in order to keep more wealth for themselves and not for the middle class or poor",
            "title_similarity": "0.8185582",
            "sentiment_compound": -0.6378
        },
        {
            "id": "gzhfugb",
            "score": 1,
            "text": "Socialism is when the government does ____\n\nAnd the more ____ it does, the more socialist it is.\n\nAnd if it does a whole lot of ____, it’s COMMUNISM",
            "title_similarity": "0.6319847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzhfwug",
            "score": 2,
            "text": "I believe \"democracy/democratic\" is a fuzzy term, at best, that often derails what could otherwise be useful political debates in the United States. When people on the political right say \"democracy,\" they typically have in mind a laissez-faire, capitalist society with representative-based voting system. I realize this is due to lingering effects of the Jingoism and our right-biased Overton Window, but it is the case regardless. On its own, this should be enough to discourage the use of this term if only one side of a debate really knows what it means, but I think it goes deeper than that.\n\nSarcasm aside 😃, just check out [the Wikipedia page on different types of democracy](https://en.wikipedia.org/wiki/Types_of_democracy). Seriously, [Authoritarian Democracy](https://en.wikipedia.org/wiki/Authoritarian_democracy)? [Cellular Democracy](https://en.wikipedia.org/wiki/Cellular_democracy)?\n\nYou can’t have a meaningful discussion of the meaning of socialism unless you understand the origin of the idea. And no, Karl Marx didn’t come up with it. His most famous work, Das Kapital , was published in 1867, but it was fifty years earlier, possibly with the publications of work by Robert Owen , that socialism was gaining traction. However, you can’t even appreciate _this_ without context (but I'll skip that).\n\nWhen _Americans_ say socialism, they often mean a particularly narrow definition scribbled down in [a manifesto published 170 years ago](https://en.wikipedia.org/wiki/The_Communist_Manifesto), using a term that Marx repurposed and which has since been repurposed again and again.\n\nI'm _happy_ that we're willing to discuss socialism again. And yes, there is confusion over the term, but we can't get past that confusion if we're not willing to talk about it.\n\nIf you're curious, [I've written more on this topic](https://ovid.github.io/blog/what-is-socialism.html).",
            "title_similarity": "0.92393744",
            "sentiment_compound": 0.9549
        },
        {
            "id": "gzhfywo",
            "score": 1,
            "text": "You just need to learn what socialism means. It's all.",
            "title_similarity": "0.51940876",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzhg5gx",
            "score": 1,
            "text": "Nah when I call myself a socialist I mean socialist",
            "title_similarity": "0.50592023",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzhgxmm",
            "score": 1,
            "text": "From Europe, your use of the term socialism and your fear of communism makes you sound illiterate",
            "title_similarity": "0.80130947",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzhgzd1",
            "score": 1,
            "text": "I think all of politics is fuzzy and all these labels don't fit anyone 100%.",
            "title_similarity": "0.6263473",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gzhhdag",
            "score": 1,
            "text": "I think the key thing is \"otherwise productive political discussions\". \n\nthose aren't going to happen. \n\nI mean 70% of Republicans think that Donald Trump won the last US election. The problem isn't that people have different views of what socialism means and it stifles productive political debate. The problem is that peopel have different views of what is reality and that stifles political debate.",
            "title_similarity": "0.7518868",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzhk0mq",
            "score": 1,
            "text": "You might have too high an opinion of political discourse in general.  Politicians are no smarter than the masses they represent.  Words are often thrown in without operationalizing them, because it benefits the purveyor.",
            "title_similarity": "0.71871775",
            "sentiment_compound": 0.031
        },
        {
            "id": "gzhkqg9",
            "score": 1,
            "text": "There is no American political discourse. 45% of the country now operates in total bad faith.",
            "title_similarity": "0.45819044",
            "sentiment_compound": -0.4432
        },
        {
            "id": "gzhlm6i",
            "score": 1,
            "text": "So out of curiosity, do you belive that the term \"Capitalism\" is used correctly in public political discourse?",
            "title_similarity": "0.62097484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzhno1w",
            "score": 1,
            "text": "Socialism now is a “them” that conservatives rally against. It is in the interest of conservative politicians to have rallies! So from the perspective of a candidate it may get them elected!",
            "title_similarity": "0.79008764",
            "sentiment_compound": 0.555
        },
        {
            "id": "gzhopdl",
            "score": 1,
            "text": "Was literally thinking about this 2 minutes ago. Reddit is onto me.",
            "title_similarity": "0.2638141",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzhpkma",
            "score": 1,
            "text": "You should stop acting like your taxes going to your benefit, instead of the detriment of others is a bad thing. Call it whatever you want.",
            "title_similarity": "0.8022852",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzhpyet",
            "score": 1,
            "text": "Keynesianism is not the government doing stuff. Keynesianism is largely simply the economic idea that in periods of recession, the government (as the only entitiy that does not have a clear profit motif) has to step in and supply the economy with stimuli. This has very little to do with a welfare state. Keynesian ideas are eg the Covid Relief bills/Covid loans and stuff like that, the workers owning the means of production (ie socialism) or a general welfare state are not Keynesian ideas.\n\nOne of the core Keynesian ideas for example is that of an anticyclical state, meaning that the state should pump money into the economy (of course with precision and a useful concept) when the economy is doing bad and should safe up reserves when the economy is doing well. So it should behave exactly opposite to the economy at large.",
            "title_similarity": "0.6954963",
            "sentiment_compound": 0.7855
        },
        {
            "id": "gzhv7in",
            "score": 1,
            "text": "Right-biased Overton window is hilarious. If you just say \"maybe limit immigration\" or \"capitalism is the best economical system we've discovered\" you're automatically labeled alt-right. Meanwhile the progressive left says Bernie is a centrist. If we can't agree on the starting point there's no use in having this discussion.",
            "title_similarity": "0.7683104",
            "sentiment_compound": 0.5559
        },
        {
            "id": "gzhw53n",
            "score": 1,
            "text": "As a Swede, I agree.",
            "title_similarity": "0.218878",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzhwexm",
            "score": 1,
            "text": "It’s the new scare word. They gotta fear voters scared and afraid.",
            "title_similarity": "0.7047529",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gzhwk27",
            "score": 1,
            "text": "you are right we should aim to have a communist 1 party gouvernement",
            "title_similarity": "0.40519312",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzhwmfg",
            "score": 1,
            "text": "Just go back to calling them fucking commies.",
            "title_similarity": "0.43396413",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzhwzph",
            "score": 1,
            "text": "So are they Keynesians then?\nWhat should we call them?",
            "title_similarity": "0.42635757",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzhx1nf",
            "score": 1,
            "text": "Maybe just education is needed? That’s like saying we shouldn’t use the term feminism because it’s also misunderstood. How does that get us anywhere? Whatever new term you come up with will be equally demonised.",
            "title_similarity": "0.76307476",
            "sentiment_compound": 0.1179
        },
        {
            "id": "gzhxz2d",
            "score": 1,
            "text": "Socialist is really only a bad term in america though. In europe pretty much every country has a socialist party - and while not everyone likes them, we don't go around using the term socialism as a synonym for hell breaking through the ground and swallowing everyone alive.",
            "title_similarity": "0.7820772",
            "sentiment_compound": -0.4932
        },
        {
            "id": "gzhxzr6",
            "score": 1,
            "text": "“Socialism” is the new “communism”",
            "title_similarity": "0.39513984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzhynii",
            "score": 2,
            "text": "The term socialism isn't fuzzy, it's just that most people don't understand it, and the media doesn't help because they pretend to understand it when they don't (assuming there isn't a concerted effort to muddy the waters). Take social democracy for example. Your perspective on what it is is quite common, and frequently pushed by the media, but it is wrong. The problem is that people look at what the Nordic countries are like now and assume that is what social democracy looks like, but doing so is fundamentally misunderstanding what social democracy is.\n\nTo understand social democracy, we need to understand how communism was proposed to work. A simplistic explanation is that the idea is that the workers should seize the means of production, overthrow the capitalist system and enter a transitionary period between capitalism and communism. This is sometimes referred to as the dictatorship of the proletariat. This would continue until people let go of capitalism completely and with it things like placing more value on competition than cooperation.\n\nNow all this would all be very violent and which didn't sit well with some people, so they came up with an alternative. The idea is that instead of a violent proletarian revolution and an undetermined period of transition, we could try to do things democratically. So socialist politicians began to push for socialist policies, slowly eroding capitalism's hold on society and transitioning towards a socialist society. This was process is called social democracy.\n\nWhen you understand that, it becomes clear that social democracy isn't this capitalist society with strong welfare principles that you see in places like Norway. That is just how far the process of social democracy has taken those countries, but it was never the end goal.\n\nSo I disagree with you. I don't think that the term socialism should be removed from US political discourse. I think that socialists in the US need to take the time to explain what they actually believe. That we should be trying to align ourselves with the Nordic model of capitalism, because it is proven to be better than every other model we know of, but that this would just be a step towards creating a better society for everyone.",
            "title_similarity": "0.80043006",
            "sentiment_compound": 0.4744
        },
        {
            "id": "gzhytuh",
            "score": 1,
            "text": "Your first sentence sums up exactly why it is used the way it is. Much like “communism” back in the day, it is an obfuscated buzzword used to demonize policy changes that certain interests don’t want to see implemented. \n\nIt absolutely shouldn’t be used that way. Besides, most of the time the comparisons made to “socialist” nations are done so in completely misunderstood or outright nefarious pretenses (ex: mentioning Venezuela, or misconstruing first world nations that are principally capitalist societies with strong public social policies and infrastructures). \n\nThe problem is, it’s not going to stop. The best you can do is understand and call out the nonsense when people try and act like using it draws some kind of moral line in the sand. It’s also downright hypocritical - especially considering how reliant many people who make that argument are on things that can be boiled down as socialist-like policies (social security, unemployment that most of them this past year probably took out, etc)",
            "title_similarity": "0.86521053",
            "sentiment_compound": 0.67
        },
        {
            "id": "gzhz6cp",
            "score": 1,
            "text": "What's hilarious about it is that the American \"left\" wing party is more right wing than some right wing party's in other countries.",
            "title_similarity": "0.5890305",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzhzr69",
            "score": 1,
            "text": "It's probably safe to continue using the term when such policies or applications are strictly within the realm of either the economic or political facets of Socialism - ie., securing greater power for the working class (unionization), expanding social safety nets for the people (publicly funded universal healthcare), or redistribution of wealth (tax the rich).\n\nThese are fundamental principles of Socialism, that is, pushing for a less class-focused approach to society, and we should accept that certain ideas and policies lie on a grey-scale of what \"is\" Socialist, rather than forcing an all-or-nothing approach to how we use it.\n\nTL/DR: It's probably ok to use the word when approached from the perspective of *describing* policies or ideas as being on the Socialist spectrum of ideology, but blanketing them under that term in order to force or oppose it is unhelpful - as I think is your point.",
            "title_similarity": "0.7158822",
            "sentiment_compound": 0.891
        },
        {
            "id": "gzhzwcv",
            "score": 1,
            "text": "Someone called me a socialist. I said, “ok, mate. Sure.” She really didn’t get it.\n\n1. Any Gen X’er using labels drank the Boomer Kool-Aid years ago. \n\n2. I didn’t call her “Comrade” lol\n\nLike a ripped condom, this label is so over-used we are pregnant with dopey kids from the last idiot who hijacked this term. Our current leaders are not and were never Mao Zedong, Stalin, nor a Maduro.",
            "title_similarity": "0.64091754",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzi096d",
            "score": 1,
            "text": "It’s not a “fuzzy term.” It is what it is and it’s disgusting, unethical, and inhumane. It’s been proven to not work literally every single time it’s been tried and has only resulted in disaster.",
            "title_similarity": "0.62778527",
            "sentiment_compound": -0.8957
        },
        {
            "id": "gzi15lb",
            "score": 1,
            "text": "For a moment I was quite sure you must be my lost sibling cause you perfectly described my mother.\n\nI also have adhd. My mother has issues with...well...medicine..a medicine problem she might call it. She is a pleasure to be around. I'm pretty sure she is just undiagnosed herself as well",
            "title_similarity": "0.54826045",
            "sentiment_compound": 0.92
        },
        {
            "id": "gzi1o8o",
            "score": 1,
            "text": "The definition of socialism isn't fuzzy, just America is a uniquely uninformed country politically. (Such as calling Joe Biden a leftist)",
            "title_similarity": "0.70991313",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzi2ww8",
            "score": 1,
            "text": "In a capitalist society, you have the freedom to start your very own coop and be as socialist as you want.  In a socialist society, everyone is forced to surrender their freedoms to the economic planners and robbed of their success.  \n\nThat’s why they are lumped together.",
            "title_similarity": "0.61245",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gzi3xs1",
            "score": 1,
            "text": "If the definition fits it should be used. Reality is that a large part of the left does in fact support socialist agenda. Not using the word would be disingenuous.",
            "title_similarity": "0.7715086",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzi65y0",
            "score": 1,
            "text": "Socialism is a very good concept but very hard to implement. Humans love to maintain power therefore an ideal socialist society is very hard to achieve.\n\nThough we can achieve some combination of socialism with the existing capitalistic societies.",
            "title_similarity": "0.65693754",
            "sentiment_compound": 0.8864
        },
        {
            "id": "gzi73km",
            "score": 1,
            "text": "“Let’s get rid of everything that makes me uncomfortable and only talk about things I like and agree with”",
            "title_similarity": "0.59918976",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzi9kq5",
            "score": 3,
            "text": "Hi dude. I completely agree with your sentiments.\n\nHowever, the issue is that folks who throw these terms about (right leaning) are not looking to keep the political discourse on track. If they didn't have socialism to rail against they'd be scaremongering with communism.\n\nIf you try to look at mainstream media in particular, you have to keep in mind that Fox News has the largest viewer-ship.\n\nThe unfortunate reality is that a chunk of the population couldn't define adequately socialism, but they think they can. Due to this, mainstream politicians refer to socialism as what they think and what they project it to mean (thinking of the right leaning folks again).\n\nIf you somehow convinced them that this word was no longer adequately accurate, once they were done railing about cancel culture on this they would only revert to using communist in exactly the same way, ie as a substitute. In effect, since you don't achieve anything it indicates that removing one term from mainstream political discourse is a wasted effort and does not serve any purpose.\n\nFinal point. Socialism can exist in varied degrees, and therefore it is impractical to define and root out. For example if healthcare has a socialist economic background does that mean any healthcare benefit byproduct is also socialist or not?\nAnother narrow Eg: if healthcare was paid for by taking a nominal tax, and on its usage you paid an excess... is that socialism? At what point does it become a nominal tax? Surely nominal is itself also a relative term.\n\nFood for thought.",
            "title_similarity": "0.8375623",
            "sentiment_compound": 0.6412
        },
        {
            "id": "gzicg00",
            "score": 1,
            "text": "A standardized, universally accepted definition of “Socialism” & indeed, most politically related terms, would be helpful. Capitalism, for example, is a positive term for some people. It is spitted out like a swear word by others.",
            "title_similarity": "0.6437191",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gzie8us",
            "score": 2,
            "text": "In general, definitions have been twisted in the last 100 years and even more so in the last 10 for political reasons.\n\n\nLike Marx's definition of socialism and communism were pretty straight forward with socialism being a classless society (because workers controlling the means of production) and communism being a utopia with a classless and currency-less system (a society that is so efficient that it produces so much that people can just have anything). \n\n\nThese terms were twisted immediately following the Russian revolution in 1921 where a fracture between people who wanted workers to control the means of production disagreed on the method of achieving that: Socialists became those who advocated for revolution whereas communists were socialists who preferred evolutionary change through the electorate.\n\n\nFast forward 10 years and each European country redefined these terms again with France stating that Socialism was just a heavily regulated market (So capitalism with government regulations and social safety nets) and Stalin stating that socialism was just State Capitalism - replace private owners with the government (just a few examples).\n\n\nNow look where we are. In the US, Republicans use all the terms interchangeably: socialist, marxist, and communist are all terms for \"when the government does something\". At the same time, Democrats who claim to be in favor of Socialism don't even know what it is and confuse it with Frances definition (free market capitalism with regulations and safety nets).",
            "title_similarity": "0.74872875",
            "sentiment_compound": 0.956
        },
        {
            "id": "gzie9vu",
            "score": 1,
            "text": "I wouldn't equate Keynesian economic theory to socialism. \n\nThat's all about injecting capital to prop up failing industries. \n\nAustrian Economics is about spending less but it doesn't mean doing nothing. It means letting businesses fail. The idea is that no industry is safe and the government is better served spending on things that have a tangible effect on their populace.",
            "title_similarity": "0.8314491",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzignu0",
            "score": 1,
            "text": "Your asking for a change in the social definition of the word from the people who are too ignorant to understand that they're misusing the term in the first place.\n\nPeople also refused to be educated when they have a majority fallacy on their side, \"That's what everyone calls it!\" even when \"everyone\" is wrong.\n\nExample: meme.  You cannot make a meme, you can make a funny picture, once it has gone viral it has become a meme.\n\nWe definitely should, but it won't happen.",
            "title_similarity": "0.78609127",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gzigs3o",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gziibny",
            "score": 1,
            "text": "As a socialist, I'd say we should stop using the term socialism incorrectly. Socialism has an actual concrete meaning (socialism is when the workers control the means of production) yet the term is misused so many times that even our textbooks don't accurately define it. Even people who call themselves socialists like AOC, only advocate for social democrat policies.\n\nI suppose if it were a choice between people misusing socialism and people no mentioning it at all, the former is still preferable because it generates awareness and it's easy enough to learn over the fake definitions.",
            "title_similarity": "0.8455286",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzijv0k",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gzikvoo",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gzikxa3",
            "score": 2,
            "text": "Just want to say before you read all this, not really looking for a delta just wanted to clear up a few small mistakes with the initial post.\n\nOn the whole I agree with everything in here, but I'd like to clarify a mistake you made, socialism is not a fuzzy term. It is misused by both the left and the right for different political reasons, the right enjoys calling something socialist so they don't have to tackle the policy itself and can try and drive people away from that policy, whilst some of the left (definitely lots of infighting over this) call Nordic nations and Bernie Sanders socialist in order to draw more people to the left until they become actual socialists.\n\na political and economic theory of social   \norganization which advocates that the means of production, distribution,  \n and exchange should be owned or regulated by the community as a whole\n\nAlso on the socialism ranges from democratic to non democratic, kinda yes but no. \n\nNo. Not in the way you are thinking, USSR by definition (and by admission of Lenin himself) was not socialist but state capitalist, how can it be socialist if the community as a whole does not have control of the means of production, the ruling class (vanguard party) did which had its own selection rules of who was eligible so it was not democratic so the community did not control the means of production and therefore by definition the USSR was not socialist. This was just an example which can be applied to every Marxist-leninist nations and the derivations of ML thought and the nations it applied to (i.e. Maoism).\n\nNow onto kinda yes. There is a range of political theory on the left known as anarchism a subsection of which does not want democracy as they believe it still infringes on the rights of the individual by imposing the will of the whole on the individuals. Now this is a small group even within anarchist circles as it is a completely impractical idea (by these rules murder could not be illegal).  Now this would also not in practice allow a community (or workers) control of the means of production and therefore many argue this is not socialist (nor communist as it can barely be called a society).",
            "title_similarity": "0.85307777",
            "sentiment_compound": 0.88
        },
        {
            "id": "gzil91c",
            "score": 2,
            "text": "I don't wanna change ur view. I wanna know which word to use instead so I don't scare conservatives lol",
            "title_similarity": "0.58752286",
            "sentiment_compound": 0.143
        },
        {
            "id": "gzilnlf",
            "score": 1,
            "text": "You also have the issue of \"socialism\" vs \"social policies.\n\nA government can have social policies without being socialist. Robust social policies are a cornerstone of a represrntative government, and absolutely necessary to properly serve and service the people. The problem lies in how much should the government do as a minimum, and how much can the government do as a maximum without infringing on the rights of others to make these accomodations. (And, obviously, where the money comes from).\n\nA lot of people hear the word \"social\" in government and automatically add \"-ism\" or \"ist\" to the end.",
            "title_similarity": "0.76551366",
            "sentiment_compound": -0.7605
        },
        {
            "id": "gzilyd1",
            "score": 1,
            "text": "You can call all types of political terms “fuzzy.”  Politics is “fuzzy.”  \n\nThere’s no right or wrong in politics—there are ideals, and then there’s what actually happens (this used to be called compromise, but these days it’s either compromise or ‘x team won’). \n\nAnyways, like our economic system, our political system is in/near its most efficient form given the millions of constraints and rules it faces.  If you removed socialism, some other dumbass argument would likely just backfill its place in ignorance/grievance politics.  \n\nMore enlightened folks don’t use the term in bad faith, true—but censoring the word won’t make folks more enlightened.",
            "title_similarity": "0.80689025",
            "sentiment_compound": 0.8499
        },
        {
            "id": "gzim1y1",
            "score": 2,
            "text": "Is this the socialist rally.\n\nNo this is socialist democracy blah blah blah\n\nYup they are socialists.\n\nOh Hank and his propane.",
            "title_similarity": "0.6002293",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzipbtv",
            "score": 1,
            "text": "1. People aren’t arguing in good faith most the time.\n\n2. It accurately describes what is happening. America actively socializes corporate losses. They just don’t care about your losses. Today’s latest news is they are doing planning to socialize blue origin by making new contracts spacex can’t qualify for in the name of “healthy competition.”",
            "title_similarity": "0.76460385",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzipyuc",
            "score": 1,
            "text": "Would also help if anti socialism people looked closely at the government money and programs they rely on when disaster strikes. Often they don’t consider that socialism; like farm subsidies and flood relief/insurance, equipment subsidies, tax breaks, etc.",
            "title_similarity": "0.7340442",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gziub6m",
            "score": 1,
            "text": "The USA and the countries rebuilt by the USA after WWII have long maintained “socialist” programs to prevent global economic catastrophes from occurring again. These programs are precisely tailored to prevent desperation. The reasoning is that if the German people were not so impoverished following WWI, they might not have blindly followed a destructive Hitler and plunged the world into another crisis. The same idea applies for any group of people who are suffering. \n\nSocial Security, Medicare, Medicaid, and their related international variants define the list of taxpayer funded wealth redistribution programs which are wildly popular and endless among the most successful nations on Earth.\n\nRather than ban the word “socialism” from political discourse. It’s better to educate people about what the word means, how it’s regularly applied in our mixed economy, and work to improve those programs with the levers of government. \n\nThe unfortunate situation currently happening in American politics is that a certain political party has spent decades successfully curtailing the funding to those programs at the expense of the people who pay into them. Then they justify it by intentionally misleading the public about a single word that vaguely describes the program.",
            "title_similarity": "0.7301028",
            "sentiment_compound": 0.1513
        },
        {
            "id": "gzivoih",
            "score": 1,
            "text": "It’s only fuzzy because people are confusing three terms, socialism, social welfare, and statism.  They sort of overlap.   \nSocialism is workers owning the means of production. \nSocial welfare is the social safety net.\nStatism is the govt controlling social and economic activities.  \nWhile under these definitions there is no absolute connection, the fact is that socialism and social welfare can not get fully funded to be universal without govt enforcement. Socialism does not require the state, but it’s ultimate form can’t exist without an intermediate to force abolition of private property.  The social welfare system does not require the govt but it is difficult to create a universal solution without.   \nNow, why are social welfare considered socialism? It’s a little vague, but social welfare is a stepping stone to socialism and statism. Any and all economic activity is fueled by money.  Taking money as a proxy for the means of production is just the next logical step that ultimately leads to complete taxation and complete control of all means of production.  Health care as a free (at POS) service is take over of the HC industry, socializing it, rather than being a social welfare program.  There are numerous iterations before anything is fully socialized from a social welfare program to a socialized service or factory, but that is the aim.  Statism wants full control and selling control as a welfare program in your best interest or socialism bc its good for the workers is just a means to an aim.  Strange bedfellows but bedfellows nonetheless. \n\nTLDR using social welfare, socialism, and statism interchangeably is something reasonable as they’re aims are intertwined.  Hope that was clear.",
            "title_similarity": "0.7526499",
            "sentiment_compound": 0.9855
        },
        {
            "id": "gziwjqi",
            "score": 1,
            "text": "Should every term change whenever the politically right or other groups skew the true meaning of the word or phrase? Black Lives Matter (No, All Lives Matter), Global Warming (Well, It's freezing in Alabama), Pro-Choice (Choice is better than murder?), and The Big Bang Theory (So, nothing existed and then it exploded like a bomb). I don't think we should stop throwing around these terms, even though they create controversy, because that is a simple way to get a point across. Otherwise, we would never be able to use simple words to explain grander ideas and thoughts without being pedantic and explaining every word we use. Almost every word could have many meanings and anyone could change the meaning to fit their agenda.",
            "title_similarity": "0.7955741",
            "sentiment_compound": 0.7399
        },
        {
            "id": "gzixtef",
            "score": 1,
            "text": "In politics, a dog whistle is the use of coded or suggestive language in political messaging to garner support from a particular group without provoking opposition. The concept is named for ultrasonic dog whistles used in shepherding. Accusations of dog whistling are, by their nature, hard to prove and may be false.\n\nEdit. Source : WIKI",
            "title_similarity": "0.61254954",
            "sentiment_compound": 0.1511
        },
        {
            "id": "gziy2s3",
            "score": 1,
            "text": "The problem with even the Socialism that we already have (post office, Medicare, Social Security), is that the government runs them very poorly and much less efficiently than the market could. I understand having a safety net, but the more power we give the government, the less we get for our buck. The government doesn't create anything, it just uses resources by force of law. The government can make people more equal with the tax dollars, but unfortunately, this happens due to everyone getting poorer. I think poor people would rather have a larger income discrepancy if it meant that they also had more buying power.",
            "title_similarity": "0.7915089",
            "sentiment_compound": -0.8825
        },
        {
            "id": "gzj0z0h",
            "score": 1,
            "text": "You shouldn't eliminate the use of the word socialism. Socialism is simply a broad description that can be applied to government, economies, tax systems, policies, etc. You have to use more specific terms or ask the person talking to use more specific terms that already exist. \n\n&#x200B;\n\nSocial goods include roads, military, government utilities, etc. These are paid for by all and everyone benefits from them.\n\n&#x200B;\n\nEntitlement programs tax a portion or all of the population and provide a benefit for a smaller portion of the population. This can be almost any policy from paid maternity leave, food stamps, subsidized housing, farm subsidies, etc.\n\n&#x200B;\n\nProgressive taxation is simply higher tax rates for larger tax bases. Most common in estate(decedent assets) and income tax.\n\n&#x200B;\n\nFlat tax is of course a constant or flat rate for the entire tax base. Most common in sales and real property (real estate) tax property.\n\n&#x200B;\n\nThe real debate should be on the specifics, unfortunately if you watch network news (either side of the isle) it's simply a constant message that the other side is 100% bad and our way is 100% good.  Do yourself a favor find some decent podcasts where the people are both intelligent and polite in their discussions on these subjects. I would recommend the intellectual dark web group. They range most of the political spectrum from Bret Weinstein, Eric Weinstein and Sam Harris on the left to Jordan Peterson, Dave Rubin and Ben Shapiro on the right. When they have debates on their podcasts they are informative, polite and for the most part intellectually honest. \n\nI'm sure I'll get quite a bit of down votes for the names I mentioned but when people can't listen to an intelligent person on the other side of the isle then that is the problem.",
            "title_similarity": "0.63193095",
            "sentiment_compound": 0.9005
        },
        {
            "id": "gzj6680",
            "score": 2,
            "text": "The term is used precisely because it’s misunderstood.  It’s an attack, a derogatory term that isn’t really connected to any economic system.\n\nThere are a few far left outliers who use the term, but they are hardly mainstream.\n\nI agree that it shouldn’t be used in mainstream politics, but I also feel that dishonesty should be discouraged, and that isn’t happening.\n\nI guess the view I would attempt to change is your apparent perception that it’s use is a mistake.  I don’t believe it is, it’s a lie.",
            "title_similarity": "0.85790634",
            "sentiment_compound": -0.7612
        },
        {
            "id": "gzj69qz",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gzj6kjy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gzj6o8s",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gzj9oo1",
            "score": 1,
            "text": "Is it a fuzzy term or does it just have more than one definition.... a lot of terms can be defined depending on context I think it’s okay to use it if it’s being used properly",
            "title_similarity": "0.32831895",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzj9rfe",
            "score": 2,
            "text": "It is not a reasonable ask to educate those who wish to destroy education.\n\nTo create empathy in those the most selfish.\n\nAsking the bully for less torture doesn't work.\n\nTo say we shouldn't use \"socialism\" in political conversation because one side is intrinsically triggered by it because it goes against their flawed world view is pedantic and naive.\n\nThey accuse us of being communist because we want tax loopholes to close. Who cares what they think?",
            "title_similarity": "0.8687557",
            "sentiment_compound": -0.9118
        },
        {
            "id": "gzjdmda",
            "score": 2,
            "text": "You are submitting to the requests of the conservative wing by allowing them to craft the political lexicon.\n\nStop using \"socialism\" and use what? \"Keynesian\"? Okay, so what if Mitch McConnell starts crying about \"Keynesian\" economics until that phrase is bad? Then we have to find a new word. Then we do, what, \"labor-focused\" economics? So Marjorie Taylor Greene starts talking about \"labor-focused\" is anti-Christian, for some reason.\n\nThe point is, the right will *always* find ways to demonize leftist rhetoric. Policing the speech of your allies is just a distraction from having policy discussions, which, considering how much support poor people have for things like universal healthcare and workers' rights, would be more likely to change people's minds.\n\nAnd then – here's the biggest problem – conservatives will accuse the left of using \"Keynesian\" or \"labor-focused\" as a dog whistle for \"socialism\". And you know what? They wouldn't be completely wrong. While I agree there are subtle differences between a \"social democracy\" and \"socialism,\" your intent behind changing the words is *entirely* based around deception.\n\nThis is why so many of my conservative friends and family hate Democrats, because they often talk more about \"tactics\" and \"strategy\" than about issues that affect them. And even though Republicans lie, consistently more than Democrats, they aren't wrong. After all, lying in order to help someone is still lying, and it only makes it harder to gain trust from political outsiders.",
            "title_similarity": "0.8371256",
            "sentiment_compound": -0.8019
        },
        {
            "id": "gzjem12",
            "score": 1,
            "text": "Socialism is a tool for organizing and distributing resources or labor.\n\nCapitalism is a tool for organizing and distributing resources or labor.\n\nDifferent tasks are better suited to different tools as they both have pros and cons. Luckily they both exist on a spectrum where you can choose the optimal mix for any given context.\n\n&#x200B;\n\nNow to answer your question, No, we shouldn't top throwing around the term \"socialism\" in mainstream American political discourse. The term has become far too politicized and misunderstood to be part of effective conversation. People will support socialist principles when used in an appropriate context up until someone says the word **socialism**. The word is non-viable for at least another 50 years, \n\nWe should let the pundits & those who argue in bad faith  busy themselves demonizing socialism while we rebrand and call it pragmatism. \n\nIt's long overdue & very likely one or both parties will split before coming one of the new two. Why not let people vote for Pragmatists and Democratic Pragmatism.",
            "title_similarity": "0.80344296",
            "sentiment_compound": 0.8781
        },
        {
            "id": "gzjh4is",
            "score": 2,
            "text": "The news can't scare my neighbors with fancy buzz words if we take the most fancy buzz word away.",
            "title_similarity": "0.6598535",
            "sentiment_compound": 0.3875
        },
        {
            "id": "gzjk8ta",
            "score": 2,
            "text": "I think the word socialism is thrown around more fairly than the left tends to like to think.\n\nIf you're being purely pedantic and limit the definition of socialism to a socio-political structure in which the people own the means of production; or if it is anyone who is calling for the socialist revolution (publicly? privately?), then yeah - sure.  However, you really have to understand the history, and the claims/predictions of socialism.\n\nKarl Marx predicted that the Industrial Revolution would result in a clash between the business owners and the working class.  It is a socialist prediction that the failings of capitalism will lead to a revolution that ends in socialist societies (or ruin).  This overall prediction was predicated on smaller predictions.\n\n1. The proletariat would increase as a percentage of the population, and become poorer under capitalism\n2. The middle class would shrink, as its members either rose to become rich capitalists, or would be forced into the proletariat\n3. Competition among capitalists would lead to a smaller bourgeoisie, with consistent winners, and the losers forced into the lower classes\n\nThese predictions suggest that the decreasing welfare of the proletariat under capitalism should result in revolt, in which the strengthened lower class would overthrow the capitalists, resulting in revolution.  These predictions never came to pass.  As it turned out, the lower working class has shrank over time, and the middle class has increased - and all classes have generally improved their station. \n\nSocialist theory still believes this is coming, and the result of the overthrow would be equality of outcomes.  Socialist theory suggests that capitalism is inherently unstable due to the inherent wealth structure that evolves from it - the bourgeoisie will inherently become more and more wealthy, while the proletariat will become increasingly poor, and have less wealth, eventually resulting in uprising.  But this isn't true - capitalist countries have far better standards of living - even for the poorest - than socialist theory predicts.  We have made great leaps at eliminating poverty (even if incomplete) - in the US poverty was down to 10% in 2019 (down from nearly 12% in 2018) - with homelessness at just .017% in 2019.  And as such, there has been no revolution.  Socialists are still intent on the uprising occurring, and the overthrow of capitalism.  And they push for this by spreading propaganda about how the wealth gap is inherently problematic (it isn't), etc.  They've done this by changing some of their core philosophy.\n\nFor instance, the original prediction that under capitalism the poor would become increasingly poor has proven false.  So the ethical standard of socialism changed from suggesting that a capitalist society would not fulfill the *needs* of the people, to suggesting that the ethical goal need be equality.  This is known as relativism, suggesting that the poverty that capitalism creates is not absolute (a lack of fulfilling needs), but a poverty that is relative - people would not overthrow capitalism on the basis that their needs are not being met - but on the basis that one class had substantially more than the rest causing a form of psychological oppression.  At the same time, the Marxist theory of class oppression splintered into the various subdivisions we see today - the male and female classes, racial classes, ethnic classes and the various oppression dynamics and hierarchies there.  \n\nNow, the liberal philosophy is that things ought to gradually improve over time - and history has demonstrated that under capitalist societies, this is true.  This is true across all these types of classes.  Its hard to argue today that blacks in the US do not have a better lot in life than they did before the Civil War.  Its hard to argue that the social standing of women has not improved.  But the new social theory suggests that everything ought to be equal.  Its easy to argue that women don't have the same opportunities to amass wealth as men (pay gap, barriers in university programs, underrepresentation in STEM fields, etc.). Its easy to argue that blacks don't have equal footing with whites (poverty rates, wealth distribution, incarceration rates, police interactions). This was less Marxist socialism, and more Rosseau socialism.  \n\nAnd there it is: modern socialism.  Socialism has evolved as a philosophy from pure Marxism that focuses purely on a reaction to the industrial revolution as it structured our classes, which would bring about equal distribution of the fruits of production; to postmodern and multicultural principles of class equality of every sub-class of person you can think of - whether it be sex, gender, race, ethnicity, religion, LGBT status, etc.  \n\nBernie Sanders rails against the inequality of wealth distribution.  This is textbook socialist theory once you've applied Rosseau's ethical standards.",
            "title_similarity": "0.80751634",
            "sentiment_compound": -0.1691
        },
        {
            "id": "gzjlpzm",
            "score": 2,
            "text": "Cool let's stop comparing stuff to nazis first. Then we can talk about socialism and communism.",
            "title_similarity": "0.70392865",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzjma9o",
            "score": 2,
            "text": "What makes you think your definition of \"socialism\" is the correct one? If \"socialism\" is wisely used to refer to government control over the means of production, then why not accept that definition as valid?",
            "title_similarity": "0.6941005",
            "sentiment_compound": 0.2444
        },
        {
            "id": "gzjmgjd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2658313"
        },
        {
            "id": "gzjwb5c",
            "score": 2,
            "text": "Sorry, I have no intention of trying to change your view (I really must read the rules, I am probably upsetting the mods).\n\n\nTwo issues:\n\nTerminology - words often have a strict definition and a common use definition - for some words, like “socialism” - the variation between these two definitions can be vast.\n\nRelativity - much of the developed world looks on in amusement when American political parties place themselves on the political spectrum. For example, most of Europe would consider the Democratic Party to be a centre-right to right organisation when placed on the political spectrum. There are some individuals within it (like AOC & Bernie) that would most likely be considered left wing, but not exceptionally so. \n\nUsing labels such as socialism is simply laziness - it is meant to be interpreted as derogatory shorthand to describe “them”. But I guess a counter point is that it would be quite difficult if we were to demand pedantically correct use for all language - now that I think about it this idea could probably be expanded into a half logical rebuttal of your premise, but I will leave that for someone else…",
            "title_similarity": "0.7875118",
            "sentiment_compound": -0.3797
        },
        {
            "id": "gzjyl1t",
            "score": 2,
            "text": "I think there is confusion with the word between the cultural aspects if socialism and the actual economic socialism.\n\nPeople use both but refer to either as just \"socialism\", which us why it gets confusing in conversations where labels are thrown around.",
            "title_similarity": "0.7738737",
            "sentiment_compound": -0.4497
        },
        {
            "id": "gzjzdif",
            "score": 2,
            "text": "I’d like to think this is the opposite of identity politics. Identity politics seems to leverage a specific assumption(s) of a sub group’s experience to shortcut legitimate political discourse. \n\nMaybe we can term this label politics. Instead of engaging in direct political discourse, one side labels the other in an attempt to shortcut the discourse. Both sides engage in it as noted by others (racist, facist, etc being called by left, socialist, communist, antifa being called by right).\n\nThe goal should be to engage in deep meaningful discourse but the general public hates politicians so much they won’t stomach a conversation longer than a sound bite.",
            "title_similarity": "0.86349523",
            "sentiment_compound": -0.2144
        },
        {
            "id": "gzjzqiq",
            "score": 1,
            "text": "Sure and throw out capitalism while were at it",
            "title_similarity": "0.59899926",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzk2i52",
            "score": 1,
            "text": "what about the worth of your dollar being fucked by both political parties so the rich can keep hiding their assets and financially strangle the weak with inflation while using inflation to erase their own debts\n\n&#x200B;\n\nboth socialists and the GOP will continue to fuck your dollar until other countries no longer take the US dollar as legal tender then we will lose all our gold reserves real quick if we don't fix the underlying issue: refractional reserve lending+ no gold standard+ the credit card and now bailouts printing money like you can just edit the economy on a fucking spread sheet  \n\n\nthe poor suffer so that AOC can put 1.25 million into tesla stocks on dec 20, 2019 so she could pass EV laws and throw stimulus packages and bailouts so that her stock portfolio would explode and give her hundreds of thousands of dollars for doing nothing. THIS IS THE PONZI SCHEME OF THE US DOLLAR AND SOCIALISM IS A WEAPON USED TO PRINT MORE DOLLARS   \n\n\nwhich reduces the purchasing power of your dollar and makes you earn less for your work at the same time as lining the pockets of the rich.  \n\n\nyou got a 1400 dollar check, jeff bezos got a $200 million bonus and a $10 billion bailout which he just bought MGM studios with\n\n&#x200B;\n\nand you think socialism works?",
            "title_similarity": "0.75465184",
            "sentiment_compound": -0.7995
        },
        {
            "id": "gzk4mde",
            "score": 2,
            "text": "I don’t want to change your mind!  Caring that everyone can survive with one job and live their life isn’t going to destroy America.  The fear of change is pathetically uninformed garbage.  \n\nPeople think this is working?!  If we focused on education, people wouldn’t be so easily manipulated.  So that’s a no.",
            "title_similarity": "0.7376293",
            "sentiment_compound": -0.5784
        },
        {
            "id": "gzk4meh",
            "score": 2,
            "text": "Let's say you \"rebranded\" socialism to something else, say \"Workplace Democracy\". Let's say it caught on among the Left, and we began to use that phrase in place of (dictionary definition) \"socialism\".\n\nThe disingenuous/propaganda would just equate the new term to communism/authoritarianism/\"less free\" just like they did to the word \"socialism\". The very first time anyone herd it on their mainstream media propaganda box of choice, that would be the new \"definition\", and you'd have exactly the same problem as above.\n\nConsidering rich-ass people own the media mouthpiece, and (dictionary definition) socialism is against their interests (understatement of the year), they will actively flame whatever new term we pick.\n\nAt least you can google \"socialism\" and get to the roots of it, read some Marx, read about class consciousness, etc.",
            "title_similarity": "0.7667351",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzkfjp6",
            "score": 2,
            "text": "Somebody called me stupid, the other day, because I suggested that we all stop making babies until the richest person is less than 20 times as wealthy as the poorest. I asked why that's stupid, and he said \"it sounds like communism\". \n\nlol...",
            "title_similarity": "0.703202",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzkgmii",
            "score": 1,
            "text": "You can't throw a term. Did this work?",
            "title_similarity": "0.33468896",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkpbxd",
            "score": 2,
            "text": "> I realize this is due to lingering effects of the Red Scare and our right-biased Overton Window, but it is the case regardless. \n\nThe only real problem with the term \"socialism\" is that there are a whacking huge number of variations on the theme. I'm most likely primarily center-right, but with an understanding that some things that are presently private goods could be made more efficient by being pubic goods.",
            "title_similarity": "0.8134111",
            "sentiment_compound": 0.4385
        },
        {
            "id": "gzlmbk6",
            "score": 1,
            "text": "Socialism is *not* a fuzzy term.  It means the government owns the means of productions.  Nothing else.\n\nSome people use it in two fuzzy ways:\n\n* any policy that takes other people’s stuff and gives it to you is called socialism by people  who like socialism\n* any policy that takes your stuff and gives it to other people is called socialism by people  who don’t like socialism\n\nOn the side of people who like socialism there is a fair amount of “motte and bailey” going on.  When they are advocating policies, they genuinely go for socialism; when they are defending socialism, they point to non-socialist welfare states like Denmark and Sweden.",
            "title_similarity": "0.79699934",
            "sentiment_compound": 0.8834
        },
        {
            "id": "gzlzw1c",
            "score": 1,
            "text": "I believe we should call democratic socialism \"responsible capitalism\"",
            "title_similarity": "0.5823684",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzykc9h",
            "score": 1,
            "text": ">To my understanding, basic socialist ideology is agnostic to the role and structure of government, ranging from radically democratic to decidedly-NOT democratic (hence why the left tends to split off into so many factions).\n\nAlmost all socialists (including MLs) like democracy and think it should be used. Even Bordigists like majoritarianism but simply dislike using the term democracy.",
            "title_similarity": "0.80705494",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h04m8fr",
            "score": 1,
            "text": "The nordic model is not at all socialist. That is just what liberals in America try to use as a good example. Classic case of misrepresentation considering the people that vote them in care more about what feels and sounds good than actual facts and data.",
            "title_similarity": "0.7942414",
            "sentiment_compound": 0.7184
        }
    ]
}