{
    "CMV: Ducks are a better pet and/or farm animal than chickens.\nThis is a slightly silly one, but hear me out. I love chickens, I do, but ducks take the crown. Here are my arguments:\n\n1) They're significantly cuter. No offense, chicks, but ducklings will win every time. Even as adults they're hilarious to watch - they just stumble around all day long.\n\n2) They might have loud quacks, but there's no crowing to wake you up at 4AM. Every morning my chickens wake me up before the sun comes up, but my ducks are chilling the entire time.\n\n3) Their eggs are superior - typically larger, better for baking, and people with egg allergies can often actually eat them.\n\n4) Their meat is delicious and just as versatile as chicken.\n\n5) (Mild gore warning) Chickens will cannibalize each other if one dies and if they see blood on even a minor wound they will absolutely terrorize their former chicken friend. Once worked on a farm with pasture-raised hens that had plenty of space, no stressors, and when one chicken got a little nick on her head her companions literally pecked it further open until she had a quarter-size opening on her head and her skull was visible. She ended up dying. Meanwhile I had a duck that got a cut on his back and his companions literally did not care - he got plenty of time to heal up and they didn't peck him to death like assholes.\n\nThe only con is that they're messy, and you know what? I'll take messy over pecking each other to death.\n\nCMV? Bonus points for convincing photos/videos of chickens doing good chicken things.": [
        {
            "id": "gzrpm4o",
            "score": 1,
            "text": "/u/nyxe12 (OP) has awarded 7 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nn0fvx/deltas_awarded_in_cmv_ducks_are_a_better_pet/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.58111024",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzrtit1",
            "score": 11,
            "text": ">They're significantly cuter. No offense, chicks, but ducklings will win every time. Even as adults they're hilarious to watch - they just stumble around all day long.\n\nPurely subjective. Someone else could think chickens are cuter and their argument would be equally valid.\n\n>Their eggs are superior - typically larger, better for baking, and people with egg allergies can often actually eat them.\n\nIf their eggs were truly superior, the egg industry would reflect that.",
            "title_similarity": "0.9014426",
            "sentiment_compound": 0.9857
        },
        {
            "id": "gzsjs07",
            "score": 1,
            "text": "Animals are not here for us to use as mere means to an end, and you don’t need their eggs or meat to survive. The only reason is fun and taste pleasure, not good enough.",
            "title_similarity": "0.57403356",
            "sentiment_compound": 0.6802
        },
        {
            "id": "gzroxnu",
            "score": 12,
            "text": "Ducks are obligatory rapists. If you see a male duck on another duck, it's fucking them.",
            "title_similarity": "0.6374219",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzrzpv8",
            "score": 0,
            "text": "Counterpoint: ducks are known rapists. If you can ignore the curlicue-ification of the duck penis in its eternal search for the reluctant duck pussy, then peace be upon you.",
            "title_similarity": "0.7136618",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzrzs7x",
            "score": 0,
            "text": "NAH BRAH THEY MAKE TOTAL MESS OF WATERS",
            "title_similarity": "0.17121504",
            "sentiment_compound": -0.4927
        },
        {
            "id": "gzsewxo",
            "score": 0,
            "text": "Ducks suck. I had some ducks and chickens. Chickens are like dogs, they're super clever, they come and sit on your lap and are affectionate. Ducks are horrible pets. I raised them from babies and they were always scared of me, no matter what I did the best I got was cautious acceptance. Also you get used to crowing (which only roosters do so it's super easy to avoid) but I could never ever get used to the 24/7 quacking which is so much louder than you realise. Also ducks suck at self defence so you need a dog or something to protect them while chickens are more nimble and some roosters get pretty tough so they can fight off some predators. I prefer the taste of duck and the babies are cuter but as a pet they are way worse than chickens.",
            "title_similarity": "0.8707262",
            "sentiment_compound": 0.7217
        },
        {
            "id": "gzvd0rx",
            "score": 1,
            "text": "Won me over with your \"pecking to death like assholes\". Ducks it is.",
            "title_similarity": "0.53690255",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzuavv2",
            "score": 2,
            "text": "Well, if you have ducks, then chances are you will type duck more often and then when you go to type fuck your phone will autocorrect it to duck more than it already does and that really ducking pisses me off.",
            "title_similarity": "0.73004556",
            "sentiment_compound": -0.507
        },
        {
            "id": "gzrzgm2",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.08714974"
        },
        {
            "id": "gzs46jl",
            "score": 5,
            "text": "Ducks do not lay year round. Their larger eggs mean they cannot be substituted directly in baking without math. Their higher fat content also makes some uses in baking impractical. They are also often more aggressive toward humans that chickens are, particularly if you are collecting eggs.",
            "title_similarity": "0.80078876",
            "sentiment_compound": -0.2247
        },
        {
            "id": "gzs9518",
            "score": 5,
            "text": "They can be complete assholes to other ducks. If you want more than one avian pet chickens tend to be cool with each other. \n\nThe real pet winner are geese. If you raise them they can be so loving (african wild geese, not those fucking bastard canadian geese)",
            "title_similarity": "0.8410958",
            "sentiment_compound": 0.8924
        },
        {
            "id": "gzs65wp",
            "score": 179,
            "text": "Ok I can finally chip in. Ducks are so Fucking stupid and easy to kill. Their main self defense is diving into the water, or swimming away. If you don’t have a deep pond, all of your neighborhood critters will be dining on duck. \n\nYou can trap/kill most of the mammals that are eating your ducks. But you can’t shoot your neighborhood eagle for eating your incredibly stupid, loud, delicious ducks. \n\nMy dogs/turkeys/geese can typically protect my chickens from predators but the ducks are impossible to protect.  \n\nOh and they’re disgusting. They need some form of water for enrichment and if you have anything less than a large riparian ecosystem, their disgusting little bodies will instantly muck up the pool you created for them. A duck has to spend approximately 45 seconds in a kiddie pool to shit/piss/muck it into a black sewage pit. \n\nI hate ducks.\n\nEdit: I mentioned this in another comment but I will give a greater detailed explanation \n\nYou have no idea how traumatic it was. \n\nI’ll take you to young, naive, duck loving me. I finally bought my first farm and I was so excited to raise all of these animals. 10 acres of my own land to do as I please, in SW Montana. \n\nI was literally giddy when my shipment of ducklings arrived in the mail. I made the perfect brooder so that they would be happy, healthy adults. \n\nI gave them all types of fun treats (cut up grapes, mixed greens, some grain, bird food). \n\nThen as they left the brooder as adults. I got them a little swimming pool, little duck nesting boxes, other fun duck activities. \n\nThen my life became constantly cleaning out their shit infested pool. Helping them when they got stuck places, because they’d go inside some building and forget how to get out. Then scream bloody ducky murder. And I watched heart broken as they one by one got murked by predators. \n\nI remember visibly when I was in the phone with my husband and all of a sudden heard quacking over the phone that kept getting louder and more frantic, then slowly heard it become fainter. \n\nI asked him what happened and he mentioned that an eagle just grabbed a duck. \n\nOur chickens had a rough time but kind of figured it out and the smart survived. The turkeys were small dinosaurs that did incredibly well and for the most part would protect our other birds. The geese would also protect the birds and became blood thirsty for deer meat at one point. \n\nBy fall time, we had no ducks left (out of 20) despite our best efforts.",
            "title_similarity": "0.79084176",
            "sentiment_compound": 0.4059
        },
        {
            "id": "gzrs3ge",
            "score": 275,
            "text": "What constitutes a \"better farm animal\" really can't be looked at outside of the economics of farms, because farms are businesses in the trade of efficiently generating food for people that meet the people's needs at the best price. \n\nAs long as chicken meat and chicken eggs are more popular, and as long as feeding chickens is more efficient in yield of market product per dollar input, ducks will never be \"better farm animals\". Their behavior, cuteness, etc., is only relevant to the degree that it helps or harms selling meat and eggs. \n\nDucks' supposedly \"superior\" eggs are a value judgement I won't comment on except to say that the marketplace does not agree with you. People buying eggs want cheap protein that works well in a variety of recipes. Duck eggs being identifiably \"flavorful\" is actually a downside when you're baking with them, and the cost is higher (because of the yield).\n\nBut one of the biggest things against your thesis is, ironically, that ducks are indeed cuter. People don't like eating cute animals.",
            "title_similarity": "0.8332013",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gzrxpvo",
            "score": 14,
            "text": "Well, usually, I don't like my pets to have the ability to fly away from me.  Do you keep your ducks on a leash?",
            "title_similarity": "0.6044948",
            "sentiment_compound": 0.316
        },
        {
            "id": "gzs6f8n",
            "score": 82,
            "text": "Oh dear. Great thread! I sometimes have the chickens vs. ducks discussion in my circle of friends. \n\nOnce saw one male duck (adult) rape his dad. I am VERY VERY happy that no one recorded the look on my face when I witnessed that. Rape happened quite often, mostly to the females. It changed permanently how I see ducks.\n\nI also find our chickens more intelligent. They learn our behavioral patterns and draw conclusions based on their observations. They know when it‘s feeding time - they group in front of the door. The ducks got fed every day same time as well - always behaved like we‘re Mike Meyers.\n\nAnyway. I loved our ducks all the same (especially the females).",
            "title_similarity": "0.828107",
            "sentiment_compound": 0.9333
        },
        {
            "id": "gzroq5q",
            "score": 1398,
            "text": "Ducks are rapier and they lay less eggs.",
            "title_similarity": "0.55396724",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrqasp",
            "score": 410,
            "text": "I had another thought, from my limited experience with farm ducks they tended to lay their eggs anywhere in the yard, resulting in a more difficult gathering process and in the case of my friend, an egg sucking dog.",
            "title_similarity": "0.71036667",
            "sentiment_compound": -0.1263
        },
        {
            "id": "gzry1v1",
            "score": 6,
            "text": "Someone already mentioned ducks are pretty rapey\n\nBut I think the kind of duck is also worth distinction, I've heard mallards are especially dickish. (Beautiful though!)",
            "title_similarity": "0.750527",
            "sentiment_compound": 0.8888
        },
        {
            "id": "gzryfja",
            "score": 84,
            "text": "Ducks require a water resorvior to be happy, do they not? I see that as higher maintenance and why I went with chickens. High maintenance plus fewer eggs, and probably require more space (not sure on that one) in a pen, and more often cleaning the pen. Also, my chickens go to bed to roost at night, I don't have to chase them and put them away, they do it on their own. Do ducks do that?",
            "title_similarity": "0.8697313",
            "sentiment_compound": 0.428
        },
        {
            "id": "gzryhr2",
            "score": 3,
            "text": "Is there white meat on duck?\nI don't remember there was, it was all mostly reddish, which I loved.\n\nIf not, the breast is a matter of contention.\n\nI'm with you on the egg thing, what is gestation comparison between chickens and ducks for egg laying?\n\nAlso yes, chickens are dicks, ducks can be assholes though.  Some like to think themselves geese.",
            "title_similarity": "0.82657534",
            "sentiment_compound": 0.6966
        },
        {
            "id": "gzrz5xy",
            "score": 1,
            "text": "#3 is absolutely true! I can eat duck but not chicken eggs.",
            "title_similarity": "0.69019145",
            "sentiment_compound": 0.3266
        },
        {
            "id": "gzs0wds",
            "score": 5,
            "text": "How are ducks messier than chickens? City boy here.",
            "title_similarity": "0.61942124",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzs1bzc",
            "score": 7,
            "text": "They nip at you.\nTheir meat is all dark meat.\nThey don't produce many eggs.\nThey don't wear pants. (See Daffy Duck.)",
            "title_similarity": "0.58852994",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzs1upd",
            "score": 1,
            "text": "the chicken pecking is simple, isolate the abused hen until they're healed, and the bullying can be stopped by a rooster, who sets hens in line when theyre aggressive.\n\n&#x200B;\n\nadding to that, waking up at 4 am depends person to person in how shitty that is, for some, its great! for others, its not too good.\n\n&#x200B;\n\nalong with that, chicken breeds have MANY variants that can look equally as cute as a duck.\n\n&#x200B;\n\nducks lay less eggs than chickens.",
            "title_similarity": "0.8582755",
            "sentiment_compound": -0.8657
        },
        {
            "id": "gzs1wb2",
            "score": 1,
            "text": "Im convinced. Time to tell my boyfriend we're raising duckies",
            "title_similarity": "0.5662496",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzs3ilz",
            "score": 2,
            "text": "1- Well - the con of them being messy can actually a big one. You have to change their water several times a day which is quite wasteful. The ideal is to have a small pond but if you have a small garden it is not always possible. Whereas chicken need less space.\n\n2- They lay eggs less often that chicken and they are usually more “gooey”. Their eggs also have a lot more fat and cholesterol than chicken eggs (typ. 3 times more mostly due to the yolk size). One egg reaches already the daily cholesterol recommended dose.\n\n3- they are less compatible with other poultry, especially males. We had a male duck and chicken and he kept courting the chicken. But as ducks have a longer neck, he hit their head with such a force that broke their skull. But all males and newly introduced birds tend to fight as well so maybe this is not a strong point.\n\n4- they eat a looot. And they have less meat than a chicken.\n\nBut I love ducks - they are more affectionate !\nFor me, a great pet is also quails ! Even though they are also messy and lay small eggs ...",
            "title_similarity": "0.8131107",
            "sentiment_compound": 0.8934
        },
        {
            "id": "gzs3o5z",
            "score": 5,
            "text": "Info: Don't ducks NEED a drake to lay eggs? I may be mistaken on this but I'm not sure.\n\nChickens not only lay more eggs, you don't need a male for them to do it, so no chance of actually cooking and biting into a fertilized egg, which is nasty.",
            "title_similarity": "0.80472016",
            "sentiment_compound": -0.8771
        },
        {
            "id": "gzs51rg",
            "score": 1,
            "text": "I'm lucky in that when my chickens have blood visible, they're not pecked at more. I remember reading about that scary fact when I was new to raising chickens.",
            "title_similarity": "0.8068974",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzs5iih",
            "score": 1,
            "text": "Ducks eat slugs too, which is great if you have a garden. I am allergic to duck eggs, unfortunately.",
            "title_similarity": "0.77181184",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzs5kyt",
            "score": 5,
            "text": "I'm addressing point 1. Not all ducks are cute have you seen a [hemorrhoid duck](https://cdn.xxl.thumbs.canstockphoto.com/portrait-of-domestic-ugly-muscovy-duck-cairina-moschata-stock-photograph_csp48639892.jpg)? The [silke chicken](http://4.bp.blogspot.com/-3FyvP24-p1k/U28rt0d-rYI/AAAAAAAACw8/sAzdZD-OtNQ/s1600/keeping-Chickens-Silkies.jpg) is cute af and they're very friendly.",
            "title_similarity": "0.69654095",
            "sentiment_compound": 0.8588
        },
        {
            "id": "gzs5wdu",
            "score": 1,
            "text": "I'd rather clean chicken poop than duck poop!",
            "title_similarity": "0.69828033",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gzs6d2y",
            "score": 1,
            "text": "Duck poop is worse than chicken poop",
            "title_similarity": "0.6231688",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzs6u7m",
            "score": 1,
            "text": "I have a request for information from you as i own neither ducks nor chickens. \n\nI know that with chickens you can get automatic doors that are time locked, and that the chickens can then leave the coop in the morning and go back in before dark. I’ve heard this is nice because chickens want to be safe, they want to be inside before dark, so rarely if ever will a chicken be locked out of the coop. \n\nWill ducks do the same? Or would they sit outside waiting to get eaten by a fox or swooped up by a hawk? \n\nIf  the ducks don’t naturally go into their coop, and assuming what I’ve heard about the chickens is true, I’d say that’s a bonus for the chickens.",
            "title_similarity": "0.7708466",
            "sentiment_compound": 0.9146
        },
        {
            "id": "gzs7086",
            "score": 1,
            "text": "1. Ducks need water \n\n2. Even if the eggs are superior quality, the vast majority of recipes are for chicken eggs and need to be adjusted for the size and richness of duck eggs",
            "title_similarity": "0.7678892",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gzs75wa",
            "score": 1,
            "text": "I have had chickens and ducks. The chickens never attacked me but the ducks did.",
            "title_similarity": "0.7231692",
            "sentiment_compound": 0.1877
        },
        {
            "id": "gzs7kl0",
            "score": 41,
            "text": "Ok I have literally zero experience in poultry rearing but that's not gonna stop me from throwing my hat in the ring lol.\n\nI think ducks require bathing water, whereas chickens are dust bathers, so if one lives in a place that has very harsh winters and needs to confine their birds for the season, chickens would be the better farm animal to take care of.\n\nThe only other point I think it's debatable is the taste. I mean, I love a good roast duck but IMO duck is way fattier than chicken, a poultry I would feel guilty/overstuffed eating on a regular basis. Chicken meat could be preferable for people who want a less calorie/fat rich source of protein.",
            "title_similarity": "0.86693734",
            "sentiment_compound": 0.98
        },
        {
            "id": "gzs8s1j",
            "score": 9,
            "text": "i can’t change your view on this bc me and my chickens are offended",
            "title_similarity": "0.62094593",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzs964q",
            "score": 21,
            "text": "[deleted]",
            "title_similarity": "-0.04759556"
        },
        {
            "id": "gzs9uqu",
            "score": 1,
            "text": "Can ducks eat ticks in a wooded area",
            "title_similarity": "0.4741556",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsa0ym",
            "score": 1,
            "text": "Messier than *chickens?*",
            "title_similarity": "0.4366738",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsatv7",
            "score": 18,
            "text": "It’s complicated. \n\nWe eat a lot of chicken,  but you are right in that duck tastes better. Although, it could be because it is a treat and we don’t have it very often. I won’t the chickens or ducks we raise.\n\nI have had both as pets and backyard farm animals. Both of them are lively and have their personalities. They are both very fun to watch. Chickens learning how to scratch is hilarious. In my setting (not a farm), I cannot have a rooster so no early morning calls. The hens have no pecking order and often preen each other. 14 hens give me about 10-15 eggs per day so everyone in my life is pretty happy about that. Ducks do not lay as much but the ducklings are cuter.\n\nThe hens I have are given names and they hang out with us when we are outside. One likes to sit in a chair when we are eating and get hand-fed scraps. She knows her name and comes running when we call. I was never able to get ducks to act like that. I did have neighbor who raised a single duck and it was definitely part of the family. They would bring it to a local lake and it swam with them and snuggled them in their blankets.\n\nBoth ducks and chickens can be a bit mouthy, but when a duck is mad, they grab on and try to rip. It hurts more than a single peck.\n\nMessy- both are. Ducks are worse because it is this layer of green slime and it gets all over. You really have to work hard to keep their water clean. \n\nChicken breeds have traits that make them better or worse suited for pets, eggs, and food so it is hard to generalize about them too much. We have Barred rocks (super friendly), Buff Orpingtons (broody and take care of the flock), Rhode Island Reds (hang out with each other and are kind of aloof but great layers), and Easter Eggers (not much personality but colored eggs).\n\nTl;dr I love my chickens, but it’s complicated.",
            "title_similarity": "0.8759507",
            "sentiment_compound": 0.9947
        },
        {
            "id": "gzsbkyj",
            "score": 1,
            "text": "On the cuteness of chickens vs ducks. I'd say that in most cases, ducks are cuter. But I so think this is somewhat balanced out by the variety in chicken appearance, due to the practice of breeding them for show. There are showy ducks, yes, but I'd say among duck owners I've known, most of them had one of only a few breeds of duck, where each duck in the breed looks pretty much the same. Usually backyard chicken owners I've known owned runer ducks. If you are raising chickens you have more variety. There's silkies, which are cute and fluffy. Those ones with the puff ball afro heads, naked necks, americanas with their cute face/cheek feathers, and so on. There's just a lot of variety in appearance and coloration.",
            "title_similarity": "0.8366842",
            "sentiment_compound": 0.9645
        },
        {
            "id": "gzsc509",
            "score": 1,
            "text": "Ahhh because the multi billion dollar industry hasn't figured this out yet... thank God some Redditor gave them this information 😂",
            "title_similarity": "0.5085931",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gzscp49",
            "score": 1,
            "text": "wtf i didn’t know chickens acted that way.",
            "title_similarity": "0.4567448",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzsd1cl",
            "score": 1,
            "text": "I'm not saying it's right or that anyone ever should but you could tie blades to the roosters feet like they do in cock fights and have a home/farm defense chicken. The potential for weaponized chickens is there. Ducks not so much.",
            "title_similarity": "0.73806673",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gzsd83l",
            "score": 1,
            "text": "Why change a view that is obviously correct?",
            "title_similarity": "0.12904418",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzse006",
            "score": 1,
            "text": "Drakes have terrifying penises.  They're literally rapey acme-screw lookin' things that are often about half the size of their body (9-10\" in length).\n\nTo put that in perspective, imagine a human male with a post-hole auger for a penis.  No scaling required.  Just a 3ft long hole digger that ravaged any female within earshot.",
            "title_similarity": "0.5451906",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gzsebt4",
            "score": 1,
            "text": "I have been told that duck poop is way smellier and they will crap all over, even worse than chickens.",
            "title_similarity": "0.66054344",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzseqp8",
            "score": 14,
            "text": "Used to raise chickens, and you forgot one major pro of them: they can be hypnotized. If you put a stick in front of them, then hold them upside down, they will become transfixed in about 5 seconds. Then, you can lay them on their belly and they won't move until they hear a loud noise, like a clap. It doesn't hurt them, and they walk away like nothing happened. It's hilarious. We raised them when I was a kid, and my siblings and I would litter our front yard with hypnotized chickens.\n\nWe also never had problems with them pecking each other to death. Sometimes they would fight, but there was always enough food and space so it wasn't a big problem. This was true for both eating chickens and laying chickens.\n\nAlso, how could you not find peepers cute? I mean they're only cute for like 4 days before they start getting adult feathers, but I think a baby chick is easily as cute as a duckling. They are both yellow fluff balls.",
            "title_similarity": "0.7935072",
            "sentiment_compound": 0.9575
        },
        {
            "id": "gzsguw2",
            "score": 1,
            "text": "Well you are WRONG, nothing can beat cute chicken. They both are dinosaurs and will always be popular. Ducks are losing cause they are more expensive + aggressive as pets",
            "title_similarity": "0.81348157",
            "sentiment_compound": -0.7074
        },
        {
            "id": "gzshgh3",
            "score": 1,
            "text": "They definitely taste better. I’m all for it",
            "title_similarity": "0.33341867",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzsj6d2",
            "score": 2,
            "text": "I've owned both ducks and chickens, and I'd say it really depends on what you're looking for. Ducks are nice to watch, but that's pretty much it. They're messier, always shitting in the water, they smell worse, and they probably won't want anything to do with you. I raised a small herd of ducks and they were happier in their group than they were with me. They were a pain in the butt to herd, and getting to touch them was a rare privilege.\n\nMy chickens were generally quieter (we only kept hens) and all of my hens were content to cuddle with me. I'd go outside and sit down and they'd wander over and hop on my lap. Their water stayed much cleaner for much longer, they didn't smell as bad, and I actually noticed much more clearly distinguishable personalities from my hens than I did my ducks.\n\nAlso, when hens peck, it's usually painless and out of aimless curiosity. A duck chomping down on your finger HURTS.",
            "title_similarity": "0.8663872",
            "sentiment_compound": 0.7771
        },
        {
            "id": "gzso05i",
            "score": 31,
            "text": "Here is a slightly silly rebuttal.\n\nAlthough Ducks have many good qualities, they have a strong association with the University of Oregon. Chickens on the other hand are not associated with any collegiate or professional teams that I have a strong disdain for.\n\nUnfortunately, this also makes Huskies (UW) one of the worst types of dogs.\n\nGO COUGS!",
            "title_similarity": "0.7656152",
            "sentiment_compound": 0.4937
        },
        {
            "id": "gzso3y4",
            "score": 3,
            "text": ">1) They're significantly cuter. No offense, chicks, but ducklings will win every time. Even as adults they're hilarious to watch - they just stumble around all day long.\n\nYou don't pick farm animals based on cuteness you pick them based on return on investment.\n\n>2) They might have loud quacks, but there's no crowing to wake you up at 4AM. Every morning my chickens wake me up before the sun comes up, but my ducks are chilling the entire time.\n\nI've lived in a house that kept chickens unless you have roosters or your coop is next to your window it really shouldn't be an issue.\n\n>3) Their eggs are superior - typically larger, better for baking, and people with egg allergies can often actually eat them.\n\nWell that's your opinion but the facts are they lay way less eggs.\n\n>4) Their meat is delicious and just as versatile as chicken.\n\nAgain opinion and doesn't in any way make them superior to chicken just not worse I guess?",
            "title_similarity": "0.94754887",
            "sentiment_compound": 0.9907
        },
        {
            "id": "gzsol26",
            "score": 1,
            "text": "Ok, ok, ok. This is it. This post is it. My kids have been beggggging me for ducks for years. We have a pond and are flock folk (lots of chickens). \n\nMy problem is that I tend to “overbuild” and plan projects in my head and fuss over them. What’s a good/quick/easy duck house idea that is Fort Knox-like at night? (Lots of crafty predators around here). I have a lot to accomplish already this summer and can’t sacrifice a lot of weekend!",
            "title_similarity": "0.7722744",
            "sentiment_compound": 0.1007
        },
        {
            "id": "gzspg2l",
            "score": 1,
            "text": "chickens cant migrate...or can they?",
            "title_similarity": "0.4682297",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsrn7f",
            "score": 8,
            "text": "Love the silly topic, and like you I’m more partial to ducks, however I will attempt to change your view here. In my experience chickens are wayy more predictable as pets than ducks. Ducks get difficult because they are more capable of mischief than chickens, plus they have some really odd behaviors, and the rapey stuff is a problem for most. Just to provide an anecdote for the behavior stuff I’m talking about: I have a good friend whose kept chickens for a long time, and they’re about as predictable as pavlov’s dogs at this point. Another friend of mine has a kid who really wanted ducks, so they got some. One day the kid saw two of the ducks “taking turns biting each others butts” and thought it was good fun. Until she looked closer, and saw that they were actually shitting into each others mouths. Turns out the ducks had found and eaten some weird berries and got really sick, but wouldn’t stop eating each other’s shit, (because it had the berries in it and I guess they were delicious berries, even post digestion) and that made them more sick. They only way to stop the vicious cycle was to forcibly separate the ducks and then watch them very carefully and move them as soon as they shat because they tried to eat their own shit too. Needless to say, this scarred the kid who wanted the ducks in the first place. Didn’t take long for them to see a duck rape another too :(",
            "title_similarity": "0.8919452",
            "sentiment_compound": -0.9775
        },
        {
            "id": "gzsrrqc",
            "score": 2,
            "text": "As someone raising silkie chickens, youre absolutely wrong about them terrorizing members of the flock with blood and/or wounds.   A raccoon reached its arm into their pen the other night while one was sleeping near the edge and tore her wing right off.  All the other chickens cuddle her at night now and actually helped her regain her balance so that she didnt stumble around when she walked.",
            "title_similarity": "0.775229",
            "sentiment_compound": -0.7902
        },
        {
            "id": "gzsss42",
            "score": 1,
            "text": "So, I've raised a few hundred ducks in my time on the farm. They are generally pretty awesome.\n\nBut they crap everywhere. And the turds are bigger than chickens. Also, usually soft. Dear god, it is a mess.\n\nAnd if you \\*ever\\* let them learn where a pond is, they will never, ever stop making expeditions there, or trying their damnedest. If you have, lets say, a pool you would prefer were crap free for your swimming enjoyment, this poses a problem.\n\nAlso, even for tame ducks, a few of them are likely to fly off and join wild ducks if you live on a migration route. Most Rouen and such get too fat, but there are exceptions.",
            "title_similarity": "0.83177674",
            "sentiment_compound": 0.8286
        },
        {
            "id": "gzstapc",
            "score": 1,
            "text": "Never had ducks, but chickens are pretty much the ideal animal for turning scraps and crap into food. They love digging through compost piles and goin after bugs in the garden. \n\nThe only more ideal farm animal is the pastured pig- Berkshires and Red Wattles especially. They absolutely obey electric fences, they eat damn near everything, churn and rut the soil, and taste fuckin fantastic. Rabbits are a good third, very easy to breed and keep, but there's annoying laws around rabbit meat in the US. They are not classified as a livestock animal but pets, so I can't sell you rabbit meat by the pound, I sell live rabbits and butcher them for you, it's wierd.",
            "title_similarity": "0.7845195",
            "sentiment_compound": 0.9793
        },
        {
            "id": "gzsvwuo",
            "score": 1,
            "text": "Duck's are dumb as shit and their egg production does not keep up with human needs.",
            "title_similarity": "0.6583717",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gzsw7sn",
            "score": 1,
            "text": "Aren't ducks super rapey to the point that females have fake vaginas?  Or is that a different animal?",
            "title_similarity": "0.5791141",
            "sentiment_compound": -0.7654
        },
        {
            "id": "gzsxeqz",
            "score": 1,
            "text": "Ducks are cute but chickens are  gorgeous \n and I personally prefer chicken eggs I find duck eggs too rich \n\nAlso duck penises are terrifying",
            "title_similarity": "0.83096445",
            "sentiment_compound": 0.81
        },
        {
            "id": "gzsxxzm",
            "score": 1,
            "text": "I know this is a very minor part of the view, but as it's a lighthearted one, I think it's fair game:\n\nThe prevalence of people with known chicken egg allergies is qlmost certainly due to the prevalence of people who regularly eat chicken eggs. I think you'll find that just as many people would find they are allergic to duck eggs but not chicken eggs if everyone tried both, or at least they'd develop them at similar rates if both types of egg were as common.",
            "title_similarity": "0.859424",
            "sentiment_compound": 0.7876
        },
        {
            "id": "gzsyey0",
            "score": 1,
            "text": "Ducks are way better for all the reasons you shared. But in terms of ease of care, chickens are cheap, eat anything, don’t need much space, and practically throw eggs at you all day long.",
            "title_similarity": "0.8387019",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gzsz1x9",
            "score": 1,
            "text": "Ducks foul (contaminate) your dam.\n\nEnd of story.... Not really but it's a major point. \n\nChooks are more flexible with their environment, they will happily wander through big grass and light scrub where ducks prefer open spaces. \n\nChooks probably get a wider variety of pests than ducks do. \n\nAnd not a point for either but Guinea Fowl are the superior bird",
            "title_similarity": "0.8108703",
            "sentiment_compound": 0.9252
        },
        {
            "id": "gzsz7qg",
            "score": 1,
            "text": "Ducks are noisy and mean. Also very rapey. Male ducks are one of the few kinds of birds with a penis and it's a grotesque, corkscrew-shaped terror.\n\nThey *are* delicious, but I would eat duck even it it only tasted okay.  Because they are **bad animals** and deserve to be eaten.",
            "title_similarity": "0.77809036",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzsz8r5",
            "score": 5,
            "text": "what stops the ducks from flying away?",
            "title_similarity": "0.41234618",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzszm0d",
            "score": 1,
            "text": "About the allergy thing, I'm allergic to duck and goose eggs to the point where I will vomit the entire contents of my stomach",
            "title_similarity": "0.6204091",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzt1mqw",
            "score": 1,
            "text": "Ducks are disgustingly messy animals",
            "title_similarity": "0.43947297",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzt1q2q",
            "score": 1,
            "text": "Ummm, have you ever had to keep your critters' water clean when they share it with ducks?  Ducks dig in the dirt with their bills and then rinse it off with water and it makes it muddy!",
            "title_similarity": "0.62714565",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gzt4cny",
            "score": 1,
            "text": "My ex's duck used to rape her chickens.... so that part wasn't great",
            "title_similarity": "0.68209517",
            "sentiment_compound": -0.8399
        },
        {
            "id": "gzt5oay",
            "score": 1,
            "text": "Chickens eat the bugs on your land. Let em run around your yard and you and your kids will be tic free. They also will be waiting at the coop for you everyday at the same time as long as your consistent about it. Chickens lay more eggs.",
            "title_similarity": "0.70142055",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzt69v1",
            "score": 1,
            "text": "Never heard a chicken crow",
            "title_similarity": "0.43926707",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzt6cj9",
            "score": 1,
            "text": "Duck poop smells so much worse. Nothing quite like it.",
            "title_similarity": "0.5180423",
            "sentiment_compound": -0.6913
        },
        {
            "id": "gzt7ic5",
            "score": 1,
            "text": "If you consider that they will subconsciously want to leave you once a year. And have the Hope that the saying if you love something let it go is true it will always come back.",
            "title_similarity": "0.45559597",
            "sentiment_compound": 0.875
        },
        {
            "id": "gzt82vs",
            "score": 1,
            "text": "YES",
            "title_similarity": "-0.18981826",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzt9034",
            "score": 1,
            "text": "Duck isnt as good to eat and they dont lay nearly as many eggs.",
            "title_similarity": "0.61066175",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gzt98ks",
            "score": 1,
            "text": "Wouldn't the ducks just fly away?",
            "title_similarity": "0.36952123",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztagpc",
            "score": 1,
            "text": "I love ducks but when I had them did not enjoy the jets of diarrhea they fire out their ass or how they make an absolute mess of the water. Seriously, they are messy in ways you will never understand as a pet owner. Chickens are damn near spotless in comparison.",
            "title_similarity": "0.8151274",
            "sentiment_compound": -0.9674
        },
        {
            "id": "gztchwr",
            "score": 1,
            "text": "Plus, getting to see the little floppy stompers that ducklings have while they run all over the place is adorable.\n\nAnd, if you're collecting eggs for food, duck eggs taste better.",
            "title_similarity": "0.806768",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gztelqp",
            "score": 1,
            "text": "I would counter that chickens are better from a more utilitarian standpoint.  While they’re about equal in egg production, chickens will return to their nesting boxes to lay while it’s more a game of hide and seek with the ducks. Chickens will also eat a wider variety of food and are great for disposing of kitchen and garden scraps. \n\nIf you have crops in addition to livestock the chicken is king/queen, enough chickens will keep fly populations under control by eating maggots, clear out all sorts of pests (including weevils) from you plants, and their propensity to dig/scratch at the ground can turn the soil and prepare a bed for planting.  Their manure is also better suited for fertilizer than ducks. \n\nI put to you, that while ducks are cute and charming, and certainly have their place on a balanced farm, the chicken reigns supreme.",
            "title_similarity": "0.7952281",
            "sentiment_compound": 0.9738
        },
        {
            "id": "gztg0h2",
            "score": 1,
            "text": "Cons: ducks can just fly away.",
            "title_similarity": "0.45201296",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztg3gk",
            "score": 1,
            "text": "I heard ducks rape just about anything that moves",
            "title_similarity": "0.51389205",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gztj7v2",
            "score": 1,
            "text": "As someone who has had both, and prefers chickens, I was prepared to disagree with you. But all your points are true, other than the cutenesses, which is entirely subjective. I still love my dinofloofs most though!",
            "title_similarity": "0.81598294",
            "sentiment_compound": 0.9359
        },
        {
            "id": "gztjz8t",
            "score": 1,
            "text": "I've watched a duck murder another duck. They just can't do it on land, they do it by drowning the other one. Duck fights are pretty common and often deadly",
            "title_similarity": "0.64486885",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gztkg3m",
            "score": 1,
            "text": "Ducks are rape crazy assholes",
            "title_similarity": "0.53151655",
            "sentiment_compound": -0.8979
        },
        {
            "id": "gztleso",
            "score": 1,
            "text": "Ducks are superior:\n\n1). They can fly\n\n2). They can swim \n\n3). They can dive underwater\n\n4). They can walk on land",
            "title_similarity": "0.567348",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gztmagb",
            "score": 1,
            "text": "Ducks. Fucking. Stink.",
            "title_similarity": "0.2755803",
            "sentiment_compound": -0.4576
        },
        {
            "id": "gztn9fv",
            "score": 1,
            "text": "Also, they don’t pick at seedlings as badly, that’s why I want ducks over chickens. I want the pest gone not the seedlings and plants",
            "title_similarity": "0.74788815",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gztnz15",
            "score": 1,
            "text": "Ducks:\nRape.\nDead ducks.\nLame legged ducks. Because of rape.\nHiding eggs.\nNot friendly.\nShit in the pond.\nDestroy flowers.\nEat ticks.\n\nChickens:\nSit on my shoulder.\nGo to bed automatically.\nLay in the same place.\nDestroy flowers.\nTend to be hardy.\nFollow the mower.\n\nWe had one duck survive the hatching night. We got him a baby chick for company. Baby duck and baby chick were best friends for a year. Then randomly something are baby duck's head. Baby chick was distraught. \n\nWe've managed to get the ducks to go to bed at night now.. they were willing after two murders in two days.",
            "title_similarity": "0.72642237",
            "sentiment_compound": -0.975
        },
        {
            "id": "gztpyo0",
            "score": 13,
            "text": "Coming from someone who has both chickens and ducks, chickens are way better pets. I do not care one bit about the production capabilities of either bird, so I will be focusing on  pet quality. \n\n1. Ducklings and chicks are equally cute, but adult chickens are 3000 times cuter than adult ducks, male and female. Seriously, roosters have eyebrows. \n2. Easy. Don’t have roosters. Or keep their pen farther away from your window. \n3. This is mostly true, but as I said I do not care for production qualities.\n4. I don’t eat poultry, so I wouldn’t know. \n5. That is very strange. My chickens do not attack other injured ones unless they are overcrowded or out of food. \n\nAdditionally, like you said, chickens are a lot cleaner. If I’m going to go out to hold my birds, I don’t want to smell muddy poop water. The only way to keep ducks smelling nice is by cleaning their swimming dish every day. \n\nThere is also a lot more genetic diversity among chickens. There are hundreds upon hundreds of chicken breeds and varieties, whereas ducks are considerably more limited in looks. Chicken shows are more enjoyable than duck shows for this reason. \n\nI have also had much better luck with friendly roosters than friendly drakes. I have also had many more roosters than drakes, so that might influence this mental statistic. \n\nDrakes will rape and kill female chicken hens, but roosters cannot do the same to female ducks and usually don’t try. \n\nSorry if any of this came across as rude; it is meant to be a friendly disagreement. I am autistic and take my love for chickens very seriously. I have had hundreds of chickens over the years and have loved each one individually.",
            "title_similarity": "0.87840104",
            "sentiment_compound": 0.9865
        },
        {
            "id": "gztqq5a",
            "score": 1,
            "text": "Fun fact: many farmers in Bangladesh have switched from raising chickens to raising ducks. This is because the country is very prone to flooding, and ducks will float with the flood water, whereas chickens risk drowning and being swept away.",
            "title_similarity": "0.72159314",
            "sentiment_compound": 0.296
        },
        {
            "id": "gztqr1m",
            "score": 1,
            "text": "the real question is: does duck shit smell any less fowl than chicken shit? because that would be an instant win for me.",
            "title_similarity": "0.78509676",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gztrnpz",
            "score": 1,
            "text": "Not really an argument against it, but I’m actually allergic to duck eggs but not chicken eggs. So for someone like me who wants eggs, Ducks wouldn’t work.\n\nEdit: Oh, also, ducks are way more upkeep because of their need for water, which you have to change regularly (since they poop in the water). So there’s a lot more work there, unless you have a pond. But if you have a kiddie pool or some  thing, you’ll be changing it on a daily basis. \n\nAlso, many ducks can fly while chickens don’t tend to.",
            "title_similarity": "0.860656",
            "sentiment_compound": 0.3619
        },
        {
            "id": "gztsxl5",
            "score": 1,
            "text": "Ducks are prettier birds, but I prefer the taste of chicken meat & eggs",
            "title_similarity": "0.7736716",
            "sentiment_compound": 0.2617
        },
        {
            "id": "gztvfyt",
            "score": 1,
            "text": "My ducks did kill one of the others after he developed a bald patch on his back :/",
            "title_similarity": "0.5320406",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gztvtu1",
            "score": 1,
            "text": "And I heard ducks float if the area floods. This is a huge selling point to farmers is flood prone regions.",
            "title_similarity": "0.5893449",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gztyuk6",
            "score": 1,
            "text": "I agree with you everything except eating them",
            "title_similarity": "0.3490969",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzu1m3v",
            "score": 1,
            "text": "Duck shit is way worse than chicken shit. And the eggs aren’t as good. Roosters aren’t hens and hens don’t go wild every morning. Duck meat has a lot of oil and fat. Pecking order isn’t really something concerning if you know how to control it.",
            "title_similarity": "0.82345444",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gzu25k7",
            "score": 1,
            "text": "I put a grow lamp in the enclosure for the ducks in winter and one in their yard, they lay all year long..... of course I broke my arm falling on the ice when they splashed their water all over.",
            "title_similarity": "0.49494487",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzu44hb",
            "score": 1,
            "text": "Have you had fresh duck egg pasta? It’s super good, better than regular eggs",
            "title_similarity": "0.686515",
            "sentiment_compound": 0.9001
        },
        {
            "id": "gzu4hrj",
            "score": 3,
            "text": "If your chickens are pecking each other to death, you need to give them more room, isolate the injured ones and give them ample time to heal.  If you don't, you're no better than people who fight dogs.\n\nWith that said, ducks are extremely messy.  They also don't print well on humans without a lot of work, so don't expect to be able to pick them up and pet them like chickens.  Basically, expect a cat with wings (ducks) opposed to a dog with wings (chickens).\n\nDuck eggs are very tasty, you're right.  They are also very hard to crack and the whites are extremely rubbery, which makes many dishes feel and taste off.\n\nI'd argue that duck is far less versatile as a lean, dense, red meat.  You're quite limited in what you can do with it.  It goes very tough very quickly, and gets gamey very easily.  Improper cooking technique can lead to a tough and dry meat with a slimy fat layer.  Properly cooked, medium rare with a crispy seared skin, duck is fantastic.\n\nYou don't need a rooster for chickens to lay eggs, so no crowing necessary.  You do, however, need hens for duck eggs, and for most species of farm ducks, you will have very loud and piercing quacks all day and night.  You could get around that with muscovy ducks, who don't quack, but now you've just limited yourself to one single species.",
            "title_similarity": "0.8443652",
            "sentiment_compound": -0.8442
        },
        {
            "id": "gzu5in3",
            "score": 1,
            "text": ": (",
            "title_similarity": "-0.15467927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzua2sz",
            "score": 1,
            "text": "Don't the males have a crazy detachable corkscrew.. you know?",
            "title_similarity": "0.36217332",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzuagsa",
            "score": 1,
            "text": "They certainly taste better than chicken.",
            "title_similarity": "0.59571195",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzubtzf",
            "score": 1,
            "text": "Ok so how’s this. What about a goose. The wee baby goslings are affectioned and trust me on this one my after my dad rescued a lost gosling the little critter would always snuggle up to my dad when he’s holding the little fellow. You might even make the goose a guard pet judging how mean geese can be.",
            "title_similarity": "0.72557735",
            "sentiment_compound": 0.8316
        },
        {
            "id": "gzuckz3",
            "score": 1,
            "text": "All ducks goto bed.",
            "title_similarity": "0.33804935",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzud2ao",
            "score": 1,
            "text": "Duck meat sucks compared to chicken",
            "title_similarity": "0.60119605",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzue2zj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.08714974"
        },
        {
            "id": "gzuf6a5",
            "score": 1,
            "text": "Also chickens lay eggs in one spot to form a nest. Ducks just lay their eggs wherever so it’s a hastle to retrieve them on a farm",
            "title_similarity": "0.6289567",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzuft5z",
            "score": 1,
            "text": "Our chickens were escaping their fenced in yard and getting picked off by coyotes. My Dad marked the escapees so he could find which ones were getting out. His mistake: Marking them in red 😵",
            "title_similarity": "0.5726005",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzuh16f",
            "score": 1,
            "text": "I worked on a chicken ranch. Had 14 barns 7k chickens in a barn. that I cared for. I hate chickens.",
            "title_similarity": "0.5874007",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzui0kv",
            "score": 1,
            "text": "Chickens will dig up your soil and fertilise your garden, which if you grow veggies is amazing. They do the hard work of preparing your beds for you. \n\nDucks will eat the slugs and snails in your garden which is fantastic if you are growing lettuce, but they are far messier, which makes it harder to keep your garden in a decent state that you would actually want to eat veggies out of.",
            "title_similarity": "0.7572376",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzulhog",
            "score": 1,
            "text": "Duck penises, that's all I'm going to say.",
            "title_similarity": "0.4132414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzumbvb",
            "score": 1,
            "text": "I wonder if chickens are better at protecting their flock from animals like hawks - I've seen roosters kill predators, but I haven't heard of ducks doing the same yet.\n\nDucks seem extremely well fitted to rice paddies, they do a fantastic job of pest control. Chickens may have their place in the right kind of farm.",
            "title_similarity": "0.8216191",
            "sentiment_compound": 0.8334
        },
        {
            "id": "gzunvud",
            "score": 1,
            "text": "Duck make good pet. Duck is for eat",
            "title_similarity": "0.6013055",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzuo8im",
            "score": 1,
            "text": "The shits, backyard birdkeeping\n\nI've had 1 duck & 3 chickens\n\nThe duck was anxious, but otherwise chill\n\n2 sets of birds\n\n1 chicken 1 duck\n\n2 chickens\n\nThe chickens . . . We got 2 from a butcher & one was mean, the other was happier when the racoons disappeared the bully\n\nNeeding to change more water?",
            "title_similarity": "0.7855022",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzuoac7",
            "score": 1,
            "text": "I live in a metropolis, but have always wanted a chicken coop if I ever get a house. Strongly considering ducks now too.",
            "title_similarity": "0.69614613",
            "sentiment_compound": 0.3919
        },
        {
            "id": "gzupadj",
            "score": 1,
            "text": "Agree, except that duck penises are objectively terrifying.\n\nDon’t want, just for that.",
            "title_similarity": "0.55932724",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzus96a",
            "score": 1,
            "text": "My male duck has tWo hens but the raping became awful, one hen and the drake would hold down the other female and they pecked her eye out! We had to separate them. \nGive me chickens any day. They recognise their humans and have way more character than ducks.",
            "title_similarity": "0.8170818",
            "sentiment_compound": -0.9184
        },
        {
            "id": "gzusgen",
            "score": 1,
            "text": "So many shills posting Duck propaganda.",
            "title_similarity": "0.4941555",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzushjs",
            "score": 1,
            "text": "I don't know whether this is the same with chickens, but you always need to get more than one duck because ducks are social animals and will get lonely if you only have one. They also breed aggressively where the male can frequently hurt female ducks so you need to be careful. \n\nYou may also find that ducks need some resevoir of water to stay happy.\n\nI've heard they're a lot more difficult to take care of compared to most domestic animals and you have to be ready to take on a lot of responsibility.\n\nI love ducks, but I would never get a few as pets. I like to feed the neighbourhood ducks some birdseed from time to time and cover our drains so the ducklings don't fall in through the gaps.",
            "title_similarity": "0.84262943",
            "sentiment_compound": 0.8768
        },
        {
            "id": "gzutq3i",
            "score": 1,
            "text": "Either way they make a great supper! /s",
            "title_similarity": "0.38023472",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gzuvapf",
            "score": 1,
            "text": "Chicken meat is more bland hence you can make it in more different ways. Duck has a taste.",
            "title_similarity": "0.6765172",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzuwb9v",
            "score": 1,
            "text": "Hey friend, actually went through this with my SO on an acreage. She loves the ducks, but in a climate where it gets freezing in the winter, the amount of water (this breed, anyway) needs means even cutting it down as much as possible the coop is an absolute mess through the colder months. Water and mess frozen together, the coop becomes a muggy mess as the water stays on the edge of freezing and thawing because of the heat lamps, it builds up and has to be removed... she’s gone back to chickens because it’s just a lot to manage.\n\nThey may not be cannibalistic in the same way chickens are, but they DID peck one of their own to death as well, for the farm cats to drag away...",
            "title_similarity": "0.71683824",
            "sentiment_compound": -0.9468
        },
        {
            "id": "gzv3ucn",
            "score": 1,
            "text": "Question and kind of a point if somebody knows- do ducks eat ticks like chickens do? If they don’t then that would be an advantage for chickens I would think",
            "title_similarity": "0.7378888",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzv491v",
            "score": 1,
            "text": "ducks are the biggest morons in the world. they eat everything. One of mine died after drinking used motor oil from a pan in the driveway. You can’t get them back inside after they figure out there’s water outdoors, and they are far too dumb to be safe from predators. And lastly, they lay their eggs anywhere they feel like, and then they bury them. So you can never find them.",
            "title_similarity": "0.670259",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzv5duo",
            "score": 1,
            "text": "I've found that chickens, (hens at least) are much more sociable than ducks.\n\nAnd spot on for #5. We've used pine-tar to seal up a wound to avoid further picking.",
            "title_similarity": "0.79006344",
            "sentiment_compound": 0.2484
        },
        {
            "id": "gzv6sxx",
            "score": 1,
            "text": "Why would I change a correct opinion?",
            "title_similarity": "0.1274854",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzv8hxy",
            "score": 2,
            "text": "Having had duck eggs recently, I’m beginning to favour them over chicken eggs.  Slightly gamy, smoother texture, goes down easily, scrambles as SOON as you put ‘em in the pan.",
            "title_similarity": "0.7828225",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzv9sn6",
            "score": 1,
            "text": "I recently lost my pet duck Minnie to a savage raccoon attack. She was the love of my life... I have lost dogs before and nothing compares to the love I felt for that duck... She hugged me and only wanted blueberries in return.\n\nMoral of the story: QUACK, QUACK, QUACK, QUACKKK",
            "title_similarity": "0.73666203",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzvc48i",
            "score": 1,
            "text": "Cept for the gang rapes/murder rapes they do to each other",
            "title_similarity": "0.22472748",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzvcaw8",
            "score": 1,
            "text": "\"Their meat is delicious and just as versatile as chicken.\" HARD disagree. I really wanted to like it, but it's just greasy and the flavor is gamey regardless of preparation.",
            "title_similarity": "0.71835417",
            "sentiment_compound": 0.2181
        },
        {
            "id": "gzvemzu",
            "score": 1,
            "text": "I started laughing when I started reading the post but then I found a kinda contradiction in there. \n\nYou choose ducks over hens for them eating a fellow chick, but at the same time you eat your fellow pets!! \n\nP.S. A vegetarian here so I have quiet a different view on it, but OP totally respect your view.",
            "title_similarity": "0.82530963",
            "sentiment_compound": 0.7362
        },
        {
            "id": "gzvl5ac",
            "score": 1,
            "text": "As a vegan, ducks are simply just a much cuter animals.\n\nAlso. We had farm chickens, male and female, and they didn't wake us in the morning",
            "title_similarity": "0.8182431",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzvm57g",
            "score": 2,
            "text": "> 1. They're significantly cuter.\n\nOh, yeah.  Even adult ducks are adorable.  Chickens look like feathered meth-heads.\n\n> 2. They might have loud quacks, but there's no crowing to wake you up at 4AM.\n\nI did not realize ducks sleep through the night.  I hate day-time animals making noise at night (dogs, chickens).\n\n> 3. Their eggs are superior - typically larger, better for baking, and people with egg allergies can often actually eat them.\n\nI did not know that.\n  \n> 4. Their meat is delicious and just as versatile as chicken.  \n\nDuck meat is sooo good.  Yesterday I bought half a roast duck for $12.  It was lunch and dinner.  Mmmmmm.\n\n(I feel a bit guilty about eating duck, because of point (1), but it is just so tasty...)\n\n> 5. (Mild gore warning) Chickens will cannibalize\n\nYeah, chickens suck.  And cows.  They are the worst.",
            "title_similarity": "0.9310174",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gzw69pm",
            "score": 1,
            "text": "There is this famous chicken (yeah, I know) that laid a egg a day for a year!",
            "title_similarity": "0.56251085",
            "sentiment_compound": 0.3595
        },
        {
            "id": "gzw6mz8",
            "score": 1,
            "text": "The color of the yoke comes from the eye lids, feet/legs and bill, which all are colored by he feed (corn). In Texas they feed more millet and so the egg yoke is whiter.",
            "title_similarity": "0.52031505",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw6rb4",
            "score": 1,
            "text": "I have seen red sunglasses on chickens so they wouldn’t pick a blood spot!",
            "title_similarity": "0.6346048",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw77wt",
            "score": 1,
            "text": "Duck need a water access (pond or whatever ) to be happier. Which is less practical than chicken. I wouldn’t have ducks without somewhere they can swim.",
            "title_similarity": "0.7419121",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzw8g0e",
            "score": 1,
            "text": "They have gotten the chicken breast so large that that have to “milk the roosters and AI the hens.",
            "title_similarity": "0.6942929",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw9ngq",
            "score": 1,
            "text": "Ginny hens… they’re heat watch dogs!  One of mine was sitting on top of my 25’ TV antenna",
            "title_similarity": "0.50517726",
            "sentiment_compound": 0.2714
        },
        {
            "id": "gzwa072",
            "score": 1,
            "text": "A long time ago you could win baby ducks and chicks at the Fair. We won two ducks and kept them on the inclosed porch. They made such a mess. We gave them to some farmer friends, and after a while they gave us eggs!",
            "title_similarity": "0.76474476",
            "sentiment_compound": 0.8932
        },
        {
            "id": "gzxeuce",
            "score": 1,
            "text": "The biggest hurdle is that while the meat is \"versatile\" it's hardly a substitute. Chicken and duck are very different meats.  Duck tends to be a lot fattier and the fat carries a flavor that some people find off putting.  They're quite a few chicken lovers out there who simply can't abide the taste of duck, though I happen to enjoy it.",
            "title_similarity": "0.83032393",
            "sentiment_compound": 0.765
        },
        {
            "id": "gzxnp9w",
            "score": 1,
            "text": "Chickens are what the American palate is more used to, but I do like wild duck meat. Also, chickens are generally easier to factory farm and get a lot more meat from one animal.",
            "title_similarity": "0.7814648",
            "sentiment_compound": 0.7876
        },
        {
            "id": "gzyt2ue",
            "score": 1,
            "text": ">They might have loud quacks, but there's no crowing to wake you up at 4AM\n\nOmg it's the opposite for me. My chickens are asleep but my ducks would start quacking at the crack of dawn for no reason lmao.",
            "title_similarity": "0.83677113",
            "sentiment_compound": -0.8695
        },
        {
            "id": "gzzm8p0",
            "score": 1,
            "text": "Obviously this is just personal experience, as every animal is different, but for a time, I had 2 ducks, then 1 duck and 1 chicken, then 3/1, then 2/1, then 3/0, before my mom finally just released them at some library's lake or something because she was at her wit's end and couldn't take it anymore. (Which is probably hella illegal...)\n\nWe had 2 ducks who were great. One was a Peking, and one was a brown mallard. The mallard could fly, but the Peking could not. The Peking was the muscle, and the mallard was the sidekick. Every evening around sunset, the mallard would fly onto our neighbor's roof, then look back at the Peking like she was saying \"Come on! It's safer up here!\", not realizing her friend couldn't fly. After... I dunno, let's say a year, something managed to get the brown mallard, despite it being able to fly. The Peking is too large for most critters to drag away, but I guess we figured she would fly if she thought she was in danger. Maybe she wanted to stick with her friend to the end? Who knows.\n\nThe duck, which before had been antisocial, was now lonely as hell. Whenever we would do yard work, she would follow us to remain within eyesight, but if we approached, she would try to run away. But she was very obviously lonely, so when we saw someone online trying to re-home a chicken, we adopted a chicken to be her friend. And friends they were, in that sort of \"old lady knitting group\" kinda of way. They both did their own thing, but they remained in sight of each other. The chicken wasn't as considerate as the mallard though, so at night, the chicken would fling herself up onto our 6-foot wooden fence and hide in some foliage to roost for the night. The duck couldn't do that so she had to hunker down on her own. Eventually, we made a little nest in our garage for the duck and started ushering her in every night, then letting her out every morning. If we got to her early enough, the chicken would follow her in and roost on a tool shelf. Otherwise, the chicken would abandon her for the night. But overall, they were a good team and good pets.\n\nThen we saw someone was trying to get rid of 2 Peking ducks, and we thought \"Oh, she can have more friends!\" The owner told us when and where he'd gotten the duck, and it sounded a lot like they got theirs from the same place at the same time we'd gotten ours, and we figured they were siblings. So it was a cute family reunion!\n\nAnd then the rape happened. I think we got 2 boy ducks, and they just took turns raping the duck that we thought was their sister. Just nonstop rape. We had a little tub we filled with water every day or two so the duck could clean herself and cool down, but still remain easier to clean out that a pond full of duck shit. She was just peacefully bobbing along and her brother would rush up, climb on top of her, and start raping her while he forces her head underwater. Very violent and very loud. This was when our neighbors started to hate us.\n\nShe'd been laying eggs, but somehow, the chicken knew that these eggs were different. The duck didn't want her rape babies, I guess, but the chicken sat on the duck's nest while the duck was off bathing or getting raped or whatever. Eventually, to our surprise, a single baby duck hatched, and the chicken was satisfied because she stopped sitting on the nest. The mom tried to raise her baby, but she was looking pretty haggard from the nonstop rape. She was missing feathers on the back of her neck and her eyes just looked so tired. She developed a limp. Right around the time the baby duck was becoming an adult, the mom died, and the chicken stopped hanging out with the other 3 ducks.\n\nUnfortunately, the new duck was a girl. And the old fucktoy had died. So, not sure which of the 2 was her father, but they both started raping her nonstop too. We tried to separate the boys and girls many times but the girls kept going back to the boys. Maybe it wasn't rape, maybe it was \"consensual\", but by God did it sound and look painful for the girls. Eventually the chicken died of illness, or old age, and at that point we were left with 3 horrible ducks.\n\nWe'd try to put them in the duck pen in the garage every night, and they'd do their best to escape. During the day, they'd start going in the garage to cool off, and lay eggs in the absolute worst locations where we couldn't reach them, so rotting eggs eventually became a problem. (Not to mention the duck shit on the floor had tripled, and was no longer contained to the corner.) They'd scream and honk all night long, whether they were in the garage or not. We kept having codes enforcement called on us because our neighbors kept getting woken up by the ducks screaming at seemingly nothing. That was when my mom snapped and got rid of them, I guess.\n\nTl;dr: 2 ducks and 1 chicken were great, but the 3 ducks were probably the worst pet I've ever had. Would consider trying a 1/1 duck/chicken combo again, but multiple ducks? Never again. Louder and messier and rapier than chickens by far.",
            "title_similarity": "0.78843284",
            "sentiment_compound": -0.9979
        },
        {
            "id": "h07v74c",
            "score": 1,
            "text": "Geese have bills and webbed feet. \nAll geese are evil. \nBills and webbed feet are evil.\nDucks have bills and webbed feet \nTherefore\nDucks are evil.\n\nBut they do mate for life and those trad values warm my heart ... so it’s tough to say.",
            "title_similarity": "0.7266917",
            "sentiment_compound": 0.5319
        }
    ]
}