{
    "CMV: For women to receive all of the rights/benefits of citizenship, they should also be eligible for selective service.\n* Edit to the title because people were mighty upset over the tone, and a good portion of people were taking it the wrong way. The position is best characterized as: because women receive the all of the rights and benefits, they should be eligible for selective service. \n\nI simply believe that in a society that endeavors to be equal, it does not seem to be fair that there is a burden that one half of the population is mandated by law to bear while the other half gets all of the same benefits and rights without that general mandate. This is not about the legitimacy of the draft, it is about the balance of rights and responsibilities amongst equals. This actually was a counter argument to the suffragettes during the debates over the 19th amendment that they would then have to bear the burden of eligibility for the draft. they should be eligible for the draft because that is a step towards balancing rights and responsibilities.": [
        {
            "id": "h03fnkf",
            "score": 1,
            "text": "/u/lasimpkin (OP) has awarded 10 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/np73mj/deltas_awarded_in_cmv_for_women_to_receive_all_of/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.54359764",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h03biu2",
            "score": 135,
            "text": "Do you feel that men should one way or another suffer from the pain of labor when they want kids, because it's unjust that they receive the same rights / benefits than women (having a child) when they have to suffer way less to get it ? \n\nThe problem is that men and women aren't biologically equal, so you'll never be able to even the field totally. Past societies decided that women get the pain when having kids and the risk of dying doing so, while the men get the pain of fighting and defending their group and the risk of dying doing so.\n\nYou feel that women should also get the fighting / dying risk so that the rights/risks are more balanced, but if you only balance the cases where men are disadvantaged, aren't you skewing the balance even more toward men side ?",
            "title_similarity": "0.8195558",
            "sentiment_compound": -0.9587
        },
        {
            "id": "h03hk45",
            "score": -2,
            "text": "Women should not be forced into military service",
            "title_similarity": "0.5658144",
            "sentiment_compound": 0.357
        },
        {
            "id": "h03juwu",
            "score": 89,
            "text": "If 50% of men die in a war and 0% of women the  country can bounce back in a generation if 25% of women die in a war the country may never recover.\n\nThe desire for equality does not override survival",
            "title_similarity": "0.5724577",
            "sentiment_compound": -0.9575
        },
        {
            "id": "h03be5c",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h03hloy",
            "score": 3,
            "text": "Frankly, selective service is a formality. The training required to be part of a modern military precludes any significant value to drafting people. \n\nThe US is never going to have another draft unless it's *truly* a weird epic emergency and there's no time to train people but you just need warm bodies, like, I don't know... a zombie apocalypse or something. Even a massive Chinese invasion is just going to be sunk long before it gets here... It's just too far-fetched a scenario. \n\nAdding more people to that formality is pointless. It should be eliminated for all. Doing a dumb thing to increase hypothetical equality that will never matter is still... dumb.",
            "title_similarity": "0.58754456",
            "sentiment_compound": -0.2871
        },
        {
            "id": "h04a314",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.11395411"
        },
        {
            "id": "h03mx9g",
            "score": 112,
            "text": ">For women to receive all of the rights/benefits of citizenship, they should also be eligible for selective service\n\nBecause they don't contribute enough to society otherwise?\n\nHow about this then: In order for men to receive all of the rights/benefits of citizenship, they should also be capable of carrying a fetus for nine months and giving birth.\n\nDefending your country (or being conscripted to fight pointless wars in other countries) is not the only service one may render their nation, culture or society. \n\nRequiring people to render some dread service or surrender some cherished liberty to the state in order to qualify for full citizen ship is a bit fascist, isn't it?",
            "title_similarity": "0.8135891",
            "sentiment_compound": -0.3527
        },
        {
            "id": "h03h891",
            "score": 6,
            "text": "How bout instead, no one has to sign up for selective service. America doesn’t do shit for its people how can it ask us to fight and die for it? Some bullfuckingshit imo. “You want free college? You’re gonna have to go kill some kids in the Middle East if so.” No state is worth putting your life on the line for.",
            "title_similarity": "0.61487126",
            "sentiment_compound": -0.9332
        },
        {
            "id": "h03syrb",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h03cp5g",
            "score": 870,
            "text": "I am not sure where you got the ideas of \"burden\". Draft laws are created by men not women. This is a choice that men made based on men's prejudice against women. Nobody has given the opportunity to women to share that \"burden\". \n\nIn the grand scheme of things, women have never avoided the draft. Many women actually wanted to participate in wars, but they were largely denied this opportunity and were instead relegated to nurses.",
            "title_similarity": "0.75130284",
            "sentiment_compound": -0.1994
        },
        {
            "id": "h03cnha",
            "score": 25,
            "text": "If you believe that eligibility for selective service is the sole determining factor in citizenship and the rights and responsibilities that come with citizenship than you need to apply that universally. Therefore anyone who is *not* eligible for the draft should also have their rights and responsibilities curtailed. People who have aged out, medical exemptions, etc.",
            "title_similarity": "0.7067401",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03t5ls",
            "score": 52,
            "text": "For men to receive all of the rights/benefits of citizenship, they should also be made to do unpaid care of: children (their own or others'), neighbours (healthy or not), relatives (healthy or not), spouses (healthy or not), you name it. \n\nWomen already do a tonne of \"service\" for free, it just doesn't get recognition. The draft is a tiny step in making men pull their weight in society - except when men do service they are called \"soldier heroes\", when they abstain from service they are called \"conscientious objectors\". When women abstain from care service, they're \"heartless selfish bitches\", and when they pick up the reins, \"they're just doing what's they're naturally best at\".",
            "title_similarity": "0.7234361",
            "sentiment_compound": 0.7339
        },
        {
            "id": "h03w4s7",
            "score": 11,
            "text": "This confused idea that equality is somehow the same as everyone has the same obligations and we have to pretend that differences don’t exist is basically absurd.\n\nRequiring that men joins selective services has as much to do with basic masculine traits as it does with the basic fact that women are the citizens that carries and produces the next generation.\n\nHaving the same rights is the foundation of an egalitarian societies and is a step towards basic equality of all citizens.\n\nHaving the same obligations is as absurd as making everyone to the same job... diversity produces stability not enforced similarity.\n\nThe argument was absurd on its face during suffrage as well considering that women already carry an extremely unequal side of the process of procreation.\n\nEquality is about freedom from discrimination,equal rights, and fair representation under the law and in society.\n\nEquality could be carrying your fair share of the burden of society.\n\nEquality is not everyone has to carry the exact same burden as that would be considered obviously impossible and entirely undesirable even between citizens of the same sex let alone taking into consideration the difference between the sexes.",
            "title_similarity": "0.82578677",
            "sentiment_compound": -0.699
        },
        {
            "id": "h03v481",
            "score": -3,
            "text": "How can you say something so controversial, yet so brave!?",
            "title_similarity": "0.45895073",
            "sentiment_compound": 0.3856
        },
        {
            "id": "h040znh",
            "score": 5,
            "text": "I agree that this is unfair and should be changed...but I am a pragmatist so here's the best argument against updating the selective service laws:\n\nIncluding women in the draft could make war FAR less palatable to the general public. Believing in equal rights between the genders is one thing, but knowing that your daughters could get sent off to the front line (against their will) is another. \n\nHumans are wired to eventually accept their sons being sent off to war, and US males are more likely to have cultural and biological inclinations to fight. Evangenical conservatives, in particular, go to great lengths to shelter their daughters from the outside world and the notion of a father or husband's \"ownership\" of his daughter/wife is still persistent. Many men would be willing to rebel to stop their crying, begging, pleading 18 year old daughter from being shipped off to war, whereas far less would do so for their sons due to the shame.\n\nThe public's appetite for war is the most precious commodity for a democracy during a \"total war\" scenario.\n\n(Reposted fragment from one of my way-too-long responses)",
            "title_similarity": "0.8088563",
            "sentiment_compound": -0.9772
        },
        {
            "id": "h03ucmx",
            "score": 5,
            "text": "(Thinks back to Abu Gharib, landmines in Laos, and drone attacks in Waziristan)\n\nOh, so now women of conscience also have to be imprisoned so that everything is \"equal\".\n\nOr, abolish the draft and pressure our government to rely more on diplomatic means to resolve problems. I don't want to murder innocent Iranians, thank you.\n\nWhen you think about it, the draft is a form of oppression on men. I watched an interview of a man who helped bomb Waziristan. He did it from the United States, but knew his actions had needlessly burned children alive. He is now suicidal. You should read about that drone program. It was conducted very carelessly, and it's the reason I have no respect for Obama or the democratic party.\n\nYou want a country in which both genders are forced to serve, look at Israel. I've seen videos of \"soldiers\" holding guns to children's faces, and screaming horrible threats at children and parents. \n\nSome guy in Israel set himself on fire, consumed with whatever it was he did in Gaza in 2014. He's not even 30 yet. Another girl is haunted by.a selfie she took with a dead guy's erection. This happened when they were 19 or 20.\n\nWe probably won't be experiencing a draft in the foreseeable future, but America is too militaristic for it's own good or for the good of others.",
            "title_similarity": "0.7503576",
            "sentiment_compound": -0.9827
        },
        {
            "id": "h03p8pm",
            "score": 1,
            "text": "The problem is that if you kill off all the young women in a war, who is going to produce the next generation for the next war.  It would put a serious damper on our very profitable war machine.",
            "title_similarity": "0.69506145",
            "sentiment_compound": -0.9551
        },
        {
            "id": "h03k535",
            "score": 23,
            "text": "To do so would active impede the effectiveness of the draft. If we end up stuck in with another World War then we'll need to both ramp up production of food, weapons, and keep up infrastructure while *also* increasing the size of the military dramatically. If we draft the whole work force, who is going to be producing ammunition and food?\n\nSomeone needs to be the ones to handle logistics. That someone is women. They'll end up *functionally* drafted into war-critical roles just like the last two times. Even if they aren't going to be shooting and shot at, they will be just as critical as those on the front lines.\n\nWhile it's not *fair* it is *simple*. In times of immediate and massive stress when we won't have time to carefully examine each and every decision simple is better than fair. Survive first, then worry about fairness. If we mess up we can always try to make it up later.",
            "title_similarity": "0.74565744",
            "sentiment_compound": -0.8436
        },
        {
            "id": "h03lw5c",
            "score": 61,
            "text": "A and B have equal shares in the benefits of society.  \n\nA has more responsibilities owed to society.  \n\nYour view is that we should reduce Bs shares in the benefits of society proportional to Bs reduced responsibilities.  \n\nBut why couldn't we just reduce A's responsibilities to the same level of B's?\n\nPut simply,  you have an issue with the inequality of the draft.  Why is your solution to this problem to punish women for the inequality, rather than simply stopping the inequality of requiring men to register for it? \n\nYou are unfairly excluding the legitimacy of the draft from your view. Your view is part and parcel of why the draft is illegitimate.",
            "title_similarity": "0.7963335",
            "sentiment_compound": -0.5661
        },
        {
            "id": "h044t1i",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h03d9l9",
            "score": 169,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h03ndwc",
            "score": 39,
            "text": "So people who pay taxes should not be allowed to become citizens and have representation in government?\n\nThen let's talk about the multitude of people, male and female, who are ineligible for service due to a wide variety of medical reasons and otherwise.\n\nThen there's the merit of not orphaning children. Under a system where both sexes can be drafted, it's realistic that children of a couple where both parents are drafted will have to be institutionalized, and then orphaned after both parents die in active duty.\n\nCitizenship is also identity. Your proposal strips millions of their identity and belonging to the country.",
            "title_similarity": "0.7465856",
            "sentiment_compound": -0.0164
        },
        {
            "id": "h044sr4",
            "score": 3,
            "text": "Do you want this view changed? Or are you just seeking poor arguments from the other side? I personally don't see anything wrong with this view. Only thing is that we haven't had a conscription in a long time. I feel like women would be included with the next opportunity. As it stands, the United States wouldn't need a conscription in war time. With the biggest military in the world, they can probably hold their own without mandated military service of women OR men.",
            "title_similarity": "0.7075327",
            "sentiment_compound": 0.1566
        },
        {
            "id": "h03y3pe",
            "score": 25,
            "text": "How much of a pessimist do you have to be seeking out negative ways to make things equal instead of positive ways? Let’s make women susceptible to testicular cancer while we’re at it!\n\nHopefully this is a view that needs addressing at some point, but let’s maybe first deal with girls in tech, workplace discrimination, paid leave, etc first before we get worried that women are too equal.",
            "title_similarity": "0.8305118",
            "sentiment_compound": -0.722
        },
        {
            "id": "h03q4de",
            "score": 1,
            "text": "There just shouldn't be selective service.",
            "title_similarity": "0.35831937",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03qgvy",
            "score": 2,
            "text": "Selective service a bit of a residual from the draft - it’s is a break in case of emergency contingency plan to another contingency plan.\n\nThe United States will not institute conscription for an elective war again after Vietnam. If we are in a war for our survival, women will play huge roles too.\n\nRegistering for it doesn’t represent the slightest bit of responsibility to men; it’s just some old paperwork that hasn’t been updated. Fixating on it as an example of inequality or women benefiting from the law is pretty contrived.",
            "title_similarity": "0.74408674",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h03szzn",
            "score": 3,
            "text": "Do away with selective service completely.",
            "title_similarity": "0.33454636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03bpic",
            "score": 68,
            "text": "You mention this being a historic argument against the 19th; does that mean that you feel that should women not be included in a draft, they then should not enjoy the rights of citizenship? Would this also apply to people who are disabled, elderly, or otherwise excluded from the draft? \n\nSecondly, the US military has been all volunteer since the 70s and the likelihood of the draft being abolished seems both more likely and better, especially given the shift towards more technological warfare.",
            "title_similarity": "0.74835265",
            "sentiment_compound": -0.7354
        },
        {
            "id": "h03yztl",
            "score": 15,
            "text": "Why should things be linked to military service? How about we stop glorifying the Military Industrial Complex instead. This is literally what the OP is promoting and it's disgusting.",
            "title_similarity": "0.6107185",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h03y7n6",
            "score": 3,
            "text": ">a burden that one half of the population is mandated by law to bear\n\nIs it really a \"burden\" though....? It's been 48 years since the draft was last used and there is a remote chance it will ever be used again (technology is quickly making traditional soldiers less relevant.)\n\nI don't think citizenship should be conferred upon bearing a purely hypothetical burden in a hypothetical future conflict that hypothetically necessitates citizens with zero combat prowess to join the military.....",
            "title_similarity": "0.6196534",
            "sentiment_compound": -0.8676
        },
        {
            "id": "h03chbu",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h03bp2r",
            "score": 1679,
            "text": "I'd suggest that the rights/benefits of citizenship shouldn't be contingent on some process that requires people to bear arms. It's possible for the inequity in selecting only men for that process to be wrong without linking it to an entire gender's right to citizenship. \n\nThink about this logic plays out: there are lots of reasons people may not be eligible for selective service I presume; injury, illness, disability, other exemptions. Are you limiting the citizenship of those folks also?\n\nSo, yeah things should be equal but getting all 'your citizenship is limited because X' about it is a pretty slippery slope to go down. Argue the issue at hand: selective service. Your point is about that, it's not about some broader womens' equality point. Is it?\n\nEdit: stepped away for a bit and came back to a bunch of notifications for this CMV. Won’t be responding anymore mainly because I’ve basically made the limited point I wanted to make and don’t really have an special interest in the detail of American selected service. Thanks.",
            "title_similarity": "0.7343756",
            "sentiment_compound": 0.9344
        },
        {
            "id": "h03m1yy",
            "score": 8,
            "text": "I would argue that no one, regardless of gender, should be compelled to join the military.  If the military action is compelling enough, citizens should join voluntarily.   And of the military can't make a good enough case for why people should join, then maybe those military actions should not take place im the first place.",
            "title_similarity": "0.7216178",
            "sentiment_compound": 0.1764
        },
        {
            "id": "h03nzvb",
            "score": 53,
            "text": "The right to citizenship isn’t linked to the draft for men, so why should it be for women?\n\nYes there are some downsides to not signing up for it (e.g. not getting federal scholarships and grants) but you are still a citizen if you do not sign up for it.",
            "title_similarity": "0.68920064",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h03u3gs",
            "score": 0,
            "text": "Selective service should be abolished. Military service should never be compulsory. Boom equal.",
            "title_similarity": "0.47423315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03wb87",
            "score": 0,
            "text": "I'd suspect that doctrine in the US will never swing back to a draft, short of some all-encompassing WWII scenario. And that's highly unlikely.",
            "title_similarity": "0.4290399",
            "sentiment_compound": -0.296
        },
        {
            "id": "h03wnfv",
            "score": 5,
            "text": "Im curious as to why anyone should be forced into military in the first place?",
            "title_similarity": "0.48357528",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h044tam",
            "score": 0,
            "text": "I disagree with one word of your assertion. change \"women\" to \"anyone\". \n\nThose that live up to higher levels of responsibility in a society should be awarded higher levels of rights/benefits. This should not be gender dependent. Not just for selective service, but for all facets of civic responsibility. \n\nSticking with selective service, that would mean greater rights/benefits to those who volunteered over those that were drafted as well as for those that served in combat over those that served at a desk. Those increases should be stackable. So you say you get 5 points for volunteering and 20 points for serving in combat. Doing both gets you 25 points of rights/benefits.",
            "title_similarity": "0.7534384",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h047ym3",
            "score": 0,
            "text": "Let's see here....I'll just check the math really quickly.\n\nPrime selective service years are 18-35yrs old. You need humans for this selective service. Prime human production years are 18-35yrs. Men need at most a few weeks rest and adequate nutrition to produce optimal gametes. Women must protect their systems and gametes almost continuously throughout their life and still need 2-3yrs minium just to prepare for, gestate and stand up a single additional selective service candidate. Most deployed, combat theater roles are almost completely incompatible with the required state needed for women to contribute their part, while men most times need only a few to 6wks leave. The number of select service roles confirming to female needs in a state suitable to produce humans are barely a rounding error on the scale of the total number of female.\n\nSo, no...your view makes no sense. Women are getting it done. They'll happily accept your thanks.",
            "title_similarity": "0.67743176",
            "sentiment_compound": 0.8583
        },
        {
            "id": "h04jkj0",
            "score": 0,
            "text": "The suffragettes also had counters to this argument. One of the counter arguments from that time when drafts actually happened that is seldom brought up today is that every soldier ever drafted is only able to serve because a woman risked her life in childbirth. I think that argument shows something of the change in perspective over time where today we take a very narrow and individualistic view of citizenship. But citizenship implies a continuation of a larger society and the male contributions to that larger society will never be as significant as the core female contributions. Not that every citizen will contribute biologically to the continuation of the society. But nor will all citizens contribute militarily nor even will they all  contribute the actual votes they have the privilege to access. No society exists where all citizens (or participants of other types) offer the same contributions. It is a bit ridiculous to arbitrarily choose to hold up selective service as the deciding litmus for women to receive the right to vote. There are other areas of contribution to society that if arbitrarily picked would easily exclude men. Or exclude other categories of citizens not related to gender (the elderly, those who ask for excuse from juries, etc.).\n\nThe other 19th century counter argument was that if the ability to serve if needed were truly such an important criteria for suffrage - the men who were physically unqualified to serve at the time of selective service registration would lose their suffrage as a matter of course. The blind, the bone spurs, etc. But as long as they are male those making this argument never cared if the citizens being allowed to vote could actually be of use to the military.",
            "title_similarity": "0.7703168",
            "sentiment_compound": -0.9504
        },
        {
            "id": "h04r9rv",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h0520dj",
            "score": 0,
            "text": "I agree to some extent, but one could also say that, in order to be equal, we need to require men to carry children in a womb of their own, birth them, and nurse them.\n\nBut those pains and sacrifices belong to mothers alone for biological reasons. I think we need to account for that, at least in the case of mothers.\n\nAs a childless trans man, I have no problem being eligible for the draft. But I think women who have born children have a right to be excluded if they're still caring for those children. Their partners, on the other hand, should be eligible.\n\nBasically, I would say **anyone who doesn't have kids should be eligible**. But **single parents should be excluded, as should mothers in the case of coupled parents**. Or at least, a mother should have the right to opt out if her partner has already been drafted. Mothers imo deserve some kind of special consideration for having endured pregnancy, childbirth, and weening.",
            "title_similarity": "0.72071594",
            "sentiment_compound": 0.6056
        },
        {
            "id": "h0567oq",
            "score": 0,
            "text": "You're presuming that women have rights. We do not. We have protections. If a crazy right wing government were to be elected, they could repeal the fair credit act, or title IX, or any of the other protections that we have. The one right I have is the right to vote. A right to vote doesn't ensure equality. It just means I have a seat at the table. It doesn't mean I get dinner while everyone else does.\n\nWe need an equal rights amendment. After that, then we can discuss selective service.",
            "title_similarity": "0.76815975",
            "sentiment_compound": 0.0813
        },
        {
            "id": "h059y6p",
            "score": 0,
            "text": "You're assuming that women are treated the same as men in modern society.  They're not.  Women have to assume the majority of housework and childcare because society expects it, and if women complain, they're seen as \"not devoted enough\" to their homes and families and face social censure.  They're penalized in their careers if they have kids and there is no federally-mandated maternity leave so they can take care of their newborn children.  If their husband receives a job offer that requires a move, wives are expected by society to quit their jobs and move with their husbands, whether an employment opportunity exists for her in the new location or not.  Women and men can do a lot of the same work, but women are paid less than men for the same work.  Women are seen as inconveniences in the workplace whenever they have to leave to care for their children, but if a man does it, he's seen as a great dad.  It is seen as a woman's responsibility to make sure she doesn't get pregnant if she has sex, and if she does become pregnant, the baby is seen as a consequence to her actions, not a human being that will need cared for.  Too many men can walk away from their children and just pay child support if they don't feel like parenting them, but if a woman doesn't feel up to being a parent, she is considered a monster for giving up her child.  I feel that until society can treat women as equal to men, then women shouldn't have to be drafted for one more duty that the majority of them wouldn't choose unless it was forced on them by society.",
            "title_similarity": "0.775921",
            "sentiment_compound": 0.9646
        },
        {
            "id": "h05azc6",
            "score": 0,
            "text": "Or... you know, abolish the selective service altogether. \n\nAnd please, the suffragette counter argument is garbage. Women have had to fight for equal rights from jump. Adding them to the draft is no where near equalizing “rights and responsibilities” when women couldn’t even own property in some states, most women couldn’t open a bank account without their husband, and many states would not grant professional licenses to women despite being qualified.",
            "title_similarity": "0.82486486",
            "sentiment_compound": -0.7278
        },
        {
            "id": "h05b7xd",
            "score": 0,
            "text": "Please Shut the fuck up before u take this discource any further. You sound like an idiot when you say ‘rights/benefits’. We have no rights or benefits in the US. We pay for most/all of the shit. Merely giving citizenship to people who can prove they can serve in a war is not in line with the ‘ life liberty and justice’ mantra Americans have been sold. So please STFU. With the absurdity like This witnessed on a regular, How have Americans even survived the natural selection, blows my mind.",
            "title_similarity": "0.74810624",
            "sentiment_compound": 0.9002
        },
        {
            "id": "h05dwu8",
            "score": 0,
            "text": "You could counter the need for selective service with \"as soon as men can carry an embryo for nine months and birth out a baby.\"",
            "title_similarity": "0.40929934",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03rdhz",
            "score": 19,
            "text": "I don't know. That's a slippery slope, isn't it? When one group feel something isn't fair because they have to do it and others don't, where do you draw the line. \n\nYour idea grossly discount the efforts and contributions of women in our world. And I call this nitpicking.",
            "title_similarity": "0.8242351",
            "sentiment_compound": -0.4333
        },
        {
            "id": "h03r1rd",
            "score": 9,
            "text": "He hell with this view. The state doesn’t have a right to force anyone to serve in the military or to kill people you don’t want to. \n\nThe correct answer to this is that no one should be drafted and it should be outlawed immediately.",
            "title_similarity": "0.5845959",
            "sentiment_compound": -0.9042
        },
        {
            "id": "h03mhi4",
            "score": 37,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h03s4vg",
            "score": 16,
            "text": "This is one of those debates that matters a lot to teenagers when they become adults but not to anyone else. In order for a draft to happen the world would have to go to complete shit and our government would surely revisit all of these policies accordingly so discussing them right now is essentially worthless.",
            "title_similarity": "0.7305535",
            "sentiment_compound": -0.705
        },
        {
            "id": "h03hwak",
            "score": 730,
            "text": "A better idea is to abolish selective service for all citizens.\n\nGood people: Man, this sucks for me, we should eliminate it, because no one should have to go through this\n\nBad people: Man, this sucks for me, everyone should have to suffer as I did",
            "title_similarity": "0.7294773",
            "sentiment_compound": -0.8682
        },
        {
            "id": "h0497sl",
            "score": 5,
            "text": "If there was not a draft following 9/11 there will not be a draft ever again.",
            "title_similarity": "0.36138743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03y9aj",
            "score": 27,
            "text": "Are you suggesting that women should not have all the rights of citizenship unless they are forced to sometimes serve in the military ?\n\nBecause if so, that's kinda disgusting, honestly. If you're suggesting that women should be on the draft, then I would say if we're changing the draft, our goal should be to remove it, not make women serve, or remove their citizenship rights if they disagree \n\nI just kinda think the whole premise of your question is dipped in poison by the implication that women's rights should be removed on the basis of them not serving a draft, honestly.",
            "title_similarity": "0.78151894",
            "sentiment_compound": -0.7569
        },
        {
            "id": "h03bhyz",
            "score": 12,
            "text": "Not from a country where a draft exists and you said it's not about the legitimacy of it\n\nSo i just want to ask for clarification: your cmv is more about equal rights should mean equal responsibilities? And an argument about it just should be abandoned for everyone which would be the same outcome won't sway you correct?",
            "title_similarity": "0.7054179",
            "sentiment_compound": -0.6481
        },
        {
            "id": "h03sbj4",
            "score": 12,
            "text": "Sure as soon as men share 50% in child related issues",
            "title_similarity": "0.30128995",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h03od54",
            "score": 7,
            "text": "Or we could do away with selective service. I'd rather not kill and/or die because some politician wants more oil.",
            "title_similarity": "0.6004895",
            "sentiment_compound": 0.7835
        },
        {
            "id": "h03pze9",
            "score": 5,
            "text": "Just abolish the draft altogether. No one should be forced into that.",
            "title_similarity": "0.43840685",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h03q9no",
            "score": 1,
            "text": "Some interesting things to consider here:  more women in the military can provide more women with the skills to defend themselves and understand weapons and the nature of aggression. That could equalize power in society more.  Another thing to consider when linking full citizenship rights to full participation in all aspects of societal needs would link the ability to bear children to a social benefit that entitles    people who can make babies to an entitlement. That means get balance out with the physical strength that now brings certain entitlements.  Could get interesting.  \n\nImagine hat people who grow food for all of society having a value in terms of rights assigned to them over people who only consume food.  One can go on and on considering possibilities.",
            "title_similarity": "0.69851255",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h03uqjx",
            "score": 1,
            "text": "There should be no draft, military services should always be strictly voluntary.\n\n\n\n\n##Problem solved",
            "title_similarity": "0.3615851",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h045k4p",
            "score": 1,
            "text": "Feminist equality is not equality.",
            "title_similarity": "0.4508356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04h650",
            "score": -1,
            "text": "I’m going to quote a comment that once changed my view on this. Maybe it will change yours too:\n\n“No, I do not oppose Selective Service registration for women because of their delicacy. I oppose it because women already sacrifice more for their country than men do, and women should not be asked to bear even more. There should be parity between men and women in the work of protecting our country and giving it a future. Selective Service registration for women would undo that parity, placing an unjustly heavy burden on women, and making their burden far heavier than that of men.\n\nWhat, at a minimum, must a nation have to survive? It must have protection, even physical protection in the form of armed forces whose members are willing to lay down their health and even their very lives if necessary to counter threats to the nation’s security. But protection is not enough for a nation to survive. A protected nation will nevertheless die out in the space of a generation if there is no reproduction. Only through reproduction does a nation have a future.\n\nAnd reproduction—carried out through the labor and efforts of women, not of men—is personally quite costly. Women offer to lay down their health and even their very lives that their nation might have a future in the new citizens brought into the world through women’s reproductive labor. That we have not seen this as a patriotic service on a par with men’s service in combat says more about our society than it says about the reality of women’s valuable service to our country.\n\nIndeed, consider that in the history of our nation—from 1776 onwards, more women have died or been seriously harmed in or incident to childbirth than men have died or been wounded in battle. For example, in 2012, over 700 US women died in childbirth, with another 52,000 suffering a profound bodily harm, such as acute renal failure, stroke, heart failure, or aneurysms. In 2012, 310 American soldiers died in Afghanistan, with less than 4,000 wounded. Indeed, the maternal mortality rate in the US is now double what it was 25 years ago (it’s now 15 per 100,000 births).\n\nAnd this is not even to mention the “mommy tax” on a woman’s lifetime earnings of having a child, which can amount to over $1 million. Indeed, the greatest risk factor for being poor in old age in the United States is to be a mother (and not a father). Not just a physical, bodily sacrifice, then, but a profound economic sacrifice as well.\n\nWe have all seen many, many monuments to great generals and unknown soldiers in our land. But there is only one monument—hidden in the back yard of a church in Pennsylvania—to all of the American women who died in childbirth to give our nation a future. Just one!\n\nThis matter strikes close to home for me. A young woman I knew died giving birth to her third child. I cannot forget the sacrifice she made to bring that child into the world. Yet my country does not honor these deaths, for my country is blind to the sacrifices of women that give it a future. Dying in childbirth is somehow “natural,” whereas dying in battle is “glorious.” How sightless we really are!\n\nAnd there’s a GI Bill for all the soldiers who volunteered to lay down their health and their lives for their country, so that soldiers are not asked to make both an economic as well as a physical sacrifice for their country . . . but no such Bill for the mothers. No, indeed, the pay gap between mothers and childless women is about as wide as the pay gap between men and women. That’s because, I am told, women choose to have children; no one forced them to. Of course, in today’s all-volunteer army, soldiers choose to fight for their country; no one forced them to. But somehow a soldier’s blood and a soldier’s sacrifice just seems so much more precious than the blood and sacrifice of a mother—which to my feminist mind is just so very wrong on so many levels.\n\nWe women know that it may be our fate to die for our country’s future not on some foreign shore, but in labor on a hospital bed right here in the States. But most of our countrymen simply do not have the eyes to see. For example, one commenter wrote,\n\n“Until women can be drafted and forced to die in battle just like men have for centuries, we will not have true equality between the sexes.“\n\nI say,\n\n“Until men can die in childbirth just like women have for centuries, women should not be drafted and forced to die in battle also—that will simply deepen the existing inequality between the sexes.””",
            "title_similarity": "0.885659",
            "sentiment_compound": -0.9985
        },
        {
            "id": "h04lc9s",
            "score": 1,
            "text": "As expected almost no comments are addressing the point. Women should absolutely have to sign up for the draft as things stand today. Is the draft a good idea? Irrelevant to the argument. Are there exceptions that even men fall into? Irrelevant to the argument. Everyone always wants to tiptoe around this but you're absolutely right OP. If every male has to do it then there isn't equality until every female has to also. \n\nStop having so many distractions and pretending they're arguments. All of you know exactly what OP was trying to say, stop worming through every pedantic and \"should be, could be\" argument and just respond to what the intent is. You look as disingenuous as anti maskers. By far the most infuriating thing about Reddit. When faced with an uncomfortable solution most of you just ignore it and attack things that aren't even brought up. \n\nAnd don't come at me with \"that's not how it was worded\" either. You damn well know what was meant. So answer that or don't respond at all.",
            "title_similarity": "0.79037297",
            "sentiment_compound": -0.987
        },
        {
            "id": "h04ny9t",
            "score": 1,
            "text": "I like the starship troopers logic. “Service guarantees citizenship.” \n\nDoesn’t have to mean strictly military like in Starship, but you have to prove you’re actually useful to society to vote and actively participate in changes and the such. \n\nWe let idiots who don’t know how the world works rile up other idiots who don’t know how the world works make stupid changes because they’re unfortunately the majority that everyone else has to live with.\n\nDoesn’t mean you’re a second class citizen, but you just don’t have as many rights to make decisions if you’re not gonna contribute anything yourself.\n\nKind of like children or teens, where you’re still generally respected, but we’re not going to let you choose ice cream for dinner every night and no more school and all that.",
            "title_similarity": "0.7541486",
            "sentiment_compound": 0.6966
        },
        {
            "id": "h04wst2",
            "score": 1,
            "text": "Who will raise the children? Not saying because the men went to war, but because men abandon their parental responsibilities at an alarming rate as it is. \n\nWomen on a whole are more reliable caregivers and are exponentially more burdened with childcare. Where’s the reward for that on a gender level? So we orphan the kids by either stripping their only parent of statehood or put them in war. Who is raising the kids? I really want to know. \n\nWhy should men who abandon their children remain citizens just because they _may_ be conscripted. The last time that happened was 50 years ago. I’ll agree to conscription for women when men stop abandoning parenthood. \n\nThey can’t even ever match the numbers because men could theoretically have sex with 100 women in a year and have 100 babies, whereas women could have sex with 100 men in a year and still only have one pregnancy. \n\nLet’s compare a man who has 6 children with 6 women. The women go to war and you think this man who can’t stick with 1 woman is going to raise any kids, let alone 6? \n\nMaybe you send a couple of the women and the father! Again, who is raising the children left behind?",
            "title_similarity": "0.7255677",
            "sentiment_compound": -0.9806
        },
        {
            "id": "h04z6u9",
            "score": 1,
            "text": "You've undermined the entire discussion, made the threaded arguments incomprehensible and this exchange an entire waste of time by changing wording of the original proposition so that it no longer says what all of us have been arguing about. This is not honest. \n\nThe proper way to concede your premise is flawed is to do just that. NOT to change the title so that everyone who's pointed out the problems in your position is now arguing points that are no longer reflected in your edited CMV. \n\nSomeone just responded to me by saying that your post did not say what said it said, and of course it doesn't NOW that you've changed it. \n\nStep 1: Make an argument, take a stand.\n\nStep 2. Defend the position you've taken.\n\nStep 3. If you can't, then admit that you were wrong or that your original premise was badly stated. \n\nDO NOT try to make your opposites like fools by changing the original premise so that their arguments no longer appear to make sense.",
            "title_similarity": "0.70857286",
            "sentiment_compound": -0.9866
        },
        {
            "id": "h05f1qa",
            "score": 1,
            "text": "I would go one step farther.\n\nI would mandate a two year service requirement as long as non military options are available. \n\nSocieties are built upon commonalities and mingling of peoples. It would be an opportunity for folks otherwise separate in their beliefs and social bubbles to learn about others. \n\nIt becomes harder for racist, sexist, and queerphobic attitudes to stick when you served side by side with folks of all socioeconomic strata.",
            "title_similarity": "0.68590415",
            "sentiment_compound": -0.296
        },
        {
            "id": "h03p30w",
            "score": 2,
            "text": "Would eliminating men’s requirement to register for the selective service not be a more moral change to make?",
            "title_similarity": "0.6020589",
            "sentiment_compound": 0.0
        },
        {
            "id": "h042hi4",
            "score": 2,
            "text": "Or abolish selective service?",
            "title_similarity": "0.33076406",
            "sentiment_compound": 0.0
        },
        {
            "id": "h045mm5",
            "score": 2,
            "text": "If this is the case then shouldn't people who are ineligible to serve for other reasons (disability, religious belief, etc) also lose their rights?  Are you on board with removing the rights of these groups - as it will never really be feasible to include them in the draft.",
            "title_similarity": "0.66837025",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h049gei",
            "score": 2,
            "text": "Men and women are simply different.  Men cannot become pregnant, bear children, nor nurse babies.\n\nDo men deserve less rights of citizenship because they are effectively exempt from these life-altering responsibilities?\n\nYou may say that the two are not directly related as there can obviously be no practical law requiring men to bear children, and because it would of course be possible to draft women.  However, there is a direct correlation between a society's desire to preserve it's population and exempting those who can create life to do so from war.\n\nMoreover, how would you practically handle women who become pregnant when or after they are drafted?  Forced abortions?  Prison?\n\nNot all gender norms, even ones that are hundreds/thousands of years old, make sense.  But I think this one represents a core reality that is directly related to the biological functions of each gender.",
            "title_similarity": "0.7694478",
            "sentiment_compound": -0.5788
        },
        {
            "id": "h04b26w",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.10606375"
        },
        {
            "id": "h04bt1b",
            "score": 2,
            "text": "You really believe that women currently receive all of the same rights and benefits as men? Oh dear...",
            "title_similarity": "0.60751736",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h04pp9n",
            "score": 2,
            "text": "Or they shouldnt force any people to fight wars they dont agree with.",
            "title_similarity": "0.5536158",
            "sentiment_compound": -0.8079
        },
        {
            "id": "h03udc6",
            "score": 19,
            "text": "Have you considered that nobody should be eligible for selective service in exchange for rights?",
            "title_similarity": "0.5106722",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03cdav",
            "score": 20,
            "text": "Given that the draft hasn't been a viable option (politically speaking) since the 1970s, doesn't that mean you're more in favor of abolishing the draft altogether?",
            "title_similarity": "0.5250134",
            "sentiment_compound": 0.4549
        },
        {
            "id": "h03zbdw",
            "score": 2,
            "text": "Or you could remove men from the selective service, not compelling anyone to bear arms for their citizen ship. I didn’t ask to be born here, and I don’t have enough money to move. I won’t kill for this place, because I believe it regularly has and will continue to misuse the loyalty of its people. \n\nNot to mention our conscription rate is still insanely high, and will always be as long as college remains a for profit enterprise.",
            "title_similarity": "0.6500281",
            "sentiment_compound": 0.0088
        },
        {
            "id": "h0404fi",
            "score": 2,
            "text": "At this point we need to talk about rights vs entitlements.\n\nA right is something you have by default, and that must be taken away from you so you don't have it. Taking it away is a process that must be justified in its necessity, a right may only be restricted to protect a more important right. You can't restrict a right for no good reason. Freedom of movement is one example: By default, you can go where you want. The state has to justify locking you up by the danger you pose to other people.\n\nAn entitlement is something that by default you do not have. You must first earn it. It can also be taken away for unrelated reasons (equality before the law still applies of course). An example is driving: You may drive only after acquiring a drivers licence, and a drivers licence may be rescinded for reasons unrelated to the danger you may pose on the road, for example as an additional deterrent to other, unrelated crimes.\n\nRight now, voting is a right: Everyone may vote, there's nothing you have to do to earn the right to vote, and it's extraordinarily difficult to lose (the state has to show you are fundamentally opposed to the nation itself). You would turn it into an entitlement: Only people who have entered the draft may vote. This is a fundamental shift that opens the path to adding more requirements, or revoking voting rights for arbitrary reasons, and hence a very dangerous step.",
            "title_similarity": "0.6684059",
            "sentiment_compound": -0.7447
        },
        {
            "id": "h042b39",
            "score": 3,
            "text": "\"No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States;  nor deny to any person within its jurisdiction the equal protection of the laws.\"  \n\n\nSo from a purely legal sense, it is unconstitutional to restrict the rights of women on any basis.  \n\n\nWhether women should be eligible for selected service is an open political question, and if the rights of women are somehow restricted until a law is passed which makes women eligible for the draft, then simply by never passing such a law men could by default keep women powerless, which I'm sure you'll agree is an untenable situation.",
            "title_similarity": "0.7090616",
            "sentiment_compound": 0.5616
        },
        {
            "id": "h044u7p",
            "score": 3,
            "text": "Everyone should have rights that aren’t reliant on something, especially something like being forced to kill for their country",
            "title_similarity": "0.65844506",
            "sentiment_compound": -0.6621
        },
        {
            "id": "h055idg",
            "score": 3,
            "text": "Women fought to be included in the draft...",
            "title_similarity": "0.6365184",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h03y5np",
            "score": 154,
            "text": "As a female veteran, serving 14 years.\nI got out because I couldn’t advance in my rate because I am NOT male. The opportunities are NOT there, especially in the USN where there is a huge difference between sea duty, on ship, and shore duty, on land, which are rotated in your career. I was NOT offered the same opportunities as men. I was held back.\n\nAlso while military pay is equal, because you don’t get the same opportunities, you lose out on bonuses  & courses you can take. You are also passed over for promotions because of this. This corresponds to current US society where a woman makes 82 cents for every dollar a man earns.\n\nSexual Military Trauma is NOT mentioned. And while men are also sexually traumatized, woman rates of SMT are through the roof & getting worse by the year.\nThe men who rape you are mostly superior & in your chain of command.\nYou have to work for them. IF you make a report you suffer unbelievable retribution.\n\nI was serving a 24 hour duty & my duty partner was called to pick up a drunk disorderly E3 from the MPs in town. He was brought to the command & raped me while my partner was not there. \nWhen I reported this to the E8, he asked me what I was wearing! To make matters MUCH worse, I was the Command’s Alcohol/Drug Counselor.\nI had to face him and conduct an alcoholic assessment/interview the very next day!",
            "title_similarity": "0.7340803",
            "sentiment_compound": -0.9536
        },
        {
            "id": "h05ckng",
            "score": 14,
            "text": "If men are drafted for service because of “gender roles”, traditionally women have served in the same gender-role capacity by being relegated to taking care of the children/house while their men serve. Perhaps you just don’t value this sort of service because you don’t consider it equal, despite both being the consequence of gender roles? \n\nI live in Singapore where men by the time they turn 18 have to serve 2 mandantory years of military service. Some men are hateful and start comparing it to the need for women to service in equal capacity — perhaps forcing them to serve as well, or that they would have to breed a certain number of children.\n\nI bring this up because in a way you argue that equality for men and women leading to citizen rights has to look the same. Regardless of whether men or women are drafted or not, social expectations dictate that able men need to fight for their country. Even if the entire female gender is drafted, social expectations for them still are that women should know how to cook, nurture, have children, and take care of the house — *on top of being drafted*. We can see this happening now even as women take on high powered careers in the workforce and are expected to also be the primary nurturers for their child.\n\nTraditional relationships work (or have worked) around the understanding that equality for men and women are complementary, not similar. Both types of work are valued equally. Maybe some women would want to fight, and some men would want to stay at home and take care of the children. Both should be accepted in our modern world, but there is no perfect way to regulate or measure this sort of service if either is made mandatory to choose.\n\nIn sum, gender roles are always at play whether there’s mandantory drafting or no. My hypothesis is that in modern times people gripe more about raising this “equality bar” for women, because social expectations for women to adhere to traditional roles have lessened, but not for men.",
            "title_similarity": "0.7877029",
            "sentiment_compound": 0.7719
        },
        {
            "id": "h03vtav",
            "score": 4,
            "text": "i totally understand your logic, and it makes sense overall. however, there are a few details of it i’d like to know your opinion on. \n\n1. overall, men created the draft laws, and created them to be independent of citizenship. when women were given the right to vote, and weren’t forced to participate in the draft, the precedent was set that selective service is not based on citizenship \n\nnow, i think that’s bullshit and should NOT be the case, but that doesn’t change the fact that the draft is currently simply not based on citizenship\n\n2. what about conscientious objectors? are they not entitled to citizenship or voting rights as well?\n\nim not too invested in this specific part of this debate, because my view is that nobody should be drafted, but i see your perspective.",
            "title_similarity": "0.73063296",
            "sentiment_compound": -0.1484
        },
        {
            "id": "h040ahv",
            "score": 6,
            "text": "Nah I should be entitled to benefits because my taxes pay for it. I literally contribute to it. It’s like I can’t get my 401k unless I’m willing to bleed for my company. \n\nAlso, if we’re gonna play this, I want the government to be composed of 50% women. I’m sick of the mostly old white men declaring war and shit all the effing time.",
            "title_similarity": "0.7514272",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h03di3l",
            "score": 314,
            "text": "The reason women previously weren’t included in selective service in the US is because up until 2016 they didn’t have the right to fill all roles in the military. Since then a challenge has been brought forward through the legal system and is waiting to be heard by the Supreme Court. I don’t think women should have their rights taken away because the legal system is slow. \n\nhttps://www.google.ca/amp/s/www.washingtonpost.com/politics/courts_law/supreme-court-military-draft/2021/02/18/041299ca-713b-11eb-85fa-e0ccb3660358_story.html%3foutputType=amp",
            "title_similarity": "0.7437463",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h03qxm6",
            "score": 1,
            "text": "Everyone has worth no matter your malady. It's just bad management that we have no place for people. When we become a nation that valued all of it's people we will become a great Nation.",
            "title_similarity": "0.6787558",
            "sentiment_compound": 0.4812
        },
        {
            "id": "h03utfc",
            "score": 1,
            "text": "I think as a society (USA) we endeavor to be fair not equal. If we wanted to make everything equal it would make sense to have laws that were blind to demographics. But if we want to be fair it makes sense to try considering the unequal average demographic trends in law making.\n\nThe draft law is a symptom of considering the general trends of the female vs male demographics.",
            "title_similarity": "0.7986789",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h03wq1p",
            "score": 1,
            "text": "How about we dispense with selective service altogether?",
            "title_similarity": "0.33887553",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03wr2s",
            "score": 1,
            "text": "Surely it would make more sense if the draft didn't exist altogether? It denies individual freedoms and forces ordinary people into life or death situations. Real equality would be banning the draft altogether. Not forcing even more people to participate.",
            "title_similarity": "0.6899148",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h03ytex",
            "score": 1,
            "text": "Yesterday I (17F) got my letter for selective service! In my country it has already been implemented!",
            "title_similarity": "0.3928767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03z4rb",
            "score": 1,
            "text": "If women die on the battlefield they can’t give birth and the nation will fall. Dead men can be replaced somehow with children after the war, but dead women cannot be really replaced, because if they die the fertility rate will plummet.",
            "title_similarity": "0.65741324",
            "sentiment_compound": -0.9668
        },
        {
            "id": "h040s2e",
            "score": 2,
            "text": "You can add me to the draft I don’t care. But there should be a bilaw that only one parent would be drafted so kids wouldn’t become homeless. Also women are still not equal as far as pay goes, prejudice, descrimination etc. Women couldn’t even play soccer until the 70’s. Taking away citizenship is just bullshit. They tried to pass a law a few years ago allowing women to do the draft. It was not passed.",
            "title_similarity": "0.6772915",
            "sentiment_compound": -0.7935
        },
        {
            "id": "h040v9z",
            "score": 1,
            "text": "Reading this while doing my mandatory military service couldnt agree more.",
            "title_similarity": "0.44131976",
            "sentiment_compound": -0.2047
        },
        {
            "id": "h0416yh",
            "score": 1,
            "text": "I'm so glad I'm over the age to be selected for that. I don't agree with the SS at all and don't think it's fair to force people to do something they don't want to do.",
            "title_similarity": "0.6861043",
            "sentiment_compound": -0.0003
        },
        {
            "id": "h041wu0",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.113954134"
        },
        {
            "id": "h041zm7",
            "score": 1,
            "text": "Question: what rights would you take away from women?",
            "title_similarity": "0.6157603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h043i71",
            "score": 1,
            "text": "Yeah and let women on submarines and other roles in the military they are still excluded or heavily discouraged from!  Especially in leadership! Probably will have to restrict them fron getting pregnant though. Don't want to lose your best f-35 pilot for half a year because she can't fit into the cockpit!",
            "title_similarity": "0.6870352",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h044b85",
            "score": 1,
            "text": "Seems there is 2 separate things here. I think it’s crazy to have an entire set of rights based on whether you serve mandatory military. But as far as drafts go, IF they happen, then yes all able bodied people who meet the qualifications should serve. But also, as many have said, not a fan of drafts.",
            "title_similarity": "0.7712475",
            "sentiment_compound": 0.1424
        },
        {
            "id": "h044k0s",
            "score": 2,
            "text": "Well, looks like I'm actually sexist on this issue.\n\nI'm not going to war if my wife/daughter are partaking in it. My goal is to protect them, not the country. If I lived in a country with that law and war broke out, I'd move.",
            "title_similarity": "0.69024074",
            "sentiment_compound": 0.3911
        },
        {
            "id": "h044tys",
            "score": 1,
            "text": "i think we should abolish the army",
            "title_similarity": "0.39930612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04629z",
            "score": 1,
            "text": "Agreed, both men and women should *not* be required to be soldiers, in exchange for any necessity.",
            "title_similarity": "0.6166501",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0473cx",
            "score": 1,
            "text": "So should those ineligible for military service lose their rights?",
            "title_similarity": "0.5359932",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0476ud",
            "score": 1,
            "text": "I agree",
            "title_similarity": "0.0021834262",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0478jk",
            "score": 1,
            "text": "Or, the better form of equality, abolishing selective service",
            "title_similarity": "0.4997758",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h047cu0",
            "score": 1,
            "text": "Ok but since men won't even be drafted these days that would be a symbolic gesture. But if symbolism is what you want go ahead. We should also make all old people and those men over 35 register again if they want to keep their rights",
            "title_similarity": "0.6140158",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h047f3f",
            "score": 1,
            "text": "what is selective service?",
            "title_similarity": "0.22695218",
            "sentiment_compound": 0.0
        },
        {
            "id": "h047khs",
            "score": 1,
            "text": "...and people say chivalry isn't dead....",
            "title_similarity": "0.2138331",
            "sentiment_compound": 0.5334
        },
        {
            "id": "h047kxn",
            "score": 1,
            "text": "how's about no? instead, take away the requirement for selective service. don't force people to do the same shitty thing we had to do.",
            "title_similarity": "0.55585897",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h047xn0",
            "score": 1,
            "text": "Or, just not have selective service at all. Seems pretty wild that you can mind your buisness and the government can ship you off to murder people and/or die.",
            "title_similarity": "0.5527805",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h0486zh",
            "score": 2,
            "text": "The nature of warfare and geo-politics has changed significantly, and I do not think we will see another conscription into service until a major economic collapse or global destabilization event occurs. Countries are rulled by corporations, and corporations do not have boundaries. We are so intertwined I don't think we could have a major ground war, even with China, if we tried. So the millions into service, bodies to carry guns on a huge battlefield or global war like WW2, just isn't likely to happen again within our lifetimes. Big wars relied heavily on conscription to fill ranks, but that's because they were meat grinder wars with multiple fronts. \n\nIn smaller conflicts, we don't need as many either - peak Vietnam war, we had half a million soldiers in country. Peak Iraq was 170,000. Peak Afganistan was less than 100k. We're able to sustain war with fewer soldiers, so volunteer armed forces have been enough since 1973.\n\nNow for women to be eligible for the draft, by rights, you're correct, women are perfectly capable and should be eligible for the job. But the #1 reason you'd need conscription - a meat grinder of a war - you'd be sending your future mothers off to die in battle, which affects population growth in the future. \n\nLastly, draft cards and filling out selective service paperwork in 2021 is laughable. You can't tell me the 22 million we spend every year to keep the selective service system operational and hundreds of employees is entirely necessary. They were able to round up a pool of millions of potential soldiers fairly quickly in 1917, and while that took some doing to maintain through WW2 and Vietnam. Now that everyone's got a SS number and Google ads keep recommending shit that I browsed online last week, wtf are we doing sending in paper cards? If we ever needed a draft ever again, I'd imagine we could put something together pretty fuckin quick with an excel sheet.",
            "title_similarity": "0.6139647",
            "sentiment_compound": -0.9863
        },
        {
            "id": "h048bxa",
            "score": 1,
            "text": "No one should have to register for the draft. If we’re talking specifically about the US, there’s no reason that a country with no hostile neighbors should maintain a draft, even one that’s unused. It’s barbaric to conscript your citizens, much less when you don’t have a good reason to, and the draft has historically been used only for idiotic or evil purposes.\n\nThe US military has more than enough volunteers, and way more than enough of a budget to secure volunteers. Considering the US doesn’t need to defend its territory, and we are relying less and less on boots on the ground, the draft is a relic that ought to get thrown away.\n\nIt’s silly now, but with the way Congress is, my grandson will ask why he has to register for the draft when every battle has been fought by drone for years. Just throw the thing out and give your enlistees benefits that would entice them willingly.",
            "title_similarity": "0.5957823",
            "sentiment_compound": -0.5511
        },
        {
            "id": "h049e0r",
            "score": 1,
            "text": "Just end selective service",
            "title_similarity": "0.23433876",
            "sentiment_compound": 0.0
        },
        {
            "id": "h049f7z",
            "score": 1,
            "text": "Perhaps we should just abolish the draft in the first place. If a war is being waged on a country which had taken care of its citizens, I'm certain many eligible people would gladly sign up, man, woman, or non-binary alike. If a war is \"justifiable\" (that is, not some proxy war 5000km away), I don't think a compulsory draft is even required to get people to join the forces",
            "title_similarity": "0.692355",
            "sentiment_compound": 0.5017
        },
        {
            "id": "h04a2tv",
            "score": 1,
            "text": "I’d argue that as a first step, women should at least have the chance to sign up for selective service. Like maybe you don’t want to straight up enlist, but you don’t see why you shouldn’t participate in the draft alongside all the men in case you’re needed?",
            "title_similarity": "0.7917052",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h04b4w3",
            "score": 2,
            "text": "The last draft ended in 1972, meaning the oldest person who had to do more than sign up for the selective service is about 67 today. Since that time we do more with technology and less with huge amounts of \"boots on the ground\". While fighting two prolonged wars in Iraq and Afghanistan the idea of issuing a draft was never seriously considered. Ultimately the only scenario where the draft would be used is a war with another super power where inexplicably both sides wouldn't use nukes. In other words there is almost no chance of being drafted so it's hardly a good criteria to withhold right from someone.",
            "title_similarity": "0.4859131",
            "sentiment_compound": -0.4006
        },
        {
            "id": "h04bk50",
            "score": 2,
            "text": "I guess you should lose citizenship at 25, then, too? Will definitely complicate governance, though, since 25 is the minimum age to serve in Congress, and representatives must be citizens.\n\nThe best solution would be to eliminate the Selective Service.",
            "title_similarity": "0.67378545",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h04blt2",
            "score": 1,
            "text": "what \"burden\"?   you're never going to get drafted.",
            "title_similarity": "0.24365824",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h04c2yb",
            "score": 2,
            "text": "\"They're doing their part. Are You? Join the Mobile Infantry and save the world! Service garuntees Citizenship.\"",
            "title_similarity": "0.35458386",
            "sentiment_compound": 0.69
        },
        {
            "id": "h04c4s0",
            "score": 1,
            "text": "Exactly.\n\nWe're all for equality, right?",
            "title_similarity": "0.34991068",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04cgt2",
            "score": 1,
            "text": "The world is constantly changing.  Tech is constantly changing.  If a war broke out enough where we'd need the draft the technological scope then would be so different than it is today we'd rewrite the rules to fit the times.  To change the rules today when there is no risk of a draft doesn't do anything when it would be rewritten when the time is right.\n\nSo therefor, we shouldn't change how the draft works right now.  And because we do not know the future we can not say if women should or should not be apart of the draft in the future.",
            "title_similarity": "0.69077754",
            "sentiment_compound": -0.5245
        },
        {
            "id": "h04cjmy",
            "score": 1,
            "text": "We bear the burden of populating the world",
            "title_similarity": "0.22592257",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h04dszg",
            "score": 1,
            "text": "Wouldn’t it make more sense to say that men should no longer be required to register for the draft? No one should be forced into military service, regardless of sex.",
            "title_similarity": "0.58656454",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h04e4ak",
            "score": 1,
            "text": "I like how Israel does it...every citizen, male or female must serve 2 years, from ages 17 to 19.",
            "title_similarity": "0.41050053",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h04e4bq",
            "score": 1,
            "text": "Maybe we shouldn't be linking the rights and benefits of citizenship to the risk of being randomly drafted and thrown into a hellish warzone to begin with?\n\nThis comes across like those people who say if women want equality then people should be able to hit women too. Equal rights, equal fights. But they totally ignore option 2: don't hit people regardless of gender.",
            "title_similarity": "0.8114557",
            "sentiment_compound": -0.7175
        },
        {
            "id": "h04eark",
            "score": 1,
            "text": "We,women, get raped and beaten and raped again when we are in the service. A lot of shot has to change.",
            "title_similarity": "0.6220243",
            "sentiment_compound": -0.9186
        },
        {
            "id": "h04ef6i",
            "score": 1,
            "text": "I do think it's a little incongruous that men are required to do so while women aren't. But to me the argument should be that we are all treated equally and nobody is forced to sign for selective service.  The draft should just be abolished. Willing enlistees are more than enough to fill the ranks.",
            "title_similarity": "0.789898",
            "sentiment_compound": -0.8047
        },
        {
            "id": "h04f18o",
            "score": 1,
            "text": "So what, are disabled people boy deserving of citizenship because they can’t serve in the military? I don’t understand the connection you are drawing between unalienable rights and military service.",
            "title_similarity": "0.5985402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04ffk0",
            "score": 1,
            "text": "Selective service shouldn't exist in the first place.",
            "title_similarity": "0.47498804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04fy8x",
            "score": 1,
            "text": "Just get rid of selective service. It's pointless with an all volunteer military that we already have ... The largest ever in human history",
            "title_similarity": "0.50569683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04g1h7",
            "score": 1,
            "text": "The executive has the right to raise an army. No where does the constitution imply that equals they are allowed to force you into an army.\n\nTo me, the real question is more how do we fix the issue of allowing scotus to completely disagree our rights when the text is pretty clear.\n\nThe selective service just shouldn’t exist.",
            "title_similarity": "0.63845545",
            "sentiment_compound": 0.1796
        },
        {
            "id": "h04g3py",
            "score": 1,
            "text": "The Canadian Armed Forces (CAF) was one of the first military forces to allow women to serve in all occupations.\n\n:)",
            "title_similarity": "0.39750344",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h04g4oo",
            "score": 2,
            "text": "we need more women plumbers, power line workers, lawn care, sewage, roofing,",
            "title_similarity": "0.5328801",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h04gcmk",
            "score": 1,
            "text": "Get rid of the draft then. The problem isn't women not going to war, is it?",
            "title_similarity": "0.60981417",
            "sentiment_compound": 0.1144
        },
        {
            "id": "h04gjgr",
            "score": 1,
            "text": "Better idea, get rid of selective service in the first place, no one should be forced to bear arms at all",
            "title_similarity": "0.47941673",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h04glzd",
            "score": 1,
            "text": "Selective service should not exist. The draft is slavery. If we cannot remain free without it then we don’t deserve to exist.",
            "title_similarity": "0.6635121",
            "sentiment_compound": -0.8177
        },
        {
            "id": "h04gnqr",
            "score": 1,
            "text": "What rights don't women have?",
            "title_similarity": "0.5301186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04hx17",
            "score": 1,
            "text": "\"Go kill poor brown people or you will starve to death\" - OP\n\nChange my view",
            "title_similarity": "0.5376291",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h04hxg5",
            "score": 1,
            "text": "So this would mean that disabled people don't deserve equal rights nor citizenship...",
            "title_similarity": "0.59573376",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04j93f",
            "score": 1,
            "text": "Selective service should be abolished. All volunteer standing army.\n\nThere should be a nationwide vote to go to war, and if you vote for war you're also entered into the draft.",
            "title_similarity": "0.55198836",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h04jhx4",
            "score": 1,
            "text": "Uh... I have no interest in women serving in combat roles.. as long as that isn’t included then I think they should have to be eligible for draft just like men. \n\nWould I have lost my rights and benefits of citizenship had I not signed up for the selective service?",
            "title_similarity": "0.77364504",
            "sentiment_compound": -0.2686
        },
        {
            "id": "h04jjss",
            "score": 2,
            "text": "The issue I take with this ideology is because it doesn't go far enough into the web of history. Why wouldn't law makers add women to the draft? Because the patriarchy assigned women the role of homemaker. Even when women *wanted* to join the military after white women gained the right to vote in 1919, they were assigned roles such as nurses, secretaries, the ones to clean up after the men. Even when I was in high school (a few years ago) I had men telling me women shouldn't be in the military because men will drop everything to help a fallen female soldier instead of following protocol. I live in a military town, so I assume he was parroting his parents views on women in the military. \n\nThat being said, yes, to be truely equal, women should be eligible for the draft. It's just not women's fault they aren't eligible for the draft. I believe the draft should not exist in the first place. We might as well just enact mandatory military service like Russia or Israel if the draft is so important to maintain and be unisex. I personally don't believe it's every Americans responsibility to fight in the American Governments interests, especially when the American government rarely acts in the interests of the people, and the wars for the last 50 years weren't for America's safety. I come from a military family as well, so I know what the military does to people who volunteered. So personally, I will not advocate for adding women to the draft because I believe it should be abolished.",
            "title_similarity": "0.7460458",
            "sentiment_compound": 0.908
        },
        {
            "id": "h04jk4q",
            "score": 1,
            "text": "I don't see women equally represented in government.",
            "title_similarity": "0.56937027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04jtwv",
            "score": 1,
            "text": "I have seven sons. If there is a draft, why should I be obligated to give up any of my daughters? Are not the seven sons enough?",
            "title_similarity": "0.48746368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04k2yy",
            "score": 1,
            "text": ">I simply believe that in a society that endeavors to be equal,\n\nWho exactly is society? Must everyone be forced into this vague idea of a hive mind by the people that subscribe to the idea that we should be focused on that vague idea of a hive mind? \"Women\" are not focused on this vague idea of \"equality.\" Individuals (an extreme minority of them mind you) that are both men and women are. Do the individuals that the rest of the people did not elect for them to speak for them but are anyway, then get to dictate how we approach all of the people of their purported grouping (Women, men, black, white, so on and so forth?) \nYou're free to believe as you wish. However I am against it because I do not believe that having laws forced on me is a good excuse to force them on others whether I am the majority or the minority. \n\nThis is literal mental abuse. And it is the exact same ideology an abuser uses to justify their abuse to themselves. I was hurt so I hurt them. I was worried so I worried them by threatening them etc. Pushing things into vague boxes with so many facets that it's impossible to argue against is also a manipulative tactic. \"Women\" do this, or \"men\" do that. As if they are a hive mind and not individuals, so we must control all of them instead of the individual. \"Black community,\" \"white community,\" \"gay\" or \"trans community,\" so on and so forth. These communities do not exist outside of a very small portion of the population that they claim to represent. I get it, it's being used against you and it is extremely frustrating. That is the point of that particular manipulative tactic. It causes \"cognitive dissonance\" because it places two opposing thoughts (individuals and groups) together and attempts to make them indescernible from eachother. This is psychologically inconsistent and it is fabricated by the groups of people that use it for exactly that purpose. The natural response is to fight fire with fire. We can see this in effect in so many facets of this so called \"society\" right now. However the only response that has any hope of a positive outcome is to stay true to yourself and distinguish the individual from the 1% that are attempting to manipulate the 99% using this tribal drivel and media as a vessel.",
            "title_similarity": "0.82803273",
            "sentiment_compound": -0.9881
        },
        {
            "id": "h04k6y6",
            "score": 1,
            "text": "Or maybe selective service is forced coercion and any supposedly civilised society would abandon it for everyone.",
            "title_similarity": "0.6626097",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h04kgy6",
            "score": 1,
            "text": "\"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the States wherein they reside.\"   Selective service is not a requirement for citizenship.  Would you also deny the rights and benefits of citizenship to the disabled?\n\nJust a few weeks after the United States entered World War I the U.S Congress passed the Selective Service Act on May 18, 1917, giving the U.S. president the power to draft soldiers.  At the time this was passed there was one woman in Congress, meaning this law was passed by men.  Women have fought long and hard to lift the restrictions men have placed on their abilities to join and participate equally in the military.",
            "title_similarity": "0.6446771",
            "sentiment_compound": 0.765
        },
        {
            "id": "h04lc3e",
            "score": 2,
            "text": "The draft and selective service were completely eliminated in the United States after the Vietnam War ended.  And there's a group of men born between say 1957 and the end of 1959 who were legally exempted from any requirement to ever register from the draft.  \n\nThe draft/selective service  was brought back by the Reagan Administration after 1980.  All men born starting in 1960,  on have been required to register when they turn 18.   It is essentially the system we have now. \n\nNow to the point of the topic.   Why were women excluded from this requirement in the 1980s?\n\nAnswer:  While the USA strives to make society equal between Men & Women, our enemies do not.  In some cases women don't even have rights.   If a male soldier were captured by our enemy there's an expectation he'd be treated as a fellow soldier by the enemy and given some rights as a POW.   On the other hand a woman solder might not be by the enemy.  Especially an enemy with an all male army.   And furthermore this might also cause trouble for all American POWs.   \n\nSo the argument was made to exclude women from the selective service requirement.",
            "title_similarity": "0.59958977",
            "sentiment_compound": -0.9743
        },
        {
            "id": "h04lsfa",
            "score": 1,
            "text": "Wouldn't it be easier, and just as effective, to not base basic rights of citizenship on signing up for a mandated draft at all, considering we've not need it for decades now?",
            "title_similarity": "0.50115633",
            "sentiment_compound": 0.1945
        },
        {
            "id": "h04nil5",
            "score": 1,
            "text": "I think a better option is to remove selective service",
            "title_similarity": "0.40865096",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h04nj9s",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10606375"
        },
        {
            "id": "h04olj0",
            "score": 1,
            "text": "I wouldn't consider selective service to be a right; something that you should cherish. You have no choice, you will fight if you are told to fight. And for the majority of society, we do not make that choice. In fact, the wealthy powerful well to do, do. So this is an example of oppression in which, women were and are still lucky enough not to be subject to. In real terms, there are rights that the powerful class have, that whether you're a man or a woman you don't have. Why do you think the poor fight the war? The wealthy and their children aren't subject to this same mandatory listing. Sure they list, but they don't get picked. So, for the poor and middle class men, women have rights by nature you don't have, and I wouldn't dare subject them to that same state oppression.",
            "title_similarity": "0.7785632",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h04p1dv",
            "score": 1,
            "text": "Nobody should be forced to fight a war.",
            "title_similarity": "0.42672348",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h04p4zk",
            "score": 1,
            "text": "OP has this exactly backwards. The *inalienable rights endowed by the creator*, as Jefferson put it, exist no matter what human systems of government do. (See also the Universal Declaration of Human Rights.) these rights are not granted *by* government in exchange for some condition of service. \n\nWhether selective service registration should be extended to all is a district question. If we’re going to keep doing that, then yes perhaps it would be better to register all. (Alternatively, if you’re registering everyone, there’s not a lot of point to registering *anyone*: the feds know by other means that you exist.",
            "title_similarity": "0.7006737",
            "sentiment_compound": 0.584
        },
        {
            "id": "h04pk0h",
            "score": 2,
            "text": "This is one of those things where technically you're right that selective service should either be eliminated wholesale or women should be included in it. \n\nBut given that the last time the draft was called up was 50+ years ago I think this is definitionaly \"low priority\"",
            "title_similarity": "0.6940713",
            "sentiment_compound": -0.3919
        },
        {
            "id": "h04qd5p",
            "score": 1,
            "text": "Sure they should...equality is equality",
            "title_similarity": "0.33018237",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h04qqaw",
            "score": 1,
            "text": "If they have selective service, then one must include full access to reproductive health at her discretion. To allow for abortion, in case she is called upon to kill other people.",
            "title_similarity": "0.65682006",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h04qqvh",
            "score": 1,
            "text": "How about men take on pregnancy?",
            "title_similarity": "0.32336718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04qr48",
            "score": 1,
            "text": "Counterpoint: The selective service shouldn't exist.\n\n&#x200B;\n\nI'm in a wheelchair and I have to tell these fuckers every year that I'm crippled. I shouldn't have to do that.",
            "title_similarity": "0.5269835",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h04qr4h",
            "score": 1,
            "text": "I'm late to the game here, but there's an important piece of this I didn't see discussed yet.\n\nThe Selective Service System is about maintaining the administrative and logistical infrastructure for a draft; it is not itself a draft. I don't think that this is a trivial or semantic issue. \n\nRegistering with SS a very negligible burden. It requires men 18-26 to submit their contact info etc. to the agency; and to update it when you move and so on (which I presume almost nobody does). That is all. It's a burden replicated all the time for work, school, a doctor's office. \n\nBecause there's no comprehensive government database of everybody's basic info, it's about keeping track of those who were thought (a half a century ago) to be most likely subject to a hypothetical draft. The goal is to reduce initial mobilization time to a minimum, by ensuring you already have contact/personal info for a chunk of people. \n\nBeing required to register has zero additional burdens. If and when there is ever a draft, the draft may not authorize conscription of some who are required to register (as in Vietnam, which didn't draft over 21yo IIRC). Or it could conscript people who *aren't* registered, as likely would happen in reality with women; or in the case of a WWII-level situation, people much older than those in the SS registry. \n\nThe registry is merely extra paperwork now, to save time on paperwork in an emergency. Because any plausible draft law would include some portion of men 18-26, having at least some useful info means they can get shit letters sent and calls made to some subset of conscripts ASAP. The practical impact on men 18-26 who actually keep their info up-to-date, and are authorized in a draft law, is that they may receive their draft letter some weeks earlier than their sister. I guess they could end up at boot camp a bit earlier, too. But that seems arbitrary in terms of being a burden, or at worst still negligible.",
            "title_similarity": "0.5547267",
            "sentiment_compound": -0.9658
        },
        {
            "id": "h04ra8j",
            "score": 2,
            "text": "I would agree if sexual assault and rape were not huge problems in the military. If that is still scooted under the rug, nope.",
            "title_similarity": "0.56428987",
            "sentiment_compound": -0.772
        },
        {
            "id": "h04rgz3",
            "score": 1,
            "text": "Should Trump have been eligible for president after cowarding out from military service?\n\nWhy stop at woman? If your boy is born with a disease that prevents him from serving, should we deny him all the benefits and rights of citizenship?\n\nDid the black soldiers that served in WW2 have the full benefits of their citizenship when they came back home?",
            "title_similarity": "0.6537957",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h04roal",
            "score": 2,
            "text": "... no one is going to fix the **fundamental issue that you think women as is shouldn't have rights as citizens** but... If there is going to be a draft, have it be equal. But there SHOULDN'T BE. The draft is a fundamental violation of our sovereignty as citizens in a democratic republic and it needs to be left with the rest of the barbaric past. If a war doesn't have enough public support to fight it, **it is not a valid war.** Its a person in power trying to seize more.",
            "title_similarity": "0.79851717",
            "sentiment_compound": -0.7834
        },
        {
            "id": "h04ruk3",
            "score": 1,
            "text": "First let’s have women meet the same standards and capabilities as the men in the military if they want equal pay and advancement opportunities. No lowering of anything so they can pass.",
            "title_similarity": "0.62030977",
            "sentiment_compound": 0.5007
        },
        {
            "id": "h04sl92",
            "score": 1,
            "text": "Or.... Just ban the force of selective service.\n\nIf you want to join, join. If you don't. Dont...",
            "title_similarity": "0.39075658",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h04sr5n",
            "score": 1,
            "text": "I get you man. No one should lose their \"benefits as a USA citizen\" but women should have to sign up for the draft. Pretty simple point.  These folks nitpicking it will nitpick anything.",
            "title_similarity": "0.7364365",
            "sentiment_compound": 0.5647
        },
        {
            "id": "h04ssvd",
            "score": 1,
            "text": "Selective service and wars need to be abolished in the first place.",
            "title_similarity": "0.577955",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h04svak",
            "score": 1,
            "text": "100% agree with OP.",
            "title_similarity": "0.22891453",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h04t4w4",
            "score": 1,
            "text": "If by elegable for  you mean subservient to. A woman is free to join the military  if they choose to.",
            "title_similarity": "0.4773556",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h04tj5p",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.11395411"
        },
        {
            "id": "h04tzi6",
            "score": 2,
            "text": "Women are fine with it.  Really.  We've been begging to serve in the armed forces *forever* but we keep being told we're bad for *foxhole morale*.\n\nWhat makes you think the country's women are the ones holding things up when the majority of government leaders are men?  Is that who you're trying to convince?  If so, perhaps the message should change away from burden to something more like: *women are and* ***always have been ready, willing and able to sacrifice for their country.***\n\nDoes anyone honestly think women haven't?  Do you?\n\nEdit:  Wow, my spelling needed help.",
            "title_similarity": "0.8283421",
            "sentiment_compound": 0.9428
        },
        {
            "id": "h04u0qm",
            "score": 1,
            "text": "Alternative idea: nobody should be eligible for selective service",
            "title_similarity": "0.4253882",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04v516",
            "score": 1,
            "text": "i’d suggest drafts are stupid and should be not a thing anymore. 100% agree op i just think we probably have opposite solutions.",
            "title_similarity": "0.5948698",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h04v8bs",
            "score": 1,
            "text": "Well… equality for all means… every one being equally responsible for pulling the same weight. We have dudes in chicks gymnastics and weight lifting… surely equality means equality in all cases",
            "title_similarity": "0.5144652",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h04v9hy",
            "score": 2,
            "text": "So your view is one held by people who didn’t want woman to have the right to vote? Dummy. No one should have to sign up for selective service.",
            "title_similarity": "0.7097137",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h04vj2y",
            "score": 1,
            "text": "You know what's a better idea? Just get rid of selective service.\n\nLet's apply your argument to a similar adjacent \"rights and services\" access: healthcare. Since healthcare is provided through employers, then those from the age of 18 through 65 who are not employed should not get the full benefits of healthcare. This is essentially, the argument of those against universal healthcare (they won't say that though, because it very obviously puts them in the wrong and makes them sound like bad guys.)\n\nYou're making the same argument, and it's a rather callous one that supports a stupid system because it's easier to attack women's rights in this political landscape than it is to attack the military industrial complex.",
            "title_similarity": "0.75749433",
            "sentiment_compound": -0.886
        },
        {
            "id": "h04vwnn",
            "score": 1,
            "text": "Women makes for shitty recruit, the army is supposed to be a highly effectif force, why do you want to fill half of it's ranks with worsed recruits ?",
            "title_similarity": "0.8047632",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h04w5n6",
            "score": 1,
            "text": "Or we just do away with the draft in its entirety because the government shouldn't be able to force you into a situation where you could literally die over a mess that they most likely caused.",
            "title_similarity": "0.64951605",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h04we2p",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h04wsnw",
            "score": 1,
            "text": "Its not women who wrote the laws. And its barely women writing the laws now.",
            "title_similarity": "0.4878306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04x153",
            "score": 1,
            "text": "Get back to me son, as soon as men start having half the babies.",
            "title_similarity": "0.39826104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04x20y",
            "score": 2,
            "text": "I’ve done, done my service. But FYI if you do implement this: please do something about that rape culture in the military. I served in Alaska and I know where it stands just about 99% of women who join the Alaska Army continue getting raped/sexually harassed. I’d fix that before making it 100% compulsive to get benefits. \n\nMaybe make the military more women then men. Then something would get done around the Alaska Army. (It’s been over 10 years since I served so it’s old news)",
            "title_similarity": "0.6472788",
            "sentiment_compound": -0.0933
        },
        {
            "id": "h04x4sj",
            "score": 1,
            "text": "Your argument predicates specific rights on selective service and potential military combat.   What rights should be attached to selective service?",
            "title_similarity": "0.45906112",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h04xjo5",
            "score": 2,
            "text": "I love how these “views” skip over hundreds of years of history, typically the parts where people are discriminated against due to them having lady parts, different skin color or different sexual preferences. \n\nMaybe review what women HAVE NOT equally received before you jump to huge “all things being equal” platitudes.",
            "title_similarity": "0.78044754",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h04xo77",
            "score": 2,
            "text": "Obviously, not many people think we should have a draft *at all*, but you're ready for that argument.  Therefore, I will argue a bit of devil's advocate where we assume that we need the draft and men must register.\n\nThe draft is an anachronism of an older time, where the idea of having mass amounts of unenthusiastic, poorly trained meat sacks carrying weapons was even a possibly useful idea in war.\n\nIf we were ever in a situation where a draft made sense, then it means we are in a war with shockingly high casualty expectations.  Like, we need so many bodies on the front that we'd sacrifice bodies at home making weapons to put them on the front.  Like... it's going to be so bad that even those most of these draftees are just there to soak up bullets so the people who are better trained can survive longer.\n\nIn such an unthinkably insane retrograde war scenario, we're going to need more bodies.  And the only way to make more bodies is *women*, so drafting young women into combat roles would be counterproductive to waging such a war.",
            "title_similarity": "0.68739724",
            "sentiment_compound": -0.9915
        },
        {
            "id": "h04xxkj",
            "score": 1,
            "text": "So you're saying we're equal...? Give me equal pay for equal work and complete bodily autonomy and we'll talk.",
            "title_similarity": "0.50136477",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h04y0iv",
            "score": 2,
            "text": "You dont draft women because if you kill off enough of the service age women, you have no one left to make more soldiers.",
            "title_similarity": "0.6305984",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h04z761",
            "score": 1,
            "text": "Selective service is slavery and the fewer people it applies to the better.",
            "title_similarity": "0.55270493",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h04z96b",
            "score": 1,
            "text": "Service guarantees citizenship",
            "title_similarity": "0.18366516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h04zuld",
            "score": 1,
            "text": "Surely nobody being forced into the murder squad would be better, no?",
            "title_similarity": "0.5775264",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h050bc2",
            "score": 2,
            "text": "My wife didn’t know this was a thing all men have to do.  I wonder how many woman don’t realize that all men have to sign up, and theoretically could be called to join the military without a choice if shit really hit the fan.",
            "title_similarity": "0.7145983",
            "sentiment_compound": 0.0422
        },
        {
            "id": "h050kep",
            "score": 1,
            "text": "Hot take, **no one** should be eligible for the Selective Service. I think it's wrong, in this modern day and age, for *anyone* to be drafted and made to serve in the military against their will. People should be free to choose whether or not they want to die for their country *regardless* of gender.\n\nI think the whole Selective Service system is broken and should be done away with.",
            "title_similarity": "0.76797956",
            "sentiment_compound": -0.7919
        },
        {
            "id": "h050okn",
            "score": 1,
            "text": "You want to take rights away from people? What rights do you believe need to be earned?",
            "title_similarity": "0.56716955",
            "sentiment_compound": 0.168
        },
        {
            "id": "h050qpj",
            "score": 1,
            "text": "No one should have to register for the draft. Why not stop oppression, instead of increasing it, for equality?",
            "title_similarity": "0.60329634",
            "sentiment_compound": -0.0803
        },
        {
            "id": "h050x3l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h05103y",
            "score": 1,
            "text": "I don't think it's fair that half the population don't get periods or have to suffer childbirth. Wanna switch?",
            "title_similarity": "0.669773",
            "sentiment_compound": -0.6664
        },
        {
            "id": "h051eoz",
            "score": 1,
            "text": "You in USA? In USA citizenship is a birthright and has nothing to do with military eligibility.",
            "title_similarity": "0.28216633",
            "sentiment_compound": 0.0
        },
        {
            "id": "h051k10",
            "score": 1,
            "text": "Fuck the draft - male or female. Mandatory conscription is not compatible with a free society or liberty. If you are involuntarily forced to serve in the military, are you really free at all?",
            "title_similarity": "0.66378546",
            "sentiment_compound": 0.624
        },
        {
            "id": "h051kcu",
            "score": 2,
            "text": "If a war is so bad that it requires a large portion of the population to be drafted, you do not want women to be the ones forced to go. The reason is simply based around repopulating the country. 1000 woman and 500 men can repopulate much quicker than 1000 men and 500 women. The more women a country has, the more soldi....people is can make.",
            "title_similarity": "0.8051343",
            "sentiment_compound": -0.8982
        },
        {
            "id": "h0525ir",
            "score": 1,
            "text": "This puts a theory of government above an undeniable fact.  Women are different from men.  Nothing can change that.  Accept it and figure out how best to deal with it.",
            "title_similarity": "0.7442603",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h052uzj",
            "score": 1,
            "text": "Nobody should be eligible for selective service. If the people don’t want to fight in a war, the top brass has absolutely no business fighting that war.",
            "title_similarity": "0.6144165",
            "sentiment_compound": -0.8562
        },
        {
            "id": "h0536jl",
            "score": 1,
            "text": "Selective service shouldn't exist.  What is this Starship Troopers?  Fuck off",
            "title_similarity": "0.44206613",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h053wiz",
            "score": 2,
            "text": "As a militarized nation we probably don’t want to loose out on future soldier production pipeline. War isn’t fair by nature, and the side that wins the long war gets to have regrets on how unfair their society was. Until we can bio print humans in fabrication centers for the pentagon, the DoD can make the call when it’s time to start conscripting the soldier printers we do have.\n\n\nThis is also the Information Age. Selective service is already redundant when states already have a 99% accurate list of their population and can supply militarum regiments when requested by the Congress. If we need to start conscripting women then ICE can be retasked quite effectively, impressment conducted at major population centers, and penal regiments easily supplied.\n\n\nI need to stop watching starship troopers.",
            "title_similarity": "0.7384036",
            "sentiment_compound": -0.7708
        },
        {
            "id": "h053yyz",
            "score": 1,
            "text": "I think until the government stops telling women that their body isn’t fully their own, then I think men only in selective service makes it a fair balance. Women: put your body in danger by having children, whether you want to or not. Men: put your body in danger by taking up arms, whether you want to or not. \n\nSeems if we suddenly made women today equally share in a selective service situation, then they’ve got a double burden where men do not.",
            "title_similarity": "0.7917495",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h054b6o",
            "score": 1,
            "text": "But we DON’T,",
            "title_similarity": "0.054478854",
            "sentiment_compound": 0.0
        },
        {
            "id": "h054iv4",
            "score": 1,
            "text": "What actually needs to happen is that the Selective Service & its mandatory registration needs to be abolished.",
            "title_similarity": "0.5324883",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h054l9v",
            "score": 1,
            "text": "i feel like the better take is that there shouldn't be a selective service period, but yes it is definately an aspect of sexism and toxic masculinity hurting men that only men have to sign up for selective service",
            "title_similarity": "0.7512907",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h054qea",
            "score": 1,
            "text": "Or we could remove the draft entirely like most feminists actually want.",
            "title_similarity": "0.6995239",
            "sentiment_compound": 0.5198
        },
        {
            "id": "h054r57",
            "score": 1,
            "text": "We are always 2nd fiddle , but we give you the children you need to have a war. Why do we have to go kill someone else’s children if we won’t be good, I’m too old and I’d be 4F but if women would like to be part of the draft, they have to receive the same rights and dignities as men. Men don’t get that we don’t have that already.",
            "title_similarity": "0.7729457",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h054t99",
            "score": 1,
            "text": "Or hear me out....\n\nwe should just cancel it for everyone.\n\nMen shouldn't have to fear being drafted to fight either, especially when our wars primarily benefit corporations not everyday Americans.",
            "title_similarity": "0.6583554",
            "sentiment_compound": -0.4283
        },
        {
            "id": "h054tit",
            "score": 1,
            "text": "If you follow an Abrahamic faith, you should then believe no woman can fight in war except possibly as nurses. If you’re a new modern pussy boy, you’d say the opposite",
            "title_similarity": "0.63989365",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h054x6c",
            "score": 1,
            "text": "I don't have a problem with mandatory military service for men and women in certain situations and I don't have a problem with requiring women to register for selective service but I think you may be overlooking the reason we are not required to.\n\nSelective service was so the military would have an idea of the available human resources primarily for combat positions, which women were barred from. Couple that with the fact that women could become pregnant at any time and may very well do so to get out of service, it didn't make sense to have women register for selective service in the past. Maybe it makes more sense now, but the military seems to prefer men for combat so I'm not sure much would change except the database size if women were to register.",
            "title_similarity": "0.76494235",
            "sentiment_compound": -0.4572
        },
        {
            "id": "h055pu2",
            "score": 1,
            "text": "I suggest we fight for citizens rights to not have to almost die so that we can kill innocents in another country so we can get oil and other commodities to make the rich richer.",
            "title_similarity": "0.6134622",
            "sentiment_compound": -0.4228
        },
        {
            "id": "h055uae",
            "score": 2,
            "text": "I'm sure there are folks in the thread who will argue against the actual statement, but my contention is that most of the beef with this POV is not with the argument itself, but how it is used. I think a lot of folks genuinely hold this view in good faith, but many bad faith actors will use this type of argument specifically to disrupt an ongoing discussion about some other aspect of discrimination that women might face. In that bad faith argument are some nasty assumptions about how much women are really willing to sacrifice or work to 'earn' their equal treatment. So on a gut level a lot of folks respond to that feeling rather than the argument itself IMO.",
            "title_similarity": "0.8651879",
            "sentiment_compound": -0.7805
        },
        {
            "id": "h056ljr",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.11395411"
        },
        {
            "id": "h057goq",
            "score": 1,
            "text": "More like selective service should not be a thing.",
            "title_similarity": "0.27674842",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h057k5l",
            "score": 2,
            "text": "I believe in something known as voluntarism.\n\nAll exchanges of services in society must be voluntary, or its theft.\n\nBy this logic, selective service is theft. All military personnel must join voluntarily, or its evil.",
            "title_similarity": "0.66756165",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h057t54",
            "score": 1,
            "text": "Instead of half the population being subject to literal mortal slavery, we need all the population to be subject to it....",
            "title_similarity": "0.6918562",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h058669",
            "score": 1,
            "text": "I don't know why the equality has to be doled out in a way where neither can't choose, and it's forced. I think the equality should be doled out in a way where both can choose whether they want to or not. Fighting for equality genereally isn't about creating less choices for more people. Fighting for equality is often times about creating more choices for more people. \n\nMaybe that completely goes against what a draft is, maybe it's completely un-nationalistic, but I personally don't think it's true equality that any human being needs to be forced, that automatically makes neither the average men or women equal to the one who is doling out that order. If we go by your argument, then why aren't all the people doling out these orders not the one fighting their own wars that they created.",
            "title_similarity": "0.77638185",
            "sentiment_compound": -0.9187
        },
        {
            "id": "h058ho2",
            "score": 1,
            "text": "I can't agree because I don't believe anyone should be required to serve in the military. I didn't choose to be born here. I like my country enough, but I don't owe it anything beyond paying my taxes, not breaking the law, and generally being kind and respectful to people I encounter. I don't need to put my life on the line to protect it unless I decide I want to.",
            "title_similarity": "0.5620364",
            "sentiment_compound": 0.928
        },
        {
            "id": "h0595vr",
            "score": 1,
            "text": "Once I have the right to make my own medical decisions as a woman you can draft me.",
            "title_similarity": "0.56597674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h059n50",
            "score": 2,
            "text": "Sounds like a perfect way to use the military, and therefore a perfect way for some group of politicians, to decide who gets to be a citizen and who doesn't (or, who gets to have 'the rights and benefits of citizenship' as you put it but really what's the point of citizenship if you don't have those?). Gay or trans? Sorry, we have laws banning you from the military. Sorry, no rights for you. Blind? Sorry. Disabled? Sorry. Colored? Sorry. Do you really have no idea how badly this could be misused? Try to remember that being in the military is a 'service', not a means for someone to gain rights or privileges over others who haven't. You're there to protect and serve. In your plan, you're one short step away from all of that being turned on it's head and the military saying 'Hey, you serve us now. We're the chosen elite'.",
            "title_similarity": "0.7039412",
            "sentiment_compound": 0.3904
        },
        {
            "id": "h059o4w",
            "score": 1,
            "text": "Im with OP on this one. Watched Starship Troopers the other night. “SERVICE GUARENTEES CITIZENSHIP”",
            "title_similarity": "0.26177084",
            "sentiment_compound": 0.0
        },
        {
            "id": "h059p3g",
            "score": 1,
            "text": "Stick your draft up your ass.",
            "title_similarity": "0.23387809",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h05a2wg",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.11395411"
        },
        {
            "id": "h05a652",
            "score": 1,
            "text": "Oh great, this post again. And again. And again! Thank goodness I get to read about this from a different genius every single Goddamn day. \n\nY'all. Check the sub before you post there and make sure there's not 400 other people saying the exact same shit. Please.",
            "title_similarity": "0.51386654",
            "sentiment_compound": 0.7777
        },
        {
            "id": "h05a9cn",
            "score": 1,
            "text": "This is almost universally agreed upon by people with a brain. Bad post.",
            "title_similarity": "0.47650528",
            "sentiment_compound": -0.3976
        },
        {
            "id": "h05acvv",
            "score": 2,
            "text": "Women did not make this law in the first place, it was men who made the law. So you're saying that women should not get full benefits of citizenship of a law that was passed by men? That's pretty fucked up.",
            "title_similarity": "0.7816063",
            "sentiment_compound": -0.5242
        },
        {
            "id": "h05aggf",
            "score": 2,
            "text": "Historically draft applied only to men partly because of the casualty rates of war. It’s much easier to repopulate with a diminished population of men than it is with a diminished population of women. This fact doesn’t really change regardless of how progressive or egalitarian a society gets.",
            "title_similarity": "0.6051831",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h05ahif",
            "score": 1,
            "text": "But we birth new soldiers. You need us.",
            "title_similarity": "0.3710193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05aui7",
            "score": 1,
            "text": "Can we also have positions of power too and enough fucking pay to fuckin live? Can we have that? Can I have that please",
            "title_similarity": "0.5517263",
            "sentiment_compound": 0.2422
        },
        {
            "id": "h05bdzt",
            "score": 1,
            "text": "Men can't give birth to replace the dead",
            "title_similarity": "0.42816302",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h05bjh7",
            "score": 1,
            "text": "Female here. Just give me some power please I won’t do you wrong male or female. I’ll do it good. I got it. Give me some power. I have no credentials but no worries I’ll do it right.",
            "title_similarity": "0.58170426",
            "sentiment_compound": 0.4493
        },
        {
            "id": "h05bv41",
            "score": 2,
            "text": "Currently women in the military have a high likelihood of getting sexually harassed or assaulted. Higher ups have made consistent efforts to sweep this under the rug. Women forcibly serving puts them in great danger of being abused by their fellow soldier before the actual enemy. I'm all for women serving their country, but it's not even safe for women to join the military on their own accord.",
            "title_similarity": "0.7983663",
            "sentiment_compound": -0.7788
        },
        {
            "id": "h05crik",
            "score": 1,
            "text": "The draft is a moot point. It won't actually happen again in reality",
            "title_similarity": "0.3987431",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05cssv",
            "score": 1,
            "text": "Men should not be part of selective service either. Change my mind.",
            "title_similarity": "0.52796054",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05ddic",
            "score": 1,
            "text": "Works for me. Women a lot of roles in the military already.",
            "title_similarity": "0.4988076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05dgyh",
            "score": 1,
            "text": "Nah. Men make all the trouble.",
            "title_similarity": "0.42436942",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h05dh9n",
            "score": 1,
            "text": "> This actually was a counter argument to the suffragettes during the debates over the 19th amendment that they would then have to bear the burden of eligibility for the draft.\n\nThat was an argument *made by conservatives* who opposed equal rights. Feminist groups have tried to force the selective service to be gender-equal for many decades now. Conservatives keep opposing it.",
            "title_similarity": "0.7790698",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h05dhhs",
            "score": 1,
            "text": "Just end selective service already.",
            "title_similarity": "0.28009245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05doo8",
            "score": 1,
            "text": "For what it’s worth, I personally have come to find the idea that either a draft or form of national service (i.e. working in a non profit or entity reminiscent of the depression era civilian conservation corps) be mandatory for everyone persuasive on two fronts. First, it could be a force for community and provide an integrating force for our society. I’m posting as an American, but it feels like so many people haven’t met people that different from themselves and military or national service could assist with that. A second argument advanced with this kind of proposal is that it would make the costs of military action far higher.",
            "title_similarity": "0.7084024",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h05e3ft",
            "score": 2,
            "text": "Women carry on our future generations. There's a reason when you hunt animals in the wild you cant collect females sometimes. If you take out the females it will hurt the population significantly more than if you take out the males.",
            "title_similarity": "0.70236045",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h05ejp0",
            "score": 1,
            "text": "Counterpoint: rights are not something that the government can (legally) give or take away. That’s why they are rights. Everyone should have rights, period.",
            "title_similarity": "0.5885216",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h05fw0l",
            "score": 1,
            "text": "Is it so terrible to be unequal?  I'm not saying one sex is better than another, just not equal.... Why is that so difficult to accept and be ok with ?",
            "title_similarity": "0.6811724",
            "sentiment_compound": -0.464
        },
        {
            "id": "h05fysi",
            "score": 1,
            "text": "CMV: Selective service for only men is sexist and women should be required to sign up for selective service. There, fixed your title.",
            "title_similarity": "0.7962779",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05fz5q",
            "score": 2,
            "text": "This is old data but it makes the point. As of December of 2004 \"nearly 26 million Americans living today have served in the military\" (note 1) which equates to ~7.926% of the current population.\n\nGranted ours is a voluntary service military, men / males are required to register. 'if required to register with Selective Service, failure to register is a felony punishable by a fine of up to $250,000 and/or 5 years imprisonment. Also, a person who knowingly counsels, aids, or abets another to fail to comply with the registration requirement is subject to the same penalties\n\n Some States have created additional consequences for men who fail to register.\n\nWomen are NOT required and are not subject to the same forfeitures if they do not. I'm all about equality, but you can't ask for equality and not accept the terms. \n\nNote 1: https://www.prb.org/resources/americas",
            "title_similarity": "0.54306674",
            "sentiment_compound": -0.9687
        },
        {
            "id": "h05gcwa",
            "score": 1,
            "text": "I’m a woman who would nope the fuck out of the country if I had to serve, but I still agree. Are we equal and should be allowed to serve on the frontlines or are we fragile and needed to take care of the kids while the man is at war? Pick a lane.",
            "title_similarity": "0.76416016",
            "sentiment_compound": 0.481
        },
        {
            "id": "h05geuw",
            "score": 1,
            "text": "With the same logic men shouldn’t have the same rights as women because men cannot give birth to children.",
            "title_similarity": "0.6807765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05gi7h",
            "score": 1,
            "text": "As a female Army Veteran, I would argue that if you have to force your citizens into war by using the selective service, maybe we shouldn’t be in that war... that you are forcing your citizens to fight and die in. This argument has nothing to do with women’s rights.",
            "title_similarity": "0.73167264",
            "sentiment_compound": -0.9595
        },
        {
            "id": "h05hm8g",
            "score": 1,
            "text": "Lots of men die in war - there are still women left to replenish the population. Lots of women die in war - population cannot recover. There is a reason women have never (almost) faught in wars in the numbers that men did. Not even in antiquity.",
            "title_similarity": "0.6563016",
            "sentiment_compound": -0.9635
        },
        {
            "id": "h05hqc9",
            "score": 1,
            "text": "Nah we should just eliminate the draft.",
            "title_similarity": "0.34627217",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h05hscw",
            "score": 2,
            "text": "For every person alive there is a woman that has had to take on the risk of pregnancy.\n\n\nSelective service is one of few things men can do of somewhat equivalent risk.\n\nMost women really don’t get to opt out of that risk, contraceptives or not, for civilization to work. Men should risk themselves in an equivalent way for society.",
            "title_similarity": "0.81620336",
            "sentiment_compound": -0.5456
        },
        {
            "id": "h05htya",
            "score": 1,
            "text": "There just shouldn’t be selective service, you shouldn’t be forced to goto or war goto jail bc you want to vote and have a drivers license what the fuck?",
            "title_similarity": "0.57670164",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h05hu6t",
            "score": 1,
            "text": "When men also have to bear the responsibilities to grow a parasite for nine months or at least can allow women the right to choose weather or not to let a parasite grow within them we can talk about the draft. There are much larger issues in society that disproportionately affect women. \n\nOn another note I would love to serve in the military but am dissuaded by the fact that reported sexual assault cases continue to increase every year for both gender but higher for females.",
            "title_similarity": "0.6745398",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h05i52n",
            "score": 1,
            "text": "How about doing away with selective service and never drafting anyone ever again? That seems fair.",
            "title_similarity": "0.33546075",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h05i8f5",
            "score": 1,
            "text": "if men want to be citizens, they need to prove that they are capable of carrying life and delivering it into the world. the end",
            "title_similarity": "0.47499564",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h05ib19",
            "score": 1,
            "text": "No one should be drafted. If there are not enough people willing to fight in a war then it's not a war worth fighting.",
            "title_similarity": "0.5912897",
            "sentiment_compound": -0.828
        },
        {
            "id": "h05ioaa",
            "score": 1,
            "text": "What about rich people that hire doctors to write them fake injuries?",
            "title_similarity": "0.53140724",
            "sentiment_compound": 0.128
        },
        {
            "id": "h05iqvz",
            "score": 1,
            "text": "Selective service is simply slavery, nobody should be eligible for slavery.",
            "title_similarity": "0.5488889",
            "sentiment_compound": -0.891
        },
        {
            "id": "h05jie0",
            "score": 1,
            "text": "And men should have to bear children",
            "title_similarity": "0.41586745",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05k5tb",
            "score": 1,
            "text": "Service guarantees citizenship. \n\nWould you like to know more?",
            "title_similarity": "0.29528022",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h05kblv",
            "score": 2,
            "text": "The whole “women aren’t forced to serve” May very well have something to do with not completely obliterating the female population by shoving them into the front lines when/if we go Into a full scale war. \n\nNot only is this a sloppy slope it’s a really horrendous take.",
            "title_similarity": "0.8151457",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h05kixm",
            "score": 1,
            "text": "I’m not eligible for selective service because of a hearing disability, so I not deserve the full rights and benefits of citizenship?",
            "title_similarity": "0.6146585",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h05kjyl",
            "score": 1,
            "text": "I agree. I'm surprised it hasn't already happened since there are so many already in the armed forces and the female population of the US has been on the rise. You can bet your ass that if we were to find ourselves in another World War, it will happen. That's how selective service started. Actually, if we ever find ourselves needing to start drafting again, for whatever reason, it will happen.",
            "title_similarity": "0.69229996",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h05kul5",
            "score": 1,
            "text": "As a woman and a veteran, I agree with you.\n\nI would add that I would change the Selective Service requirement to instead be public service in a corps or any kind, though. Just because conscientious objecting is a thing that should be open to everyone.",
            "title_similarity": "0.6926327",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h05l3hu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10606375"
        },
        {
            "id": "h05l5vy",
            "score": 1,
            "text": "Abolish selective services.",
            "title_similarity": "0.29649165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05licw",
            "score": 1,
            "text": "The draft is ridiculous.",
            "title_similarity": "0.42623562",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h05lmcj",
            "score": 1,
            "text": "0) Rights are unalienable. Benefits of citizenship are not earned, they are granted by society so that our society can be one worthy of preservation. \n\n1) There should be no draft in a liberal democracy. If there is a threat to the nation, lack of willing soldiers means the threat isn't serious or the nation is no longer worth saving. \n\n2) If you are going to be as authoritarian as to require men to end lives, you might be as authoritarian to require women to create lives. \n\n3) While we can debate men vs women's ability to end life, women are unrivaled in their ability to create life. Therefore, an authoritarian might decided to keep women available for doing that which they are singularly capable.\n\nThere should be no forced murder or forced childbirth in a free society. If the society is not free, then it makes sense to use disposable men for fighting and women for making more men and women for more fighting and more people making.",
            "title_similarity": "0.7306402",
            "sentiment_compound": 0.3567
        },
        {
            "id": "h05lu53",
            "score": 1,
            "text": "If not the citizens who are they talkkng about providing Defense and General Welfare to?",
            "title_similarity": "0.5204048",
            "sentiment_compound": 0.128
        },
        {
            "id": "h05m1uy",
            "score": 1,
            "text": "Late to this but anyone in the U.S. who naturalizes, makes the oath to “take up arms” for the country. I’ve never really asked the attorneys I work with if this means they’re registered in some way however",
            "title_similarity": "0.487167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05m8ds",
            "score": 1,
            "text": "In principle I agree for the sake of equality. In practice I disagree due to the rates of sexual violence and harassment of women in the armed services.",
            "title_similarity": "0.77817005",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h05mg6b",
            "score": 1,
            "text": "Wait let me get my popcorn",
            "title_similarity": "0.19542494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05mi8i",
            "score": 1,
            "text": "I dont think either gender should be mandated by law to provide military service. It's not right to force such a thing in the first place.",
            "title_similarity": "0.5809953",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05mr07",
            "score": 1,
            "text": "Better yet - no draft.",
            "title_similarity": "0.11795245",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h05mvsz",
            "score": 1,
            "text": "Women are full citizens and therefore deserve the full rights of a citizen.  Period \n\nIf you want to argue that women ahod register for selective service that's fine but a different issue.",
            "title_similarity": "0.7492973",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h05nmvx",
            "score": 2,
            "text": "First of all, women had nothing to do with the creation of selective service. Therefore, forcing them to be involved in an activity they had no say/vote in is widlly unethical.\n\nSecond of all, selective service shouldn't even be a thing. There are plenty of people willing to enlist of their own free will. No one, man, woman, or otherwise, should be forced to fight and potentially die for their country.\n\nSelective service should be abolished completely.",
            "title_similarity": "0.69223434",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h05nz2l",
            "score": 1,
            "text": "Women are not very safe in the Armed Forces",
            "title_similarity": "0.56209743",
            "sentiment_compound": -0.3865
        },
        {
            "id": "h05odqx",
            "score": 1,
            "text": "Ideally selective service shouldn't exist",
            "title_similarity": "0.38196155",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h05okrb",
            "score": 1,
            "text": "The injustice is not that women aren't eligible for conscription. It's that men are at all in the first place.",
            "title_similarity": "0.64802897",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h05oo57",
            "score": 1,
            "text": "CMV: Nobody should be subject to selective service.",
            "title_similarity": "0.42347556",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05oqwl",
            "score": 1,
            "text": "Waaahhhh I might need to while women don't! Maybe we don't expect anyone to get drafted? If you're being forced, what kind of a person are you anyways?",
            "title_similarity": "0.69756997",
            "sentiment_compound": -0.565
        },
        {
            "id": "h05owq8",
            "score": 1,
            "text": "It’s problematic to link citizenship to some positive act of service (or the spectre of a positive obligation). Citizenship comes about by way of right. It is not an entitlement to be earned if sufficient conditions are met. Therefore, instituting some additional condition that must be fulfilled to be entitled to something that should be owed by default seems disproportionate, unreasonable, impractical, and open to all sorts of potential abuse. \n\nSay that what you are proposing was made into being. Does refusal to serve strip you of your citizenship? What if you have no where else to go. Are you stateless? That’s not possible. \n\nYou can argue that the draft ought to be required on the basis that it is the equal or equitable thing to do. You could even argue that a draft in general is inequitable. But it doesn’t make sense to tie it to citizenship.",
            "title_similarity": "0.66523063",
            "sentiment_compound": -0.2168
        },
        {
            "id": "h05p28m",
            "score": 1,
            "text": "Selective Service is a formality. \n\nWe do not live in Starship Troopers.\n\nAre you really that concerned with fairness as a moral principle? Or do you have some other motivations?\n\nAnd be honest. Do you want the average American woman to be eligible for the draft? Yes, women can train themselves up to kick man-ass. But they are few and far between. Even if they're not in combat roles, a 110 pound person will be shit at loading 36 pound Howitzer Shells.",
            "title_similarity": "0.7686571",
            "sentiment_compound": -0.1867
        },
        {
            "id": "h05p2iw",
            "score": 2,
            "text": "There isn't currently a draft and hasn't in a long time, and it looks like one won't be needed in the immediate or distant future, so its a moot point.\n\nThere are certainly countries like Israel that have made use of female soldiers and draftees, they are capable and in some instances are better soldiers than men (snipers due to small frame/easier concealment etc).\n\nHuman society is set up in such a way that most men are disposable.  Losing large amounts of women would upset the birth rates and result in a smaller and weaker country that will linger for decades or even centuries.  This can have longterm consequences like Frances low birthrate during the 1800s leading to its decline as a superpower. Losing large amounts of men affects a generation.  Nowadays this isn't an issue so much as birthrates are already in the toilet and the world isn't like it used to be with constant wars and conquest and subjugation.\n\nNow, on to your arguement.\n\n>I simply believe that in a society that endeavors to be equal\n\nThe United States has never cared about equality.\n\n>it does not seem to be fair\n\n\"It isn't fair\" isn't a strong argument.  Lots and lots of things aren't fair.  In fact, there are many people who would argue that the laws are rigged for men.  I am not going to go into all of them as its not necessary for the argument, just look at what weak ground you are standing on pointing out one superfluous law that \"isn't fair\" when all the laws of the government and rules of life aren't fair.",
            "title_similarity": "0.7131963",
            "sentiment_compound": -0.944
        },
        {
            "id": "h05pmg1",
            "score": 2,
            "text": "Let me remind you of when black people were drafted before they had any rights. \n\nIt's not a \"you get drafted, so you get rights, and if you don't get drafted, you don't get rights\" as you're framing it. And also, should some women fail the physical tests required for the draft, how can anyone force them to enter when they know damn well they don't stand a chance? \n\nRights are not given based off of the fact that you are serving in the army or are forced to. Making this point suggests that all people who are too old to serve or be drafted do not deserve equal rights since in theory they were included in the law, but in reality were actually exempt when the law was to be applied. \n\nYou cannot deny someone their rights and \"benefits of citizenship\" based off of the slim possibility of them being drafted, it just does not make sense. Not for the unable women, and not for the unable men.\n\nTo make your argument about which gender deserves which rights based off of one law which was made before their time and kept by politicians whose age exempts them is just completely wrong. \n\nTo be completely clear, yes, I do think it is unfair to draft only men when it's needed. But whether or not women should \"enjoy the same rights or benefits of citizenship\" even if they are not drafted is like saying kids and old people and disabled people can't have those same rights as well. It's just too fallible. \n\nNow since you edited the post, it is still the same. The draft is not the only thing benefitting society (in fact, in these times it doesn't AT ALL) and assuming a group of people should serve just because they enjoy the same rights and benefits as another group of people is just wrong. Rights and benefits are given on the basis of humanity and the benefits a human brings or have brought to society, regardless of age group or gender. Regardless of physical and mental capacity as well, many mentally and physically disabled people have been on the forefront of society and sometimes the world. (Take Stephen Hawking for example)\n\nAny person can pick up a gun and shoot, man or woman. That should not define their rights in society.",
            "title_similarity": "0.6950146",
            "sentiment_compound": 0.842
        },
        {
            "id": "h05ppmi",
            "score": 2,
            "text": "This has become a hot button so let me first say:\n1) Yes. I served. I deployed. \n2) I have dealt with the aftermath of service; good and bad. The good? There are benefits beyond \"Thank you for your service.\" I get health care, a home loan, and through a GI Bill in reverse I am student loan free. The bad? Mental health, physical, and neurological issues. I have seen many, younger than me, torn apart by what they endured. I saw the immediate aftermath of a young man taking his own life due t the horrors of service.\n3) I would do it again. I did not join out of patriotism or duty. I joined to ensure a future for my family. I paid off debts. Once I got my head back on straight i found myself, and I like the me I am. \n\nAll that said:\n\nI think OP makes a good point. Maybe not for the reasons you think...  I think:\n1) If the shit is really that bad, and we need a draft everyone able should serve in whatever capacity they are able. That may not be active service. I had a colleague once that successfully avoided the draft during Viet Nam as an orderly of some sort in a town far from home. They had a need... he filled it. He legally used the Quaker guide book used during Viet Nam to avoid military service. But he served. \n2) If the shit is that bad. If we need a draft. EVERYONE must be eligible.  Regardless of gender, or gender identity, orientation, educational status, or financial status. EVERYONE. No paying the poor to take you place like the Civil War, no educational deferment for those that can afford college, no medical deferment... There's a way for everyone to be useful. EVERYONE.\n\nBefore anyone screams at me. I don't say this because I want everyone to have to serve, or go to war.  I say it because I want no one to. You make every young person eligible and no way out of it I'll bet anything we never get into another dumbass war again. Forever wars would stop, and wars that include \"Fortunate Sons\" wouldn't happen.\n\nMy proposal means that we would only go to war if the shit really. really, really has already hit the fan and there is no other choice. It would remove partisanship, class, gender, status, race and every other division from the equation.  Make all go... I bet better choices would be made...\n\nMaybe I'm naïve. That's possible. Absolute equity in every aspect of life would lead to better choices.\n\nEDIT: My point is basically this: If it is so bad our volunteer force must be bolstered by a draft then every person must be eligible to serve.  Maybe not active duty. But service. Not because I ever think this is a good idea. Ever. Because it would cause those that make decisions to make better decisions.",
            "title_similarity": "0.5967418",
            "sentiment_compound": -0.9929
        },
        {
            "id": "h05qkkt",
            "score": 1,
            "text": "Men are far more expendable to a civilization than women are.",
            "title_similarity": "0.57796645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05qwtc",
            "score": 1,
            "text": "Or, no one should be required to partake in involuntary servitude.......",
            "title_similarity": "0.30325776",
            "sentiment_compound": -0.296
        },
        {
            "id": "h05qy5v",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.11395411"
        },
        {
            "id": "h05rghh",
            "score": 2,
            "text": "What about people who don't identify as male or female and have their ability to serve tossed with every changing administration? Are you implying that their citizenship should be revoked because they aren't eligible? I don't understand why you have the view that women shouldn't be considered full citizens because the military has barred them from serving until recently, and not in every role. Someone's citizenship shouldn't be contingent on their participation in war - especially when a lot of the wars we participate in aren't even remotely ethical. How do you feel about college students or conscientious objectors? What about BIPOC men who are expected to serve but don't receive full rights under their citizenship? How about prisoners, who can't serve? You're essentially advocating for treating women as less than because of some arbitrary qualification that you feel is important. The draft doesn't define someone's citizenship or the rights inherent to it - and to state otherwise showcases a lack of womens, BIPOC, and Queer history in the US. I might be wrong or missing the mark - but this seems like the opinion of a CISHET white man who hasn't really suffered systemic oppression in the way that the targeted groups have. Sexism is real - both governmental and in \"views\" like this.",
            "title_similarity": "0.78913915",
            "sentiment_compound": -0.7575
        },
        {
            "id": "h05rhz5",
            "score": 1,
            "text": "Instead of removing punishment you want to spread it. Misery loves company doesn't it OP\n\nThis is the same logic as I paid off my huge college debt, future students should also have too\n\nOr I worked minimum wage and I was fine, shouldn't lift minimum wage\n\nMaybe you shouldn't have military conscription in a free society or maybe your citizenship shouldn't be contingent on that",
            "title_similarity": "0.64171195",
            "sentiment_compound": 0.25
        },
        {
            "id": "h05rsu3",
            "score": 1,
            "text": "OK with me. In service to America, Vista, Peace Corp, military, Coast Guard",
            "title_similarity": "0.17274067",
            "sentiment_compound": 0.7531
        },
        {
            "id": "h05s30k",
            "score": 1,
            "text": "They’re not taking it the wrong way fool. You worded it in a way that demonstrates your bias, and you got called out so you blame the receiver rather than take responsibility.",
            "title_similarity": "0.61573803",
            "sentiment_compound": -0.8434
        },
        {
            "id": "h05s80h",
            "score": 2,
            "text": "\n\nRealistically there's some hard as nails women out there, just few and far between. It doesn't feel like women are born to go in that direction. Like we reinforce our boys being the protectors and being the tough ones simply because of their physical ability that comes with processing higher levels of testosterone. \n\nThe way we engender our children doesn't help. So little girls don't get nearly as much opportunity to rough house and beat the shit out of each other, or talk one another into precarious situations that build their grit and physical hardiness. We close the cultural gap though and there would be more women in more of these roles. I mean we're already seeing this changing today and it's fucking badass. The Vikings did it right with shield maidens. \n\nSide note: I'm biased as a father with a daughter.",
            "title_similarity": "0.7492686",
            "sentiment_compound": 0.7861
        },
        {
            "id": "h05sg3b",
            "score": 1,
            "text": "Maybe we should pass the Equal Rights Amendment",
            "title_similarity": "0.47442937",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05svte",
            "score": 1,
            "text": "This bitch out here wanting me to fight wars and Im over here paying out the ass for tampons. Gtfoh",
            "title_similarity": "0.63269746",
            "sentiment_compound": -0.926
        },
        {
            "id": "h05t29h",
            "score": 1,
            "text": "Your premise is flawed. Women don’t have all the rights and benefits that men do. You don’t see female legislators trying to pass bills about male reproductive organs every couple of weeks",
            "title_similarity": "0.67666554",
            "sentiment_compound": -0.128
        },
        {
            "id": "h05tx4l",
            "score": 1,
            "text": "Men's rights as citizens are not dependent upon them registering for Selective Service, so you would, in fact, be imposing a burden that is not currently in place on ANY citizen.",
            "title_similarity": "0.4707672",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h05tzfq",
            "score": 2,
            "text": "*My view* on this is that only gutless men ever make this argument.  I cannot fathom a world where I'm going to demand my goddaughter or mother or wife is going to be forced into combat. I think any guy that suggests it is some coward trying to hide behind equality and fairness.",
            "title_similarity": "0.6756836",
            "sentiment_compound": -0.9095
        },
        {
            "id": "h05u7o5",
            "score": 1,
            "text": "The right to bear arms vs the right to bear babies.  \n\nWomen should be equal citizens because they are of the human race.  Male and Female Created He Them.\n\nMen can’t bear babies, doesn’t make them less equal to women.  \n\nGet it right.",
            "title_similarity": "0.7807441",
            "sentiment_compound": 0.25
        },
        {
            "id": "h05uawg",
            "score": 1,
            "text": "Rather than make women eligible for selective service I'd rather make men ineligible. I.e. do away with drafts altogether.",
            "title_similarity": "0.711373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05ucxq",
            "score": 1,
            "text": "[Would you like to know more?](https://youtu.be/XvAsR4O4W0w) Seriously tho, that's one of the points of Starship Troopers, that only enlisted people should get full rights because only they are taking the responsibility of maintaining the republic.",
            "title_similarity": "0.6701343",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h05umgd",
            "score": 2,
            "text": "Wrong.\n\nCongress (which was nearly all men) wrote the selective service act to exclude women. This was because the military (mostly men) didn’t want women to be drafted into combat roles. It went to the the Supreme Court (all men) who ruled that the military’s needs outweighed equity concerns.\n\nAlso, women can be drafted if they’re medical personnel. Most people don’t know that.\n\nSo this is a question of settled law, and it’s a tired old “men’s rights” complaint that keeps getting dredged up without doing the basic research.\n\nFinally, selective service should be abolished, not expanded.",
            "title_similarity": "0.7951195",
            "sentiment_compound": -0.765
        },
        {
            "id": "h05utuz",
            "score": 2,
            "text": "I think people are glossing over the biggest issue. When most men go to die, the women have to stay back to repopulate. It doesn't work if everyone dies or if a lot of men stay back. This does sound antiquated, but it is necessary in a war scenario. Men can't bear children, no matter the equal rights.",
            "title_similarity": "0.7414957",
            "sentiment_compound": -0.8364
        },
        {
            "id": "h05v035",
            "score": 1,
            "text": "Flip that, reverse it, the answer is that no one should be forced into service.",
            "title_similarity": "0.410303",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h05v0uf",
            "score": 1,
            "text": "I agree that it is inconsistent to have men eligible for selective service, but not women. However, I would argue instead that the solution is not to make women eligible, but to instead do away with the military draft altogether, so that men don't have to register in the first place. I can't think of a more atrocious thing than for a government to attempt to force its citizens to fight wars on its behalf, especially ones that are unjust.",
            "title_similarity": "0.7442167",
            "sentiment_compound": -0.9209
        },
        {
            "id": "h05v5j0",
            "score": 1,
            "text": "Well, you’re right: in a country that has had women fight for equality for decades, equality should apply in all walks of life - if you can join the military then you should be eligible to be called up for that same military.",
            "title_similarity": "0.655007",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h05vbmj",
            "score": 1,
            "text": "women have enough burdens in regular, non warfare life. Effectively treated as targets at all times anyways. Furthermore the chance of draft is extremely low for any man in the north Americas. I do want to point out as well that women HAVE helped immensely in war efforts, either as nurses, mechanics, telegraph operators, or stay at home mothers and teachers. Someone had to hold down home base, and it wasn’t all sunshine and margaritas. Many women died from the fall out anyways. I think it’s disingenuous to say that women shouldn’t be citizens if they can’t be drafted, women suffered and worked during war times as well. The real problem is the idea of a draft in general... but due to basic biology, history, and testosterone levels, it’s pretty easy to see why men are drafted over women. Women will never be as physically strong, and men can never be mothers and main caregivers to the children, elderly, disabled (generalized of course, some men may be excellent child carers, and some women excellent fighters, yet this does defy the norm). So why force women into battlefield when it’s more effective to have (majority of) them participate in other ways? Especially when the draft is a hypothetical problem for modern man, but wage gaps, caretaking and sexual abuse is already the norm for modern women? Seems like to draft women is adding another plate to the already overflowing sink",
            "title_similarity": "0.7722315",
            "sentiment_compound": 0.9253
        },
        {
            "id": "h05vfv9",
            "score": 1,
            "text": "Conscription, or any kind of forceful compulsion, is morally wrong. The fact that we live in a world where men are being subjected to a moral wrong doesn't mean that we should extend that injustice to women as well.\n\n\nInstead conscription of any form should simply be made explicitly unconstitutional.",
            "title_similarity": "0.73704183",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h05vpdt",
            "score": 1,
            "text": "Selective selection only applies to men? Til",
            "title_similarity": "0.38408917",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05vqit",
            "score": 1,
            "text": "If women want equal rights, then yes, this should include the Selective Service. Women now serve in combat roles, again this means they should be included in the Selective Service.\nWomen’s rights equates to yes, we have to be a part of the Selective Service. Women can’t have it both ways!",
            "title_similarity": "0.8003981",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h05vyej",
            "score": 1,
            "text": "Let's take this a step further and say that the draft system should be abolished entirely. You should not have to force people to fight. That inherently contradicts the idea of personal freedom. And if you are in a conflict with such limited public support, I consider that as a form of protest.",
            "title_similarity": "0.65663207",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h05whrk",
            "score": 1,
            "text": "Or you could realize that your country is not the center of the world. Also that right of citizenship should come with being a citizen of the country and nothing else.",
            "title_similarity": "0.45820695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05wv56",
            "score": 1,
            "text": "change my view: selective service shouldn’t exist",
            "title_similarity": "0.42648774",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05wylx",
            "score": 1,
            "text": "No, women should automatically get all rights and benefits of citizenship like everyone else, you fucking misogynistic fascist.",
            "title_similarity": "0.7373941",
            "sentiment_compound": 0.0571
        },
        {
            "id": "h05wzf2",
            "score": 1,
            "text": "Service guarantees citizenship!\n\nThat said, I think we’re closer to Starship Troopers than anything else. Those in power are still successfully trying to pass laws governing womens bodies...cant be forcing those same women to declare themselves for the draft now can they? Do they really want to open that can of worms even if it doesn’t always mean fighting in a war?\n\nI really think we’ll all lose our right to vote before this happens...and we’ll earn that right back by serving and it will go for everyone",
            "title_similarity": "0.82976323",
            "sentiment_compound": -0.7148
        },
        {
            "id": "h05z95j",
            "score": 1,
            "text": "Registering both genders is a way to get equality but not the best way, I think the best method is registering neither. Registering both might be a good step though, because then women will also get involved in abolishing the draft and selective service. I think there was a supreme court case regarding it where the government ruled this selective service discrimination unconstitutional, but nothing was done about it. So maybe if you are a man, then just don't register, and you can point to that supreme court case as legal precedent.",
            "title_similarity": "0.7754283",
            "sentiment_compound": 0.9562
        },
        {
            "id": "h060gr4",
            "score": 1,
            "text": "Wrong, 10,000%.\n\nFirst, you're using male as the default, which is gross.\n\nYou're also saying that you essentially believe that everyone should be forced into compulsory military service, which I disagree with 100%, no matter the sex.\n\nI always wonder why men bitch about women and the draft when it hasn't been around in decades, the people legislating it were men, and men don't seem to want to abolish it for themselves?\n\nFonally do you \\*really\\* think women are not drafted like men are? Who's holed up on the homefront pushing out the next round of cannon fodder, do you think? There's a reason it's called a baby boom.",
            "title_similarity": "0.77625513",
            "sentiment_compound": -0.9555
        },
        {
            "id": "h062dta",
            "score": 1,
            "text": "While i agree people should be treated fairly, I don’t think it should be put behind a conditional",
            "title_similarity": "0.5402801",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h063goy",
            "score": 1,
            "text": "Women already die more.\n\nEven after all the advancements of modern medicine around 700 mothers die in the us every year during or after child birth.\n\nThe us military loses about 450 soldiers to hostile action and terrorist attacks every year.\n\nSo wether selective service of the male population out of solidarity is good or not, and even if the death toll is already the same due to men working more dangerous jobs, women have no choice but to die for society. And they do.\nIn greater numbers, even, than soldiers.",
            "title_similarity": "0.6097241",
            "sentiment_compound": -0.9427
        },
        {
            "id": "h063qe1",
            "score": 1,
            "text": "And universal daycare, equal wages, and reproductive rights.\n\nBecause unless this argument is attaching that CMV to these, then it's only punching down. I do like that you used the line \"this was a counter argument to the suffragettes....\" unironically. Do you consider the opponents to the suffragettes as being on the wrong side of ethics?",
            "title_similarity": "0.77294004",
            "sentiment_compound": -0.7162
        },
        {
            "id": "h064155",
            "score": 2,
            "text": "Women tried to get eligibility for the draft, and succeeded in getting a bill past the House and into the Senate during Obama's term.  The GOP killed it.\n\nYou can't penalize women for not getting drafted when they're completely willing but stopped by MEN.  There's nothing fair or rational about that.",
            "title_similarity": "0.74383533",
            "sentiment_compound": -0.7217
        },
        {
            "id": "h064yoz",
            "score": 2,
            "text": "While I agree with your point that since America is striving to be equal, women should be a part of the draft (or even better, we get rid of the draft all together), there are a few counterarguments that I can think of for why it's not possible right now (i.e. the government will have to put programs into place to fix said counterarguments). \n\n1. Out of all of the women eligible for the draft, a good amount of them are probably pregnant, and if a woman wants to get out of the draft, all they have to do is get pregnant and then find a way to abort the cells later. The only way to solve this would be a crack down on abortion which is a big no no cause all it'll do it overflow the orphanages even more than they already are. \n2. The misogyny in the military is rampant. Besides the usual sexism, it's literally really unsafe to be a woman in the military right now. There will still be a lot more men than women in the military as seen in point 1 and the women there now are already suffering from sexual abuse and harassment from their own peers. I remember a news story a few years ago where on a navy ship the men put cameras in the women's showers, and there have been hundreds of reports of women being raped and then unable to tell anyone because they'll just dismiss it. And that's even before they go overseas. The sexism, misogyny, and constant fear of rape would be enough to break anyone, and to imagine myself being literally dragged into that scenario terrifies me more than being shot by an enemy commandant.  And yes I know men get raped in the military too, and I'm not going to put a 'but' in there because it is horrible and shouldn't happen.",
            "title_similarity": "0.8295524",
            "sentiment_compound": -0.9552
        },
        {
            "id": "h0671r6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h067mcp",
            "score": 1,
            "text": "I mean men are on average stronger than woman, so female service women have to through a lot of training to stay as useful as their male counter parts, to expect all women to do that is unfair, we should not let chivalry die.",
            "title_similarity": "0.78097385",
            "sentiment_compound": 0.6753
        },
        {
            "id": "h068qjv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h06ab0j",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h06pbxg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10606369"
        },
        {
            "id": "h077njb",
            "score": 1,
            "text": "I don't think men should have to sign up for the selective service. World war II 911 these times show us that if we feel our government is right and just we stand behind them.",
            "title_similarity": "0.57559025",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h079l1j",
            "score": 1,
            "text": "Once women receive all the benefits of citizenship, maybe they can be murdered in stupid wars too.",
            "title_similarity": "0.7389535",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h082vz8",
            "score": 1,
            "text": "If selective service only means a military draft, then perhaps the problem isn’t that women are excluded from the draft, but that that draft is so limited and militaristic",
            "title_similarity": "0.73318267",
            "sentiment_compound": -0.6991
        },
        {
            "id": "h0blyko",
            "score": 1,
            "text": "This opinion has always been very interesting to me, and I also hate that it's gaining popularity. Ever since I married, and later became the father of two daughters, my response to this is always the same. To be clear, I'm not really trying to change your view here.\n\nI'd like to cast aside all of my popular and unpopular opinions about war, selective service, combat roles vs non combat roles, gender roles in society, women's rights in general, the population replacement problems that drafting women would cause, and many others. \n\nThere are lines that the state knows it can't cross. Drafting wives, daughters, sisters, etcetera is one of those lines. \"Over my dead body\" is the phrase that comes to mind, and I fully believe that sentiment would be echoed nationally by men of all ideologies. It just isn't something that would ever have any chance of happening. \n\nAn attempt to force women into military service would elicit a widespread, violent biological response. That's probably the best reason for why it shouldn't be attempted.",
            "title_similarity": "0.73920345",
            "sentiment_compound": -0.3197
        },
        {
            "id": "h0f083l",
            "score": 1,
            "text": "I'll do you one better.\nThe draft, a archaic remnant of a much more authoritarian and violent reality, shouldn't exist.\nNobody should be forced to fight in a war against their will. \nNot only is it involuntary servitude (borderline slavery) but it's also wrong by any humaniatarian measures.\nWe should aim for a world where everybody is free from conscription, not one where more people are bound by it.",
            "title_similarity": "0.6875106",
            "sentiment_compound": -0.8167
        },
        {
            "id": "h0hzzl7",
            "score": 1,
            "text": "Because of the risk of rape while on duty, along with corresponding pregnancies (no birth control is 100% effective).",
            "title_similarity": "0.7101661",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0m5de2",
            "score": 1,
            "text": "Why tf does everyone want women to be second class citizens?\n\n\nMy rights as a human being born in my country should be inate, just like men born here. It should be absolutely unrelated to military drafts. I was born here, and am a human being, therefore I am entitled to the rights afforded by this country to citizens. Full stop.\n\n\nWhile I agree that everyone should be equally eligible for the draft, rather than forcing women to sign up, it should just be eradicated. If the united states cannot get enough people to volunteer for a war, the war is likely not just anyway.\n\n\nMy biggest gripe is that if this were actually the case, that rights and citizenship were contingent on eligibility for the draft, you open up HUGE doors for disenfranchising (or prioritizing) whatever group of people those in power choose. \n\n\nGovernment doesn't want women to have rights? They disclude us from the draft. Now I'm a second class citizen through no fault of my own. Who else is the government going to attack? Add wealth parameters, or employment requirements, etc for who has to be drafted and who can avoid it?This opens up some very dangerous paths to severe marginalization.",
            "title_similarity": "0.82466406",
            "sentiment_compound": -0.6988
        },
        {
            "id": "h17kijt",
            "score": 1,
            "text": "While I agree, you might want to educate yourself on why and when women were concerned equal and understand how hard many have had to fight to get to fight for their own country. Your comment is truthful, but woefully ill informed.",
            "title_similarity": "0.8301245",
            "sentiment_compound": -0.7992
        }
    ]
}