{
    "CMV: Democrats will regret it if they ever get rid of the filibuster\nTo preface, the filibuster in its current form is awful. So, I'm not saying that change isn't needed. What I do believe, is that if Democrats do get rid of the filibuster they will regret it.\n\nDemocrats will not hold onto the senate forever. The Republicans will be back in charge of both chambers at some point in the future. And if the filibuster is gone when they, AND Mitch McConnel is still senate majority leader....watch out. He's already proven he's more than willing to fight fire with napalm. And, if that filibuster is gone when that time comes, there is no doubt in my mind that Republicans will advance legislation that Democrats and the majority of voters find abhorrent, but there will be nothing they can do.\n\nOne argument for getting rid of the filibuster is it will allow the passage of the new voting rights bill, which many Democrats believe will help ensure Republicans aren't allowed to steal elections through gerrymandering and local voting laws the discourage certain democrat leaning demographics from voting. My response to that is that it is simply absurd to believe that Democrats will hold onto both the House and the Senate forever. Republicans will win again at some point, and they will enact revenge.\n\nAs it stands now, the filibuster gives Democrats the ability to block some of the more egregious legislative goals of Republicans, and I think it is foolish to take away that ability.\n\nI think the better option is to overhaul the filibuster to make it politically difficult to filibuster, like it used to be. Require a quorum of the opposition to be present and for someone to hold the floor the whole time. By making it hard, it will incentivize the use of the filibuster only in the most politically expedient of times (like what Democrats recently did in Texas, which, again, is an example of how the filibuster can be a good thing).\n\nI'm open to my view being changed I'm just very distrustful of what Republicans would do once in power without the filibuster.\n\n&#x200B;\n\nEdit to add: I'm sorry for not responding to everyone. I did not anticipate the huge response. Thanks for all the replies, I think there has been some amazing discussion on here!": [
        {
            "id": "h0h477t",
            "score": 1,
            "text": "/u/DwightUte89 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nrlddh/deltas_awarded_in_cmv_democrats_will_regret_it_if/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.588007",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0g2tjg",
            "score": 59,
            "text": "I think establishment Dems and Republicans will regret getting rid of the filibuster. It gives them plausible deniability. \n\nHowever, what's wrong with wilder swings in the legislative body?\n\nDo you seriously think that if the GOP were allowed to actually pass their horrible, horrible policies that the American people will reward them?",
            "title_similarity": "0.80301213",
            "sentiment_compound": -0.8823
        },
        {
            "id": "h0ggnrj",
            "score": 16,
            "text": "Democrats will regret whatever they do.  They are in a terrible position and most likely will not only lose power in 2022 but potentially never regain it back.  Throughout the country, Republicans are abusing norms and changing laws to create a false democracy where they cannot lose.\n\nThat isn't hyperbole by the way.  Texas is trying to make it easier to simply [overturn an election](https://www.washingtonpost.com/politics/texas-voting-restrictions/2021/05/29/86923248-be25-11eb-9c90-731aff7d9a0d_story.html) by way of their attorney general.  Other states are adopting similar measures, in case extreme voter suppression does not do the job.\n\nAnd that isn't discussing the high likelihood of a violent coup succeeding next time, given the complete lack of consequences for every major political figure that endorsed such behavior and the escalation that has continued.  \n\nSo the democrats have a rock and hard place choice:\n\n* Treat their last moments as sacred and attempt to use them to potentially force through a last-ditch effort to secure democracy, knowing that it probably lets the Republicans achieve all their political dreams when they return to power in the democracy that follows\n* Play nice and keep the filibuster, hoping that they can keep a positive mood into 2022 and 2024 and keep expand their control even though it is extremely slim chance\n\nI'll note that many conservative politicians do not care about the filibuster because *they've already abolished it.*  The issues fiscal conservatives care about are taxes and the Supreme Court, both of which conservatives had amended rules to get around the 60 vote necessity for a quorum.  So they get to abolish the filibuster for what they want and keep it to shut down the Democrats.  \n\nMy question is, what will Democrats regret **more?**  \n\n* Do nothing and continue to naively hope the Republicans return good faith, allowing themselves to be erased as a political entity after they allow the US to become an autocratic government led by populist willing abuse their power?\n* Do something and maybe lose political capitol over it, throwing away 2022 and 2024 chances and letting Republicans enact whatever policies they want, delaying the nightmare scenario for at least an election cycle?\n\nTo me, the latter is preferable.  Yes, it is probably futile.  The USA has been on a death spiral since 2010 and likely won't last the decade as a democratic state.  I've seen this loud and clear as Republicans march forward, seemingly not noticing the escalation and danger from the cliffside ahead.  \n\nI just see no route forward in passivity.  The only option that ends with 'happily ever after' is the aggressive securing of our democracy, the Democrats maintaining power despite expending said capitol, and a return to a normal political climate before the Republicans take control again. I'd rather take that shot than put my hopes in Republicans, either that their efforts to end democracy fail without outside hindrance or that Republican Senators agree to push bipartisan legislation.",
            "title_similarity": "0.8808851",
            "sentiment_compound": 0.9916
        },
        {
            "id": "h0g92p9",
            "score": 6,
            "text": "Damn Reddit is just a hard left cesspool. The fact that you guys think only republicans propose bad policy is hilarious.",
            "title_similarity": "0.6992731",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0h5n19",
            "score": 0,
            "text": "You lost me at \"there is no doubt in my mind that the Republican's will advance legislation that Democrats and the Majority of voters find abhorrent.\". Really?  The way the Biden administration has us back in wars, talking of raising taxes, the Southern border fiasco and the inflation that is coming at us like a freight train is what the Majority voters will think is abhorrent come 2022.",
            "title_similarity": "0.8282778",
            "sentiment_compound": -0.9299
        },
        {
            "id": "h0g2w6z",
            "score": 601,
            "text": "I have zero doubt that if the Republicans were to take over both chambers of Congress and the Presidency with the fillibuster in tact, they would remove it to pass their agenda.  If McConnel 'fights with napalm' as you suspect, then he'd be more than willing to remove the roadblocks that are preventing him from passing legislation.\n\nIf we agree with the above statement being true, then the Democrats have nothing to lose.  Removing it now can help them pass their agenda, with pretty much zero downside.",
            "title_similarity": "0.8300479",
            "sentiment_compound": 0.607
        },
        {
            "id": "h0g2y52",
            "score": 3,
            "text": "Sure, Democrats won't be in power forever. But let's be honest, Republicans won't either. Getting rid of the filibuster hurts the Democrats when they're the minority party, but if/when they get back into power it will be beneficial.\n\nYou can't really trust EITHER party with that amount of power and expect there to be no consequences.",
            "title_similarity": "0.8796226",
            "sentiment_compound": 0.7662
        },
        {
            "id": "h0g6nx9",
            "score": 23,
            "text": ">Democrats will not hold onto the senate forever. The Republicans will be back in charge of both chambers at some point in the future. And if the filibuster is gone when they, AND Mitch McConnel is still senate majority leader....watch out.\n\nWhat's stopping McConnel from blowing up the filibuster himself? He only needs 51 votes and has shown he's willing to just make up nonsense excuses, like blocking Merrick Garland.",
            "title_similarity": "0.81968",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0gisqn",
            "score": 0,
            "text": "McConnel will be dead and gone by then.",
            "title_similarity": "0.4434635",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0gj5we",
            "score": 0,
            "text": "Lmao in today world there zero shot of changing your view on tbis",
            "title_similarity": "0.4928059",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0gjzef",
            "score": 0,
            "text": "Correct me if I'm wrong (which I most likely am) but I don't really remember democrats stooping as low as to filibuster away things the last administration was doing. Again I may be unaware, but I feel like I've kept up okay with the news in the past couple years, and yeah, the only things coming to mind are Republicans filibustering. \n\nAnd if you can't realize how fucked the base concept of a filibuster is, that is a problem friend.",
            "title_similarity": "0.79687446",
            "sentiment_compound": 0.8412
        },
        {
            "id": "h0gjzv9",
            "score": 0,
            "text": "If the new voting bill is passed, the modern day Republican Party will never hold power again. They will have to become less extreme in order to actually win anything. I would much rather have an “unchecked” moderate Republican Party than a “checked” extreme one.",
            "title_similarity": "0.7591618",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h0gkvyx",
            "score": 0,
            "text": "They always regret it when they're no longer in control of government and their policy changes, which used to benefit them now backfire.",
            "title_similarity": "0.69884926",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0glojh",
            "score": 0,
            "text": "I'm not so sure. The Republicans don't actually seem to have a legislative agenda in the trump era. What they do have for priorities is not popular with the majority of Americans. If they did go crazy with conservative priorities I'm not sure people would like it much. Maybe the filibuster doesn't change much for them because they don't have plans to change things and what they do want to do is unpopular - ergo they would actually do it.",
            "title_similarity": "0.74891657",
            "sentiment_compound": -0.6561
        },
        {
            "id": "h0gmxcm",
            "score": 0,
            "text": "I almost feel this way and then I realize this: the Republicans will eliminate the filibuster without hesitation the first opportunity they have where it benefits them. \n\nJust like with the whole nomination of a Supreme Court Justice during an election year BS. There will be no hesitation by the current Republican party to completely backtrack on anything and everything they have said about the filibuster and eliminate it the moment they will gain from it. \n\nSo not getting rid of the filibuster now doesn't actually do anything to protect the Democratic party's interests in the future when they lose the Senate.",
            "title_similarity": "0.84130174",
            "sentiment_compound": 0.9736
        },
        {
            "id": "h0gp9sx",
            "score": 0,
            "text": "The filibuster is one of the reasons democrats lose elections. Republicans use it to block everything and then turn around and shit on Democrats for getting nothing done. Get rid of the Filibuster and democrats can get things done. Get rid of the electoral college at the same time and republicans will lose the white house probably for good. Pass the voting rights bill and republicans will have a harder time rigging elections. America is a majority blue country that leans further left every year and yet democrats can barely scrape together a majority in Congress because of how broken and undemocratic the system is. Abolishing the filibuster is a step towards having a government that actually represents the majority of Americans.",
            "title_similarity": "0.85455203",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h0grvo4",
            "score": 0,
            "text": "Yes, we may well end up with a worst case scenario, where Republicans take the triumvirate. In fact, it's probably likely to happen at some point in the future.\n\nBut I think getting rid of the filibuster will in the long run benefit Democrats much more than Republicans.\n\nHere's why: Republicans are a static force, while Democrats are a progressive force. While the filibuster gives an advantage to the static force, the lack of one gives an advantage to the progressive one.\n\nLet me explain. Republicans' only goal is to keep a status quo ensuring the smooth exploitation of labor and free flow of capital. At its core, their ideology is not popular. It protects the financial power of a small minority, the elite. This is why they rely on cultural issues (gays, guns, abortion, immigration, and muh weepy lost America) to shore up more popular support. And these issues are what their \"base\" actually cares about, and what Republican representatives pretend to care about.\n\nTheir base doesn't really support all that strongly Republican leader's real goals. The greatest achievement of Donald Trump was to expose this lie. The base does not want \"entitlement reform\" and a really large number of them support public benefits, like healthcare, universal child care, infrastructure spending, paid family leave, minimum wage increases, and taxing the wealthy. etc.\n\nIf Democrats increase taxes on the wealthy, and pass a lot of bills that support social democracy (all of these things that actually have broad public support), Republicans will be loathe to get rid of them should they ever win back majorities in congress and regain the executive branch. It's much more difficult to repeal legislation that promotes social democracy (politically) than it is to enact it. If Democrats manage to pass some form of single-payer healthcare (or any other expanded benefits and protections) I don't see Republicans repealing them, especially given what they now know about their true base.\n\nSo, let's say we repeal the filibuster and manage to enact a New New Deal for the 21st century, and then Republicans take office. What will they do? \n\nWell, they could try to dismantle much of it, but taking away healthcare and other benefits and protections from their base (which is increasingly blue collar and downwardly mobile) would be a terrible idea. Instead they would have to do what they can on the economic front, and then focus all their energy on cultural issues. Expanding gun rights, cracking down on immigration (but in actuality only really pretending to because lord knows capital accumulation needs the laboring bodies), and increasing abortion restrictions. These are bad things, but they are also not nearly as significant as making real economic changes.\n\nAnother major reason, which I've seen argued by Ezra Klein and others, is that if we get rid of the filibuster, politics will actually shift from being largely about culture wars to largely about policy/laws, because right now, no one cares about policy because there's little danger of any laws ever getting passed.\n\nBut if parties were suddenly responsible for having to pass laws and having the ability to do it, voters would start caring about them more, and then parties would actually pass laws and then worry about being judged based on the results of those laws. We would have increased accountability. So yes, Republicans could go ahead and defund or fully privatize a popular Universal Pre-K program: but they'd also have to suffer the electoral consequences of doing so.",
            "title_similarity": "0.79306835",
            "sentiment_compound": 0.9957
        },
        {
            "id": "h0h4esn",
            "score": 0,
            "text": "If the Dems block the filibuster to pass voting rights, they won't have to worry about Republicans for some time to come, as Republicans can only win with vote suppression. Eventually Republicans will have to go back to appealing to the masses if they want to rule. \n\nAlso if the Dems pass single payer health care, decent minimum wage, infrastructure etc. even working class white people will see the light. \n\nA third thing it will do is force the Republicans to negotiate in good faith so that they can get some of what they want passed.  They will have to stop their I'm taking my ball and going home attitude. \n\nKilling the filibuster is just the thing to do.",
            "title_similarity": "0.7963783",
            "sentiment_compound": 0.7356
        },
        {
            "id": "h0ho0ou",
            "score": 0,
            "text": "I honestly have no idea how I got here, have no clue what filibuster is. But hell, its sureal being reminded just how fucked up the two party system is in the US.",
            "title_similarity": "0.5906566",
            "sentiment_compound": -0.9032
        },
        {
            "id": "h0ho90y",
            "score": 0,
            "text": "Your on Reddit of course the filibuster is good only when democrats are aloud to use it.",
            "title_similarity": "0.64419305",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hpelg",
            "score": 0,
            "text": "We need to get rid of jerrymandering first",
            "title_similarity": "0.48256207",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0g311e",
            "score": 22,
            "text": ">As it stands now, the filibuster gives Democrats the ability to block some of the more egregious legislative goals of Republicans, and I think it is foolish to take away that ability.\n\nThis relies on the assumption that Republicans are reactive, not proactive.\n\nIf Republicans want to overthrow the filibuster, they can. They don't need the Democrats to set a precedent.\n\nThis is demonstrated with all the messing about that went on with the Supreme court.",
            "title_similarity": "0.83366275",
            "sentiment_compound": 0.2887
        },
        {
            "id": "h0g3i5g",
            "score": 1963,
            "text": "The filibuster is fundamentally undemocratic, there's no two ways about it; I mean that's basically what you're saying *is good* about the filibuster - it allows the party which less people voted for to stop the party which more people voted for from passing its agenda, the thing which, presumably, the people who voted for them wanted them to do. If we believe that democracy is good and that in general the reason we have elections is to select leaders (and by extension, agendas) that we favor, then we should not be like ah wait but what if people vote stupid and elect bad people, then we will need to have an off switch attached to our democracy\n\nOn a fundamental level if you are thinking that way, you do not agree with democracy as a concept",
            "title_similarity": "0.78633785",
            "sentiment_compound": -0.8526
        },
        {
            "id": "h0g3g4p",
            "score": 81,
            "text": "The way I see it, republicans enacting revenge would be a good thing. Anybody not liking what happens should simply vote democrat next time.\n\nThe filibuster is imbalanced in who it benefits. If you want to keep things static, or to sabotage the opposition it allows you to have influence even when you shouldn't. But it's a problem for the side that wants to enact change but doesn't have enough power to ignore it.\n\nThe republicans are happy with blocking stuff, so the filibuster works in their favor. Democrats want to do things, rather than to simply keep things static, so the filibuster works against them.\n\nDemocrats have a big PR problem in not being able to do what they promised despite supposedly being in control. Removing the filibuster makes things much clearer: whoever was elected makes the rules, and is to blame for whatever happens.",
            "title_similarity": "0.81840694",
            "sentiment_compound": -0.6887
        },
        {
            "id": "h0gfium",
            "score": -1,
            "text": "The thing you aren't aknowledging here is that your nightmare future, where the rupublicans have a majority again...they'll just nuke the filibuster. It doesn't save us from anything. We should get rid of it now.",
            "title_similarity": "0.78207207",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h0gilsx",
            "score": -1,
            "text": "A very compelling argument to be sure! Well said kind stranger :)",
            "title_similarity": "0.34397793",
            "sentiment_compound": 0.8593
        },
        {
            "id": "h0git7i",
            "score": 1,
            "text": "The more I learn about American voting system and politics the worse it looks. I've looked at first paragraph on Wikipedia what the hell is filibuster.  Its nickname is talking a bill to the death. So one person can block a bill for no reason. Come on. In my country a party did this,  they passed law anyways later and the party in question almost didn't get to the  Parliament because that thing looks bad and is stupid. \n\nYou are giving veto right to any MP. If that is what US needs to not pass some horrible legislation than you have much more problems to solve than just filibuster.",
            "title_similarity": "0.79571843",
            "sentiment_compound": -0.9421
        },
        {
            "id": "h0giy47",
            "score": -1,
            "text": "My counter to this is simple:\n\nThe American people will regret electing Republicans who can operate without a filibuster if it is gotten rid of.\n\nLet the Republicans pass their policy too and let the voters decide who should be in power after evaluating those policies.",
            "title_similarity": "0.8199197",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0gj2si",
            "score": 1,
            "text": "I don’t disagree with you except for the assumption that when republicans do retake the senate that they won’t then get rid of the filibuster in order to prevent dems from “pulling a McConnell”. Their current campaign across multiple states to make it more difficult to vote and supporting partisan gerrymandering in order to retain power (rather than making their platform appealing to more folks to win fairly) shows they’re willing to do anything. At that point, dems will be even further behind. \n\nMaking it more difficult, as it once was, is also a double edged sword. Not all legislation is a big deal to the public (like the voting rights act, for example) and making someone hold the floor keeps the day to day business from getting done. Maybe when shit starts to fall apart and one side is the cause, that will create pressure but I’m still left with the strong suspicion that Rs are going to nuke it anyway when they get back in power and dems will be too far behind to moderate increasingly bad behavior. \n\nMoral of the story is all the options are bad... they’re going to regret doing it but will have something to show for it or regret not doing it and have encouraged whatever comes next. McConnell and the like are screaming about “bipartisanship” while refusing to participate meaningfully in governing and hoping for the latter so they no longer have to.",
            "title_similarity": "0.83810705",
            "sentiment_compound": -0.9551
        },
        {
            "id": "h0gjgre",
            "score": -1,
            "text": "Demographics alone will ensure that the democrats will always be in complete control. Unless there is a huge purge that the republicans win, it's inevitable.",
            "title_similarity": "0.7063852",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h0gkzs7",
            "score": -1,
            "text": "Why can't we eliminate the filibuster for 3 years.  Sunset it's removal.  It will then be in effect if the republicans win in 2024.",
            "title_similarity": "0.62389374",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0gm1fv",
            "score": 1,
            "text": "Maybe we could just get rid of the two party system",
            "title_similarity": "0.47102892",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0gdvoi",
            "score": 6,
            "text": "The modern filibuster has been around since Woodrow Wilson asked to cease debate during World War I and in practice since 1975, when McConnell was first in Congress, which was when the filibuster no longer required actually filibustering/speaking.\n\nWhat happened in 1975: Democrats expanded House and Senate majorities after Republicans blew away Democrats for Nixon in 1972, and then the political specter of Watergate and congressional investigations into Nixon and Ford Republican administrations while the Republican minority could do little.\n\nIt would be just as difficult to overcome filibuster with a reversion to 1975 as long as the minority party is willing to speak.   Filibuster changes have been anti-democratic for two reasons: war and a fast-moving political shift away from the Republican government.\n\nMy question would be why should Democrats not revert to the historic norm McConnell helped eliminate; and why should Democrats not employ McConnell's strategy when Republicans are shifting the political tide against Democratic candidates through redistricting this year and civil rights generally?  It's like a popular (in terms of democracy) version of the not popular environment Republican candidates faced in 1975.",
            "title_similarity": "0.7799079",
            "sentiment_compound": -0.7803
        },
        {
            "id": "h0haw3t",
            "score": 17,
            "text": "One interesting point in this very well argued essay on the filibuster is that the 60-vote supermajority requirement essentially breaks the cycle of \"party/politicians present agenda > voters vote for preferred agenda > victor implements agenda > voters reflect on if they're happy with it or not and keep or boot the party in power\".\n\nYou may be right that Democrats may not like what a Republican majority would enact but voters would actually be able to experience the governance they voted for and not just continual gridlock.\n\nOn the other hand, parties wouldn't be able to shout about lofty ideals they know there's no possibility of them actually passing legislation in the pursuit of - because once in office they couldn't just point to the obstruction of the opposing party.\n\nSo while the immediate impact may be some whiplash as majorities swing back and forth, I think the long term impact would be stabilization towards the party that enacts policies supported by the majority of voters. I believe this favors the Democrats today and will favor them more so over time.\n\nSo to address your CMV directly, yeah I think there's the possibility for short term pain but the long term would favor Democrats as demographics change and they're able to enact popular policies.\n\n&#x200B;\n\nReference:\n\n[https://www.vox.com/21424582/filibuster-joe-biden-2020-senate-democrats-abolish-trump](https://www.vox.com/21424582/filibuster-joe-biden-2020-senate-democrats-abolish-trump)",
            "title_similarity": "0.8475274",
            "sentiment_compound": 0.9857
        },
        {
            "id": "h0g4h1v",
            "score": 17,
            "text": "> AND Mitch McConnel is still senate majority leader....watch out. He's already proven he's more than willing to fight fire with napalm.\n\nRight, and he didn't get rid of the filibuster when he could have precisely because he knows that - on a whole - it benefits Republicans more than Democrats. The two things Republicans like doing the most when they control the Senate are approving judges and passing tax cuts, neither of which the filibuster works on anyway.",
            "title_similarity": "0.81619155",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0gavwt",
            "score": 408,
            "text": "The most convincing argument I've heard on this point is that Republicans simply don't have many legislative policy goals these days that the filibuster actually interferes with.  They care about taxes, but they can implement tax policy through the reconciliation process (as seen in 2017).  They care about judicial appointments, which have been removed from filibuster obstruction.  Many other topics they run on (opposition to gun control, immigration, abortion access, etc.) are more effectively addressed by the executive branch.\n\nAs it stands, Republicans already have removed the filibuster from impeding large portions of their agenda.  The trick they pulled is still keeping the filibuster on the books to interfere with many of the Democratic agenda items.",
            "title_similarity": "0.74271023",
            "sentiment_compound": 0.8124
        },
        {
            "id": "h0gaivj",
            "score": 6,
            "text": ">The Republicans will be back in charge of both chambers at some point in the future. And if the filibuster is gone when they, AND Mitch McConnel is still senate majority leader....watch out. He's already proven he's more than willing to fight fire with napalm. \n\nWhat's to stop Republicans from eliminating the filibuster next time they take control of the Senate anyway?  Or put it in terms of your analogy, perhaps McConnell is willing to fight with napalm regardless of what Democrats do (e.g., the opposition to Garland was just pure aggression not based on any precedent Democrats had set; McConnell also eliminated the filibuster for SCOTUS nominees as soon as it became useful to do so).\n\nIf Republicans are likely to eliminate the filibuster next time they're in a position where it would be helpful to them (just as they did with the filibuster for SCOTUS), then Democrats don't gain anything by preserving it now.",
            "title_similarity": "0.8320757",
            "sentiment_compound": -0.795
        },
        {
            "id": "h0geeui",
            "score": 6,
            "text": "Democrat (and Republican) activists would regret getting rid of the filibuster but the average Democratic (and Republican) voters will applaud in the long run.\n\nThe filibuster prevents significant action from being taken which allows both sides to promise loopy ideas knowing the filibuster prevent them. The majority of moderates in both parties do not like these ideas but are stuck because the other side appears to idiotic as well.\n\nIf the filibuster were removed, both parties will be actually be able to govern effectively. If Democrats (or Republicans) pass laws promoted by their extremists, they will lose power in the next election.\nThis will force each party to govern for the moderate majority. \n\nBipartisanship will return if partisans can actually pass laws.",
            "title_similarity": "0.8156094",
            "sentiment_compound": 0.944
        },
        {
            "id": "h0g5lbg",
            "score": 27,
            "text": "When you say \"the Democrats will regret\", what are you saying?\n\nYou could be arguing that the Democrats will be negatively impacted by this change in the future. That is almost certainly true, but it isn't really germane. Any change to the rules will eventually have a negative consequence for everyone involved in the game. That is just how rules in games work. It doesn't matter if the game is Uno or national politics. If you change the rules, it will impact everyone. If that is your view, then I don't understand why you are stating it? Do you expect politicians to write laws that only grant advantage to their own party?\n\n>I think the better option is to overhaul the filibuster to make it   \npolitically difficult to filibuster, like it used to be. Require a   \nquorum of the opposition to be present and for someone to hold the floor  \n the whole time.  \n\n\nSeveral of the proposals to \"end the filibuster\" essentially amount to filibuster reform. But at the end of the day, they all amount to the same idea. They would get rid of the 60-vote requirement to move forward on legislation.",
            "title_similarity": "0.8499341",
            "sentiment_compound": 0.7872
        },
        {
            "id": "h0g8hmu",
            "score": 11,
            "text": "The filibuster is totally broken. The senate was designed to pass legislation with 51% of the vote, not 60%. If they want to get rid of it and replace it with different rules, that might be a good compromise, but it needs to be changed. \n\nHow did the filibuster help democrats? Republicans still managed to get plenty of shit too, and most importantly allowed them to stall and obstruct congressional oversight regarding matters of impeachment and other crimes.",
            "title_similarity": "0.7986826",
            "sentiment_compound": -0.0276
        },
        {
            "id": "h0gd9sr",
            "score": 12,
            "text": "Since Reagan, the Republican party’s platform has been one of small government conservatism. You know the famous quote: “The scariest words in the English language are: I’m from the government and I’m here to help”?\n\n**The main goal of the Republican party is to strip power away from the federal government by making it impossible to do anything**\n\nSure, there will be laws that will get passed that the Democrats don’t like that would be otherwise filibustered, but when you have one party who wants to give more power to the government to do more things, and another that wants to take that power away, the filibuster is clearly asymmetric, and will aid the Republicans much much more than the Democrats",
            "title_similarity": "0.8034085",
            "sentiment_compound": 0.8847
        },
        {
            "id": "h0gslf5",
            "score": 225,
            "text": "I share your skepticism on removing the filibuster, but the best argument I've heard against it is that it strips parties of responsibility/accountability. You can campaign on any idea you want, not matter how unfeasible, and then just blame the other party for failure because in the current polarized environment there is a miniscule chance of a party getting 60 senators from the same party. Therefore, you essentially have stripped parties of the ability to enact the agendas they run on, so campaigns no longer need to be based in reality. While the short term prospects could be grim if they enact their agenda without Democrats being able to filibuster, it would actually provide a chance for the voters to see what GOP agenda looks like. Right now, they can campaign against the Democrats and say \"everything would be perfect if it wasn't for those socialists who are blocking our agenda,\" and we get endless status quo, which in many policy areas is bad (not just left or right, but a lot of shitty policies on both sides that were so watered down they don't do anything). \n\nAdvocates argue that if we restore a democratic linkage, then politicians could actually be held accountability to enacting their agenda as they wouldn't be able to blame the other side for blocking change.  For a concrete example, it's pretty clear abolishing Roe v Wade is not a popular position, but because voters know the Democrats will filibuster any attempts by the GOP to do so, they hold their nose on that issue and vote for the GOP anyway. If voters actually believed the GOP could enact some of their most unpopular policies (cut Social Security, Medicare, ban abortion and same-sex marriage) you may see their support diminish significantly and the parties have to adjust to voter preferences, not just religiously adhere to a status quo of parties making unrealistic promises and never enacting them.",
            "title_similarity": "0.8504565",
            "sentiment_compound": 0.9519
        },
        {
            "id": "h0ghbml",
            "score": 1,
            "text": "The filibuster can be abolished at any time, by any party. And if Mitch McConnell gets power again, he won’t hesitate to. Nothing would be stopping him. \n\nIt’s better to get rid of it now and chalk up some policy accomplishments than sit on it and watch it be abolished in the future.",
            "title_similarity": "0.7291821",
            "sentiment_compound": 0.6052
        },
        {
            "id": "h0ghzdn",
            "score": 5,
            "text": "That’s exactly like finally getting a girlfriend and then spending all of your energy worrying about her breaking up with you instead of just enjoying the relationship. What the absolute fuck is the point of winning elections if as soon as you do, you’re going to neuter yourself and worry about a bunch of what if’s?\nAlso, mind you, that’s only a problem if republicans get the house, and the presidency as well. Oh and remember the ACA repeal where mccain famously gave it the final No vote? That was done without the filibuster. The filibuster did not protect the ACA. So you’re just blowing smoke.",
            "title_similarity": "0.8017362",
            "sentiment_compound": -0.4106
        },
        {
            "id": "h0giv9h",
            "score": 6,
            "text": "The fact that you are saying that we can't change the rules of the political system at all because we can't trust that the other political party won't enact revenge is the surest sign yet that this country is irrevocably broken.",
            "title_similarity": "0.7493425",
            "sentiment_compound": 0.2439
        },
        {
            "id": "h0gjyji",
            "score": 112,
            "text": "The Silent Filibuster should be banned.\n\nIt's ridiculous for no vote to be held because the minority party says they \"might\" filibuster.\n\nA talking Filibuster is OK in my book. As long as they are present an explanation for why they oppose the bill and continue occupying the floor at least everyone will get to see video of the minority parties arguments, eventually there will still be a Vote.\n\nThe silent Filibuster removes accountability because bills never get voted on. \n\nA Senate that doesn't vote isn't accountable to their constituents. \n\nMcConnell knows this and that's why so few bills have even had a vote since 2010 or so. \n\nA Democracy without transparency and accountability is just a farce.",
            "title_similarity": "0.85788965",
            "sentiment_compound": -0.5813
        },
        {
            "id": "h0gklxa",
            "score": 1,
            "text": "I think America can't continue to be stagnant.  Do I want Republicans to get to do everything they want?  No.   But if say HR 1 is passed and things like gerrymandering were outlawed, elections more accurately reflected the population.  Now after that's passed the Republicans in fair and open elections get more House seats, more Senate seats, and the Presidency.  Well clearly the American people want to try that agenda, so let's give it a shot.  So long as elections are fair, we cut this BS gerrymandering and suppression out, then let's get shit done and stop twiddling our thumbs.",
            "title_similarity": "0.7462591",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h0go8e4",
            "score": 2,
            "text": "Have you considered that there might be a difference between the democratic agenda and the republican agenda, in terms of how much of the latter (tax cuts more military spending)  can be passed purely through Reconciliation bills that can't be filibustered?\n\nIf the Republicans can get 90% of what they want with the filibuster still place so long as they have a slim majority in the senate and control the other houses... how much protection does the filibuster really offer?\n\nBesides with the filibuster gone, if the legislation is bad/hurts people then Democrats will win the next election and have an easier time repealing it now that there's no filibuster to make passing laws harder...\n\nThis is only a problem if you believe that Republicans can somehow engineer a permanent majority where Democrats will never be in a position of controlling both houses of congress and the Presidency at the same time again, otherwise whatever they do that is bad can be undone.  \n\n\nHowever if the good things we do prove popular then they won't be undone... see how Republicans for all they talk about repealing the ACA still haven't been able to do it even when they got a chance that would only require 50 votes through reconciliation.  \n\n\nSocial Security is considered the third rail of politics, you touch it you die.  \n\n\nPeople like it when you enact laws that benefit them, and don't want to see those laws repealed, even if they behave like hypocrites relating to them (\"Keep your government hands off of my medicare!\")  \n\n\nIn short, it's more important we help people than that we worry about the political blow back.",
            "title_similarity": "0.74736685",
            "sentiment_compound": 0.9019
        },
        {
            "id": "h0gotf6",
            "score": 1,
            "text": "What's stopping the Republican party from getting rid of the filibuster the next time they have a Trifecta? If it only takes a majority of the Senate, then it's essentially a norm. And we've seen how the Republican party is fine with violating Senate norms. The most recent examples that come to mind are Merrick Garland and Amy Coney Barrett.",
            "title_similarity": "0.8099537",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0goxwi",
            "score": 1,
            "text": "What makes you think the Republicans won't get rid of the filibuster the moment it's convenient for them? \n\nThis is absolutely not the time for wringing hands and saying \"what if\".  This is the time for bold leadership and action.  If there is not, then fully expect The Donald to come roaring back.",
            "title_similarity": "0.7377695",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0gpz6l",
            "score": 2,
            "text": "The filibuster is not intended to be a democratic procedure for two reasons, one direct and one indirect. \n\nThe direct reason for the filibuster is to allow time for proper debate on a bill of a senator feels that there is not enough discussion. It has been used to stall bills because of how long it goes on, but most of the time it is used correctly to have longer informed debate and time to gather forces for a vote. Without the filibuster bills could be passed by complicated majority of 50 senators and 1 tie breaker instantly overnight which would not be good for the country or the party that passed that bill in the long run.\n\nThe indirect reason for the filibuster at least in the senate is because the senate is a republic institution not a democratic one. It is really a republican procedure.",
            "title_similarity": "0.75689894",
            "sentiment_compound": 0.1258
        },
        {
            "id": "h0gq7iz",
            "score": 1,
            "text": "The point of getting rid of the filibuster is not to keep Republicans from blocking what they want.\n\nIt's to keep that much power out of the hands of a minority.  \n\nIf the Republicans can move away from being a party of a shrinking few they have nothing much to worry about.  They will as you say just be in control at different times.  If however they tailor their party's agenda and strategy to appealing to just a minority of the country and using every trick they can to amplify that power and bring it to bear on the rest of the country, then it's a real threat.  But it's not a threat to any one party.  It's a threat to an undemocratic strategy that has taken route in one party deeply.  Change the rules you change the direction of the party.  Leave them the same (more accurately allow state legislatures and Republican executive action to keep changing the rules in an increasingly undemocratic fashion) you get more of what we've seen.  The best cure for an undemocratic party level strategy is to keep it from paying off.",
            "title_similarity": "0.76969695",
            "sentiment_compound": 0.9688
        },
        {
            "id": "h0gqcqi",
            "score": 1,
            "text": "The reason Mitch McConnell preserved the filibuster during the Republican trifecta of 2016-18 wasn’t because he was concerned with parliamentary decorum or fear of what Democrats would do with a majority, it’s because he didn’t want to force his members to take tough votes that split his caucus in uncomfortable ways. We know this is true because when his caucus rallied around a cause they all truly cared about (supreme court justices) they got rid of the filibuster in the blink of an eye, on the other hand, when a very popular covid relief bill passed the Democratic house that likely had majority support in the senate (all Democrats and a few moderate Republicans in tough re-election fights supported it) he just sat on the legislation to run out the clock and prevent his caucus from taking a divisive vote.\r  \n\r  \nThe reason Democrats should get rid of the filibuster is because they should believe their agenda is much more popular with the American people than the Republican agenda. If that’s true, then Democrats should do their popular things and run on having delivered those things. And then when they lose (which like you say, will eventually happen) and Republicans do unpopular things with their majorities Democrats will be able to run against them and beat them. \r  \n\r  \nIn a democracy parties shouldn’t worry about their opponents doing unpopular things, they should relish it! Now if Democrats don’t believe their agenda is more popular than the Republican one then that’s a deeper problem and they should probably think seriously about what it is they’re even doing here, but if they think their agenda is more popular then they should welcome the opportunity to show voters that contrast.",
            "title_similarity": "0.8355825",
            "sentiment_compound": 0.9763
        },
        {
            "id": "h0gqcyq",
            "score": 1,
            "text": "The filibuster primarily benefits the status quo because it makes it easier to prevent changes. The Democrats as a party are in general less okay with the status quo than Republicans and tend to support bigger changes, therefore the filibuster is much more likely to help Republicans and hurt Democrats.\n\nI think it's also worth noting that the filibuster only started being used in this way fairly recently, only within the last decade or so. So removing it would simply be moving the Senate back towards it's previous norm.",
            "title_similarity": "0.78982973",
            "sentiment_compound": 0.8994
        },
        {
            "id": "h0gqf2z",
            "score": 1,
            "text": "I think that this is assuming if the shoe is on the other foot, they wouldn't do it themselves. If Republicans had majority but not filibuster breaking majority and they had the chance to ensure legislation (or appointments) they want will go through no matter what, they would do the same.\n\nIf Dems abolish the filibuster, approve DC & PR statehood (both predominantly blue), that's 4 more seats added to the senate. Will they hold it forever? Probably not. But the filibuster should never have been created in the first place. The senate *was meant to run off of a simple majority with VP tie breaker* as outlined by the constitution. As far as I can tell, abolishing it would be correcting the course. Republicans should want it as they deem to be so adamant on protecting the founders' wishes. \n\nNot to mention, why would McConnell threaten to not transfer power unless they promised not to abolish the filibuster? Because he knows his job becomes obsolete in the short term if they did. The dude won't survive long enough to see his party fully back in power if the filibuster happens. It would need to go to the next one up. He knows he's powerless at that point. It's all fear mongering. If you want to make hard changes you have to play hardball, which Reps continue to do while Dems whine about bipartisanship.",
            "title_similarity": "0.7773541",
            "sentiment_compound": -0.6576
        },
        {
            "id": "h0gqjev",
            "score": 1,
            "text": "I believe the biggest threat to our system of government is political apathy and depoliticization of the citizenry. This is driven by the fact that people vote for X candidate or party and see nothing fundamental change because of tactics like the filibuster. This leads to those people dropping out of the political process and politics being dominated by hyper-obsessive partisans. \n\nTo me the long-term benefits of actually demonstrating to people that government can follow through on promises and enact change (through more than just one bill per legislative session) outweigh the potential costs of a session where Republicans can pass their preferred legislation",
            "title_similarity": "0.7820937",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0gr4u4",
            "score": 1,
            "text": "I haven’t read through all the comments, so apologies if this has been stated, but that’s really only an issue if a party holds both the legislative and executive branch and is willing to use that power. Republicans showed pretty well they weren’t willing to use the power 2016-18, and they don’t often get enough support to gain both branches. If the Democrats get rid of the filibuster and use it to pass voting reform, the likelihood of the Republican Party (as it exists today) gaining that power again is low; they lose when people can vote. So they’d have the senate, but that’s about it. \n\nIt’s worth it. There are risks, but the senate doesn’t even begin to live up to its intended purpose as the chamber of higher deliberation.",
            "title_similarity": "0.81588125",
            "sentiment_compound": 0.9657
        },
        {
            "id": "h0grcfm",
            "score": 1,
            "text": "If there are federal protections for voting rights like what is in the For the People Act then Democrats don't have to hold control of congress forever.  They would just need to set the rules straight to prevent the GOP from gaining control through undemocratic means. \n\n states like Georgia and Nevada shifting to blue in the presidential election, D.C. being considered for statehood, and [the National Popular Vote Interstate Compact](https://en.wikipedia.org/wiki/National_Popular_Vote_Interstate_Compact) gaining traction, the country is showing a strong push for a more democratic government. \n\nAll a Democrat controlled governement would need to do is hold their seats long enough for Trump's GOP to fail. After the \"stop the steal\" and \"deep state\" consipracy theory minority is no longer the only way Republicans can get or stay in office, the Republicans will have to answer to more centrist voters. \n\nFor the above reasons, it would also be less likely that Republicans will controll both houses and the presidency in the next two elections. \n\nThere are people who believe that a bipartisan congress is the best way to go, and, if given the opportunity, those people will vote candidates into office who believe the same thing. \n\nI'm not exactly making predictions, but I think it is at least a strong possibility that federal voting protections will end the era of partisan strong-arming and both parties will have to shift from the poles of the political left and right towards the center.  \n\nIf that can be accomplished, then I feel Democrats will be proud to have enabled the country to move in a positive direction, even if it means future Republican will pass laws that Democrats don't like.",
            "title_similarity": "0.76101935",
            "sentiment_compound": 0.9799
        },
        {
            "id": "h0gs223",
            "score": 1,
            "text": "In 1890 the House passed a bill to protect voting rights, but it was killed by Senate filibuster.\n\nBy 1907 every Southern state had changed their constitutions to keep Blacks from voting & Black turnout fell from 61% to 2%. Direct relationship to Jim Crow.\n\nKeeping the filibuster then was a generational disaster. Hard to overstate the magnitude of the problem.\n\nAll kinds of parallels with the current situation. There is a rush among Southern states to make it easier to overturn elections and appoint the loser the winner via partisan process, if their efforts to make it more difficult to vote also fail. The President directing the Georgia SoS to \"find 11780 votes\" was something that happened last year, not a century ago. 147 Republicans in Congress voted to overturn the election last year, not a century ago.\n\nNo one can predict the future. But if it turns out failing to eliminate the filibuster was the far worse option, *it wouldn't be the first time*. \n\nAs an aside, many Republican priorities are already not subject to filibuster: All Federal court justices including the Supreme Court, tax cuts, etc. Democratic priorities like voting rights mostly are.",
            "title_similarity": "0.8185183",
            "sentiment_compound": -0.9807
        },
        {
            "id": "h0gsfm5",
            "score": 1,
            "text": "The one response I would give is that in terms of federal government, only one chamber is subject to gerrymandering, and that is the one democrats have typically held, and held for long periods of time. The senate is more replicable held by republicans, and gerrymandering has nothing to do with those elections.\n\nPoint being, gerrymandering happens and it is gross, I prefer straight lines, but we should not just say that republicans gerrymander. You see it in many democrat held states.",
            "title_similarity": "0.7574729",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0gsjs4",
            "score": 1,
            "text": "Sounds like Republicans are the problem and not the filibuster.",
            "title_similarity": "0.51290554",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0gsuu9",
            "score": 5,
            "text": "In 2017, Republicans had majorities in the house and senate, and controlled the presidency. One of the main items on their agenda was repealing the ACA - something which Republicans had been running and winning on since 2010. Although Republicans did not have 60 seats in the senate, it was possible to use the reconciliation process to repeal large parts of the ACA with only 50+1 votes.\n\nAlthough the ACA as a whole wasn't super popular at the time of passing, individual provisions of the legislation polled very well, with widespread support across ideologies. Despite this, McConnell moved ahead with the attempt to repeal the ACA, but found it more difficult than expected to get all Republican senators on board. To try to win enough support, he settled on the so-called \"skinny repeal\" bill, which would get rid of the individual mandate and a few other provisions, but wouldn't touch topics like medicaid, taxes, or subsidies - all of which had been large parts of the Republican platform until that point. Of course, even this bill failed to garner enough Republican support, and Republicans had to settle for merely getting rid of the individual mandate in their tax bill.\n\nI'm sure you knew all this already, but the point of this story is that it is genuinely difficult to pass deeply unpopular legislation, even if it only needs 50 votes, and has been a core part of the party's platform for the past decade. As I'm sure you would agree, politicians are deeply self-interested individuals, and they are not in the habit of jeopardizing their chances at re-election.\n\nI'm not naive. I'm well aware there would still be plenty of legislation that I find incredibly disagreeable which would only be passed under a non-filibuster government. However, so long as elections continue to be fair and free, public opinion will tend to moderate this legislation, and make it less likely to pass in general. I am willing to accept this consequence in exchange for the possibility of passing popular legislation that I find agreeable.",
            "title_similarity": "0.6974863",
            "sentiment_compound": 0.9772
        },
        {
            "id": "h0gswu9",
            "score": 1,
            "text": "Easy peasy - get rid of the filibuster until the day before the next election, then reinstate it.\n\nIf Republicans are going to game the system as much as they have been, I see no reason why Democrats should not reciprocate. Moscow Mitch burned a loooot of bridges with Merrick Garland.",
            "title_similarity": "0.78881156",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0gsytx",
            "score": 1,
            "text": "Your stance essentially suggests that one party is good and the other party is evil. Your stance is that the good party could one day become the senate minority, and they will need a tool like the filibuster to stop the evil party.\n\nThe only way to possibly change your mind is if you shed this notion that one party is evil and the other is good. The reality is that the people leading each party are all doing their best to serve a small group of people (lobbyists), and the followers of each party all think that their party's platform will best serve America.\n\nWhen you look at it from that view, you stop cheering for one of the teams, and you start trying to make fair rules for the game. When you adopt this view of politics, you'll see that, at the end of the day, the citizen's of the country are responsible for electing the people who represent them, and thus, popular laws should not be blocked by a significant minority.",
            "title_similarity": "0.7950195",
            "sentiment_compound": 0.9847
        },
        {
            "id": "h0gt2ir",
            "score": 1,
            "text": "I'm sure that horrible things will be passed once the republicans control the House and Senate again. In general, it seems superior for each party to actually be able to enact their will when they get into office for 2 reasons:\n\n1) If the party in charge is able to actually accomplish what they want to do, without being able to blame the other party, and they pass things that the majority of voters find abhorrent, hopefully either the other party will win, or they will be primaried by other members of their party who listen to voters more.\n\n2) In general, conservatives are more likely to espouse the view that \"government doesn't work\", and having a large ability to grind the government to a halt on certain topics naturally benefits the party that does not want change, progress, or a functional government.\n\nI'm also not sure we even have to completely remove the filibuster. Even changing the rules so that someone literally has to be talking the whole time about something relevant to the bill itself would be a major overhaul. The current system basically allows a bill to be \"filibustered\" indefinitely with no one doing anything until you have a vote for cloture.",
            "title_similarity": "0.7854495",
            "sentiment_compound": 0.9632
        },
        {
            "id": "h0gt5jy",
            "score": 1,
            "text": ">One argument for getting rid of the filibuster is it will allow the passage of the new voting rights bill, which many Democrats believe will help ensure Republicans aren't allowed to steal elections through gerrymandering and local voting laws the discourage certain democrat leaning demographics from voting. My response to that is that it is simply absurd to believe that Democrats will hold onto both the House and the Senate forever. Republicans will win again at some point, and they will enact revenge.\n\nIf Democrats are able to pass a new voting rights bill that ends gerrymandering and makes it easier for everyone to vote, Republicans will likely be forced to moderate their party platform in order to continue winning elections.  For the last 10-20 years they've increasingly used tactics like gerrymandering and restrictive voting laws that more heavily impact demographics who are inclined to vote Democrat to stack the deck in their favor.  Without being able to use those tactics, they'll either have to moderate their platform to find new supporters or they'll start losing elections pretty consistently.  With a more moderate Republican party it won't be such a concern if they're in power in the future and there's no filibuster to stop their legislative agenda.",
            "title_similarity": "0.87444115",
            "sentiment_compound": 0.9595
        },
        {
            "id": "h0gtv0c",
            "score": 1,
            "text": "The filibuster will provide no protection for Democrats if they lose their majority in Congress for the same reason that the Democrats are able to consider abolishing or reforming it at this moment- because it is a procedural rule that requires only a simple majority vote to change. If the Democrats don't abolish the filibuster now then there is absolutely nothing preventing Republicans from doing so if they regain a Senate majority.\n\nDo you know how many times the filibuster was successfully used to prevent the passage of legislation during Trump's presidency? Never. If they filibuster prevented Republicans from passing anything they wanted to pass then you can be sure McConnell would have got rid of it, much as he did for judicial appointments. The only reason the legislative filibuster still exists is that it's more harmful to Democrats than Republicans. The Democratic agenda generally requires them to do stuff while they are in power, which they need to legislate for, whereas the Republican agenda is much more easily achieved without legislation as it involves *not* doing stuff, and tax cuts can be passed through reconciliation.\n\nIn short, not getting rid of the filibuster now does nothing to prevent it being abolished in future and it's continued existence is more damaging to Democrats than Republicans.",
            "title_similarity": "0.8498052",
            "sentiment_compound": -0.2551
        },
        {
            "id": "h0gtxwu",
            "score": 1,
            "text": "I dunno, if the democrats can pass major voting reform *and* make DC (and potentially PR) a state, that would do a whole lot to solidify their hold on Congress and the White House. Also, holding onto the presidency has the same blocking effect as having the filibuster, so there's more than one angle of approach.\n\nThey don't need to hold it \"forever\", either, just long enough to demonstrate effective policy and to let the younger cohort become the more prominent part of the voting base. As we've seen with the ACA, taking away social policy after it's already been enacted is not very popular, even when there's a dedicated campaign against it. At that point, the republicans would have to at the very least change their platform to more closely match the views of the voting public.",
            "title_similarity": "0.8191335",
            "sentiment_compound": 0.549
        },
        {
            "id": "h0gu86u",
            "score": 1,
            "text": "If Republicans wanted the filibuster gone they could have done it when they were in power. They didn't get rid of it because they're scared of what the Democrats can accomplish without it. \n\nFor the Democrats, the smart move is to call the Republicans' very obvious bluff: eliminate the filibuster. Expand voting rights. Enact DC and PR statehood. Boom, no more Republican Senate for at least a decade. Democracy (at least temporarily) saved.",
            "title_similarity": "0.8534157",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0gudko",
            "score": 1,
            "text": "The Filibuster is directly and *specifically* designed to halt progress that helps the common man.\n\nThe *Democrats* may regret it, but for the most part, common Americans would benefit from its removal.\n\nThe GOP agenda is actually very unpopular. If they started passing things like abortion bans, they'd lose power for two reaons, 1) It'd awaken the apathetic, and 2) they couldn't perpetually run on the issue. (This is the secret to understanding why the GOP run on issues they don't actually believe in. It's also the secret to why Democrats don't pass sweeping legislation while in power. But this is a convo for another post.)\n\nThere's only so much the GOP can and is willing to do in opposition to the protection of the Bill of Rights and an actual mobilized population. \n\nIn fact, the filibuster is one of the things that keeps the GOP in power, even when they have a minority in Congress. I mean, that's pretty fucked up.\n\nOh, and they pass tax cuts even with the filibuster which is the only thing the *actual* owners of the GOP care about. Everything else is for show.",
            "title_similarity": "0.85917366",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0guq2d",
            "score": 1,
            "text": "Where are you getting this idea that the Republican party still regain control? Not to say it's unfounded, you just need to know where you got it:\n\nBroken down issue by issue, the democrats win on almost every front. They could literally implement Sanders' entire policy package and cement victory for ages. The problem isn't what they want to do, it's that no one thinks they'll do it. Universal background checks? Even Republican voters want it. Could be passed today, or never because \"something something Manchion, something dark side.\" And in 4 years when Harris is trying to seem empathetic to the loved ones of the victims that died to guns sold till someone on the who watch list the Republicans get to simultaneously say, \"we stopped the democrats evil plan\", \"you were in charge for 4 years and you did nothing, step aside\", and \"since the plan you had to deal with it (which we stopped you from implementing) didn't work, let's require a semi-auto rifle to be carried by every military age bio male\". \n\nOnly one way to prevent us from that path and it's to actually get stuff done so the millions of people voting against Trump have something to  for instead. The filibuster's gotta go.",
            "title_similarity": "0.74044204",
            "sentiment_compound": -0.801
        },
        {
            "id": "h0gvczy",
            "score": 1,
            "text": "You assume the GOP will not get rid of the filibuster once they are in power. I believe that is a mistake. The GOP, after being willing to ignore an insurrection and actively tried to negate electoral results in several states, is capable of anything.",
            "title_similarity": "0.73679626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0gvq42",
            "score": 1,
            "text": "Democratic policies typically expand benefits whereas republicans policies typically take them away. At a certain point, it becomes virtually impossible to take certain benefits away without upsetting a significant percentage of the voting population. Therefore, the Republican Party has far more to lose if the filibuster is gotten rid of. Their sole agenda in recent years has been the obstruction of democratic policies. Removing the filibuster would force them to put forward and defend alternatives, in other words actually govern. What republican policies should democrats be worried about anyway? I'll give you one to get it out of the way, abortion... Ok, what else?",
            "title_similarity": "0.79975605",
            "sentiment_compound": 0.8606
        },
        {
            "id": "h0gw3nr",
            "score": 1,
            "text": "The filibuster does not exist in almost any other democratic government around the world and even the majority of states don’t have filibusters. And in these countries and states there haven’t been wild swings in policy like people warn about the filibuster. Part of the reason why is because the filibuster allows politicians to have extreme positions cause there is no real chance they could ever pass. If the filibuster didn’t exist those politicians, when their party is in power, wouldn’t have an excuse for not getting stuff done.",
            "title_similarity": "0.7106631",
            "sentiment_compound": 0.2869
        },
        {
            "id": "h0gw6i8",
            "score": 2,
            "text": "I think that’s how it should be..If the american people vote the GOP in get ready for some of their changes then the people react and vote the dems in and they change it..The filibuster is undemocratic. Yes Gerrymandering makes it harder for dems to get in office. But its like that because everytime they try and change gerrymandering its filibustered...",
            "title_similarity": "0.74999213",
            "sentiment_compound": 0.705
        },
        {
            "id": "h0gwlyu",
            "score": 1,
            "text": "DC, Puerto Rico, 4 Californias. The senate is anti democratic even without the filibuster. \n\n\nBlocking everything is fundamentally conservative, not allowing change will keep us on the path towards climate collapse. \n\nEliminating the filibuster won’t save us but keeping it will doom us for sure.",
            "title_similarity": "0.863861",
            "sentiment_compound": -0.1675
        },
        {
            "id": "h0gwlzg",
            "score": 1,
            "text": "The Republicans agenda mostly consists of the things:\n\n1) Lower taxes, cut spending  \n2) Seat conservative judges  \n3) Stop whatever the democrats are trying  \n\n1 is already possible without a supermajority because of reconciliation. 2 is already possible because McConnell carved out a filibuster exception for seating judges. 3 is much easier when the filibuster applies to everything else.\n\nDemocrats, meanwhile, want lots of things. Better healthcare. Cleaner energy. Higher minimum wage. More democratic elections. Equal treatment of LGBTQ citizens. A path to citizenship for undocumented immigrants. Student loan debt relief.\n\nThe current administration is trying to make watered down steps toward each of these through executive orders or reconciliation bills but they truly are handcuffed by not being able to change any laws.\n\nSo the filibuster, in it's current form, serves to block the Democrats' agenda but not the Republicans'. There is no secret scary Republican agenda which will be unleashed as soon as 50 Republican senators are elected. If there were, McConnell would have already killed it 4 years ago.",
            "title_similarity": "0.77660143",
            "sentiment_compound": -0.6319
        },
        {
            "id": "h0gx84c",
            "score": 1,
            "text": "The law is for a majority to pass a bill. The filibuster was added to allow for unlimited debate in the Senate. It has since been abused to do that exact opposite, it is used to stop all debate to the point where a single person can stop a bill. This is inherently undemocratic. If we think 60 votes is what should be required to pass a law, then that should be the law, not this weird loop hole.\n\nPersonally, I think if we get to a point where every new majority is just spending all their time undoing the last majorities work, then that is not necessarily a bad thing. What we are doing today results in a constant stand still. A quote I think is relevant is \"The arc of the moral universe is long, but it bends toward justice.\" I believe faster congress would allow for the party in charge to try everything they were voted to try, and then the next party kill whatever doesn't work, and on a long enough time scale that arc will always bend towards progress. And if at any point that stops working, it just takes 1 party to say \"Ok that's enough, we need a 60 vote majority to pass a bill\".",
            "title_similarity": "0.78121173",
            "sentiment_compound": 0.9153
        },
        {
            "id": "h0gx95i",
            "score": 1,
            "text": "> One argument for getting rid of the filibuster is it will allow the passage of the new voting rights bill, which many Democrats believe will help ensure Republicans aren't allowed to steal elections through gerrymandering and local voting laws the discourage certain democrat leaning demographics from voting. My response to that is that it is simply absurd to believe that Democrats will hold onto both the House and the Senate forever. Republicans will win again at some point, and they will enact revenge.\n\nYou are thinking too small - and so is the Democrat party imo.\n\nNot claiming it would happen, but if you want Democracy, then remove Filibuster AND do voting rights AND do campaign finance reform AND fundamentally change the system to promote moderation and >2 parties. The sticking point is that last one _probably_ requires Amendments, so Filibuster or not, no luck.\n\nModern democracies, i.e. ones created in the past 50 or even 100 years, have much more innovative systems to ensure checks and balances while also promoting moderation, preventing gerrymandering, and increasing the organic success of third (and more) parties. An easy one that hits all three is Jumbo-districting.\n\nI agree with your view: \"Democrats will regret it if they ever get rid of the filibuster\"...but only because they won't go far enough.",
            "title_similarity": "0.8864346",
            "sentiment_compound": 0.9912
        },
        {
            "id": "h0gxq8z",
            "score": 1,
            "text": "If the Democrats rolled back the filibuster they could clench power for the next 20 years or until the republicans completely restructured.\n\nThey could roll back voter suppression laws across the country. They could pass anti gerrymandering legislation. They could make DC a state. They could make it to where McConnell’s kids would die of old age before republicans ever held the senate again.\n\nPlease note that republicans have had a tyranny of the minority for a very long time. Even just making a level playing field would remove them from power, let alone actual aggressive progressive policy. Play their own game and they would be done.",
            "title_similarity": "0.7991997",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0gxzcy",
            "score": 1,
            "text": "1. Republicans are more likely to use procedural means to attain their goals.   For Republicans, it is often the ends that matter, not the means.  The republican base cares more about the results then about how this was obtained.   For democrats, their base cares about the means.    This means that Democrats are less likely to be able to use a filibuster effectively.\n\nAs an example, look at the supreme court justices.   For Republicans, getting conservative judges on the court was more important than any appearance of propriety.   If this situation was reversed, the Democrats could have never pulled it off because their base will not allow for it.\n\n&#x200B;\n\n2. Republicans are more often against change than Democrats.   This is more of a general world conservative vs. progressive dynamic.   Conservatives often win when the government is paralyzed and cannot pass legislation.   A filibuster overall helps conservative anti-change movements more than it helps pro-change movements.",
            "title_similarity": "0.7596613",
            "sentiment_compound": 0.9747
        },
        {
            "id": "h0gy4ws",
            "score": 1,
            "text": "my take on it is this. what we have right now is a stalemate. wanna know why there are so many articles talking about which politician owned some other politician on twitter? because all they can effectively do is trash talk. no serious legislation will get passed, because the republicans are hellbent on preventing anything meaningful from being done by dems\n\non the flip side, I'm not all that sure republicans have a lot of meaningful legislation to pass. their political tactic as of the past decade or so has simply been to be anti-dem. that's not a philosophy that produces anything. it's a philosophy that obstructs and destroys. I personally think the filibuster helps the reps blame the dems for not having fixed all the problems they claim to want to fix. they didn't destroy obamacare, because it actually would've hurt their constituents, but they still get to pretend obamacare is a bogeyman whose demise is right and just and only the reps are willing to do it. \n\nI honestly think that people will wake up to the reps' bullshit when they actually have to start passing real legislation, and people will realize that dem legislation isn't the ghost under the bed that reps want their supporters to believe",
            "title_similarity": "0.7753837",
            "sentiment_compound": 0.5571
        },
        {
            "id": "h0gyfyn",
            "score": 1,
            "text": "I think in 2022 republicans will take back both chambers. House at the very least",
            "title_similarity": "0.51038647",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0gymuy",
            "score": 1,
            "text": "I'm in somewhat agreeance with what you are saying. The filibuster does need to go but I don't believe people are thinking of what that means when the Republicans have the majority again. What I believe needs to happen is a complete rehaul of the current system to the core. \n\nSide note - most of the responses have been well thought out and make you think. I appreciate the debate going back and forth.",
            "title_similarity": "0.6901921",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h0gz0g6",
            "score": 1,
            "text": "Is the political system an arbitrary collection of procedures for people to navigate in order to get what they want, or is it a framework to place government legislation under scrutiny?  Filibusters are not being used for scrutiny.  The moment the \"Motion to Filibuster\" became allowed, it became a tool to avoid scrutiny either way and simply block the bill.  \n\nTheoretically having lawmakers debate bills means that there might be times that they go in planning to vote one way, but think \"Do you know, I was going to vote against it but having heard the very sensible arguments the congressman from New England made, I will support it.\"   The \"motion to filibuster\" means that this can't happen, in either direction, even theoretically.  \n\nInstead, the party of which the President is not a member (which in any other country is called the \"Opposition Party\") can endlessly block things.  In any other country, the situation where meaningful legislation cannot pass because no single party controls enough of the legislature to get new laws through is called a \"Hung Parliament\".  In 21st Century US, it is the default situation.",
            "title_similarity": "0.7607482",
            "sentiment_compound": 0.4267
        },
        {
            "id": "h0gz0jo",
            "score": 1,
            "text": ">it is simply absurd to believe that Democrats will hold onto both the House and the Senate forever\n\nSomething I think you're overlooking is the idea that if significant voting reforms are passed that make it harder for Republicans to subvert elections and gerrymander, they may have to realign their platform. Right now they're comfortable sitting at the extreme end of the scale because they still have a good shot at winning elections, but if that changes they'll have to start courting more moderate voters. I think the goal of electoral reform shouldn't be to prevent Republicans from winning forever, but to make their *current extremism* a less viable position. If they're forced to back down to gain broader appeal, what they do when in power won't be as noxious and in the long term that's a much better thing for the country than keeping the filibuster in place to prevent then from making Christianity the state religion or whatever.",
            "title_similarity": "0.8429845",
            "sentiment_compound": 0.9412
        },
        {
            "id": "h0gz48j",
            "score": 1,
            "text": "Not sure if someone else has mentioned this, but I am wondering if you have considered the alternative? Republicans in many battleground states are in the process of passing legislation that makes voting more difficult, and some of these bills specifically target Democratic voting blocks. This is in addition to redistricting (read: gerrymandering) that will put Democrats at an even bigger disadvantage in 2022 and beyond.\n\nIf Democrats remove the filibuster, they can pass legislation that would eliminate partisan redistricting (gerrymandering) by requiring redistricting to be performed by a non-partisan third party. They could additionally protect voting rights for Americans that live in Republican-led areas. Without this voting rights legislation, Democrats will face even more serious disadvantages in elections.\n\nMy point is this: if you consider the alternative, getting rid of the filibuster is far and away the best option.\n\nAnd, just as a reminder, there was an attempted coup on the U.S. system of government Jan. 6th. Investigating and prosecuting those responsible for the coup will not happen while the filibuster is in place. This alone should be sufficient justification for any American with an ounce of patriotism.",
            "title_similarity": "0.78461754",
            "sentiment_compound": -0.7006
        },
        {
            "id": "h0gzd2k",
            "score": 1,
            "text": "The thing is that the GOP doens't have \"egregious legislative goals\" at the moment, because they don't have *any* legislative goals. Like, what are they going to do, outlaw abortion? All their policy positions are extremely unpopular with the country writ large, if they actually tried to enact them they'd be in a pot a hot water, and they'd no longer be able to dangle them in front of their base.\n\nThe filibuster only stops parties from passing laws, but the GOP has no interest in passing laws. Just look at the last time they had full control, the only thing they passed was a tax cut, because at the end of the day that's the only thing they're really willing to go to the mat for. The filibuster only really hurts Democrats who want to try and really change the country, the entire point of the GOP is to keep the country from changing, and the filibuster is how they do that. If they got into power, the filibuster doesn't stop them from continuing to not change things, it in fact makes it even easier and gives them an easy excuse if a constituent asks \"why haven't you outlawed abortion yet?\"",
            "title_similarity": "0.77620876",
            "sentiment_compound": 0.3362
        },
        {
            "id": "h0gzdkf",
            "score": 1,
            "text": "Please name *anything* Democrats could do or not do, short of complete capitulation, that the own-the-librulz crowd would not dedicate their lives to making them regret.",
            "title_similarity": "0.7909037",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0gzswd",
            "score": 1,
            "text": "When Republicans have the majority they primarily use their power to prevent bills from being voted on in the first place. By definition conservatives want to keep things the way they are and progressives want change. That fact combined with how much reform is needed makes it the right move for Democrats. If they can pass the voting reform bill and give The district of Columbia a vote then it is entirely possible they will never lose control of the Senate again. \n\nKeep in mind that the more large cities a state has, they in inevitably turn blue. The combination of higher education and more diversity naturally leads to that outcome. Several traditionally red states like Texas and Florida are on the cusp of this.\n\nBasically the more people that vote, the more likely the Democrats will stay in power. Since the population will keep growing, that inflection point will be hit eventually. If they still haven't gotten rid of the filibuster by that point, they should.",
            "title_similarity": "0.8169672",
            "sentiment_compound": 0.7317
        },
        {
            "id": "h0gzwqq",
            "score": 1,
            "text": "As long the Dem party elects progressive candidatee with grassroots movments and not more Manchins or Pelosis the Republicans will never hold both houses at once again if at all.",
            "title_similarity": "0.7096524",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0h0uk4",
            "score": 1,
            "text": "The flaw in your argument is thinking that Republicans will honor the filibuster if the Democrats don't overturn it. Mitch McConnell will certainly do whatever he can to achieve his goals. Being altruistic as the first move is often rewarded, but being unilaterally altruistic after repeated negative responses is not.",
            "title_similarity": "0.80261785",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0h13t3",
            "score": 1,
            "text": "**Argument #1:** Removing the filibuster would allow us to see how a party would actually govern if given power and to hold them accountable for the impacts of implementing their agenda. In the status quo, parties have no incentive to propose agendas that are actually beneficial because they know that basically no major legislation has any chance of passing anyway. If a given party wins Congress and the Presidency, they can't even implement their agenda and they get to blame their failure on the other party filibustering. You may not like the Republicans and someone else may not like the Democrats but if they win a majority in all parts of the government, they should be given a chance to implement their agenda in a way that we can actually evaluate the impact of. If a majority of Americans likes the impacts of their policies, that party should get re-elected, and if a majority of Americans dislike the impacts, that party should lose the next election. However, in the status quo, no one accomplishes anything and gets to blame both sides and the American people never actually get to see what it would have been like if the Democrat or Republican policy agenda had been implemented.\n\nI believe this would actually have a moderating effect on both parties as well. Currently, Republicans get to advocate for all sorts of extreme positions that excite their base but which they know are broadly unpopular, because they know that those positions will never be implemented into law due to the filibuster. If they actually had the ability to implement some of those broadly unpopular positions, either they would do so and be voted out of office immediately, or they would have to admit that they don't actually believe that some of their more extreme policies would improve the country.\n\n**Argument #2:** The filibuster asymmetrically benefits pro-corporate Republicans. The policy interests of pro-corporate Republicans really only involve removal of regulation and reduction of taxes, both of which can be done in the status quo easily with budget reconciliation (e.g. Trump tax cuts) and the Executive branch (e.g. weakening EPA/CFPB/FCC regulations). On the other hand, almost all of Democrats' main policy items, from healthcare to climate change to voting rights to infrastructure to immigration to poverty reduction, cannot easily be fit within the restrictions of budget reconciliation. I would contend that most of the socially conservative policy ideas from the Republican leadership (e.g. restriction of LGBT rights, restriction of abortion rights, expansion of gun owner rights, etc) are mainly just bait to excite the base and are not actual priorities for the Mitch McConnell / Kevin McCarthy / Lindsey Graham / Ted Cruz wing of the party (which I believe currently represents the majority of elected Republicans at the national level). So the status quo hamstrings Democrats' policy goals far more than Republicans' policy goals.",
            "title_similarity": "0.8391113",
            "sentiment_compound": 0.978
        },
        {
            "id": "h0h15tj",
            "score": 1,
            "text": "1) they already could do that in 2017-19. They didnt. Because their politicians are still politicians, and the shit they want to do is wildly unpopular. They couldnt even get the 50 votes they needed to repeal the ACA - which they had been running on for the better part of a decade.\n\n2) So what. They do unpopular shit. Things go downhill for a bit. Then Dems get back in power because of the backlash to doing unpopular shit, and with only a 50 vote threshold, easily fix the problems.  \n\n\nThe thing is right now the government is ALREADY set up so that the GOP can do most of what they want with 50 votes.\n\n1) Deregulation - needs zero votes - the President and executive branch can do it unilaterally. But right now you need 60 votes to either overturn those rules, or write new legislation that expands regulation. So the GOP has a huge advantage in this area - one of their main reasons for existing\n\n2) Tax cuts and spending cuts - both fall within the purview of the Reconciliation rule, which allows the Senate to pass certain types of bills with only 50 votes. Meanwhile much of what Democrats want to do takes 60 votes. Expanding and securing voting rights. 60 votes. Adding states. 60 votes. Climate change programs. much of it would be 60 votes. Changing immigration law. 60 votes.\n\n3) The judiciary - since the GOP agenda is generally unpopular the best they can hope for is rolling back laws. Lucky for them a conservative judiciary will do just that. And lo and behold it only takes 50 votes to get a justice through. And again - it takes 60 votes to fix most things. In 2013 or so the Supreme Court struck down a chunk of the Voting Rights Act. Its totally fixable though - but it would take 60 votes. They are threatening to strike down the ACA, but the suit would be moot with literally a page of legislation - except that requires 60 votes.  \n\n\nIn other words, the GOP, thanks to the nature of their agenda can do most of what they want to do with 50 votes.  \n\n\nBasically , whats McConnell gonna do with no filibuster that he cant do now.  \n\n\nNow compare that to the list of things that Dems would do without the filibuster. The Dem list is much larger.  \n\n\nOn top of that, it would put both sides on the spot. No more - oh well we cant do this (unpopular among the general population, but popular among our base) thing because the other side will filibsuter. It would make both sides have to more fully own their agenda.  \n\n\nSo sure - Dems might pay now and then. But the upside would definitely be higher for Dems than the GOP.  \n\n\nTLDR: If getting rid of the filibuster was good for Mitch McConnell and Republicans, they would have done it in 2017-19. They didnt for a reason.",
            "title_similarity": "0.77773553",
            "sentiment_compound": 0.9926
        },
        {
            "id": "h0h1prc",
            "score": 1,
            "text": "If the dems don’t get rid of the filibuster, the Rs will as soon as they take power back. I’d bet my life savings on that",
            "title_similarity": "0.6392811",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h1v51",
            "score": 1,
            "text": ">One argument for getting rid of the filibuster is it will allow the passage of the new voting rights bill, which many Democrats believe will help ensure Republicans aren't allowed to steal elections through gerrymandering and local voting laws the discourage certain democrat leaning demographics from voting. My response to that is that it is simply absurd to believe that Democrats will hold onto both the House and the Senate forever. Republicans will win again at some point, and they will enact revenge.\n\nThe Democrats don't have to hold onto the House and Senate forever. They only need the House OR the Senate OR the Presidency. In order for one party to act in a truly partisan way, they need to control all three or have a veto-proof majority in Congress.",
            "title_similarity": "0.8908131",
            "sentiment_compound": 0.8917
        },
        {
            "id": "h0h23o9",
            "score": 1,
            "text": "While yes, this does make sense, if the democrats can’t pass their goals, they won’t get elected anyways, because they never followed through. in order to hold on to power the democrats will need to show that their way is the right way, and the only way to do that is through change",
            "title_similarity": "0.80569017",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0h30h0",
            "score": 1,
            "text": "You know how people just want to be authoritarians dictators by removing the filibuster and don’t actually believe morally the filibuster is bad is when they don’t support abolishing the filibuster when the opposition has power.",
            "title_similarity": "0.7316649",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0h31ui",
            "score": 1,
            "text": "Do you believe that Democrats will regret a removal of the filibuster *more* than they would regret allowing the current set of proposed Republican redistricting and voting-rights laws to go through? Because the two are mutually exclusive.",
            "title_similarity": "0.83415234",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0h42ts",
            "score": 1,
            "text": "Love how you’re acting like the Democrats wouldn’t do the same. Both parties do this shit",
            "title_similarity": "0.70084053",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0h46fu",
            "score": 1,
            "text": "Republicans pass less legislation than Democrats and it's usually just removing restrictions and taxes. Meanwhile Dems need to pass things like large infrastructure bills, healthcare reform, corporate tax reform etc. I think removing the filibuster would ultimately benefit the progressives over the conservatives. Additionally Republicans have proven time and time again that they will play hard ball and forget decorum whenever they can. So if they ever have the  ability to abolish the filibuster, they definitely will",
            "title_similarity": "0.83456004",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h0h47tp",
            "score": 1,
            "text": "It's not semantics to say that the type of democracy they chose was a republic.\nIt's not semantics to say that the US is a democracy.\nThey specifically considered a direct democracy, but rejected in favor of a constitutional republic, another type of democracy.\nThis is not semantics, nor is it trivial when someone says that the US is not a democracy. It most certainly is.",
            "title_similarity": "0.63671327",
            "sentiment_compound": 0.4119
        },
        {
            "id": "h0h49qd",
            "score": 1,
            "text": "If you think for one second that the Republicans aren’t already planning to eliminate the filibuster the moment they take power back, you are delusional",
            "title_similarity": "0.68217266",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h4mrc",
            "score": 1,
            "text": "the reason it needs to go is that it changes the onus of action. meaning that if you take, say, gun control for example, republicans can talk a massive game about repealing controls, new protections, strengthening the second amendment, etc, all the while *knowing* the dems would fight them on this. if they end up with nothing its the dems fault.   \n\n\nHowever, you suddenly actually have a vote infront of you, and the numbers behind you what do you *actually* want to do? not  talk of gun reform, but specific, lawmaking policies? now its not just 'owning the dems' but you are having arguments about if a 50 cal rifle is needed for hunting etc - it changes the pressure from being on the dems to stop it, to what the reps actually have, which causes all kinds of issues. the flip side of this is that there are Dems who are fine with guns but will vote against it because its not that important issue to them, and the reps will stop it anyway - I.E. Burnie Sanders.  \n\n\nA real world example I've seen some people bring up is Obamacare. the republicans talked for years about repeal and replace, but when they actually went to make the change, Paul Ryan's healthcare plan sucked, and the unity fell apart because its easier to agree in general terms that the dems suck, but not on what should be done.  \n\n\nWithout the filibuster, the excuse of the other side stopping policy isn't there, so you have to stand on the principles and effort you govern by. In my view, the filibuster creates a rhetoric-based political system, rather than supporting good governance",
            "title_similarity": "0.74634784",
            "sentiment_compound": -0.6888
        },
        {
            "id": "h0h4re1",
            "score": 1,
            "text": "I would point out that\n\n1. The filibuster is not an intentional tool made to prevent tyranny by a narrow majority, it's a procedural loophole that's been glorified in modern US politics, and\n\n2. There's been a consistent shift of power in the US from Congress to the presidency. Arguably one of the main factors for that shift is that Congress hasn't been able to do anything due to the severe partisan divide combined with having different majorities in the house and Senate. Getting Congress to be a little more functional in terms of getting things done would likely help correct that power imbalance, even if you don't agree with the goals of the current Congress",
            "title_similarity": "0.8090999",
            "sentiment_compound": 0.1002
        },
        {
            "id": "h0h4wt6",
            "score": 1,
            "text": "Reddit please give us a US filter?",
            "title_similarity": "0.27664444",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0h5h2k",
            "score": 1,
            "text": "In my view eliminating the filibuster just gives the power back to voters. For example, with no filibuster and enough votes Republicans would be free to defund Social Security, cut Obamacare, and cut any variety of social programs. Now would they survive the next election cycle if they destroyed all these popular programs? I don’t think so, judging by how much backlash Republicans got in their districts for trying to repeal Obamacare in 2017.\n\nThe complication for this scenario would be Republicans repealing the For The People Act (which I’m guessing would pass after the filibuster is eliminated) and enacting even more voting restrictions at the state level. It would be much harder, but not impossible, for an unhappy public to vote out a Republican majority that makes these unpopular changes.",
            "title_similarity": "0.8035943",
            "sentiment_compound": -0.5789
        },
        {
            "id": "h0h61rh",
            "score": 1,
            "text": "What's stopping the GOP from getting rid of the filibuster when they are in charge",
            "title_similarity": "0.6032448",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0h6qhn",
            "score": 1,
            "text": "They will regret because it's a fundemental part of any good government and why America has remained so stable for it's entire existence.\n\nChange should be slow, labored, opposed, reconsidered, reintroduced, opposed, reconsidered, until finally something changes.",
            "title_similarity": "0.74097383",
            "sentiment_compound": 0.4527
        },
        {
            "id": "h0h6vrn",
            "score": 1,
            "text": "I think the Democrats should abolish it. Here is why.\n\n1. Republicans will quickly abolish the filibuster if they predict it will further close the door on Democrats ever winning again. Trying to be fair means nothing to the Republicans, they'll take any advantage they can get regardless of good faith.\n\n2. We already know from Obama (and Biden) that playing nice with Republicans doesn't really gain you anything.\n\n3. With the filibuster in place, Democrats have no chance in securing major victories that will reflect well on the Biden administration and secure them a victory in the midterms and next presidential election. Democrats consistently lose when they don't get enough done, and Republicans will laugh them out of Congress if they can't get past their filibuster.\n\n4. Democrat voters see blood and many of them still want to see Republicans get shut out of power for good. In other words they're unlikely to see ending the filibuster as a major loss.\n \n5. The window is small to get anything done and Republicans will stall any meaningful efforts to change the rules. This may be their only chance to remove the toxic Republicans from their stranglehold.\n\nAnd in general:\n\n1. Filibuster is anti democratic.\n\n2. It doesn't really even work very well, with money so influential in politics now it's easy to buy senators off with campaign donations.\n\n3. The Republicans don't even really need it because a quarter of Senate democrats are conservatives and more or less agree with conservative policy proposals.",
            "title_similarity": "0.87755674",
            "sentiment_compound": 0.9838
        },
        {
            "id": "h0h6yc2",
            "score": 1,
            "text": "I think it's safe to say that the minority party is always a fan of the filibuster, but the majority party is not. It kills me how many people don't realize THEIR party won't be in control forever.",
            "title_similarity": "0.75704455",
            "sentiment_compound": 0.8355
        },
        {
            "id": "h0h7gr6",
            "score": 1,
            "text": "Do you think the republicans won't remove the fillibuster when it suits them? (Genuine question, maybe they wouldn't, but they do seem to be playing hardball in general).",
            "title_similarity": "0.6716149",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0h7mni",
            "score": 2,
            "text": "so you would rather block legislation on both sides than have legislation on both sides",
            "title_similarity": "0.5929204",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0h7vlj",
            "score": 3,
            "text": "Why we always act like other first world countries don't have majority rules votes? We can see how they operate.",
            "title_similarity": "0.4798974",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0h7vmc",
            "score": 1,
            "text": "Personally for me, I think both keeping the filibuster in its current form and abolishing it in its entirety lead to disastrous outcomes. The origin of the filibuster was not rooted in the Founding Fathers, but rather in the 1830s. The filibuster can be a useful tool to open up discussion and criticism for a bill, but flip it on its head and it’s a tool for federal paralysis. However, the filibuster was instrumental in abating civil rights legislation as this would directly harm a giant portion of the economy at the time. Despite the rather ugly history of the American filibuster, it is important to give the minority parties some leeway so there aren’t any legislative bombs that the majority party can pass in flurries. Some things that could be done, might be reducing the 60 threshold to 55. If over 20% of the opposing party filibustering cannot show up, it should drop and be 51. These two changes, allow for minority parties to filibuster legislation if they really are opposed and energized in the process. The filibuster is fine, but it shouldn’t be easy to do. If the overwhelming majority of your party can’t show up to Congress, then the legislation must have not been all that harmful/important in tweaking/preventing.",
            "title_similarity": "0.82878876",
            "sentiment_compound": 0.9788
        },
        {
            "id": "h0h8rph",
            "score": 1,
            "text": "Republicans will get rid of the filibuster I'd they ever have power again. Cant the dems just get rid of it for one session and then re instate it.\n\nBottom line. Right now Republicans are tr vying to rig every fire election. Acting now can stop them from getting power again in the first place. Republicans are already as bad as it gets. You cant appease fascism. If they get power again they will do whatever they want no matter what. We dont need to worry about keeping them happy.",
            "title_similarity": "0.807333",
            "sentiment_compound": -0.4735
        },
        {
            "id": "h0h9ljt",
            "score": 1,
            "text": "If the democrats remove the filibuster and pass legislation that even partly fixes our broken electoral system (gerrymandering, lobbying, voter suppression, etc.). Then the Republican Party of today will never win the house again. That’s not to say that no Republican Party will ever win the house again. But the Republican Party of McConnell won’t. They just simply don’t have the votes under a fair electoral system, especially with the voter base having more and more millennials and fewer and fewer Boomers. They’ll have to change at least to some extent as the Overton Window moves. I’d wager that a new Republican Party actually capable of winning a fair majority would still be bad, but not insurrection-levels of terrible like the current one is.",
            "title_similarity": "0.8727038",
            "sentiment_compound": 0.9672
        },
        {
            "id": "h0hasw6",
            "score": 1,
            "text": "You got a source demonstrating specific examples of where drop boxes created problems or?",
            "title_similarity": "0.30317307",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0haz14",
            "score": 1,
            "text": "If you deliver material change you will win elections. That’s a big reason why Georgia voted in blue senators. There’s not a lot to worry about unless Democrats shit the bad, which isn’t abnormal for them, and lose big in 2022. \n\nThe filibuster and the Senate are undemocratic institutions. The more we remove elements of them the better.",
            "title_similarity": "0.81972015",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h0hbrl3",
            "score": 1,
            "text": "The senate is also fundamentally undemocratic. Just like the filibuster.",
            "title_similarity": "0.63914096",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0hbuxi",
            "score": 1,
            "text": "After reading an old history book, I’ve revised my view. A filibuster is when senators speak continuously in order to prevent a bill from being voted on. It was that way in my lifetime. A senator has no limit on how long they are allowed to speak, which is why this is a tool that has been available. I don’t know how or why the 60 vote threshold became the norm, but I do know it gives senators an excuse not to govern. \n\nThat being said, the actual filibuster will not go away unless they literally change the rules for senate speakers. As for this other garbage, there’s no reason for it to exist at all. I saw it noted that the yeas for a January 6 commission won out with 54 votes. That technically passed by a simple majority vote.",
            "title_similarity": "0.78539705",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h0hc6c6",
            "score": 1,
            "text": "The History of the United States demonstrates that the Filibuster blocked mostly progressive actions and was useless to block mostly conservative laws.\n\n\nLincoln was able to abolish Slavery only because he litteraly removed enough senators from the CSA for the time of the war so he could circumvent the Filibuster.\n\nIn the 20th century the Senate blocked civil rights legislation for decades whilst in the meantime passing awful stuff like the Taft-Hartley act.\n\nUnless you have extraordinary circumstances like the early '30s or Lyndon Johnson the Filibuster is the best tool of the conservatives.",
            "title_similarity": "0.829742",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h0hcw6e",
            "score": 1,
            "text": "The filibuster doesn't exist in many other parliaments and they get by just fine. Your definition of a \"good thing\" is going to be someones definition of a \"bad thing\" and it seems that having a minority party being able to hold up legislation of the majority is very undemocratic. Right now the Democrats control the house, senate and presidency so they should be able to pass fairly significant legislation - if the Republicans are in the same position then they too should be able to pass significant legislation. Ultimately the politicians are answerable to the electorate and it sounds like instead of protecting an undemocratic political tool you should be looking to strengthen the protections around voter rights.",
            "title_similarity": "0.7712285",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h0hcwze",
            "score": 1,
            "text": "*Already*, Mitch and the Republicans could lift the filibuster if they wanted to with just their own majority. The fact that they didn't in 2016-2018 just means they didn't want to, but in the future if they ever have the majority again and a piece of legislation they'd really like to pass I don't see why they wouldn't just remove the filibuster.\n\nThis is true regardless if the Democrats ever do remove it. Removing it now or not removing it now would not change that future. The only result of not removing the filibuster is that Democrats don't pass legislation they otherwise might, and that's just a net negative for them.",
            "title_similarity": "0.8487985",
            "sentiment_compound": 0.3024
        },
        {
            "id": "h0hdaso",
            "score": 1,
            "text": "The filibuster as it's currently employed is a tool of creating governmental gridlock. The ultimate question is: are we better off being able to block legislation we don't like at the cost of not being able to pass our own agendas? My opinion is \"no\", for a variety of reasons:\n\n* Not being able to pass laws means that the voters can't evaluate politicians based on their accomplishments, which disrupts a crucial feedback loop: Politician A is elected on their promise to pass Law X, they win, they pass Law X, and voters reward or punish them based on the results. As an example: the GOP has spent years reaping the electoral benefits of claiming they will repeal the ACA without ever having to propose a viable alternative. The filibuster largely makes this an empty threat. Without the filibuster, they'd be forced to either 1) break their promise, 2) repeal the ACA and face the resulting backlash of millions of people losing their insurance, or 3) stop running on this promise.\n* Without the ability to pass laws, politicians have instead chosen to differentiate themselves by escalating their rhetoric. At this point, the GOP's platform is almost ***purely*** rhetoric: there is currently no real appetite for policy discussions, and so attention is wasted on issues like trans athletes. The democratic primaries demonstrated the opposite problem: candidates distinguished themselves by proposing increasingly bold and ambitious plans, **none** of which are possible while the filibuster exist.\n* The filibuster is significantly more strategically beneficial to the GOP than the Democrats for a variety of reasons: 1) progressives want to create big, sweeping plans that require passing legislation (which can be filibustered), while much of the conservative platform can be achieved by cutting taxes, slashing spending, and rolling back regulations, most of which can be achieved with reconciliation. 2) the equal apportionment of senators means that the GOP has a *massive* electoral advantage from the start, simply because most sparsely populated states are conservative. This makes it virtually impossible for the democrats to get the 60 seats necessary to be filibuster-proof and pass their agenda.\n* None of this would matter too much if the status quo was fine - it would make more sense to prioritize stability in that scenario. But there are many issues that HAVE to be dealt with before they spiral out of control: climate change, the student loan crisis, ballooning housing and healthcare costs, etc. The filibuster is a major part of why action can't be taken on these issues, and there will be a tremendous cost if we can't do anything about them.",
            "title_similarity": "0.7875172",
            "sentiment_compound": -0.5812
        },
        {
            "id": "h0hdsdo",
            "score": 1,
            "text": "The Republicans are going to abolish the filibuster anyway.  Remember when Mitch McConnell created the policy that a Supreme Court justice cannot be confirmed during a Presidential election year, and then he confirmed one a mere two weeks before the election in 2020?  \n\nThe filibuster needs to go, now, while the Democrats have the power to do something with it when it is gone.  The Republicans cannot be expected to honor whatever promises they are making today that the filibuster will remain intact once they return to power.",
            "title_similarity": "0.8231573",
            "sentiment_compound": 0.9393
        },
        {
            "id": "h0he0xv",
            "score": 1,
            "text": "I'm on board with eliminating the filibuster with the caveat that the Senate going forward can only pass a bill with a supermajority of 75%. The filibuster is just a temporary roadblock that a senate minority (Democrat or Republican) uses to railroad legislation off the senate floor.\n\nRequiring a supermajority would get rid of the need for the filibuster altogether. No need to prattle on like Strom Thurmond pissing yourself standing if you know you can't stop the legislation from getting passed, or you know that there's no chance it'll get the votes it needs to pass.",
            "title_similarity": "0.80861354",
            "sentiment_compound": -0.3076
        },
        {
            "id": "h0helw6",
            "score": 1,
            "text": "Because the Republicans as they are now, when they do regain control at some point, by hook or by crook, they won't do away with the filibuster to pass their draconian laws, I'm sure.",
            "title_similarity": "0.7304329",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0hf1vp",
            "score": 1,
            "text": "The main thing is that the Republicans don't actually want to vote on their desired policy. \n\nMitch McConnell is the GOP Senate leader for the simple reason that he will never force his caucus to vote. He will let popular legislation die on his desk. \n\nThe perfect example was Merrick Garland. Garland was VERY popular by both republicans and democrats. In fact, Republicans said specifically that Obama should nominate someone moderate like Garland to the SC. \n\nHad Garland's confirmation been held to a vote, a lot of republicans would have been put in an awkward position by voting against him. So to fix this, McConnell just blocked the vote. \n\nRepublicans don't have laws to pass. So they have never needed the filibuster.",
            "title_similarity": "0.85381246",
            "sentiment_compound": 0.7966
        },
        {
            "id": "h0hf8cx",
            "score": 1,
            "text": "Public opinion and the vote will keep the most contentious legislation from seeing the light of day. Get rid of the filibuster NOW!",
            "title_similarity": "0.7458348",
            "sentiment_compound": -0.4186
        },
        {
            "id": "h0hg5d0",
            "score": 1,
            "text": "Without the filibuster the Dems can ram through a lot of stuff that would help solidify their control over the government (DC/PR statehood, election reform, etc). So to them it’s worth the gamble, because Republicans don’t really advocate anything that can’t be undone, anyway.",
            "title_similarity": "0.7339905",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0hgl9v",
            "score": 1,
            "text": "Here's the issue with your argument though.  You acknowledge they need to remove the filibuster to pass voting reform (and Essen stop Republicans from fixing future elections starting with 2022), but that's just it, without the filibuster they WILL lose and will possibly never win majority again.  \n\nWill it blow up in their face someday?  Possibly.  Will it be worse if they don't pass voting reform?  Almost unquestionably.",
            "title_similarity": "0.8279007",
            "sentiment_compound": -0.9384
        },
        {
            "id": "h0hhadr",
            "score": 1,
            "text": "if the filibuster was reversed so that 40 folks must vote to continue debate [I would prefer 45] it would eliminate the most egregious abuses by forcing Senators to remain in the Senate to vote for cloture, over and over if necessary. It would also force senators to be on the record as voting for obstructing bills that are popular with their constituents.\n\nhttps://www.theatlantic.com/ideas/archive/2020/09/fix-filibuster/615961/",
            "title_similarity": "0.77839994",
            "sentiment_compound": -0.2682
        },
        {
            "id": "h0hhq06",
            "score": 1,
            "text": "The party elected to power should have the ability to enact the agenda they ran on and then be held accountable at the next election. The requirement for a super majority cripples legislation.",
            "title_similarity": "0.621312",
            "sentiment_compound": 0.836
        },
        {
            "id": "h0hi4em",
            "score": 1,
            "text": "but if they also abolish the electoral colllege and just vote by popular vote, republicans literally cannot win until they modify their values to apply to more people.",
            "title_similarity": "0.71667016",
            "sentiment_compound": 0.484
        },
        {
            "id": "h0hia67",
            "score": 1,
            "text": "The problem is you assume that Republicans won't get rid of the filibuster as soon as they're in power next. If they have the house, the presidency, and more than 50 but less than 60 in the senate there's 0 chance the filibuster survives. The Democrats might as well get rid of it now to get ahead of it and maybe govern a little bit.",
            "title_similarity": "0.8361164",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0hii0k",
            "score": 1,
            "text": "This whole line of thinking depends on the idea that if you get rid of the filibuster, a majority can do whatever it wants. And this is fundamentally not true. After all, if it were true, then wouldn't the filibuster already be reformed? It only takes 50 votes, and the Dems have 50 votes, so why isn't it gone already? Because public opinion is split on if filibuster reform is a good idea, and so the Dem majority cannot wield all 50 votes on this issue without electoral consequences. If there was not filibuster, then this would still happen.\n\nPut another way: bring it on, Reps. Of course the Dems will lose the House or Senate sometime. But if we tie political outcomes to public opinion more effectively, then the Republicans won't be able to wield minority power as a cudgel against the majority. If the Reps get a 52-48 majority, public opinion will still serve the same purpose it is serving now to limit the Dems.\n\nThis feels weak, but it's actually quite strong. The Reps don't have total unity in their party right now. 6 Reps joined the Dems on the Jan 6 commission vote, but in the current system, a -19 margin is enough to win. The Reps have the power they have because Americans have set up a system full of giving extra power to the minority for no reason.\n\nTrump lost the popular vote. He got 5 fewer points than Biden did four years later and yet he still got in the White House. The Dems have had to beat the Reps by 5 points to get the same number of seats in the House. The minority just won a vote by coming 19 votes short in the Senate.\n\nThe problem here isn't that we make majorities too strong. The problem is that we make them too weak. If the Dems were able to pass only the popular parts of Biden's agenda--stuff that has 60% voter support or more--they would unleash a flurry of legislation putting FDR to shame. The Reps have publicly declared how much they wanted to repeal Obamacare only to be defeated by public opinion when their own voters won't let them do it. Now pile HR1, infrastructure, stimulus, and minimum wage, and more on top of that. The problem is that the minority gets like 1 or 2 wins and that's still enough to beat the majority because the majority can't even get that much.\n\nNot only should we abolish or nerf the filibuster big time, we should re-examine a whole host of anti-majoritarian structures in our system.",
            "title_similarity": "0.72845364",
            "sentiment_compound": 0.9754
        },
        {
            "id": "h0hin02",
            "score": 1,
            "text": "“Don’t fight Nazis or they will fight you twice as hard once they get in power.”",
            "title_similarity": "0.6831459",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0hitso",
            "score": 1,
            "text": "... why don't dems use it then?\n\n&#x200B;\n\nSenate stopped Obama from appointing a supreme court judge for 8 months.\n\n&#x200B;\n\nRepublicans forced one through in ***days***.",
            "title_similarity": "0.686928",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0hiua9",
            "score": 1,
            "text": "It should be gone, regardless of whether it will benefit or hurt them later down the line. It is against everything democratic and in my opinion it is the negation of what justice in legislation looks like.",
            "title_similarity": "0.7384223",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0hjcwa",
            "score": 1,
            "text": "Get rid of the filibuster and admit PR and DC (if they want) as states.",
            "title_similarity": "0.50485075",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0hjgfj",
            "score": 1,
            "text": "I don't understand why more people don't get this. It's like no one can remember more than five minutes ago.  We just got done with four years of Trump, and the people who hated him most are all like 'the problem is that it's too hard to pass laws'.  The GOP had as much power four years ago as the Dems do now; just image what they could have achieved without the filibuster.  Anyone supporting this is simply short-sighted or believes they can use the power to rule out a power shift ever happening again.",
            "title_similarity": "0.7559873",
            "sentiment_compound": -0.5478
        },
        {
            "id": "h0hjti9",
            "score": 1,
            "text": "The key thing you miss is that the Republicans would not hesitate to get rid of it if they thought it would benefit them (see Republicans nuking the filibuster for the Supreme Court as an example).",
            "title_similarity": "0.7690789",
            "sentiment_compound": 0.7791
        },
        {
            "id": "h0hjzty",
            "score": 1,
            "text": "The thing is, the Democrats keeping the filibuster around does absolutely nothing to stop the Republicans from getting rid of it as soon as they have a majority. The moment they think it's in their best interest to do so, I have no doubt that they'll do it and then find some BS hypocritical reason to say it's the Democrats fault.\n\nAs far as I can tell, the main reason they've kept the filibuster around in the past is because, as the party of \"let the rich and powerful keep screwing over everyone else\", they could accomplish most of their agenda without passing significant legislation. An ineffectual Congress benefits them, because the system is already stacked in their favor.",
            "title_similarity": "0.84187275",
            "sentiment_compound": 0.9536
        },
        {
            "id": "h0hk71k",
            "score": 1,
            "text": "You’re an idiot if you think republicans won’t get rid of it the first time they get a chance anyway.",
            "title_similarity": "0.6716053",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0hkglr",
            "score": 1,
            "text": "The American people will regret if they don’t. No one has to change your view. YOU have to pull your head out of your ass. Conservatives are always putting their stupidity on other people. It’s exhausting. Your failure to understand reality is a you problem.",
            "title_similarity": "0.77089083",
            "sentiment_compound": -0.9578
        },
        {
            "id": "h0hkq48",
            "score": 1,
            "text": "The sooner you realize that we have a one party system in the US, with Democrats and Republicans serving the same corporate interests and only splitting on wedge issues like abortion and gay marriage to create a faux two-party system, the sooner everything makes sense.",
            "title_similarity": "0.7027159",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h0hld87",
            "score": 1,
            "text": "The existing filibuster already doesn't apply to the republicans so it wouldn't make a difference. For tax breaks and installing judges they only need simple majority. That combined with 6-3 supreme court justices they already can do what they want. It only hurts democrats or at least the ones that want to do something (which is the minority). Democrats are center right neo liberal stays quo cucks. That's why democrats get elected have all three houses don't do shit and at the next election republicans win because voters are sick of shit not changing.",
            "title_similarity": "0.8441993",
            "sentiment_compound": 0.2321
        },
        {
            "id": "h0hlk6j",
            "score": 1,
            "text": "Sounds to me like Republicans will regret it if Democrats get rid of the filibuster.",
            "title_similarity": "0.871706",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0hlkup",
            "score": 1,
            "text": "That's just not relevant. It's how a democracy is supposed to work.",
            "title_similarity": "0.545133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hlt8b",
            "score": 1,
            "text": "Why didn't the republicans allow the filibuster to hinder them when they wanted to pass legislation from 2017-19?  The AHCA was going to be passed through reconciliation.  The tax bill passed through reconciliation. The filibuster already doesn't exist for republicans.    \n\n\nWhat it is now isn't a necessary barrier to uphold democracy.  Its a necessary barrier to keep the donors of the democratic party happy while giving an excuse to democrat voters.",
            "title_similarity": "0.8106611",
            "sentiment_compound": 0.8076
        },
        {
            "id": "h0hlyl3",
            "score": 1,
            "text": "Republicans have already selectively removed the filibuster, for example, to confirm Supreme Court justices. They are not a party who has played fair now or recently, and they ask for treatment they would never reciprocate. Fuck em.",
            "title_similarity": "0.7831905",
            "sentiment_compound": 0.8356
        },
        {
            "id": "h0hmuzh",
            "score": 1,
            "text": "The Republicans will get rid of the filibuster as soon as they need to.  Democrats will be playing catch-up.",
            "title_similarity": "0.7686331",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0hn440",
            "score": 1,
            "text": "Republicans already fight with napalm. May as well fight back. Ask yourself how 40% of the population gets to wield majority type powers and your argument here falls apart. End the filibuster, pass voting reforms and leave that god forsaken party with 0 values (other than holding onto power and making the rich richer) behind.",
            "title_similarity": "0.7150228",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h0hnc9o",
            "score": 1,
            "text": "Two thoughts:\n\n1) consider that the filibuster is a uniquely american phenomenon. While most parliamentary rules will have certain loopholes to be exploited, nowhere else is the ability for the minority to grind things to a halt considered a central part of the process. From my (Canadian) point of view its insane that anyone allows it. \n\n2) I have a suspicion that many republican lawmakers (and perhaps democrats) don't want to end the filibuster because they don't want to pass their agenda. Its much easier to craft loaded, politically motivated legislation that will never get passed, then point the finger at your opponents for holding up democracy than it is to gain power, be held accountable for advancing your platform and risk the legislation you pass being actually bad.",
            "title_similarity": "0.7928485",
            "sentiment_compound": -0.1887
        },
        {
            "id": "h0ho091",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0hpiee",
            "score": 1,
            "text": "Who's Phil?",
            "title_similarity": "0.03848836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hq0m6",
            "score": 1,
            "text": "If democrats keep the filibuster, and don’t pass HR1, republicans will (illegally) win big in both 2022 and 2024, then the republicans will get rid of the filibuster. Game, set, match.",
            "title_similarity": "0.81598043",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0hq6iv",
            "score": 1,
            "text": "Perhaps the only way to save America is to give people who vote against their own self-interest what they think they want--abhorrent Republican laws. Have you ever thought about that? It's scary to think we as a country can be that far gone but we are. Mitch McConnell is a monster who is married to a Chinese billionaire's daughter. He shipped American manufacturing jobs to China then married into one of the Chinese families that was due to make billions off of it. And yet working and middle class Republican voters don't care--probably because they have been programmed by Right Wing Media. Either way, don't you think a big change is necessary?\n\nI'm sure you've heard/read about America's democracy being on the brink of failing due to Republican tactics. Ending the filibuster is necessary to pass a voter rights law that can stop that from happening. That alone is worth whatever the price may be when the pendulum swings back--even if it leads to the GOP ending gay marriage or abortion.",
            "title_similarity": "0.7199826",
            "sentiment_compound": -0.7013
        },
        {
            "id": "h0hqrww",
            "score": 1,
            "text": "But Republicans don’t actually want to legislate. They proved that when they had control of the House, Senate, and Presidency. McConnell left the filibuster intact because he was afraid of Dems gaining control and passing bills. Repubs have far more to gain in demonizing Dems and their woke ideology than passing laws to firm up gun control, eliminating same-sex marriage, or banning abortion. What would they even run on if all those conservative issues were non-issues?  Division and outrage is much more beneficial than actual action",
            "title_similarity": "0.82458746",
            "sentiment_compound": 0.8445
        },
        {
            "id": "h0hr3qz",
            "score": 1,
            "text": "Doing nothing isn’t going to change anything. Someday they will lose the power again. That’s the point.  \n\nThe right already changed this country forever the last 4 years. Gotta do something.",
            "title_similarity": "0.6800786",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0hr9xf",
            "score": 1,
            "text": "Republicans and McConnell don’t want the filibuster to go away because then they’re voting record will be on record. Now they just filibuster and say the democrats are holding up congress and that has worked for the last 20 years. During that time they’ve made it a priority to stock judges, lower taxes, and cut social programs.\n\nAll that talk about repealing the affordable care act, but that’s all it was. If the filibuster wasn’t there republicans would have had to vote against it, then people would have realized they fucked up when they lost their insurance. Most Americans will believe the talking points because they either don’t have time to get into the details, or don’t care. They do however react when it messes up their life. As long as Republicans quietly work they don’t upset their base.\n\nEdit: to add to this, McConnell and Republicans only put things to vote they can win. He also needs the filibuster in times when he’s just playing games like the time he filibustered his own bill [source](https://www.pri.org/stories/2012-12-07/mitch-mcconnell-filibusters-himself-after-dems-call-bluff)",
            "title_similarity": "0.844548",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0hrqa9",
            "score": 1,
            "text": "First thing Republicans do when they have power and Democrats block legislation on procedure is.......... wait for it............ Nuke the filibuster.",
            "title_similarity": "0.7369495",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0hsb10",
            "score": 1,
            "text": "People have been saying this forever, that the democrats will regret it if they do \"x\".  Then the republicans will just go and do whenever it is in their best interests.  Perfect example is the supreme court.  The republicans saw an opportunity to put radical judges on the court and got rid of the filibuster for the supreme court.  Now we have three young judges that are pro-business, anti-abortion, pro-gun, pro-religious rights being more important than human rights.  Don't fool yourself into thinking that the republicans won't get rid of the filibuster next time they're in power if it suits them.  The only reason they haven't is because they haven't needed to yet.",
            "title_similarity": "0.8238424",
            "sentiment_compound": 0.9666
        },
        {
            "id": "h0hsp4n",
            "score": 1,
            "text": "If the Republicans take back the senate they could remove the filibuster with a simple 51-49 majority so what's stopping them from doing that? And what's stopping the democrats from re-imposing the filibuster before midterm elections in case the elections don't go their way?",
            "title_similarity": "0.8105649",
            "sentiment_compound": -0.4288
        },
        {
            "id": "h0ht7oo",
            "score": 1,
            "text": "I hate American politics so much, but from my time in this gilded shit of a country, I have seen the Democrats use the filibuster more than republicans.\n\nSome of the famous democrat politicians are only famous because they used the filibuster. The opposite is not true for republicans. Hardly any use it, and none have become famous or propelled their political careers through its use.\n\nTo me, from my foreign, hateful, perspective... the Democrats realized how effective and powerful the filibuster is when utilized correctly, and are trying to prevent anyone from doing what they already did.",
            "title_similarity": "0.8192951",
            "sentiment_compound": -0.7613
        },
        {
            "id": "h0hth6u",
            "score": 1,
            "text": "What’s to keep the GOP from getting rid of the filibuster next time they are in power?  Wouldn’t it better to get rid of it now and get that voting rights bill passed so maybe they don’t regain that power?  At the very least it needs to be reformed.",
            "title_similarity": "0.7713038",
            "sentiment_compound": 0.504
        },
        {
            "id": "h0htj8r",
            "score": 1,
            "text": "You either believe in democracy or you don’t at this point. I can’t even. You speak of revenge and watch outs... it’s sad. Your view is small.",
            "title_similarity": "0.6575687",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0htk39",
            "score": 1,
            "text": "They’re going to get rid of it when that happens anyway lol. They’re a hostile fascist party, they don’t give a shit their entire purpose is destruction. Might as well end it now and at least try and save democracy",
            "title_similarity": "0.73229647",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0htwmc",
            "score": 1,
            "text": "Either way, if they keep it or get rid of it, it’s existence or lack there of will be used shamelessly and hypocritically by Mitch McConnell.",
            "title_similarity": "0.7154302",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0hu1sy",
            "score": 1,
            "text": "Maybe but they will definitely regret it if they don't.",
            "title_similarity": "0.54727906",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h0huasy",
            "score": 1,
            "text": "Mitch will die soon he's like 80 years old so I'm not worried about him",
            "title_similarity": "0.5581702",
            "sentiment_compound": -0.064
        },
        {
            "id": "h0hucqj",
            "score": 1,
            "text": "The big problem with the argument that the Dems will regret it if they get rid of the filibuster is that the Republicans have already shown their willingness to legislate it away in any case where the Dems might use it. What this means is that the Dems would be preserving the filibuster for optics only, and when the Republicans do eventually take back the senate at some point in the future, they will simply eliminate the filibuster or legislate an exemption to the filibuster as needed, leaving the Dems with the worst of both worlds. \n\nTl;Dr: The republicans have already undermined the filibuster, and it is now the Dems responsibility to respond in kind or else find themselves in a kafkatrap where only republicans will ever pass legislation.",
            "title_similarity": "0.8615436",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h0huslx",
            "score": 1,
            "text": "They could change it back to where you ha e to be there for x period of time taking up airtime for upto 24 hours.. they chaged it somewhat recently to where they dint even need to show up ad have an intern announce they are filibustering.",
            "title_similarity": "0.5050386",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0hv36m",
            "score": 1,
            "text": "Demographics are changing very rapidly. Why do you think the Republicans are trying to do a coup if they think they can get voted into office legitimately? They aren't getting into power again. And they sure as shit aren't getting the House or Presidency after Trump and the insurection for quite a while if at all. That party will be redundant once all the old white folks die off. No money, no ground support and no votes. Just look at any Republican rally or Trump rally. It's almost all white and almost all 50+. How long do you think thwy can keep that going? You think Gertrude and Eustice are gonna live forever? You think their granddaughter with the black boyfriend they won't invite to dinner is gonna somehow follow in their footsteps and replace those votes and donations? And vote red? With people leaving the churches in droves? Go to a church and tell me how many young people there that aren't forced to be there by their parents. Their base is dying and dwindling away and leaving and breaking the laws of traditions by the thousands. You can't stop nature taking it's course. It's their fault for not wanting to evolve. I mean they don't believe in evolution anyways so I guess their stance makes sense, either way, they are finished already if they don't do some rapid position shifts and reinvent themselves. But instead they aren't getting off the train to authoritarianism they are speeding up and THEY WILL CRASH. So instead I would ask you, that if they know they are no longer viable as a party, then why don't you? If someone tells the truth then believe them. January 6th is all you need to know that those geezers know they are fucked.",
            "title_similarity": "0.76272756",
            "sentiment_compound": -0.9265
        },
        {
            "id": "h0hv91i",
            "score": 1,
            "text": "What you are saying is once the filibuster is gone, the party in power will legislate. Explain to me the problem with that? Of course one party will not be happy. That's the bad part of losing.\n\nLet the people see how each party *actually* runs the country.",
            "title_similarity": "0.7340021",
            "sentiment_compound": -0.5716
        },
        {
            "id": "h0hvb3z",
            "score": 1,
            "text": "End the filibuster and start helping people and the Republicans will never hold power again strictly because people will finally see how easy it is for the Federal Government to help people who need it.",
            "title_similarity": "0.7107128",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0hvf4p",
            "score": 1,
            "text": "who cares. this isnt about what team gets to win next time. its a stupid rule and this my team vs your team shit needs to end.",
            "title_similarity": "0.694531",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0hvfex",
            "score": 1,
            "text": "Yup!\nBunch of myopic imbeciles.\nIf the tables were flipped and Republicans controlled, they would probably like to have an option to obstruct...\nMob rule isn’t democracy.",
            "title_similarity": "0.7002712",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h0hvnp4",
            "score": 1,
            "text": "Mitch McConnells senate doesn't need reasons like revenge to do his bullshit and never has. Worry about revenge is pointless because it isn't like he's going to be lenient if they leave things as they are. He will always try for maximum damage at any chance he gets. \n\nThe whole process is undemocratic anyway. Even as a tool to stop bullshit laws I hate I can't support its use. If they could find a way to make it serve its actually intended use (making sure they have a chance to talk about issues before a vote) I'd support that. But it's current use as a bludgeon to beat back democratically supported legislation isn't right- regardless of how you or I feel about the law being passed",
            "title_similarity": "0.8387479",
            "sentiment_compound": -0.7496
        },
        {
            "id": "h0hw10q",
            "score": 1,
            "text": "The only thing I gotta say is, if you want to fix the US government’s problems, you gotta fix all of em in one go. IF you are removing the filibuster, then you also have to remove gerrymandering the voting restriction loopholes that favor certain parties. Otherwise, you aren’t fixing anything, just changing the problem.",
            "title_similarity": "0.7348373",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0hw48f",
            "score": 1,
            "text": "> To preface, the filibuster in its current form is awful. So, I'm not saying that change isn't needed. What I do believe, is that if Democrats do get rid of the filibuster they will regret it.\n>\n>Democrats will not hold onto the senate forever. The Republicans will be back in charge of both chambers at some point in the future. And if the filibuster is gone when they, AND Mitch McConnel is still senate majority leader....watch out. He's already proven he's more than willing to fight fire with napalm. And, if that filibuster is gone when that time comes, there is no doubt in my mind that Republicans will advance legislation that Democrats and the majority of voters find abhorrent, but there will be nothing they can do.\n\nReally?  Nothing?  Are you assuming they also have the House and the presidency?  Because that’s what would be required for the removal of the filibuster in the Senate to matter.",
            "title_similarity": "0.9584205",
            "sentiment_compound": -0.7773
        },
        {
            "id": "h0hwcvl",
            "score": 1,
            "text": "but then civil war two though right?",
            "title_similarity": "0.44178337",
            "sentiment_compound": -0.7469
        },
        {
            "id": "h0hwgsu",
            "score": 1,
            "text": "Republicans know this. It's why they refuse to vote for any legislation, even ones that see significant support from their base. They know that the Dems are being pressured by their base to nuke the filibuster, and they also know that Dems will take advantage of no filibuster significantly less than they will. Republicans love putting Democrats in this position.\n\nRepublicans win either way. If Dems don't nuke the filibuster, Dems look ineffective because nothing can pass except the yearly debt reconciliation bill, and Republicans aren't punished by their voters because they are uninformed and think it's Biden's fault nothing is happening. Then they potentially take back the Senate. Alternatively, Dems nuke the filibuster, barely get to use it because their majority is so narrow, then Republicans wait until they inevitably take back the Senate and Republicans go fucking *crazy* passing everything they want. And they get to look innocent like \"Hey, I mean, Dems started it. They wanted this, not us. Not our fault we can pass every dog shit unpopular bill we want, they got rid of the filibuster\".\n\nThe only possible way getting rid of the filibuster makes sense is if Dems can grow their majority in 2022, and make it so Republicans never get a majority again. That's impossible. Dems are poking a bear by going for the nuclear option. It sucks ass, but it's the reality of the Republican Party. They can do anything they want, and they still have millions of people begging and pleading to vote for them. That's the real problem. Conservatives will never, ever betray their politicians. Even if they are actively working against policies that see bipartisan support.\n\nEverybody here is saying the filibuster is undemocratic, well okay then. I hope all of you advocating for it in this thread are just as happy when Republicans inevitably regain a majority in the Senate. I hope you are all pro-democracy then too, when Republicans will pass every horrible bill unimpeded. Way more than Democrats will even *dream* of doing.",
            "title_similarity": "0.8279638",
            "sentiment_compound": 0.9803
        },
        {
            "id": "h0hwr5y",
            "score": 1,
            "text": "The house of representatives had a filibuster and it was removed in 1842. Democracy did not crumble. Will there be blowback from getting rid of the filibuster? Definitely. Will that be insurmountable? No. Not at all. Plus, if it comes to it, the GOP would happily do the same, or worse - as they have done, when it comes to it. The dems should use what power they have now to do what good they can while they can.",
            "title_similarity": "0.7731643",
            "sentiment_compound": 0.755
        },
        {
            "id": "h0hwrgw",
            "score": 1,
            "text": "Get rid of the filibuster, add 4 seats to the supreme court and pass a law requiring 2/3 majority to change supreme court terms and # of justices in the future. Because this country’s future is dependant on the republicans NOT being able to suppress the vote in the states in which they currently control the legislature. If you think for one second the republicans have any interest in upholding the law, allowing equal rights to all, voting rights or anything else that makes for a free and just society, you are delusional. They have completed the process of becoming a minority racist and criminal party intent on dragging this country back to the 50’s",
            "title_similarity": "0.80667925",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h0hwrma",
            "score": 1,
            "text": "I can’t change your view because I agree with you.  I don’t understand why there isn’t more talk of changing the filibuster as you suggest, rather than abolishing it completely.   Might even get manchin and sinema on board",
            "title_similarity": "0.6885227",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0hwtx4",
            "score": 1,
            "text": "It's true that both parties use the filibuster. However, when one party wants the government to *do things*, while the other party wants the government to *not do things*, the filibuster's effect is asymmetrical. The filibuster is simply more effective for making things not get done, and not change (largely the Republican position) than it is for making things get done, and making change (largely the Democratic position.)",
            "title_similarity": "0.69310236",
            "sentiment_compound": 0.923
        },
        {
            "id": "h0hwzj7",
            "score": 1,
            "text": "Aren't the rules decided each session???",
            "title_similarity": "0.2890861",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hx50e",
            "score": 1,
            "text": "Since the Republicans are so untrustworthy don't you think they will get rid of it given the chance?",
            "title_similarity": "0.7000931",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0hx7ax",
            "score": 1,
            "text": "The Republican’s have historically not played “fair.” Some Democrat’s want to fight Fire with Fire. The threat that Republicans will use more fire than before doesn’t change what they have already been doing. [+]",
            "title_similarity": "0.70755154",
            "sentiment_compound": -0.9221
        },
        {
            "id": "h0hyd8w",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0hyhgz",
            "score": 1,
            "text": "My thought is if Dems get rid of the filibuster then yes the danger is any party with 50% + VP has full control.\nSo wont that then incentivize both parties to allow a 3rd party to then reduce that 50% control?\n\nIf were perpetually on a knife edge how do we dull the knife?",
            "title_similarity": "0.6869536",
            "sentiment_compound": 0.7149
        },
        {
            "id": "h0hyjy7",
            "score": 1,
            "text": "My biggest problem with this take is that Democrats were able to stop the repeal of Obamacare without using the filibuster.\n\nYou cant say the filibuster has a use anymore when Democrats didnt even need it to stop the republican repeal attempts, and even if they wanted to, Democrats could'nt have EVEN USED the filibuster to stop \"the most egregious legislative goals of republicans\"\n\nThe democrats were powerless to stop the vote McConnell had on Obamacare repeal, as the vote was had, although if failed 49-51, democrats couldnt block the vote anyways. The Filibuster was powerless to stop McConnell from packing the courts, powerless to stop him from blocking Obama's judges or cabinet appointments.\n\nTo people who say getting rid of the filibuster is dangerous, the solution is with Al Fraken's suggestion that would protect the minority and that is the flipped filibuster, where you need 40+1 senators to start a debate and 60 to stop it. \n\nThis would protect the minority from being shut out of being allowed to vote on their bills. Its incredibly more democratic and a much better way to govern.\n\nThink of it this way, if the flipped filibuster rule was in place, democrats and republicans would be FORCED to vote on ALL BILLS, which has a incredibly high political value and would protect a minority of senators from being thwarted should Republicans take back control of the senate. \n\nIt would also take power away from the majority leader to stonewall appointments, as it would only take 40+1 senators to 'spring' a bill onto the floor or a nomination onto the floor. No more committee control. You would have bi-partisan debates because you could have 20 on each side insisting on a vote and getting it.\n\nYes, republicans could go back to minority rule by putting all power in the majority leaders hands, but that would clearly become an incredibly toxic power grabbing move as the solution to America's democracy problem is more power sharing not less.\n\nJust because evil people like McConnell exist doesnt mean that we should should be even more evil. The solution to the danger of getting rid of the filibuster is empowering people whose votes determine who serves in the senate. My biggest concern is that democrats have never been capable of using the power the voters give them to retain and protect democracy in an effective way, even now they fail.",
            "title_similarity": "0.80706626",
            "sentiment_compound": -0.9445
        },
        {
            "id": "h0hytzb",
            "score": 1,
            "text": "The use of the filibuster is a symptom of the issue. Removing it won’t remove the cause.",
            "title_similarity": "0.5639689",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hz2jc",
            "score": 1,
            "text": "This is some billionaire psy-op, reverse psychology nonsense. Don't fall for it.",
            "title_similarity": "0.5377846",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0hz5qy",
            "score": 1,
            "text": "here's the thing. the SECOND republicans are stymied by the filibuster they'll absolutely get rid of it. So better to lose it but get something like protection for voting rights for it than to lose it and get nothing for it",
            "title_similarity": "0.81110364",
            "sentiment_compound": 0.0229
        },
        {
            "id": "h0hzk4d",
            "score": 1,
            "text": "Doesn’t matter if the filibuster helps the Dems or Republicans. It’s undemocratic and arguably unconstitutional. Getting rid of the filibuster is the right thing to do.",
            "title_similarity": "0.6985743",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0hzxk7",
            "score": 1,
            "text": "It's like people here haven't ever heard of the concept of Tyranny of the Majority. The Filibuster, while frustrating to see, serves it's purpose.  Simple majority is for the House not the Senate.",
            "title_similarity": "0.7285796",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0i0zpn",
            "score": 1,
            "text": "Republicans haven’t won a popular vote in about half a century, and they always manage to do something extraordinary shitty when they control any two branches of government.\n\nI don’t see a problem here, destroying the filibuster will only lead to more progressive laws being passed.",
            "title_similarity": "0.7431023",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0i16lc",
            "score": 1,
            "text": "The fillibuster only matters when both sides have good faith to getting things done.  \n\nMcConnell has said flat out he is “100% committed to stopping the Biden agenda”.  He said the same shit about Obama and as soon as he got control, everything ground to a halt and he flowed in saying he is a “grim reaper” of legislation.  \n\nThen add on the fillibuster was only introduced in the early/mid 1800’s and used almost exclusively to block civil rights progress and you see what happens.  \n\nThe fun part about it, the GOP is more scared of it going away.  Because if Dem (or Liberal, depending on how much you follow people’s partisan horseshit) policies prove popular, it’s gonna be really hard for the GOP to take those away without significant losses at the polls (and that’s saying Dems aren’t re-elected to keep things going).  \n\nCurrently, the fillibuster is just a tactic for us to put people in $160k a year jobs with no intention of finding “bipartisanship”.  We’re paying them a kings ransom to do absolutely shit.",
            "title_similarity": "0.7734698",
            "sentiment_compound": -0.0898
        },
        {
            "id": "h0i1pyc",
            "score": 1,
            "text": "Republicans already removed the filibuster for tax cuts and judicial appointments, which happen to be the only things they care about.",
            "title_similarity": "0.75931495",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0i2em6",
            "score": 1,
            "text": "There is no right answer. Republicans will use it for bad. But honestly I view it as a grenade in the pond. It’s something that will cause radical problems, but I think we need to make things worse",
            "title_similarity": "0.7040738",
            "sentiment_compound": -0.7615
        },
        {
            "id": "h0i2q9p",
            "score": 1,
            "text": "If the Reps retake the Senate, what keeps them from ending the filibuster whenever it suits them?\n\nMay as well use the majority while you can.",
            "title_similarity": "0.7375394",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0i2rx6",
            "score": 1,
            "text": "You speak of Right-wing “revenge” if the filibuster were eliminated\n\nThey will use every ounce of power they can gain to target Dems and anything valued by Dems. This will happen if they gain power, whether the filibuster is eliminated or not.\n\nEliminating their voting suppression laws and getting priorities done to increase and maintain Dem turnout is the only way to keep the Right out of power and preempt their inevitable assault on every gain made in the last 100 years.\n\nThe reality is simple. They hate Democrats. Enough to want to kill, directly or indirectly. Nothing can anger them more to want “vengeance”, our mere existence is sufficient.\n\nBipartisanship died on November 9th, 2016. It was then revived, only to be burned alive on January 6th, 2021.\n\nTherefore, the Dems have nothing to lose, and literally everything to gain, by eliminating the filibuster.",
            "title_similarity": "0.8013881",
            "sentiment_compound": 0.8669
        },
        {
            "id": "h0i2ttq",
            "score": 1,
            "text": "The GOP is going to sink further into restricting who can vote and support for wantabee dictators. \n\nThat seems to be what they want to do with their power. They know that if the people vote, they lose support.",
            "title_similarity": "0.7559953",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0i3bcc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0i3pg9",
            "score": 1,
            "text": "Maybe damned if they do, definitely damned if they don't.",
            "title_similarity": "0.36873817",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0i4awa",
            "score": 1,
            "text": "Here's the thing:\n\nRepublicans already proved under McConnell that only Democrats follow the rules.\n\nIn the horrible likelihood Republicans seize the Senate again, the instant McConnell needs to shitcan the filibuster to pass some odious piece of legislation, he will do so.\n\nEverything he and the Republicans have done over the past forty years has shown this to be a fact.\n\nWhile they have this brief moment of power, the Democrats should do all they can to make the next fascist Republican power grab harder to enact.",
            "title_similarity": "0.8278629",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h0i58wf",
            "score": 1,
            "text": "Purely from a Democrats vs Republicans point of view(I don't agree with it but for the point of argument) I think Republicans win when the government doesn't work. Their strategy is to say look at all this waste we need to reduce our government because it can't fix anything. By handicapping the ability to make improvements through legislation the republicans win. If they prevent Demacrats from improving things it gives them more ammunition to say look government can't do anything. So if we get rid of the filibuster then improvements can be made and possibly improve the life of Americans which gives more reasons for people to vote Democratic.",
            "title_similarity": "0.84124684",
            "sentiment_compound": 0.9626
        },
        {
            "id": "h0i5xw3",
            "score": 1,
            "text": "Could they get rid of the filibuster now and just bring it back before the next congessional elections?",
            "title_similarity": "0.59440124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i5yem",
            "score": 1,
            "text": "If there was ever a good reason to have the filibuster, it was for Supreme Court confirmations. Four years ago, Senate Republicans killed the filibuster for that. It was more important to them that the Court be heavily conservative than that they have to deign to work with a few Democrats and compromise on slightly more moderate judges. \n\nIf the composition of the Supreme Court can be decided on simple partisan majorities in the Senate, there is no good reason that legislation in general (which the Supreme Court has the power to strike down entirely) should require a higher standard.",
            "title_similarity": "0.7922114",
            "sentiment_compound": 0.8119
        },
        {
            "id": "h0i5ygy",
            "score": 1,
            "text": "Everything you're saying is correct. The GOP will have control again. And they will get rid of the filibuster as soon as they can. That's the thinking of the Democrats. Why wait for the GOP to do away with it, like they did with the filibuster for Supreme Court nominees? The GOP has proven time and time again they will do and say anything now to hold on to power.\n\nThere were several other good points being made, but the best one is this: the Democrats should not waste this very brief window where they have control to get rid of it, and establish democratic protections. Otherwise the GOP will just do it the next time they have power and it will be too late.\n\nI wish more people understood this to put pressure on Joe Manchin. Fucking guy.",
            "title_similarity": "0.86471224",
            "sentiment_compound": 0.9387
        },
        {
            "id": "h0i6eag",
            "score": 1,
            "text": "At the end if the day it's not the Democrats or Republicans who are screwing the American people over.  It's the Democrats AND Republicans.  Nothing will get done with either party in charge.",
            "title_similarity": "0.80770445",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0i6js0",
            "score": 1,
            "text": "The next time the Republicans control the Senate, McConnell (or whomever the leader is) will almost certainly nuke the filibuster. Also, needing 60 votes is absurd. Nothing gets done. Let 51 Democrats get their stuff through when they’re in power, and — as much as I hate the GOP — let 51 Republicans get their stuff through when they’re in power.\n\nRegardless of all that, though, the Democrats better act NOW in eliminating the filibuster. We are in the middle of perhaps our last chance to preserve democracy. And Republicans are doing everything possible to ensure minority rule for themselves, indefinitely.",
            "title_similarity": "0.8898541",
            "sentiment_compound": 0.6003
        },
        {
            "id": "h0i6q5d",
            "score": 1,
            "text": "If they manage to get rid of the filibuster early they can push through DC statehood making sure they won't regret it.",
            "title_similarity": "0.6519308",
            "sentiment_compound": 0.5621
        },
        {
            "id": "h0i6qd2",
            "score": 1,
            "text": "I don't know if anyone mentioned this yet, there's way too many comments at this point to read them all.\n\nFor the most part, Dems want progress and change, and the GOP wants as little change as possible.\n\nRegardless of the nature of the bill or who the majority party is, the filibuster's whole purpose is to bring legislation to a halt. You cannot change or make progress on ANYTHING when legislation cannot proceed.\n\nThis is why the Republicans will not give up the filibuster. They don't want to do anything that would alter the current state. Everything is fine the way it is and the less bills they need to vote on, the less change we see.\n\nBy preventing ANYTHING from going forward, they always win.",
            "title_similarity": "0.7886361",
            "sentiment_compound": 0.9208
        },
        {
            "id": "h0i6wug",
            "score": 1,
            "text": "Such a scare tactic, that’s all the GQP has ever had",
            "title_similarity": "0.41664743",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0i7qwd",
            "score": 1,
            "text": "WRONG.\n\nThey'll regret not getting rid of the filibuster. Republicans will certainly be getting rid of it next time they come into power. \n\nMark my words.",
            "title_similarity": "0.8268896",
            "sentiment_compound": -0.6408
        },
        {
            "id": "h0i7rb6",
            "score": 1,
            "text": "Republicans exploit the filibuster more than the Democrats, so on average they would gain a lot.",
            "title_similarity": "0.5167417",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0i7us4",
            "score": 1,
            "text": "I actually agree with you that the filibuster is an important tool for use by the minority. However, the way the GOP plays the senate game they’ll simply remove the filibuster when convenient for them, so best to just remove it now. If you think they wouldn’t, just look at Merrick Garland and Amy Coney Barrett. Changing the rules isn’t out of their playbook, and Dems need to play their game while they still have control.",
            "title_similarity": "0.8389691",
            "sentiment_compound": 0.9196
        },
        {
            "id": "h0i86lo",
            "score": 1,
            "text": "One major flaw in your argument is assuming that Republicans will go nuclear out of a need for revenge. They went nuclear blocking Garland and then jamming through Coney Barrett. Republicans don’t need a reason for naked abuses of power, they just need Dems who still believe in restraint and time to take back the Senate.",
            "title_similarity": "0.78679365",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h0i87bz",
            "score": 1,
            "text": "You should consider that the filibuster is inherently a device that inhibits progressive platforms and not conservative platforms. \nIf your goals are to keep things the same and have small risk, small reward politics (the conservative platform), then a filibuster allows the minority to prevent change. \nIf your goals are social change really any progressive change (which is more in line with the democrats) then the filibuster will always be a thorn in your side. \nThis is not to say that the the republicans will never want to pass provocative or even progressive legislation. Just that the filibuster inherently favors conservative politics.",
            "title_similarity": "0.796003",
            "sentiment_compound": 0.3773
        },
        {
            "id": "h0i8av8",
            "score": 1,
            "text": "Well whenever republicans do get both houses of congress again in the future, they’ll take it away themselves if it gets in the way of their agenda. Might as well get rid of it now and pass everything you can while you’re in power. It’s an undemocratic relic anyways",
            "title_similarity": "0.78010374",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0i8s65",
            "score": 1,
            "text": "It could do a lot to encourage voters. A lot of policies from democrats are popular but don’t get passed, partly due to the filibuster. Also people feel like nothing ever gets done and it discourages participation in the process. With stuff actually getting done, we may see a lot more participation. And addressing the republican issue, they have shown they aren’t interested in the democratic processes already so they will do whatever it takes in the future if they get control. They will then take steps to make sure democrats will never be allowed to gain power again. They aren’t following any rules so relying on rules is a bad idea.",
            "title_similarity": "0.8397619",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h0i8yd2",
            "score": 1,
            "text": "Except that immobilism is a hurdle for the progressives, not the ones fully satisfied with the current broken system.",
            "title_similarity": "0.62728834",
            "sentiment_compound": -0.0018
        },
        {
            "id": "h0i9s0s",
            "score": 1,
            "text": "Australia here. We live in a real democracy. Your democratic principles are so eroded you’re now arguing in FAVOUR of minority rule principles.  \n\nHahahahahahahahahahahahahahahahahahahahahahahahahahahahahahaha. Ha.\n\n\nStopped being scared and man up or woman up or whatever. Majority rules",
            "title_similarity": "0.701404",
            "sentiment_compound": -0.4883
        },
        {
            "id": "h0i9uc5",
            "score": 1,
            "text": "Let’s say the GOP takes the House, Senate, and White House in 2024.  But this time, the president is more ambitious than Trump and he wants to get shit done, so he gets McConnell to ditch the filibuster.  Either way, the next time the GOP has both houses of congress and the White House, they are likely to dump the filibuster and do everything you’re worried about.\n\nSince the filibuster will go away under Republicans anyhow, why /shouldn’t/ Democrats drop the filibuster now and try to do some good for the country?\n\nAlso, I am not convinced that the GOP, as it exists today, could take the White House, senate, or house without gerrymandering and voter suppression.  The For the People Act would force the GOP back toward the center since they’d need to win fair elections to take office.",
            "title_similarity": "0.8308524",
            "sentiment_compound": 0.2388
        },
        {
            "id": "h0i9xpi",
            "score": 1,
            "text": "I agree",
            "title_similarity": "-0.0789607",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0iatbe",
            "score": 1,
            "text": "If the Dems drop the filibuster they're probably killing the electoral college and granting DC and Puerto Rico statehood.",
            "title_similarity": "0.7053882",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h0ib0e5",
            "score": 1,
            "text": "They won’t, because the only regret they will have is the republicans will use it in the future. Well guess what, the moment the republicans can’t get something passed in the future, they will just get rid of the filibuster anyway.\n\nSo why wait.",
            "title_similarity": "0.8318039",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0ib1d0",
            "score": 1,
            "text": "Gerrymandering is a fuckin atrocity",
            "title_similarity": "0.40456694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ibgqo",
            "score": 1,
            "text": "I think we should keep it. If Democrats get rid of it when republicans have power, it will be hell for them. And then vice versa, forever. \n\nI believe this because human error is prevalent  in Congress, and I’ll need to see serious changes to consider otherwise.",
            "title_similarity": "0.88884676",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h0ibtb2",
            "score": 1,
            "text": "The state of the US senate is undemocratic because conservative states with tiny populations have 2 senators each and states with large liberal populations only have 2 senators. \n\nAlso Republicans are much better at gerrymandering and voter suppression to stay in power.\n\nThe filibuster is a flawed tool that is sometimes effective in achieving greater balance and justice in an already flawed system. It should be removed or modified, AND the other flaws should be corrected.",
            "title_similarity": "0.76742244",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0ibtbf",
            "score": 1,
            "text": "I'm not sure anyone wants to \"get rid of\" the filibuster, or if there are, there aren't many. What we want is to remove the notion that merely *threatening* a filibuster can effectively veto legislation. We want to go back to the \"talking filibuster\", where you actually have to spend hours abusing your vocal chords to block legislation. It's really such a no-brainer I don't know why it hasn't already been done.",
            "title_similarity": "0.80700576",
            "sentiment_compound": -0.7758
        },
        {
            "id": "h0ic6p4",
            "score": 1,
            "text": "The filibuster has been around as long as democracy's have been around. There is records of the filibuster being used to block one of Julius Caesar's reforms when he was consul.\n\nPeople who think it's a relic of jim crow are wrong. Unfortunately they are not ignorant, they know exactly what they are doing.",
            "title_similarity": "0.7249348",
            "sentiment_compound": -0.764
        },
        {
            "id": "h0icakm",
            "score": 1,
            "text": "Why do you want a filibuster? It's the most unnecessary road block to true democracy that only Americans seem to think keeps them from adopting stupid bills",
            "title_similarity": "0.74275035",
            "sentiment_compound": -0.5367
        },
        {
            "id": "h0icqof",
            "score": 1,
            "text": "So what you are saying is no \"progress\" or unbinded \"progress\"? With filibusters they will block, without filibusters, they can pass whatever they want. Either situation is not the solution. A compromise is needed, but at this rate they would rather fight to the death than compromise. Filibusters are pathetic and passing whatever without consequences is dangerous.",
            "title_similarity": "0.7219181",
            "sentiment_compound": -0.9262
        },
        {
            "id": "h0idq2e",
            "score": 1,
            "text": "Keeping the filibuster assumes Republicans would operate in good faith not to get rid of it themselves when it no longer serves their interests.  Republicans have amply demonstrated they do not operate in good faith.  \n  \nAll this would do is ensure Republicans are the first to get this advantage.  \n  \nFurthermore, whoever eliminates it while controlling the government gets to make further changes that will prevent the other party from the type of retaliation you are concerned about.  \n  \nThis whole mindset of maintaining the forms, norms, and values of government institutions is obsolete.  There is no common ground, no shared interest, no shared values, no coming together, no working together, no compromise, no negotiation possible within a political context between Democrats and Republicans.  (Economics and foreign policy are a different story, but neither party has any interest in doing anything to change either one, so it's not particularly relevant politically.)",
            "title_similarity": "0.79188716",
            "sentiment_compound": 0.3125
        },
        {
            "id": "h0ie23d",
            "score": 1,
            "text": "Look, it doesn't matter what democrats do. The GOP is insane. They will fuck shit up for the sake of fucking shit up.\n\nAll this cries for bipartisanship are nothing but a distraction and a waste of time. The GOP wants democrats to believe there's compromise to be made, because they fear nothing more than democrats doing to them what they do to democrats.\n\nAnd they love to waste democrats time. They love to demand changes and when they get them, they'll still vote no, because they never intended to vote yes.\n\nThe only thing democrats can do is bring everybody in line and don't give a fuck what Republicans scream, don't give a fuck what Republicans threaten to do, don't give a fuck what Republicans will do and just get stuff done. \n\nUnrig the voting system no matter what. Don't fear what Republicans will do in revenge, because they will have revenge either way for the disgrace of Democrats in power. Over 400 voter suppression bills because democrats won in 2020, what else is there they could be to threatening with? They're already in full force to steal the next election and to end democracy. \n\nAnd the Filibuster? That's the first thing Mitch Mcconnell is going to repeal if he needs to, to fuck shit up even more. \n\nSo fuck them. They'll never compromise, they don't care for bipartisanship and will shamelessly grab for power the moment there's an opening. The only winning strategy for democrats is to power through. Anything else is a weakness republicans will exploit.",
            "title_similarity": "0.8389548",
            "sentiment_compound": -0.99
        },
        {
            "id": "h0iecyn",
            "score": 1,
            "text": "Killing the filibuster *in it's current form* may be necessary so long as it's abused to stop literally any bill with majority support from coming to a vote.\n\nThe current filibuster only acts to allow the minority to prevent the legally elected majority from being able to govern, which is a fundamental betrayal of democracy.\n\nWorries about it's availability in the future are easily answered by eliminating politicized gerrymandering and passing a national voters rights bill, both of which could be done *right now* if the filibuster were reformed or eliminated.",
            "title_similarity": "0.8198161",
            "sentiment_compound": -0.875
        },
        {
            "id": "h0ienyl",
            "score": 1,
            "text": "It really is a damned if you do, damned if you don’t situation.",
            "title_similarity": "0.38793838",
            "sentiment_compound": -0.6666
        },
        {
            "id": "h0ifccr",
            "score": 1,
            "text": "If it benefitted the Republicans to remove the filibuster, they would have done it by now. \n\nThe truth is the Republicans don't really have many agenda items that they want to pass at the federal level. The Republican federal agenda is essentially \"block everything the democrats want to do and pretend we want to overturn Roe v Wade.\" \n\nThe truth is the filibuster innately favors the party that doesn't want to change anything and, for the last 60 years, that party has been the Republicans. They didn't even bother writing a platform for the 2020 presidential election after all. \n\nDemocrats are the ones who want to reform things, such as Healthcare, education costs and the minimum wage. The filibuster is a very large barrier to do much of anything ever again, as the odds of 10 Republicans working with democrats on anything is very slim in today's political climate. \n\nBut you are right that the Democrats' control of the Senate is fleeting. It always will be as long as rural Americans believe the Republicans are their party, as the small and less populated states have disproportionate control of the Senate. Will removing the filibuster be risky for that reason alone? Perhaps. But, if push comes to shove, I'd rather the majority party be able to enact their agenda and let it be judged on its merits. If the Republicans got the majority, could pass their agenda and their agenda harms their constituents, the people are more likely to vote them out and see what the democrats can do with the majority. \n\nFor far too long, politicians promise big changes if given the majority in congress only to fall back on the old excuse of \"my opposition blocked our agenda. \" removing the filibuster removes that excuse and would, ideally, lead to a government that can truly be held accountable to what its agenda does to the country.",
            "title_similarity": "0.827673",
            "sentiment_compound": 0.9533
        },
        {
            "id": "h0ifei4",
            "score": 1,
            "text": "Most arguments on this seem to be addressing the filibuster as it currently exists, and whether you believe in \"democracy\" but we don't live in a pure democracy, we live in a representative democratic republic.  A pure democracy where majority rules is likely considerably worse for those in the minority at any given time, and this is something Democrats should be (but don't seem like they are) acutely aware of, especially as Republicans aggressively gerrymander to maintain power, even as their actions in office are deeply unpopular.\n\nI don't believe that change isn't needed, but I do believe that the filibuster as currently being presented by Democratic party leadership is a boogeyman, and at that, it's one voters will quickly forget, especially with midterms coming up and Republicans going to do everything they can to hammer home how the Biden admin and every Democratic congressperson overpromised and underdelivered when they were in power.  Which is pretty typical projection from Republicans, with majorities in House, Senate and their guy in the Oval Office from January 2017 until 2019 they didn't pass wall funding, didn't repeal the ACA (much less replace it with something better), didn't balance the budget (big surprise, they made it worse), eliminate the deficit, pass nationwide CCW reciprocity or a hundred other campaign promises.",
            "title_similarity": "0.8639091",
            "sentiment_compound": -0.5989
        },
        {
            "id": "h0igjnc",
            "score": 1,
            "text": "Thats 💯 they are fools always have been. Biden has never been able to speak, he has the IQ of a chimp on a good day.",
            "title_similarity": "0.48122156",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0igqpr",
            "score": 1,
            "text": "This is probably true but Republicans have no ideas to force through the senate anymore. Build a wall and reduce taxes on the wealthy. That's really it. The worst they can do is repeal whatever programs the Dems push through while in power, most of which will be very popular with actual citizens.",
            "title_similarity": "0.79608095",
            "sentiment_compound": -0.1421
        },
        {
            "id": "h0ihu10",
            "score": 1,
            "text": "I don't disagree, but I think it's a calculated risk. They're wagering that the amount of stuff they can't block isn't going to be as damaging as the sheer mountain of good legislation that the Republicans keep unfairly blocking. \n\nI'm with you that we need to force people to actually *filibuster* again instead of this stupid insta-cloture bullshit, but if our options are \"Republicans use it hundreds of times per session\" or \"no one can use it\" then I think we can roll the dice on the latter. Without the filibuster, just imagine how much we'd have already on the books.",
            "title_similarity": "0.7970342",
            "sentiment_compound": -0.9398
        },
        {
            "id": "h0ihz4q",
            "score": 1,
            "text": "They won't because if the GOP takes charge and passes a bunch of heinous bills, the people will /finally/ understand that it is against their own benefic to elect GOP and they'll elect democrats. \n\nRight now everything is cloudy because they both block each other and 'compromise' so nothing ever gets done and people don't know who to vote for.",
            "title_similarity": "0.8340757",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0iia86",
            "score": 1,
            "text": "Let me see if I get this right. You seem to be suggesting:\n\n* Democrat lawmakers want to advance good new policies (you admittedly didn't outright say this but your tone seriously suggest you hold this opinion)\n* Republican lawmakers have zero interest in supporting the will of their constituents\n* Republican lawmakers are petty and power-grabbing vindictive children\n* The filibuster is not a good thing. You even called it \"awful\"\n* The main reason democrats should want it to stay is it stops terrible people, who we for some god awful reason keep electing, from doing even more terrible things than they already are.\n\nI'm sorry but this logic is horrendous at best and destructive to our very democracy at worst. This is literally the same logic that people (typically men) tell women to not go out, go out at night, dress conservatively, go in groups, etc. because to not is inviting danger upon themselves.\n\nThe problem is not with getting rid of the filibuster (or women having freedom), the problem is republicans.\n\nKill the filibuster and nuke it from orbit. While we're at it, jam through tons and tons of real legislation that makes it impossible to destroy this country further. Some of the most critical of these should be forced through as amendments: government/states shall have no say over body autonomy (trans rights, abortion rights, etc), utterly outlaw gerrymandering completely, term limits, remove money from politics (there are a million options to consider here), etc.\n\nThen when they take power again, let them try and undo the progress. They tried to take back ACA but it proved way too popular (even if it's just a terrible fraction of what we should have had) and failed god knows how many times now. Force those dirty, money-grubbing, power-over-anything, fuck-over-the-common-man republic \"lawmakers\" from flyover states and bible-thumping Trumpistan to put forth laws to repeal things. Part of our overhaul prior to 2022 midterms should be to force an entirely transparent legislative process so if some on-the-take republican wants to give some company a massive tax break at the expense of the middle class, the people need to see it.\n\nI welcome their efforts. It's all we have.\n\nWhat would you rather we do? We will not ever be able to pass any even remotely useful legislation until the end of time so long as the GQP holds on to even a modest minority of power so long as the filibuster remains on the table.\n\nFuck the filibuster, it must go for the sake of this nation.",
            "title_similarity": "0.87065107",
            "sentiment_compound": -0.9937
        },
        {
            "id": "h0iibk3",
            "score": 1,
            "text": "My belief is that the republicans no longer give a FLYING FUCK about bipartisanship and will end the filibuster if they take control of Congress and the White House in 2024",
            "title_similarity": "0.7738164",
            "sentiment_compound": -0.7531
        },
        {
            "id": "h0iidkg",
            "score": 1,
            "text": "I think they will regret it if they don't, because when the time comes for the Republicans to be in power, I think they will get rid of it themselves. Just to screw over the Democrats and seize as much power as they can. Democrats need to do it now where it will benefit them, and not wait for when the Republicans get rid of it to screw them over.",
            "title_similarity": "0.87449706",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0iiunf",
            "score": 1,
            "text": "The filibuster is already dead for everything the Republicans in Congress truly care about currently, budget reconciliation and judicial nominations. Removing it entirely wouldn't realistically change all that much from the Republican perspective, as they don't stand for much besides being against anything democrats want to do and lowering taxes for people making over $200k annually.\n\nIn my honest opinion, democrats have two ways to \"fix\" the issue with the filibuster right now, either enforce it on everything that gets voted on, and remove any way to get around it, or they remove it entirely. I believe that only one of those would actually hold up after Republicans inevitably regain control again, and it isn't the one that involves forcing working across the table.\n\nI think it is important to remember that the game has been rigged so badly that no matter what it will be a coin flip who holds the majority of Congress/the presidency. Biden had 7 million votes more than Trump, and yet if 44k votes went the other way then Trump would still be president. Not to mention the partisan gerrymandering going on all around the country.",
            "title_similarity": "0.8380662",
            "sentiment_compound": -0.2736
        },
        {
            "id": "h0ij5q8",
            "score": 1,
            "text": "Brexit that bitch and let the cards fall where they  may...",
            "title_similarity": "0.50055444",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0ijc2j",
            "score": 1,
            "text": "I agree that removing the filibuster does open up the prospect of legislation being put into law that might be \"bad\" but that doesn't justify that the filibuster needs to stay. It is a totally ineffective way to ensure that \"bad\" or \"good\" legislation doesn't or does pass into law. Ultimately there is an ongoing need for laws to be created, amended and revoked even if this risks adverse outcomes. The outcomes need to be realised and subsequent adjustments can be made to adjust these outcomes. This is the inherent imperfection of democracy, it requires an objective after-the-fact assessment of laws and their impacts rather than being a mechanism for endless subjective debate about the hypothetical impacts of laws that have yet to be passed.",
            "title_similarity": "0.78247607",
            "sentiment_compound": -0.5271
        },
        {
            "id": "h0ijiu2",
            "score": 1,
            "text": "Next time the GOP gets control of both the Senate & the Presidency, they will definitely do away with the filibuster. \n\nSo by keeping it, the Dems are hamstringing themselves but not their opponents.",
            "title_similarity": "0.84107906",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h0ijsi2",
            "score": 1,
            "text": "You guys don’t think it’s fucked up at all that there are two major political groups with differing opinions and they’re not even mature enough to, instead of making emotional, irrational decisions that can impact hundreds of thousands of people, identify and acknowledge that both groups present equally valid points, and come to conclusion that satisfies both groups? Like what the fuck is this bullshit about “revenge”!? This country is so fucked.",
            "title_similarity": "0.68455577",
            "sentiment_compound": -0.9571
        },
        {
            "id": "h0ijveq",
            "score": 1,
            "text": "The wanna get rid of anything that can oppose them, they want a full dictatorship over the United States. Canada already went into a full dictatorship and these are the same liberals that make up majority of the democrats",
            "title_similarity": "0.6430829",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0ijwyp",
            "score": 1,
            "text": "What makes you think Repubs wouldn’t get rid of filibuster even if Dems keep it?",
            "title_similarity": "0.58634424",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ik3us",
            "score": 1,
            "text": "This is assuming the Republicans won’t get rid of the filibuster the first chance they get the next time they have control of the senate.",
            "title_similarity": "0.7977829",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0ik4lq",
            "score": 1,
            "text": "> To preface, the filibuster in its current form is awful. So, I'm not saying that change isn't needed. What I do believe, is that if Democrats do get rid of the filibuster they will regret it.\n\nThe key here is to neuter the filibuster, and *then* pass HR1 and other election reform laws, with the intention of ensuring that the GOP in its current minoritarian state will never be able to win another national election. \n\nIt's *fine* if a hypothetical future GOP under new, rational, not-evil leadership wins an election. A GOP that actually tries to expand its tent by moving to the middle, rather than shifting more and more to the right. But this hypothetical better GOP will never happen without election reform law.",
            "title_similarity": "0.9232545",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h0ikcxx",
            "score": 1,
            "text": "I think they should *actually require a filibuster* instead of just one person saying \"yeah I'm gonna filibuster this\".  \n\n\nGet in the dock and read the phone book, and if you have to sit down or eat or drink you're done.",
            "title_similarity": "0.6172935",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0ikjc6",
            "score": 1,
            "text": "If your scenario happened what makes you think they wouldn't just get rid of it themselves??",
            "title_similarity": "0.49884245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0il8vf",
            "score": 1,
            "text": "Good force them to work together",
            "title_similarity": "0.12207706",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ilv9y",
            "score": 2,
            "text": "It’s time to leave people alone and stop using the ballot box to force your ideas on others. This will only end badly for everyone. Always remember that the smallest minority is the individual.",
            "title_similarity": "0.6952814",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0im2bg",
            "score": 1,
            "text": "I don't think the filibuster would help democrats if it remained. The republicans when in control would force things through whether the democrats filibuster or not.",
            "title_similarity": "0.7718109",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0im5b9",
            "score": 1,
            "text": "Somebody said the same thing back in 2016 about filling Scalia seat. The Demoncrats backed out and jokes on them cuz  Mitch McConnel and Lindsey Graham did not give a shit.",
            "title_similarity": "0.7432211",
            "sentiment_compound": 0.6154
        },
        {
            "id": "h0im6km",
            "score": 1,
            "text": " How would the GOP steal elections?  By requiring voter ID?",
            "title_similarity": "0.49762034",
            "sentiment_compound": -0.5514
        },
        {
            "id": "h0imejf",
            "score": 1,
            "text": "The issue with this line of thinking is that I remain completely unconvinced that Republicans won't change the rules and eliminate the filibuster the second it suits them.\n\nThey already did this by refusing to take up Merrick Garland because they were no rule saying they couldn't. They did it by changing the filibuster rules for Supreme Court seats.\n\nThey've shown a willingness to violate every democratic norm imaginable. People who think they won't abolish the filibuster when it suits them are complete and total suckers. A lot like the people who think that they wouldn't stack the Supreme Court of Democratic appointees were in the majority.",
            "title_similarity": "0.840872",
            "sentiment_compound": -0.8523
        },
        {
            "id": "h0imk4c",
            "score": 1,
            "text": "Filibuster should be a talking filibuster. 41 to sustain it. 60 votes to shut down anything except reconciliation is problematic when one political party seeks to cut taxes and do nothing else.",
            "title_similarity": "0.7574884",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0ims4b",
            "score": 1,
            "text": "I’d rather have earmarks back",
            "title_similarity": "0.39883286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0in54o",
            "score": 1,
            "text": "The fact that neither side will hold the senate forever is its own benefit. A simple majorty becomes something like a nuclear deterrent.  *Eventually* both sides will be forced to keep what is popular and ignore what’s not. \n\nWhat can’t be agreed on will be left to the states. Right?\n\nYou can’t keep nuking each other forever.",
            "title_similarity": "0.7413336",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0in5b0",
            "score": 1,
            "text": "“The majority of voters” that’s the thing, they’re using the filibuster to diminish the right of Americans to vote. Letting them filibuster a new voting rights act allows republicans in state governments like Florida, Georgia, Texas and elsewhere to continue disenfranchising millions of voters. Not only making it harder to vote, but taking certification away from Secretaries of State and handing it over to state senates which are even more radical than US Republican senators (which is crazy). \n\nRemoving the filibuster only allows you to have your way if you also control the house, senate and White House. \n\nThe best way to ensure McConnell and the rest of those willing to destroy our democracy don’t get back in control of it, is to prevent republicans from gouging voting at the state level.\n\n~\n\nAnd to those saying “let’s just revert to the talking filibuster”. Remember when McConnel summarily blocked every single one of Obama’s judicial nominees so Harry Reid lowered the bar to a simple majority vote for appellate judges? What did Mitch do next? He used that as pretense to drop the bar to a simple majority for Supreme Court judges. So we either do nothing with the filibuster (and let them keep disenfranchising American voters) or we go scorched earth in protecting our democracy with the same fervor they use to destroy it.",
            "title_similarity": "0.7693858",
            "sentiment_compound": -0.5276
        },
        {
            "id": "h0in605",
            "score": 1,
            "text": "Conservatives win by preserving existing power structures even if they aren't always getting their way. Progressives win by actually getting things changed. While more conservative parties, like the republicans, have plenty they would like to change, overall they are still empowered by being no worse off than they currently are- because they represent a minority of already provledged positions. On the flip side any party that strives to improve things over time, which the Dems lean more towards than the republicans do, loses out when things don't change, particularly when they are representing an oppressed or under represented group. \n\nAs a result, the dems are disproportionately hurt by the status quoe- which is what the R abuse of the filibuster preserves. They don't need to change anything to declare victory. Removing the filibuster entirely may hurt the dems at times, but they are hurt a lot more by enabling the republican bid to preserve the existing inequalities. Especially so when it comes around to election and dem supporters feel unmotivated because their government didn't seem to get anything done, and conversely traditional conservatives campaign on reducing government because nothing gets done by them anyway.",
            "title_similarity": "0.7297655",
            "sentiment_compound": -0.1757
        },
        {
            "id": "h0inp73",
            "score": 1,
            "text": "I'm certain it won't change your view but Congress pushed through a Supreme Court Justice with 51 votes 8 days before an election. Now we're being told 54 votes lose to 30 something votes. \n\nThe filibuster has no business in our system. Period. 81 million people overwhelmingly made a statement about the direction we wanted to go. If control of Congress and the WH is meaningless unless it's Republicans, that's already authoritarian rule. Republicans have killed the filibuster any time they needed to without question. Democrats have done it what, once? \n\nDems absolutely will not hold Congress forever but I don't think \"let's leave the fastest method of removing Democrats from power\" is the way they hold it. Just a hunch. People are PISSED we couldn't get $2000 checks, more unemployment protection, infrastructure, minimum wage hikes, or damn near anything. Dems will get slaughtered next year. But it's because of the filibuster. They're trying to rule through compromise with a group that never extends the same. Enough.",
            "title_similarity": "0.7691442",
            "sentiment_compound": -0.9756
        },
        {
            "id": "h0insut",
            "score": 2,
            "text": "What makes you think Republicans can win without voter suppression?  Demographics are trending in dems favor.  Look at the breakdown by age.  Most of the republican base has fond memories of Reagan and has been conditioned to fear communism.  Meanwhile their party is becoming more and more extremist and unpalatable.  Without voter suppression they are the next whigs.  With voter suppression they could win.  And I’m sure that whether or not the dems get rid of the filibuster, The next time republicans get power they aren’t giving it back.",
            "title_similarity": "0.7825973",
            "sentiment_compound": 0.9468
        },
        {
            "id": "h0ioa3g",
            "score": 1,
            "text": "Republicans (and often the Democrats too) *love* the filibuster because it gives them cover for not actually following through on stuff they promise.\n\n“Well shucks we’d love to outlaw abortion but these awful Democrats would just filibuster it!”\n\nOr\n\n“Well shucks we’d love to raise the minimum wage to $15 but these awful Republicans would just filibuster it!”\n\nGranted this was back when Republicans actually worried about winning fair elections and their legislators weren’t as bleach-drinking stupid as most of their voters.",
            "title_similarity": "0.8009873",
            "sentiment_compound": 0.7835
        },
        {
            "id": "h0iomtk",
            "score": 1,
            "text": "Recall the 2017 failure to repeal obamacare.  Republicans had both houses of congress,  the presidency, and a majority on the supreme court to back up any constitutional challenges.  They moved the process through reconciliation, so nobody could filibuster it. But it failed to pass the senate. It needed only 50 votes to pass, pence would have tied. But it couldn't meet that threshold.  \n\nThis is because the kinds of things democrats want to do are hard to repeal. Infrastructure is broadly popular with Americans. Voting rights protections and mail in voting are broadly used among Americans (on both sides). Stimulus to the people instead of tax cuts for the rich is broadly popular. \n\nSure there's a dedicated minority of people who will always vote republican.  But the more we shift our election rules towards true democracy,  the less those people actually matter, and the more progressives and independents matter. \n\nYou seem to base your reasoning on the fact that the republican party is a bad faith political party. They are.  You're not seeing the whole picture though.  Republican state level parties are killing our democracy with state laws and they won't be stopped by the federal filibuster. \n\nThe only possible solution democrats have is federal voting rights legislation. That takes eliminating the filibuster.",
            "title_similarity": "0.7698198",
            "sentiment_compound": 0.9694
        },
        {
            "id": "h0iopmj",
            "score": 1,
            "text": "I think that's a bit of a moot point, since the GOP has already established they have zero regard for rules or democracy. They want to inflict rules on everyone else they themselves don't have to abide by. \n\nThey're eventually going to push the country to the brink with their blatant corruption and remove any option for peaceful resolution. \n\nSo the Democrats can either remove the filibuster and ensure that elections are fought on an even playing field or wait until the GOP eventually consolidates power.\n\nPersonally, I think if half these Republicans actually had to compete in fair elections they wouldn't try to push these batshit crazy laws, because they'd never win one again. They know they can't win a fair fight, so they don't fight fair. Might as well bring the fight to them and remove the filibuster. The alternatives could be much worse.",
            "title_similarity": "0.8530948",
            "sentiment_compound": -0.8085
        },
        {
            "id": "h0ioqfz",
            "score": 1,
            "text": "Bring back the Talking Filibuster. Would that we could...",
            "title_similarity": "0.4122237",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ipom5",
            "score": 1,
            "text": "The Democrats definitely will but it doesn’t mean we won’t be better off as a society.",
            "title_similarity": "0.72516096",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0iqal3",
            "score": 1,
            "text": "It's as simple as this;  \n\nThe filibuster is undemocratic, fundamentally so.  \n\nThe Democrats are happy to get rid of it whether it hurts them in the long term or not, because that's fair.  \n\nThe Republicans are not.",
            "title_similarity": "0.7531479",
            "sentiment_compound": -0.0931
        },
        {
            "id": "h0iqbm0",
            "score": 1,
            "text": "This is just an idiotic post. Plain and simple. The filibuster is just anti democratic in every way and just one part of a broken/corrupt system. Change is never easy.",
            "title_similarity": "0.6630013",
            "sentiment_compound": -0.8077
        },
        {
            "id": "h0ir3az",
            "score": 1,
            "text": "This happened the last time back in 2014 and everyone made it seem like it was the end of the world. The end of the world didn't happen.",
            "title_similarity": "0.55130893",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0ir7ah",
            "score": 1,
            "text": "The pendulum will swing back the other way at some point. Democrats have to play politics and get dirty. You want to win? Stack the deck and pass meaningful legislation.",
            "title_similarity": "0.7555928",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0ir99o",
            "score": 1,
            "text": "“Sherman, get the launch codes. We’re under attack again.”",
            "title_similarity": "0.39302158",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0irkha",
            "score": 1,
            "text": "You can have a functioning national government or you can have the filibuster. You can't have both.\n\nCurrently our nation is doomed to perpetual national paralysis because of a parliamentary trick.",
            "title_similarity": "0.7092307",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0irtc0",
            "score": 1,
            "text": "Look, all I can say is that because of the filibuster, the Republicans were able to get out of an investigation into the January 6th insurrection. I was on the fence about getting rid of it too until that moment. It **has** to go.",
            "title_similarity": "0.7483821",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0is6zm",
            "score": 1,
            "text": "Filibuster is awful and should be removed. That said, the Democrats would be incredibly stupid to do so. Just because of the way the Senate gets its’ members it is far more likely to have a GOP majority, and they will be unconstrained if the filibuster is removed. The filibuster is undemocratic, but then again so is the Senate, so maybe it does fit in.",
            "title_similarity": "0.8649269",
            "sentiment_compound": -0.0249
        },
        {
            "id": "h0is7hw",
            "score": 1,
            "text": "Dems shouldn't be too worried, even when Republicans have power they don't want to do anything their voters want. They could have passed the hearing protection act but they're too busy trying to ban abortion...",
            "title_similarity": "0.79503417",
            "sentiment_compound": -0.6616
        },
        {
            "id": "h0isexj",
            "score": 1,
            "text": "If you came to reddit looking for answers you probably won't be able to grasp the complexity of the issue.",
            "title_similarity": "0.58726335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iskmq",
            "score": 1,
            "text": "If the Democrats actually cared about staying in power indefinitely, they could. On average, Democrats are simply more popular than Republicans. Period. For instance, the last non-incumbent Republican to win a majority of actual votes in a presidential election was George H.W. Bush in 1988. The majority is much more aligned with the Democrats, and the Republicans know it, which is why the Republicans have to rely on things like gerrymandering, voter suppression laws, and the antiquated and undemocratic electoral college, to hold on to any power. If the Democrats would fight to defend, uphold, and strengthen our democratic institutions, by outlawing gerrymandering, eliminating the electoral college, instituting automatic voter registration, vote by mail, make election day a national holiday, and, yes, get rid of the filibuster, the Republicans would have to either change to be more in-line with the views of the average American, or they would become politically irrelevant.\n\nThe Democrats need to stop capitulating to the Republicans. The Republicans represent a minority of Americans. The Democrats represent a much larger segment of Americans, and if the Democrats committed, really committed, to being the party of the majority of Americans, they would dominate in elections.",
            "title_similarity": "0.73963434",
            "sentiment_compound": 0.9627
        },
        {
            "id": "h0ittz6",
            "score": 1,
            "text": "Like they don’t have a shit load of regrets already?",
            "title_similarity": "0.39700302",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0iu5dx",
            "score": 1,
            "text": "The founders wrote about this extensively. At the core of the problem is the idea that in a “pure democracy” any group with 51% of the vote can do whatever the fuck they want.\n\nTo use an extreme example - imagine a scenario where fundamentalist evangelicals had 51% of the vote and made it illegal to be any religion other than Christian. That is “democratic” but this is not a desirable outcome for the 49%.\n\nThat’s why the constitution has a ton of mechanisms built in to empower minority votes and protect the minority against the majority. Things like the bill of rights exist because there was a fear that one day, the majority might vote in policies that restricted certain freedoms (free speech, right to a trial by jury, etc).\n\nThe filibuster isn’t as codified as those things, but the premise is the same - that a minority can stop something unless it has overwhelming support.",
            "title_similarity": "0.6713947",
            "sentiment_compound": 0.4417
        },
        {
            "id": "h0iunlh",
            "score": 1,
            "text": "Republicans will get rid of filibuster in a heartbeat. Also say good bye to a rightfully elected democrat from being seated in 2024. What didn’t happen in 2020, will happen. America is done here with democracy.",
            "title_similarity": "0.78191996",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0iunw9",
            "score": 1,
            "text": "I like you cause my name is Dwight - but the problem is less the filibuster and more thts tone party is completely broken. Doesn’t matter if the filibuster worked as intended if the other party is never ever going to compromise or play by the rules. As it is right now, the filibuster does more damage than good. It only stops democrats because they follow the rules. It won’t stop Republicans from forcing votes through trickery corruption or hiding it in a 2000 page bill for something like “bill to keep breathing free”",
            "title_similarity": "0.8356945",
            "sentiment_compound": -0.3904
        },
        {
            "id": "h0iuuzy",
            "score": 1,
            "text": "Next time Republicans take House & Senate, will be last free & fair elections.",
            "title_similarity": "0.6610127",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0iuvjo",
            "score": 1,
            "text": "No we wont.",
            "title_similarity": "0.22754198",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0iv314",
            "score": 1,
            "text": "Take the filibuster back to what it was originally. Someone has to be up at the podium talking. If he or she has to use the bathroom, someone else has to talk. If they stop talking, the filibuster ends and the cloture vote can proceed.\n\nIn addition, the filibuster should be limited to debating the bill at hand, not reading the phone book or War and Peace. If you feel strongly enough that a bill should require 60 votes to pass, you'd better have a pretty damned good reason why. You should be able to explain it to viewers on CSpan.\n\nThe filibuster is supposed to be rare and difficult. It should require at least three senators working in tandem.\n\nRight now, it's just an unconstitutional minority veto.",
            "title_similarity": "0.7359102",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0iv8uy",
            "score": 1,
            "text": "Democrats can’t do anything to improve the position of working people in this country without eliminating the filibuster. They also can’t stop the federal government from devolving into an authoritarian dictatorship.",
            "title_similarity": "0.8043062",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0ivjdj",
            "score": 1,
            "text": "Have you seen the pace of this countries demographic changes? Dems will probably hold the senate forever.",
            "title_similarity": "0.50031793",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iwh26",
            "score": 1,
            "text": ">Democrats will not hold onto the senate forever. The Republicans will be back in charge of both chambers at some point in the future. And if the filibuster is gone when they, AND Mitch McConnel is still senate majority leader....watch out.\n\nIf there is no filibuster, then Republicans (as we know them today) probably won't ever hold both chambers again. The filibuster is the only thing stopping Democrats from enacting laws the increase voter turnout and eliminate vote manipulation, which many prominent Republicans have already admitted would result in them never winning elections. \n\n>And, if that filibuster is gone when that time comes, there is no doubt in my mind that Republicans will advance legislation that Democrats and the majority of voters find abhorrent, but there will be nothing they can do.\n\nExcept for vote. The major aspects of the Democrat platform (free healthcare, living wages, affordable college, etc.) would benefit the average American and be well received. The only reason people vote against those ideas is they believe they are bad. The only reason they believe they are bad is the filibuster prevents Democrats from objectively proving they are not bad by enacting them. \n\nThe major aspects of the Republican platform (limited access to birth control, outlawing abortion, stripping of environmental protections and workers' rights protections, tax cuts on the rich, etc.) would detriment the average American and be very poorly received. The only reason people vote for those ideas is they believe they are good. The only reason they believe they are good is the filibuster prevents Republicans from objectively proving they are not good by enacting them. \n\nRemove the filibuster while Republicans are in power and yeah, they are going to enact some terrible legislation that majorly fucks this country up. Afterwards, nobody will ever vote for them again. \n\n\n>My response to that is that it is simply absurd to believe that Democrats will hold onto both the House and the Senate forever. Republicans will win again at some point, and they will enact revenge.\n\nNo first world country in the world has a right wing extremist party which \"will win again at some point\". It's not unreasonable to suggest that if the US became a first world country, we also would not have one. \n\n\n>As it stands now, the filibuster gives Democrats the ability to block some of the more egregious legislative goals of Republicans,\n\nWhich is the only reason why Republicans still exist in their current form - they suffer zero backlash from bad policies if they don't ever enact those policies. \n\n>and I think it is foolish to take away that ability.\n\nIt's foolish to keep it. If the American people vote for Republican representation, that's what they should get.",
            "title_similarity": "0.9016698",
            "sentiment_compound": -0.5278
        },
        {
            "id": "h0iwk2c",
            "score": 1,
            "text": "The democrats are all but boned anyway cause they have morals and try to do things",
            "title_similarity": "0.61742043",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iwkky",
            "score": 1,
            "text": "Something something used more times in past 20 years than the entire history of the country.",
            "title_similarity": "0.17920263",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iwnkm",
            "score": 1,
            "text": "I’m not so sure it’s a foregone conclusion that the political pendulum will keep swinging and republicans will inevitably be in control again. The world is always changing, what has happened before may happen again, but it may not. The current GOP seems to be clinging desperately to values and ideas rooted in a fading culture. One with deeply rooted ideological flaws that future Americans can do without. I am optimistic about the future, but the sooner we can free ourselves from gnarled grasping claws of Mitch McConnell and his ilk the better.",
            "title_similarity": "0.7455832",
            "sentiment_compound": 0.7407
        },
        {
            "id": "h0ix5tz",
            "score": 1,
            "text": ">help ensure Republicans aren't allowed to steal elections through gerrymandering and local voting laws the discourage certain democrat leaning demographics from voting. My response to that is that it is simply absurd to believe that Democrats will hold onto both the House and the Senate forever. Republicans will win again at some point, and they will enact revenge.\n\nI think you misunderstand the intent of improving voting access, or simply don't realize just *how* undemocratic the contemporary Republican party is. The idea isn't to stymie the Republican party forever. The idea for Dem leadership is to force Republicans to *create and enact policies* to attract voters, rather than restricting voters they don't want to vote in order to win.\n\nThe Overton window has shifted so far right in this country over time, that both parties land far to the right of most of the populace on many many issues. Increasing health care access is highly popular amongst the public. As is legalizing marijuana, reducing wars, and maintaining abortion rights. These would *not* be hot-button political issues, if our leaders actually represented the will of the people, and we didn't have such a distorted voting populace (and political system, honestly) that rural Americans got up to 5x the political representation as urban Americans.\n\nThe idea of voting reform and increased access to voting is not to forever kill the Republican party. It's to force the Republicans to amend their agenda to win votes on policy, rather than anti-democratic machination. Ideally, it will be *different* Republicans who would win the House and Senate back.",
            "title_similarity": "0.8629022",
            "sentiment_compound": 0.9909
        },
        {
            "id": "h0ix8rv",
            "score": 1,
            "text": "I wouldn’t argue with you the way you’d expect.  The Democrats *would* regret it.  Any other left wing party in their shoes probably wouldn’t, but the Democrats didn’t get to where they are today without making policy compromises in the name of donors and manipulating the U.S.’ political climate, among other things.",
            "title_similarity": "0.8744363",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0ixb1x",
            "score": 1,
            "text": "Oh one hundred percent they'll regret it, but does that mean it should stay?",
            "title_similarity": "0.6468952",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0ixht1",
            "score": 1,
            "text": "They won’t regret it, because they’ll never be challenged in an election again. They’ll pass their ballot-stuffing laws and it’ll be over. Full blown authoritarian-left spiral into madness.  \n  \nEdit: maybe they’ll regret it when they’re using hundred dollar bills to burn for warmth.",
            "title_similarity": "0.80467886",
            "sentiment_compound": -0.6374
        },
        {
            "id": "h0iyb96",
            "score": 1,
            "text": "Depends on what they do with it:\n\n1. Eliminate Filibuster\n2. institute proportional representation\n3. ???\n4. Profit!",
            "title_similarity": "0.53505814",
            "sentiment_compound": 0.5764
        },
        {
            "id": "h0izg9w",
            "score": 1,
            "text": "You assume the Democrats have the balls",
            "title_similarity": "0.4732545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0izhsl",
            "score": 1,
            "text": "The elimination of filibuster just places the onus on the party in power to adopt legislation the people want. Right now you can’t pass any of the following that polls say most Americans want, including a number that a majority of Republican voters want such as passing cannabis regulation to the states, the big infrastructure package, improving Social Security benefits, and raising the minimum wage. \n\nRepublicans had a path to repeal “Obamacare” on a straight majority vote when they had a 52-48 majority and could lose two GOP votes because VP Pence could break a tie and in the end three caved to constituents to preserve it 51-49. \n\nThe filibuster means any important legislation requires not a majority but a 3/5ths majority. \n\nThe current filibuster rules are a sham. It takes 60 votes “to end debate” yet there isn’t actually any debate to end. It’s not the idealistic Jefferson Smith on the floor talking trying to buy time, it’s 41 people refusing to sign a piece of paper to permit Congress to do the job it’s charged with doing, approving or rejecting legislation. \n\n\nFilibuster magnifies the power of smaller population states. Half of all Americans live in just nine states. Couple that with the House not adding any seats in a century, when the population is one-third of what it is now you concentrate power in the minority. \n\nFilibuster has been most effective in killing anti-segregation laws.",
            "title_similarity": "0.78441703",
            "sentiment_compound": -0.8524
        },
        {
            "id": "h0izpz2",
            "score": 1,
            "text": "The point was to have to hold the floor physically, not this virtual or hypothetical crap. Get up, face the mic and get at it. Change my mind. If you can't then the will, aka the democratic majority elected officials get to proceed with the agenda of the party that won. This contempory dilluted BS filibuster is wrong. Period.",
            "title_similarity": "0.7333774",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0j03hn",
            "score": 1,
            "text": "pretty sure it'd be scorched earth NOW with no filibuster, trump, and a republican majority after 2016. NOT GOOD LONG TERM",
            "title_similarity": "0.66278255",
            "sentiment_compound": 0.0904
        },
        {
            "id": "h0j082j",
            "score": 1,
            "text": "Fear of the future has crippled the democrats far too often when important work needs doing without delay. \n\nDo it, then ram through the following:\n1. Medicare for all.\n2. Free education for all. \n3. Bust up the tech and media monopolies. \n4. Do more than Infrastructure: dismantle the suburbs fix the cities and race to become carbon negative. \n5. Hold the crooks of the past administration accountable. \n6. Make private prisons illegal.\n7. Revoke Broadcast rights of extreme right wing propaganda.",
            "title_similarity": "0.7655337",
            "sentiment_compound": -0.7719
        },
        {
            "id": "h0j0f0z",
            "score": 1,
            "text": "Its already total minority rule...   Democrats in the senate represent 41 million more people than Republicans...   In a country with what? 350 million?       Its time to put an end  to the people holding this country back from progressing into the future.     Maintaining the \"keep rich people white\" isnt a governing philosophy..     Get money out of politics...     Ehh.   Fuck it's exhausting to even think about.",
            "title_similarity": "0.75706255",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h0j0ueo",
            "score": 1,
            "text": "Won’t the Republicans just get rid of it the first chance they get anyway?",
            "title_similarity": "0.6325016",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0j0z6v",
            "score": 1,
            "text": "If we get rid of the filibuster ppl will see why it's in their benefit to vote democrat and never vote Republican again",
            "title_similarity": "0.8205421",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0j16e2",
            "score": 1,
            "text": "The filibuster affects the senate. For the egregious abuses to pass, the republicans need to have all three branches and 100% party line vote. So long as democrats control the house or white house; they can stop things. On the other hand; if they don’t drop the filibuster, the republicans will pass laws all but ensuring republican control of the house. When they have all three branches; i have no doubt the modern republican party will have no qualms dropping the filibuster.",
            "title_similarity": "0.7658452",
            "sentiment_compound": 0.5369
        },
        {
            "id": "h0j1gh4",
            "score": 1,
            "text": "The next time Republicans are in power they’ll do it. Might as well try and save democracy while we have the power.",
            "title_similarity": "0.669322",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h0j1koe",
            "score": 1,
            "text": "We didn’t have it until the Civil Rights era. It’s not a law, it’s not in the constitution. It’s a loophole.",
            "title_similarity": "0.5276085",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j1sm3",
            "score": 1,
            "text": "How long do you think Mitch is gonna live?",
            "title_similarity": "0.28737783",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j2iun",
            "score": 1,
            "text": "Luckily more and more people are moving to cities and therefore becoming Democrats, also with DC and/or Puerto Rico looking to become new states, I don't think the house and Senate will both fall to Republican control. So good try with your pathetic attempt to retain control idiot.",
            "title_similarity": "0.7515552",
            "sentiment_compound": 0.0107
        },
        {
            "id": "h0j2kf3",
            "score": 1,
            "text": "I agree, though I do believe McConnell will nuke the filibuster the next time he has a chance. \n\nHe doesn't give a sh** about the hipocracy. \n\nI hate getting stuck playing by the rules when the other team is playing \"I win\".",
            "title_similarity": "0.77494687",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0j2s88",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0j3jpf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0j3vh2",
            "score": 1,
            "text": "Who says Mitch won't get rid of it and pass his anti voting laws.",
            "title_similarity": "0.7362969",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0j4tt2",
            "score": 1,
            "text": "Why wouldn’t the Republicans just get rid of the filibuster when they take control? It’s got to go.",
            "title_similarity": "0.67138505",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j58ko",
            "score": 1,
            "text": "The filibuster is not on the constitution . It was created to stop laws for equal rights for African Americans . Majority should be able to pass laws . This argument is crap.",
            "title_similarity": "0.6937113",
            "sentiment_compound": -0.6883
        },
        {
            "id": "h0j59zf",
            "score": 1,
            "text": "Honestly I think its the other way, Democrats have an obligation to eliminate the filibuster, stack the courts starting at the top, 27 Supreme Court Judges and lots simply appointed by sleepy Joe Biden. Most people don't really care also. Now that Trump is off Twitter, Facebook and not in the news no one gives a shit anymore. Just do it! The idea that the Republican party is not a terrorist organization after the Capital Terrorist attack on America itself and Democracy thats whats really weird. Ted Cruz is a terrorist, fucking arrest him. Donald Trump is a terrorist arrest him! Why wait? Fucking do that. Boo hoo some people have hurt feelings but they support terrorists so arrest them for all I care. The law is broke, lets fix it and put these Republican terrorists behind bars forever.",
            "title_similarity": "0.8237654",
            "sentiment_compound": -0.9751
        },
        {
            "id": "h0j5gbh",
            "score": 1,
            "text": "He really brought up stealing an election and used Republicans as an example lol",
            "title_similarity": "0.5945295",
            "sentiment_compound": -0.2878
        },
        {
            "id": "h0j6tm2",
            "score": 1,
            "text": "It will benefit them more to get rid of it.  While it is possible there is some outcome they might regret it, in general it is easier to give stuff, which democrats want,  than to take stuff away. \n\nFor example,  the gop had the chance to take away obamacare, but they didn't in the end because of the political cost of taking Healthcare away from many of their constituents. \n\nSo if the dems passed a child tax credit or housing entitlement it would be harder for the gop to repeal it that passing it was in the first place.",
            "title_similarity": "0.7811601",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h0j7a86",
            "score": 1,
            "text": "If the Republicans would want to pass disastrous legislature, let them. Let it be the most “evil” thing that they can think of. The voter will correct those mistakes and hopefully force the Republican Party in a better direction. \n\nThe point I want to make is it is better to act on given issues than to only react.",
            "title_similarity": "0.77288914",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0j7bus",
            "score": 1,
            "text": "Step one: Abolish the filibuster \nStep two: Abolish the electoral college",
            "title_similarity": "0.577582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j7emo",
            "score": 1,
            "text": "I disagree. Conservatives are going to to bad things whether or not we remove the filibuster, it hasn’t stopped them before.",
            "title_similarity": "0.8137963",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h0j7vea",
            "score": 1,
            "text": "You’re assuming GQP won’t remove the filibuster once they have a majority anyway. \n\nThey did to get the SC seat",
            "title_similarity": "0.6719354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j8583",
            "score": 1,
            "text": "We’ll regret it more for not getting rid of it and passing crucial reforms now while we have a chance. Not getting rid of it is exactly what the Republicans want. Why the hell should we do that? This argument is some Overton window bullshit. We have to save democracy while we still can.",
            "title_similarity": "0.8132857",
            "sentiment_compound": -0.8616
        },
        {
            "id": "h0j8g3t",
            "score": 1,
            "text": "Right wingers over time naturally benefit more from bringing government processes to a halt and preventing progress. It's one of the GOPs top strategies for running society for the 99%",
            "title_similarity": "0.5997288",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0j8mo1",
            "score": 1,
            "text": "Your mistake is assuming the GOP will play fair. There’s nothing to stop them from abolishing the filibuster they next opportunity they can when they have a majority, you cannot trust them to “do the right thing” anymore. The same argument applies to expanding the Supreme Court. Don’t think for one second they will not do the same in two or four years.",
            "title_similarity": "0.7882",
            "sentiment_compound": 0.6582
        },
        {
            "id": "h0j8om1",
            "score": 1,
            "text": "Not if they remove the electoral college.",
            "title_similarity": "0.5299943",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j9a3v",
            "score": 1,
            "text": "Voting rights laws and gerrymandering keep the house and Senate way more red than they should be. We need to undo those laws and put me laws in place before we switch back to red. This is it only hope.",
            "title_similarity": "0.7117163",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0j9dod",
            "score": 1,
            "text": "I can’t disagree, and the situation will just circle back around when the Republicans use the filibuster to block Democrat bills they don’t like. Both parties will just do to the other side what they other side did to them the last time they were in power. It’s just a revolving door.",
            "title_similarity": "0.8508562",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0j9g1l",
            "score": 1,
            "text": "Mitch doesn't fight fire with napalm. He just napalms everything he he can whenever he can. The whole reason it was removed by Reid for lower court judge appointments during Obama's first term is because *Mitch was unprecedentedly abusing the filibuster to block them to begin with*. He doesn't respect the \"norms\" of the Senate any further than they're directly beneficial to his agenda. The moment the Republicans wanted it gone for supreme court appointments, it was out for that. If they had 51 senate votes and needed something that couldn't be done via reconciliation, it'd be gone.",
            "title_similarity": "0.8565817",
            "sentiment_compound": 0.017
        },
        {
            "id": "h0j9hh1",
            "score": 1,
            "text": "At the current rate of over 400 voter suppression bills in states, democrats will be a forever minority party unless they get rid of filibuster and pass national voting reform. You are living a dream thinking that after 2020, Republicans have not learned an important lesson about states voting laws. This is now or never situation",
            "title_similarity": "0.7864389",
            "sentiment_compound": 0.4781
        },
        {
            "id": "h0j9lyx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0j9pwn",
            "score": 1,
            "text": "So I somewhat follow american politics , but each time the republican take control I don't see any democrats filibuster stopping any republican, the threats only come once republican are the minority , did democrats use it since Mitch took the Senate back when Obama was president ?",
            "title_similarity": "0.76142216",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0j9tre",
            "score": 1,
            "text": "Democrats don't actually care about the filibuster. It's just show.",
            "title_similarity": "0.6499615",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h0ja1as",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0ja2gy",
            "score": 1,
            "text": "The unavoidable two sides of the sword. You can’t pick one when it’s favoring you and ditch it when you don’t like it. The current “democracy” is extremely flawed even if we get rid off filibuster, it simply does not work without proper education of the public and communication between every sides of the society. And from what we have seen in the past few years, both education and communication were not there. The bipartisanship is a joke, filibuster issue is just scratching the surface.",
            "title_similarity": "0.76060915",
            "sentiment_compound": 0.4779
        },
        {
            "id": "h0jaiza",
            "score": 1,
            "text": "The other house of Congress is already supposed to be a check on a runaway senate, alongside the presidential veto. In addition, a third of Senate seats and every House seat is up for grabs every two years. We already have checks everywhere.\n\nWhen one party controls two houses of Congress and the White House, they’ve been given tacit approval by voters to move their agenda forward. The filibuster allows for the minority party to block legislation for any reason, making the majority party appear dysfunctional and unwilling to compromise when, in reality, the filibuster is simply being used as a tactic to create gridlock where there shouldn’t be any.\n\nThere’s a reason no one suggests adding a filibuster rule in the House: because it’s a bad rule. The problem is that no one wants to be the one to get rid of it, for fear of then being blamed for whatever short-term consequences emerge. Politicians are, almost by nature, cowards.\n\nEvery legislative fight involving a potential use of the filibuster is so mentally exhausting to everyone involved, that when the suggestion is made to alter what was previously passed with 60+ votes, everyone says no.\n\nIn 2015/2016, Hillary Clinton basically said that healthcare was already done and over with, and she wasn’t really going to focus on it if elected. Why? Because the political fight, even for a democratic president presiding over a democratic House and Senate, would require as many as ten republicans to support it. It wasn’t worth it, in her view (and in the view of many Democrats, frankly).\n\nHow on earth does a democracy decide that a 59% majority in a single chamber isn’t enough to pass normal legislation? There’s a myth in the US that consensus is important in our democracy, but it never has been. When only landowners or men or white people could vote, consensus wasn’t even possible. It’s a lie that every observer of American politics is told. Repeatedly. And it’s just not true.",
            "title_similarity": "0.738034",
            "sentiment_compound": -0.8125
        },
        {
            "id": "h0jatbz",
            "score": 1,
            "text": "America is fucked either way really, focusing on the filibuster is like the Dutch kid who stuck his finger in the dike.",
            "title_similarity": "0.50452375",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0jb1i3",
            "score": 1,
            "text": "Filibuster doesn’t cover judges or tax issues. You know, the only things the GOP cares about? So what good does the filibuster do?",
            "title_similarity": "0.64751095",
            "sentiment_compound": 0.7607
        },
        {
            "id": "h0jb1nu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0jb2z0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0jc9mp",
            "score": 1,
            "text": "Whichever party that is in power has been trying to get rid of it for what seems like decades. The filibuster is anti-democratic and needs to be done away with",
            "title_similarity": "0.70191395",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0jcbq2",
            "score": 1,
            "text": "When progressives pass legislation, it frequently fails in outcome, but it rarely fails in intent. The other side have no intention other than protecting the privileged. \n\nThe filibusterer is inherently biased against progressives, and for conservatives, because the former needs to pass legislation to (attempt to) improve society, and the latter doesn't have any policies other than cutting taxes and reducing the services and responsibilities of government. They are for the status quo, so any barrier to big scary change helps them. \n\nConservatives can't withdraw too many services without startling the horses, ie their constituents. If you give them enough rope, by allowing them to pass laws more easily when it's their turn, they'll hang themselves.\n\nIt means you'll probably see more landslide elections both ways, but at  least the electorate would be making their choices more on what the governing team actually does in any given term, and less on this tribal propaganda fiasco that Americans are living through right now.",
            "title_similarity": "0.758522",
            "sentiment_compound": -0.4961
        },
        {
            "id": "h0jcbwu",
            "score": 1,
            "text": "There is a fundamental misunderstanding about what the formation of our government was made to do. The founders made our processes difficult for good reasons. The stability of our government is found in the lack of severe changes over short periods of time. Thats exactly why Mr. Covfefe Trump putting executive orders everywhere was a bad thing.\n\nDemocrats are gonna hate this when they get voted out in 4-8 years and then its gonna be \"The Republicans are bullying us\"",
            "title_similarity": "0.8442786",
            "sentiment_compound": -0.9545
        },
        {
            "id": "h0jce4s",
            "score": 1,
            "text": "Get rid of it, save democracy,  then reinstall it.",
            "title_similarity": "0.5575485",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0jcqmk",
            "score": 1,
            "text": "I like the idea of the filibuster, but the MAJORITY of Republicans in the House voted not to certify the election results WITHOUT Trump claiming voter fraud in court. They have now made it so that in several swing states the state legislatures can decide who wins. The guns are out and they aim to kill democracy unless congress prevents it now.",
            "title_similarity": "0.78362024",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0jcvp9",
            "score": 1,
            "text": "IMO the filibuster is a tool used by both parties and still exists today because our government is corrupt by outside influence. The filibuster is an easy way for either party to shut down legislation that is not in favor of the big organizations that pay our senators. Neither party will remove the filibuster for exactly this reason. If they did, they would lose their quiet benefits when the controlling party passes legislation that harms the source of their money.",
            "title_similarity": "0.763864",
            "sentiment_compound": 0.4184
        },
        {
            "id": "h0jf1le",
            "score": 1,
            "text": "For what it is worth I don't think the filibuster should be thrown out. We *DO* need to sort out this nonsense of an absentee filibuster.  Just saying we don't wanna should never have been allowed. If you want it, fine. But you've got to get up there and speak your mind until you can't anymore. *THAT'S* the filibuster we *should* have.",
            "title_similarity": "0.7471939",
            "sentiment_compound": -0.1562
        },
        {
            "id": "h0jgsxh",
            "score": 1,
            "text": "Democrats want to do things while Republicans don't. The filibuster mostly works as a check on Democratic impulses.\n\nRepublicans mostly care about tax cuts and judges based on  their priorities over the last few administrations. Those are not subject to the filibuster so the current situation works well for them.\n\nNow, if the filibuster is removed, Republicans are threatening to cancel a lot of government policies that Democrats like. \n\nSo what? \n\nIf the American people give Republicans full control in 2024 after the filibuster is removed, that means they want Social Security privatised, Medicare and Medicaid cancelled, Obamacare removed along with the gutting of other social safety nets and environmental protections.\n\nDemocracies deserve the governments that they elect.",
            "title_similarity": "0.8188684",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0jnabp",
            "score": 1,
            "text": "The filibuster is undemocratic. There are context in which it has been used to fight bad republican policy,  but it really comes down to one thing. Do you think democracy is important always or only when it is convenient to democrats?\n\nThe filibuster is overwhelmingly used to stop good democratic policy over bad policy.",
            "title_similarity": "0.7922995",
            "sentiment_compound": -0.743
        },
        {
            "id": "h0k6vb4",
            "score": 1,
            "text": "You answered your own question when you note that \"...if that filibuster is gone...Republicans will advance legislation that...the majority of voters find abhorrent...\"\n\nYes!\n\nIf Chuck Schumer had allowed Trump/McConnell/Ryan to pass their entire agenda at the start of Trumps term, millions of Americans would have suffered the results of that libertarian/neo-liberal agenda.  (Not to mention what would have happened during the at-the-time unforeseen pandemic with health insurance withdrawn from millions of people).  Yes, people would die...but it would have been attributable to the one single governing party in the parliamentary way our government was originally designed.  The responsibility would be clear to voters.\n\nWe would have Medicare for all by now because the whole country would want to get rid of the atrocious Republican policies and give Democrats a free hand to govern.\n\nRight now, both parties don't really want to govern because it's to their advantage to play it safe...to keep the water muddy enough that voters have a hard time assessing whose fault it is when policies don't work.\n\nGetting rid of the filibuster is one step back to the path of accountability for all parties.",
            "title_similarity": "0.76157176",
            "sentiment_compound": 0.9294
        },
        {
            "id": "h0ke4lo",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1937719"
        },
        {
            "id": "h0kph33",
            "score": 1,
            "text": "Republicans can end the filibuster at anytime. Why would Democrats think that not ending the filibuster is a protection?",
            "title_similarity": "0.70993835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0oi65y",
            "score": 1,
            "text": "Mitch doesn't give a fuuuuuuuck about norms and fairness. If you think he won't destroy the filibuster the moment he needs to, you're a fool. When the only consequence is shame, there are no consequences for the shameless",
            "title_similarity": "0.73168683",
            "sentiment_compound": -0.775
        }
    ]
}