{
    "CMV: Kink and BDSM should not be at public pride events and should be kept for 18+ ones\nTo start, I am a lesbian. And I've been seeing recent controversy about this topic. \n\nLook, no denying that kink plays a big role in the creation of pride. It is a part of embracing sexuality and shouldn't be excluded from the community. \n\nHowever, it should not be at public pride parades. Pride should be for everyone of all ages. Many people say \"stop catering to the straight capitalized ideal of what pride should be\" and \"pride isn't a party, it's a protest don't police us\" and \"children should go to disney if they want family friendly\" This has nothing to do with straight rainbow capitalism. I figured out I was LGBT at age 11 and trust me if I saw a kink act in public I would be kind of disgusted. I'm still a minor now, and I'd be less disgusted but still. I know people say that it's up to you to bring your children to pride, but by making all pride events \"wear whatever you want even if it's nothing\" we are also kinda excluding minors from it. It's also non consensual to anyone who is exposed to such acts, because nobody wants to go to pride to see naked people right? The \"think of the children\" phrase holds true here. Young children and teens embracing their sexuality shouldn't be forced to see adult acts against their will. \n\nAgain, no denying the role kink plays in the community, but it should be kept at 18+ events. There should definitely be a separate pride for people who just want to do leather and other kinks. That way, you can do whatever you want in a safe space where you know you won't offend others, and because people consented to come to an 18+ event, it's all good. \n\nThat's just my personal opinion on it, but it seems to be the minority. I'd like to see how you guys think about this.\n\nEdit: it appears after reading and responding to several comments, I don't really have a problem with kink, but more with public indecency. I don't care if you wear a collar or leather pants. But I'd rather not see things that could get you arrested or questioned for doing in public.": [
        {
            "id": "h0lyh6e",
            "score": 1,
            "text": "/u/akoudagawaismywaifu (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nsemsy/deltas_awarded_in_cmv_kink_and_bdsm_should_not_be/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5201443",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0jaqyo",
            "score": -1,
            "text": "Isnt this the same arguments used by homophobes as to why gay people should not kiss in public?",
            "title_similarity": "0.76307833",
            "sentiment_compound": -0.6164
        },
        {
            "id": "h0j20t9",
            "score": 2,
            "text": "Just don’t go if it makes you personally uncomfortable. \n\nIt does not take away from your identity to not go to public pride events. \n\nForcing someone else to not participate is not inclusive to everyone. \n\nIt is quite the opposite in actuality, you are asking someone not to participate.",
            "title_similarity": "0.7051747",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0jfz8b",
            "score": 10,
            "text": "Hi youngster. Great that you want to take part in Pride.\n\nThe people you are criticising are the ones that fought for Pride, in many cases fairly recently. The indecency is part of the protest; this isn't about you in particular. This is about your freedom to join, as it is. If you don't want to, that's fine. You didn't fight for anything, and your desire for less kink is part of what people fought against. If you're joining Pride, you have an obligation to find out what Pride is first. Your disgust is part of what the protest is protesting.",
            "title_similarity": "0.7725393",
            "sentiment_compound": 0.8343
        },
        {
            "id": "h0jdzxy",
            "score": 1,
            "text": "Yeah it should be kept out of LGBTQ progress events. Pride is about accepting sexual orientation. BDSM is about sexual exploration.",
            "title_similarity": "0.77154",
            "sentiment_compound": 0.872
        },
        {
            "id": "h0j04w7",
            "score": 264,
            "text": "so, i’ll present the largest argument i’ve heard. pride isn’t just about equality, it’s about liberation, especially sexual liberation. billboards have people that are almost naked on every highway, and the internet is even worse. So realistically, sex isn’t going to be hidden from kids, and what they do see, they probably won’t understand. It might be gross, but it’s reality.\nSo if we accept that, then it’s easier to understand the benefits of it being allowed. It’s called “pride” for a reason. it’s about being proud of who you are down to your deepest parts. it’s meant to be about freedom. It’s not necessarily meant for children. There should be ways for children to understand sexuality, but this might not be it. feeling pride in ones sexuality and their liberation is going to be sexual, it’s called sexuality for a reason. in order to show pride in sexuality, sex is a part of it, and while queer identities should be shown to children in a way that children can understand, a place for sexual pride is not the place for that.\nalso, i have bad adhd, i didn’t plan my sentences, i just kinda wrote, so if it’s out of order and doesn’t make sense, let me know. i’m always happy to clarify anything",
            "title_similarity": "0.8267188",
            "sentiment_compound": 0.9818
        },
        {
            "id": "h0j5wp1",
            "score": 13,
            "text": "1. What do you constitute to be for 18+? I definitely knew and saw a lot of porn by the age of 13. \n\n2. If you took your 10 year old to a gay pride parade and they saw kink fetishes do you think that would impact them negatively, how so?",
            "title_similarity": "0.66558516",
            "sentiment_compound": 0.6662
        },
        {
            "id": "h0iwl7o",
            "score": 2,
            "text": "As long as they stay on the floats and aren't physically interacting with people viewing the Pride Parade, why does it matter? What's the worst that could happen? I've been going to Pride Parades since I was 4 and there has always been kink stuff. I either didn't know what it was or didn't care. And often the kink stuff actually has a real benefit, by promoting safe sex. I have seen them passing out condoms and pamphlets about PrEP, for instance.",
            "title_similarity": "0.78656924",
            "sentiment_compound": 0.7124
        },
        {
            "id": "h0j37eh",
            "score": -2,
            "text": "You seem to be Judging people and using stereotypes for an event that essentially asks the community to not do that and to accept people regardless of their sexual activities. \n\nI would argue that the gay community and the kink community have seen similar issues with discrimination over sexual preferences that don't matter to anyone else. And while the gay community has managed to gain a significant amount of acceptance, I don't believe the same can be said for the link community and their attendance is fair.",
            "title_similarity": "0.80120957",
            "sentiment_compound": 0.8633
        },
        {
            "id": "h0jmrfc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0j8be3",
            "score": 8,
            "text": "A huge chunk of the vanilla stuff I've seen at Pride has been overtly sexual too. Lots of nudity or near-nudity, lots of oiled-up bodies, lots of highly sexualized behaviour. \n\nYou are never, *ever* going to mistake a pride parade for a bunch of mormons, are you?\n\nSo why does everyone turn into such terrible prudes as soon as kink gets involved? Oh my god, will someone please think of the children, for god's sake hide the leather from them, quick, get the (200) (topless) Dykes On Bikes out here instead!  \n\nI don't see a problem with extending the concept to 'non-mainstream concepts of gender or sexuality', tbh.",
            "title_similarity": "0.74218285",
            "sentiment_compound": 0.7359
        },
        {
            "id": "h0jmvwe",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0ip0ej",
            "score": 71,
            "text": "What percentage of pride events do you think revolve around kink and BDSM? Just as you said, the idea of Pride is to be who you are and embrace yourself. For some people, that is a kink or BDSM. From my experience a small minority, which seems to be decreasing each year, use these events to highlight their kink. For the most part, it is a time to simply be proud to be gay. Even then, they are not trying to wave it in the face of children, they are simply trying to be free, which is the point of Pride. \n\nOn the topic of nudity. The issue is not with nudity at Pride, it is with oversexualization of American entertainment. Nudity is not inherently related to sex; however, we have been conditioned to think that way through media, movies, and TV. A lid seeing nudity is going to to nothing unless they have been told it should.",
            "title_similarity": "0.73702234",
            "sentiment_compound": 0.9661
        },
        {
            "id": "h0jf1xi",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jpghg",
            "score": 0,
            "text": "Pride is not for the straights. Pride exists so we all queers reclaim our rights as humanbeings. Rights that a straight male driven system is denying us worldwide. Pride is political, social, and economical. Pride is feminist, anti – racist, pro – trans. Pride is a riot and a parade. A party and a protest. And yes, pride is sexual. \n\nChildren are groomed from the very beginning by the system, and they are conditioned under the umbrella of being misogynistic, of the disinformation regarding sex whichleads into bigger problems.Years and years of continuous heteropatriarchy still perpetuate domestic violence, rapeculture and cis male domination. A big part of this is the fact that sex is erased from the public spaces.\n\nHow will normalizing nudity and sex, and therefore kinky or BDSM- y aesthetic (always protecting the children and educating under consent) will make it worse? If anything, it makes it better. It educates. And we don’t have the obligation to bend our fight so you don’t get offended. We MAKE THE CHOICE to be family friendly.\n\nWe would like to be edgier actually.\n\nPart of being queer is questioning the system, opening conversations and yes, offending those who benefit from said system.",
            "title_similarity": "0.8043446",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0j37vx",
            "score": 174,
            "text": "[deleted]",
            "title_similarity": "0.09870997"
        },
        {
            "id": "h0iy5y0",
            "score": -3,
            "text": "There nothing disgusting with nudity. We are all just apes tryna look civilized. A random boob isn't gonna hurt anyone.",
            "title_similarity": "0.5904354",
            "sentiment_compound": 0.6759
        },
        {
            "id": "h0jis4p",
            "score": 6,
            "text": "Look, you seem unconvinced by the other posters. The adult world is messy, deranged and frequently inappropriate. Pride reflects this messiness. The gays are not perfect people; we are an oppressed people expressing a highly complex cry of semi-sanctioned rebellion against the normative hegemony of WASP-y late-capitalism. Without people being grossed out, avoiding popular public places because of the queerness, is it really a pride event? No, it is some gay rights political rally... Pride is problematic, I'll grant you that. However, that problematic expression of gay angst IS the point. \n\nIf you don't want to hang out with drunks don't go to the bar. If you don't want to be part of queer culture attempting to stake out a little piece of the public consciousness for consensual sexual torture, degradation and sodomy, then don't go to pride parades. It isn't a place for children, intentionally. \n\nIs the pride parade of gyrating, glittery 40-somethings expressing their love for their fellow queers worse than a Proud Boys pro-racism rally? Is it worse than a street preacher yelling at college students with spittle flying that they're all going to hell? Is it worse than your local Trump brigade rolling coal down the street? \n\nThose are the groups that Pride is specifically fighting against, the bigots. If our oppressors can hold fascist rallies in the city streets, yelling out, \"the Jews will not replace us,\" are a few queers with their tits out the place to worry about limiting public expression?",
            "title_similarity": "0.75853705",
            "sentiment_compound": -0.9868
        },
        {
            "id": "h0jd3ey",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jvf5o",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k0h0u",
            "score": 2,
            "text": "The human body is nothing to be ashamed of and kids - certainly kids at pride - shouldn't be surprised by it.\n\nWear your leather, your g strings, and whatever else. My kids will be fine. Pride is about not being ashamed of who you are. Don't change that because I show up with my 9 year olds.\n\nThey know what sex is. They know there are lots of different ways people enjoy it.\n\nMy trans kid was a weeping mess when we left pride in 2019. Zie wasn't scared by topless, post top surgery trans women or dudes in gold micro briefs. Zie was overwhelmed by the knowledge that there is a community for people like zir.\n\nKeep Pride shameless because there's more than enough shame to go around in the rest of society",
            "title_similarity": "0.7119781",
            "sentiment_compound": 0.9214
        },
        {
            "id": "h0ip76h",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "0.09870997"
        },
        {
            "id": "h0jjnfz",
            "score": 0,
            "text": "Are you saying nudism is a kink?\n\nLots of more arguably inappropriate stuff goes on at pride events but are you drawing the line at nudity when you talk of kink and BDSM?\n\n\nKids generally don't care about nudity. It doesn't affect them or poison them",
            "title_similarity": "0.8167156",
            "sentiment_compound": -0.859
        },
        {
            "id": "h0jn2p4",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jy9tq",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k4w8y",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k6jia",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0ivlrz",
            "score": 42,
            "text": "But in your first paragraph you mentioned why they should be there... because they have played a huge role in movement and helping (not only the lgbtq+ community) people accept their sexuality. \n\nI also feel like your missing one of the original points of pride which is to make people feel uncomfortable. People who are homophobic are supposed to look at pride parades and rallies and realizes that our group doesn’t care what they think and we are happy. The BDSM community does a great job at making an uproar and making homophobic people stare and feel they unease. \n\n I’m not saying nipples should be flying or cockrings should be out, but since when has LGBTQIA+ every been about been being exclusive",
            "title_similarity": "0.8345014",
            "sentiment_compound": 0.9857
        },
        {
            "id": "h0iszix",
            "score": 34,
            "text": "I've read in other similar threads that the Kink community was one of the first to support Pride and LGBTQ rights. Both were considered \"perverse\" by a lot of the public way back, so I guess it was a matter of having a common opressor. I don't think, with that it mind, its fair to say that Kink isn't part of the protest.",
            "title_similarity": "0.792378",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0jdwgg",
            "score": 65,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jh4rc",
            "score": 6,
            "text": "I think the shock value when it comes to pride events is exactly the point. The blatant nudity and the in-your-face-this-is-my-sex depictions, the kink and all of it is the point. I think this is because of what is being highlighted and what is at stake. Disgusting people gets their attention and therefore their recognition. The fact that gay and transgender people were murdered because of their sex should have been shocking to the world but it never was. Instead the community was forced underground and. Sex in general ( nudity, exhibitionism, kinks and fetishes ) disgust people because they are considered indecent and taboo. And that’s perfectly alright. Society demands decency, hence laws. But society also murders gay and transgender people because their sex does not lie between the lines it considers decent. So sex is the topic here and the displays of kink and nudity are part of its presentations. \n\nMaybe in a few hundred years no one will care about anyone’s sexuality and there will be no need to demand recognition and highlight one’s sex by going naked in public. \n\nA good example of nudity and indecency use was  when old women in Africa stripped naked so that innocent men who had been falsely imprisoned could be freed. They were led by Nobel Peace Laureate Wangari Maathai who helped save the trees.\n\nPS: I’m not LGBT and I don’t have many LGBT friends so I have less information than you do about the community. I just think the reason the nudity and kink are in pride is the result of the hypocrisy that allowed a decent community to murder gay and transgender people for decades.",
            "title_similarity": "0.7533277",
            "sentiment_compound": 0.803
        },
        {
            "id": "h0jous6",
            "score": 7,
            "text": "aren't you tired of the same fruitless discourse around pride every year? as soon as june comes, it's questions about kink at pride, veterans month, and similar bad takes. just compare the few instances of kink at pride to what you see in popular culture today. it's a non-issue and it's just rooted in homophobia.",
            "title_similarity": "0.7251247",
            "sentiment_compound": 0.7849
        },
        {
            "id": "h0jlvvq",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jb202",
            "score": -1,
            "text": "my question for people who feel this way: who is going to be enforcing this? if you see someone who is dressed in a “publically indecent” way, what are you going to do about it?",
            "title_similarity": "0.46843767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jdakc",
            "score": 1,
            "text": "About the kink in public thing I'm kind of with you on that to a degree, but the pride wear I'm going to point you in a certain direction of thought. Wearing clothing in pride is a way to express yourself and your beliefs/ideas/creativity. Countless cultures across the world have many different forms of clothing with varying levels of nudity throughout especially ceremonial wear, hell some tribes in Africa wear nothing but a penis sock. To completely close people and children off from a certain level of nudity in clothing is to censor humanity.",
            "title_similarity": "0.716239",
            "sentiment_compound": -0.3172
        },
        {
            "id": "h0jejo8",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jqbdy",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jxlya",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jzglr",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0izp43",
            "score": 11,
            "text": "Can you be specific about what kink and BSDM stuff you think doesn’t belong? All I see at parades are like leather gear and maybe leashes.",
            "title_similarity": "0.5620431",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0k2cqe",
            "score": 4,
            "text": "If we did everything based on what children are disgusted by, we would basically have nothing. As a child, I was disgusted by eggs. Does that mean everyone should have gone out of their way to keep eggs secret from me?\n\nMany adult gay people do not even like children. Whatever you think pride \"should\" be about or for doesn't really matter. This is like cishet straight women going to a gay bar for a bachelor party and demanding to use the men's bath room and then complaining that there are urinals. We built this, for our thing, and we are nice enough to welcome you to participate.\n\nDon't project your shame.",
            "title_similarity": "0.8400221",
            "sentiment_compound": 0.6063
        },
        {
            "id": "h0jgtb7",
            "score": 11,
            "text": "This thread... yikes",
            "title_similarity": "0.06944683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j7qrw",
            "score": 25,
            "text": "In Seattle in the groovy neighborhood of Fremont, there's the annual Solstice Parade in June. The parade is mostly naked folks wearing nothing more than lots of creative body paint.  Look up some pictures online.  It's been a Seattle tradition for decades.  The parade draws thousands and there are many kids in attendance.   Nobody is offended by the celebration.",
            "title_similarity": "0.4983467",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0jk68x",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jkkwv",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jh3la",
            "score": 195,
            "text": "So this is discourse that comes up every year, especially from teenagers who have never attended a pride event in their life and have a tendency to be chronically online (Not saying this is you OP, just that I've seen this same argument for years on Twitter, Tumblr, Tiktok, etc)\n\nIt’s important to know what is actually being referred to when people say kink belongs at pride. They're talking about communities who have always been a part of pride, that have played important roles in queer history. They are not talking about people fucking in the middle of pride, or sexually harassing or assaulting people, or walking around naked shoving their genitals or the sex toys they’re currently using in people’s faces. Those kinds of things don't happen, especially not on an endemic scale, and no one is advocating for it to happen. Anyone who claims otherwise is either acting in bad faith or has no idea what they're talking about (like the aforementioned chronically online who have never actually attended a pride event). \n\nNot only does this show how quick people are to assume queer people are inherently sexual predators, but it also shows how little they know about kink and pride history. And something that is very forgotten in this “discourse” is that there isn’t one singular pride event. There are many, all over the place, and they’re all different. Some are family friendly, some are focused around kids/teens, some are alcohol free, some are kink inclusive or focused, some allow nudity/near nudity, some are 18+, some have alcohol, etc. Not every pride event is for everyone. People need to be doing the research to find out what a pride event is like and what it includes to make an informed decision about whether or not they’d be okay to go to it. And if it isn’t, they can then find one they can attend. \n\nIt’s also worth noting that a lot of the arguments people are using are hypocritical, such as the claims about not wanting kids to see near nudity or anything sexually suggestive, but having no criticism of beaches or musical festivals or any general pda from non-queer people. It’s interesting how the claims of being sexually perverted are saved only for queer people. And a lot of the arguments are just recycled homophobia. Arguments like, “think of the children” and “I support you, I just don’t want to see it” and “keep it in the bedroom, I don’t need to know about your sex life” sound a little familiar, don’t they?\n\n[I recommend reading this article that goes into more depth](https://www.them.us/story/kink-bdsm-leather-pride)",
            "title_similarity": "0.6848195",
            "sentiment_compound": 0.9819
        },
        {
            "id": "h0jbsf6",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jdw01",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jpxbu",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jumj3",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jwx0w",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0k16hq",
            "score": 4,
            "text": "Three things:\n\n1) as a trans woman, the \"no kink at pride\" arguments are shockingly similar to the types of arguments people use against my existence.\n\n2) where do you draw the line with kink? Who do you trust with the moral authority to decide what is and isn't acceptable?\n\n3) why would you ask this question on reddit, overwhelmingly populated by straight cis dudes who don't have a dog in the race?",
            "title_similarity": "0.79670167",
            "sentiment_compound": -0.2964
        },
        {
            "id": "h0k3muv",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k3u7h",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k4pj2",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k6cc7",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k7w2w",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k9xya",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0n2gc9",
            "score": 0,
            "text": "Vaush? Is that you?",
            "title_similarity": "-0.081006676",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qi89z",
            "score": 0,
            "text": "Pride isn’t for minors. The very nature of it is not really aimed at kids. The point is freedom of sexuality, so you shouldn’t be surprised that people there express theirs. That being said, it should be made clear that pride is 18+.",
            "title_similarity": "0.74466324",
            "sentiment_compound": 0.91
        },
        {
            "id": "h0jikst",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jtwsq",
            "score": 6,
            "text": "I think your edit is a good place to start.\n\nSeeing two men kissing is indecent and an affront.\n\nIs the exact same argument as:\n\nSeeing someone with a collar on is indecent and an affront. \n\nBeing gay would get you arrested in America until 2003:\n\nhttps://en.m.wikipedia.org/wiki/Sodomy_laws_in_the_United_States\n\nI would encourage you to click through those links and notice that the verbiage they use to describe homosexuality is the same that you use to describe kink. It’s the same fight, you are just pulling the ladder up behind you. People should be able to love how they like and the rest of the world can piss off with their opinion. It’s the prejudice that is the problem. Your judgement. Making it(whatever it may be) mainstream is the key to destroying your judgement and normalizing their love, whatever form that may take. Right now you are swimming in the wins that the old school kinksters, homosexuals, queens and transsexuals literally fought and died for and yet you want to argue against them? That’s hella sad. \n\nThere is nothing wrong with sex between consenting adults in any form. It’s social bullshit from the churches that we have internalized. I am a very straight very white very cis dude and it’s obvious to me that it’s all the same shit. Maybe you need to work on acceptance and seeing other peoples viewpoints? I have actually seen this argument a few times from members of the lgbt community.",
            "title_similarity": "0.71131885",
            "sentiment_compound": -0.8512
        },
        {
            "id": "h0jqobr",
            "score": 25,
            "text": "So I see people making a lot of arguments about where to draw the line at what's kink, but that doesn't really go and answer your main problem about Pride parades being overtly sexual, and I'd like to try and answer that question.\n\nModern LGBT+ pride parades directly tie their history into the Stonewall Riots in New York City, when NYC cops would frequently target, harass and attack queer bars, which were one of the few places at the time where queer people could be open about their sexuality.\n\nNow, this is when being LGBT+ in most ways could come with jailtime, losing your job, total social ostracization and more. Police raids on gay bars, and getting caught in one of those raids was a serious thing.\n\nFor whatever reason, one night when they were raided the people at the Stonewall Inn fought back. Accounts vary about what sparked it, but by the time things were getting going the cops were barricading themselves *inside* the bar, calling for backup. The riot police that showed up figured they were dealing with \"weak\" gay people that they could beat into submission, and instead got a riot of people that were alternating between throwing bricks, dancing the can-can, catcalling, shouts of \"Gay Power\" and more. People that were there described the rioters *chasing the riot cops* for hours and hours.\n\nThese riots lasted for most of a week, and are the genesis of all modern LGBT+ rights movements. \n\n-----\n\nIt is very important to note, that this wasn't polite picketing, or handing out leaflets. It was a violent riot where the crowd both was very flagrantly sexual in rebellion of the mistreatment they were receiving, and quite literally attacked their tormentors.\n\nAs a matter of historical importance, the moment that all modern LGBT+ movements can trace their roots from was *not* polite, or quiet, or decent. People literally needed to beat the shit out of cops and send them running to finally be left alone.\n\n-----\n\nModern Pride parades don't (in some places) have to deal with violence from cops or onlookers, but they still are overtly sexual.\n\nWhy?\n\nWell there's a few reasons. Showing **overt** non-heterosexuality can be a powerful framing device. For one purpose, it can be used to draw ire. Some people might be disgusted by queer people being flagrant, to which the remark might be said \"straight/cisgender culture is just as if not more *constantly* extremely sexual. Why are you mad at us, but not that?\" In another way, person might see some leather daddies marching in the parade, and find it gross, but they also might think about their out coworker who wears nothing but polos and khakis and think \"comparatively, that's not so bad.\"\n\nFor some people it's also just *fun*. If you've ever seen a Carnival, or Mardi Gras, big rolling block parties/parades with people reveling while publicly being extremely sexualized is a thing in some manner for a significant chunk of the planet. Compared to what Brazil and New Orleans gets down to, Pride parades are *extremely* tame.\n\nIt also can show to other queer people that they don't have to hide. If someone can see a woman run around in a bikini, kiss their girlfriend and wave a rainbow flag in public and it's okay, then they can realize that they're not alone in the world, that they have \"permission\" to be themselves. Showing up can help to normalize and make people realize that they have that freedom.\n\n------\n\nThere's plenty of other reasons I could bring up, but the important thing, from a political sense is that Pride is the *opposite* of invisible. It's baked into the whole concept of Pride, being unashamed to be yourself and refusing to hide anymore.\n\n\nAlso, nobody does gross stuff beyond wear skimpy clothes or like a leather harness. Nobody's fucking in public or stuff like that, it's a fun parade not a sex party. And because I feel like it needs to be pointed out, most people at Pride aren't even going so far as that The people being really flagrant are a fraction of whose all there.",
            "title_similarity": "0.7882186",
            "sentiment_compound": -0.9591
        },
        {
            "id": "h0jgabs",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0ji7lo",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0joixb",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jp49a",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jut1n",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jvasv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k4jml",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k9xdi",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0kafc8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0irgxw",
            "score": -6,
            "text": "They already do this.",
            "title_similarity": "-0.029682625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0itlly",
            "score": 417,
            "text": "Can you be more specific about where you want to draw the line? \"Kink\" and even \"BDSM\" are pretty broad terms. I can certainly imagine demonstrations that would cross the line, but is say someone merely wearing a leather collar at pride inappropriate to you?",
            "title_similarity": "0.6498235",
            "sentiment_compound": 0.7514
        },
        {
            "id": "h0jrwad",
            "score": 22,
            "text": "I'm a lesbian and a mom. If I take my daughter to pride and she sees people wearing leather or boobs or penises, I don't really think it's a huge deal. They are just body parts. I recently took her to a gay beach where tons of boobs were out and she didn't even notice. (She is 5). Same goes for wearing leather or collars. It's my decision as her parent how much I want to shelter her and I don't expect the world to have to conform to those standards. Pride IS family friendly. It should primarily be LGBT friendly though. Everyone in our community should feel welcome, full stop. That's literally what we fought for. I would never compromise that, not even for my own child. It's good and natural for her to be exposed to new things. While I wouldn't want her to see a sexual act in public (like actual sex) I have never seen that in all my years at Pride and Dyke March in NYC and SF so it's really a non-issue IMO.",
            "title_similarity": "0.8099407",
            "sentiment_compound": 0.9642
        },
        {
            "id": "h0k57g0",
            "score": 2,
            "text": "Puppies",
            "title_similarity": "-0.028814454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jelc2",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0jo1pu",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jsb98",
            "score": 13,
            "text": "I've never seen kink or BDSM at pride. I've seen people dressed up in gear, but that's to be expected. I'm honestly not sure what you've seen that offends you. \n\nAnd what kind of nudity is at prides you've seen? I've seen breasts, butts, not many penises, but I live in Germany so no one cares at all. It's literally just the human body, who cares? \n\nIf someone is being spanked in public, that's BDSM in public without the public's consent, a no-no. If someone is a leather-daddy with a whip, that's just a dude in leather with a whip. \n\nAlso I think that pride might be becoming more inclusive of alternative lifestyles, like BDSM or kink. Being who you are is important and should be embraced. Most of the people I know are kinky, poly, and definitely queer, and I think all of those facets should be celebrated.",
            "title_similarity": "0.77666664",
            "sentiment_compound": 0.9072
        },
        {
            "id": "h0jzoo6",
            "score": 4,
            "text": "Maybe kids wouldn’t grow up feeling like their kinks are something to worry about and be ashamed of if adults didn’t work so hard to hide the fact that kink exists from them. Normalizing a variety of sexual expressions would go a long way to helping people recognize their own unique wants and desires while also allowing them to feel safe to discuss them out in the open with their parents and friends.",
            "title_similarity": "0.7013676",
            "sentiment_compound": 0.3335
        },
        {
            "id": "h0k2flu",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jzuc1",
            "score": 5,
            "text": "I’ll try to play devil’s advocate. Pardon me if it’s not very good. \n\nWe younger generations, particularly in places where they would even hold pride parades without backlash, didn’t experience the worst of it. We’re not being killed, we got same-sex marriage passed nationwide, we have the internet to find accepting people who’d even go as far as to shelter those of us who come from homes where the religion teaches hate. \n\nSo what’s left? First it was coming out of the closet, now it’s taking everything else out too. If we’re free to be who we are sexually, that should mean every part of it. \n\nWe’ve got ass-shaking videos and hot tub streams being watched by millions of pubescents and prepubescents anyway. Fetish gear isn’t even more revealing. \n\nIf we keep normalizing sexuality and do so safely, we can prevent a lot of the emotional damage that comes with hiding any part of who you are. And the physical damage from trying something incorrectly. This may be a stretch, but it’s like providing condoms instead of preaching abstinence. With kinks normalized, teens can learn how to do weird shit safely instead of, say, a girl shoving a 14” homemade dildo made of socks and duct tape up herself because it’s all she had and the only easily accessible depictions of sex involve monster dongs and dragon dildos so she expects to be able to take it. (A girlfriend of mine) \n\nMaking such things adult-only would have the same effect as with drugs and alcohol and vanilla sex. They’ll still do it, just not safely.",
            "title_similarity": "0.74328053",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h0jb3r9",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jb3rk",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0j8qq7",
            "score": 859,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jmo65",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jpt9v",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jpwm4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jqa93",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0jrya4",
            "score": 3,
            "text": "Imo, most kids these days already have internet access and have seen far worse than a few free boobs or men in leather with ball gags. If my child wishes to go to a pride parade, then I'll give them a bit of a run down of what they're bound to see. If they're still down, no point in preventing it.\n\nAlso, I've been to pride parades as young as 2 years old. I may just be biased, but having a proud lesbian mom will do that.",
            "title_similarity": "0.7590433",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h0juju8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0junqs",
            "score": 3,
            "text": "Somebody I find on social media mentioned having like a \"day\" and \"night\" part of pride. Like during the day, have it be the publicly appropriate version that can include everyone, and then later when the sun goes down, allow anyone and everyone",
            "title_similarity": "0.45341396",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h0jvoqz",
            "score": 2,
            "text": "Sexuality is about sex. I don't think it's possible or desirable to make a demonstration that is about sex safe for under 18s",
            "title_similarity": "0.74548185",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0jzkfk",
            "score": 3,
            "text": "Pride is technically a protest, against standards of morality directly relating to lgbtqia+ and our SEXUALITY. Someone wearing bondage gear is no more a violation of consent then someone wearing a T-shirt that says “fuck your feelings” it’s freedom of expression. If that person is sucking a dick in the street in addition to either of those outfits that’s a violation of consent. Pretending to be a dog? Not a sex act. Some bdsm and kink relationships don’t even involve sex.  Children have been coming to Pride forever and their parents have decided how to explain these things to them. Taboos make people uncomfortable but it’s our job to come for a place of learning and while it may not be what we see reflected with in our selves, we can do better and be more accepting. Being accepted is a PRIVILEGE, as you well know the kink community accepted lgbt people when no one else did. Maybe the queer community should be doing the same.",
            "title_similarity": "0.84212166",
            "sentiment_compound": 0.9459
        },
        {
            "id": "h0k11ak",
            "score": 1,
            "text": "Idk kids these days have access to a lot of shit. Is seeing a guy in leather chaps or wearing a ball gag really gonna scar them for life? I’m seriously asking, obviously no one should be fucking in public at pride we can all agree to that, but I struggle to see what the big deal with kink wear. As long as dicks arent out… can someone explain this to me?",
            "title_similarity": "0.7412507",
            "sentiment_compound": -0.5733
        },
        {
            "id": "h0k14e0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k2zra",
            "score": 4,
            "text": "On one hand I agree with the sentiment, and while I don’t mind seeing it, I understand why others would. On the other, sexuality is about…. Sex. \n\nFor most adults, especially older adults, pride is about being honest in a way that they could not be when they were your age. Being free of that is an amazing feeling. It’s the one day some adults are open\n\nAs for the “Think of the children” remark. if pride where you live is known for kink and public sex, then by showing up you are giving de facto consent to seeing it. There are other prides that do not condone full nudity. Where I live, the most I’ve seen are assless chaps, and there is no sex (the bathhouse is packed though.) There are kink groups advertising for members, but that’s about as far as it goes.\n\n“No one goes to pride to see naked people”. This is false. Many, many people go to pride to see naked people. Many, many people go to cruise. That’s why there are so many naked people having sex.\n\nIn conclusion, the LBGT community is like any other. There are all kinds of view points, and there is no way to accommodate all of them in a single event. Over time you will find your segment of the community. Maybe pride isn’t your jam, maybe it will become your jam later on. To me, pride is about all of the segments coming together to cheer each other on, from the volleyball gays, to the dykes on bikes, to the leather daddies.",
            "title_similarity": "0.6936401",
            "sentiment_compound": 0.9794
        },
        {
            "id": "h0k4hpl",
            "score": 3,
            "text": "I highly recommend this twitter thread [https://twitter.com/vaspider/status/1397709284603879428](https://twitter.com/vaspider/status/1397709284603879428) They go into the founding of pride, difference between pride events (including difference between the 18+ events that exist and other events), and 'consent' surrounding it\n\nYou say your issue is more with public indecency, but what is defined as public indecency? The  1970 Christopher Street Liberation Day March, which is the beginning of what we mostly think of as Pride, came to be (in part) because bars were being raided and shutdown, because cops were arresting people who were dressed as the opposite gender. At the time, it was illegal because it was 'public indecency'. Pride started because it gave people a chance to be who they were in numbers too large for the cops to stop.\n\nFrom the thread:\"Why exactly do we think queer sexuality displays require MORE consent than the hypersaturated cishet sexuality surrounding us like a dank BUYTHISNOW miasma every time we turn on a TV/walk out the door?...The idea that someone wearing a pup mask in public is \\*doing something to you\\* while a woman in a thong bikini is \\*not\\* requires you to be examining the world through the homophobic lenses which society smacks on all of our eyes.\"Why are people at pride more indecent than any gathering at a beach, or a club, or anywhere else that straight people flaunt their sexuality all the time?",
            "title_similarity": "0.6077657",
            "sentiment_compound": 0.9507
        },
        {
            "id": "h0k4wto",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k5g3l",
            "score": 1,
            "text": "where does it stop once you start making rules for people who dont often fit into mainstream society? Only pretty people can attend Pride?",
            "title_similarity": "0.6216599",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h0k5kxu",
            "score": 3,
            "text": "Kink has, for so long, been a central part of the gay community. The freedom to have gay sex gave us the freedom to explore how we like having that sex. No one should be fucking in public, but that’s already illegal, and by all means, NOT unique to gays in the slightest. But kink? Walking around in collars and leather and latex and masks? That’s almost an essential part of gay sexuality. As far as being family friendly, Pride events have no business being family friendly, especially after straights spent so long shutting us out of their families.",
            "title_similarity": "0.88369024",
            "sentiment_compound": 0.8661
        },
        {
            "id": "h0k5r06",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k6g6v",
            "score": 1,
            "text": "I just think that those things shouldn't get you arrested in public in the first place. If someone wants to be naked that's their choice, cmv.",
            "title_similarity": "0.6731744",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h0k6nwk",
            "score": 2,
            "text": "the crux of a lot of complaints throughout time is that you cannot control anything but yourself. \n\nif you go camping in a forest with wildlife, you know there's a chance of encountering them so you take precautions.    \nif you go to a pride parade, you know there's a good chance at seeing things that are inappropriate, so if you want to avoid that, you take precautions.  \n\nIf parents want to take their kids to a pride parade, they should first look into what they can expect based off of previous years, and they should contextualize what their children are likely to see.  \n\nyou should not put the onus of parenting onto strangers celebrating their sexuality.",
            "title_similarity": "0.6878208",
            "sentiment_compound": 0.9568
        },
        {
            "id": "h0k6u8x",
            "score": 1,
            "text": "Pride events are more about recreational sex and therefore should display and promote the tools of the trade whereas unpride/shame life styles are more about family values and should keep sexual explicivity to a minimum.",
            "title_similarity": "0.65914035",
            "sentiment_compound": 0.7884
        },
        {
            "id": "h0k6x38",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0k8yaq",
            "score": 2,
            "text": "This is a **Rules Reminder for All Users.** \n\n---\n\n**All users, (including mods, OP, and commenters) are required to follow the rules of this sub at all times.** If you see a user violate the rules of the sub, please report that comment/post and a human moderator will review it. We understand that some topics posted here may touch on sensitive or contentious issues. We ask that all users **remember the human** and **assume good faith**. \n\n**Notice to all users:**\n\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\n\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \n\n\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\n\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\n\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\n\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.5511733",
            "sentiment_compound": 0.6086
        },
        {
            "id": "h0k8yin",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0ka9k2",
            "score": 1,
            "text": "My two cents is that children should not be at pride. \n\nIf they are old enough to understand sexuality then they should understand.\n\nOr maybe, pride just isnt for kids.",
            "title_similarity": "0.6986333",
            "sentiment_compound": 0.0936
        },
        {
            "id": "h0kaoar",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0kaws4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08341151"
        },
        {
            "id": "h0kfab6",
            "score": 1,
            "text": "If the religious right can put up pictures of dismembered fetuses across from a school, I think BSDM at a pride parade is fine.",
            "title_similarity": "0.5996548",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0kjh2n",
            "score": 2,
            "text": "Does anyone consent to see grotesquely obese, lobster-red shirtless men mowing their lawns in Confederate flag hats? How dare they inflict themselves on their neighbors' eyeballs.  \n\n\nThis \"consent\" argument against kink and/or nudity at Pride makes no sense. Who cares what another person is wearing, if they're not hurting anyone else, ESPECIALLY at something like Pride. It's not supposed to be some corporate-sponsored family fun-fest.",
            "title_similarity": "0.68421286",
            "sentiment_compound": 0.8958
        },
        {
            "id": "h0l7748",
            "score": 1,
            "text": "Dunno what happened to the original, but here's OP's post:\n\n>To start, I am a lesbian. And I've been seeing recent controversy about this topic. \n>\n>Look, no denying that kink plays a big role in the creation of pride. It is a part of embracing sexuality and shouldn't be excluded from the community. \n>\n>However, it should not be at public pride parades. Pride should be for everyone of all ages. Many people say \"stop catering to the straight capitalized ideal of what pride should be\" and \"pride isn't a party, it's a protest don't police us\" and \"children should go to disney if they want family friendly\" This has nothing to do with straight rainbow capitalism. I figured out I was LGBT at age 11 and trust me if I saw a kink act in public I would be kind of disgusted. I'm still a minor now, and I'd be less disgusted but still. I know people say that it's up to you to bring your children to pride, but by making all pride events \"wear whatever you want even if it's nothing\" we are also kinda excluding minors from it. It's also non consensual to anyone who is exposed to such acts, because nobody wants to go to pride to see naked people right? The \"think of the children\" phrase holds true here. Young children and teens embracing their sexuality shouldn't be forced to see adult acts against their will. \n>\n>Again, no denying the role kink plays in the community, but it should be kept at 18+ events. There should definitely be a separate pride for people who just want to do leather and other kinks. That way, you can do whatever you want in a safe space where you know you won't offend others, and because people consented to come to an 18+ event, it's all good. \n>\n>That's just my personal opinion on it, but it seems to be the minority. I'd like to see how you guys think about this.\n>\n>Edit: it appears after reading and responding to several comments, I don't really have a problem with kink, but more with public indecency. I don't care if you wear a collar or leather pants. But I'd rather not see things that could get you arrested or questioned for doing in public.",
            "title_similarity": "0.9570233",
            "sentiment_compound": 0.995
        },
        {
            "id": "h0lrwt8",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0ly8vj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.083411545"
        },
        {
            "id": "h0menzw",
            "score": 1,
            "text": "I disagree. The whole reason pride and gay culture in general has so much sexuality at the forefront is because it’s that aspect of our lives that was attacked. Who we have sex with. And before anyone starts with the “but it’s not about sex! It’s about love!” No it wasn’t. When people were murdering Matthew Shepherd or Harvey Milk or whom ever else, they weren’t thinking “oh gee this guy loves other dudes, what if he wants to love me?” It was for the fucks. It’s the one thing we were all told was special and different about us. Who we are having sex with. Sex isn’t dirty and as long as people aren’t straight up naked AND doin it in the streets there’s nothing wrong. But yes sometimes there is nudity at pride, sometimes there is nudity at other things too like the naked bike riders at solstice. If you think a kid seeing that is some how akin to making them watch porn or molesting them then I guess they can’t ever go swimming either cuz I use to see the dicks swinging there too.",
            "title_similarity": "0.7979044",
            "sentiment_compound": -0.5638
        },
        {
            "id": "h0n309s",
            "score": 1,
            "text": "We already have laws that criminalize indecent exposure or committing sexual acts in public, like oral sex or intercourse. Granted most of those laws were written with vanilla, hetero sex in mind but they still apply to Pride and I don't recall any push to include those acts at Pride.\n\nThe tricky part though comes down to the definition of kink: What is kink, exactly, and where do you draw the line?\n\nFor example, is any leather suit inherently more sexual thank a bikini, even though it might show the same or even less nudity? Is the very sight of a flogger inherently harmful and sexual, or does it have to be used before it becomes indecent? And if we allow performers or attendees to mimic sexual acts at most festivals or raves, why do we draw the line at this mimicry when it involves queer people?\n\nSome jurisdiction allow a higher level of nudity than others, but that isn't specific to Pride: For example, **anyone** can request a nudist permit in San Francisco for **any** event, and it is up to the discretion of city hall to grant it or not. However, even with those permits you are not allowed to perform overt sexual acts and this also applies to Pride.\n\nMy position is that preventing kink and BDSM from Pride, specifically, is useless because any overt sexual acts are already banned and most Pride events don't have an exemption for that, and it's discriminatory because the level of allowed kink activities isn't more overtly sexual than any other vanilla acts that are already allowed in public.",
            "title_similarity": "0.7862462",
            "sentiment_compound": 0.9694
        },
        {
            "id": "h0n31zy",
            "score": 1,
            "text": "What’s the different from other forms of public affection like two people kissing? I think it’s okay as long they are civil and respectful. But I believe that pride events should only express and promote things related with gender and sexual orientation and not kinky stuff.\n\n\nBtw u/akoudagawaismywaifu  serious question, if you are no mature enough to see that kind of stuff, are you mature enough to judge them and know that they shouldn’t be doing them ?",
            "title_similarity": "0.73872626",
            "sentiment_compound": 0.9308
        },
        {
            "id": "h0n3lzw",
            "score": 1,
            "text": "You're saying indecent but you realize that there are people who think two women holding hands or kissing is indecent. If you don't feel comfortable though,  maybe you shouldn't go to pride",
            "title_similarity": "0.63118994",
            "sentiment_compound": -0.0147
        },
        {
            "id": "h0n48v7",
            "score": 1,
            "text": "Sure, now can we focus on potential discrimination from religious employers?",
            "title_similarity": "0.46547025",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0nduxx",
            "score": 3,
            "text": "Im a straight man, but have gone to pride events in the past and may do so in the future to support LGBTQ rights. I don’t particularly want to see or support bdsm or kinky sex practices at all. My opinion is that its none of my business and Im fine with it being yours, but would prefer that kept behind closed doors, where all other sex acts take place, in private. I I would never dream of going to a BDSM or any other kink convention, straight, gay, or what have you. \n\nIm not asking anyone to be anything theyre not, except perhaps appropriate in public. What this means to me is that any act considered acceptable by straight couples in public is totally acceptable by gay couple, or threesomes, etc. But I dont want to see folks waving around dildos, exposing themselves, flaunting whips and collars, or anything overtly sexual from anyone, straight or gay.\n\nI should be able to support LGBTQ rights to not be discriminated against, without witnessing or condoning whatever sex acts happen to get them off. It would also be wonderful for the cause if I felt comfortable bringing children to a PRIDE parade, to teach them about diversity, acceptance, and to hopefully make them comfortable around the LGBTQ community. Whips, chains, and dildos make that difficult to impossible. Its not because you’re gay, its because many of us still think sex should be private. \n\nI get that some may chafe against the idea of catering to a society theyve been oppressed by, but the reality is that there are certain rules to being in public, and its a whole lot easier to defend and support LGBTQs when theyre able to meet basic decency requirements. Id like to support gay marriage, equality at work and elsewhere, trans rights etc., but a hyper sexualized parade doesnt seem like the way to do it.\nAnd maybe thats the whole problem in a nut shell. LGBTQ people are just people, and they have different thoughts, opinions, and priorities about what a PRIDE parade should be. I bet many would agree with me ( its not like the majority of PRIDE marchers are wearing assless chaps), and of course others may insist that they must express themselves sexually in public or theyre being victimized? \n\nI back what I think OP said: have a day time, public, pg-13 parade to celebrate queer identity for everyone. Then, later, have an invite only, no holds barred, no dress code celebration, out of sight of the general public. Not because you should hide your identity, but because as a general rule, society doesnt want people doing kinky sex stuff in public, no matter what the flavor.",
            "title_similarity": "0.85295224",
            "sentiment_compound": 0.9961
        },
        {
            "id": "h0nxbvq",
            "score": 1,
            "text": "I'm from the Netherlands so my cultural norms are shaped by this.  I personally just don't get it why Americans (I assume you are American) are perfectly happy to expose children to highly violent content but sexual content causes anxiety.\n\nIt's not children that are traumatised by seeing people dress up in leather outfits, with whips, collars or other attributes (or whatever you mean with \"kink\") and exposing parts of their body.\n\nIt's you, the adult that is traumatised / disgusted. You're just projecting your own feelings on your children (and they will copy this). Just relax, kids will take the world as it is and will likely not think much of it, if you as a parent don't show a weird reaction.\n\nIf the kids ask you about what is going on, you can always answer in a more general / circumspect way if you don't want to go into certain details.\n\nI also don't think a subjective feeling of disgust is a persuasive argument for banning something.",
            "title_similarity": "0.73792136",
            "sentiment_compound": -0.9604
        },
        {
            "id": "h0o3zmf",
            "score": 1,
            "text": "I’d like to challenge you to becoming more open minded to at least some amount of nudity in (certain environments or) public. What exactly are we protecting children from? Half of them will develop breasts and the other half already have a penis. As a country we are so buttoned up about sex and the human body. It’s natural and we all have it. \nSex in public?? No way, that is absolutely private. But a proud woman flashing her golden globes at an event that is specifically for her to celebrate her pride and freedom? Fuck yeah 🤘",
            "title_similarity": "0.8094207",
            "sentiment_compound": 0.967
        },
        {
            "id": "h0o80gb",
            "score": 1,
            "text": "Honestly if Pride parades had a more classic nuclear family vibe I feel like there would be a whole lot less people out there with a problem with gayness.\n\nInstead of walking around in a jockstrap or pasties. Maybe a casual shirt or a nice dress. Hand holding and “quick” kissing. ( Not face sucking making out)\n\nI mean from my understanding Pride is about your sexuality and not being ashamed of it. Not kinks and fetishes. It’s really hard for some people to change their views. Adding the leather straps and glitter isn’t going to make it any easier.",
            "title_similarity": "0.80718577",
            "sentiment_compound": 0.9673
        },
        {
            "id": "h0ohchx",
            "score": 1,
            "text": "> Look, no denying that kink plays a big role in the creation of pride. It is a part of embracing sexuality and shouldn't be excluded from the community.  \n\nThis is it. This is all of it. You don't get to take the labor of kink activists and then fucking abandon us when we're inconvenient. We're here. We're queer. We're kinky. Get used to it.  \nPride parades don't just show up. People put in the effort to make them and the organizers determine what's allowed.  \nIf you don't like it, organize your own pride event",
            "title_similarity": "0.82849693",
            "sentiment_compound": 0.6877
        },
        {
            "id": "h0oxkum",
            "score": 1,
            "text": "Damn, I was gonna post this!\n\nKink being related to queerness makes no sense to me, honestly.  Kink is statistically practiced mostly by people who identify as straight.  And associating the 2 just proliferates the idea that being queer is somehow sexually deviant.  Does this mean straight people in the BDSM scene are queer?  There are entire parades and festivals just for BDSM.  Humans need to keep it in their pants",
            "title_similarity": "0.8386686",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h0oyatt",
            "score": 1,
            "text": "Your assumption of inappropriate for kids are based on how you experience the world as a kid.  My grandmother thought any PDA was atrocious my parents, not so much. Kids born in the last 10 years are a way more exposed than we were 15-20 years ago. So what you may consider inappropriate was a Tic Tok video viewed by the kids and all their peers the day before.",
            "title_similarity": "0.6419428",
            "sentiment_compound": -0.1513
        },
        {
            "id": "h0pcmqu",
            "score": 1,
            "text": "Well one it’s a public gathering so you’re just pissing in the wind if you expect the public to tip toe around everyone’s feelings. Again it’s public and if you don’t like what you see from a certain individual walk 20 feet to your left or right and you can focus your attention on something less (lack of a better word(s)) “eye soaring” also it sounds like you’re just against any form of nudity within public eye which makes sense to an extent but how the pride parade is you bring so many different people together and different cultures and ways of life that the general idea that everyone is going to be appropriately dressed or wearing “child friendly” attire is the equivalent of going into a mattress store and expecting to come out with a telescope. Though my advice is bc of how sensitive people are today :/ I wouldn’t be yanking chains and calling out bdsm and kink people at this parade mainly because you might receive some not so friendly remarks and if you’re one for being fragile towards confrontation and people speaking their opinions in your face then you might want to check yourself at the door before you end up doing the whole “out of the frying pan and into the fire” dance. If that’s your prerogative and you choose to do such then do what you want because again this is Reddit and I’m just some random giving my advice even if it’s not good advice.",
            "title_similarity": "0.7152146",
            "sentiment_compound": -0.5351
        },
        {
            "id": "h0qsga0",
            "score": 2,
            "text": "I think an 18+ and an 18 under is the best solution. For Mardi Gras, some events and parades are specifically for families and certain activities are not allowed. Other parades are for the grown ups and that's where grownup things happen.   \n\n\nI guess a good rule of thumb about what is acceptable for younger people to see is to imagine it happening in any other possible area of life. Is the specific event or circumstance one that would be deemed inappropriate in any other setting? Or worse, is the event, act, or circumstance one that could actually get someone arrested (exposure to minors, engaging in certain acts in front of a minor, delinquency of a minor, etc) in any other setting? If so, that's where the line is. Those things should be reserved for 18+ events, and as long as 18+ are consenting individuals, I don't really care what else goes on. But if young people are present, then yes, there's a problem.   \n\n\nbtw--nonbinary, queer individual here.",
            "title_similarity": "0.67774713",
            "sentiment_compound": 0.6108
        },
        {
            "id": "h0t93i0",
            "score": 1,
            "text": "Not exactly a contrary opinion but here goes. In recent times it seems that the lgbtquia+ movement has expanded to the point of dilution. There are so many different sects within the same organization that there is bound to be people inside one group who don't agree with the actions or beliefs of another. Speaking anecdotally from my own experiences, lesbian girls that i've been friends with over the years really don't like trans women as they view it as just another guy trying to have sex with girls who don't want to have sex with guys. Ive also noticed that a lot of gay/lesbian people view bisexual people as confused in the same way straight people view gay people as confused. Within this fragmentation there is room for people who are just there in a fetish capacity, EG BDSM, DDLG and other inherently sexual \"ways of life\". IMHO pride and other pro sexual equality movements should distance themselves from these groups as it just dilutes the message of equality and moves it towards a lewd parade instead of a fight for equal rights.",
            "title_similarity": "0.7732918",
            "sentiment_compound": -0.6985
        },
        {
            "id": "h0vp1l0",
            "score": 1,
            "text": "Some people would argue that gay pride parades have no place at all.  Everyone has their own limits as to what’s acceptable.  As a lesbian you should know the pain of being vilified by others for who you are.  So long as nobody is being hurt I don’t understand why you’d be opposed to another group celebrating their sexuality while you celebrate yours.  Kinda hypocritical if you ask me.",
            "title_similarity": "0.8953699",
            "sentiment_compound": -0.228
        },
        {
            "id": "h17d3oy",
            "score": 1,
            "text": "I disagree. The gay community took their power from their promiscuity before AIDS. It was a statement of power and control over their environment. \nThat power created the community that forced a conservative government to finally acknowledge AIDS and start research and treatment. Without the parade being an aggressive, no excuses expression of the identity of the ENTIRE community they could never have joined together to become such a powerful force for change.\nPride parades are an expression and a reminder  of POWER and the ability to control how the government is a SERVANT to the people .",
            "title_similarity": "0.7751832",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1cpba1",
            "score": 1,
            "text": "Based!!!!",
            "title_similarity": "-0.07176584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xw7al",
            "score": 1,
            "text": "I see this comment section and lost hope in humanity 😂😂😂",
            "title_similarity": "0.3431626",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h1y8arp",
            "score": 1,
            "text": "I think it should be in public because wearing leather and wearing bdsm gear doesn't mean you having sex.\n\nAlso, you a stigmatizing a group causing it to become pushed back. We are trying to move the entire movement forward and your pushing people back.\n\nYou can't be part of the lgbtqia group and be pushing people back",
            "title_similarity": "0.84307957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v5cuz",
            "score": 1,
            "text": "Or, alternatively, sex should not be a taboo topic that children aren't allowed to know about.\n\nAlternative plan: let's give children age-appropriate explanations in the home, and then it literally won't matter what they see in pride parades (or wherever else) because they will already know how it works.",
            "title_similarity": "0.7398975",
            "sentiment_compound": 0.3239
        },
        {
            "id": "h3agh8p",
            "score": 1,
            "text": "I feel like had you not said you were lesbian, you would have been downvoted to oblivion, get called homophobic, and then be banned from the sub. Such is the way of Reddit",
            "title_similarity": "0.7656829",
            "sentiment_compound": -0.128
        },
        {
            "id": "h3v9dx1",
            "score": 2,
            "text": "I agree. Keep that in the bedroom, or better yet don’t bring children to a pride event",
            "title_similarity": "0.52164024",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h5q6cpk",
            "score": 1,
            "text": "Had you not mentioned you’re lesbian, Reddit would have torn you to shreds for being “homophobic”",
            "title_similarity": "0.7147472",
            "sentiment_compound": -0.25
        },
        {
            "id": "h7qwveb",
            "score": 1,
            "text": "[Dominant Devil](http://onlyfans.com/dominant.devil)",
            "title_similarity": "0.39179733",
            "sentiment_compound": 0.0
        }
    ]
}