{
    "CMV: Floyd Mayweather fighting Logan Paul diminishes his legacy and minimizes the professional boxing scene\nMayweather, arguably the greatest boxer of all time agreeing to fight someone who not only does not have professional boxing skill, but is kind of known for being an online asshole and entitled YouTuber isn't really a good look. \n\nAs a boxer who went 50-0, and who only fought the best of the best of those who legitimately earned a shot at the top through winning their way to the top, getting in the ring with a random YouTuber (granted a great money play for Mayweather) makes Mayweather seem too accessible. \n\nThis sense of accessibility to someone who didn't \"earn\" it does more to remove the seriousness of his skillset and accomplishments than it does to showcase how great he was and is. \n\nThe combination of all of this has opened up a once previously closed conversation of celebrity boxing where individuals who have otherwise not earned the opportunity are now in the conversation of fighting some of our greatest fighters just simply based on popularity and not skill.": [
        {
            "id": "h0xka2z",
            "score": 1,
            "text": "/u/YakOrnery (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nui9dg/deltas_awarded_in_cmv_floyd_mayweather_fighting/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.45192343",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0xa168",
            "score": 2544,
            "text": "In 2012, Prince Harry beat Usain Bolt in the 100m dash. He only had the opportunity to race Bolt because he's a celebrity/royalty. He won because he had a fast start. It doesn't diminish either of their legacies because the whole thing was clearly just for fun. This \"fight\" between Mayweather and Paul was just a goof. It made a lot of money though sheer hype, but it obviously wasn't a real boxing match. Normally this type of thing is just a goof for charity, but in this case, both fighters kept the money. That part is tacky, but the rest of it is no big deal.",
            "title_similarity": "0.78805125",
            "sentiment_compound": 0.705
        },
        {
            "id": "h0xg4du",
            "score": -3,
            "text": "Ok Skip Bayless",
            "title_similarity": "0.14946724",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0xlkqn",
            "score": 3,
            "text": "Boxing is only about money. It's profile is so low that you can't guarantee any given \"champion\" is even in the top 5 of possible \"best\" boxers because the attention, incentives and general societal consciousness is SO low for boxing in general that the guys who would have been the best are much, MUCH more likely not to have even bothered going into boxing than they would have been 30 or 50 or 100yrs ago.\n\nBoxing is a joke. Mayweather has about the same \"legacy\" as a random Kentucky Derby winner from 5yrs ago. He could fight a kangaroo and encore by boxing two dozen emperor penguins, and it wouldn't change anything.\n\nBoxing isn't a sport. It's a fetish.\n\n[Edit: If you think I'm out of line, just compare NBA annual salary cap, baseball or football payrolls, top contacts in other big sports, etc. to title fight purses over the same period. Boxing is a joke.]",
            "title_similarity": "0.88314164",
            "sentiment_compound": 0.8948
        },
        {
            "id": "h0xlyid",
            "score": 8,
            "text": "This doesn't hurt either Mayweather or boxing because they are both already pretty tarnished. \n\nMayweather is a great defensive boxer and that's just what he did in this fight, he's never been a knockout artist.  On the personal side this fight makes him looks accessible and greedy sure, but everyone already knows he only cares about money, his nickname is literally \"Money\" lol.\n\nAs for boxing, the sport is already in a bad spot, its been loosing all its fans to MMA for a decade or two now.  People said the same thing 5 or 6 years ago when the Mayweather Pacquiao fight happened (that it ruined boxing, and boxing is boring now, ect. ect.).  This fight got people who've never watched a boxing match to watch boxing for the first time... and probably realize how boring it is.\n\nHonestly I see all this hate just as people who don't know much about boxing wanting to see a youtuber they love/hate knock out/get knockedout and being upset because they didn't get what they wanted.",
            "title_similarity": "0.8759388",
            "sentiment_compound": -0.9605
        },
        {
            "id": "h0xe1z9",
            "score": 0,
            "text": "Professional athletes become professional athletes because of hard work, luck and opportunity. The goal is to take a passion and skill set, be successful, and have a *money making* career. Nothing about this event with an influencer undoes any of those things.\n\nYou don’t see Logan as someone who got to his position (able to be in the ring with a legendary champion) because of hard work, luck, and opportunity and yet, that’s what got him there. \n\nCelebrity tournements and events have happened for decades. No one thinks less of the PGA or professional tennis because of it. The only big difference is each person fought and pocketed the money instead of doing it for charity. Since that wasn’t part of your argument, it’s a moot point.",
            "title_similarity": "0.6826986",
            "sentiment_compound": 0.9538
        },
        {
            "id": "h0xj0qm",
            "score": 0,
            "text": "Would you really care about that for 100 mil?",
            "title_similarity": "0.19434023",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h0xksk5",
            "score": 0,
            "text": "the thing that tarnished mayweather's \"legacy\" is that he's a giant piece of shit woman beater.",
            "title_similarity": "0.6209332",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0xldwz",
            "score": 0,
            "text": "Whose going to remember this match in 15 years? My",
            "title_similarity": "0.21396448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10zr9v",
            "score": 0,
            "text": "From anyone who saw the fight, is it true Mayweather could have ended it within a couple rounds?",
            "title_similarity": "0.66583025",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0xo867",
            "score": 18,
            "text": "1. Floyd is not \"arguably the greatest boxer of all-time\". Sugar Ray Robinson is the greatest boxer of all-time. Floyd is arguably top 20. Most Boxing heads have him between 20-30. Boxing is a 120 year old sport with guys far more accomplished than Mayweather. Roberto Duran, Sugar Ray Leonard, Harry Greb, Muhammad Ali, Sweat Pea Whitaker, Joe Louis, Willie Pep, Julio Cesar Chavez who was like 100-0 before he lost. Ect ect\n2. Boxing exhibitions are nothing new. Ali fought a Japanese martial artist and got his legs shredded for his troubles. Larry Holmes fought Butterbean. Oscar De La Hoya fought Shaq so did Mosley. Boxers are prize fighters after their careers are over there are only so many avenues to earn pay day and thats usually silly exhibitions fighting no hopers\n3. 3.. Mayweather legacy is completely intact no matter what he does in retirement. You are taking his 5 championships in 5 weight divisions, 20+ title defenses away. You arent taking his victories over Jose Corrales, Juan Castillo, Ricky Hatton, Arturo Gatti, Oscar De La Hoya, Shane Mosley, Pacquiao ect ect away from him. Whatever Floyd Mayweather does to play around in retirement has no bearing on his fabulous boxing career.",
            "title_similarity": "0.84280205",
            "sentiment_compound": 0.8299
        },
        {
            "id": "h0xjq79",
            "score": 1,
            "text": "You might care about his legacy, and this might, indeed, diminishes it, but as he himself put it: \"They call me \"money\" because legacy won't feed my kids\" (or something like that).",
            "title_similarity": "0.6271718",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h0xjqpx",
            "score": 1,
            "text": "Mayweather’s legacy as a fighter is still intact, but ur definitely right in that he as a superstar, has been pretty much the worst thing for the sport of boxing ever. Inflated ppv’s for shit fights",
            "title_similarity": "0.8675097",
            "sentiment_compound": -0.7615
        },
        {
            "id": "h0xk1d8",
            "score": 1,
            "text": "Omg exhibition matches happen all the time \nMuhammad Ali did one against a wrestler . It's nothing new. You're just making a big deal out of it and I'm pretty sure Floyd cares more about money then his legacy",
            "title_similarity": "0.7736068",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0xl5bv",
            "score": 1,
            "text": "I don't think this move has made anyone consider Mayweather less skilled or less of a GOAT so I think his legacy overall is intact just fine. Everyone I know sees this as the equivalent of having a high school MVP play Michael Jordon in a pick up game and can tell that Mayweather is doing this for an easy payday.",
            "title_similarity": "0.60048133",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0x85jr",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.05570983"
        },
        {
            "id": "h0xahwi",
            "score": 2,
            "text": "The more you pay attention to the bullshit the more they’re going to do it. People like watching someone arrogant go and fight someone who is a legend and I believe it’s all a big game anyway. The night will pass people will eventually forget when you tubers keep this trend and pro boxing will still go on.",
            "title_similarity": "0.7995777",
            "sentiment_compound": -0.8651
        },
        {
            "id": "h0xdu3a",
            "score": -2,
            "text": "The only thing more pathetic than fighting Logan Paul would be living your life according the the sensibilities of reddit.",
            "title_similarity": "0.65178037",
            "sentiment_compound": -0.7755
        },
        {
            "id": "h0xkwi9",
            "score": 2,
            "text": "First of all, I don't understand why everyone is up in arms about this. Mayweather is retired from being a real boxer. This wasn't real boxing. This was just a hyped up spectacle. Plenty of retired athletes do all sorts of dumb shit for money and it doesn't impact their legacy. I think it was a genuine curiosity.\n\nMy only real criticism is that Mayweather is the worst possible fighter for this. I'm no boxing expert, but I watched a lot of those Mayweather fights. He's never going to commit to the square off and start throwing haymakers type of fight that this spectacle deserved. Obviously we were all hoping to see Logan Paul get the ever living shit kicked out of him, and that's just not Mayweather's thing.",
            "title_similarity": "0.88318276",
            "sentiment_compound": -0.9567
        },
        {
            "id": "h0xajyu",
            "score": 125,
            "text": "I don't think it tarnishes his legacy as much as you think it does. It's easy to say these things in the immediate aftermath, but the reality is that his legacy will be somewhat untouched 10 years from now. It's the same way people talk about basketball players at the end of their careers. It may seem like a few bad years at the age of 38-40 will ruin their legacy, but the reality is that people tend to treat these things as blips on the radar once there's some separation from it.\n\nI'd also argue that this is the logical endpoint for a sport that bases fighter salary around a mix of marketability and skill. At the end of the day, a boxer's salary is somewhat divorced from their true skill level. I suppose pride is part of the equation, but it would be hard for me to turn down the ability to make an easy 100 million dollars too.",
            "title_similarity": "0.6723155",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h0xaeyw",
            "score": 81,
            "text": "I'm not gonna argue on Mayweather's legacy as I'm not someone who follows boxing much.\n\nBut I seriously disagree it minimized the pro boxing scene as a whole. There are thousands of people who have never watched professional boxing a day in their life who purchased a PPV because a social media guy was fighting a real boxer. They then got exposed to real boxing through the other matches on the card. They saw plenty of real, legitimate boxing that night. Someone like Jack the Ripper, who went right before the main event, just got more exposure than he'd ever get otherwise.\n\nAlso, Mayweather fought extremely defensively, as he has the past 25+ fights. He has had few knockouts in his last 20, most of them go to decisions. People were disappointed that the boxing fight didn't end in a knockout, but those people are (like me) not big boxing fans and think boxing *should* be all about knockouts. If the sport has evolved in such a way that even an all-time great can't put down an amateur social media villain with his fists, the sport was \"broken\" before the fight was ever booked.",
            "title_similarity": "0.85346943",
            "sentiment_compound": -0.9759
        },
        {
            "id": "h0xa40f",
            "score": 14,
            "text": "> CMV: Floyd Mayweather fighting Logan Paul diminishes his legacy and minimizes the professional boxing scene\n\nIsn’t his legacy one of the GOATs? Do you still think this? If so, how is it diminished?\n\nAs far as the boxing scene, isn’t the fact that people saw it growing the scene instead of shrinking it?",
            "title_similarity": "0.7726522",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h0xhlt4",
            "score": 5,
            "text": "First, a month from now, people talking about Mayweather will barely mention Paul’s name. Anyone who respects the boxer and athlete that he was, will still hold that respect. “Best defensive boxer and arguably greatest boxer of all time” are not likely to have a caveat as “also had a corny fight for millions”. This may not be self evident so I’ll address your point on accessibility.\n\nFighting Logan Paul does nothing to make weather seem accessible. Logan Paul has more access than 99% of people on this planet. He’s insanely famous, wealthy, and (unfortunately) influential. Saying this makes him too accessible is like saying “Now anyone with $50 million can fight Mayweather” which is a pretty exclusive group.\n\nThe fights corny. I wish he didn’t take it but only because I was disappointed in myself for thinking he might actually make it interesting. But I don’t think his legacy is affected",
            "title_similarity": "0.806737",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0xo2pt",
            "score": 71,
            "text": "This statement is only true if you believe all of the following. \n\n1. The fairytale of boxing being the noblest and least corrupt sport ever created was violated by this event. \n2. All of Mayweather’s other fights were top tier in the peak of their prime contenders or champions.\n3. Mayweaters legacy is directly tied to having a 100% pure record without a single blemish, record padder, tune-up, or cash grab along the way. \n4. The legacy of a sport (boxing) that predates the Olympics is directly and inexorably tied to the actions of a 5’8” 150 lbs man born in Michigan in 1977. \n5. That being “accessible” as a champion fighter is a bad thing despite John L Sullivan being wield famous for his take-all-comers approach to fighting. If you don’t know the Great John L then I can’t help you and you have no business discussing the “legacy of boxing.”\n6. That all the time and effort Paul spent developing his fan base, brand, and marketing expertise wasn’t him earning his place in this exhibition event. \n7. That this exhibition event was somehow unique and unprecedented in the history of boxing or at the very least on another level to the idea of a champion boxer getting in the ring with professional wrestlers (the fake kind) like Ali and Tyson were known for. \n8. That getting shots at major fights wasn’t a popularity contest all along or at least partially so. \n9. That this event was in any way anything more than an exhibition fight between two businessmen wanting to please both of their considerable fan bases and make money. \n\nTLDR: this is what boxing always has been. It’s not new. From John L Sullivan, to Ali, to Tyson boxers have taken part in events exactly like this one. So either the legacy of boxing was already tarnished or t never existed in the first place.",
            "title_similarity": "0.78674877",
            "sentiment_compound": 0.976
        },
        {
            "id": "h0xbz1z",
            "score": 7,
            "text": "The thing that you're forgetting is money. They did it for money.\n\nAlso I for one am totally in support of \"public physical abuse of celebrities, the sport\". The less they earn their spot in the fight by being qualified boxers, the better",
            "title_similarity": "0.7778754",
            "sentiment_compound": -0.2315
        },
        {
            "id": "h0xiys9",
            "score": 29,
            "text": "Did punching his wife diminish Mayweather's legacy?",
            "title_similarity": "0.62921387",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0xi1j7",
            "score": 1829,
            "text": "Well, where do we begin?\n\n1. It wasn't a sanctioned fight.  He could have brought a llama into the ring and hump Logan Paul's leg.  Logan Paul could have skydived in with a chainsaw.\n2. They are completely different weight classes.  Mayweather would never fight in the 185lb weight class.  Logan Paul wouldn't last 4 rounds in the 185lb weight class.  He is fighting a 150lb person in an exhibition.\n3. Floyd Mayweather is a celebrity.  Part of his job is to be accessible for exhibitions and other non-contract events.  He is an autonomous being who is capable of making his own decisions.  This is a decision he made.\n4. Any celebrity is allowed to fight any other celebrity.  There is nothing preventing ANY two people (celebrity or not) from boxing each other in a legally-governed match\n5. Floyd Mayweather is also an entitled asshole.  He, Conor McGregor, and Logan Paul should have a 3-way orgy of their entitlement.  They can do coke off of each other's dicks for all we care.",
            "title_similarity": "0.80775774",
            "sentiment_compound": 0.8096
        },
        {
            "id": "h0xhzwd",
            "score": 29,
            "text": ">As a boxer who ... only fought the best of the best of those who legitimately earned a shot at the top through winning their way to the top\n\nYou might want to learn more about boxing.",
            "title_similarity": "0.79699636",
            "sentiment_compound": 0.9246
        },
        {
            "id": "h0xg7uo",
            "score": 33,
            "text": "Who cares how accessible Mayweather is?  He's retired. This fight doesn't change his 50-0 record. This wasn't a title fight.   It wasn't even a sanctioned boxing match. It was an exhibition match. This fight is no different than if he were to dress up as Ronald McDonald and go 8 rounds with The Hamburglar. \n  \nIf anything, it gets more people talking about the sport of boxing, which is good for the sport.",
            "title_similarity": "0.8278769",
            "sentiment_compound": -0.0299
        },
        {
            "id": "h0xirn5",
            "score": 231,
            "text": "This was an Exhibition match, it was not counted on their records. If it was, I might've agreed with you. So I don't what legacy you're talking about. Also Ali and others in the past fought people equally outrageous as Exhibition matches. Their legacies haven't been tarnished at all and have instead either been more or less forgotten(their exhibitions) or have made them far more interesting.",
            "title_similarity": "0.7272992",
            "sentiment_compound": -0.0534
        },
        {
            "id": "h0xgzkq",
            "score": 751,
            "text": "It's funny you think Floyd shouldn't assoiciate with an \"online asshole\" like Logan Paul when, outside the ring, he's well known for beating the shit out of various women, and has even done time for it. \n\nNot doubting Logan Paul is an obnoxious person but Mayweather is a serious piece of shit.",
            "title_similarity": "0.8042914",
            "sentiment_compound": -0.4735
        },
        {
            "id": "h0xbrlj",
            "score": 42,
            "text": "It only diminishes his legacy if for some reason you thought it was an actual fight. The event was an exhibition.",
            "title_similarity": "0.6375729",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0xhvhs",
            "score": 21,
            "text": "Remember that time Muhammed Ali fought a Japanese professional wrestler?  No one will remember or care about one little joke fight in a few years.",
            "title_similarity": "0.659955",
            "sentiment_compound": -0.1815
        },
        {
            "id": "h0xm5zb",
            "score": 1,
            "text": "So boxing is out of my wheelhouse, but I’m a huge hip hop head and I’ll speak from that area. Discussions about who’s the greatest of all time are super common and there are a ton of arguments to be made. A lot of the greats who were huge in their early days are still making music but to a much less calibre. Should artists like Eminem, Jay-Z, Nas, and Kanye West all have less standing due to bad albums they released later in their careers? I would argue no, and I think most people would too. Even though Eminem dropped hot garbage like Revival, he’s the top selling rapper of all time and still has unprecedented story telling abilities and rhyme schemes. Even though Kanye West has fallen off the wagon and released a godawful half assed gospel album, he’s one of the greatest producers ever in hip hop and has inspired the majority of popular rappers. While newer output can change who’s the greatest in the game *right now* I don’t think it can affect legacy at all",
            "title_similarity": "0.80021477",
            "sentiment_compound": 0.9884
        },
        {
            "id": "h0xma8s",
            "score": 1,
            "text": "Also, it's hard to care about someone's legacy who's picked and chose their way to a 50-0 record, tactfully avoiding any major or difficult fights which may destroy his legacy.",
            "title_similarity": "0.6800444",
            "sentiment_compound": -0.8335
        },
        {
            "id": "h0xmffn",
            "score": 1,
            "text": "Shud of knocked him out not mess around.\nRidiculous match.",
            "title_similarity": "0.6650445",
            "sentiment_compound": 0.4973
        },
        {
            "id": "h0xmi4m",
            "score": 1,
            "text": "It's an exhibition match. It's not meant to be a serious match between the best. It's just a show for money and press. It doesn't tarnish his reputation any more than if a NBA Allstar played ball with some college all Stars.",
            "title_similarity": "0.6302506",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0xmltj",
            "score": 1,
            "text": "Mayweather is 44. That's a retired boxer. Nothing he can do at this point affects his legacy.. well accept if has more issues with abusing women. He'd still be a great boxer though",
            "title_similarity": "0.7759619",
            "sentiment_compound": 0.6743
        },
        {
            "id": "h0xmwij",
            "score": 1,
            "text": "What about the old soccer players that go back on the field with 40+ and play other legends? Are they destroying the sport? \n\nFloyds and Mayweathers job has always been to entertain people. And they tried to do so. Tbh the fight was boring, but w/e. \n\nI can simply not understand why some people seem to have issues with everything that happens on this planet. Put your energy into a good career or family... >.< I bet you would be the first guy on this planet that enters the ring for 100 million dollars. \nAnd to be fair, if you would not do it, you are not smart at all.",
            "title_similarity": "0.7988901",
            "sentiment_compound": 0.5958
        },
        {
            "id": "h0xmxqz",
            "score": 1,
            "text": "There is nothing to change here. This is a perfectly legitimate opinion. A youtuber had a bigger payday boxing then most professional boxers will ever see. For a sport that was already staring into the precipice of being completely out of the mainstream this hurts it more with boxing purists and doesn't really help it with people who were not into boxing in the first place.",
            "title_similarity": "0.84459877",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0xmzyb",
            "score": 1,
            "text": "Cant blame Floyd for going and making 50-100 mil in one night. What is he supposed to do, decline it?",
            "title_similarity": "0.6492659",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h0xn0sl",
            "score": 1,
            "text": "If Hashtag United got promoted to the Premier League, and played Man United/Liverpool ect, would minimize football?\n\nAs someone OOTL with no interest in boxing, if Logan Paul is trying to become a boxer, hes entitled to fight whoever he wants to fight, Exhibition or League (idk what Boxing calls its real competitive fights). It would be the same as Hashtag United playing Man United in a friendly: as long as both teams agree to it, theres no problem.",
            "title_similarity": "0.80652153",
            "sentiment_compound": 0.9243
        },
        {
            "id": "h0xn163",
            "score": 1,
            "text": "First, as many said, it wasnt a formal fight, but an exhibition.\n\n2nd, and this is the important point. Boxing as a sport, is mostly for entertainment and profit. Championships ect, are just marketing tools to create suspense and excitements towards the match.\n\nBoxers are money driven, non of them would enter the ring for free.\n\nMayweather's reputation still holds solid, he's still a champ, and now, he got paid a huge amount for fighting Paul, who is a whole weight class above him.",
            "title_similarity": "0.8231025",
            "sentiment_compound": 0.9853
        },
        {
            "id": "h0xnp1a",
            "score": 1,
            "text": "1.  Fighting Logan Paul doesn't undo anything Mayweather did in his career.\n2. Muhammed Ali also fought gimmicky exhibition matches including an 8 round draw against an NFL player and a 3 round draw against an NHL player.  Does anyone question his legacy because of this?",
            "title_similarity": "0.71652734",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0xnuwt",
            "score": 1,
            "text": "Got your hat!",
            "title_similarity": "-0.09072654",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0xomng",
            "score": 1,
            "text": "I think his legacy is about making money, and he is proud he made more of it!",
            "title_similarity": "0.39510614",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h0xouca",
            "score": 1,
            "text": ">arguably the greatest boxer of all time\n\nThere are MUCH better fighters with MUCH better records.\n\n>makes Mayweather seem too accessible.\n\nThe rules were changed so it was nothing like a title fight. The point of an exhibition is to amuse the fans and answer those \"what-if\" scenarios. Also to make money.\n\n>diminishes his legacy\n\nIt adds to his legacy. How is it different from MLB players playing a game with the local little league team?\n\n>minimizes the professional boxing scene\n\nMinimize means to reduce to the smallest possible amount. Mayweather isn't the end all, be all or boxing, and he is retired. There is way more to pro boxing than one man and one fight.",
            "title_similarity": "0.8584132",
            "sentiment_compound": 0.7176
        },
        {
            "id": "h0xp284",
            "score": 1,
            "text": "How do you feel about Muhammed Ali fighting a pro wrestler, Antonio Inoki, under mixed (and very sketchy/questionable) rules? Do you think that diminished Ali's legacy in the fight game?",
            "title_similarity": "0.7618119",
            "sentiment_compound": -0.6662
        },
        {
            "id": "h0xp2w9",
            "score": 1,
            "text": "I think if you had the chance to make 100 million for doing basically nothing then you would do it. You know these guys made virtually nothing coming up through the ranks. To get to the point where you can make this money is a privilege and he would be stupid to turn it down. His boxing record speaks for itself the guy is a god his fights are a masterclass and that will never change true boxing fans know hate him or love him Mayweather is one of the best.",
            "title_similarity": "0.8099452",
            "sentiment_compound": 0.4344
        },
        {
            "id": "h0xp7or",
            "score": 1,
            "text": "I definitely see boxing as a WWE/WWF offshoot now. Shit's fake.",
            "title_similarity": "0.6798898",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0xpede",
            "score": 1,
            "text": "Not like he had a legacy of being a smart nice guy.",
            "title_similarity": "0.4264374",
            "sentiment_compound": 0.5252
        },
        {
            "id": "h0xpf7g",
            "score": 1,
            "text": "Counterarguments:\n\n> Floyd Mayweather fighting Logan Paul diminishes his legacy\n\nMayweather already had a reputation as a defensive fighter with boring, disappointing fights (from fans who like to see knockouts).\n\n> minimizes the professional boxing scene\n\nI'll argue that the pro boxing scene is already a mess. Perhaps these kinds of farces will motivate pro boxers and promoters to improve their product since they will be losing market share to youtubers instead of actually skilled boxers. So in the long run, it may help pro boxing.",
            "title_similarity": "0.88562286",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0xpoc9",
            "score": 1,
            "text": "Am I massive combat sports fan. Completely agree with this.",
            "title_similarity": "0.42621455",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h0xpse4",
            "score": 1,
            "text": "People do all kinds of stuff they wouldn't otherwise do when they get paid.",
            "title_similarity": "0.33706942",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0xpwfh",
            "score": 1,
            "text": "These are actually the fights people are paying to see. Boxer versus boxer isn't a big cash grab anymore. If it weren't for this kind of stunt then boxing would be dying.",
            "title_similarity": "0.79061043",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0xq1hc",
            "score": 1,
            "text": "Honestly people like me who aren’t boxing fans don’t find out that much about boxing on the regular. I looked into this fight because my husband mentioned it and it sounded silly, and then I looked up Logan Paul and thought, “Oh, he has a really punchable face.” (No shade, it happens). Then I wondered HOW punchable it was, and how this would affect a boxing match, so much so that I set an alarm to wake up in the middle of the night to find out the (obvious) results, and I also learned through this that Mayweather is 50-0 which is AMAZING! So from here, it seems like it just gave non boxing fans a reason to get excited about it, and real boxing fans mostly see it as just a show.    \n     \nEdit: welp, because nothing is allowed to be fun, looking into Mayweather led me to information about his domestic abuse arrests/convictions, and I firmly believe that beating a woman *in front of her children* is reprehensible and gross, so I can no longer even try to change your view. I would not have known that had it not been for this fight. So for me, his legacy did get kinda messed up by it.",
            "title_similarity": "0.8413748",
            "sentiment_compound": -0.6404
        },
        {
            "id": "h0xq858",
            "score": 1,
            "text": "I think you might be conflating \"Floyd Mayweather tarnishing his legacy\" with \"Floyd Mayweather handing a win-win scenario to someone everyone hates.\" It was an exhibition match, and at the end of the day, Mayweather v Paul not likely to get more than a passing mention when anyone discusses his legacy as a boxer. Meanwhile, Paul had basically a small handful of winning outcomes: he gets lucky and wins, the most straightforward 'win'; he gets beaten, and can say \"of course I lost, it's Mayweather\" and still comes out with millions of dollars; or he goes the distance as he did, in which case he can say he went the distance against Mayweather. All of the above come with a gigantic paycheck. At the end of the day, this match was certainly far more beneficial to Paul than it was to Mayweather, but seeing as this isn't a zero-sum game, the only mark this left on Mayweather's reputation comes from the fact that he didn't knock Paul out like everyone wanted. I wouldn't call that a tarnished legacy, especially considering this isn't all that different from the McGregor fight, which we can all agree didn't affect his legacy either. The time he fights a cocky celebrity, we will all still be excited to see them lose all the same.",
            "title_similarity": "0.87058544",
            "sentiment_compound": 0.5626
        },
        {
            "id": "h0xq8rh",
            "score": 1,
            "text": ">getting in the ring with a random YouTuber (granted a great money play for Mayweather) makes Mayweather seem too accessible. \n\nI would argue this paints him exactly as accessible he is when you have money to give him.",
            "title_similarity": "0.72035336",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0xqd4q",
            "score": 1,
            "text": "I think him being an arrogant abusive shit weed should be more of a blot on his legacy but hey. That's just me.",
            "title_similarity": "0.64034104",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h0xrnun",
            "score": 1,
            "text": "This was paid entertainment not real boxing. His legacy may be damaged and Mayweather addressed this after the show - *his kids can't eat legacy* (something to that effect). I think this introduced more people to the sport and may in the long run help it more than hurt it. Boxing has been in decline and I think more people would now watch a professional match after this introduction to the sport.   \n   \nI do think if this trend continues and boxing becomes a circus (think WWE) then yes it will minimize the sport and make it much less than what it is today.",
            "title_similarity": "0.7876216",
            "sentiment_compound": 0.1585
        },
        {
            "id": "h0xrqea",
            "score": 1,
            "text": "You try turning down $50M - it’s like Michael Caine said about his worst film - “ [on Jaws: The Revenge (1987)] I have never seen it, but by all accounts it is terrible. However, I have seen the house that it built, and it is terrific.”\n\nNothing changes his impeccable record and if anything he quit professionally at the top of his game rather than like Ali or Tyson boxing past his prime. This way he stays in the spotlight, stays in shape and gets paid a fortune in the process. Win win win win.",
            "title_similarity": "0.8379508",
            "sentiment_compound": 0.9686
        },
        {
            "id": "h0xsla2",
            "score": 1,
            "text": "It was an exhibition match.  These types of matches have gone on for a long time.  They didnt destroy the sport then and wont now.  \n\nBoxong the last two decades has been stagnent.  While I dont care to watch these exhibitions from the paul brothers, it has brought new viewers.  Something pro boxing hasnt been able to do since MMA became mainstream.\n\nhttps://en.m.wikipedia.org/wiki/Exhibition_fight",
            "title_similarity": "0.7422015",
            "sentiment_compound": 0.0572
        },
        {
            "id": "h0xspuf",
            "score": 3,
            "text": "It was an exhibition doofus. If you watched it thinking there would be a winner then you’re actually dumb lol. \n\nIt doesn’t hurt his legacy. He didn’t lose, and he’s done exhibitions like this before. \n\nJust because the internet liked to hate Paul for no reason, doesn’t mean the event wasn’t entertaining. These guys have an ungodly amount of people who want them to box and will watch it. They capitalized and made money. \n\nAnd hate to break it to you Bucko, but most fights happen because a guy like Floyd with huge power in boxing chooses who he fights. Are you trying to insinuate Floyd never fought tomato cans? Just because they were promoted as a “boxer”? \n\nFloyd is not “accessible”. You underestimate how many people tune in to watch the Paul’s man. Floyd took an opportunity to make a shit ton of money in a fight he knew would have no winner. I’m sure he’s real upset today looking at his bank account. \n\nWhat, do you think Floyd is now forced to fight someone else to prove himself? Haha I love how you point out his perfect record and how he “fought the best of the best” yet since he fought Paul, all this shit he “proved” to you went out the window. 😂 yeah ok",
            "title_similarity": "0.84640163",
            "sentiment_compound": 0.8733
        },
        {
            "id": "h0xszyd",
            "score": 1,
            "text": "I mean, boxing is basically just a money making fixed fight engine designed for the profit of the owners at the expense of lives.\n\nMayweather can barely read and I'd be surprised if he wasnt spazing out by 50. Boxings only legacy is exploitation and corruption. \n\nIf a dude wants to make 20 million dollars for an afternoon's work, let him. Doesnt diminish anything. Boxing, the organization, has no good legacy. \n\nAnyone who is smart enough to realize the genius move Mayweather pulled to get that money should respect him more after this, not less.",
            "title_similarity": "0.847641",
            "sentiment_compound": 0.6802
        },
        {
            "id": "h0xtixx",
            "score": 1,
            "text": "Like Mayweather gives a fuck about that as he dives into his Scrooge McDuck money pool.",
            "title_similarity": "0.6327013",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0xtyxd",
            "score": 1,
            "text": "In the end, they're both just entertainers. That's it. This is just silly fun entertainment. It's not even a real match. It's exhibition. Just entertaining the masses for money. Saying this is ruining his legacy is like saying Daniel Day-Lewis shouldn't do a silly comedy with Shaq because it will ruin his legacy as an actor. Fuck that noise, make that silly comedy with that celebrity who can't act for shit if you want to. No one should take it seriously. Not everything needs to be serious.",
            "title_similarity": "0.75801",
            "sentiment_compound": 0.81
        },
        {
            "id": "h0xuwzo",
            "score": 1,
            "text": "Would you be making a post and spreading awareness about Mayweather being the best boxer in history if he never agreed to the fight?",
            "title_similarity": "0.7933097",
            "sentiment_compound": 0.1989
        },
        {
            "id": "h0xvada",
            "score": 1,
            "text": ">granted a great money play for Mayweather\n\nIn the end, that's all he really cares about.  Heck, it's literally his nickname:  Floyd \"Money\" Mayweather.\n\nWe're talking about a guy who literally never wears the same pair of shoes twice.  I wish I was kidding - every time he puts on shoes, he's taking a brand new pair out of the box.",
            "title_similarity": "0.7316315",
            "sentiment_compound": 0.9312
        },
        {
            "id": "h0xvplx",
            "score": 1,
            "text": "Let’s be honest. Those two douche canoes care about nothing but themselves. Mayweather is an illiterate and entitled asshole that will do anything to make a buck, and he’s good at getting eyes on him. No doubt. Neither has an honest or caring bone in their bodies and they don’t care about anything but the bottom dollar and attention.",
            "title_similarity": "0.720097",
            "sentiment_compound": 0.9394
        },
        {
            "id": "h0xvwys",
            "score": 1,
            "text": "HE called the fight legalized bank robbery. \n\nIt was not an official fight and look at the weight difference. \n\nIm amazed Paul even lasted as long as he did. He looked gassed after two rounds.",
            "title_similarity": "0.76027954",
            "sentiment_compound": 0.4184
        },
        {
            "id": "h0xwxl9",
            "score": 2,
            "text": "Mayweather would not fight me or you. He ‘fought’ Paul because of the audience he brought & the money the fight generated. It was an exhibition & should be treated as such. \n\nIt’s similar in reasoning as to why Floyd could be selective in his choice of opponents later in his career. Matchmaking in boxing is a skill & Floyd was very good at it. He usually wanted a fighter coming off a signature win who could be hyped as the next ‘big threat’, where in reality he was leagues above most fighters. Paul could generate a lot of money due to his following & Floyd clearly saw it as a risk worth taking. That’s why they fought. In reality, there are very, very few other people who Floyd would entertain in this scenario. \n\nIn a greater sense, the ‘celebrity fight scene’ is high risk, but could be a good thing for boxing. If a top fighter loses to a relatively novice celebrity, that could delegitimise the sports. I see that as unlikely, due to the skillset attained by high level boxers. If this scene brings more young fans into boxing I think that’s a good thing.",
            "title_similarity": "0.81944966",
            "sentiment_compound": 0.907
        },
        {
            "id": "h0xx2so",
            "score": 1,
            "text": "I mean, Floyd Mayweather isn't the greatest boxer ever, that title belongs firmly (not so firm anymore) in the hands of Muhammad Ali",
            "title_similarity": "0.7628705",
            "sentiment_compound": -0.5216
        },
        {
            "id": "h0xxwih",
            "score": 1,
            "text": "Floyd is 50-0, World Champion. Let that sink in. He competed at the highest level for decades, while he put his body through punishment 99% of the world will never experience. You grossly underestimate the amount of talent and hard work required to achieve that. Quite frankly, it’s disrespectful to weigh-in on one “exhibition” (we knew was for entertainment, and he didn’t lose) and claim that his legacy is tarnished. I do not believe you are a boxing fan. \n\nThis is like criticizing Michael Jordan or LeBron James for playing in a 1-on-1 at one of their summer basketball camps for kids.",
            "title_similarity": "0.8575053",
            "sentiment_compound": 0.6971
        },
        {
            "id": "h0xy451",
            "score": 1,
            "text": "I'm going to argue your point... kind of. \n\nRather than to argue that he diminished his legacy by fighting Logan Paul, I'm going to argue his legacy was always diminished. Mayweather has consistently only picked sure wins rather than competitive fights. Muhammad Ali will always be the better boxer because he fought genuine talent, and he adapted his fighting style to defeat his opponents and if he lost, he returned and beat them (Joe Frazier). Floyd Mayweather only took fights that were a sure win, he rarely ever took a fight against a worthy opponent, he even avoided boxing Pacquiao, who is widely believed to have been the better boxer, until later in his career and when he was out of his prime. \n\nHe also tarnished his legacy when he agreed to fight McGregor. McGregor was never going to be able to beat Mayweather in a boxing match, it was a money grab.",
            "title_similarity": "0.83587444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0xz418",
            "score": 1,
            "text": "Everybody wants to beat this shit out of Paul. Mayweather is actually doing it.\n\nMayweather is doing the world a favor.",
            "title_similarity": "0.63771635",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h0xz94y",
            "score": 1,
            "text": "NBD The history or Boxing is full of events like these",
            "title_similarity": "0.4600855",
            "sentiment_compound": 0.6739
        },
        {
            "id": "h0xzcxp",
            "score": 1,
            "text": "It's not that deep - if Floyd was still in the rankings and still competing to hold his belts, it would be understandable as he'd be directly taking an opportunity away from someone who would otherwise be in a position to fight him (within the grounds of the rankings). \n\nThis was nothing more than a spectacle and in some regards it brings the younger generation - a generation which doesn't engage much with present day boxing into the scenes. \n\nIf unranked celebrities were fighting for commissioned belts then yes, it's ludicrous and criminal. \n\nIf it's for nothing more than a spectacle, then so be it. \n\nBoxing exhibitions have been a thing for almost as long as the sport itself, we've just not been exposed to it until the recent rise of YouTube 'boxing'. \n\nIt isn't about 'earning it' if both sides are doing it for an exhibition and both mutually agree.",
            "title_similarity": "0.8529091",
            "sentiment_compound": -0.5878
        },
        {
            "id": "h0xzg57",
            "score": 1,
            "text": "I know a lot of people are saying this but it is an exhibition. The only people taking it seriously are Logan’s fans (not shitting on them here) but they are 12-14 y/o. No boxing fan is looking at this and thinking there is any sort of real fight, hell there isn’t even judges according to the rules put into place.",
            "title_similarity": "0.73913586",
            "sentiment_compound": -0.9386
        },
        {
            "id": "h0xzuhw",
            "score": 1,
            "text": "He's basically just a celebrity boxer since his retirement.",
            "title_similarity": "0.6064992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0y00vx",
            "score": 1,
            "text": "I feel like capitalist realism and pastiche are very relevant here. Over time, every aspect of society gets homogenized, weakened and watered down. Commodification,if allowed to run its course, kills art and excitement.\nFloyd does have a point when he says that children cannot eat legacy.",
            "title_similarity": "0.6588321",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0y12y7",
            "score": 1,
            "text": "Well honestly it's 2021 and the \"legacy\" of entitled assholes who punch each other in the head isn't something I spend much time worrying about.",
            "title_similarity": "0.65724707",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0y136l",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09297399"
        },
        {
            "id": "h0y16w6",
            "score": 1,
            "text": "Just think of it as a really good actor, starring in a really bad movie.",
            "title_similarity": "0.590736",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0y2439",
            "score": 1,
            "text": "Imo it made him seem more human. The dude is beyond rich and still willing to fight this kid just to help him start his boxing career. People are saying Logan just surviving is an accomplishment but mayweather made the comment that Logan wouldn’t survive vs guys his size which seems true. \n\nMayweather was never a mike Tyson. He’s always been a business man that used boxing, his promo company and his managers to make huge money on fights he’s always had a high probability to win. Can’t blame him for this. This stuff just makes him seem smarter",
            "title_similarity": "0.8207017",
            "sentiment_compound": 0.8968
        },
        {
            "id": "h0y2nkz",
            "score": 1,
            "text": "Dude if I could make, what was it Mayweather made, 100 mil? I would do it in a heartbeat. Don’t get me wrong, that fact that this fight actually happened is beyond stupid, but damn if I wouldn’t be set for life I made as much as he did!",
            "title_similarity": "0.707446",
            "sentiment_compound": -0.8439
        },
        {
            "id": "h0y2s1s",
            "score": 1,
            "text": "Honestly, your mentioning Logan Paul in your post kinda diminishes Reddit.",
            "title_similarity": "0.4667224",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0y3mdu",
            "score": 1,
            "text": "Boxing was slowly losing out to MMA and UFC. \nRestablshing boxing as the man's way to settle something actually reinvigorates it and gives it hope in our modern age",
            "title_similarity": "0.7643098",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0y42u4",
            "score": 1,
            "text": "It’s not a boxing match, it’s an entertainment event. These guys are the equivalent hot tub streamers picking up free money from simps.",
            "title_similarity": "0.53604126",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0y4v2k",
            "score": 1,
            "text": "He doesn't care.\n\n\n\n$20,000,000",
            "title_similarity": "0.45374686",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h0y506a",
            "score": 1,
            "text": "Maybe it really means he was never worth shit",
            "title_similarity": "0.45547336",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h0y5ay4",
            "score": 1,
            "text": "IMO in terms of choosing to fight logan paul, mayweather absolutely sold out. but there were reports yesterday that he could have netted upwards of $100 million for 24 minutes of his time, so he sold out really really well. the fight was decided to be an exhibition ahead of time, so it wasn't mayweather putting his record on the line; it was him using his earned celebrity status to make ~~some~~ a very large amount of money.",
            "title_similarity": "0.6770313",
            "sentiment_compound": -0.2706
        },
        {
            "id": "h0y5qv2",
            "score": 1,
            "text": "Maybe it puts that \"seriusnes\" right where it belongs 😆😆",
            "title_similarity": "0.05557833",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0y67lw",
            "score": 1,
            "text": ">getting in the ring with a random YouTuber (granted a great money play for Mayweather) makes Mayweather seem too accessible.\n\nAccessible? What does that even mean? I don't understand how fighting a stunt opponent changes anything about how excellent Mayweather was in his prime (especially because record padding has been a part of boxing since like, forever). \n\nDelaying Pacquiao until he was well past his prime is a bigger has got to be a bigger blemish than a super fun exhibition match that's created buzz around boxing and earned Mayweather millions at age 44.",
            "title_similarity": "0.8877463",
            "sentiment_compound": 0.9787
        },
        {
            "id": "h0y6cn8",
            "score": 1,
            "text": "Boxing has kind of been locked behind this mentality of only the best or trying to pin down who the best is etc. but I think what Mayweather did by appearing more accessible by putting boxing up as the sport and not himself as some godly champion, is they he brought more people to spectate. Boxing would probably die out as a sport if it wasn’t for events like this. Most kids don’t hear days watched because of Logan Paul not Floyd mayweather and that sort of blending or merging has to happen for the greater good of boxing. I started watching Boruto recently for example and I mean what is the point the peak of ninja shit has happened and Naruto is the strongest and it all ends? They is pretty boring. I mean do we just want boxing to fade to black since we found the best person we could? Why would anyone devote their life to boxing then? How could anyone not devoted to it reach a rank high enough to challenge the top? I don’t think Mayweather had any of this in his head but he for certain did a credit to keeping boxing alive a few more years and there is a Logan Paul fan out there right now who is probably looking into a boxing gym. They could be the next GOAT.",
            "title_similarity": "0.8236172",
            "sentiment_compound": 0.9875
        },
        {
            "id": "h0y6ejg",
            "score": 1,
            "text": "This IS Mayweather's legacy.",
            "title_similarity": "0.045064535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0y6ljz",
            "score": 1,
            "text": "Let the man make some money. I don’t think fans took it seriously at all lol. Mayweather is and will always be a legend in boxing....",
            "title_similarity": "0.79917157",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0y6wrl",
            "score": 1,
            "text": "It wasn't a \"real\" fight. They did an exhibition. Exhibitions have been around for a long time. You cannot compare this, effectively sparing match, to a licensed boxing fight that actually has judges and a winner that affects rankings/titles.",
            "title_similarity": "0.73125595",
            "sentiment_compound": 0.7756
        },
        {
            "id": "h0y7fji",
            "score": 1,
            "text": "To understand what Mayweather was after, you first have to look at what he did with all his earlier prize money. It's certain he doesn't have most of it any more if he's doing this.\n\nDid he piss it away on bullshit? Was it stolen by his management?\n\nThis wasn't exactly a risk for him, and there was a big payday which he clearly needed.",
            "title_similarity": "0.6491548",
            "sentiment_compound": -0.2837
        },
        {
            "id": "h0y8qlg",
            "score": 1,
            "text": "Can't knock a hustle",
            "title_similarity": "0.15543695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0y8yaf",
            "score": 1,
            "text": "It’s no worse than him doing commercials or other endorsements. He’s just capitalizing while he still can. He will make an ungodly amount of money from this. Would you turn down millions to avoid a tiny blemish on your reputation? I would do the same thing if I were him. Not to mention it gets him back into the public eye in a big way which will make him more desirable for endorsements / sponsorships in the near future",
            "title_similarity": "0.6164323",
            "sentiment_compound": 0.4492
        },
        {
            "id": "h0y97wj",
            "score": 1,
            "text": "Follow Jake and Logan Paul’s older brothers on Instagram!!! Hilarious!!! https://instagram.com/the_otherbrothers?utm_medium=copy_link",
            "title_similarity": "0.55595714",
            "sentiment_compound": 0.5951
        },
        {
            "id": "h0y9e1a",
            "score": 1,
            "text": "one could say this is a good speaking point to the poor pay for professional fighters. whatever you do for a living, imagine being offered a month of doing a fraction of your normal job for a heck of a lot more dough, and you of course will say yes. dude saw an easy check to make and took it i don’t think he can be blamed for that",
            "title_similarity": "0.68939674",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0y9oe0",
            "score": 1,
            "text": "You thought boxing was some classy endeavour?  Lol it's always been corrupt as fuck and all about the money.",
            "title_similarity": "0.75580055",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0y9qs5",
            "score": 2,
            "text": "You come across as someone who is upset by 2 smart men separating fools from their money. This whole post is a lazy opinion that everyone who’s out of the loop has. Mayweather is retired from fighting, this was a show for money and he was a character in the show.  No one will look back on Floyd’s career and even remember this stupid thing,but the money will always be in his safe.",
            "title_similarity": "0.8107954",
            "sentiment_compound": -0.886
        },
        {
            "id": "h0ya15u",
            "score": 1,
            "text": "He doesn’t even have a Boxing Degree!",
            "title_similarity": "0.4814528",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0yaaj6",
            "score": 1,
            "text": "Michael Jordan still plays pick up basketball against amateurs. Does him dunking on Jeff from Marketing diminish the skills or championships he had when he was in the NBA?",
            "title_similarity": "0.6725328",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0yabgf",
            "score": 1,
            "text": "How can it diminish the professional boxing scene when this wasn't a professional fight?\n\nIt was an exhibition match. It doesn't diminish anything.\n\n>As a boxer who went 50-0, and who only fought the best of the best of those who legitimately earned a shot at the top through winning their way to the top, getting in the ring with a random YouTuber (granted a great money play for Mayweather) makes Mayweather seem too accessible.\n\nIf Paul had wanted to fight Mayweather in a real professional fight then he would have to work his way up in real professional fights. But again, this was an exhibition match so none of that matters since this is not a real fight and it doesn't count.",
            "title_similarity": "0.90400124",
            "sentiment_compound": 0.8781
        },
        {
            "id": "h0yairk",
            "score": 1,
            "text": "Agree that these type of events are not good for the sport.",
            "title_similarity": "0.40786147",
            "sentiment_compound": 0.0243
        },
        {
            "id": "h0yard4",
            "score": 1,
            "text": "Celebrity deathmatch did it first. All bets are off.",
            "title_similarity": "0.65613365",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0yax3m",
            "score": 1,
            "text": "I thought people just wanted to see Logan get knocked out?",
            "title_similarity": "0.51064676",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0yb32o",
            "score": 1,
            "text": "Mayweather’s career is finished. Let him have some fun after such a long and successful career.",
            "title_similarity": "0.47391844",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h0yber5",
            "score": 1,
            "text": "Their out was that it was an “exhibition” not meant to be serious. Like Buddhism teaches, the fault is within us for having expectations",
            "title_similarity": "0.4939292",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0ybk7k",
            "score": 1,
            "text": "Lol, if you thought Floyd gave a shit about legacy you’re delusional. The guy loves money. This was risk free money for him. Why would he say no?",
            "title_similarity": "0.62755316",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0yc20k",
            "score": 1,
            "text": "Your whole argument falls apart because you assume Floyd cares about his legacy. If you ever followed Floyd you would know Floyd is about his money.",
            "title_similarity": "0.62821984",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0yc6gd",
            "score": 1,
            "text": "What should diminish Floyd’s legacy is his history of beating women, not this post retirement exhibition extravaganza . Get the fuck out of here with your weak ass take. Floyd is a bonafide piece of shit and I’d say it to his face knowing full well he could whip my ass. Fuck that dude, he makes Logan Paul look almost human.",
            "title_similarity": "0.77110803",
            "sentiment_compound": -0.9698
        },
        {
            "id": "h0ycpyl",
            "score": 1,
            "text": "Mayweathers Legacy is build on publicity stunts like this that made him hated and sold PPV's. I think most boxing fans are well aware that this is well within his character it's only more casual fans who seem to think that Mayweather was always this super respected athlete and not someone who built a career on being hates for his public persona who are shocked by recent events.",
            "title_similarity": "0.80140007",
            "sentiment_compound": 0.7284
        },
        {
            "id": "h0ycxb9",
            "score": 1,
            "text": "I don't think people take boxing that seriously these days anyway.  If Floyd could actually fight he'd have been in the UFC.  He'll probably be great at dancing with the stars.",
            "title_similarity": "0.8007816",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0yd31h",
            "score": 1,
            "text": "If anything Logan Paul being into boxing is really good for his biggest demographic getting more into boxing. \n\nBoxing has struggled for a number of years to draw younger viewers like it used too. This is kind of the point of exhibition matches.",
            "title_similarity": "0.7833775",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h0yd8nx",
            "score": 1,
            "text": "As someone who doesn't follow the scene, but watched the Paul brothers fight, it does seem more like a joke to me. The true integrity of the sport seems to have flown out the window. I also want to add that I'm not familiar with commentary on boxing matches, but the commentary from their fights have all been... Weird. Especially the one with snoop involved. Nothing but joking around, laughing, talking about unrelated things.",
            "title_similarity": "0.80479085",
            "sentiment_compound": 0.8669
        },
        {
            "id": "h0yd8qq",
            "score": 1,
            "text": "No",
            "title_similarity": "0.01290546",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0ydgzp",
            "score": 1,
            "text": "CMV: This increases the professional boxing scene because it is a joke to start with. \n\nThis totally fits with how FMjr has picked his opponents his entire career.",
            "title_similarity": "0.78733325",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0ydpy2",
            "score": 1,
            "text": "$100 million",
            "title_similarity": "0.1669329",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0yecdn",
            "score": 1,
            "text": "i don't think it has any deeper meaning and i don't think it will have any impact on his legacy. can't hate him for picking up easy money.",
            "title_similarity": "0.442383",
            "sentiment_compound": 0.7094
        },
        {
            "id": "h0yehw3",
            "score": 1,
            "text": "It's... a game. a sport. one that can be played with a serious competitive mindset, casually with minimal stakes, and as an exhibition between a pro and an amateur for purely marketing purposes.\n\nif you don't like one of those modes, you don't have to watch it. its existence takes nothing away from the other modes, and nobody is pretending they have any bearing on each other. Legacy happens in the professional setting, not in casual matches. \n\nIf you don't like that exhibition matches get attention then you're missing the fact that their only purpose is to get attention. They're not supposed to be more than footnotes in the history of a competition sport, and I think with this question you're ascribing more importance to them than they have in that sense. Any narratives lending Paul legitimacy as a fighter due to this match are pure marketing and I'd think that should be obvious, especially if you're a fan of the sport.",
            "title_similarity": "0.6277332",
            "sentiment_compound": 0.5546
        },
        {
            "id": "h0yevx2",
            "score": 1,
            "text": "His record is 50-0 not 49-1.  He beat the best fighters in his class.",
            "title_similarity": "0.70368254",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0yezm7",
            "score": 1,
            "text": "It makes professional boxing lesser, because they only held the event for clicks, likes, and cash.\n\nFor Floyd: He'll be viewed the same and would be a joke if he passed up that easy payday.",
            "title_similarity": "0.77500224",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0yezwn",
            "score": 1,
            "text": "These YouTuber fights brought life back to boxing, maybe they’re not the best but nobody cared about boxing over mma anymore, also Mayweather stated in the pre fight he “retired from boxing, not entertaining” it was a show they put on, they went hard and made it last 8 rounds",
            "title_similarity": "0.82505757",
            "sentiment_compound": -0.5162
        },
        {
            "id": "h0yfizc",
            "score": 1,
            "text": "No it doesn't.  \n\nHe is 50-0 against the best the world could throw his way.  \n\nHe earned his legacy now he's cashing in on it.  If every fighter could have this guy's luck, no doubt they would go after it.",
            "title_similarity": "0.77476776",
            "sentiment_compound": 0.8276
        },
        {
            "id": "h0yfjm6",
            "score": 1,
            "text": "Unless pail gets brain damage, in which case it’s heroic",
            "title_similarity": "0.36257666",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0yfld0",
            "score": 1,
            "text": "Good. He’s a piece of shit woman-beater. He has no legacy.",
            "title_similarity": "0.5308888",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0yfybe",
            "score": 1,
            "text": "I think it's the fact that he didn't just destroy logan and it was a draw is what really diminishes his career . He want 8 full fucking rounds.",
            "title_similarity": "0.6731324",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h0yg2t3",
            "score": 1,
            "text": "If someone offered you a couple milly to fight a youtuber would you do it? Not only that, it’s a glorified sparring match. Everyone knows it’s an exhibition.",
            "title_similarity": "0.6621808",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0yg3r1",
            "score": 1,
            "text": "People get too caught up in if it will \"diminish his legacy\", who the hell is keeping track of legacies? The guy was great at what he did for a very long time. \n\nIf a famous basketball player can make millions of dollars playing 1 vs 1 games after retirement, who the hell are you to care? Either watch to support the athlete or shut the f**** up and move on with your life. \n\nIf Floyd got into arm wrestling, went on to have a career of 0-900, he'd still be known as a great boxer. \n\nThese athletes are human beings, you can't just kill them after their career to stop them from being known for anything other than that thing you like to remember them as.",
            "title_similarity": "0.8164909",
            "sentiment_compound": 0.8778
        },
        {
            "id": "h0yg5ja",
            "score": 1,
            "text": "If you think this is what is diminishing boxing's legitimacy, you have not being paying attention to the last 30 years of boxing history.",
            "title_similarity": "0.6640003",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ygo5n",
            "score": 1,
            "text": "not if he kills him round 1",
            "title_similarity": "0.48210046",
            "sentiment_compound": 0.431
        },
        {
            "id": "h0ygqn1",
            "score": 1,
            "text": "A few quick things here...\n\nHe goes by Floyd \"Money\" Mayweather.  Dude never pretended not to be up for an easy payday.\n\nThese are only exhibition matches. I believe Floyd's last actual fight was in 2015 or so.  He hasn't used his skills since then so nothing is diminished here.\n\nBoxing has always been an extremely shady and corrupt sport at the professional level.  Even if this were a real match, boxing hasn't had much of a reputation to lose for a couple decades now.\n\nThe only people who look truly bad are the people that bought the PPV for whatever reason.",
            "title_similarity": "0.83666116",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0ygrij",
            "score": 1,
            "text": "No judges, no record on the line, it was a televised sparring session.   It wasn’t a fight in the first place.",
            "title_similarity": "0.6092093",
            "sentiment_compound": -0.4427
        },
        {
            "id": "h0yhn70",
            "score": 1,
            "text": "But see, he made something around 60 million dollars from that fight. I don't think he's gonna turn it down",
            "title_similarity": "0.5352836",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0yhofj",
            "score": 1,
            "text": "1)It really doesn't matter;the fight was unsanctioned. It couldn't hurt any of their legacies one bit.\n\n2)Mayweather is a celebrity and makes money off of being relevant; so does Logan,so this was expected.\n\n3)The professional boxing scene has been fucked for decades cause of fight rigging and choosing weaker opponents.\n\n4) Mayweather is way more of a douchebag than Logan is. Logan has grown up. Mayweather is still talking about fucking money,or property or something. \n\nBottom Line: This fight didn't fucking matter. Only Logan's and Floyd's bank accounts mattered here.",
            "title_similarity": "0.81089884",
            "sentiment_compound": -0.9221
        },
        {
            "id": "h0yiafq",
            "score": 1,
            "text": "I would be happy to argue with you about the greatest boxer bit but that’s off topic a bit.\n\nI think a straight up money grab is completely on brand for mayweather. It has nothing to do with his legacy as it’s a joke of a match with no stakes attached. \n\nThat’s like saying a retired hockey player going out and playing beer league with his buds diminishes his legacy. Only difference in my example is the blatant cash grab and tv coverage but it’s the same arguement.",
            "title_similarity": "0.79855657",
            "sentiment_compound": 0.8765
        },
        {
            "id": "h0yiami",
            "score": 1,
            "text": "Yes after going 50-0 having an exhibition fight diminishes his legacy xD youre stupid",
            "title_similarity": "0.7849922",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0yiomr",
            "score": 1,
            "text": "Does he make money from it?\n\nBecause if he does, then there's absolutely no reason to not go into the ring and teach a jackass a lesson.\n\nWho loses? Mayweather's record becomes 51-0, he beats the F out of Logan Paul, and he makes a ton of money doing it.\n\nThe accessibility part isn't a big deal. He can decide to fight whomever he desires. And his decision will almost always be financially motivated.",
            "title_similarity": "0.80794704",
            "sentiment_compound": -0.7617
        },
        {
            "id": "h0yitiz",
            "score": 1,
            "text": "Dude cares more about the millions he just made than anyones opinion. Why should he?",
            "title_similarity": "0.57081276",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0yiw2o",
            "score": 1,
            "text": "He's called money Mayweather for a reason. It's all he cares about. This was basically WWE for retards and that's saying something, at least WWE fans know it's fake",
            "title_similarity": "0.71246344",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0yjc6r",
            "score": 1,
            "text": "Yeah, but Mayweather said it himself plainly. “My kids can’t eat legacy”. \n\nHe is doing what he does to earn as much as possible. Can you think of a way he could earn even more at this point in his life? He wants to build generational wealth. \n\nHe even called the fight a bank heist after the bout. Go watch the post fight press conference.",
            "title_similarity": "0.7014159",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0yjiph",
            "score": 1,
            "text": "As much as I didn't like the fight leading up to it, seeing Floyd hold up against the blows of someone way larger than him. I was expecting to see Floyd very hurt simply based on size alone, yet he weathered all 8 rounds. I think as someone who put too much value into catchweight bouts, I didn't realize that speed, experience and patience really pays off in these competitive arenas. I had more respect for Floyd after this than the Manny Paquao fight.",
            "title_similarity": "0.78257114",
            "sentiment_compound": -0.1842
        },
        {
            "id": "h0yk3kc",
            "score": 1,
            "text": "You’re really going to hate Mayweather Vs Paul II ‘This time its personal’",
            "title_similarity": "0.63978565",
            "sentiment_compound": -0.6077
        },
        {
            "id": "h0yksom",
            "score": 1,
            "text": "Exhibition matches have been happening for decades. This is nothing new, and has never diminished a legacy before. I'm not sure I understand what the issue is?",
            "title_similarity": "0.4007227",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h0yl0g2",
            "score": 1,
            "text": "I highly doubt floyd actually gives a shit",
            "title_similarity": "0.3185779",
            "sentiment_compound": -0.7501
        },
        {
            "id": "h0yl751",
            "score": 1,
            "text": "No he's right, but Floyd is a big spender and has a life to maintain. \n\nThat's his prerogative and I can't fault him for that, dude is the greatest boxer ever but it's not his job to prop up the integrity of the sport when the sport never propped up itself's integrity or Floyd's.",
            "title_similarity": "0.7307118",
            "sentiment_compound": 0.9422
        },
        {
            "id": "h0ylenp",
            "score": 1,
            "text": "I lost so much respect for Floyd after that fight. Knockout I'm 1st round, no, stretch it out. Good thing I didn't pay for that clown shit",
            "title_similarity": "0.80536324",
            "sentiment_compound": -0.2325
        },
        {
            "id": "h0ylmp6",
            "score": 1,
            "text": "The professional boxing scene is about as minimized as it can get already.",
            "title_similarity": "0.6605319",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ymd49",
            "score": 1,
            "text": "The dude is literally an undefeated champion  who retired ... nothing can ruin his legacy .",
            "title_similarity": "0.594581",
            "sentiment_compound": 0.7889
        },
        {
            "id": "h0yming",
            "score": 1,
            "text": "I dont believe it's up for debate about Mayweather being greatest anything.  He's not. \n\nProfessional boxing has been a joke for decades. The amount of corruption in the sport has deteriorated the legitimacy. This is just another event aimed to collect 50 dollars a household.",
            "title_similarity": "0.80999935",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0ymne1",
            "score": 1,
            "text": "I understand this",
            "title_similarity": "-0.21806899",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0yn857",
            "score": 1,
            "text": "Mayweather is trash and ruined boxing in 2007.",
            "title_similarity": "0.70316845",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0ynckn",
            "score": 1,
            "text": "Fake match he just wants some money why do you care xd",
            "title_similarity": "0.55128217",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0ynkfd",
            "score": 1,
            "text": "I think the domestic violence thing was what killed his legacy...",
            "title_similarity": "0.5588678",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h0ynqdf",
            "score": 1,
            "text": "He could not care less. He made 50 million dollars.",
            "title_similarity": "0.39919412",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h0yntvh",
            "score": 1,
            "text": "Imagine telling Floyd mayweather he should’ve skipped a $100M payday to preserve his legacy.  His legacy is making money, and this is a crown jewel.",
            "title_similarity": "0.6278273",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0yo8zb",
            "score": 1,
            "text": "Mayweathers main goal was making money, not a particular record. His whole shtick is making you mad so mission accomplished. The sport is already shit, sadly.",
            "title_similarity": "0.722613",
            "sentiment_compound": -0.7522
        },
        {
            "id": "h0yoic4",
            "score": 1,
            "text": "Idk I looked at it as an opportunity to watch an online asshole get beaned in the head by a boxing GOD",
            "title_similarity": "0.72791255",
            "sentiment_compound": 0.6408
        },
        {
            "id": "h0yp1cz",
            "score": 1,
            "text": "It was just an exhibition fight, there's never a winner.\n\nAnyone who actually knows/follows boxing knows this was a \"event\" to be ignored.\n\nThere are kids and teens that never would have had the slightest interest in the sport before hand that are gonna watch it, love it, and find a whole new passion from it.\n\nAny publicity is good publicity.\n\nFloyd's legacy is already untouchable, pretend this never happened the man is still 50-0 undefeated one of the greatest fighters of all time.\n\nThe only area you have any validity in your argument is saying it \"minimises the professional scene\" and that's strictly financial as Logab got paid more than some actual pros do BUT all Logan or Jake or KSi or any if these influences have done is capitalise on something any celebrity could have. It doesn't matter if you're a youtuber, actor, singer, basketball player, whatever! If a celebrity steps in the ring they're gonna bring new eyes that wouldn't normally give the sport the time of day to the screen and aslong as one of those eyes say \"I like this I'm gonna follow this\" then it's a business win and like every other sport now adays boxing is just a business",
            "title_similarity": "0.87344277",
            "sentiment_compound": 0.9558
        },
        {
            "id": "h0ypj5o",
            "score": 1,
            "text": "Agreed.",
            "title_similarity": "-0.1963908",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0ypm71",
            "score": 1,
            "text": "Well it's not like a celebrity with boxing ambitions jumping the pack and getting a shot at the champ.   It's more like showing up to YouTube to show someone a boxing legend, and it just happens to be Paul involved, vs a YouTube coming into the boxing world. Probably nobody that follows Mayweathers career in the future is going to think he wasn't a great boxer because he goofed around in retirement.  That would seriously stuck if you spent your entire life boxing, only to worry about your legacy so much that you couldn't be seen doing anything boxing related unless it was a serious match. \n\nIt being Logan Paul, on the other hand, will reduce Mayweather's respect with people on the internet who dislike Paul, but that's probably a different legacy than the one you're referring to.",
            "title_similarity": "0.8957001",
            "sentiment_compound": 0.0502
        },
        {
            "id": "h0ypv6q",
            "score": 1,
            "text": "Obviously all you nobodies care about his legacy more than him. He's in it for the 50 mil. When all is said and done, no one is gonna talk about him fighting Logan Paul for 30 minutes. They'll talk about his 50-0.",
            "title_similarity": "0.6885841",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0yq70d",
            "score": 1,
            "text": "Did you not see him fight Big Show at Wrestlemania ages ago? Legacy still intact years later.",
            "title_similarity": "0.6095875",
            "sentiment_compound": 0.4559
        },
        {
            "id": "h0yqltn",
            "score": 1,
            "text": "He doesn’t give a shit. And neither should you.",
            "title_similarity": "0.30728152",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0yqtnk",
            "score": 1,
            "text": "I don't think it diminishes his legacy at all.\n\nHe's retired. It's an exhibition specifically to make some easy money.\n\nAnd his legacy was never very sparkling that I can remember.",
            "title_similarity": "0.5185001",
            "sentiment_compound": 0.2011
        },
        {
            "id": "h0yr0sa",
            "score": 1,
            "text": "He’s a cartoon",
            "title_similarity": "0.07825436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0yr6a7",
            "score": 1,
            "text": "I don’t follow boxing, but I feel like exclusivity actually diminishes the integrity of it more. \n\nI mean how good can someone be if they have to prescreen any who challenge them? What are they afraid of? Some upstart being better? Denying someone the chance to fight out of elitism doesn’t foster trust—it makes that guy seem like a coward. \n\nI could get behind people not wanting to waste time with a billion upstarts all fighting for the crown, but if it’s a plausible comparison—why shy away from it? Especially if there’s nothing to lose and all to gain in fame and money.",
            "title_similarity": "0.75179386",
            "sentiment_compound": 0.9665
        },
        {
            "id": "h0yra31",
            "score": 1,
            "text": "I really don't think it does anything to Floyd's legacy. It's clearly a move by a man that's getting pretty old to gain a bunch of money, and who can blame him? \n\nI feel like the type of thing being one of my biggest boxing events cheapens the sport considerably.",
            "title_similarity": "0.82194066",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h0yra4i",
            "score": 1,
            "text": "I'm so glad I've been almost completely out of the loop in regards to this boxing thing. I really don't care for boxing in general, but boxing AND Logan Paul? That's a big shit I don't give.",
            "title_similarity": "0.7517195",
            "sentiment_compound": -0.6914
        },
        {
            "id": "h0ys13y",
            "score": 1,
            "text": "You should just be glad Mayweather’s trying to beat the shit out of a man for once.",
            "title_similarity": "0.61679965",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h0ys1iq",
            "score": 1,
            "text": "Dude earned so, so much money for this teather. He probably doesn't care, really.",
            "title_similarity": "0.5684244",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h0ys3jq",
            "score": 1,
            "text": "A lot of people have already commented great points, but I really don’t think he cares about his legacy in terms of this fight. He made millions\n\nEdit to add an actual Mayweather quote: \"They say, 'It's not all about the money.' Well, your kids can't eat legacy,\" Mayweather said. \"Patches on my trunks, that was $30 million alone. So, who's really the smartest one in the sport of boxing?\"",
            "title_similarity": "0.83888125",
            "sentiment_compound": 0.8631
        },
        {
            "id": "h0ys5ae",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09297399"
        },
        {
            "id": "h0ys6xa",
            "score": 1,
            "text": "They call him money Mayweather for a reason. We all know why he did it",
            "title_similarity": "0.35033047",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ysspb",
            "score": 1,
            "text": "He’s probably broke. He bought his inner circle 1mill in cars this weekend. Can’t last log for doing that.",
            "title_similarity": "0.594586",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0ysw4n",
            "score": 1,
            "text": "Boxing has been a joke for a while for a huge list of reasons. YouTube celebrity fights are the only chance it has at capturing a younger audience.",
            "title_similarity": "0.81208694",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0yta2a",
            "score": 1,
            "text": "Honestly if you understand boxing, especially if you've practiced it at least a bit, you will realize how much of an absolute monster Mayweather is.\n\nHis insane boxing record is just icing on the cake, it is not what made him who he is as a fighter.\n\nHis skill cannot be tarnished by this stupid publicity stunt. If you think it does, then you don't understand what boxing is about. No offense meant.",
            "title_similarity": "0.82665634",
            "sentiment_compound": -0.3313
        },
        {
            "id": "h0ytoxz",
            "score": 1,
            "text": "I'm a boxing fan but find myself more interested in the UFC nowadays, Tyson Fury vs AJ being cancelled is the nail in the coffin for me, fans get fucked over time and time again, it needs a massive overhaul",
            "title_similarity": "0.7810731",
            "sentiment_compound": -0.8753
        },
        {
            "id": "h0yu65x",
            "score": 1,
            "text": "Its all entertainment chief.  Always has been.",
            "title_similarity": "0.16654338",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0yufau",
            "score": 1,
            "text": "He's already said he doesn't give a fuck about his legacy, so why do you, OP?\n\nWhy does anyone care what he does? Why does his record matter? Why do you care?\n\nI played every sport I could growing up but i genuinely do not understand how people like OP develop an emotional connection to some athletes data sheet.",
            "title_similarity": "0.70387346",
            "sentiment_compound": 0.9069
        },
        {
            "id": "h0yuhjt",
            "score": 1,
            "text": "Someone takes an exhibition match wayyyyy too serious. It was for fun and money. Mostly for money.",
            "title_similarity": "0.53650963",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0yuv3m",
            "score": 1,
            "text": "Despite having absolutely no real meaning, Mayweather is the biggest draw and his presence brings a ton of attention to boxing, even if it's for dumb reasons. Those people booing didn't know what to expect, some of them will go learn about boxing and why Mayweather fought like that. I doubt the fight lost any boxing fans, and likely made some new genuine fans.",
            "title_similarity": "0.83535403",
            "sentiment_compound": -0.8124
        },
        {
            "id": "h0yuwiy",
            "score": 1,
            "text": "Tarnish his legacy? Not really. It was an exhibition fight for an old fighter that made millions for sparring.\n\nHe's gonna pump his brand and make money $100mill a pop.\n\nEven for half ass sparring matches. If idiots watch and bet money, he won.",
            "title_similarity": "0.7799803",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0yvpd0",
            "score": 1,
            "text": "I didn't know boxing could be any more diminished than it already was.",
            "title_similarity": "0.5929165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0yvve3",
            "score": 1,
            "text": "Unless I am mistaken, wasnt Floyd also serving as his Own Promoter? The problem could simply be that his exceptional skill set in the ring is substantially different from that required to manage his overall career. I also imagine it must be incredibly hard to admit its time to hang up the gloves, especially for the greatest.",
            "title_similarity": "0.7431261",
            "sentiment_compound": 0.1616
        },
        {
            "id": "h0yw07v",
            "score": 1,
            "text": "You seem to have a pretty naive view of boxing as some kind of pure test of skill unsullied by the baser motivations. The reality check is that boxing is about money; boxers will do whatever makes the most money from selectively fighting mismatched opponents to throwing fights.\n\nThis goes for almost every combat sport; they are a lot more like pro wrestling than most people think; the job of the athletes and promotions is to make it seem as convincing as possible. But if you look at the incentives, it doesn’t make sense not to manipulate things when there is the chance of creating a long-term star than can earn a lot of money for a promotion over the course of a career. One legitimate fight can result in an injury that can stop a career dead in its track and all of a sudden the money dries up, it’s not a risk worth taking.\n\nEven a sport as apparently “pure” as sumo wrestling, with hundreds of years of history and tradition is well-known to be fixed at the highest levels of competition.",
            "title_similarity": "0.7846047",
            "sentiment_compound": -0.8497
        },
        {
            "id": "h0yw4km",
            "score": 1,
            "text": "Except $$$$$$$$$$$$$$$$",
            "title_similarity": "0.20462593",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0yw5n0",
            "score": 1,
            "text": "Boxing just seems like a scam at this point, especially that fight. That one clown couldn't even throw a proper punch, I've seen people fight better in r/publicfreakout ffs. They hugged more then every video on pornhub combined.",
            "title_similarity": "0.846676",
            "sentiment_compound": -0.7076
        },
        {
            "id": "h0yw5p6",
            "score": 1,
            "text": "i dont think you comprehend what you can get with the kind of money he got for doing literally nothing",
            "title_similarity": "0.5380228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ywfpm",
            "score": 2,
            "text": "Mayweather is retired and he's an adult. He should be able to do whatever he wants in his free time. Especially because he is making an insane amount of money, and obviously a lot of people wanted to see the show. Since when is making money wrong? Why is it important for him to be accessible? It's not like this was a title fight or even a real fight. Rocky was a nobody who got to fight the champ and that movie was dope. If it was just some YouTube douche who got a title shot, I'd agree with you. But this was an exhibition. \n\nAlso I think Mayweather is the greatest \"defensive\" boxer of all-time. I don't think he rises to the level of the greatest. His legacy is already one of a money-hungry, illiterate, asshole woman beater so it's not like he can tarnish that too much.",
            "title_similarity": "0.86364436",
            "sentiment_compound": 0.8314
        },
        {
            "id": "h0ywhdw",
            "score": 1,
            "text": "If you made 100 million in 30 minutes, would you care about your \"legacy\"",
            "title_similarity": "0.3525074",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0ywhrn",
            "score": 1,
            "text": "His legacy is 50-0. He's one of the greatest fighters. \n\nThis was an exhibition match not a real fight. Mayweather would be diminishing his legacy if he treated it like a real fight and knocked out someone that isnt close to being on his level.",
            "title_similarity": "0.87171876",
            "sentiment_compound": 0.7256
        },
        {
            "id": "h0yxilx",
            "score": 1,
            "text": "Why would anyone care at all about his reputation or legacy? We don't personally know the guy, for fucks sake. The obsession with celebrities is really weird.",
            "title_similarity": "0.6481187",
            "sentiment_compound": -0.5095
        },
        {
            "id": "h0yy1ih",
            "score": 1,
            "text": "Lol best of the best ducking dela hoya rematch and other best of the best boxers for loooong times",
            "title_similarity": "0.7123501",
            "sentiment_compound": 0.9666
        },
        {
            "id": "h0yy9a8",
            "score": 1,
            "text": "Dude, relax.  It was an exhibition.  There was no winner.\n\nHere in Canada, Justin Trudeau boxed Patrick Brazeau for charity.  If that doesn't diminish serious boxing I don't know what will.",
            "title_similarity": "0.7045362",
            "sentiment_compound": 0.431
        },
        {
            "id": "h0yyend",
            "score": 1,
            "text": "But in his defence it was, and I quote, very fun.",
            "title_similarity": "0.2597195",
            "sentiment_compound": 0.7572
        },
        {
            "id": "h0yzdxj",
            "score": 1,
            "text": "100% it does. It's degrading to the sport",
            "title_similarity": "0.4618559",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0yze4c",
            "score": 1,
            "text": "Who cares, he just made +20 million in 1 night.\n\nIf you're going to fault a guy for wanting to make 20 million in 1 night, you have a whole set of problems on a  subconscious level you aren't aware of.",
            "title_similarity": "0.7020705",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0yzzov",
            "score": 1,
            "text": "Mayweather’s record is what it is because he picked his fights.",
            "title_similarity": "0.56208646",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0z0l3e",
            "score": 1,
            "text": "Obviously Mayweather is an amazing boxer who could kick most of our asses with no warmup, but being a champion in boxing isn't quite the same thing as it is in other sports. There's not a season and a bracket that you work your way up. If someone thinks you've got real potential, they'll arrange for you to fight some other dudes, preferably ones who aren't as good as you so you can build up your record. Keep doing that for a while and attract the right attention, and maybe you can get match against serious contenders and eventually make your way towards a championship match.\n\nIf someone *doesn't* think you have potential, they'll arrange for you to get your ass kicked to pad their favorite's record.\n\nWhat I'm saying is, every profitable sport is a balance between contests of skill and putting on a show, and boxing tends more towards the latter than most. Mayweather got where is in the first place by fighting carefully-picked scrubs. This isn't really different.",
            "title_similarity": "0.82348573",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h0z0pq6",
            "score": 1,
            "text": "You paid for it didn’t you?",
            "title_similarity": "0.14479652",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0z0wpc",
            "score": 1,
            "text": "Boxing has historically always been like this.  There are plenty of farces, and money grab fights through out history.   For how far down the popularity list boxing has fallen, this probably only served to get more fans, not lose any.",
            "title_similarity": "0.75788164",
            "sentiment_compound": 0.4445
        },
        {
            "id": "h0z18j9",
            "score": 1,
            "text": "I feel like it also gets lots of new people into the sport though. People used to say the same about NBA dunk competitions and stuff like that.  In the end that and youtube highlight videos got me into watching basketball.  I listened to some actual commentary from a boxer/boxing fan for 3/4 fights and it was pretty intersting.  \n\nI've had world class runners enter local races and just take it easy and chat with other runners.  No one needs them to smoke the local high schoolers that usually win.",
            "title_similarity": "0.6641876",
            "sentiment_compound": 0.9287
        },
        {
            "id": "h0z1kuo",
            "score": 1,
            "text": "You don't mean accessible...you mean cheap.",
            "title_similarity": "0.1721622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0z1rpf",
            "score": 1,
            "text": "As someone who watches fighting sports in the sense of \"someone posted a cool gif\", this seems like such a waste money for the consumer. Y'all think you would have learned with Conner.",
            "title_similarity": "0.7772192",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0z1xeb",
            "score": 1,
            "text": "Exhibition for a reason.",
            "title_similarity": "-0.052513313",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0z2fc6",
            "score": 1,
            "text": "The one thing I don't agree with you on is that Mayweather fought the \"best of the best.\" It is widely known that he is undefeated because he did NOT fight the best of the best.  He pick and chose his fights.",
            "title_similarity": "0.837947",
            "sentiment_compound": 0.7435
        },
        {
            "id": "h0z2sxc",
            "score": 1,
            "text": "51-0 if you include his wife.",
            "title_similarity": "0.23342964",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0z2xni",
            "score": 1,
            "text": "Mayweather is a joke.",
            "title_similarity": "0.29425293",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0z38cb",
            "score": 1,
            "text": "\"Honor\" and \"legacy\" in sports is all marketing.  They are all about making money and the idea that the participants should be held in reverence is more marketing crap.  Most of them just care about making money.",
            "title_similarity": "0.5865334",
            "sentiment_compound": 0.5456
        },
        {
            "id": "h0z3axu",
            "score": 1,
            "text": "Honestly if mayweather turns that guys face into lasagna then it's worth it.",
            "title_similarity": "0.33034855",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0z3cq5",
            "score": 1,
            "text": "It only diminishes his legacy if you view public sparring matches as a part of your legacy, which most boxing fans don't.",
            "title_similarity": "0.76172066",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0z3pfm",
            "score": 1,
            "text": "Let's be honest here. This was done so people can watch Logan Paul get his ass beat legally.",
            "title_similarity": "0.5148579",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0z3q7l",
            "score": 1,
            "text": "Floyds legacy is his bank account and that shits atrong as fucking ever. Boxing has been dead. Floyds getting his paper that's all it is.",
            "title_similarity": "0.64998996",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h0z41pq",
            "score": 1,
            "text": "how about when Mayweather did WWE",
            "title_similarity": "0.35447544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0z4czt",
            "score": 1,
            "text": "50-0 disengaging nearly every fight and hugging whenever someone hit him.\n\nChange my mind.",
            "title_similarity": "0.6271025",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0z4f9w",
            "score": 1,
            "text": "Boxing's just worse WWE",
            "title_similarity": "0.6486555",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0z4p20",
            "score": 1,
            "text": "30 million plus the ppv buys. It doesn't deminish a thing. Hes",
            "title_similarity": "0.4176094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0z54pt",
            "score": 1,
            "text": "I don't think it tarnishes his legacy in general because people that know and understand boxing didn't really take that fight seriously, or even watch it for that matter. I do think there is a more general point to be made though about YouTuber boxing ruining the actual sport of boxing, in the long run. I think over a long period of time this sport will become a joke if it carries on this way.",
            "title_similarity": "0.8086133",
            "sentiment_compound": -0.5046
        },
        {
            "id": "h0z56d5",
            "score": 1,
            "text": "I feel like all the domestic abuse he did diminished his legacy more...",
            "title_similarity": "0.59045017",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0z5wpn",
            "score": 1,
            "text": "Professional boxing has been, for a long time, a sport in which a champion turns down a legitimate fight against a legitimate contender because the money's not there - not enough to gain, plenty to lose.\n\nThese guys aren't Miyafuckingmoto Musashi out here single-mindedly tryna fight the best people they can; they're here to keep the titles they have, gain new ones, and *make money*.\n\nI think if anything, it is a *less* important problem that a professional boxer do the inverse - accept a fight against a non-contender because the money *is* there - as you're describing here.  The sport is a ghost of its former self because of the *other* thing.",
            "title_similarity": "0.8625082",
            "sentiment_compound": 0.0282
        },
        {
            "id": "h0z639g",
            "score": 1,
            "text": "Every dumbass talking about it is the reason it was so profitable/happened. Just shut up and don't watch stupid shit",
            "title_similarity": "0.66358256",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0z6fcm",
            "score": 1,
            "text": "Floyd Mayweather's legacy is \"A man who beats women up, and was also a boxer.\"\n\nEvery time Floyd Mayweather is in the news not for beating a woman up, his legacy improves.",
            "title_similarity": "0.74628365",
            "sentiment_compound": 0.6463
        },
        {
            "id": "h0z6gm5",
            "score": 1,
            "text": "By giving Logan a chance and the benefit of the doubt Floyd makes Logan look like a bigger idiot when Logan looses and shows Floyd is the bigger person too. It also shows Floyd as still human and relatable which looks good to their audience.",
            "title_similarity": "0.6775855",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0z7352",
            "score": 1,
            "text": "100%.\n\nSellouts DGaF though, sadly.",
            "title_similarity": "0.38550916",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0z74vt",
            "score": 1,
            "text": "I think you're wrong in your point about Floyd being accessible. You're underestimating the popularity and internet presence of Logan Paul. Don't forget that at the end of the day this fight was for money, and Paul was most certainly able to bring a lot of that to the table via his name and influence. You make it sound as though any Tom, Dick or Harry has the influence to get Mayweather in the ring. This isn't the case at all. Make no mistake, Paul is part of a very exclusive group of highly influential people.",
            "title_similarity": "0.81727374",
            "sentiment_compound": 0.4733
        },
        {
            "id": "h0z7gsj",
            "score": 1,
            "text": "I think the fact that Floyd 'won' without punching coupled w/ how gassed Logan was illustrates the sea of difference between 'comedians' and professional boxing.",
            "title_similarity": "0.8555071",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0z7iio",
            "score": 1,
            "text": "It was an exhibition fight between a boxer who has been retired from the professional scene for a couple of years and a celebrity. People earning their way up only care about official bouts to raise their rank in their respective association, so it doesn’t affect any of them. \n\nThe fact there were no judges should be tipping people off and no winner should have driven home the point that this was purely for entertainment.",
            "title_similarity": "0.80088556",
            "sentiment_compound": 0.2974
        },
        {
            "id": "h0z7l0l",
            "score": 1,
            "text": "I basically sent this same exact text to my friends last night.  Wtf is he doing, he doesn't need money.",
            "title_similarity": "0.4259278",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0z7oj0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05570983"
        },
        {
            "id": "h0z804i",
            "score": 1,
            "text": "This was a money grab. Nothing else. Both took advantage of suckers and both are trending thanks to posts like these, that are eager to hate on either douchebag.\n\nYou’re part of the hate hype that made this fight possible. Legacy for a retired boxer is nothing. Legacy doesn’t pay well after retirement but throwing a fake fight and getting a payday equivalent to hitting the lotto pays really well.",
            "title_similarity": "0.8316518",
            "sentiment_compound": -0.8467
        },
        {
            "id": "h0z8r5i",
            "score": 1,
            "text": "Fought the best of the best? Mayweather's ducked the toughest fights his whole career",
            "title_similarity": "0.7720262",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0z94pg",
            "score": 1,
            "text": "Logan Paul has money. He essentially just paid Mayweather to have a fantasy slap boxing match with him. Somewhere they managed to squeeze money out of it. They both got paid greatly.\n\nAll in all, just rich people having fun and making a profit as they usually do or try to do.",
            "title_similarity": "0.73461497",
            "sentiment_compound": 0.886
        },
        {
            "id": "h0z9amu",
            "score": 1,
            "text": "The dude has hundreds of millions and still scams people with fraud crypto scams to defraud poor people of their money.  He ruins his own legacy.",
            "title_similarity": "0.6502796",
            "sentiment_compound": -0.9545
        },
        {
            "id": "h0z9t82",
            "score": 1,
            "text": "Huh, your saying the guy who made a YouTube video mocking and making fun of Japan, culminating in actually recording video of a suicide victim’s body... that guy is damaging the reputations of people still working with him? Wellyoudon’tsay.\n\nGod can we please toss people like the Pauls and Kardashians into the garbage and leave them there?",
            "title_similarity": "0.69829255",
            "sentiment_compound": -0.4329
        },
        {
            "id": "h0za67m",
            "score": 1,
            "text": "Floyd actually addressed this very thing at the end. He agrees it does diminsh  his legacy slightly, but at the end of the day you can't eat a legacy, and his bank account grows exponentially and he gets to go home to a way better house then you or I for this slight hit. He doesn't care, he's a business man first, fighter second.",
            "title_similarity": "0.6804429",
            "sentiment_compound": 0.4035
        },
        {
            "id": "h0zaagh",
            "score": 1,
            "text": "I didn't even need to read past your first sentence to clearly see that you're completely out of mind and your entire thread is pointless nonsense bullshit.\n\nAlright then, Dora the Explorer is arguably the greatest TV show of all time. Makes arguably about as much sense as what you just said.",
            "title_similarity": "0.6478768",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0zbd28",
            "score": 1,
            "text": "Beating women diminished his legacy. As far as boxing they have always done exhibition matches and always will. He got paid for a non professional fight. Thus did nothing to pro boxing.",
            "title_similarity": "0.79638517",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0zbkcm",
            "score": 1,
            "text": "Floyd doesn’t care. It’s all about ThE MoNey TeAM. Such a gargantuan cock stain. Plus he’s a wife/girlfriend beater. Logan, well his doughebaggery never had any pretense.",
            "title_similarity": "0.74335",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0zbn7m",
            "score": 1,
            "text": "He's just getting a paycheck. He did the work to make it this far so why not make a million dollars boxing a big dummy?",
            "title_similarity": "0.7224126",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zbyuf",
            "score": 1,
            "text": "Why change it if its true, why anyone would pay 50 bucks to see that train wreck and not even a good train wreck.. if hed knocked his ass out in the third after playing with him then maybe, maybe, but to watch him hold the dumbass up for multiple rounds... and he plans on fighting the brother..",
            "title_similarity": "0.8139836",
            "sentiment_compound": -0.917
        },
        {
            "id": "h0zbzat",
            "score": 1,
            "text": "Only if you’re not into boxing.",
            "title_similarity": "0.34120458",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zcrnu",
            "score": 1,
            "text": "Floyd likes money. He isn’t worried about his “diminished legacy” when he’s sitting on yet another mountain of cash. More money most people make their entire lives in one night. He doesn’t give a rats ass.",
            "title_similarity": "0.5953561",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0zcu5g",
            "score": 1,
            "text": "clown show.",
            "title_similarity": "0.14322524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zd8pf",
            "score": 1,
            "text": "Floyd's legacy is just as much about opulence as it is about boxing. That is his persona. Boxing as a whole seems to have been falling more and more into irrelevance ever since it's golden era and I don't see a reason to think it wouldn't continue to do so unless someone stepped up and tried to popularize it again. You might not like that youtubers can bring eyes to events but it doesn't seem like anyone else is trying.",
            "title_similarity": "0.82968044",
            "sentiment_compound": -0.4348
        },
        {
            "id": "h0zdgtz",
            "score": 1,
            "text": "Nobody will remember this fight in 2 years",
            "title_similarity": "0.46708918",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0zdgx5",
            "score": 1,
            "text": "Paul was just fighting pro se.",
            "title_similarity": "0.5787391",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0zdnil",
            "score": 1,
            "text": "This dude can hardly read. You think he gives a shit about what people will write about his legacy.",
            "title_similarity": "0.5934218",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0ze1g4",
            "score": 1,
            "text": "I don't disagree and I'm not sure Floyd is capable of making an argument otherwise. What he does know, is he made a boatload of money for an exhibition fight and doesn't give a shit if it did",
            "title_similarity": "0.6938944",
            "sentiment_compound": 0.1645
        },
        {
            "id": "h0ze5nl",
            "score": 1,
            "text": "Mayweather did that way before Logan Paul.",
            "title_similarity": "0.13175875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zf1gt",
            "score": 1,
            "text": "It's one of the most popular events in boxing this millennium. Shit like this could save boxing by building some of the interest it has lost.",
            "title_similarity": "0.72796816",
            "sentiment_compound": 0.7089
        },
        {
            "id": "h0zf4ch",
            "score": 1,
            "text": "It was a celebrity exhibition match between a 200lb 25yo youtube star and a 150lb 42yo retired boxer. It'd be easier for people to accept this if it wasn't presented and billed comparative to a Alvarez title fight",
            "title_similarity": "0.7505539",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0zfj56",
            "score": 1,
            "text": "It was for money. Seems pretty simple to me.",
            "title_similarity": "0.16674094",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0zfl11",
            "score": 1,
            "text": "Both are just good at milking money to their target audience.",
            "title_similarity": "0.41424963",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0zfnzv",
            "score": 1,
            "text": "Mayweather never fought a prime elite.",
            "title_similarity": "0.49359387",
            "sentiment_compound": 0.2411
        },
        {
            "id": "h0zfq7o",
            "score": 1,
            "text": "There is no legacy to diminish if there is no legacy. Mayweather had money, yeah we all know that, but the guy was a little bitch. Not only was Mayweather's fighting style shit and boring to watch but he is also known for beating women outside of the ring. Mayweather will never be remembered as a great fighter, I don't give a fuck if he never lost, Mike Tyson lost a couple of times and we still have a ton of respect for that man. He never cared about his legacy and it shows, hope the money makes up for it though.",
            "title_similarity": "0.82126814",
            "sentiment_compound": -0.7384
        },
        {
            "id": "h0zgd68",
            "score": 1,
            "text": "Sports are taken too seriously. Where has the fun gone?",
            "title_similarity": "0.39751655",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0zgoop",
            "score": 1,
            "text": "Two words \"celebrity boxing\".\n\nIt's one of the best spectacles in tv history\n\nThis is the samething\n\nIt does nothing to minimize the professional boxing scene and those complaining about it aren't famous enough to get on or are just jealous of the money they are making.\n\nI can't wait for more. I hope we can get LeBron in the ring after he retires",
            "title_similarity": "0.8602856",
            "sentiment_compound": 0.5542
        },
        {
            "id": "h0zgy6h",
            "score": 1,
            "text": "Well that's if you assume he was fighting instead of just collecting a check. He had to let it drag on, on purpose otherwise it would have been over in like 20 seconds.\n\nIt's like when a super famous academy award actor does Broadway at the end of their career. It's not exactly the thing they are world renowned at but it's close and it's fun for them. And if they can get paid for doing something they love why not?",
            "title_similarity": "0.74203545",
            "sentiment_compound": 0.9501
        },
        {
            "id": "h0zh5l9",
            "score": 1,
            "text": "The fight was only ever a \"stupid people tax\".",
            "title_similarity": "0.6149914",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h0zhc9a",
            "score": 1,
            "text": "Only Floyd NEVER picked the best opponent possible. He cherry picked all of his opponents, either fighting them too early when they couldn’t win or waited for when they were older or too slow/more run down.  He is the GOAT of not taking any risks.",
            "title_similarity": "0.77145535",
            "sentiment_compound": -0.0654
        },
        {
            "id": "h0zhd4q",
            "score": 1,
            "text": "Dude went 50 and 0 and saw an easy way to make millions. Who wouldnt",
            "title_similarity": "0.52452517",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0zhoq1",
            "score": 1,
            "text": "You think he give a fuck? Got got atleast 100 mil and all u can do is a reddit post.",
            "title_similarity": "0.5347823",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0zhvbu",
            "score": 1,
            "text": "I dislike his style with a passion, just as a soccer fan I hate the teams that defend the entire game and win for a single goal. But it's a style and he owns it. \n\nBut if I was in his place and someone offered me a 7 digits check for clowning in a fake fight I'll do it 🤷🏻",
            "title_similarity": "0.8017872",
            "sentiment_compound": -0.7684
        },
        {
            "id": "h0zi6i6",
            "score": 1,
            "text": "What should diminish Floyd's legacy is the fact that as the *arguably* GOAT boxer, he basically carried the sport into obscurity. Every single one of Floyd's big time fights had massive hype and he's great at hype but his fights are boring. The only people that find Floyd an entertaining fighter are boxing nerds that actually know what their watching. Most regular people see a bunch of blocked punches and dancing. Casual fans aren't entertained by that. I think most people would rather see Conor knock someone out in 45 seconds than watch Floyd dance around the ring and land some jabs for 15 rounds. Floyd managed to make 2 fights with Manny Pacquiao boring. He's a boring fighter, a great boring fighter, maybe the best boring fighter and he was the man on top of the boxing world as it began it's decent into niche-dom.",
            "title_similarity": "0.8868094",
            "sentiment_compound": 0.0292
        },
        {
            "id": "h0zi8ki",
            "score": 1,
            "text": "You can buy your way into the  presidency so why not buy your way into anything.",
            "title_similarity": "0.39063692",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zib93",
            "score": 1,
            "text": "Dang lol these comments are actually changing my view",
            "title_similarity": "0.24668708",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0zijax",
            "score": 1,
            "text": "That's true and all. But gotta get that 💰!",
            "title_similarity": "0.06290117",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h0zijwa",
            "score": 1,
            "text": "Mayweather ruined his own legacy when he adopted the *clinch-when-infighters-break-through-my-defenses-and-wait-for-the-referee-to-save-me* strategy.\n\nSo, it was ruined well before this fight.",
            "title_similarity": "0.77777267",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h0ziq9f",
            "score": 1,
            "text": "…how does this remotely tarnish his legacy?\n\nOP you’re bored and this is a shit take",
            "title_similarity": "0.541948",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0zizkr",
            "score": 1,
            "text": "These types of fights have been happening forever in boxing. The fact that so many of you don’t understand that shows how little you know of boxing and it’s history.",
            "title_similarity": "0.7074088",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0zjnnj",
            "score": 1,
            "text": "money don't care about legacy",
            "title_similarity": "0.3686752",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h0zjpbh",
            "score": 1,
            "text": "Logan paul just reveals what a shitbox boxing has became.",
            "title_similarity": "0.6883352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zkhmq",
            "score": 1,
            "text": "This 'fight' was an exhibition, without judges, and without a declared winner. Much like his fight with McGregor, it was used as a means of entertainment. He carried Paul through the fight like he carried Conor, and he was never in it to build on his already cemented legacy - if you can't respect that his legacy was already set in stone, then your view is diluted and narrow. He was even quoted shortly after saying that he is always open to provide an entertainment factor, but is 100% done boxing, and this didn't change that stance. How you can shame a legends legacy for knowing how to utilize his name to make money and brings fans an entertaining spectacle is ignorant. \n\nWhat I think is sorely disregarded in your view is the fact that the professional boxing scene is already shit compared to what it once was. This fight, the Ochocinco fight, and all the other Paul fights brings a new wave of fans to a new form of entertainment - but it's not boxing at any level compared to the highest, and it was never trying to. Professional boxers will still fight each other for real status and legacy, but boxing hasn't been relevant enough to warrant these exhibitions diminishing or building any prominence. Mayweather was a GOAT before this event, and he still is afterward.",
            "title_similarity": "0.7827507",
            "sentiment_compound": -0.9745
        },
        {
            "id": "h0zkhrp",
            "score": 1,
            "text": "We are at the end. No one cares about legacy or the professional boxing scene.",
            "title_similarity": "0.5410532",
            "sentiment_compound": -0.569
        },
        {
            "id": "h0zkpi3",
            "score": 1,
            "text": "Ask Floyd Mayweather if he would rather keep his sacred legacy or make $100m per fight with zero risk of head injury?",
            "title_similarity": "0.6275107",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0zl53x",
            "score": 1,
            "text": "I was impressed to see Logan last 8 rounds. When Mayweather started walking him down and got a few good hits in I thought it was the beginning of the end like in the Conor fight.  Props to Logan for hanging in there.  \n\nProps to Mayweather for fighting a much larger, taller, longer, younger guy.  Mayweather is not just 40, he’s 44.  That’s 10% more than 40. He showed some wicked speed the few times he managed to get past Logan’s ridiculous reach. I wish it were 12 rounds so we could have a more definitive outcome. \n\nSo I was entertained.",
            "title_similarity": "0.74625194",
            "sentiment_compound": 0.5046
        },
        {
            "id": "h0zlczv",
            "score": 1,
            "text": "Not if he destroys Paul in 5 seconds. If he draws it out and makes it seem close then fuck him.",
            "title_similarity": "0.6318518",
            "sentiment_compound": -0.1471
        },
        {
            "id": "h0zldx9",
            "score": 1,
            "text": "I dunno. Lots of famous golfers play charity events just for fun. I don't think it diminishes their legacies at all...",
            "title_similarity": "0.48424715",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0zlg6f",
            "score": 1,
            "text": "If you're 50-0 you get to have some fun. Whether it's watching McGregor re-evaluate his cardio, or getting pillow-fought by a you-tuber, you get room for fun when you've won the fights that matter. \n\nIt's not like we saw something shocking from Paul. He fights like a high-schooler. Enthusiasm and little else. He throws hands like European football refs throw flags, but to much less effect.",
            "title_similarity": "0.78776085",
            "sentiment_compound": 0.6181
        },
        {
            "id": "h0zlkvg",
            "score": 1,
            "text": "I don’t think it at all diminishes his career. He’s one of the greatest ever and that didn’t end yesterday because of one match. Especially with the difference in weight and age.",
            "title_similarity": "0.6340771",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0zm6az",
            "score": 1,
            "text": "Lmfao bro reddit needs to quick with the hate. Please bro go touch grass or something ahaha. Do then Ali vs all those other non boxers diminishes his legacy and all the other greats who fought non boxing opponents are trash now? Beo go outside.",
            "title_similarity": "0.68927693",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0zm9ow",
            "score": 1,
            "text": "Floyd cares about money only. So let him be. 😂",
            "title_similarity": "0.45707884",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0zmebn",
            "score": 1,
            "text": "Who?",
            "title_similarity": "-0.08870436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zmpye",
            "score": 1,
            "text": "Mayweather is NOT the greatest boxer of all time. Watch some YouTube videos of real boxers please. The technique of hit, hit then grab your opponent works but is not a greatest boxer ever technique. Watch the Mohammad Ali and George Foreman fight of 1974, 7 rounds of Ali taking a beating from a giant in his prime that knocked out every opponent within the first 2 rounds only to have George so tired in the 8th that he could barely lift his arms and then Ali knocked him out was one of the most epic fight ever and there were still just as good if not better fighters than Ali.",
            "title_similarity": "0.89555115",
            "sentiment_compound": -0.97
        },
        {
            "id": "h0zmsa9",
            "score": 1,
            "text": "Mayweather been killing boxing for a long time. Defensive dancing and the refs call it by points every time. Its garbage. Honestly I feel that Mayweather can't actually fight, just knows the rules really really well.",
            "title_similarity": "0.8573564",
            "sentiment_compound": 0.3727
        },
        {
            "id": "h0znom6",
            "score": 1,
            "text": "It totally does, unless Paul goes on to have a serious boxing career.",
            "title_similarity": "0.6154442",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0zorm1",
            "score": 1,
            "text": "Lol. Dude. Do you watch boxing? This is a CLASSIC riskless fight for PBF. He made crazy bank. Didnt really take any damage. \n\nConsider the flip side. If he lost, we boxing fans would have recognized that Floyd is over the hill and hasn't fought in years and is in the ring with a much bigger opponent. \n\nOr think about this. Most boxing fans dont care that Tommy Hearns lost a fight late in his career. Hearns was one of the 4 kings of the 80s. Nothing will change that. Just as this fight would mean nothing to boxing fans. It would only impact casuals.",
            "title_similarity": "0.87381816",
            "sentiment_compound": -0.9221
        },
        {
            "id": "h0zp5wo",
            "score": 1,
            "text": "Accessible for the right amount of money. No common person could set up a fight with him out of nowhere if there were no profit in it for him. \n\nHe's known as a business man out of the ring as much as he is a great fighter inside of it. This was frankly a damn good choice for him financially and that's been a big motivating factor in his chosen opponents. Why should he have to bend to the will of what is expected when he can literally do what he wants with his fame, his abilities and who he wants to fight? As far as I can see he only served his legacy even better, it's like a big trolling joke to the rest of the fighting world, proving he is King of his profession and doesn't really have to bow to anyone. \n\nIt's no secret that Floyd is a complete lush. He spends a million like it's NOTHING. Made the right offer and the right person to go up against he'd fight it for sure. \n\nHis game has been about making bank for a long ass time. Why would he deny himself the opportunity to get far richer than he was? He'd of made what most of us could only dream of in one fell swoop. It would be stupid to NOT do it. \n\nSaying all of that, do you genuinely think he cares about professionalism or diminishing his legacy over the balance of his bank account lol? He's laughing all the way to his next fight. It's just a game to him now and he's probably always gonna win frankly.",
            "title_similarity": "0.8010222",
            "sentiment_compound": 0.958
        },
        {
            "id": "h0zpf63",
            "score": 1,
            "text": "that was exactly floyd's legacy: the \"anti boxing\"",
            "title_similarity": "0.56978846",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0zpfbv",
            "score": 1,
            "text": "Are people legitimately concerned about Floyd's legacy? Why should anyone care about this woman beating dirtbag?",
            "title_similarity": "0.5643602",
            "sentiment_compound": 0.1431
        },
        {
            "id": "h0zpr8w",
            "score": 1,
            "text": "Eh. It's a sport where the objective is to cause a concussion. It shouldn't exist, and a stunt like this unfortunately elevates its prominence.",
            "title_similarity": "0.6149199",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h0zpwph",
            "score": 1,
            "text": "Literally who cares. There was money to be made and life is way to short. Need I say more.",
            "title_similarity": "0.39655477",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0zpxdd",
            "score": 1,
            "text": "It would’ve been entirely different if Floyd knocked Logan out. But instead floyd just put on a WWE match, maybe that will be his next career move.  The professional boxing scene has been dying tho. UFC has was better marketing. Boxing is like the oldies of martial arts.",
            "title_similarity": "0.8260537",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h0zpy6o",
            "score": 1,
            "text": "With the millions of dollars he made to train and have to work for one night I’m pretty sure he doesn’t give af.",
            "title_similarity": "0.6351313",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0zpzih",
            "score": 1,
            "text": "You have NEVER seen a check with that many zeros. Maybe you are in no position to judge. There is not even a chance you wouldn't do the same if you could",
            "title_similarity": "0.48155892",
            "sentiment_compound": -0.4479
        },
        {
            "id": "h0zqfdg",
            "score": 1,
            "text": "Mayweather makes an ungodly amount of money for punching people in the face. Logan Paul makes an ungodly amount of money being an asshole online. I don't think any of this requires the level of reverence you're trying to apply to it.\n\nEdit: I'm not saying boxing is easy, or that Mayweather hasn't put in a lot of training, or that Mayweather isn't an impressive athlete. But at the end of the day it's just a sport.",
            "title_similarity": "0.83400065",
            "sentiment_compound": 0.0256
        },
        {
            "id": "h0zragi",
            "score": 1,
            "text": "Mayweather yes... boxing as a whole no. A lot of the boxing community thinks floyd is a fraud. He is very polarizing. But i mean he coukdnt knock out a youtuber so its incredibly embarrassing for him.",
            "title_similarity": "0.8622571",
            "sentiment_compound": -0.6989
        },
        {
            "id": "h0zrara",
            "score": 1,
            "text": "He made 100 plus million dollars for a fight that doesn't even matter. Floyd 44 and retired, his legacy is already written. He just having fun and making money now. I think people take it way to seriously.",
            "title_similarity": "0.6369107",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h0zrsjy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05570983"
        },
        {
            "id": "h0zrzjf",
            "score": 1,
            "text": "All a bunch of bullshit. If it was an exhibition match then neither of them should have been paid. Fuck these rich assholes duping people out of money. If you fall for this type of horse shit then you deserve to have your money taken.",
            "title_similarity": "0.7327909",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h0zs6sk",
            "score": 1,
            "text": "two disgraceful famous people tricked a bunch of idiots into giving them millions of dollars.",
            "title_similarity": "0.63473535",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0zsh2o",
            "score": 1,
            "text": "Completely agree.",
            "title_similarity": "-0.10843891",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h0ztfrw",
            "score": 1,
            "text": "Maybe he just wants to kick Logan Paul's ass and get paid to do it? Pretty sweet deal if you ask me",
            "title_similarity": "0.5894754",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0ztfut",
            "score": 1,
            "text": "That's like saying if Michael Jordan plays a pickup game of hoops it tarnishes his legacy.  Nah dog.",
            "title_similarity": "0.65860885",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0ztj1n",
            "score": 1,
            "text": "I would argue the greatest boxer of all time. While he is a great technical boxer he is by no where near the greatest.",
            "title_similarity": "0.7042477",
            "sentiment_compound": 0.872
        },
        {
            "id": "h0ztu9n",
            "score": 1,
            "text": "It says way more about the state of boxing. That the “greatest of all time” (who avoided Manny in his prime to protect his undefeated record) last 2 fights have been a UFC star and a YouTube star. Boxing is dying",
            "title_similarity": "0.88268006",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0zu6dq",
            "score": 1,
            "text": "Totally disagreed. Anyone with common sense saw this as one big cash grab and most people aren't going to call Floyd an idiot for turning down many millions for a pointless exhibition that true fans of the sport really don't care about.",
            "title_similarity": "0.7224177",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h0zuti4",
            "score": 1,
            "text": "Mayweather's legacy isn't that great to me anyways. He ducked a lot of fighters and never took a fight he wasn't sure to win. All the big names he took down he only fought after they were all well past their primes with few exceptions. On top of that he doesn't really have any memorable fights at all. He's an all time great for sure but tarnishing his legacy isn't all that much of a loss",
            "title_similarity": "0.7803706",
            "sentiment_compound": -0.538
        },
        {
            "id": "h0zv2tf",
            "score": 1,
            "text": "I’m not a boxing fan but I think it’s clear all parties here are just in it for the paycheck",
            "title_similarity": "0.58735716",
            "sentiment_compound": 0.7557
        },
        {
            "id": "h0zv5ai",
            "score": 1,
            "text": "Mayweather retired long ago, he can do whatever the fuck he wants to do now, lmao",
            "title_similarity": "0.40976024",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0zvvkz",
            "score": 1,
            "text": "Boxing can’t get more diminished than it is. People originally liked it because it was the best way to see incredible athletes fight each other. After ufc came out, people realized that boxing is arbitrary, has too many rules and is absolutely nothing like real fighting",
            "title_similarity": "0.8410795",
            "sentiment_compound": 0.5918
        },
        {
            "id": "h0zvzg3",
            "score": 1,
            "text": "Real shit. How to turn your sport into a joke with a entire generation. Great to know you dont actually have to work hard as a fighter to be able to fight the people considered masters and champions of the sport you just need to have enough internet clout from being a massive piece of shit.",
            "title_similarity": "0.810539",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0zw9m9",
            "score": 1,
            "text": "Pffft. Tell that to his million bucks.",
            "title_similarity": "0.36636388",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zwphr",
            "score": 1,
            "text": "e x h i b i t i o n \n\nyou're also over valuing how celebrity is accrued by an individual. totally incapable of being objective.",
            "title_similarity": "0.6282761",
            "sentiment_compound": -0.1263
        },
        {
            "id": "h0zwvlb",
            "score": 1,
            "text": "This does nothing to diminish his legacy, he’s retired at 50-0. He’s 43 years old and this was the equivalent of a sparring session for him, except he made millions of dollars. He is Floyd “Money” Mayweather for a reason. This was an exhibition fight with zero judges so it wasn’t going to affect his record. \n\nAs for the professional boxing scene, any spotlight on the sport is a plus. And as was expected, Floyd dominated Logan Paul.",
            "title_similarity": "0.81168306",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0zww9g",
            "score": 1,
            "text": "102 mil is 102 mil 🤷🏼‍♂️",
            "title_similarity": "0.118435934",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zytp1",
            "score": 1,
            "text": "Who cares, it's two dudes getting paid to maul each other within reason.",
            "title_similarity": "0.57412577",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0zywe3",
            "score": 1,
            "text": "I doubt Mayweather cares. He made millions off this fight. It was a promotional stunt.",
            "title_similarity": "0.72200644",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0zyypj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05570983"
        },
        {
            "id": "h0zz0e8",
            "score": 1,
            "text": "Child support is a hell of an incentive",
            "title_similarity": "0.18000984",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0zzgjr",
            "score": 1,
            "text": "Why wouldn’t Floyd fight him? He just made millions of dollars for doing nothing. It’s your fault for taking the fight so seriously. Good for Logan Paul being able to monetize something like that and Floyd was smart enough to capitalize on it",
            "title_similarity": "0.74355567",
            "sentiment_compound": 0.4931
        },
        {
            "id": "h0zzykv",
            "score": 1,
            "text": "Not for millions of dollars it doesn’t lol. You would do the same.",
            "title_similarity": "0.3298512",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1018xb",
            "score": 1,
            "text": "Nahhhh. He’s paid his dues to the boxing world and has promoted himself to billionaire status. He has always invested in himself, and if he wants to take an exhibition fight to make some more cash then so be it. He did Logan Paul a favor and significantly increased his net worth. If you actually took the fight seriously you’re dumb to begin with. They’re in two different realms size wise, age wise, shit to prove wise.",
            "title_similarity": "0.74916637",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h101id7",
            "score": 1,
            "text": "The only legacy I know about Mayweather is that he can’t read, really rich yet still act poor.  I don’t see how this fight changes anything",
            "title_similarity": "0.6936221",
            "sentiment_compound": -0.2975
        },
        {
            "id": "h101k90",
            "score": 1,
            "text": "Greatest defensive fighter of all time?...Ok. Of all time?!??  I don’t think so.",
            "title_similarity": "0.6258049",
            "sentiment_compound": 0.7993
        },
        {
            "id": "h101omy",
            "score": 1,
            "text": "Mayweather diminished his legacy when he decided to beat on women. Boxing hasn't been a legitimate sport for the past 20 years or so now and these sorts of celebrity exhibition matches are a last ditch effort to get the younger generation interested in a dying sport.",
            "title_similarity": "0.82127094",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h102241",
            "score": 1,
            "text": "1.) it was an exhibition boxing round with no judges\n\n2.) they each made $20+ mil, it was a payday not a title fight",
            "title_similarity": "0.688239",
            "sentiment_compound": -0.0041
        },
        {
            "id": "h102gt6",
            "score": 1,
            "text": "You’re talking about accessibility like everyone has the millions it takes to get into the ring with Mayweather. Me, you, or the random joe across the street wouldn’t even draw in a single percent of what Logan Paul did if we were fighting. I think it’s a bit ridiculous to be criticizing Mayweather when this is the kind of thing he’s on brand for and what made him his stacks. He’s cocky, he’s annoying, but he’s one of the best and practically no one can do shit to him in a boxing ring. He doesn’t owe the professional boxing scene anything because what he accomplished wasn’t handed to him.",
            "title_similarity": "0.8679602",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h103pru",
            "score": 1,
            "text": "Depending on the ppv takings logan is guaranteed a miminum of 250000. 10% box office stake. Mayweather however is expecting to take between 50 and 100 million.",
            "title_similarity": "0.49139297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1040pb",
            "score": 1,
            "text": "This is the most relevant boxing has been in years, and although I prefer WWE when it comes to scripts; it’s working. It’s sad but it’s giving attention to a sport that has been forgotten in recent years.",
            "title_similarity": "0.74162734",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1042nf",
            "score": 1,
            "text": "please stop giving them attention.....",
            "title_similarity": "0.1778701",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1045gg",
            "score": 1,
            "text": "These are exactly the kind of spectacle events declining sports need to stay relevant in the mind of the average Joe. Getting an athlete that's one of the best of a generation to put on a show with a celebrity to make headlines and make millions isn't taking away from his record or the sport itself. A week from now no one will be talking about it. But there will be more and more of these in the future, tangential to the more conventional events, hyping up each other to gain as many viewers as possible.",
            "title_similarity": "0.71713567",
            "sentiment_compound": 0.765
        },
        {
            "id": "h1047mf",
            "score": 1,
            "text": "No I don’t think it does. The “fight” was a joke from the beginning, 100% designed to milk $50 from NPC’s. And it was very successful",
            "title_similarity": "0.6276307",
            "sentiment_compound": 0.624
        },
        {
            "id": "h104nh0",
            "score": 1,
            "text": "Dude can't read.  What legacy?",
            "title_similarity": "0.2916873",
            "sentiment_compound": 0.0
        },
        {
            "id": "h104p85",
            "score": 1,
            "text": "Unless he just knocks him out in one hit, Drederick Tatum vs Homer Simpson style",
            "title_similarity": "0.61692584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h105yqr",
            "score": 1,
            "text": "Change my view: stop giving these fucking parasites airtime and attention, people like you are the exact reason this stuff happens and they're walking off with millions.",
            "title_similarity": "0.6397488",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1067tt",
            "score": 1,
            "text": "Fuck off.. all you guys are just waiting for someone to knock Logan the fuck out. CHANGE MY VIEW",
            "title_similarity": "0.57617706",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h106grr",
            "score": 1,
            "text": "Somebody please tell me:  Why should I care?",
            "title_similarity": "0.17462316",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h106q3r",
            "score": 1,
            "text": "The issue is not so much putting on a dogshit event, it's that so many people are willing to support such garbage. It's hard to blame the promoters when you see the draw.\n\nAlso hard to blame the participants when you see the payout. \n\nContinuing to bring it up only fosters more.",
            "title_similarity": "0.59303045",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1074bz",
            "score": 1,
            "text": "We live in a pure capitalist society. If anything, this increased the value of both Boxing and Mayweather",
            "title_similarity": "0.5195078",
            "sentiment_compound": 0.5824
        },
        {
            "id": "h107r4s",
            "score": 1,
            "text": "Floyd Mayweather never cared about boxing. Floyd Money just wants money. And he fucking made it. And maybe he can’t read, but he got what he wanted. And the idiocracy paid him",
            "title_similarity": "0.7514874",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h1083ir",
            "score": 1,
            "text": "CMV: the thing that everybody is thinking anyways.",
            "title_similarity": "0.15416427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h108d2l",
            "score": 1,
            "text": "Wasnt it an exhibition match that no one took seriously anyway? Boxings was dead before this",
            "title_similarity": "0.7005035",
            "sentiment_compound": -0.802
        },
        {
            "id": "h108kvd",
            "score": 1,
            "text": "He did it for the money, don't see how that tarnishes his record. It wasn't a legit match, it was for show.",
            "title_similarity": "0.49426767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h109gz8",
            "score": 1,
            "text": "Circus",
            "title_similarity": "0.022302961",
            "sentiment_compound": 0.0
        },
        {
            "id": "h109le0",
            "score": 1,
            "text": "Counter point: Money",
            "title_similarity": "0.2183743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10b7rw",
            "score": 1,
            "text": "I think he decided he was sick of being the best boxer, & wants to be the richest one",
            "title_similarity": "0.78854877",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h10bdrp",
            "score": 1,
            "text": "Can't the guy get a break one time? \n\nWhen else are you going to get the opportunity to beat the piss out of Logan paul AND get paid? I would have taken it if I was Mayweather too",
            "title_similarity": "0.64273214",
            "sentiment_compound": 0.1179
        },
        {
            "id": "h10bduw",
            "score": 1,
            "text": "Mayweather just added zeroes to his accounts. He does not care.",
            "title_similarity": "0.51173127",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h10blj1",
            "score": 1,
            "text": "He did it for the money, you said it yourself\n\nAfter the athletic career is over you'll do anything for the money and publicity\n\nI'm sure even Michael Jordan would go one on one in basketball with some fan if the paycheck was good enough",
            "title_similarity": "0.66576827",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h10bwp2",
            "score": 1,
            "text": "It's not good for boxing which is been having a hard enough time in recent years. Mayweather is not a greatest of all time boxer in my own opinion but thays another discussion. Makes him look bad for doing shit like this. I wasn't a fan of him doing the McGregor thing but this is even worse.  Just money grabs and people are more than willing to oblige.",
            "title_similarity": "0.8155856",
            "sentiment_compound": -0.9523
        },
        {
            "id": "h10c4nr",
            "score": 1,
            "text": "Well OP, I didn't have an opinion about this before I read your opening statement, but by the end you had me convinced. *tips hat*",
            "title_similarity": "0.4037508",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h10c8rk",
            "score": 1,
            "text": "He's a fucking wife beater who has the most boring fighting style in the history of boxing, his legacy is shit",
            "title_similarity": "0.8223621",
            "sentiment_compound": -0.839
        },
        {
            "id": "h10cf7s",
            "score": 1,
            "text": "Bro seriously, boxing is extremely boring to watch. 12 rounds of tag, you're it! and hugging.... At leats with these type of events, people will stay interested.",
            "title_similarity": "0.76830566",
            "sentiment_compound": 0.3609
        },
        {
            "id": "h10cr4v",
            "score": 1,
            "text": "Muhammad Ali fought Antonio Inoki. Was the most garbage exhibition ever and should have ruined any respect either had in their respective professions and both were still active in their careers too. In the end it just ended up being a oddity on both of their careers and they were still bankable after.",
            "title_similarity": "0.8255442",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h10d33b",
            "score": 1,
            "text": "The professional boxing scene didnt need Floyd Maywather V Logal Paul to be minimized from its former glory, was already a dying sport",
            "title_similarity": "0.80943",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h10d6a4",
            "score": 1,
            "text": "Mayweather tarnished his own legacy to be honest. He’s a workaholic and he came from a broken home. But his record is a bit suspect from the start. He always dodged fighters and only fought them past their prime just look at what happened with the Pacquiao fight. Pac-man should’ve fought Mayweather years before the fight happened. Mayweather only took the fight when he started to notice Pacquiao beginning to lose to Father Time. \n\nHe’s also a bully from how he treats his girlfriends and the way he beat that Japanese kickboxer when he was much heavier bigger and also came to the venue two hours late. He bear Dela Hoya when he was on the decline, which isn’t his fault since he was still a newcomer then. But if you actually look into his fights and the timing of them his record is impressive, but a lot of them should have asterisks next to them. Yes, he fought Canelo, but he fought him when Canelo was still green and honestly wasn’t ready for Mayweather. Mayweather is impressive for his work ethic and drive, but he’s a marketing man first and a boxer second. He won’t take a fight that he knows he won’t win and he hasn’t taken a lot of huge risks compared to the greats in the past. Definitely read “Money” to gain more insight into the figure the writing is a little rough sometimes, but it gives a lot of context about Mayweather.",
            "title_similarity": "0.86492985",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h10dl7u",
            "score": 1,
            "text": "Of course. Boxing is becoming a joke if they keep this up.",
            "title_similarity": "0.66010654",
            "sentiment_compound": 0.296
        },
        {
            "id": "h10efcv",
            "score": 1,
            "text": "Mayweather continually says he's there to make money. He'd beat up your grandmother in a nursing home for money. He didn't go 50-0 by fighting the greatest. He picks his fights. Him beating up someone who stands no chance for money is basically a summary of his entire career.",
            "title_similarity": "0.7823762",
            "sentiment_compound": -0.5775
        },
        {
            "id": "h10efq0",
            "score": 1,
            "text": "Rocky Marciano fought hundreds of exhibition bouts and he's still remembered for being a Legend.\n\nEveryone hates on Mayweather because of who he is as a person but his legacy as a fighter is unquestionable.",
            "title_similarity": "0.81001437",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h10f0i1",
            "score": 1,
            "text": "Exhibition matches have been joke fights since forever. What's different now is that the internet allows people completely ignorant about the sport to watch it and talk about it on an insane scale, so suddenly the joke fights get more attention than the real stuff.\n\nBtw Mayweather has been retired for years, he can do anything he wants and it won't change his record. And he was never the goat, he always dodged the fights he thought he couldn't win.",
            "title_similarity": "0.814288",
            "sentiment_compound": -0.891
        },
        {
            "id": "h10frkl",
            "score": 1,
            "text": "Nah. Nobody’s going to talk about this event in the future.",
            "title_similarity": "0.26417822",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h10g43y",
            "score": 1,
            "text": "Mayweather fights to make money. He\"s a prize fighter and fans have only known him as such. For almost all of his career he sucessfully used his skill to fight for the largest prizes possible. Now, because his days as a fighter are limited he has to do what he can to win more big prizes. I would guess that he also wants to retain his legacy as a champion. \n\nThis YouTube fight gives him the opportunity to do what he does, and accomplish his gosls. \n\nIt will not diminish his legacy because fighting for money and putting on a show for the fans is very familiar ground flor us.",
            "title_similarity": "0.8061832",
            "sentiment_compound": 0.9297
        },
        {
            "id": "h10g7hb",
            "score": 1,
            "text": "He made money who cares. Humans love to talk about other humans achievements. He only cares about money.",
            "title_similarity": "0.5289178",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h10h3z1",
            "score": 1,
            "text": "Floyd said so himself. Legacy won't feed his children. He might be lowering his value in the professional boxing scene but considering that A he's 44 years old now, way past his prime and B that he hasn't won a fight in 4 years, the man needs a way to make money, a way for him to survive",
            "title_similarity": "0.77454674",
            "sentiment_compound": -0.2549
        },
        {
            "id": "h10hk0k",
            "score": 1,
            "text": "Boxing is one step removed from WWE. why don't ppl see this.... nothing about modern-day boxing is related to competition. Its a money grab at best... wtf do ppl buy ppv for any sport. Do you see the Olympics on PPV? Fighting is a money grab. It should be on cable TV like other professional sports. Shit is a joke",
            "title_similarity": "0.78429055",
            "sentiment_compound": -0.25
        },
        {
            "id": "h10i2bm",
            "score": 1,
            "text": "The guy was always about the money.\n\nIf anything, this raises his legacy. He made easy money.",
            "title_similarity": "0.4181219",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h10ielp",
            "score": 1,
            "text": "What I got out of it is that Merryweather doesn’t have any skills, that luck and fame are all it takes to be a “great boxer”",
            "title_similarity": "0.79290533",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h10j3vc",
            "score": 1,
            "text": "IMO these YouTube fights do absolutely nothing for boxing - good or bad. \n\n\nPeople watching the circus fights are mostly people who come and go with the social media presences\n\nAnd people who are into boxing fr will continue to watch blockbuster matches like fury wilder 3 etc \n\n\nTbh I never really got why everyone was talking about what these YouTube fights mean for boxing - to me it’s absolutely nothing - good or bad",
            "title_similarity": "0.7806325",
            "sentiment_compound": -0.9036
        },
        {
            "id": "h10k714",
            "score": 1,
            "text": "Did you hear what he had to say about it in the press conference?  If he doesn’t care neither should you.",
            "title_similarity": "0.46819544",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h10kduc",
            "score": 1,
            "text": "It's analogous to a pro-am golf tournament. \n\nIt's not competition boxing. It's a boxing based spectacle. A goof.",
            "title_similarity": "0.6413987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10kytb",
            "score": 1,
            "text": "Me you and everyone else know it was just a money grab. Nothing was diminished. No one cares about your view if this is it, because it’s a stupid one. Did I change it?",
            "title_similarity": "0.5488618",
            "sentiment_compound": -0.6114
        },
        {
            "id": "h10lbl0",
            "score": 1,
            "text": "Still made mad money though-  he’s said “can’t feed kids legacy”",
            "title_similarity": "0.62508136",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h10li2j",
            "score": 1,
            "text": "Professional sport *and* YT are platforms that use content creators' labor to harvest money. The more you clutch your pearls, the more free advertising you provide as you discuss your concerns on social media. *The products work as designed.*",
            "title_similarity": "0.440511",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h10liai",
            "score": 1,
            "text": "It literally does nothing to his legacy - it was an exhibition match; not any different than any of the old-timey boxers that got in a ring with a bear. The Paul fight has nothing to do with his professional accomplishments and has no impact on what he did for the sport during an era where sub-heavyweight fighters were the main draw.",
            "title_similarity": "0.7290546",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h10lo49",
            "score": 1,
            "text": "I think the main thing is Mayweather literally does not care. He got 100 million for dancing around with some kid he doesn’t give a *fuck* about.",
            "title_similarity": "0.6938289",
            "sentiment_compound": -0.7293
        },
        {
            "id": "h10mls7",
            "score": 1,
            "text": "At this point the ONLY difference between pro boxing and the pro wrestling is the predetermination of the results. \n\nOther than that, theyre the same formula for entertainment. Its hilarious when people are fans of one but throw hate at the other. \n\nSame can be said for the UFC. \n\nThey all focus on selling you a story and a reason to either like or hate the competitors. For now the only thing differentiating boxing and UFC from wrestling is the real competion of it. \n\nId bet that  if either of the other two industries found out a way to financially capitalize on predetermined results, theyd toss the integrity of their sports in a heartbeat.",
            "title_similarity": "0.7987671",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h10mo2t",
            "score": 1,
            "text": "You are correct.",
            "title_similarity": "-0.13176402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10mtpv",
            "score": 1,
            "text": "To me his legacy was already diminished in how he’d coast out wins and dodged fights by asking for ridiculous pots in his favour that no one in their right mind would agree to (another way to say no I won’t fight you). I feel he wasn’t good for the sport when he was in it, let alone now with this joke of a fight he had with Logan.",
            "title_similarity": "0.82176316",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h10my10",
            "score": 1,
            "text": "I hear Mayweather is getting $100 million for this fight. For that kind of money I suspect most people would be accessible.",
            "title_similarity": "0.52031296",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h10n27f",
            "score": 1,
            "text": "From the words of Mayweather himself, “You can’t feed a family with legacy.”",
            "title_similarity": "0.44798276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10n3sk",
            "score": 1,
            "text": "Floyd dont care. Floyd got paid",
            "title_similarity": "0.39624262",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h10nisl",
            "score": 1,
            "text": "Boxing used to have it where random ass people could walk up to the ring and challenge the champ back in the day. I'm not sure when precisely you think boxing got too good for that but you're wrong.",
            "title_similarity": "0.7586453",
            "sentiment_compound": -0.5763
        },
        {
            "id": "h10nlpv",
            "score": 1,
            "text": "He went 49 and 0\n\nHim counting Connor as his 50th victory is what diminished his legacy.",
            "title_similarity": "0.6810066",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10o22k",
            "score": 2,
            "text": "100% disagree. Mayweather is the greatest defensive boxer to have ever stepped in the ring, maybe the greatest ever. Mayweather is in his 40s and all he had to do  In the ring was box some kid less than half his age, almost 40lbs on him and got 50-100M for it. He milked an exhibition match not even a real rated match for that much money and walked out. He said it best” this is a legalized bank robbery”.",
            "title_similarity": "0.8774634",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h10oa7l",
            "score": 1,
            "text": "He’s 50 he’s just making money. It isn’t professional boxing.",
            "title_similarity": "0.69626784",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10of7g",
            "score": 1,
            "text": "Its more like giving the make a wish kid his greatest wish at this point.",
            "title_similarity": "0.30030096",
            "sentiment_compound": 0.9334
        },
        {
            "id": "h10ojce",
            "score": 1,
            "text": "Yeah but money",
            "title_similarity": "0.078774",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h10owuc",
            "score": 1,
            "text": "Legacy doesn’t pay the bills, but millions of dollars made lightly punching a YouTuber in the face does. Whenever I hear about legacies I remember Al Bundy making four touchdowns in a single game.",
            "title_similarity": "0.729658",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h10oxck",
            "score": 1,
            "text": "Who cares? Just shutup and stop whining about it.",
            "title_similarity": "0.34702694",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h10p4kh",
            "score": 1,
            "text": "Yup, turned a honorable sports tradition into a fucking cash out clown show...shameful",
            "title_similarity": "0.626185",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h10p7y8",
            "score": 1,
            "text": "This Paul stuff has definitely made me look at boxing in a worse light, but I hold nothing against the people getting paid tons to fight them. If i had the chance to get $500,000 to take 3 punches from jake I'd do that in a heartbeat. Millions to beat up on Logan for a couple rounds wouldnt even be a question.",
            "title_similarity": "0.8090734",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h10p9kt",
            "score": 1,
            "text": "Yeah it turns boxing into a joke but he made so much money with out having to do any work.",
            "title_similarity": "0.73189723",
            "sentiment_compound": 0.296
        },
        {
            "id": "h10plx7",
            "score": 1,
            "text": "Mayweather spends $$$$ like I eat cornflakes.  He should be thanking his lucky stars people are stupid enough to throw money at him to fight a Logan.",
            "title_similarity": "0.68985564",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h10pr15",
            "score": 1,
            "text": "Was there ever a professional boxing scene? There's no legacy to be diminished if there isn't an actual legacy itself, or if a legacy is built on lies.",
            "title_similarity": "0.6353427",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h10qiup",
            "score": 1,
            "text": "Mayweather has always been an entertainer, he’s known as “Money” for a reason. This also further proved that.\n\nBoxing fans are still gonna watch boxing. This potentially now has a bunch of Logan Paul fans/non boxing fans watching boxing now. \n\nSo there’s a solid argument that this further developed Mayweathers “Money/entertainer” legacy and that this further popularizes boxing. \n\nAlso, seems like a lot of you guys don’t know what an exhibition is.",
            "title_similarity": "0.7402398",
            "sentiment_compound": 0.7063
        },
        {
            "id": "h10qo8f",
            "score": 1,
            "text": "Honestly, there was a ton of money in it and both sides knew.",
            "title_similarity": "0.24699008",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h10qtw4",
            "score": 1,
            "text": "Floyd made 100 million, probably more, for fighting Logan Paul, I don't think he gives a flying fuck what you or anyone else on the planet thinks about his legacy when he's making that kind of money for the circus show. He's gonna book more of these exhibition fights, make more money from them and not a single one will touch his perfect 50-0 record so he won't give a shit",
            "title_similarity": "0.7711743",
            "sentiment_compound": -0.3301
        },
        {
            "id": "h10qvov",
            "score": 1,
            "text": "Well, I somewhat agree. However how Floyd spends money he probably could always use an extra 20-30million. It would be hard to not accept it in his shoes because who would pass up such an easy payday? On the flip, Logan doesn’t deserve to be in the ring on any national level fighting any professionals. I boxed for 8 years. If I make a YT channel and grow it and just call out people and talk shit do I deserve a match? No I don’t. I deserve to be made fun of until I disappear from my online presence.",
            "title_similarity": "0.8033875",
            "sentiment_compound": -0.3893
        },
        {
            "id": "h10qz2a",
            "score": 1,
            "text": "Lmao his name is literally Floyd Money Mayweather. It's about paper little one not the legacy of a sport. Boxing knows what they are doing by drawing in viewership and changing up the playbook to out perform the UFC by paying these fighters some cheddar",
            "title_similarity": "0.80180275",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h10rf4q",
            "score": 1,
            "text": "True….but understand that mayweather is a money-grubbing bitch, also.",
            "title_similarity": "0.46888107",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h10rkne",
            "score": 1,
            "text": "Ohhh brother this guy stinks",
            "title_similarity": "0.45500576",
            "sentiment_compound": -0.25
        },
        {
            "id": "h10scua",
            "score": 1,
            "text": "He's not even the greatest of all time. Greatest DEFENSIVE fighter? Sure, no doubt. But He's not in the top 5 all time. There are at least 6 or 7 fighters that are arguably better in the history of the sport.",
            "title_similarity": "0.71010524",
            "sentiment_compound": 0.5422
        },
        {
            "id": "h10sko5",
            "score": 1,
            "text": "You’re not wrong but who cares. Honestly when it comes to boxing legacy you don’t even hear about Julio Cesar Chavez and the dude was 96-0-1. Get that money now fuck the world",
            "title_similarity": "0.8223118",
            "sentiment_compound": 0.6158
        },
        {
            "id": "h10stxr",
            "score": 1,
            "text": "Exhibition matches have always been a part of boxing for as long as it has existed. This is nothing new and people are taking it way too seriously instead of looking at it for what it is; a bit of fun!",
            "title_similarity": "0.6288081",
            "sentiment_compound": 0.4389
        },
        {
            "id": "h10sxes",
            "score": 1,
            "text": "Yep, mayweather sold out and his legacy will be affected forever",
            "title_similarity": "0.46163595",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h10t0td",
            "score": 1,
            "text": "I feel like people forget sport is firstly entertainment and athletes are entertainers more than anything. And if people find an exhibition match entertaining it doesn't take away from anyones legacy",
            "title_similarity": "0.59366184",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h10t3qz",
            "score": 1,
            "text": "Exactly what skip said",
            "title_similarity": "-0.015458003",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10t798",
            "score": 1,
            "text": "I think the match with his wife was way worse for his legacy",
            "title_similarity": "0.70271695",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h10t89e",
            "score": 1,
            "text": "I think he diminished his own legacy, but boxing itself is still fine.",
            "title_similarity": "0.58020175",
            "sentiment_compound": 0.296
        },
        {
            "id": "h10tdyy",
            "score": 1,
            "text": "I am just embarrassed by the fact that these people get so much attention (and money).",
            "title_similarity": "0.48306942",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h10tp3f",
            "score": 1,
            "text": "Do boxers even box professionally for reasons other than money?  \n\nWhy would you let someone who punches for a living punch you unless you were getting paid?\n\nMayweather saw this as the easiest payday ever.  Why would he not get paid 50 million to beat up some U tube turd.",
            "title_similarity": "0.8016633",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h10tt34",
            "score": 1,
            "text": "Is this the same legacy as him beating a number of his girlfriends",
            "title_similarity": "0.5820667",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h10tuaq",
            "score": 1,
            "text": "That's some surreal, next level gatekeeping right there. Who are you to be deciding how Mayweather spends his time. If Mayweather wants to slap Logan Paul around like the little bitch that he is, so be it.",
            "title_similarity": "0.6452162",
            "sentiment_compound": -0.1045
        },
        {
            "id": "h10txhi",
            "score": 1,
            "text": "But money weather won and nothing else matters because he got his money therefore, we are all suckers and he is a winner businessman. /s",
            "title_similarity": "0.56370133",
            "sentiment_compound": 0.771
        },
        {
            "id": "h10uxuj",
            "score": 1,
            "text": "Mayweather is an abuser and his own actions make the entire scene look worse far more than sparring with some YouTuber",
            "title_similarity": "0.70231247",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h10uyst",
            "score": 1,
            "text": "I'd trade in my legacy for a cool $20 million, too.",
            "title_similarity": "0.3933252",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h10v3to",
            "score": 1,
            "text": "I’m friends with a lot of people who are huge fighting fans that also participate in local fights. I have also been pretty into fighting for the past few years now. Boxing, is a joke. At least now. Nobody takes it seriously anymore and honestly I can’t imagine why they would. It’s not really the “fault” of celebrity fights as much as that’s a symptom. The UFC and MMA in general has really hit the scene hard and it’s tough taking boxing seriously because of it. Boxing just comes off as half-assed at this point",
            "title_similarity": "0.8088436",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h10v8lc",
            "score": 1,
            "text": "why you thinking so hard?  \nits Free Fast money. period",
            "title_similarity": "0.35659903",
            "sentiment_compound": 0.4014
        },
        {
            "id": "h10vcfa",
            "score": 1,
            "text": "Nothing Floyd could do at this point diminishes his career. His career was essentially over nearly a decade ago, he's on the senior circuit now lol. All of his recent fights have just been big headline PPV events to line his pockets. He's in the post-superstar phase that most boxers never got to, or weren't smart enough with their money to get to. Nothing he does from here on out has anything to do with his legacy, it's about making money and being an entertainer. You could argue, I suppose, that it affects his legacy as a person, but let's be real, Floyd has always been about making the most money possible. As a boxer though? His legacy is already set in stone.",
            "title_similarity": "0.8324022",
            "sentiment_compound": -0.1227
        },
        {
            "id": "h10vf4o",
            "score": 1,
            "text": "It wasnt a proper match but it still is so disrespectful for other boxing athletes (ones that train everyday to be the best while some random fckboi goes to fight a legend). I think it diminished his legacy because he wasnt able to ko Logan, it was just like 10mins of dodging and hugging. I hope this isnt a new trend that people do, that would kill all respect I have for one of my favorite sports.",
            "title_similarity": "0.88426715",
            "sentiment_compound": 0.9349
        },
        {
            "id": "h10vky1",
            "score": 1,
            "text": "Floyd Mayweather is 44 years old! He retired from professional boxing after outclassing people like Canelo and Manny Pacquio, so I don’t think his legacy is in too much trouble. \n\nThe match was clearly described as an exhibition bout and was obviously a sensible business decision as proved by the amount of people who bought it, so I don’t know why anyone would have an issue with it- nobody would complain if Ronaldo plays a celebrity football match or if Magnus Carlsen plays chess against Bill Gates.",
            "title_similarity": "0.7895273",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h10vmm6",
            "score": 1,
            "text": "Who cares?  They are just 2 people beating the shit out of each other on public display!",
            "title_similarity": "0.6611922",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h10vmyv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05570983"
        },
        {
            "id": "h10vq26",
            "score": 1,
            "text": "CMV: OP knows nothing about boxing, but did want to score internet points in others' eyes just because he's shitting on Logan Paul",
            "title_similarity": "0.8040186",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h10vyhx",
            "score": 1,
            "text": "I agree in the sense that it would be an accomplishment for a boxer to work his way up in the ranks to actually go against the greatest, Mayweather. And now some guy that hasn't been in the boxing circuit just gets to fight him willynilly. \n\nBut, it's really all about making money at the end of the day. Can't blame them.",
            "title_similarity": "0.7930207",
            "sentiment_compound": 0.6254
        },
        {
            "id": "h10wk90",
            "score": 1,
            "text": "Boxing is dead and nobody cares about it. Be happy there is any sort of attention on what is clearly a dead sport.",
            "title_similarity": "0.6018334",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h10wnfy",
            "score": 1,
            "text": "You're overthinking it, it's just an exhibition match and every sport does PR.\n\nThere's been tons of exhibition matches over the years. Just part of the sport. And it won't be the last. YouTubers just happen to be a new type of celebrity. You're seeing more of them doing different promotions.\n\nAnd boxing is dying. It needs to reach a younger audience. This was a great gimmick, promote a match with a champion against a celebrity that people who grew up watching are now old enough to buy beer and watch it with their buddies in the garage.\n\nAnd I think you may be giving Mayweather a little more credit then he deserves.\n\nFirst he's well known to really like money. Secondly he was never really a great spokesperson for professional boxing bc he's such a prick and has a lot of personal controversy. Third a lot of his record is about winning decisions. Strategic boxing. (Don't get me wrong the dude can fight and I certainly wouldn't get into a ring with him for anything less then enough to set kids up for life bc he'd probably kill me) but that was his style.\n\nThe reality was is Mayweather has more talent then Paul ever could have and it would've lasted 10 seconds of Mayweather just chose to knock him out in 10 seconds. Hence exhibition match.",
            "title_similarity": "0.79770625",
            "sentiment_compound": 0.9005
        },
        {
            "id": "h10xjp9",
            "score": 1,
            "text": "Floyd Mayweather already diminished the professional boxing scene and the only people who still care about his \"legacy\" are dick riders.",
            "title_similarity": "0.7878585",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h10xm8p",
            "score": 1,
            "text": "Man who's paid to box gets paid to box. What's the issue here",
            "title_similarity": "0.3898129",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10yi7p",
            "score": 1,
            "text": "Sure. But if you weigh a legacy and professional boxing scene against a hundred million dollars, one of those is substantially more of a weighed on Mayweather's behalf.",
            "title_similarity": "0.66951394",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h10yplg",
            "score": 1,
            "text": "Floyd Mayweather is only interested in making money.\n\nThat's it.",
            "title_similarity": "0.4349279",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h10z2q8",
            "score": 1,
            "text": "dude you would sell your legacy for 50 million dollars and you can punch Logan Paul",
            "title_similarity": "0.5529033",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10zpj2",
            "score": 1,
            "text": "I love anytime people get over on an unfair system.",
            "title_similarity": "0.323474",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h10zsfl",
            "score": 1,
            "text": "Meh boxing is dead, no one watched boxing for boxers. we watch in hope that logan paul gets laid out flat",
            "title_similarity": "0.6737438",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h110vlf",
            "score": 1,
            "text": "Boxing is just a game.\n\nDon’t let it bother you.",
            "title_similarity": "0.47564164",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1110xg",
            "score": 1,
            "text": "So? their choice, who cares lol",
            "title_similarity": "0.19259697",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h114ic1",
            "score": 1,
            "text": "I dont get why so many people are hating on these guys… like its part of their job as entertainers.\n\nI can guarantee anyone in this subreddit will fight literally anyone in a ring regardless of their history or legacy for 100 mill? Like let the man live (both of them)",
            "title_similarity": "0.7831582",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1152bg",
            "score": 1,
            "text": "I don’t disagree, but boxing has long been an exhibition sport motivated by huge payouts and rife with chump matchups that both corners are in on.\n\nThe concept of an MMA fighter in a ring with a boxer is just silly. So now we have you tubers, capitalism doesn’t have shame or standards.",
            "title_similarity": "0.8049319",
            "sentiment_compound": 0.4678
        },
        {
            "id": "h1161nc",
            "score": 1,
            "text": "1000th comment",
            "title_similarity": "0.12507607",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1163d5",
            "score": 1,
            "text": "The only problem is that he didn’t beat the shit out of him. I want to see Paul vs Tyson. Tyson has too much respect for boxing history to not maul Paul.",
            "title_similarity": "0.73496616",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h118mki",
            "score": 1,
            "text": "I don’t know man. Paul challenged him; Mayweather accepted. That seems pretty cut-and-dry to me that it’s just a boxer defending his name/title. \n\nIf Paul wanted to go into something knowing he was gonna get the smackdown then that’s on him, not Mayweather. In my mind it’s no different than some hotshot rookie coming out the gates and gunning for Mayweather, knowing full well that it’s not going to end positively for them. \n\nI say it looks worse on a pro boxer to turn down a fight. Mayweather can still win that fight without completely killing the guy, he’s got nothing to lose. At the end of the day, boxing is for entertainment and I can’t \nbegin to describe how entertaining a one-sided fight is that goes on for a while. A fight that isn’t someone getting their ass beat, just not even being able to land a decent hit in the first place and the other guy dancing around them. It’s downright hilarious.",
            "title_similarity": "0.8258736",
            "sentiment_compound": 0.8552
        },
        {
            "id": "h11ajji",
            "score": 1,
            "text": "Boxing, just like every other sport, is entertainment. Y’all need to stop taking this stuff so seriously.",
            "title_similarity": "0.6698097",
            "sentiment_compound": 0.2165
        },
        {
            "id": "h11bl0l",
            "score": 1,
            "text": "He has the same legacy as Paul, being a douche and getting paid a lot.  In such case, this fight was right up their alleys.",
            "title_similarity": "0.59755504",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h11boqh",
            "score": 1,
            "text": "Who cares, ge probably just did it for fun",
            "title_similarity": "0.32694373",
            "sentiment_compound": 0.743
        },
        {
            "id": "h11d070",
            "score": 1,
            "text": "This sounds like a personal problem.",
            "title_similarity": "0.19287542",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h11enr6",
            "score": 1,
            "text": "Mayweather is arguably the best boxer of all time in the same sense that I'm arguably the best boxer of all time. He's the best of his tiny class in recent era for sure tho and the most famous out of active boxers (I'd probably put Tyson above him out of alive boxers and Ali above him out of past 50 years). Boxing has also just gone super down hill since its golden age (like 100 years ago). Its about money and thats what he made. I'd trade my integrity for $100 mill too so I'm not judging.",
            "title_similarity": "0.78683984",
            "sentiment_compound": 0.9781
        },
        {
            "id": "h11ex42",
            "score": 1,
            "text": "Yeah…duh…you mean others don’t feel this way?",
            "title_similarity": "0.12991148",
            "sentiment_compound": 0.0
        },
        {
            "id": "h11g4mr",
            "score": 1,
            "text": "$$$. That’s what it’s all about.",
            "title_similarity": "0.10057245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h11gnwv",
            "score": 1,
            "text": "Not defending Paul, but dang that boy got fit for this.",
            "title_similarity": "0.4243192",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h11iysj",
            "score": 1,
            "text": "Mayweather vs. mcgregor, Tyson vs Roy.  They all diminish boxing.",
            "title_similarity": "0.6775497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h11k6ra",
            "score": 1,
            "text": "Who cares. It's all for show to make money. This whole thing is being over analyzed and picked apart when it's simply fake.",
            "title_similarity": "0.57306683",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h11kl1j",
            "score": 1,
            "text": "The man is called 'Money' Mayweather. \n\nCertainly not 'sporting integrity' Mayweather. \n\n\nWhat he fights for is in the name. And that's fine. He just happens to be a dick in the meantime. So hate on him for his domestic abuse or general entitlement but his legacy as a fighter is fine.",
            "title_similarity": "0.82884157",
            "sentiment_compound": -0.5944
        },
        {
            "id": "h11kz54",
            "score": 1,
            "text": "At the end of Muhammad Ali’s career he fought a Japanese wrestler (who laid on his back to kick Ali most of the match), an NFL football player, and an NHL player.",
            "title_similarity": "0.6436385",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h11mp3m",
            "score": 1,
            "text": "Do you mean floyd MONEY mayweather? How can someone with that name agree to do something like this s/",
            "title_similarity": "0.3862064",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h11qdan",
            "score": 1,
            "text": "No argument from me.\n\nBeing the greatest fighter doesn’t mean you have any personal integrity. This is very on-brand for Floyd.\n\nHe cares about money. Not legacy or professionalism.",
            "title_similarity": "0.678102",
            "sentiment_compound": 0.9102
        },
        {
            "id": "h1270db",
            "score": 1,
            "text": ">As a boxer who went 50-0, and who only fought the best of the best of those who legitimately earned a shot at the top through winning their way to the top,\n\nNegative. He fought has beens and washed ups. He also lost to Pacquiao. I can't believe that anyone watching that fight objectively thinks Mayweather won.",
            "title_similarity": "0.8881733",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h12s9wk",
            "score": 1,
            "text": "I cannot change your mind. You are right.",
            "title_similarity": "0.035108354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h146i15",
            "score": 1,
            "text": "Ali",
            "title_similarity": "-0.13476816",
            "sentiment_compound": 0.0
        },
        {
            "id": "h149oht",
            "score": 1,
            "text": "It was a fake, rigged, fixed fight from the start. So was the last Logan fight.\n\nDesperate has-been YouTuber seeking to stay relevant.",
            "title_similarity": "0.7099426",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h168ne0",
            "score": 1,
            "text": "I think we may could agree that Logan Paul isn’t as bad as brother Jake Paul. Personally I don’t think he’s nearly as bad. They have both gotten into the boxing scene lately so it wasn’t Logan boxing out of the blue.\n\nAlso Floyd Mayweather is a garbage person. They can both swallow each other’s cocks as far as I’m concerned.\n\nSpeaking of Jake Paul he’s boxing former UFC fighters because he knows they have a bigger name than boxers and he has an advantage by limiting them to just their boxing skills. He’s probably going to beat Woodly then get a big money fight against a bigger name, lose then retire. It’s all about the money and if people are interested and willing to pay up then that’s what’s going to happen. Love these guys or hate them at the end of the day they are doing their hustle and making their money so what can ya do? Hate the game blablabla",
            "title_similarity": "0.8765025",
            "sentiment_compound": -0.872
        },
        {
            "id": "h1818aq",
            "score": 1,
            "text": "I agree, he's an icon he’s a legend and he is the moment, why would he lower himself to a mere youtuber's level?",
            "title_similarity": "0.5317731",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1eia8d",
            "score": 1,
            "text": "I really don't think it does. I believe so because it was an exhibition match and Floyd Mayweather said he was doing it for fun. Also it shouldn't diminish his legacy because it couldn't have been serious due to the fact that Mayweather retired in 2017.",
            "title_similarity": "0.6954309",
            "sentiment_compound": 0.5457
        },
        {
            "id": "h1km4qw",
            "score": 1,
            "text": "Logan was too insecure durring that fight to do anything other than hug",
            "title_similarity": "0.55781806",
            "sentiment_compound": -0.3182
        }
    ]
}