{
    "CMV: Nothing makes me angrier than calling a customer service number and needing to TALK to get through the menus.\nNothing boils my blood quicker than for example calling fedex, getting to an automated menu, and having a patronizing voice on the other end ask me with fake sweetness \"what do you need?\", requiring me to use my ACTUAL VOICE to talk to a maddening menu robot. Instantly ruins whatever good mood I'm in. \n\nI CAN NOT imagine a world in which this technology is simpler for the company than just having you press buttons. What I imagine is someone did the market research and thought that the customer liked this better than pressing the buttons. Anyway change my view i don't want to be like this": [
        {
            "id": "h15zn9j",
            "score": 1,
            "text": "/u/exactlyinmyQZone (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nvz4fm/deltas_awarded_in_cmv_nothing_makes_me_angrier/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.43811905",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h16coor",
            "score": 0,
            "text": "I like it because if I scream at the fake person, they’ll usually give me a real human to speak with. Must of those systems are trained to hear the stress in your voice and transfer calls a accordingly.",
            "title_similarity": "0.6273744",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h161feo",
            "score": 1,
            "text": "Literally nothing?\n\nI hate those things too, but I can imagine a lot of things that would prompt me to flip out more than tedious customer service call. \n\nDo you honestly believe you'd be more cool with discovering that someone keyed your car or stole your dog, than ringing FedEx?",
            "title_similarity": "0.78504306",
            "sentiment_compound": 0.8673
        },
        {
            "id": "h16223m",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.012899131"
        },
        {
            "id": "h16e1l0",
            "score": -1,
            "text": "There are two possible ways to change your view, as written.\n\n1. Convincing you that you should not be angry at having to talk to a machine instead of following number menus.\n2. Convincing you that something else could make you angrier.\n\nSo let's go for #2. You know the Holocaust happened, right?",
            "title_similarity": "0.6893095",
            "sentiment_compound": 0.6251
        },
        {
            "id": "h16cefp",
            "score": 4,
            "text": "sooooooo do you want me to tell you what may make you angry?",
            "title_similarity": "0.33072925",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h15s3a5",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.012899131"
        },
        {
            "id": "h15xk4c",
            "score": 0,
            "text": "Those menus are designed as a weapon to fuck over people with sensory issues. They're not there to be better or easier in any way.",
            "title_similarity": "0.5845998",
            "sentiment_compound": -0.0
        },
        {
            "id": "h16ag03",
            "score": 0,
            "text": "I guess I'm not sure about button pressing vs talking (except the disability thing someone already said). However I think it's relevant to point out that if people just followed the system prompts instead of mashing zero or repeatedly demanding a representative, they would probably get what they need in a smoother and timelier fashion.",
            "title_similarity": "0.64552826",
            "sentiment_compound": -0.4333
        },
        {
            "id": "h16ec2q",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.038729146"
        },
        {
            "id": "h16et4k",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.012899131"
        },
        {
            "id": "h16k408",
            "score": 0,
            "text": "I've always suspected those automated systems were designed to discourage people from calling companies. It makes perfect sense from the company's perspective.\n\nAs a whole, for example, Spectrum does not WANT to do anything for you aside from take your money. Paying the internet bill is a breeze - you can even do it from your phone - but getting through to someone is another story.",
            "title_similarity": "0.72911376",
            "sentiment_compound": -0.0982
        },
        {
            "id": "h17gcwb",
            "score": 0,
            "text": "There is lots of situations where this is useful, disability, while driving, while having ur hands busy (knitting, washing ur hands, etc.), etc.\n\nI also find it a lot faster sometimes because I can just tell them what I need and they can figure it out pretty fast. Otherwise narrowing down my search gets hard to do with menus “press 1 for visa inquiries, press 2 for ….. press 9 for other inquiries” followed by “press 1 for residence class visas, press 2 for work visas, …..” at the slowest voice is a lot slower than just saying “inquiry about permanent residence visas” and getting right to the correct queue",
            "title_similarity": "0.6887881",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h17qxwc",
            "score": 0,
            "text": "Wow really? Global Warming? Pandemic?? Rape?? Murder?? None of those things make you angrier than having to say words on the phone?? WOw.",
            "title_similarity": "0.6564353",
            "sentiment_compound": -0.7337
        },
        {
            "id": "h16an7y",
            "score": 1,
            "text": "The purpose is you get frustrated and quit as a self selection process for the call center. If you're willing to give up, it wasn't worth them losing money over.",
            "title_similarity": "0.61255425",
            "sentiment_compound": -0.4371
        },
        {
            "id": "h16cozd",
            "score": 1,
            "text": "It can stay for accessibility, but it should always be optional.  There are times when it's useful, like for saying the nature of your issue as a sentence instead of having to listen to a long menu and then select the closest option, then another menu and select the closest drill-down option and so on.  However, we're not always in a position where speech would work or is convenient, so a quick choice at the beginning of press 1 for buttons or 2 for voice is always a good thing.",
            "title_similarity": "0.5851823",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h17gn6m",
            "score": 1,
            "text": "This is a bad CMV post. But it's easy to change your view on this one.  \n\n\nWould you rather A) call a customer service number and need to talk to get through the menus?\n\nor\n\nB) have someone steal all your belongings and murder the people that are importing in your life.\n\n&#x200B;\n\nIf your answer is A, then congratulations! Your view has just changed!\n\nIf it's B, then you have some serious issues!",
            "title_similarity": "0.73890173",
            "sentiment_compound": -0.6981
        },
        {
            "id": "h15zadc",
            "score": 108,
            "text": "Generally speaking I think it's because you haven't used a good system.\n\nSo if the system is properly set up, for instance I setup up a system during Covid, where you could ask general question about rent related matters, and the bot would try to give you an answer.\n\nSo for instance \"Can my landlord enter my house without permission.\" and then it would read that part of the rental act about.\n\nIf I was to do phone maze where you press button, it would hundred of layers deep.\n\nWhat these system are really good for is when you design them for the AI system. Which lets the user ask very general questions and receive machine generator responses based on their input (I.E like a Voice Interface)\n\nThis issue, is most corporate structure try to do the least possible, which means taking their existing button system, and then make it voice activated,  or working with people that hate new technology and do the least to implement it.\n\nAs you engage with Startup, or smaller companies that don't have predefined department, you'll find the system are better.",
            "title_similarity": "0.7766218",
            "sentiment_compound": 0.6107
        },
        {
            "id": "h16nxo0",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.012899131"
        },
        {
            "id": "h15vk45",
            "score": 16,
            "text": "Would you rather listen to a 10 minute monologue of menu options, all but one of which are useless to you?",
            "title_similarity": "0.6064612",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h16cdxf",
            "score": 2,
            "text": "If nothing makes you angrier than this, you must live a truly blessed life 🙏🏻",
            "title_similarity": "0.3777386",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h15supt",
            "score": 647,
            "text": "1",
            "title_similarity": "-0.104362965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h16f4gk",
            "score": 3,
            "text": "I would argue that burning your house to the ground with all your belongings inside while you sit by and helplessly watch would make you angrier.",
            "title_similarity": "0.4597815",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h16f3g9",
            "score": 3,
            "text": "For many people, speaking it is actually easier. Especially people who may be vision impaired. When companies are dealing with thousands or millions of people they have to provide a user experience that is most accessible to others...once accessibility is no longer an issue then they can get to dealing with the people who can use the service but are just irritated by it. While your annoyance does matter it's not something that prevents you from getting through. However, the absence of a voice option would mean a lot of people wouldnt even be able to call customer service, let alone be irritated.",
            "title_similarity": "0.69802046",
            "sentiment_compound": -0.9158
        },
        {
            "id": "h15s03e",
            "score": 48,
            "text": "I only like this more if I'm driving cause then I can actually accomplish something. Also I usually just say representative a few times and get a real person.",
            "title_similarity": "0.56619143",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h16amx2",
            "score": 18,
            "text": "Well I am not gonna name companies, however, at my time working as a Big-Data engineer, I have seen that MANY companies, use this data, where you relay the conversation to the robot, as a way for bots to better learn speech recognition. These all words taht you speak to get to the menu, are then generalized in a pool, with the input as your word that you spoke, and output as the word/menu you choose.\n\nOverall this whole pool of data is then fed to the bots to learn how different accents speak different words and how it then ends up helping most of the speech to word recognition softwares in recognizing what you speak.\n\nAlso to note, while you may think Google and Apple who have their own assistants would make the most use of it, however, a lot of Health Industry companies, that help make a speech to text/voice-over softwares for people who are blind, have a much easier life while navigating through with the technology.\n\nSo while you and I hate, it, and Yes big corps make benefit out of it. It also ends up helping them who really need the use of speech to text functionality, and do not have the same recognizable english/other language accent.",
            "title_similarity": "0.7669233",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h16djr2",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "0.012899131"
        },
        {
            "id": "h168vdx",
            "score": 70,
            "text": "The best customer service I've ever had is with Amazon. I just found the order I made, clicked that I wanted a call back, and someone called me 2 minutes later with all the details of my order at their fingertips already. A few other companies (e.g., Apple, State Farm) have similar systems in place. This call back system is the best one.\n\nThe second best customer service experience/feature I've had is with Charles Schwab. They have a system where your voice is your password. So if you call them from your registered phone number and talk to the automated person for a few moments, they'll direct your call and automatically log you into your account so you don't have to spend as much time verifying details. In this way, talking is an incredible time saver. If your voice changes for whatever reason, you can verify another way. But it's amazing that you can access sensitive bank information quickly using your voice.",
            "title_similarity": "0.66880906",
            "sentiment_compound": 0.926
        },
        {
            "id": "h15sge2",
            "score": 1,
            "text": "Like someone else mentioned its not bad at all when doing something. Any time where your hands are occupied this is the better option, only down sides are that it can be very bad at guessing/hearing what you said but eventually someone will awnser anyways after enough failed attempts.",
            "title_similarity": "0.5866016",
            "sentiment_compound": -0.4976
        },
        {
            "id": "h16dqn7",
            "score": 5,
            "text": "Well, the thing is, the number one priority of most customers in a support hotline is to get service fast...\nIn times when phones had actual number buttons(that made a identification sound to transmit the number  in old times) it was way faster to just press those buttons, as you did not need to search for them...\n\nNowadays with smartphones, when you are in the phone menu when calling, it would be annping for most people, to:\n1. Tilt phone\n2. Wait till display is on\n3. Now you need to select that the phone shows the numberpad while calling with one tap\n3. Click the number\n4.phone on head again\n5. Repeat till no choice is needed anymore...\n\nSo in fact, for most people it is way more efficient and less energy-sucking to just speak, rather than going through this proccess more than once",
            "title_similarity": "0.71733034",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h16ekrl",
            "score": 1,
            "text": "Yeah my only argument for it is if it was good it would be awsome but it's not. If I could just explain what I needed instead of having to say yes six times to one question that would be great.",
            "title_similarity": "0.5679842",
            "sentiment_compound": 0.9001
        },
        {
            "id": "h16gllo",
            "score": 7,
            "text": "I can imagine a business where they get calls for a diverse enough number of reasons that there is on average a net time savings for callers doing voice recognition vs. making them go through a phone tree. Like the main customer number for Chase Bank--your problem could be about investment, checking/savings, mortgage, or credit cards, and within each of those categories, another few dozen options. Being able to call in and say \"fraudulent charge on my credit card\" probably saves time.\n\nI do agree the voice navigation is often poorly implemented and not necessary/helpful for all or even most businesses.",
            "title_similarity": "0.72123265",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h16hea2",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.012899131"
        },
        {
            "id": "h16nbf9",
            "score": 1,
            "text": "Though its likely cheaper for everyone involved",
            "title_similarity": "0.30260444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h16nqnq",
            "score": 1,
            "text": "I’m in total agreement. Forcing me to speak to a robot is degrading. Just let me push a damn button. And when they can’t understand me and I have to repeat myself.....",
            "title_similarity": "0.71948874",
            "sentiment_compound": -0.4601
        },
        {
            "id": "h16om5e",
            "score": 1,
            "text": "You have a nice life.\n\nJust mash buttons or put the phone on speaker and set it next to something that's playing a standup comedy set LOUDLY. I prefer comedians that work VERY off color.",
            "title_similarity": "0.58313006",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h16or0y",
            "score": 1,
            "text": "I understand why they do it, but it drives me insane. Usually I tell the robot I want to buy something so it gets me to a sales rep and then I ask that rep to transfer me where I need to go.",
            "title_similarity": "0.75877005",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h16pduo",
            "score": 1,
            "text": "Some voice systems are good enough to actually solve the problem for you without having to wait an hour to talk to someone. For example if you lock yourself out of an account the voice system can verify your account, unlock it, and then send out a password recovery link. Secondly, when there are tons of options you have to remember which button it is and sometimes you have to go through several subcategories to get to the one that you want; whereas a voice system can take your response and direct you to the proper menu or person without all the rigamarole. Lastly, some systems can record and fill in the required information so that when you talk to the person, if necessary, all that information is already provided and you can get down to the reason you called them for.",
            "title_similarity": "0.658046",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h16qlvc",
            "score": 1,
            "text": "I also love when an automation calls me and wants me to press a number to continue.  I'm driving right now, or this would have gone to voicemail...",
            "title_similarity": "0.6735296",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h16rfm5",
            "score": 1,
            "text": "driving",
            "title_similarity": "0.07415567",
            "sentiment_compound": 0.0
        },
        {
            "id": "h16srn9",
            "score": 1,
            "text": "Not gonna change your view, but if you say \"speak to a representative\" 9 times out of 10 the system will recognize that and connect you to a human.",
            "title_similarity": "0.5042379",
            "sentiment_compound": 0.0
        },
        {
            "id": "h16u84f",
            "score": 1,
            "text": "This seems more like an r/offmychest than r/changemyview.",
            "title_similarity": "0.23334073",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h16uo9e",
            "score": 1,
            "text": "I fucking hate it too. \n\nThe end.",
            "title_similarity": "0.20469244",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h16vx72",
            "score": 1,
            "text": "The ultimate problem with this view is that you identify something yourself encounters when calling in, and hopefully as someone who works on phones you are needing a representative because the system was unable to solve that problem.  You would however be one of the small sliver percentage of callers a business likely gets.\n\nNot to mention being so \"upset\" or \"in a hurry \" to answer the prompts correctly you obviously get routed to someone who can't help you which leads to even more \"enjoyable\" interactions where it's the agents fault they don't have a brain.\n\nUltimately the way you have to see it is it helps most it may just not help you here, and now.  \n\nYour responsible to this would be the expected \"well give us an option to circumvent the system when that happens so we aren't waiting\", but you still ignore 2 factors.  1. Every person would then do that meaning exponentially longer wait times for simple requests.  2.  More instances where the customer is having to be rerouted multiple times.\n\nThe answer to those to the \"well train people better so we don't need transferred\" is you're entering the realm of obsurdity at that point.  There wouldn't be enough employees, or training long enough to make everyone proficient in many of the more tedious institutions like: utilities, medical services, government agencies, your expectation quickly becomes unmanageable.\n\nUltimately the automated system does more bad than good, and explaining it this way to my customers the reasonable ones tend to be much more patient, understanding, and get a better experience going forward.",
            "title_similarity": "0.77971816",
            "sentiment_compound": 0.8465
        },
        {
            "id": "h16wmas",
            "score": 1,
            "text": "One part of it is because customers don't like listening to the long list of options. For bigger companies there are usually at least 7, if not more. (You already addressed this though)\n\nThe other part, which is probably more impactful to the decision is that a lot of customers will choose the wrong button. (For example people will choose the accounting option to reset the password to their account). This causes them to need to be transferred (which makes them angrier) and it wastes the company's time.\n\n(I do hate talking to the robot though)",
            "title_similarity": "0.7232749",
            "sentiment_compound": -0.9044
        },
        {
            "id": "h16wp8s",
            "score": 1,
            "text": "I agree with you. All it takes is 1 background noise and you're starting over with the menu options.",
            "title_similarity": "0.5093825",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h16yair",
            "score": 1,
            "text": "I'll take that over having to explain my problem to the 12 different people I get transfered to before anyone can even remotely fix my problem.",
            "title_similarity": "0.5355224",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h16zlf7",
            "score": 1,
            "text": "Anger is usually a response to feelings of injustice. This scenario might be annoying with those generalized options. But here is where you decide how to spend your energy.\n\nSince the outcome will likely be the same, regardless if you are steaming pissed or unbothered.. and it’s probably a relatively short call.. you can put that into perspective and decide if it’s really worth being to the point of ‘nothing will make me angrier’ vs something more reasonable like ‘this is mildly annoying’",
            "title_similarity": "0.57188475",
            "sentiment_compound": -0.5012
        },
        {
            "id": "h1721bk",
            "score": 1,
            "text": "Say “operator operator operator” and you get a human. It worked for the CVS automated system and a few others. You can also try swearing lol",
            "title_similarity": "0.45779842",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h172i9x",
            "score": 1,
            "text": "I’m not gonna change your mind. But the opposite is equally frustrating. When voice is your only option and you have kids or barking dogs or you’re outside and it’s windy, good luck.",
            "title_similarity": "0.45139802",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h173l1r",
            "score": 1,
            "text": "your calls important to us... what? are you literally mocking us now?",
            "title_similarity": "0.51579845",
            "sentiment_compound": -0.3094
        },
        {
            "id": "h173ybn",
            "score": 2,
            "text": "This feels like a response to the increasing loss of actual phones. \n\nLet's face it, if you're talking on a smartphone, even for us, it's kind of a pain in the ass to hear the option you want, pull the phone off your ear, figure out how to bring up the keypad, select your option and then put it back on your ear for each and every menu. \n\nThis is much worse for people like my parents who can't figure out how to bring up the keypad and take forever to move the phone to and from their face. On badly designed systems, the menus sometimes proceed without them (e.g. 'press 1 if you need X otherwise just stay on the line') or starts before they put the phone back on their ear.",
            "title_similarity": "0.73166263",
            "sentiment_compound": -0.875
        },
        {
            "id": "h175gtf",
            "score": 1,
            "text": "I don't disagree with you, it generally pisses me off, but I generally save those calls for when I'm driving to work so I can say what I need and not have to look at my phone to press buttons",
            "title_similarity": "0.6519431",
            "sentiment_compound": 0.636
        },
        {
            "id": "h176602",
            "score": 1,
            "text": "Use the rage to your advantage! Most of these systems will send you to a live person the louder and more aggressively you curse at them. Sure your recording might end up on a training video but, hey, you spoke to someone real and got your issue solved quickly.",
            "title_similarity": "0.61149794",
            "sentiment_compound": -0.243
        },
        {
            "id": "h1779w6",
            "score": 1,
            "text": "As someone who’s company uses fedex for all of our parts shipping and having to deal with the fucking phone tree, I agree with you completely. \n\nNothing on the fucking planet puts me in a bad mood faster.",
            "title_similarity": "0.737741",
            "sentiment_compound": -0.25
        },
        {
            "id": "h177ye2",
            "score": 2,
            "text": "How am I able to change your view here? This belongs in r/rant or maaaaybe r/TrueOffMyChest, idk why you would post it here.",
            "title_similarity": "0.45653075",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h17845j",
            "score": 1,
            "text": "The systems that have either press two or say ____, is one thing. But I generally feel like the ones that only allow voice and have crappy menus with long aggravating automated robot messages are set up that way to get you to go away before actually reaching a human who can help.",
            "title_similarity": "0.7668605",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h17e7uf",
            "score": 1,
            "text": "This should probably be posted in a rant sub or something.",
            "title_similarity": "0.3294651",
            "sentiment_compound": -0.34
        },
        {
            "id": "h17e8j1",
            "score": 1,
            "text": "Last year I had to make some kind of customer service call, ended up being on hold waiting for someone to answer which is fine. Except the hold music was constant Christmas music. This was in early November. Almost 30 minutes I had to listen to stupid Christmas songs so I was unsurprisingly in a bad mood by the time I got through to a person.",
            "title_similarity": "0.5178344",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h17fxxs",
            "score": 1,
            "text": "I hate the automation in general. I much prefer talking to a customer rep",
            "title_similarity": "0.6877762",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h17g3z9",
            "score": 1,
            "text": "You used to be able to skip these things if you had a rotary dial telephone.",
            "title_similarity": "0.43882823",
            "sentiment_compound": 0.0
        },
        {
            "id": "h17joe1",
            "score": 1,
            "text": "Just happened to me before seeing this! 💯",
            "title_similarity": "0.23811519",
            "sentiment_compound": 0.0
        },
        {
            "id": "h17k9gu",
            "score": 1,
            "text": "I drill 0 until I get an actual person.",
            "title_similarity": "0.23720212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h17l6t9",
            "score": 2,
            "text": "I spent 3 years programming these phone menu systems (IVR). I was actually one of like 2 engineers on the team who had the technical expertise to configure the speech recognition grammars. \n\nIt all comes down to the particular IVR and how well it was designed in the first place, whether it’s using speech recognition or not. \n\nRegardless, from my experience the IVRs using speech recognition really just have various keywords that correspond to standard menu options, and you can in fact still press the number for the option even if they don’t explicitly say that you can. \n\nFor example, I built a system for an electric company that would start out with a general “what are you calling about?”  The second prompt would give some examples of phrases “pay my bill, account information, budget billing, financial hardship, report an outage” the final prompt would be a standard menu “for billing, press 1.” The menu was the same the whole time and you could’ve pressed 1 for billing from the start, only the prompt would change. \n\nNext time you get a speech recognition IVR, that gives examples or phrases to say, just press the corresponding number. 9/10 times it will work.",
            "title_similarity": "0.58602446",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h17m0o3",
            "score": 1,
            "text": "That's the point. Be annoying to get you to hang up. If you have a legitimate issue you'll sit through it all. Other people will lose care quickly.",
            "title_similarity": "0.53341377",
            "sentiment_compound": -0.296
        },
        {
            "id": "h17n16u",
            "score": 1,
            "text": "Nothing makes you angrier? nothing?\nnot someone insulting you/ someone close to you? not idiot drivers? not evil politicians and evil acts?",
            "title_similarity": "0.56444657",
            "sentiment_compound": 0.5065
        },
        {
            "id": "h17n2ye",
            "score": 1,
            "text": "What will blow your mind is how few people actually notice it's an automated system.",
            "title_similarity": "0.5767626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h17n3dh",
            "score": 1,
            "text": "They probably  did some market research and realized people would call less often if it was a long frustrating process.",
            "title_similarity": "0.5401848",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h17orcr",
            "score": 1,
            "text": "Robots are people too? When you go to an office lobby and the admin talks to you, yes, there is a human underneath, but it’s also a lot of acting. And call center reps follow scripts. And washing machines wash clothing instead of you. We live in a kind of fake world. \n\nThe robots that help you on calls today are like 90s computer graphics—sad. Alexa and Siri are better than them, so I have faith in telebots improving. At least more faith than I have in getting a pleasant experience from the human who comes next!",
            "title_similarity": "0.78464377",
            "sentiment_compound": 0.9767
        },
        {
            "id": "h17ppm0",
            "score": 1,
            "text": "Not here to change your view but to commiserate: how about AIRLINE customer service numbers that require you to talk? If you're like me the only time you need to call customer service is when you are IN THE MIDDLE OF A NOISY AIRPORT... someone didn't have their big brains on when they dreamt up that solution.",
            "title_similarity": "0.67740035",
            "sentiment_compound": 0.4679
        },
        {
            "id": "h17q1nv",
            "score": 1,
            "text": "In my opinion it's a necessary evil. People that are grandparents age aren't really good with phones, and it's super helpful to them. People with reading disabilities could be really helpful for them to I would assume.",
            "title_similarity": "0.62676597",
            "sentiment_compound": 0.4157
        },
        {
            "id": "h17qfmf",
            "score": 1,
            "text": "I miss the days when real people would pick up a phone when you called.",
            "title_similarity": "0.5768162",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h17wws3",
            "score": 1,
            "text": "I tried talking to apple customer service and it was SO ANNOYING because the guy speaks really slow and doesn’t tell you what the options are he would just say “Please tell me what your problem is?”. Can I please just push the button….",
            "title_similarity": "0.7791188",
            "sentiment_compound": -0.7733
        },
        {
            "id": "h17xk8k",
            "score": 1,
            "text": "If your view is that nothing makes you angrier I think I’ve got it.\n\nHow about when you get through the labyrinth of entering information and playing “guess the robot’s dictionary” and you speak with a person who asks you for THE SAME INFORMATION AGAIN!!\n\nReally though I think the end resulting technology will be strong but who the f*ck thought “hey lets test this tech on people who are already pissed off”",
            "title_similarity": "0.8303789",
            "sentiment_compound": -0.6102
        },
        {
            "id": "h17y4n6",
            "score": 1,
            "text": "UPS has the worst system ever made for this. Took me twenty minutes and several calls to go thru every menu and every option until I got a human",
            "title_similarity": "0.48571306",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h17ymhq",
            "score": 1,
            "text": "Jesus Christ, this so much. Dealt with it today and I wanted to break things",
            "title_similarity": "0.43348318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h17ysw9",
            "score": 1,
            "text": "Mash the 0 button a few times. 3/4 times it'll skip to a real person.",
            "title_similarity": "0.38559678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h17zwvr",
            "score": 1,
            "text": "All I say to the automated robot is 'need to talk to someone' or 'talk to someone'. I keep repeating this until  I am talking to someone which is usually quite quick",
            "title_similarity": "0.68493664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1811qq",
            "score": 1,
            "text": "Whilst it might be frustrating, it does have value which ultimately benefits the consumers when done correctly.\n\nNot everyone is trained to manage all queries. Most clients will start going on about their issue as soon as they get through. When they have finished speaking, the employee will need to redirect their call to the appropriate department, who will then need to get the customer to repeat the entire spiel.  This not only makes the customer repeat themselves, but wastes employees time, which increases customer hold times.\n\nIt may not appear helpful at face value, but via a combination of both direct and indirect means, those prompts could have saved you up to 15 minutes of hold time.",
            "title_similarity": "0.71608996",
            "sentiment_compound": 0.6544
        },
        {
            "id": "h181rpq",
            "score": 1,
            "text": "As a guy with a stutter I despise this as well",
            "title_similarity": "0.32111436",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h182g62",
            "score": 1,
            "text": "I have something more maddening than that: when the computer voice accepts what you say and then plays a recording of someone typing on a keyboard, because they think you're too dumb to realize it's a robot and you'll be happy that you're talking to a \"real\" human.",
            "title_similarity": "0.7747869",
            "sentiment_compound": 0.0534
        },
        {
            "id": "h184vl5",
            "score": 1,
            "text": "Today I tried to call my apartment office. The automated press a number machine to reach the office transferred me to another number which was just a different automated press a number machine which would then transfer me to another number which was the first machine again. It was an endless loop with no escape. Just sayin.",
            "title_similarity": "0.6716075",
            "sentiment_compound": 0.1979
        },
        {
            "id": "h185y5t",
            "score": 1,
            "text": "\" you Said bary shmalentine. Is this correct?\"",
            "title_similarity": "0.25859988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h186hh4",
            "score": 1,
            "text": "Hrm. I think I can change your *perspective* here.\n\nThe goal of these menus is not to make you angry. But it's also not to make you *happy*. The goal of these menus are t convince you that you don't need to speak with a human being. Humans cost money. Recordings are free. I'm sure that whoever made them *hopes* that they provide you with whatever you need. I don't think they're actively malicious. But their goal is to make you go away without spending the time of a human being that costs money to employ.\n\nMaking menus that are more cumbersome and time consuming is a strategy that tends to make people go away. Increasing user frustration tends to make people go away. Making it loops that feel like you have just accomplished nothing and ended up in the exact same spot make people go away. It's an unfortunate truth that a *lot* of the strategies to make people go away happen to be infuriating.",
            "title_similarity": "0.6456636",
            "sentiment_compound": 0.9073
        },
        {
            "id": "h1889sn",
            "score": 1,
            "text": "Voice Menu navigation is useful when you are unable to interact with your phone, like driving.",
            "title_similarity": "0.47542822",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h189jg1",
            "score": 1,
            "text": "This one is easy. I just have to convince that you assumption that \"companies did the research and the customer likes voice interaction better\" is wrong right?\n\nThe actual desired outcome is that the customer hangs up and fucks off. As long as cancelling service is more work than waiting for customer service there is this sweet spot where you are able to make some statistically significant portion of the population fuck off without you needing to pay an employee to talk to them let alone expend resources to solve their problem.",
            "title_similarity": "0.7643913",
            "sentiment_compound": 0.296
        },
        {
            "id": "h18a7k2",
            "score": 1,
            "text": "Got Delta airlines had the worst system.  It would tell you to please say yes or no and it couldn't figure out your answer.  Havent flown them for a while though.",
            "title_similarity": "0.5156689",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h18ayw4",
            "score": 1,
            "text": "How are we supposed to change your view if we don't know the other things that make you angry?",
            "title_similarity": "0.4640168",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h18c9zs",
            "score": 1,
            "text": "Can you clarify how the system worked? \n\nDid it allow you to freely speak what you wanted to do, and then it tried to understand that and route you?\n\nOr did it do a voice input equivalent of the old school \"press 1 for x, press 2 for y, etc\" with layers of menus to drill down?\n\nBecause usually the benefit of speech input is to do speech recognition and natural language understanding to skip the tree of menus by just \"understanding\" what you want to do.",
            "title_similarity": "0.6798949",
            "sentiment_compound": 0.879
        },
        {
            "id": "h18cskx",
            "score": 1,
            "text": "Are we the same person? Because I think we may be the same person.",
            "title_similarity": "0.12507904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18ds0s",
            "score": 1,
            "text": "I agree with you but my bet is it’s not that anyone thought the customer would enjoy it better, but that it slowed down and reduced call volume. It’s equivalent to being put on hold, but the customer thinks they’re being engaged with. And if they get frustrated or annoyed and hang up to just try to figure it out online, that’s exactly the scenario the company wants.",
            "title_similarity": "0.6919763",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h18eap6",
            "score": 1,
            "text": "I think that’s absurd. I don’t think there was any market was researched",
            "title_similarity": "0.29271048",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18f6ac",
            "score": 1,
            "text": "What a first world problem..",
            "title_similarity": "0.1840221",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h18f9t6",
            "score": 1,
            "text": "What about the fake typing sound they play after a response",
            "title_similarity": "0.5530303",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h18fi5z",
            "score": 1,
            "text": "I cannot change your valid view.  I am screaming obscenities within moments when I come across this technology.",
            "title_similarity": "0.59414953",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h18gt89",
            "score": 1,
            "text": "The problem is they make this process unnecessarily long on purpose. By taking you though a maze of voice prompts they are delaying how soon you can access an actual person, meaning they can have less employes to provide support.",
            "title_similarity": "0.5812875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18hrri",
            "score": 1,
            "text": "Just keep saying customer representative and itll break it and send you through.",
            "title_similarity": "0.51131535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18j6mf",
            "score": 1,
            "text": "I always laugh to myself thinking about someone listening to a recording of these calls and just hearing me being a total asshole to this robot voice. Basically just yelling at it in each menu like YES, YES, MAKE AN APPOINTMENT, OMG, UGH NO!, TALK TO AGENT!\n\n\nThe one time I tolerate it is when I’m driving",
            "title_similarity": "0.8035776",
            "sentiment_compound": 0.8755
        },
        {
            "id": "h18jec8",
            "score": 1,
            "text": "It’s even worse when after going through all the menus you end up speaking to an actual person and they advise you that you have come to the wrong department but rather than transfer you to the right place they send you back to the menu.",
            "title_similarity": "0.7324003",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h18k6xh",
            "score": 1,
            "text": "Try having a scottish accent then see how you get on using one of these.",
            "title_similarity": "0.21059752",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18kx22",
            "score": 1,
            "text": "I often find that if you hit # enough times it will bring you to an actual person",
            "title_similarity": "0.3038467",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18oqzi",
            "score": 1,
            "text": "Sounds like you need some help on patience",
            "title_similarity": "0.17778432",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h18q9yi",
            "score": 1,
            "text": "Dial zero , keep dialing zero till a real person picks up",
            "title_similarity": "0.41710883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18qw83",
            "score": 1,
            "text": "some work very well and don't require me to sit through \"listen to all the options as they may have changed\" and then 20 options are listed, and I try to select #4 for returns, when I really needed #18 for warranty, or whatever the specific situation is.\n\nwith voice commands, I can go around my house cleaning, playing video games, laying in bed, doing yard work, or whatever, with headphones in and just responding when needed instead of keeping my phone at hand.",
            "title_similarity": "0.58860236",
            "sentiment_compound": 0.7501
        },
        {
            "id": "h18v1co",
            "score": 1,
            "text": "When I’m faced with this situation, I just keep pressing 0 and don’t say anything. It usually sends me to a human finally.",
            "title_similarity": "0.45446864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18xq5x",
            "score": 1,
            "text": "It’s a psyops",
            "title_similarity": "0.05098994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h18y2mc",
            "score": 1,
            "text": "I just alternate between pressing zero over and over and yelling GIVE ME A PERSON! And that usually works. Sometimes they hang up on me, though.",
            "title_similarity": "0.5175698",
            "sentiment_compound": 0.0
        },
        {
            "id": "h190i97",
            "score": 1,
            "text": "I turn homicidal within the first 10 seconds. Right after they interupt asking if they have it right but it's not fucking right and you have repeat it. It's maddening. I see sooo red!",
            "title_similarity": "0.5074574",
            "sentiment_compound": -0.68
        },
        {
            "id": "h191kkd",
            "score": 1,
            "text": "And then they’ll ask you for all your acct information and the minute you’re connected with someone be forced to repeat it.",
            "title_similarity": "0.40844837",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h192kev",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.038729146"
        },
        {
            "id": "h194bkf",
            "score": 1,
            "text": "Numbers are annoying because you often have to wait for the description of each to know how to continue whereas with the voice prompt I just answer \"representative.\" regardless of what tbe first question is and 9/10 Ill get tranferred to somebody. That being said, in reality I simply hate automated service directors.",
            "title_similarity": "0.72949106",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h194ow2",
            "score": 1,
            "text": "I can't disagree. Especially when the voice system goes: I'm sorry, could you please repeat that?\n\nOr the endless loop of asking for customer service and them asking for account number. Me going that's why I am calling @",
            "title_similarity": "0.67414325",
            "sentiment_compound": 0.5399
        },
        {
            "id": "h195z0i",
            "score": 1,
            "text": "Can we just have human customer service instead of these bots? they are so fucking annoying and frustrating. There's a popular bank where I live that uses bots for their service and it got so annoying that I ended up closing that account. No \"eva\" i aint dealing with this shit no more",
            "title_similarity": "0.74117994",
            "sentiment_compound": -0.9411
        },
        {
            "id": "h196lam",
            "score": 1,
            "text": "Well, does it make you angrier than waiting for 40 minutes on hold?  What about being transferred about from agent to agent as each on cannot deal with your request?\n\nI feel many of the other responses are not mentioning the benefit to YOU of these systems When agents time is used up dealing with those ‘stupid’ queries from other people (cos your query obviously won’t be stupid, right?) it makes YOUR wait longer, and it also makes YOUR call time longer, button presses or not if you connect to someone who cannot help you.\n\nAs others have said, the voice prompts are there to increase the chance they can respond to you automatically (like reading off a balance to you, or providing an address) this getting you out of the queue quickly with what you need - or to get you to the specific agent who can help you.  This means fewer people talking to agents, and this in turn means shorter hold times.  These are two of the three key metrics call centres track (hold time, call time @ call volumes) - running a call centre is about optimising these against the number of agents you employ.",
            "title_similarity": "0.7083917",
            "sentiment_compound": 0.4023
        },
        {
            "id": "h19bdrz",
            "score": 1,
            "text": "If the voice system is organized exactly like a menu system (\"say one, if you want..\"), I fully agree with you. However, with voice it is possible, at least in theory, avoid the massive selection trees and jump right into the thing that the caller wants. Of course this requires good voice recognition and smart enough AI to figure out what the user wants. If the AI is stupid, then you just end up having to keep coming back to the top menu and trying to say what you want in a different way. \n\nAnd even better, if the voice recognition is good, it can connect the phone number that you called and your voice. Then you're already identified when you get through to a human, which should save you some time.",
            "title_similarity": "0.74481463",
            "sentiment_compound": 0.9432
        },
        {
            "id": "h19eq92",
            "score": 1,
            "text": "Can the phone system not do both? This was a thing back in the mid 2000s when I would order pay per view movies through satellite TV. I hated having to shout the numbers for the movie code into the phone and was delighted when I figured out you could just enter it with the keypad even though teh voice prompted you to speak them",
            "title_similarity": "0.73279387",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h19gx1i",
            "score": 1,
            "text": "Most of the time, you can do 1 as yes and 2 as no anyway.  I cannot stand talking to them and refuse.",
            "title_similarity": "0.48998895",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h19iwi5",
            "score": 1,
            "text": "Life pro tip: spam # while in call, it forces the system to connect you to an actual person/phone.",
            "title_similarity": "0.6124872",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h19lrq1",
            "score": 1,
            "text": "Interpreting speech is an incredibly difficult thing to do well by machine. If you're on hold after saying what you need, you're likely being screened by a real person that isn't immediately available to listen. Turn the playback speed up and I could probably direct way more calls this way than if I had to engage with a customer. It's not cheaper than having a robot do it (if that were feasible), but it would be economical use of a human.\n\nIf they didn't know where to send you themselves, your request could be sent directly to someone who might without needing to have the whole conversation again. You're being asked to express exactly what you want as briefly as you can explain without the polite chit chat, after all. And that's the end of your burden until you're talking to who you need. All the thinking is done by people who know the company. \n\nBetter than trying to navigate the choose-your-own-adventure, Zork style customer service machine.",
            "title_similarity": "0.75353026",
            "sentiment_compound": 0.2031
        },
        {
            "id": "h19m05y",
            "score": 1,
            "text": "Or maybe they could replace this and the button menu with a person that directs the call. At least you “generally” find yourself talking to the right person the majority of the time.",
            "title_similarity": "0.5871242",
            "sentiment_compound": 0.0
        },
        {
            "id": "h19qiku",
            "score": 1,
            "text": "I like voice activated menus. Unlike the button phones of old times, I always need to swipe/click something to open the keypad if input is needed. Voice is just easier for me.\nIt’s much easier to talk to customer support line when I’m driving or using headphones.. and I don’t have to fumble for my phone.\n\nNow from the company’s point of view, any B2C company will have very few employees and customer support calls are often repetitive and torturous to the support people. Imagine how many calls a credit card company fields about lost passwords.\nTrying to automate this is the only viable way to scale and maintain the sanity of its  employees.",
            "title_similarity": "0.8042804",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h19qiqv",
            "score": 1,
            "text": "It’s funny that you hear those voices as patronizing.",
            "title_similarity": "0.3349268",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h19ums3",
            "score": 1,
            "text": "I totally  agree,  but I rather talk to a robot than a person who is Indian and doesn't speak or understand English.",
            "title_similarity": "0.64859676",
            "sentiment_compound": 0.2255
        },
        {
            "id": "h1agsm1",
            "score": 1,
            "text": "Oh fuck yes.",
            "title_similarity": "0.007453589",
            "sentiment_compound": -0.2023
        }
    ]
}