{
    "CMV: The LGBT+ community is managing to harm themselves greatly by using seemingly endless labels, creating a separate community, and being (often but not always) unforgiving in demanding representation\n(View now changed to an extent - see edit)\n\nTl:dr - putting yourself in a separate bubble only results in others not liking you. If conservative views are now the minority can we please just merge with general society where no one needs to give a fuck who you’re with, as there is legal representation, and far more accepting views, and we can still carry on pushing for rights, just not from a far away place, but with the support of the general public too. \n\nPlease note: Gay guy here before I’m called a homophobe or not understanding of many of the issues (though I will say this isn’t a request for absolution in my argument, just something to note). Also, on mobile so please forgive formatting \n\nI will first say this:\n1. I am in complete support of the full and legally recognised equality of all minorities in this area, and I see that there is still a significant way to go to get to this point, especially on some trans issues.\n2. I believe I understand the extent to which society has rallied against the community in the past and understand the need for a bubble of safety and support then. \n3. I in no way attempt to devalue or disrespect anyone who chooses a particular label. My attitude is that I don’t give a fuck (in the sense that I couldn’t give less of a fuck how you define yourself so long as you are happy doing so, and if you want me to call you x I’ll call you x. If you want me to give a fuck I can, but I can’t see it as necessary in general society and interaction). I give a fuck about the person because it’s the person that matters, not who they want to be with, or whether they feel like Piers Morgan’s ‘two spirited penguin’. \n4. In this, I am referring more to the west, where pride is so much more prominent, and not to countries where activism is undeniably necessary, and where I can feel nothing but compassion and great admiration for those standing up for a right to exist for themselves and those alike to them. I feel it’s probably easier to assume that I am talking about countries and societies that have many companies that dump the rainbow as soon as pride is over, as that seems quite a good benchmark to me. \n\nI simply feel that it’s getting to a point where the community risks turning people against them who wouldn’t have been against them before. In almost any situation, if you take a minority, put them in a bubble, and move them away from what the normal is, it’s likely that they’re going to have stones thrown at them. It’s human nature that means that if something new and foreign turns up, we are going to be unsure and scrutinising of what it is and what it’s implications are upon society. This is necessary for most change, and is an often uncomfortable (probably an understatement) but unavoidable part of new concepts or groups joining or being recognised by society. \n\nThis is how the LGBT community seems to have formed. They needed to step back and be seen, so that society could see they existed in public and not in myth (or prison). As a result, we see the legalisation of homosexuality begin to occur in different countries and states, and the inevitable, if slow, progression of society. As a result of their heroics, they got very little else than hate and confusion. Whilst some accepted them the loudest voices were against them. It’s fair enough to go and find others facing the same issues. \n\nNow, it seems like in the US and the UK, and probably lots elsewhere but I don’t know enough of there to speak about it, that legal protection has come such a long way, that it might be time to contemplate whether the new minority is those who are against the community and whether as a result it can now merge with general society. The rule stands strong that intertwining different characteristics creates a far stronger bond between each other, and if we could come to society asking that whilst we might be x, y, or somewhere in between, that they just don’t care about it and love us for who we are as people, not for who we are described as. \n\nLabels seem to do nothing else but create early and often unhelpful prejudices. In the situation where someone is describing to their friend someone else at their work perhaps, if he says ‘oh he’s gay’, the general concept is going to be overly camp, talking a certain way etc, which is going to be deeply unhelpful. Need I not mention the gay best friend thing. I give the gay example as it’s the one I know most of, but I’d expect the same for many in the community. So can we please not use these labels. \n\nA few years ago, when at school, a non binary speaker came and outlined around 75 different genders. This was unfortunately had a comical effect on nearly all of the students, admittedly myself included, and many spent the rest of the day asking others to call themselves what they thought the most ridiculous genders were. It shouldn’t be so complicated, or so seemingly much to adjust to that teenagers find it funny or ridiculous, because whilst they may be tenuous, they can often be expressive of a general gut reaction of society, without a hidden veil. Whilst this was admittedly a more conservative leaning demographic, when I came out a few years later I felt nothing but support, had no issues at all, and I felt like no one saw the need to give a fuck. Pretty perfect realistically.\n\nFinally, in terms of those who demand for representation in the media and entertainment, this just seems so exasperating. It’s a fairly obvious catch 22. Shows like Love Victor and love Simon have faced strong criticism saying they haven’t shown enough lgbt characters. This is so deeply annoying as the obvious goal is to have the sexuality hopefully insignificant, and for it to be a romcom, or coming of age etc. If lgbt characters are followed up with criticism asking for more of them, it’s a losing situation. It then dissuades any writers from using characters. And everyone loses. Which is just great. \n\nSo I think that’s it. Please change my view.\n\n\nEdit: This is a lot bigger than I thought it would be. I was lying in bed when I wrote this hence the lack of articulation in some areas. This has given me quite a bit to think about. I thank everyone for giving some time to change my view and it’s definitely offered up a reasonable and clear viewpoint that I’ve got to say is changing my view. Also I’ve just figured out how to give deltas so don’t feel I didn’t see them as I’ve read through as many as I can right now. \n\nI guess my overarching feeling was that it was a bit difficult and irritating to be pinned as the gay one in some situations, and whilst I still stand by major elements of my argument (a strong belief that labels are unnecessary and potentially harmful), I do concede that a united front is still necessary to aid the progression of all minorities in this area. \n\nI also apologise as i now realise I slightly disregarded the very real and extreme dangers that some face within the lgbt community.\n\nHowever, as said before I stand by what I said about labels both in the post and comments that labels are ideally unnecessary and that if someone wants to be someone then they shouldn’t be pinned. Having said that, I now am beginning to see greater benefit in individuals choosing how they want to define themselves. However I do just ask they be kind and not expect us to know all of this, and that if others slip up they are forgiving (to an extent of course).\n\nAnyway, I’ll give out a few more deltas, and thank you all for your engagement. \n\nThanks. (View changed a bit and I’m all the better for it)\n\nEdit 2: I realise I said normal - wrong word - general or average I mean\n\nAlso, I didn't say before but thanks for all the awards! Whatever your viewpoint thanks for engaging.": [
        {
            "id": "h1f1e3o",
            "score": 1,
            "text": "/u/CreativeBanshee (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nxjnye/deltas_awarded_in_cmv_the_lgbt_community_is/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5125219",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1992ze",
            "score": 11,
            "text": "So you are blaming LGBT+ people and not the fucks who make their lives hell?",
            "title_similarity": "0.743058",
            "sentiment_compound": -0.7586
        },
        {
            "id": "h198r03",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h19maxi",
            "score": 45,
            "text": ">Please note: Gay guy here before I’m called a homophobe or not understanding of many of the issues (though I will say this isn’t a request for absolution in my argument, just something to note).\n\nIf being gay were some sort of immunisation against being an ignorant homophobe then there'd be a lot fewer problems.",
            "title_similarity": "0.7660146",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h19vrnr",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1aa9ie",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h19pak8",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h19haz7",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1a8qko",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h19tqe6",
            "score": 81,
            "text": "Your entire point is “Gosh it’s great that you finally have a voice and the strength and confidence to stand up for yourself publicly, but could you be less flamboyant about it?”\n\n\nIt’s like telling a protester, “hey I sympathize with your cause, but like you’re really inconveniencing me and gosh, couldn’t you have done this more quietly someplace nobody would see you?”\n \nAs long as there are people passing bathroom bills and making up stories of sexual predators using the ladies room to spy on kids and claiming to be trans, then there is an active campaign against LGBT+ people in the USA today. As long that exists then pride is absolutely necessary.\n\nThe president of Chechnya publicly denies the existence of homosexuality and gay people there are disappeared and murdered.\n\nIn Russia being too gay in public and near children will get you locked up for pushing anti-Russian agenda and corrupting children.\n\nThere are places where being gay will get a person hanged or stoned to death.\n\nSo as long as being LGBT+ means an exponentially higher risk for being oppressed and killed then Pride is essential.",
            "title_similarity": "0.83185506",
            "sentiment_compound": -0.9163
        },
        {
            "id": "h199y1d",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h19s0qw",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h19vlob",
            "score": -14,
            "text": "When there are still laws being created, then it is not enough.\n\nGender is a spectrum. Sorry it doesn’t fit into you bubble of comfort, because it’s not about you. Racism and Homophobia are so similar, the way we get rid of them is not by making the white man or the Cisgender Heterosexual man comfortable. It is by giving the Black,\nTrans Woman comfort in her own skin. \nPart of the liberation from oppression is making the oppressors uncomfortable. You and your mates making fun of the 75 genders, makes you transphobic. \n\nMy point is you really just need to suck it up and respect people for who they are.",
            "title_similarity": "0.85729444",
            "sentiment_compound": 0.9524
        },
        {
            "id": "h19y221",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.21122196"
        },
        {
            "id": "h1aamte",
            "score": 0,
            "text": "You are a sad, sad man",
            "title_similarity": "0.40451044",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h19mrmh",
            "score": 26,
            "text": "As I’ve explained to my daughter, I don’t walk around telling people I’m heterosexual because I am not judged or looked down upon for being so.  When people are oppressed, they “label” themselves so they can ban together and fight the oppression.  I’ve heard people say, “why do we have black history month?  We don’t have a white history month.”  Same reason.",
            "title_similarity": "0.73549086",
            "sentiment_compound": -0.8612
        },
        {
            "id": "h1a2ufm",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1avrmt",
            "score": 3,
            "text": "To /u/CreativeBanshee, **your post is under consideration for removal under our post rules.** \r\n\r\n* You are required to **demonstrate that you're open to changing your mind** (by awarding deltas where appropriate), per [Rule B](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_b). \r\n\r\n---\r\n\r\n**Notice to all users:**\r\n\r\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\r\n\r\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \r\n\r\n\r\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\r\n\r\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\r\n\r\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\r\n\r\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.6352464",
            "sentiment_compound": 0.6452
        },
        {
            "id": "h199b6p",
            "score": 885,
            "text": "Unfortunately there is still a large percentage of people who are against lgbt+. Look at the lesbian couple who got beaten on a bus in London, or the fact that being disowned by family is not uncommon. You've got shops refusing service for gay weddings, the church refusing to accept gay weddings. Lgbt+ kids are at higher risk of bully and suicide is still higher for lgbt+ than other groups. The US is passing laws to stop transgender kids getting treatment, stopping them from being in sports, and so on. \n\nUnfortunately there is still work to be done for lgbt+ to be the norm, it has come a long way tho. A lot of people have had to hide their sexuality for years so currently, being able to say they aren't straight is still something new and having a community where they are accepted is huge for a lot of people.\n\nLgbt+ needs to be loud and vocal about being a separated group because out there are a lot of people who feel alone and don't know that there are a place for them to be who they are.",
            "title_similarity": "0.7481589",
            "sentiment_compound": -0.9692
        },
        {
            "id": "h19tv77",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h197qo3",
            "score": 233,
            "text": "LGBT+ people distance themselves (labels and LGBT+ safe spaces) from others in society and are sometimes aggressive in demanding representation they believe is accurate and helpful in large part because of the immense suffering and persecution that LGBT+ people have faced for centuries.  For centuries much of society regarded LGBT+ people as an oddity at best and a demonic creature at worst.  Because of this, LGBT+ people created labels to describe the way they differed from the rest of mainstream society (\"gay\", \"transgender\", \"asexual\", etc.) and looked for support groups to help them in their troubles.  \n\nDoes that mean that a LGBT+ person should be defined by their sexuality before other characteristics such as character or personality?  Should LGBT+ people try to remove themselves from a society that is relatively accepting of them?  Should LGBT+ people insult or harass media creators who do not perfectly represent LGBT+ in their media?\n\nThe answer to these questions is no.  \n\nHowever, LGBT+ people *should* use labels to bring awareness to LGBT+ problems as well as making it easy for people to understand how LGBT+ people differ amongst themselves as well as the rest of society.  LGBT+ people *should* be able to find LGBT+ groups that accept them and help them regarding LGBT+ problems.  LGBT+ people *should* push for more accurate and more beneficial representation so that LGBT+ problems are alleviated.",
            "title_similarity": "0.8448483",
            "sentiment_compound": 0.4769
        },
        {
            "id": "h1a7lh9",
            "score": 1,
            "text": "You must be really young. Gay marriage was illegal in large parts of the United States 8 years ago. When I was in high school in the mid 2000s gay kids were relentlessly bullied, and the one out trans kid got in fights constantly. The people that graduated with me are now 30, those people are not even remotely close to the age of your average politician, and below the median voting age. There’s a reason anti-trans laws are constantly being passed in the south.\nMy point is that you may think that it’s not a big deal because you mostly interact with those of your generation, and gen z really is much more open to this kind of thing than any of the previous generations. That’s a great thing, but you are not at all in the majority of the population yet, so until that’s the case lgbt still needs to fight for their rights.",
            "title_similarity": "0.65710104",
            "sentiment_compound": -0.6858
        },
        {
            "id": "h1ae7kg",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1b3h4y",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h198bdo",
            "score": 16,
            "text": "When I see LGBTQ, or any group, bubbling up, I see a group of people who don't quite feel accepted yet. The same is true of race, right? Black people weren't accepted, and so they created their own community. Asians did the same. And they built themselves up while being in their bubble, because as much as it may seem that the outside world is becoming more accepting with who they are, the truth is that there's still a lot of prejudice out there and even those who may be supportive haven't quite been exposed to a level of comfort and normality. I'm sure they don't want to be stuck in their bubble, but it's the only place they feel they can be themselves and with people who truly understand and accept them.\n\nWhen you see people pushing for overrepresentation, or perhaps even pushing issues too hard, I get that it can be annoying. But because of everything I stated before, it's all part of the process of normalizing and integrating them into society. They push for representation in the media because it has such strong outreach. You may find all of those pronouns annoying or comical, and many people might even agree with you, or at least find it excessive, but that's just part of the process. Shows like Love Victor could be a strong step forward while also being criticized, and that's okay.\n\nYour example of the presentation where the majority conservative crowd found the pronouns comical and made fun of it is a good example of prejudice. It's great that when you came out they were all supportive, but the point is that when those people mock those differences it makes people less comfortable, and makes it harder to come out. People who make racist jokes, or homophobic comments aren't always unfriendly to different races or LGBTQ people; they're just being insensitive. Society placed negative connotations behind words like \"fag\" and \"retard\" and those used to be thrown around like they were meaningless. But that's not productive.\n\nIn an ideal world, people wouldn't have to introduce themselves as something else, or announce who and what they are, and people would just be accepting. But the oppression isn't always blatant; often times it's subconscious. And that's why, right now, it needs to be pushed. We need overexposure so that one day it won't be as big of a deal. It's a sign of progress, in my eyes, even if it can be pushy.",
            "title_similarity": "0.81191695",
            "sentiment_compound": 0.9862
        },
        {
            "id": "h19bcio",
            "score": 113,
            "text": "> Labels seem to do nothing else but create early and often unhelpful prejudices. In the situation where someone is describing to their friend someone else at their work perhaps, if he says ‘oh he’s gay’, the general concept is going to be overly camp, talking a certain way etc, which is going to be deeply unhelpful. Need I not mention the gay best friend thing. I give the gay example as it’s the one I know most of, but I’d expect the same for many in the community. So can we please not use these labels. \n\nHow would you demand progress without using any labels?\n\nHow could people organize themselves into groups to fight for equality, if they don't know that others like them exist, or who they are, because no one identifies like them?",
            "title_similarity": "0.830217",
            "sentiment_compound": 0.9642
        },
        {
            "id": "h19ldyh",
            "score": 26,
            "text": "That's kind of like asking why we can't just call all animals cats or dogs. Complicated subjects require precision of language.",
            "title_similarity": "0.5608865",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h1b3l39",
            "score": 45,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.\n\nThank you for understanding.",
            "title_similarity": "0.7744796",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h19nvwm",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h19valb",
            "score": 0,
            "text": "Is there any push to end segregation of sports by gender and maybe possibly identify by other factors?",
            "title_similarity": "0.60683334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h19yo7a",
            "score": 3,
            "text": "John Oliver has a great recent episode on how using too few labels denies representation or represses existence. One argument you could use is the LGBTQ+ community classes themselves as allies via the LGBTQ+ flag then specifies who from the banner is speaking by allowing them to label themselves as they wish.\n\nThe Asian American population had an issue where they were too small to make a movement happen for their specific ethnicities, but united they could push for Asian rights. While this allowed them to be identified, people began saying, Chinese or Japanese to classify the movement. This oversimplifies the problem and provides a new kind of racism that refuses to acknowledge that Indians and Pacific East Islanders may have been part of the movement.\n\nWe saw this echoed in some of the non-binary news recently involving how people identify for bathroom use. A worryingly high number of Americans don't understand the difference between gender identity and sexual orientation and many right wing outlets picked up and used this as a straw man argument to prevent transgendered people from using bathrooms.\n\nThe labels are there to educate people and inform them that your group exists and should be acknowledged. Admittedly I'm not the most well versed on LGBTQ+ matters but I ask when I don't know. To pretend things don't exist is to keep them in the dark and not challenge our biases.",
            "title_similarity": "0.8314903",
            "sentiment_compound": -0.8907
        },
        {
            "id": "h1a4t3y",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1a6zpk",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1aqzrp",
            "score": 0,
            "text": "We don’t chose to create labels or not create labels based off of some cis-het persons view of us. There are always going to be homophobes and disapproving people, there’s no reason for us to pander to them. \n\nIf people feel most comfortable associating with a certain label they can do so. It’s not a huge deal. The point of our community is to make sure everyone whos LGBT feels included and safe with eachother. Not “hmmm how do we give ourselves the best public image”\n\nIf someone hates me for being bi or trans, it’s not going to change because I don’t use certain words.",
            "title_similarity": "0.8568906",
            "sentiment_compound": 0.8864
        },
        {
            "id": "h1aw4dt",
            "score": 0,
            "text": "This is coming from a micro-label so might be a little biased.\n\nI think generally that with the increasing support and visibility to and around the LBGT+ community, has actually started to create spaces where more micro-labels also can come forward. In a sense the major issues facing the micro-labels in my opinion is the lack of awareness or visibility. If what I know now was something I knew when I was 14-15 I would have a much easier life.\n\nI am very closeted and I am only out to some close friends and family. And I think that for large parts are mostly true of those that identify as a micro-label. Plus I think a major issue with those that have micro-labels might often be dismayed or refuted. Even when I came out to people that accepted it, I had to like argue in quite extensive ways to show I was something different to them.\n\nAnd something that might also be very damaging is that when there is so little time and perspectives from those with a micro-labels a lot of people discover their sexuality very late, and they might have issues for not relating to anyone ever.\n\nI wasn't by any means a loner, or have had a bad life. But still there has always this kind of negative thinking where I just dont experience the same as most people. Feeling there is something wrong with me, that I am physically or mentally ill. In many western countries too, until like 2012 my micro-label was considered a mental illness.\n\nAnd I struggle to see getting medication for that, and something like conversion therapy.\n\nAlso I think that most countries that for instance have a ban on transgendered people or gay people actually have those laws against those with a micro-label. I think the wording in the law is being sexually deviant. And for instance Russia has specifically banned asexual people from certain privileges. So I think that no means those with a micro-label is safe where gay people and transgendered people are very unsafe.\n\nAnd then about the rarity, and how few people identify as such, might actually be more common than we think. There is just very few studies about micro-labels that I dont think we fully understand the scope of it. Plus there is generally a universal good thought that those that need the most help should get it.\n\nHospitals and universities that investigates and try to treat diseases that occur in like 0,05 % of the western population wouldn't probably considered to be a waste of resources.",
            "title_similarity": "0.7719605",
            "sentiment_compound": -0.6578
        },
        {
            "id": "h1b31pm",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h19wlcd",
            "score": 10,
            "text": "Creating a separate community? Uh, you know we did that because we weren’t accepted as part of the general public.  [This is what you are doing](https://imgur.com/a/Ng1O2OR). You’re on the third panel, and then we’d soon be on the fourth.",
            "title_similarity": "0.659294",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h199j6v",
            "score": 251,
            "text": ">It’s human nature that means that if something new and foreign turns up, we are going to be unsure and scrutinising of what it is and what it’s implications are upon society. This is necessary for most change, and is an often uncomfortable (probably an understatement) but unavoidable part of new concepts or groups joining or being recognised by society.  \n>  \n>This is how the LGBT community seems to have formed. They needed to step back and be seen, so that society could see they existed in public and not in myth (or prison). As a result, we see the legalisation of homosexuality begin to occur in different countries and states, and the inevitable, if slow, progression of society.\n\nThje big problem with your perception of progress, is that LGBT people have never been \"new and foreign\" to society.\n\nThis is not a chicken or the egg situation, where a new minority appeared, and they naturally started to push for visibility, which gave them rights in the \"inevitable\" march for progress.\n\nWe know for a fact, which came first. LGBT people did, by thousands of years. And they were silenced and murdered and marginalized for thousands of years.\n\nThe loud vocal activism came second, after 1969, *and it worked*. It had immediate effects. The LGBT community keeps clinging to belligerent campaigning and demands for representation, because it knows very deeply, that silence is death, that progress is something that has to be kickstarted, and that things could just as easily return to the old days if we give an inch.\n\n>If lgbt characters are followed up with criticism asking for more of them, it’s a losing situation. It then dissuades any writers from using characters. And everyone loses.\n\nIf people react to watching a historical movie wirh swordfighting, by making  youtube videos about how we need even more historical movies with even more accurate swordfighting techniques, then no content producer's reaction would be \"Fuck it, then I would rather not make any!\"\n\nThat LGBT people are met with that dilemma at all, is in itself a low-key form of weaponized homophobia.\n\nThere is no easy win, because homophobia is still a powerful force. They will weaponize underrepresentation, to argue that LGBT people are just a tiny obscure minority that don't need to be taken seriously, and they will weaponize loud demands for more representation, to stir up culture wars.\n\nBut taking their weaponized compalints about us at face value, is what is definitely a losing position.",
            "title_similarity": "0.86072826",
            "sentiment_compound": -0.9905
        },
        {
            "id": "h19xzsa",
            "score": 6,
            "text": ">it might be time to contemplate whether the new minority is those who are against the community and whether as a result it can now merge with general society.\n\nMerging with general society happens naturally when there are no more prejudices within a (subset of) society. Many of my friends are lgbt, without it being a 'special' topic of conversation. there is a gay scene in my city, but i've visited gay bars without it being a big deal, and lgbt people visit general clubs and festivals just as much, without it being a big deal. So when given the opportunity by society at large, this group does merge without much fuss.\n\nHowever, this merging can only happen because the group has pushed for it, has advocated for it, and has announced their presence loud and clearly. And it is very clear that they need to continue to do so, because a large part of society (including in my city) does not yet fully accept them. And those people will not 'naturally' change their opinion if people just stay quiet.\n\nSo basically, what you wish for happens pretty naturally when society becomes more accepting, but society only becomes more accepting if they are exposed to lgbt people more and more, which is why visibility *needs* to stay high.\n\nAnd remember that for events like Pride, by far most people don't wear those extravagant outfits 24/7. The rest of the time they *are* merged with general society. but apparently that is not enough yet to breed acceptance everywhere, so pride events will remain needed.",
            "title_similarity": "0.75695324",
            "sentiment_compound": 0.9924
        },
        {
            "id": "h19qygg",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h19smop",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h19whx6",
            "score": 1,
            "text": "I think this is a common issue with leftists that use post modernism and identity politics as their method of struggle. It does prevent unity and it doesn’t really seek to solve the basis of their oppression. \n\nAn alternative method of struggle is through Marxism and the fight for a socialist revolution. A materialist view of history sees oppression of alternative family forms and gender expressions as due to the economic structures we have. Marxism has similar critiques for all other struggles such as racism, sexism, and nationalism. \n\nI’ll leave a link to more information as I have to go to work but I think this is one form of struggle that I’m involved that seeks to liberate LGBTQ folks without the divisiveness of identity politics but with unity of many peoples under the banner of worker\n\nhttps://www.marxist.com/marxism-vs-queer-theory.htm",
            "title_similarity": "0.73830163",
            "sentiment_compound": -0.8346
        },
        {
            "id": "h19yqyo",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1aizoq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1ao5gg",
            "score": 1,
            "text": "Discrimination against LGBT+ people is still incredibly rampant in the US, but especially against the LBT+ part. It's pretty easy these days for many cis gay men to blend seemlessly into cishet society and confirm to cisheteronormative expectations for what their lives should be, but the same can't be said for most of the rest of the community. Especially the transgender part of the community. Our understanding of gender gas changed a lot as social science and health science gas advanced, and we now understand sex to be bimodal rather than binary; gender is widely understood as a completely artificial social construct, and people are creating their own labels and playing around with that construct more and more every day.\n\nI don't think that your experience with like, not understanding that gender experience is equivalent to those communities being... What, exclusive? Or segregated? Your argument suggests heavily that the community is at fault for the discrimination it faces; like, if the LGBT community tried harder to conform, they wouldn't be discriminated against.\n\nThis is ahistorical and nonsense. The lavender scare is an example of this-- gay women and other queer people blended in just fine into positions in the government and they were hunted down anyways. The answer to acceptance is not changing what makes us different; it's embracing and accepting those differences. We should all be able to choose our own paths, define our own identities, without the pressure to conform to an inauthentic version of ourselves. People who identify as non-binary or who are trans in a way you don't like are not caricatures of LGBT people. They are part of our community. They're real people who are expressing themselves, exploring themselves. \n\nRepresentation is important. Representation in media is one of the biggest ways populations learn to empathize with new types of people. \n\nUltimately, and I don't want to make too many assumptions about you but I've noticed this time and time again, I think that often LGBT people can find safety in assimilating into conservatism. That safety is fickle, but it can protect them from homophobia somewhat, as much as it can reinforce LGBT phobia and internalize it. Just think about Blair White- a trans woman who made a career out of being grossly transphobic and cow-towing as much as she can to her conservative audience, to be \"one of the good ones.\" It is harmful not only to her, (her own boyfriend calls her the T slur and she's constantly shit on by conservatives around her) but to the community because the perpetuation of transphobia is legitimized to her cis audience when she repeats it. Your discomfort with the \"separate community\" (the LGBT community has always bin incredibly diverse and richly flavored) could be from a fear of being discriminated against. Theres a long, long history of gays causing harm to the community because they're afraid of personal persecution, because some parts of the community are 'too much' for civilized society. \n\nWe're stronger together. Those 75 genders aren't hurting anyone. I don't think gender can be quantified like that personally, but our understanding of gender as two boxes is simply inaccurate and outdated.",
            "title_similarity": "0.8538042",
            "sentiment_compound": 0.9712
        },
        {
            "id": "h1au0kj",
            "score": -1,
            "text": "I’m as liberal as they come but when I first heard of xenopronouns I turned Republican for like 10 minutes. \n\nLike what the heck, you want to be called robot, or wolf or whatever? Give me a break and don’t expect me to take your cringe seriously. \n\nPeople have been gay or trans for 1000’s of years. That is natural. Wanting to be called Mr. Meowphistopheles is not the same thing. You’re a fucking dork not a discriminated minority. \n\nWe’ve all got our weird geeky sides but don’t expect me to take yours seriously",
            "title_similarity": "0.63543665",
            "sentiment_compound": 0.1557
        },
        {
            "id": "h1axsos",
            "score": 1,
            "text": "I don’t think the lgbtq community is creating labels. It is just people who feel they are different, found other people who also feel the same way (or skip that step), and give themselves something to identify with. Identity is quite core to humans.",
            "title_similarity": "0.7697634",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1j9lo9",
            "score": 1,
            "text": "Do you know how many people currently still suffer from hate crimes just for holding a rainbow flag during pride month? It’s not fair to have to just act “normal” and to say it’s our fault that we are harming ourselves by being too out. In my school (we are one of better schools in district too) kids who were holding rainbow flags during pride month got jumped and hate crimed and chased. My friends got hate crimed in the middle of the street, and friend was called a f*g. It’s not us that need to change. We are fine. We aren’t bothering anyone, it’s the stupid homophobes that need to just have the ‘I don’t care if these people are gay’ perspective.",
            "title_similarity": "0.73770314",
            "sentiment_compound": -0.8971
        },
        {
            "id": "h19vcqm",
            "score": 57,
            "text": "While I like a lot of the answers here, I think you and most people are missing a very simple fact... it wasn't the LGBT community that other-ized themselves... they didn't get together at some gay summit and decide \"hey, let's form our own bubble\"...\n\nIt was *society* that otherized them. They didn't have the *choice*, if you were out in a homophobic society (which is to say, almost anywhere, especialyl in the past) then *society* labelled them. Maybe not the *same* labels... they didn't say \"ah, you LGBT person!\" it was more... well, offensive.\n\nAs many commentors have pointed out, this other-izing continues to this day. Society is still very heteronormative and when you come out as gay most of society will be quick to label you.\n\nThat's why the LGBT community basically, collectively decided to stand together and own it, with their own labels and their own flags to show Pride in who they are, not shame (like society wanted by labelling and ostracizing them originally).",
            "title_similarity": "0.84430814",
            "sentiment_compound": 0.3153
        },
        {
            "id": "h1a0qn5",
            "score": 18,
            "text": "You're whole argument is based on perceived equality and integration. Yes things have progressed immensely but unless you're part of the community you don't understand how many problems there still are.\n\nI'm really tired of the bar being so low with \"tolerance\", which is subjective and not reality.\n\nGay/Trans ppl still get regularly harassed, beaten, fired and discriminated against. And most \"queer\" shows are written by non-LGBTQ+ ppl and they aren't our stories, they are caricatures and not based in our reality. \n\nThe internet has really allowed us to connect and protect one another. We never other ourselves, society others us.\n\nThis take, although well intended I think, doesn't take into account the actual lived realities, and the different socio-cultural components attached to identity and lived experiences.\n\nFurthermore, with peace and love, its not our job to make ourselves uncomfortable to make cis/straight society comfortable by fully \"integrating\".\n\nEdit: typos",
            "title_similarity": "0.8357548",
            "sentiment_compound": -0.5935
        },
        {
            "id": "h1a3xyw",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1a54ae",
            "score": 2,
            "text": "So I, like you seem to be, prefer the queer theory approach of noting that society looks at lgbtqia individuals as different/aberrant and the only need to give a label is to acknowledge this and create community/belonging for us. However, I think the need for labels is less for us and more for assisting with the dearth of information available for most people. The human brain loves absolutes and boxes, and struggles greatly with ambiguity or gray. Add prejudice on top of that and the conversation becomes especially difficult to have. Allowing for more labels may seem like it’s bogging down the conversation, but it’s actually helping those that don’t have the ability to figure themselves out in finding tools to do so in the face of misinformation and prejudice. They can shed them later with more comfort if they choose, but having the leg up is useful.",
            "title_similarity": "0.900049",
            "sentiment_compound": 0.7079
        },
        {
            "id": "h1a87lx",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1azofc",
            "score": 2,
            "text": "Labels have 2 uses:\n1. It can help others identify you as part of a group. Whoch is what your post seems to be about. Too many labels confuses people, etc.\n\n2. A label can also help one person understand themself better. And then help them seek support for specifically the label that suits them.\n\nSome examples:\n\nThink of it as music genra. Do I know the difference between dark metal, death metal, progressive metal, heavy metal? Not really. Buy I really enjoy Dream Theater, which is labelled as \"progressive metal\", so when I want to find more bands that sound similar, it helps ME.\n\nDo I understand the difference between bisexual, demi sexual, pan sexual, queer and hetero flexible?\nI mean, sort of not really. The ones that don't apply to me I am less familiar with, but being able to have a word to describe myself truly help.\n\nIf it wasn't for labels it would be really hard to find people of that \"category\". Imagine ordering food at a fast food restauranr without using labels (name or numbers):\nYes so what I like is a hamburger, but with 2 beef patty, and letuce... and a special kind of mayo. And like... an extra bun in the middle.\n\nAnd then 5 minutes later:\n.... sorry we don't have BigMacs, this is a Wendy's.\n\nNow with label either you know the one that are relevant to you or you don't. And if you don't its an easy conversation to have. \n\nWhat's extremely toxic is when people expect you to guess their label, or to always have a solid understanding of what this label means to them.",
            "title_similarity": "0.72997445",
            "sentiment_compound": 0.9793
        },
        {
            "id": "h1azz9s",
            "score": 2,
            "text": "Mmm, well what you may not seem to grasp is just like before all this pride stuff, people didn’t like us anyway just because they don’t agree with my existence, so fuck em 🤷🏾‍♂️",
            "title_similarity": "0.7561803",
            "sentiment_compound": 0.7058
        },
        {
            "id": "h1b1qie",
            "score": 11,
            "text": "Lol, what is the definition of normal? There is none, it’s solely based on your opinion. In essence, you want people to act according to your parameters. How about minding your own business and letting them be?\n\nI’m a veteran and a lesbian. I’m masculine presenting (I wear guy clothes), and I still get stares and people talking shit in Southern California.  It doesn’t matter what we do, if you want to hate and pick apart the LGBT community, you’re going to do it. So what if we want better representation on screen? There hasn’t been enough out there until recently.\n\nBeing part of the LGBT community is not mainstream nor is it a fad.\n\nAlso… talking shit on safe spaces is ridiculous. I grew up in a homophobic, racist, and sexist household. It was in a “safe space” is where I was first able to come out. It literally was a safe place when the rest of my life seemed like hell. For some of us, things like this are important for a reason. It easy to sit back and talk shit when you’re not the one being oppressed.",
            "title_similarity": "0.81650734",
            "sentiment_compound": -0.8458
        },
        {
            "id": "h1a7g2a",
            "score": 3,
            "text": "Labels are very important because they express accuracy. Let’s say you want a blue paint and someone comes back with blue-green or a purple-blue. Technically they are “blue” but they aren’t a true blue like you wanted your wall the be painted. \nI’m pansexual but typically just assign myself the label of “queer”. This is because I literally but no value on someone gender when dating them. It’s all about personality. I am in a Hetero presenting relationship which is why it is so important for me to remind people, I’m not straight, my partner is just super awesome. \nI don’t present the label to confuse them but rather to add clarity.",
            "title_similarity": "0.7371091",
            "sentiment_compound": 0.9696
        },
        {
            "id": "h1ahjb0",
            "score": 14,
            "text": "Man, there's a lot to unpack here.\n\nFirst off, I think you're blowing the ways the LGBTQ+ community has \"separated\" itself out of proportion. It's not like they exclusively work in LGBTQ-only offices and shop at LGBTQ-only stores. I'm sure you still regularly encounter them at work and out in public, whether you realize it or not. What social circles and safe spaces they do have don't necessarily comprise the entirety or even majority of their public lives. For the most part, they are fully integrated into society.\n\nAs far as whether all these organizations and demonstrations are still necessary given the recent rise in protections ... I mean, that's a resounding yes. Members of the LGBTQ+ community are still frequent targets for discrimination and harassment. What's more, while a 2020 SCOTUS judgment and a January 2021 executive order did finally extend some long-awaited federal protections to the LGBTQ+ community in America, there are still rights and protections they lack in comparison to other protected groups.\n\nEven if we do one day fully secure all the same rights and protections for the LGBTQ+ community, that doesn't mean we shouldn't still have advocacy groups and opportunities to reflect on LGBTQ+ people's history in society.\n\nAs far as labels, frankly, I don't think it's really my place to judge. They're the ones living this marginalized experience. All these labels are partly an attempt to figure out their identity for themselves and discuss their experiences openly and critically, something they couldn't have done just a few decades ago without censorship and discrimination.\n\nYou mention you and a bunch of other high school kids snickering at a non-binary person's long list of gender identities as an example of why it's alienating. Have you maybe considered that's actually an example of how there's still work to be done as far as making sure people are treating these issues with sensitivity and deference to those living through these experiences? Even if it seemed silly to you, even if long-term we see LGBTQ+ discourse shift significantly from what you heard in that presentation, you should still show respect and understanding. It's not on the LGBTQ+ community to make their discourse more palatable to people on the outside. It's on us to support them and empathize regardless.\n\nAs far as representation in media, I agree it's a tough balancing act. But frankly, I don't really care if people are unreasonably demanding of a bunch of corporate-owned TV and movie studios. Disney owns half of media at this point, it's not like they're going to be substantially hurt if people are always dissatisfied with their attempts at representation. Those movies still do well regardless. If it's just a matter of you finding the discourse displeasing, again, it's not on the LGBTQ+ community to make their discourse palatable to you or just shut up about it, it's on us to be supportive and defer to their experience regardless.\n\nBut the best LGBTQ+ representation we can get in media is when it's actually coming from LGBTQ+ creators. So while we should always ask for more from our ubiquitous corporate-owned media, don't forget to support content coming from LGBTQ+ creators and those of other marginalized groups.",
            "title_similarity": "0.7682874",
            "sentiment_compound": 0.5965
        },
        {
            "id": "h19t7h8",
            "score": 14,
            "text": "I think that this isn't a fair way to approach the problem. Correct me if I'm wrong, but your stance is that now that the queer community is better realized in the states that they do not need to form as much their own community with its own culture because that risks \"alienation\". How is this any different from telling any other culture the same thing? The fact that labels happen to create prejudices is not at the fault of the labeled but the people forming those ideas.\n\nAs for the seemingly endless labels bit, you mention that one's labels, orientations, and all that jazz shouldn't matter whatsoever, so why not include what they wish to be called? When so many labels are placed, sure it takes value away from any individual label, but what should it matter when it seems we both believe that these labels have no value at all?\n\nUnforgiving in demanding representation, I don't see as a fair representation of most of the pride community, and of course there are some extremes to them where sure some people demand extremes. But if sexuality is to be insignificant, what's the matter with having queer characters? If race is insignificant, what's the matter with having poc? Honestly I feel like the majority of romcom writers are missing out on a lot of potential here in this space, but even if they don't want to focus on queer relationships, that shouldn't make it taboo to have them in the first place. Now this isn't what you said whatsoever, I'm not trying to put words in your mouth. But this is just the other side of the coin to your stance, and the idea that the entire pride community is pushing themselves away (I'm sure some individuals are doing so by being extremely extreme sure) is not one that I see as generally true.",
            "title_similarity": "0.82382286",
            "sentiment_compound": 0.9754
        },
        {
            "id": "h1anznl",
            "score": 4,
            "text": "TL;DR: \n\nI'm sure you're a good person and all but you cannot claim to be completely for trans rights but make our issues the thing that are apparantly tearing the community apart. Labels are not actually creations of solid outgroups, they are merely ways for people to explain their connections to sexuality and gender identity. Which are already important traits in society whether you're pro lgbtq or not.\n\n&#x200B;\n\nI think I have a good chance of changing your view in the same way that I had to change my view on this subject. Because I hate to be the bearer of bad news, but you are obviously and inherently wrong here. Your post is kind of confusing in the fact that you seem to want conflicting ideals. On one hand you protest against any idea that you could be a bigot. You're a cis-gay man after all. You didn't experience any oppression when you came out. You had all the benefits. All you had to do was not be one of the \"others\" that society hates so much. \n\nYour whole post seems to contradict itself. You seem to want your cake, and the ability to eat it too. You say you understand that trans people exist, that they should be called what they want to be called, and that there is still work to be done. Yet then why are you so against these new labels? \n\nIf trans people are to be respected, and if transgender identities are to reach the status in society you seem to believe they should reach; then should we not expect people to become aware of the language surrounding transgender people?\n\nI think it would help if I explain why this is even important, and try to explain why you're so wrong about your premise. Gay and straight basically exist because evolution created a structure in our brains that gave us a drive to have sex. Straight is the norm because it is what creates the most offspring for a given species. But brains are complex, bodies are complex. The driving forces that actually develop in utero are complex and unable to be perfect.\n\nSo you get differing sexualities as a result, just from simple probability there are going to be a significant portion of the biologically male population that have a sexual preference for men. Not only that but their sense of romance and love is wired around other men. These are simplified explanations but you can see how due to the variability of brain development; there is going to be a spectrum of sexualities. We may have very powerful brains but we are still animals and we are still products of evolution. The way we see the world, and the way we see our place in it; is going to arise from millions of years of evolutionary psychology.\n\nNow we know that intersex people exist. If the body can produce mixtures of male and female anatomy in a single individual, isn't it far more likely that there is a spectrum of possible gender identities in the human population? The way gender identity, and other abstract identities, develop in the brain isn't known perfectly. But we can see the results of them from the way human society structures itself. There are ideas of non-binary people all throughout history. It is impossible for gender identity to be purely male or female, it just isn't. Eventually you are going to get a brain pattern that requires a person to identify as non-binary so that they can make sense of their place in society.\n\nAnd I'm sorry to say this but you being gay doesn't give you any insight into this, at least not over the insight any straight person would have. There are so many ways of being that you and I cannot wrap our heads around. I don't know what its like to be bi-gender. I don't know what its like to be purely asexual. I don't know what its like to be aromantic. Yet I can plainly see that these people exist, and that their acknowledging their existence makes their lives better. Not only that but I would argue it makes society better as a whole. If I wasn't gender fluid I wouldn't know all of this stuff about gender and psychology. I wouldn't have felt the need to learn about why gender is the way it is. I wouldn't have felt the need to transition. I wouldn't have needed to defend my existence from people.\n\nI believe that you have internalized this idea of \"the other\". This fear in the back of our minds of an outside threat to our community and safety. Its something that drives bigotry in a lot of circles, and I'm not stranger to the feeling either so please don't feel like I'm trying to call you a bad person. Its not the fault of society, or the fault of humans that bigotry exists; in your mind it seems like its actually that most people are rational and are just lashing out at a genuine problem. That its gay people's responsibility to be normal, to not be campy, to not be different. It seems like you think no matter how genuine a persons cause is, if they cause some kind of discomfort then they're at fault for it.\n\nMaybe I'm simplifying things a lot here but this thread is long and I'm running out of ways to shorten it. Here's my final point. These labels exist because they are needed. You admit that your only cause to make fun of these people was solely because other people were doing it, and that you thought it was silly. But this was only a non-binary person coming to you and telling you of different people who identify in different ways. Maybe you should think of why you laughed? Why you thought it was such a big deal? I do not believe that society should run based off of the more fear-based human psyche traits. I do not believe that we should cater to peoples fear of the unknown. Bigotry will never stop happening on large scales until we all collectively agree that something being afraid of the boogyman is just that. A boogyman that we use to justify our actions.\n\nLGBTQ rights are not won in this fucking country. I'm sorry to suddenly break out the intense language but they just fucking aren't. When I had to be scared of my own father beating the shit out of me because our relationship had gotten so fucking toxic; I can tell you with first hand experience that LGBTQ rights aren't won. You think capitalism won't stop exploiting us the second it becomes unpopular to have rainbow flags anywhere? I hate to break it to you but the second the political tide turns again, rainbow shirts at target are going to be a thing of the past. We still have tons of political battles to fight against in this country. You could be the most white collar, normal gay man in history. It wouldn't matter. A lot of those people you claim to have had no problems with when you came out, I guarantee would vote against LGBT rights if it came down to it. The fact that they even have that ability is the problem. The fact that its even a possibility that gay marriage could be overturned is a problem.\n\nNon-binary people are not the cause of homophobia. You cannot claim to recognize that trans rights still have a long way to go if you think that labels are somehow to blame. I mean why even use the label gay then? It seems like you think its the only label that should be okay? I'm sure thats not your conscious belief but it sure seems to be the overall implication of your post. Labels exist because people are different. The labels do nothing except for describe how people feel. If someone is really so weirded out by somebody calling themselves 'star gender', that they would vote against humanitarian issues? Then they weren't a good person to begin with, I'm sorry but its just true.\n\nThe point of all of this is that we need to move past the fear response that human society has to change. Because right now change is what is needed for this planet to survive. I'm sick of humans trying to justify our bullshit to ourselves because 10 million years ago our ape ancestors had to be scared of predators. Human society needs to train itself to do whats right, not whats comfortable. Nonbinary identities exist, and the labels are nothing but a way for people to discover more about themselves. I doubt you're going to find many asexual people who feel like they're special snowflakes who aren't like anybody else. They're just people who have a unique sexuality that they've found a poignant label for. The label doesn't actually create an out group, it merely allows somebody to explain the way they feel in a society that places a particular importance on those types of feelings.",
            "title_similarity": "0.8979094",
            "sentiment_compound": 0.8703
        },
        {
            "id": "h1a45ha",
            "score": 27,
            "text": "This came up in another conversation regarding kink at pride, and one commenter boiled it down to really being two approaches at the core. Assimilation, or liberation. \n\nThe assimilation school of thought believes much as you do. That the chief complaint of straight people is that we are different, that we go against the grain, that freedom and acceptance are best gained by becoming a normal and accepted part of society. Look at this gay person, there is nothing different about him than your neighbor. \n\nThe liberation school of thought posits that assimilation did not, and does not work, that it was the refusal to be shoved under the carpet which led to the current era of gay rights, with the Stonewall riots. That view is that assimilation is a trap, to give the cishet population an excuse to ignore us, and in the process marginalize us. By celebrating who we are publicly, with no apologies, we become visible and our struggle becomes their problem. \n\nThese schools aren't particularly compatible, because they see each others actions as undermining the movement. Someone who believes in assimilation, would speak as you. They would recoil at any aspects of LGBT that seem too outlandish for the cishet community to accept, because both schools know damn well that despite all of our work, homophobia runs through our society and culture like a cancer, deeply engrained in the actions of everyone participating. \n\nThe liberation school, would see the assimilation school as being counterproductive, working to get whatever they can, and shove the problematic elements under the bus. Whereas their efforts helped bring LGBT issues out into the public eye. LGBT people exists prior to the modern queer rights movement, and arguably, we were assimilated. People laughed at the idea of being gay or lesbian, it was played for laughs, and not taken seriously, and those that were were treated as mentally ill. Society did not concern themselves with the minority, because arguably, there was no vocal minority.\n\nYou talk about labels, but lets go back in time. Once upon a time, people were only really talking about \"gay\" people. Gays and Lesbians, where was the rest of LGBT? I am bisexual, was my label too much for the straights to accept? If labels are an obstacle to gaining societal acceptance, where exactly are we drawing the line, and which parts of the community are we telling to fuck off and die, now that we have our rights? LGBTQIA+. Which letters are we cutting off to appease the cishet population? Asexual people exist, are we throwing them to the wolves? Intersex? What do we do with people under the more umbrella terms? Are we just going to fold all pansexuals into bisexuality, because its convenient, because we can't expect straight people to understand and so shouldn't try?\n\nAnd let us be clear, the struggle for LGBT rights is not over. Homophobia is still a stain on our society, and people in power are actively working against us. If we went down the route of assimilation, the homophobes would be happy, because we can get swept under a rug again. If we remove the culture that has developed, and worked to conform, it allows people to ignore us, to pretend we do not exist. Sure, Jim down the road might be gay, but he is one of the good ones. We can treat him like a *normal* person because he acts like a *normal* person.\n\nThe problem is that the LGBT community does have problems that the straight community doesn't. And when those problems are not brought into the public eye, they are ignored. Look at the recent legislation to try to make it harder for our trans siblings from getting the medication they need. Defeated by the narrowest of margins. The lawmakers are not trans, and oftentimes, just do not care. They pass laws that have effects they do not understand, because oftentimes, they don't know, they can't know. Look at AIDS. A devastating disease, that the government knew about, and willfully ignored. But it affected LGBT and minorities, and the government was willing to have those people die. \n\nGenuinely ask yourself, what endgoal do you have? Because I subscribe to the liberation school of thought. I think that the ideal society is one where sexuality is understood, accepted and celebrated, our differences which make us who we are something to be proud of. I think that in a society which is so steeped in heterosexual norms, we have a moral obligation to loosen it up. If a guy wanted to take a couple months experimenting with other guys in college to understand his sexuality, I think that should be celebrated and normal, a good thing for straight people and LGBT people. Why is there so much social stigma? If a guy feels like wearing a dress to school just for fun, or to know how it feels, or because he wants to experiment with gender expression, why shouldn't he? How many people do you see complaining about the rainbow, that we somehow stole it from Christians? We didn't steal anything, they abandoned it. They would rather give it up, than be thought of as gay. And you see stories, of universities which might ask people to wear blue jeans some time to support the LGBT community, and everyone delibrately avoids doing so, because we fear the association. \n\nI don't see the end goal of assimilation the same way. It might be uncharitable, but I see it as a world without Pride parades, without the rainbow stickers. Sure, you might be able to tell your parents you are gay without reprisal, but rock the boat, buck the trend, go against the norm, and you are back to being ostracized by society. Sure, maybe women and transwomen can wear dresses, but a man, straight or otherwise cannot because that goes against the norm. There may still be a gay character here or there in movies, but in the background, easily ignored. After all, the community is just a small portion of the population, so statistically, it doesn't make sense to make LGBT friendly movies, its so unlikely, that its pandering, its forced representation. I can see the appeal in a world like this. But I don't think it is the best solution we can work towards. I don't want to settle for this type of world.",
            "title_similarity": "0.8609302",
            "sentiment_compound": 0.9821
        },
        {
            "id": "h19q9kf",
            "score": 112,
            "text": "[deleted]",
            "title_similarity": "0.21122198"
        },
        {
            "id": "h19lubv",
            "score": 174,
            "text": "> Labels seem to do nothing else but create early and often unhelpful prejudices. \n\nHave you ever read Samuel R. Delaney? \n\n(I haven't, but I'm gonna [crib from the cliffs notes](https://www.youtube.com/watch?v=Gq0ZHgKT2tc) anyways.)\n\nOne of the things Delaney describes in his memoir about growing up as a gay man was that he simply did not have the language to describe his experience. He could call himself \"homosexual\" or \"gay\", but both of those had connotations at the time which simply did not apply to him. \"Gay\" implied a degree of femininity that Delaney didn't have; \"homosexual\" implied a _mental disorder_.\n\nIn a situation like that, even having a conversation about yourself becomes increasingly difficult. You may feel a certain way, but you may also not have the right words to _describe_ that feeling. Maybe they don't exist. Maybe they exist, but carry baggage you aren't comfortable with. Delaney struggled to find the words to describe his experience as a happy, well-adjusted gay man in a time where the very idea of a \"gay man\" being happy and well-adjusted was somewhat unusual.\n\nThis sort of thing can have immense power. I wouldn't underestimate the value of choosing your own way to describe or define yourself - it was and continues to be a significant part of LGBTQ liberation.",
            "title_similarity": "0.7290944",
            "sentiment_compound": 0.4145
        },
        {
            "id": "h19vgqm",
            "score": 84,
            "text": "I'm confused by your argument and the fact that you seem to be agreeing to some points but not giving deltas leading me to believe there's some fundamental pat of your argument we're missing. Is your main point tht labels such as gay, lesbian, and transgender shouldn't exist?? \n\nI saw in one of your comments you compared it to having two kids instead of one or three. You said it didn't have nor need a label so it's normal. But the thing is, it isn't normal because it doesn't have a label. If having two kids instead of three was looked down upon as disgusting and gross and it was a big fucking problem then here would have been protests, fun little saying on the signs, and inevitably a word they choose to identify themselves with. \n\nIf your argument is true or wouldn't be 'normal' to distinguish between guys and girls, or brunnettes and blondes. If you feel it's othering to refer to yourself as gay while everyone else is straight it's not a problem of label, it's how people react to the label or how you were brought up to see that label. If you were brought up in an unaccepting household that regularly used the word gay in bad light then you might not identify or feel as comfertable with it. \n\nAlso while majority might support lgbtq rights, that majority stands at a little less than 76% in the new poll released March 23 by the PRRI. this is an amazing number but still leaves 25% of people 'unnacepting.' Accepting can also mean various things. People that don't support but respect can be called accepting, people that would throw their kids on the street if they came out but have gay friends could be 'accepting', people that believe gay people should stay in the bedroom could also be called 'accepting.' I don't know where you live but where I am in the US, if i had a girlfriend i would be scared to kiss her in public because while ik it's a slimmer chance than 20 years ago I'm still scared of what could happen. It'd be even worse for gay guys living where i am.  Gay people are still legally allowed to be kicked out of an apartment and killed for coming out??? (Gay panic defense). In 25 states, landlords can still refuse to rent to gay people. In 26 states, a baker or florist may turn away a same-sex couple. In 35 states, a banker can deny a loan based on an applicant’s sexual orientation. Lgbtq rights are far from won. \n\nAgain one of your comments mentioned love victor and requests for more diversity which you seemed to think was also harming the community.  I'm not sure how requesting something of a show is harming the community since its pretty commonplace for the consumers of a show to critique it but do you think there's enough lbgtq representation?? I didn't know gay people existed till the seventh grade and if you went and asked a class of fifth graders today I'd say maybe a quarter would know. Have you ever seen a gay couple in a children's book? How many popular book series do you know that features a gua character. The first book series i read with a gay character was percy jackson (and it was a huge part to figuring out that i wasnt straight either). If i was a teen looking for a cute wlw movie id have but I'm a cheerleader and not much else. I could count the number of lesbian movies (not to mention GOOD lesbian movies :/) I know on one hand and that certainly isn't for lack of trying. \n\nNow add on to that that most gay movies are white as hell and cater to a straight audience. Trans movies. You know any of those? Without a white lead? Trans gay movies? Trans lesbian movies? Nonbinary lead, a lesbian movie without a sad fucking ending, COMEDY, black lead, east asian lead, south asian lead, middle eastern lead, interacial relationship?? Different genres with lgbtq characters?? Does that seem 'much' to you?? You could find thousands of movies for ANYTHING with straight people in it. It's not fair that lgbt is a genre that's mostly the same few things repeated over and over again. Yes i want representation! I want to see someone like me on screen. It's taken for granted how much straight people have. I don't blame people for wanting more?",
            "title_similarity": "0.78790677",
            "sentiment_compound": 0.9657
        },
        {
            "id": "h1a491t",
            "score": 22,
            "text": "1. What do you mean that we're \"in a bubble\"? 99% of LGBT people live a \"normal\" life, regularly interacting with cishet people in our jobs, while shopping, and while participating in our hobbies. The fact that there exist communities where LGBT people are more likely to live, or events geared towards LGBT people doesn't mean they are \"in a bubble\" any more than any other subpopulation. If your view is that all subgroups are \"in bubbles\", then I claim that living in a bubble does not necessarily lead to the results you claim it does.\n2. Labels are a natural and unavoidable part of language - if there is an identifiable group, a label will be created to refer to that group. If the group doesn't specify what they want to be called, then people outside that group will do so. Wanting to get rid of labels is like wanting to get rid of nouns - it's simply not how language works.\n3. Has Love Simon truly faced \"strong criticism\" for not having enough LGBT characters? I'm sure people have criticized it on those grounds, but after a brief search, it appears to me that the vast majority of commentary about its representation is positive (ignoring the reviewers who don't like it because it contains any gay people).",
            "title_similarity": "0.625906",
            "sentiment_compound": 0.7811
        },
        {
            "id": "h19sogq",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h19suzt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1a096i",
            "score": 3,
            "text": "I think people just like being part of something.  To find purpose, to fit in.  So when something strikes personally for someone they lash out at the thing that’s attacking them.  \n\nLGBT+ groups have like subgroups beyond subgroups.  It seems to be that culturally they find people who are like them and stick with it because it strikes them personally.  \n\nBring in all the in-group and out-group social psychology stuff and then throw in gatekeeping, groupthink, and the bystander effect and you have a great concoction for loud minorities to speak for the group as a whole and a lot of dung gets thrown.  \n\nThis happens with any group doesn’t really matter if it’s lgbt or not.  \n\nUltimately, a solution to this would be compromise and working together (in theory)",
            "title_similarity": "0.8065601",
            "sentiment_compound": 0.6448
        },
        {
            "id": "h1a1ubn",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1a3vel",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1a4ira",
            "score": 1,
            "text": "The LGBT+ community are fine the bullshit you read on socials by ppl with either an axe to grind against that community or ppl pretending to be a part of that community and causing issues are the problem the hate and anger stems from those sites",
            "title_similarity": "0.74001527",
            "sentiment_compound": -0.9201
        },
        {
            "id": "h1a8y9y",
            "score": 3,
            "text": "I really love the pride movement. I love that people who are still actively marginalized are getting a voice. I also agree that SOME ASPECTS (before I’m hanged) are putting the movement at a disadvantage. \n\nI was incredibly excited to take my son to a pride parade, have him in an environment where everyone knows they can be accepted no matter what. I got called a breeder repeatedly. I had to explain to my son why the guy in leather and shiny spikes was being mean like that. He thought that guy looked so cool. I tried so hard to walk around and be happy with the people who were happy, and be there for the reason I was there. I’m pan sexual and sapio oriented. I don’t wanna wear a button. I’m supposed to fit here too right? The fact that I had a natural child with a man, and I am choosing to be with a man now, does not change who I am or the hate I’ve gotten while dating girls I was interested in. The vicious disregard when I wasn’t sure if I liked either was shitty and dehumanizing. I want people who felt that to feel safe and loved and known. Keep. Pride. Moving. We need it. \n\nOn another note, I also had an opportunity to explain to my son what furries, bdsm pets/subs, and aggressive public nudity is all about. I will not be taking him back to another pride event unless it’s marked in Family Friendly in big giant letters. He was eight. I brought him out to show him that being with the person of your choice shouldn’t be a problem. I’ll do it again. Where there is child appropriate clothing and themes.",
            "title_similarity": "0.69073856",
            "sentiment_compound": 0.991
        },
        {
            "id": "h1abjth",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1adaqq",
            "score": 1,
            "text": "In that division, people find themselves despite giving up collective political power. However, there are still clearly voting lines, there is still clearly unity when it's needed and perceived as important.",
            "title_similarity": "0.6395464",
            "sentiment_compound": 0.6327
        },
        {
            "id": "h1aec8e",
            "score": 6,
            "text": "It feels like part of what you're saying is, \"LGBT+ people have developed their own culture distinct and noticeably different from cis-straight culture, and giving up their culture and assimilating with cis-straight culture would help them avoid discrimination.\" This is kind of what I read when you say:\n\n> In the situation where someone is describing to their friend someone else at their work perhaps, if he says ‘oh he’s gay’, the general concept is going to be overly camp, talking a certain way etc, which is going to be deeply unhelpful.\n\nNow, imagine a substitution here:\n\n> In the situation where someone is describing to their friend someone else at their work perhaps, if he says ‘oh he’s **black**’, the general concept is going to be overly **ghetto**, talking a certain way etc, which is going to be deeply unhelpful.\n\nI realize \"ghetto\" here has much more negative connotations than \"camp,\" but it's the closest analog I can think of. Imagine I used a hypothetical word which covers a stereotype of black culture but isn't as negative, equivalent to camp.\n\nWould you argue that black people should stop labeling themselves separately from white people, and try to tone down cultural differences and assimilate? For the latter, there certainly are people arguing that - just look up \"respectability politics\" for a lot of discourse on it.\n\nBut I think here a good question to ask is: \"Is gay culture looked down upon because it's inherently bad, or is gay culture looked down upon because it's associated with gayness, and gayness is looked down upon?\" In the particular case of effeminate men being looked down upon, perhaps the question is whether this is due to something inherently wrong with this, or a cultural bias against effeminate traits (which is tied to a cultural bias against women).\n\nMaybe assimilation would decrease bias - there certainly is bias purely against the unusual - but it would come at a huge cultural cost. And it also wouldn't eliminate all bias - bigots can latch onto any trend and paint it as bad, and sometimes even come up with stereotypes that have no basis whatsoever in fact.",
            "title_similarity": "0.84390223",
            "sentiment_compound": -0.759
        },
        {
            "id": "h1aez32",
            "score": 1,
            "text": ">Labels seem to do nothing else but create early and often unhelpful prejudices. In the situation where someone is describing to their friend someone else at their work perhaps, if he says ‘oh he’s gay’, the general concept is going to be overly camp, talking a certain way etc, which is going to be deeply unhelpful. Need I not mention the gay best friend thing. I give the gay example as it’s the one I know most of, but I’d expect the same for many in the community. So can we please not use these labels.\n\nI would argue that increased representation and visibility in society have worked to reduce these stereotypes. For a long time, the stereotypical, campy, effeminate gay guy was the predominant image of gay men in society (I'm a gay guy who grew up in the 90s and this is what I grew up with!). But over time we've come to have a greater variety of gay guys represented such that this stereotype is becoming less prevalent than it was before (particularly among the younger generation that's had more exposure to counter-stereotype gay men). If your concern is the continued propagation of widely known stereotypes, I don't see how less representation (and correspondingly less diversity in the LGBT+ people being represented) helps.\n\nI'm also curious to know what you mean by \"can we please not use these labels,\" because even you used the label in your CMV?",
            "title_similarity": "0.8341868",
            "sentiment_compound": 0.9762
        },
        {
            "id": "h1ag9kx",
            "score": 1,
            "text": "The problem is that no one controls a community. I mean, unless there are secret gay meetings that I don’t know about because I’m straight.\n\nPeople have conflicting desires to differentiate ourselves from the masses, but also belong to something. We don’t want to be invisible, but we don’t want to be unwillingly exposed. Many people manage to find a balance that suits them eventually, but particularly as a teen or young adult, it’s a real and meaningful struggle. There will always be people trying to find this balance and some of them will be gay.\n\nThere will also always be people who are trying to figure themselves out. Having some unique traits is cool, but no one wants to be alien. Some of these labels can help people understand themselves.\n\nAll of these are manifestations of human desires that go beyond sexual orientation or gender identity. So, I don’t think this is really even an LGBTQ+ issue. It’s a human issue that we  see in the LGBTQ+ community because the members of that community are more free and actually encouraged to talk about it and not hide themselves away in shame. Since this situation is relatively new, there are going to be some extremes that get tried out and probably abandoned, like your 75 different genders.",
            "title_similarity": "0.82114285",
            "sentiment_compound": 0.7443
        },
        {
            "id": "h1ah6ud",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1ajzyz",
            "score": 1,
            "text": "We’re a coalition of people who are bonded by a common goal of advocating for the rights and acceptance of all who do not fall within the “traditional” sexuality or gender expression. When new labels or ways of describing different expressions arise they do not divide or separate, they allow for a greater understanding of the people who make up the coalition. Frankly we are not concerned by anyone’s whining about adding more “labels” and we understand that just how gays and lesbians were the groups spearheading the movement in the 60’s, 70’s and 80’s that as they gain acceptance we use that acceptance to lift up the most marginalized sub groups in our community. As we lift up trans people, non binary people and so on society will have the same fear and skepticism towards them that they did gays and lesbians. But we stand besides them in unity because we are a coalition. The “when will it stop?” question in regards to LGBTQA+ representation and acceptance is gross lol.",
            "title_similarity": "0.7389249",
            "sentiment_compound": 0.836
        },
        {
            "id": "h1ak6nh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1akap7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1ales4",
            "score": 1,
            "text": "I get where you are coming from, but you also recognise the struggle is far from over. I get how it can be annoying as a bystander who does nothing wrong, but it's also scarily commong for a kid to get kicked out after coming out. Kids become homeless over this. Trans people often have to resort to sex work because they can't find jobs outside of that field.\n\nThat being said, isn't it understandable, or even desireable, for the colective to create a cohessive group? Even for relatively priviledged lgbt+ folks who don't have to go through so much, it's beneficial to create a community where they feel comfortable in a safe space? Even with integration being the long term desireable goal, the need for a strong united group is far from over. Ffs, transphobes even got their own branch of femminism.",
            "title_similarity": "0.83367217",
            "sentiment_compound": 0.9583
        },
        {
            "id": "h1alnf8",
            "score": 1,
            "text": "The trend to make the diversity within our LGBT+ community visible with a flag for everyone and a label for everything did irritate me as well.  Here is what changed _my_ view on it:  implicit association, and a desire to counteract it.\n\nSpecifically [I came to realize through tests](https://implicit.harvard.edu/implicit/takeatest.html) that despite all good intents to be an open minded world citizen without prejudice I grew up learning and engraining into my brain a gazillion of prejudices and thought patterns which rationally, I reject but which anyhow are still part of myself.\n\nAnd a proven way to counteract those is to give our associative brain counterintuitive data (\"Exposure to counterstereotypical exemplars\").  And most things LGBT+ are invisible.  \"intel inside\" put a sticker onto boxes to make visible:  it's not AMD in there, it's intel.  And in that vein, we need visible positive and counterstereotypical representation of sexual minorities, so we get positive associations.\n\nAnd this visual representation needs to be out of proportion in programmed content, because, duh, they are minorities, if minorities are represented proportionally, they \"never\" appear.\n\nTL;DR:  representation and labelling counteracts implicit association and helps our youth to find positive role models.",
            "title_similarity": "0.80191845",
            "sentiment_compound": 0.9606
        },
        {
            "id": "h1alnys",
            "score": 1,
            "text": "I think the issues you mention stem from people who make being LGBT their WHOLE identity. People like that aren't too different from people who make liking Siracha their whole identity.\nAlthough there is a very wide spectrum when it comes to how the \"straight\" community sees the LGBT community, it seems that the majority are rather indifferent. When you are on the fence, it only takes a nudge to push you to either side. I have met all kinds of LGBT people as PEOPLE first. Only after we had met, and found a couple of common interests, did I find out that the person was LGBT. By that time, it becomes a \"detail\", and in no way affects my view of the person. This is usually followed by a little more education (for me), and will make me more supportive of the LGBT cause.\nIt's when a person ONLY talks about being LGBT that things get a little annoying. I'm not homophobic, I get annoyed by anyone who only focuses on ONE thing. IF you only talk about your LGBT status, then mentally, I chalk you up in the same league as someone who only talks about Minecraft, or sports, or whatever. As a POC, I can relate to the historical persecution that the LGBT community has endured. I have had to work hard to ensure that my racial identity doesn't become my whole \"thing\". I feel like the LGBT community is headed in the same direction, and it's only a matter of time until being LGBT is treated no different than having curly hair.",
            "title_similarity": "0.7797061",
            "sentiment_compound": 0.6353
        },
        {
            "id": "h1am95m",
            "score": 1,
            "text": "Look at it this way, before we only had a few colours on the visible spectrum. But as time progresses we have each new variant a different name. There are some staunch supporters that blue is blue, but understanding that colour was a spectrum took its time and a lot of different labels.\n\nSame thing with sexuality. The difference though is that sexuality isn't for others but for how we see ourselves as a colour in the world. Does identifying baby blue from cornflower blue lessen the value of blue or change it's importance? Not for some but for others it makes all the difference in the world. \n\nBeing too rigid even then too flexible can cause damage if you expect others to be the same as you. By exposing people to different colours of the world you encourage others to see how others paint their world. You experience the value that each of the colours bring to the table, even if to you personally blue is blue.",
            "title_similarity": "0.75005937",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h1amld3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1anbfs",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301205"
        },
        {
            "id": "h1anq86",
            "score": 1,
            "text": "LoL, I hate when people speak of the gay community as a monolith  as if as soon as you have sex with somebody the same gender you immediately have all of the qualities listed in your post....and you say it's the lgbtq coming up with labels....you just labeled and tried to define a whole group of people yourself.\n Also the separating and labels were created by straight people long ago as a way to identify people guilty of the crime of sodomy. It was never an issue that needed to be defined before that as many people had sex with whoever they wanted and didn't feel the need to put a title on it. The wild west was full of same sex relationships or people in relationships with trans women and especially trans men who have a vibrant history before the laws STRAIGHT people came up with.",
            "title_similarity": "0.7623131",
            "sentiment_compound": 0.186
        },
        {
            "id": "h1aolb1",
            "score": 1,
            "text": "People desire association for the community it provides. But yes, association also lends itself to \"othering\" or even just being misrepresented as an individual as it extrapolates a perception of the group as a whole vs the various other groups. The issue is that people believe they should get the positive, but that any negative is an unjustified practice. But that's not really a logical flow of the identitarian ideology.\n\nThe issue you present is basically that people seek a group identity rather than seek to be observed as an individual. And that's often because those people wish to define people by the group, rather than as an individual. So the very practices of stereotyping and prejudice that we dislike uses the same base mentality of those with strong identities. That the \"label\" matters more than any actual belief or behavior expressed.\n\nIn this, I agree with you.\n\nBut it's important to recognize how these identities haved form as a matter of protecting oneself and past harmful practices of prejudice. If society targets you because they simply perceive you as a member of a group, it doesn't matter your own association, you'll start to feel defined by that label and find it unescapable. And thus, people just buy into the label, but then hope to change in any way they can. It's a logical attempt at a defense, *given*, that others are using such a label upon you. \n\nHowever, does that actually work in forming an accepting community? I'd argue it does not, and it seems you'd agree. You can't simply attempt to redefine the label, because the label itself isn't actually what is at the heart of the issue. But I'd like to change your mind in the sense that it's an understandable reaction, *especially* by those that have a more identitarian ideology (which can often be an understandable place to go for those attacked by such a group association). So from their perspecrive, it's not as harmful as your perception tells you. Because they desire to be recognized as having this association, and don't desire a society based more so on individualism.\n\nTo fight against the identitarianism of those using such in a negative and harmful way addressed at others, we have to fight against the identitarianism of those assigning such to themselves as well. And that's just the conflicting force we are dealing with now.",
            "title_similarity": "0.7995308",
            "sentiment_compound": 0.7719
        },
        {
            "id": "h1aoxko",
            "score": 2,
            "text": "It's still weird but weird isn't bad. I'll call you whatever you want to be and respect you for who you are. My biggest gripe is it a m2f wants to hook up and I say no they blow up and question why don't you accept them for who they are. Sorry, just not my thing. \n\nDo whatever you want surgically and hormonally but it still doesn't change who you are biologically.",
            "title_similarity": "0.78926706",
            "sentiment_compound": 0.3397
        },
        {
            "id": "h1ap6s0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1aq421",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1aq850",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1aqc5v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1aqjwj",
            "score": 2,
            "text": "I think you need to shift your perspective. I see LGBT+ being viewed in this post mainly from a gay/lesbian/queer POV, rather than what you seem to be confused about, which is the transgender experience.\n\nIt’s a bit more complicated that sexuality because there’s a lot more gears turning. I feel like I immediately knew I liked girls, what took me 20 years to piece together is that I also am a guy. \n\nThe issue is that you are minimizing why these labels are important. We can call all non- strictly heterosexual people queer, but that means you would have to give me at least a full sentence to describe yourself when we spoke. That sentence might be even longer for pansexual individuals. Maybe 3 for a romantic asexual. But we have terms for these that help us get familiar with the spectrum of human experience. \n\nI should think it’s only fair that transgender people get the same representation that sexually queer individuals have. There’s a variety of us and the multitude of terms can sound complicated at first glance. You don’t have to become familiar with every single one, but it would be nice if people didn’t look at us like we’re sexually and mentally deranged people looking to corrupt society. \n\nIt’s nice and easy to lump everyone together and call it a day, but you’re asking for this on your terms. You’re saying you’ve had enough with how far this has gone and want everyone to pack it up. You, the gay man. Don’t mix it up, you had the privilege of coming out to your family easily. the privilege of being accepted into a society who UNDERSTOOD who you were. Do you understand who we are? Or did you laugh with your friends when that very brave person went on stage to tell you about something important to them. \n\nHowever confused you are about gender, I promise it’s worse for those who are questioning themselves. Maybe not all of these terms will stick, but the point is that none of us are free until all of us are free. We have to acknowledge our own struggles and those of the people around us. We need to empathize and be humble and realize the effort it has taken to get to this point. \n\nI highly suggest you look into the issues the trans community is grappling with, not just with the rest of society but within the community itself. It’s really interesting stuff and I think you will better understand what the hold up is.",
            "title_similarity": "0.76883674",
            "sentiment_compound": 0.9967
        },
        {
            "id": "h1aqko3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1arhbf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1at1a6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1at7eq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1atlpl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1atv1g",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1aue0f",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1aw2eh",
            "score": 1,
            "text": "I agree with you, but only if the LGBTQ+ community would be as \"advanced\" or seen as \"normal\" in society as heterosexuality because as you said, you only single yoursef out by doing so.\n\nBut! The LGBTQ+ community sadly isnt as normal in society like heterosexuality. There are still many people that are asexual/gay or lesbian/trans or nonbinary that dont know that they are not a straight cis person. They feel frustrated, depressed, closeted, confused and lost because humans like to identify with labels to form an identity, if youre having an internal conflict with that identity for aforementioned feelings come up. So those labels help many people realize who they are, especially for people from ages 6 - 30 use labels to form an identity from which they can move in a maybe more fitting way (like instead of being a \"couch potato\" you want to be a \"gym dude\"). And some straight cis people (the older they are the higher the percentage + what education they received) need those labels to understand how those people feel and who they essentially are since sexuality is a rather big part in people's lifes e.g. asking when you marry or getting a baby, connecting genders to colours (blue = boy, pink = girl) or clothing (dresses = girls, suits = boy), asking when/if you are still a virgin etc.\n\nsorry for some bad explained sentenced or weird word usage, english is not my native language and im pretty bad at communicating",
            "title_similarity": "0.867884",
            "sentiment_compound": -0.9118
        },
        {
            "id": "h1awld4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1axe2g",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1axpxw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1ayp3y",
            "score": 2,
            "text": "1. Members of the LGBT+ community express themselves in a certain way that apparently some people find disagreeable (e.g. identifying as an obscure gender or asking for more representation in media)\n\n2. Members of society, either working alone or as part of an organization, *choose* to harm the LGBT+ community as a whole (e.g. choosing not to respect people’s gender identity or choosing not to create media with LGBT+ representation) and *claim* that the reason they are doing so is because of (1)\n\nFirst of all, I think it is important to note who is choosing to do harm here. You claim that “the LGBT+ community is managing to harm themselves”, but in actuality what is happening is that members of society are choosing to harm the LGBT+ community. If you think that harm is justified then you should make that argument; it’s not clear from your original post whether or not you think that.\n\nThe second issue I want to bring up is a little more subtle: taking the claims of the people/groups in (2) at face value is assigning a lot more good faith than they deserve. Are we to believe that if all at once the LGBT+ “merged” with society, i.e. stopped engaging in behaviors that certain people find disagreeable, that all our troubles will go away? These people will stop harming us? There will not be any more discriminatory laws passed, and legal rights such as marriage would not be challenged? What I think is more likely to happen if we stop doing thing X that certain people find disagreeable, then next they’ll demand that some other thing Y is disagreeable. Eventually, that “thing Y” will be the fundamental issues of “engaging in same sex relations” or “having a different gender identity than that assigned at birth”, because their objection to “thing X” was not made in good faith to begin with.",
            "title_similarity": "0.83438957",
            "sentiment_compound": -0.9736
        },
        {
            "id": "h1ayzga",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1azip7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20301206"
        },
        {
            "id": "h1b0cuv",
            "score": 3,
            "text": "You’re hitting on something very similar to the issue that “Asian Americans” and those who rally under that banner are experiencing. \n\nLabels are for rallying behind- to gain support, or opposition to/for/against something. The size of your label is actually a misunderstood piece. Surely we need a label for all humanity, and we have labels for genders, races, and religions, but is there a point where labels get too granular to be effective? Is there a point where they are too large to hold meaning? \n\nI bring up “Asian American” because it is such a wide label. 25 years ago, I would argue it was a very important label for people to rally behind. Now, I wonder if the sands have shifted enough that we are no longer doing justice to everyone by putting them into the same label. I think this is a worthwhile conversation to have, about what labels mean to people sentimentally, and what they functionally do for groups as well. It may be that you are right, or it may be that in a few years they will greatly benefit by carving out more individualized labels.",
            "title_similarity": "0.7820565",
            "sentiment_compound": 0.9755
        },
        {
            "id": "h1b0k6k",
            "score": 3,
            "text": "It's hard for me to give you a solid one side view on this. As someone who is no longer cis and identifies as agender after keeping sole stuff inside, the whole complex web of gender bullshit was kinda necesarry to find what was right for me and my self expression, but even I laugh looking at the sheer amount of stuff out there.",
            "title_similarity": "0.809546",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1b1azu",
            "score": 3,
            "text": "All I want to say is that I remember people making this argument 20 years ago…that things had improved and that it would be better if LGBTQ+ folks cooled it a bit because they were risking a backlash. Looking at the progress over the past 20 years, I think that argument was pretty clearly wrong then. One critical oversight is that people can handle a bit of discomfort without it becoming an oppositional spiral. I don’t see any reason to think it’s different now.\n\nSomething else to consider is that it can be simultaneously true that the most militant voices will turn people off and that those militant voices will still produce progress. If you hear someone advocating for something in a way you don’t like, you MIGHT decide you don’t support that thing…..but you might also be willing to concede some of the argument but condemn the way the argument is made. That can move the center of gravity on an issue.\n\nI find the whole argument about gender identity to sometimes be a bit too overwrought, to be perfectly honest. BUT…I also now accept that gender is a complex phenomenon in a way I didn’t 10 years ago. The diversity of ways in which that argument has been made has actually helped me figure out which parts annoy and which parts don’t and probably made me more open minded than I’d otherwise have been.",
            "title_similarity": "0.7652118",
            "sentiment_compound": 0.3319
        },
        {
            "id": "h1io025",
            "score": 2,
            "text": "This is basically the equivalent of white washing the rainbow.",
            "title_similarity": "0.24841039",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1og752",
            "score": 1,
            "text": "What a suprise! Who would have though the community of the degenerate would manage to harm their message and image? \n\nIn all seriousness, its not them using these labels, its mostly just cash companies wanting to diversify their audience by pandering to this community.",
            "title_similarity": "0.7352412",
            "sentiment_compound": -0.6114
        }
    ]
}