{
    "CMV: Actors should be allowed to play any role they want, without restrictions on race and ethnicity.\nThis has been bugging me since Alison Brie was forced to apologize for voicing Diane Nguyen, a Vietnamese Amercian character from BoJack Horseman.\n\nSimply put, I find the entire situation ridiculous. It is the nature of actors' job to play someone they are not! \"Cancelling\" performers for accepting a role when character's race, sexual orientation, ethnicity, religion, or other feature doesn't match that of the actor is just as absurd as, say, charging Claire Foy with lèse-majesté because she, a commoner, played Queen Elizabeth II. \n\nCan you explain the reasons for outrage and change my view?": [
        {
            "id": "h1uy58f",
            "score": 1,
            "text": "Hi /u/Two_Corinthians! You're not in trouble, don't worry. This is just a **Rules Reminder for All Users.** \n\n---\n\n**All users, (including mods, OP, and commenters) are required to follow the rules of this sub at all times.** If you see a user violate the rules of the sub, please report that comment/post and a human moderator will review it. We understand that some topics posted here may touch on sensitive or contentious issues. We ask that all users **remember the human** and **assume good faith**. \n\n**Notice to all users:**\n\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\n\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \n\n\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\n\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\n\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\n\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).\n\n[Deltabot Comment](https://www.reddit.com/r/changemyview/comments/nzucvp/cmv_actors_should_be_allowed_to_play_any_role/h1rkhm9/)",
            "title_similarity": "0.56135905",
            "sentiment_compound": 0.8371
        },
        {
            "id": "h1rhbrg",
            "score": -2,
            "text": "Simply put, look up the history of blackface.  White actors were hired to portray black people (often in grotesquely exaggerated stereotypes) because it was unthinkable to *hire* a black person.\n\nThere's a very dark history behind hiring white people to play minorities.  Ask yourself this: is there a good reason to hire someone who *isn't* Vietnamese to portray a Vietnamese character?  And then look again at the history of discrimination that minorities in the business have faced.\n\nHere's some reading on blackface:\n\n[https://en.wikipedia.org/wiki/Blackface](https://en.wikipedia.org/wiki/Blackface)\n\n[https://www.history.com/news/blackface-history-racism-origins](https://www.history.com/news/blackface-history-racism-origins)\n\nhttps://apnews.com/article/daaacc648c0e49b68fa42a15d6f26a05",
            "title_similarity": "0.73465884",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1rhlu0",
            "score": -1,
            "text": "You have to look at it from an historical perspective. Traditionally, roles of any race have gone to white people. This includes film, television, radio, theatre, modelling, and so on. POCs were limitted to token roles at best, and at worst \"exotic\" roles, clowns, or awful stereotypes.   \n  \nToday, we are moving towards a point where serious POC roles are commonplace in media, and yet we still have white people filling those roles.  Why? There is no shortage of talent amongst actors of all races.",
            "title_similarity": "0.56724614",
            "sentiment_compound": 0.0875
        },
        {
            "id": "h1rkhm9",
            "score": -2,
            "text": "/u/Two_Corinthians (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/nzuzi8/deltas_awarded_in_cmv_actors_should_be_allowed_to/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.46932903",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1rhmbq",
            "score": 14,
            "text": "The reason for the outrage is that it was important to the business of hollywood to have the known white actor on the playbill than to take the risk of using an asian actor, which is I think pretty clearly wrapped up in a long history of not including asian actors as candidates for roles.  \n\nIt's problematic out of the gate that the asian actor has less of a chance in hollywood, but then doubly problematic that they can't even secure a role playing someone with their own actual heritage.  It's a canary in the coal mine.\n\nI think it's totally reasonable reward businesses for making choices about how they operate that align to our values.  If you believe that Alison Brie - the multi-million dollar business - and the companies that  cast and budget films - should break the patterns that exist then why not do so with your dollar and share your opinion with others?",
            "title_similarity": "0.77225095",
            "sentiment_compound": 0.8263
        },
        {
            "id": "h1rjctt",
            "score": 46,
            "text": "Try thinking about the issue like this:\nWhite people make up 60% of the population, yet represent 88% of screen time on television. White people are vastly overrepresented on television. On the inverse, miniorites (with the exception of black americans) are very underrepresented. This leads to a case where if you are a white actor, you are left with an abundance of different roles to choose from. However what if you're a native American actor, a Filipino actor, the vietnamese actor? You have a veeeery limited pool of roles to choose from, much lower than actual if t.v roles were based on actual population diversity. So you go in with this disadvantage, and then proceed to see the one role written for your very undepresented demographic go to yet another white actor (who already has a much bigger pool of roles to choose from) To these actors (and an audience made up of a similar race ) this is adding insult to injury.",
            "title_similarity": "0.51826906",
            "sentiment_compound": -0.8735
        },
        {
            "id": "h1ru54s",
            "score": 6,
            "text": "For voice acting? Sure, go nuts. But when it's live action, race matters. Especially for historical roles.\n\nThere was recently a decision to have a black woman, Jodie Turner-Smith play the role of Anne Boleyn. For those unaware, Anne Boleyn was Queen of England from 1533 to 1536. She married King Henry VIII of England. This is a historical figure, a real person from English history, and she was white.\n\nThe argument that actors and actresses can play anyone falls apart when you look at this scenario. First of all, such a casting is an obvious historical inaccuracy that borders on disrespect. If you are representing a real person, you have a duty to be faithful to that person. Secondly, race-swapping only goes one way. Casting a white character as black is now normal, but no-one would dream of recasting a black character as white. When it's only men being replaced with women, and white people being replaced with black, then it's clear that it is not a case of choosing the best actor - it's a deliberate, malicious act; a conscious choice to put political activism into a creation.",
            "title_similarity": "0.75768",
            "sentiment_compound": 0.9468
        },
        {
            "id": "h1rlo30",
            "score": -1,
            "text": "They should but the disapproval of white actors playing roles of other races/sexualities etc is not the result of a belief that you can only play roles similar to yourself, it is the result of marginalised groups not getting opportunities.\n\nThe argument is 'why are you favouring race x over race y'. As equality improves you can expect this issue to become less important.",
            "title_similarity": "0.73537695",
            "sentiment_compound": 0.7707
        },
        {
            "id": "h1rqmjp",
            "score": -1,
            "text": "So I'm kind of curious as to what you think about what both Brie and the creator said in their apologies. To my understanding neither of them was \"cancelled.\" They're both still working and both still successful. Nobody lost their livelihood over this. All that happened was a persistent issue within entertainment, and in a very particular way in animation, was perpetuated by this show and the actor and creator involved recognized this and apologized for it. \n\nEach of them spoke to why people were upset. The entertainment industry has a penchant for not being a welcome place for POC and othe rmargianlzied identities. In live-action work it can come in the form of tokenizing characters who represent a marginalzied group by making them one-dimensional caricatures who only exist as a supporting role to a straight, white, cis protagonist. That's assuming that any representation occurs in the first place. \n\nAnother phenomenon is a production making the effort to create diverse characters but giving those roles to actors who don't actually hold the identity of said character. That's the case with Alison Brie, as well as situations like Eddie Redmayne playing a trans women in The Danish Girl or taking away Matoko Kusanagi's name to justify casting Scarlett Johansson playing her. At the end if the day, these kinds of casting decisions ensure that the most privileged and well-represented portions of the entertainment industry get to continue being well-represented while members of groups who have been constantly fighting for a chance to be represented are denied even when creators are seeking diversity.",
            "title_similarity": "0.6990509",
            "sentiment_compound": 0.9713
        },
        {
            "id": "h1roq0w",
            "score": 499,
            "text": "1., nobody cancelled Alison Brie. She is still a respected actor who is getting work. \n\n2., your point would make sense if actors of color were equally considered for all kinds of roles at the same rate white people are, but they’re not. While television and movies are more diverse than they’ve ever been, our go-to casting is still heavily white, and actors of color are regularly pigeonholed into certain, often smaller roles. So when a role comes up for someone who is specifically supposed to be a character of color, it feels particularly egregious for a white actor to get that role, too.",
            "title_similarity": "0.7064121",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1rl65c",
            "score": 168,
            "text": ">This has been bugging me since Alison Brie was forced to apologize for voicing Diane Nguyen, a Vietnamese Amercian character from BoJack Horseman.\n\nI'll start by saying that Diane Nguyen was not forced to apologize. She apologized on her own. No one made her.\n\nThe creator also apologized and said he agreed with the critique.\n\nYou may notice that Alison Brie isn't cancelled even the tiniest bit AND she continued playing the character for the rest of the show.\n\nLiterally nothing happened to her. She just chose to apologize. That's nothing. She's still rich, she's still famous, she's still got a great career, and people still praise her performance as that character.\n\nI mean, Bojack Horseman is widely considered (among critics) to be one of the best animated programs of all time and the creator has a semi-spinoff show running as we speak.\n\nNo one has been cancelled here.\n\nIn fact, anyone is allowed to play any race. It's not illegal. You can do it. People will tell you they don't like it, but you're allowed to do it.\n\nIf you want an explanation about why people get upset about this sort of thing, you can [read the creator of Bojack's explanation](https://twitter.com/RaphaelBW/status/1275677560618319874) since he agrees with the critique of his show.\n\nBasically, race plays a role in people's lives. His show cast a white actor as a Vietnamese character and had no Vietnamese writers.\n\nThat meant no one was on staff to give an authentic voice to the character.\n\nThe easiest way to ensure you're giving an accurate and non-stereotypical portrayal of a race is to have the actor match the race of the character. Another great way is to have writers who share that character's race.\n\nIf representation is important, then it should also be important to have that representation be as accurate as possible.\n\nRemember, this is something studios and shows are choosing to do because viewers want to see it.\n\nNo one is having any real consequences.\n\nI'd love it if you could point to some examples of real bad things happening to people because of this.\n\nFamous actors voluntarily stepping down from roles doesn't count unless they don't get roles in the future. Apologies don't count. Apologies do no harm. It's just words.\n\nHank Azaria is still doing great. Jenny Slate is still doing great. Alison Brie is still doing great.\n\nPeople still love The Simpsons. Bojack is a massive critical success. Big Mouth is still running and very popular. \n\nDo you have a single example of this ruining someone's career?\n\nPeople right now prefer that POC characters are portrayed by people who share the character's race. I don't see what's wrong with that. It opens jobs for POC. It ensures characters are portrayed accurately. It's had no negative effects that I can find.\n\nSo who cares? Just let them do it.",
            "title_similarity": "0.7370138",
            "sentiment_compound": 0.9972
        },
        {
            "id": "h1rhmey",
            "score": 1640,
            "text": "First of all, I agree that cancelling a voice actor who was simply hired by someone else for a role is ridiculous. Alison Brie might understand why they are rethinking the casting but she really should not have to apologize for it. \n\nI can try to explain why we are having this moment about voice actors though. Voice acting is a very tiny world. It happens when the best talent can sound different every time they work, why would you hire tons of different people when two people throwing their voices would be fine? As a result, the talent pool is small and rather white. \n\nHiring POC to take on POC roles is one really easy way to force equity in the business. Basically, if the world was perfect and POC were proportionally represented in the field, everyone should be able to play whatever roles their voices lend themselves too. But it’s not that way. Some people said “there are hardly any Asian/Black/Latino voice actors, and we can’t even get the roles away from the 50 available white people when the role *is an Asian/Black/Latino person*.”\n\nSo here we are.",
            "title_similarity": "0.84753895",
            "sentiment_compound": 0.9818
        },
        {
            "id": "h1rpfjd",
            "score": 3,
            "text": "So it's one thing to play a \"colorless/genderless role\" in my mind. Roles where you can replace any person with another person and it doesn't matter because race is not an important aspect of the character. \n\nHowever if you are playing a role of someone you have literally no connection to, it changes the entire dynamic of the role and it changes the entire message of the content. Let's say you replace the lead character in Get Out with a white guy, the entire meaning and content of the film changes. All of a sudden it is just another psychological horror film and it loses tons of meaning and depth. Which is why actors gender/race are not always interchangeable. \n\nOn top of that lets say if you hire a white person to play an obviously Asian character how do you make it clear that they are Asian? Do you tape their eyes back to make them look Asiany? Do you have them speak in broken English? The problem is you automatically start promoting racist stereotypes and your character automatically loses credibility. It then becomes about the stereotypes the character is portraying and the it is just a joke. \n\nYou literally cannot have a serious movie if you are talking about putting actors in black face or white face or asian face to play a role that they are not. \n\nDo I think an actor should be \"cancelled\" because they did a role like that. I think it depends. Is the role an ill-advised one or is it pointed insult. Is it like old timey blackface, where it was racists making fun of black people? Or did someone just not think through their decision very thoroughly? To me intent is more important than result. Tropic Thunder comes to mind. Robert Downey Junior was not playing a charicature of a black man. He was  a white man playing a charicature of a black man, so in the this case the joke is the person who thinks it is ok to do that and not the person he is playing. \n\nBut I think no matter what if you replace a racially specific character in a role specifically about race ie. Falcon and the Winter Soldier you automatically lose the meaning of the content and then if you out the white character in black face and make him talk black to fit the role you have automatically taken you serious content and made it at best a comedy if not just a joke.",
            "title_similarity": "0.80750144",
            "sentiment_compound": 0.8688
        },
        {
            "id": "h1rxqk3",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.21793246"
        },
        {
            "id": "h1sjajd",
            "score": 3,
            "text": "I don't think Alison is being cancelled for accepting the role. It's being criticized and there is a difference. Alison didn't do anything wrong beyond accepting a role that should have been cast to reflect the character's heritage.   \n\n\nCancelling was originally a means of a minority expressing that they weren't going to support certain things. I micro boycott as it were. It began in the late 70s/early 80s and was brought into the zeitgeist by New Jack City.   \n\n\nIt has since been corrupted by Fox News and the alt-right conservative press machine as a means outraging white people and keeping them in a state of frenzy as is the playbook for totalitarians trying to seize and or hold power. They claim that legitimate attempts to correct our racial past are wars on nostalgia. It's an extension of the war on Christmas. Completely meaningless and designed to enflame their base followers. It was brought into modern vernacular as cancel culture is an evil through Mr. Potato Head losing the pronouns and Dr. Suess declining to publish six books that didn't sell very well and had grossly racist themes and content. THEY THE RADICAL LEFT IS TRYING TO CANCEL DR. SUESS!!!! TRYING TO CANCEL MR. POTATO HEAD.....  \n\n\nWas Alison forced to apologize? No. Was it wise to do so, to shift the negative attention away from her Hollywood persona. Yes, so she chose to, and may also sincerely believe it in principle. She is in real life a very sweet and compassionate person, but she also has to work. So she took the gig, and it was good for her and the production. It wasn't good for all the out of work Asian actors that are not even considered for starring roles, who can't even read for supporting roles and are relegated to bit parts that fulfill stereotypes that can and are harmful to their fellow Asians.  \n\n\nThat's really where the criticism originates. It's an effort to communicate a desire and a demand for equity in media. Representation is good for everyone. It is nice, when you have a blonde hair, blue eyed kid who is 1/4 Asian and you're trying to keep alive your heritage to have people in media that represents them, let alone being able to see yourself or your spouse represented. Its good for people to see their co-workers represented etc.    \n\n\nSo I think of cancel culture as social justice through market forces. People who don't deserve to be cancelled inevitably survive it. Like Chris Pratt. He caught a lot of undeserved flack in the last few years and handled it with dignity and grace. There are those that absolutely do deserve to removed from the spotlight like Kevin Spacey.  Huge fan of his work and consider his cancellation a loss to the arts- but I've also witnessed his appetite first hand and wouldn't wish that on anyone.   \n\n\nIf the result of these loud voices that Asian actors get to portray more work and have equal access to roles that anyone could play- Ethan Hunt, Jason Bourne, James Bond then that's a good thing.",
            "title_similarity": "0.83063716",
            "sentiment_compound": 0.9908
        },
        {
            "id": "h1t0dvx",
            "score": 3,
            "text": "I can see your point, but no thank you. \n\nI don’t need Jennifer Lawrence voiced as Harriet Tubman or the further whitewashing of history. The powers at be spent the better half of the 20th century doing that shit. \n\nAsk Al Jolson and other black face minstrel and coon actors. Hiring a trained black actor just wasn’t it, so they’d voice and throw an under-qualified person, that looked like them, in paint and have him in blackface and have him “act and talk” black.  \n\nI’m sorry that this doesn’t bother you, but there is so much wrong with that viewpoint. I’d say changing your mind is pretty simple, given the history and context if you look around. \n\nSame in other mediums like gaming as well. \n\nWhether they are Indian, Chinese or any ethic minority, they have a right to be offended at being mocked. \n\nI can only speak from the AA experience, but there are lots or black, and other PoC, actors and voice actors that are just as qualified, that are looking for work and are overlooked and unemployed. I personally know dozens from my college days. \n\nPoC are traditionally severely underrepresented in these lanes. When people speak of privilege, this is what is meant. 9 times out of 10, it’s that mindset that will have an executive hire a guy from the suburbs, who can talk “black” based off a bs stereotype. Idc how “good” he is, it’s a mockery. \n\nI mean, why does a director, writing room and actor get to tell and narrate a story and experience that they know next to nothing about?\n\nThere’s a reason it brilliantly worked when [Kirk Lazarus](https://youtu.be/SDwj1Gn1fZc) did it in Tropic Thunder. It’s brilliant because it’s an actual reflection of Hollywood and what happens in real life. That’s why it worked so well. \n\nGood luck to you, my man.",
            "title_similarity": "0.78267205",
            "sentiment_compound": 0.9365
        },
        {
            "id": "h1rh54p",
            "score": 13,
            "text": "What if it’s for a movie or show that’s intended to be very historically accurate, and the producers believe an actor with similar ethnicity and possibly similar social experiences/heritages would be best to bring the character to life?",
            "title_similarity": "0.49056032",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1rh8pz",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.20510904"
        },
        {
            "id": "h1rnteh",
            "score": 4,
            "text": "Voice actors yes. You aren't seeing them so they don't have to portray the character\n\nNow live action. No, just hire the proper ethnicity for their character. No race bending needed.",
            "title_similarity": "0.6505892",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1rssu8",
            "score": 5,
            "text": "If it was inherently equal on all grounds, I would agree. However, you have characters of color who are frequently white-washed, on top of non racially specific characters which are overwhelmingly given to white actors. The cards are stacked against any actors who are not white.",
            "title_similarity": "0.61950314",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1rtcuh",
            "score": 0,
            "text": "I don’t think it’s about restricting people from certain roles, but more about raising those up who are often limited from those same roles.\n\nTrans people very rarely get hired to play trans people in film and media. I think of Eddie Redmayne playing Lili Elbe, one of the first trans women to receive bottom surgery in *The Danish Girl*. While Redmayne did a great job portraying her, there already is the disparity in the casting process that they could’ve used the movie as an opportunity to open it up to more trans women, and give a more authentic performance than Redmayne did. I think so anyways, as a trans woman.\n\nThis is true as well for other minorities, especially for characters who were written with race in mind. For example Miles Morales. He was written to be a mulatto spider man to give more colored representation to both Hispanic and Black people. They casted Shameik Moore as him in *Into The Spiderverse*, thankfully, but if they had casted a white person as Morales, it would’ve reduced the emotional impact of his character. It would’ve for me anyways, as a Hispanic person.\n\nEddie Redmayne definitely shouldn’t be cancelled for his portrayal, but he should be able to recognize that there was space for improvement in the movie that was made. Even if it would be better if it didn’t involve him.",
            "title_similarity": "0.76480514",
            "sentiment_compound": 0.9871
        },
        {
            "id": "h1ryc23",
            "score": 0,
            "text": "They already are. People who watch actors are also allowed to have whatever opinion about it they choose. It's great. Everyone has freedom.",
            "title_similarity": "0.40895733",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h1s10py",
            "score": 0,
            "text": "I thought the whole situation was ridiculous from day 1. I know why characters like Hank Azaria and Mike Henry choose to not play those characters anymore. Maybe they legitimately thought it  was a good idea, which I don’t agree with. On the other hand, it could have been a writing on the wall situation. Maybe they saw that if they did it early, people would hail them as progressive and support them, where if they waited to have rando’s complain, they’d be seen as villains and boycotted out of any other roles. These people are just working a job like anyone else, doing their best to make people laugh.\n\nI think it was Harry Shearer, who summed up my opinion best. I think he said something like how quitting the part because you aren’t the right skin color was silly, that if you wanted to present real opportunities, get POC into the writing room and give them opportunities to write the stories and characters they want. That the person with the best voice should voice the character.\n\nKind of how they had Tom Cruise play Jack Reacher, who is continuously described as 6’5” slab of muscle on muscle. The director was taking a lot of flack and finally said that he could have gotten an actor that physically looked more like the character, but he thought Tom brought him from page to screen.\n\nEspecially with voice acting this is true. H John Benjamin isn’t a model by any stretch of the imagination, he’s just a normal looking dude, but he has an amazing voice. I’d listen to him voice almost any character.\n\nSo I think having a problem with the portrayal of a character is a legit issue, but not having a problem with that color of the voice actors skin.\n\nI don’t agree with white washing characters like they did in Ghost in the Shell, either. That’s it’s own thing.\n\nSpecifically, though, I think this whole movement to replace a white voice actor with a voice actor who’s skin color matches the characters is utterly ridiculous. A good way to check ideas like this before you speak is to look at the flip side. Many people are supportive of replacing white actors voicing black(just as an example) characters with black voice actors. Tell me how it would sound to you if the shoe was on the other foot? What if a black guy voices a white character and he was told he had to give it up to a white actor? What you you think fans and people who never even saw the show would say then? I’m not advocating it either way. I think one is as stupid as the other. I’m just saying you need to look at both sides to see if what you’re saying is ridiculous or not.",
            "title_similarity": "0.8080637",
            "sentiment_compound": 0.983
        },
        {
            "id": "h1slndw",
            "score": 0,
            "text": "I disagree, if I have to sit through one more shitty movie or tv show with some gormless, white meat American trying to do an Irish accent, I'm going to lose my shit. \n\nTrying to pretend what they know the Irish story is when they havent lived it. When they dont know the history. I HATE the way Americans portray the irish, Irish history or Irish life. Because they are truly ignorant and smug about the life.\n\nThere is no one way to be irish, but Americans seem to always pick the wrong one. There are Irish actors, get them. Norman reedus fucking up a hack storm in \"boondock saints\" still haunts me.\n\nStory's about being Irish, where the irishness is essential to the plot and not just a random character background, need to be played by an Irish person. (Alan rickman as Eamon devalera gets a pass though.) \n\nStorys where being asian is essential to the story, part of the character need to be played by an appropriate asian person. Because people dont know if they're not of that story. \n\nGlenn in walking dead didnt have to be asian since his story wasn't about that. But the characters in crazy rich asians need to be asian because that's what the story is about.\n\nBut let's turn it around. How many Americans would flip their shit if they cast Rue Paul as George washington and Naomi Harris as Benjamin Franklin in a giant revolutionary war epic.",
            "title_similarity": "0.7900357",
            "sentiment_compound": -0.9775
        },
        {
            "id": "h1t5keu",
            "score": 0,
            "text": "I am here to also have my view changed. I think Drag Queens should be banned since they're specifically NOT women but dress as women and act like women. And if we let people who aren't women dress like women then it's clearly taking away jobs and wealth from actual women.\n\nOr something. I don't know. I agree with OP honestly, I think this whole bullshit about saying someone can only play a role they've actually already lived IRL is fucking ridiculous. What next, we're gonna do genetic testing on African actors to make sure they're representing the right national/tribal background? Gonna ask every Korean actor for a family tree if they want to play the part of a North Korean?",
            "title_similarity": "0.80524",
            "sentiment_compound": 0.8552
        },
        {
            "id": "h1u5pnn",
            "score": 0,
            "text": "This is so stupid i cant even .... How the hell is a black guy going to play a white guy and vice versa?\nIt just doesnt work. How the hell is a white guy going to play a role as an mexican gangbanger?? That would be like a racist parody wtf?\nYou people are off your meds",
            "title_similarity": "0.7070981",
            "sentiment_compound": -0.9585
        },
        {
            "id": "h1sh0qa",
            "score": 28,
            "text": "The point of this issue isn't to prevent actors from playing parts that don't match their gender or ethnicity: It's to combat the systematic exclusion of actors who aren't straight or white.\n\nUp until very recently there just weren't many acting parts in Western media available to non-white or LGBT actors, and most of the available parts were either demeaning or tokenizing their actors. Even today, there is still a bias towards white and straight actors at every level for any part that doesn't explicitly call for a person of color for the role.\n\nThe push for specific roles to go to actors who match their characters isn't a way to exclude white cishet actors, it's a push to include actors of other backgrounds who would've been otherwise excluded from acting overall.\n\nA related issue is the call for actors to share a certain identity with the character they're portraying if that identity is central to the character or the story, such as a black actor playing Nelson Mandela or MLK: In theory you could have an actor of any ethnicity playing him and just rely on the audience's suspension of disbelief (I'm not even going to entertain putting a white actor in blackface, given that practice's racist history), but the ethnicity and background is such a pivotal part of the character you're portraying that casting a black actor almost becomes a matter of basic decency and respect to the character as well as for their audience.",
            "title_similarity": "0.77635753",
            "sentiment_compound": 0.6688
        },
        {
            "id": "h1rooxh",
            "score": 5,
            "text": "I mean so long as they're qualified and fit the description of the role then that's fine. I mean if the role calls for an Indian woman with a south asian friend who is meant to be comedic relief, yeah find the right two people for that then to allow for the movie or play, etc, to be that much more believable. OP can you also agree that actors and actresses shouldn't be cancelled over political beliefs? What'd you think about the Disney Mandalorian actress who got fired about saying conservatives are fired for sharing their political beliefs, only for Disney to come right back and fire her for, well her political beliefs...I'm not saying people should or shouldn't left, right, center, it shouldn't matter, the question should be, are you a good actor/actress for the role?",
            "title_similarity": "0.7701205",
            "sentiment_compound": 0.9554
        },
        {
            "id": "h1rl3ae",
            "score": -1,
            "text": "It depends, but in terms of physical appearance, if a film maker rather have an established actor change their appearance so drastically as to allow them to play an character of a different sex or racial appearance, I think it speaks to a larger issue concerning how many actors of that ethnicity could have played that role.\n\nSo why not offer the actors those role? Surely there must be some actor of that ethnicity within the United States or some other highly diverse country that could play their role?\n\nI do see it as robbing people of being able to play parts that are more well suited to it with less effort, and having this be acceptable, regardless of reason, is simply discriminatory.\n\nIn Shakespeare's time, women were not allowed to act. Men picked up the parts of women, and this was symptomatic of and a contributor to the sexist practices of those times. Surely, we would not approve of this practice because we do live in a time where there are so many great female actors.\n\nDenying them an opportunity either on the basis of sex or the basis of their experience for a role that they could play very well is insane. You cannot have representation in a film and present it as a good thing, while simultaneously denying these actors major roles. It's hypocritical.",
            "title_similarity": "0.78976744",
            "sentiment_compound": 0.9897
        },
        {
            "id": "h1rwk8k",
            "score": 1,
            "text": "Somewhat agree, like let’s take animations for example; say if the character they’re playing or voicing has a story/role that is centered around mostly their race. The original voice actor of Cleveland from family guy/cleveland show is white, and that character (black) has a majority of his dialogue to be about something racial/cultural. So it’s a little off imo. \n\nSay that same guy/voice actor was playing a black character in another show but all that character was about was space travel and rockets, growing as a person, focusing on self, more on their own individualistic personality outside of cultural/racial themes then that seems fine to me. \n\nIt’s a big difference to be a white guy voicing a black character and your lines are usually like “Oh lawd, not the children! Mama! Why do they always treat our people this way?!” (family guy-esque), compared to “Quick get on the ship, everything’s going to blow!”\n\nEdit: I wouldn’t cancel or attack the voice actor for agreeing to the job, I would go after who hired them. I wouldn’t attack them either though just explain how it can be off putting to some. It’s situational. This discussion can go all the way back to talking about the ethics of when  blackface in media in the past.",
            "title_similarity": "0.5686803",
            "sentiment_compound": 0.801
        },
        {
            "id": "h1s73ns",
            "score": 1,
            "text": "I too can't wait for a movie about the civil war with Confederate General Stonewall Jackson played by Idris Elba",
            "title_similarity": "0.49988115",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1t6wh0",
            "score": 1,
            "text": "Hard disagree. You're saying it would be ok for Chris Pratt to play Martin Luther King Jr?\n\nOr tom cruise to play George Floyd in some theoretical movie?\n\nCome on, dude",
            "title_similarity": "0.54494697",
            "sentiment_compound": 0.5204
        },
        {
            "id": "h1ubxsv",
            "score": 1,
            "text": "I knew this thread would become weirdly anti white surprise surprise",
            "title_similarity": "0.5157757",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1rhq07",
            "score": 188,
            "text": "I know nothing and this Alison Brie issue, however, there are many instances when you want/need the actor to match the character they’re portraying. \n\nFor example, if you’re filming a movie that takes place in ancient China, having a black man play a role of a Chinese man would break the immersion. \n\nAlso, it would be incredibly insulting to have an Indian (from India) play a Native American. \n\nOr what about having white men playing Zulu tribesmen?",
            "title_similarity": "0.76097643",
            "sentiment_compound": 0.2748
        },
        {
            "id": "h1rlubs",
            "score": -2,
            "text": "The reason is because there arent very many characters of minority ethnicity written, and even fewer chosen for the roles. These roles are essentially taken from POC, making it just that much harder for representation in hollywood. Its not the law that they have to apologize, theyre not forced to do anything, theyre just making a good business decision by attempting to make up with the demographic theyve ultimately taken jobs from. There have ALWAYS been behaviors that celebrities have had to maintain in order to keep a good standing with their fanbase, including keeping their political views relatively median. You might recall Jane Fonda was black listed from hollywood for showing solidarity with vietnamese forces during the conflict there.",
            "title_similarity": "0.75935113",
            "sentiment_compound": 0.8215
        },
        {
            "id": "h1risjy",
            "score": 105,
            "text": "At one point in history, acting was purely a profession for men and so men played all of the roles. If you were a woman that wanted to be an actor, too bad, the role you wanted would go to a man even if the character is a woman.\n\nMost actors in the US are white and most characters are white too.  Many casting directors care, at least a little, about the race of the actors they're hiring.  So if you're a Vietnamese actress trying to break into the acting world, you're just not going to get hired for roles where they aren't looking for a Vietnamese actress.  This makes it hard to break into the field and make a career out of acting.  This causes a self-reinforcing pattern where the main people able to make careers out of acting are white, so all the best known actors tend to be white, and if you're hiring someone with a proven track record they'll also tend to be white.\n\nSo on the rare occasion that someone casts a role that calls for an underrepresented minority, its a bit offensive for some other well known actor not from that minority to take what could've been a great opportunity for a person from that minority to break in and help change the underrepresentation problem.",
            "title_similarity": "0.77323437",
            "sentiment_compound": 0.9089
        },
        {
            "id": "h1rvl47",
            "score": 63,
            "text": "A good example of why there is outrage is the movie \"21\" which was supposed to be about the MIT Blackjack team. In reality, the MIT Blackjack team was mostly Asian Americans, but somehow in the movie adaptation, most everyone suddenly became white. So even in real life stories where the real people are Asian Americans, they get casted as white people.\n\n&#x200B;\n\n[https://en.wikipedia.org/wiki/21\\_(2008\\_film)](https://en.wikipedia.org/wiki/21_(2008_film))",
            "title_similarity": "0.6288024",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1rm57r",
            "score": 3,
            "text": "In many situations, yes it's silly to be offended.  But I think there are definitely situations where it's ok to want more accuracy.  After all, a good film is one that feels real.\n\nFor example, if they made a new dramatized movie about the life of MLK, wouldn't it be weird to cast a white man to play the role of MLK?  I don't think there's anything wrong with seeking out a black man who looks as much like MLK as possible.\n\nSame would apply about a movie portraying Abraham Lincoln.",
            "title_similarity": "0.6860918",
            "sentiment_compound": 0.9328
        },
        {
            "id": "h1rnl5d",
            "score": 1,
            "text": "You see how they fucked up mileena in the mortal Kombat movie lol",
            "title_similarity": "0.55052936",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1rosnx",
            "score": 2,
            "text": "I think the most important thing for an actor or actress is believability. I think in the case of Alison Brie, since she is out of camera view for voice acting, it's ok. \n\nYou wouldn't cast a white man in the role of Martin Luther King jr. for a civil rights movie right? That's because race, though a human construct, still has meaning in a lot of our history and today in our modern life.",
            "title_similarity": "0.7325726",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h1rq0q9",
            "score": 2,
            "text": "Some actors just aren't fit for certain roles. Simple. Do you want a white person playing an established black character (especially a historic one)? Do you want a black person playing an established white character? Personally I find it disrespectful of the source material, or if it's historical, than history. Would you cast a fat and ugly person to play a beautiful characters? Or a beautiful person to portray an ugly one? No, same thing. Would you have a boy play a girl, etc.\n\nThe thing about the voice actor though was idiotic. Voice actors can obviously be whatever race, gender, or ethnicity without restriction as long as the voice is right.",
            "title_similarity": "0.7443926",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h1rr4d7",
            "score": 2,
            "text": "Recast Mona with the Rock voicing her; and recast Maui with Auli'i Cravalho’s voice.\n\n\nNuff said.",
            "title_similarity": "0.3870686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1rtlcn",
            "score": 1,
            "text": "One word: _Hamilton_",
            "title_similarity": "0.089369535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1rv7jn",
            "score": 1,
            "text": "Agreed.",
            "title_similarity": "-0.04608684",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1rx1dp",
            "score": 2,
            "text": "They are allowed to play whatever role they want but the twitter outrage community is also allowed to bitch and moan to no end over movies they weren’t even interested in seeing in the first place.",
            "title_similarity": "0.7875883",
            "sentiment_compound": -0.8735
        },
        {
            "id": "h1rx3zg",
            "score": 11,
            "text": "What about for history movies?  What about Gender, or size?\n\nIf there was a movie made about George and Martha Washington, people really should have no issue if Angelina Jolie is cast as George and Peter Dinklage is cast as Martha Washington?\n\nWhen you do that, are you not engaging in some bizarre alternate history?",
            "title_similarity": "0.67485124",
            "sentiment_compound": -0.7757
        },
        {
            "id": "h1rxxtg",
            "score": 1,
            "text": "They already can, the only real limit on it is commercial viability-if people will buy it. If people don't want to buy it because of the actor's race then how would we create a world in which it didn't matter?",
            "title_similarity": "0.72966635",
            "sentiment_compound": 0.2033
        },
        {
            "id": "h1ry3es",
            "score": 2,
            "text": "Well, I mostly agree. Actors shouldn't fit the role to all the details, or else it makes art too restrictive and not art anymore.\n\n Though I think, in movie adaptation of the books they shouldn't switch looks of the characters too randomly, unless there's some clear and interesting concept behind it. Movies should be interesting to the viewer, not just to the actor.\n\nBut in voice acting I couldn't care less, who the actor is, if I like the voice",
            "title_similarity": "0.8036179",
            "sentiment_compound": 0.6191
        },
        {
            "id": "h1ryrd0",
            "score": 1,
            "text": "they are allowed. but the producer is responsible for the fallout of a “bad” choice and money loss implications so that’s why it’s rare",
            "title_similarity": "0.5911476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1s04vm",
            "score": 1,
            "text": "&#x200B;\n\nCharacters, especially when they're from books, have character. They have an identity. If your character is a black woman it would be ridiculous for a white man to play it. And no, an actors jobs isn't to play someone they're not, it's to play a character. And if that character is white the actor should be white, if the character is Asian, the actor should be Asian etc.",
            "title_similarity": "0.7047283",
            "sentiment_compound": -0.4891
        },
        {
            "id": "h1s1zek",
            "score": 1,
            "text": "Cancelling someone over it is ridiculous.\n\nHowever, it is reasonable to cast an actor who is of the same ethnicity of the character. Voice acting provides a bit of leeway, as long as they can match the accent they’re good. But any live action stuff, u would want an actor of the same ethnicity of the character. \n\nJust like how u wouldn’t want a man acting as a woman or vice Versa, or how u wouldn’t want a young fit lad playing as an old homeless beaten down man",
            "title_similarity": "0.7889836",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h1s4ao0",
            "score": 1,
            "text": "What about in historical accurate period dramas, such as The Crown, where actors are meant to look like historical figures and the aim is to retell history through film? Imagine if the Queen of England was played by an a Japanese actress or Abraham Lincoln was played by an African American actor. The purpose of the movie/series couldn’t be achieved.",
            "title_similarity": "0.66885746",
            "sentiment_compound": 0.743
        },
        {
            "id": "h1s4fil",
            "score": 2,
            "text": "Well, look at it this way: why won't you hire or allow more diversity into the industry, instead of just making white (the majority/mainstream population) people play those diverse roles?\n\nI'm from India and despite being a country of majorly brown skin, we have an alarming fairness fetish. Very frequently, actors who are rather plain looking or dark skinned will not be given entry into Bollywood because they don't look good enough, but then film makers will go and caste fair actors to play dark skinned roles. Even now, we have fair actors using make up to appear dark and \"poor\". Why not just let dark skinned people play those roles? \n\nThe problem is that we penalise someone for their non-mainstream natural traits, but then monetise on those same traits by using the mainstream population.",
            "title_similarity": "0.76989913",
            "sentiment_compound": 0.8297
        },
        {
            "id": "h1s4yk7",
            "score": 1,
            "text": "I agree with you for voice acting. Casting directors shouldn’t even have to know the ethnicity of the person auditioning.\n\nBut for acting in movies or plays there is a visual component.  *Twelve Years a Slave* starring Tom Feldon would make it pretty much impossible to suspend disbelief. His appearance would be a constant distraction. Danny Glover as Winston Churchill in *The Crown* would be silly too.",
            "title_similarity": "0.82734525",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h1s5faz",
            "score": 1,
            "text": "It’s only bad when a characters race is changed from its origin.",
            "title_similarity": "0.5282484",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1s6mji",
            "score": 1,
            "text": "This really depends on cultural context. IIRC there was a bit of racial outcry when Memoirs of a Geisha was filmed because the lead was played by a Chinese actor and that didn’t go down well in Japan. However if we buy into this whole “own ethnicities” argument, Memoirs of a Geisha” would probably not be allowed to get published these days as it was written by a white personal. Sigh",
            "title_similarity": "0.7452409",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1s71v4",
            "score": 1,
            "text": "I agree with the content of your post, the justification of it. But I kind of disagree with your conclussion.\n\nFirst a clarification:\nI say 'kind of' because 'prohibiting' or 'cancelling' someone for playing a role only judging by their ethnicity seems like like overreacting... But I can understand 'getting frustrated' and 'feeling missrepresented'.\n\nNow to my point:\nI'm latino. Its frustrating to see how many movies have latino characters speaking spanish... But the actor speaks NO SPANISH whatsoever. And I think/feel three things:\n1. 'This breaks the flow of the movie so badly. I can 100% tell this guy is not hispanic. Such a bad interpretation!'.\n2. 'You want to spice up your show/movie with us and don't even invite one of us to the party? Come on!'.\nClarification: I don't mind north american characters speaking bad english. That's fine... They're just using our language. But if someone pretends to be US, that feels like impersonating. Like if some random guy went around claiming \"I'm TwoCorinthians, the guy that posts on r/CMV' you wouldn't like that, even though its only a reddit handle. Well, imagine that but instead of a random internet handle it's your personal, family or cultural identity. Just not nice.\n3. Many times the shows that do this are the most woke shows that are 'oh so inclusive'. And the hipocresy is just astounding. Which is plain frustrating.\n\nSo yes, let anyone play anyone. But if you really want to do things right, don't impersonate. Either change the story or get another actor.\n\nClarification: I say \"change the story\" but I've never experienced this. Many people don't like that either and maybe they are right. With these things, you don't know how they feel until they do and it hasn't happened to me, so take that statement with a grain of salt.\n\nAnyways. Here I'm hoping to change your mind from \"it's totally fine\" to \"ok, its fine but we can do better\".\n\nPS: only talked about race because I can't speak for other groups.",
            "title_similarity": "0.79044485",
            "sentiment_compound": 0.7737
        },
        {
            "id": "h1s76y9",
            "score": 1,
            "text": "They are",
            "title_similarity": "-0.0072072297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1s7m5e",
            "score": 1,
            "text": "I get where you're coming from, but [here is Marlo Thomas on Bonanza.](https://www.youtube.com/watch?v=aYJ8_qmwB5U)\n\nSo, no.\n\nThe problem is, when the people in power simply want to pave over people of certain, those people are simply erased and replaced.\n\nYou can't throw a dead cat in a casting office without hitting 12 different actors from various backgrounds, so don't pretend it isn't possible.",
            "title_similarity": "0.7604648",
            "sentiment_compound": 0.7248
        },
        {
            "id": "h1s7nhh",
            "score": 2,
            "text": "The problem from my (white male) perspective is the lack of minority representation in white/western/mainstream media. If you're going to have a minority character in your media I absolutely cannot understand how you can't find someone from that minority (I use this term VERY loosely). On the other side of that, last year they cast a black woman for the new live action Little Mermaid and there was an uproar. \n\nhttps://www.usatoday.com/story/entertainment/movies/2019/08/07/halle-bailey-opens-up-little-mermaid-casting-backlash/1941300001/",
            "title_similarity": "0.7186341",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h1s8ay6",
            "score": 1,
            "text": "NGL, Matthew McConaughey doing the \"I Have a Dream\" speech would be the shit.",
            "title_similarity": "0.5351076",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h1s8ca6",
            "score": 1,
            "text": "Like any job in the world, if you're qualified to do the job, then go for it. If you're a white man and can do a spot on Asian ascent, then why the heck not? Chances are only a small percentage of people will know it.",
            "title_similarity": "0.46701577",
            "sentiment_compound": 0.2283
        },
        {
            "id": "h1s8eig",
            "score": 1,
            "text": "Brad Pitt and leo dicaprio as smokey and craig from Friday",
            "title_similarity": "0.30467355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1s8ijv",
            "score": 2,
            "text": "Actors are a product, they have audiences from all sorts of different backgrounds and there are no laws restricting what they can do (involving parts they can take).  They could legally do blackface, so they are \"allowed\" to do anything.  \n\nThe fact that their audiences might disagree with some of their decisions and then might decide not to consume their product anymore is just the basics of a functioning society.  Society is just waking up to the idea that maybe every movie doesn't require a white savior, and a Native American maybe shouldn't be played by Johnny Depp.\n\nRobert Downey Jr successfully wore blackface in a movie without much blow-back, because it was making fun of the entertainment industry making bad casting decisions.\n\nThere are plenty of great action star Asian women, so there was no reason to put Scarlett Johansson in the part of one of the more famous anime characters.\n\nAre you saying nobody should have strong opinions on what they consider problematic behavior and be allowed to make personal choices as to whether or not they voice their opinion?",
            "title_similarity": "0.70841265",
            "sentiment_compound": 0.6792
        },
        {
            "id": "h1s8jil",
            "score": 1,
            "text": "It is not illegal, they certainly can play whomever they want.\n\nAre you saying people shouldn't have an opinion on that?\n\nOr people shouldn't talk about it online?",
            "title_similarity": "0.59471977",
            "sentiment_compound": 0.6057
        },
        {
            "id": "h1s8v5f",
            "score": 1,
            "text": "I was mainly talking about people that did apply but you do bring up good points. I think my main point is that quotas are very much wrong. Another point I think I was trying to make was to not push for race past their actual make up in the country so if lets say Canada is 80% white people then a compqny shpuld strive for 80% white people or as close as they can but race shouldnt be what their going by because if theres more than 80 percent by a lot then you have a problem and that goes for any race.",
            "title_similarity": "0.6370939",
            "sentiment_compound": -0.6448
        },
        {
            "id": "h1s98o2",
            "score": 2,
            "text": "I totally agree to your point, with a small small correction. Actors should be able to play any role *if the race of the character does not matter*.\n\nI feel like there are very little instances when race matters. Yasuke should never be played by anything other than a black male (he was the first and only black samurai). This is the only example that comes to mind. \n\n*even if there were no black people in medival  Europe, black people should be able to play those role because their race is irrelevant to their role* \n\nI am only referring to the situations where the race of the character is really the main pivot of the story.",
            "title_similarity": "0.68825155",
            "sentiment_compound": 0.708
        },
        {
            "id": "h1s9bx6",
            "score": 1,
            "text": "You need to replace your wording a bit...\n\n>\"Should be allowed\"\n\nThey are allowed. There's no law against it.\n\nWhat you're talking about is, \"It should be culturally acceptable for actors to play any role they want.\"\n\nAnd to that... It doesn't bother me. I'm not personally offended by much of anything. If something isn't my taste, then I don't have to consume it.\n\nThat being said, I also don't get to decide what other people are offended by. I'm not about to tell a majority of society to believe or not believe anything. If somebody wants to be offended by an actor playing a role, then if there's enough of those people they can affect the sales of that media to the point where those who profit off of the media care to make a change.",
            "title_similarity": "0.68608916",
            "sentiment_compound": 0.8582
        },
        {
            "id": "h1s9y68",
            "score": 1,
            "text": "I'll agree to it to some extent, unless it directly ties to the source material. I'm still butt hurt over the dark tower.... in the books the main character is a \"white\" guy, and a lot of the back and forth between him and another of the main 4 was racially driven (she's black, grew up around racists, and is racist herself).... so the fact that Idris Elba played him was off putting.... not to mention the rest of the movie sucked and McConaughey whistle voice ruined yhe man in black for me.",
            "title_similarity": "0.74025416",
            "sentiment_compound": -0.9201
        },
        {
            "id": "h1sadrz",
            "score": 2,
            "text": "Casting ethnically correct voice actors is a safety net to avoid bad representation. If you have a character from a specific background but no one from that background in production, it’s easier to use stereotypes, cliches, and generally bad writing. There is a lot of nuisance that a culture outsider would miss. Having a voice actor makes sure someone is more likely to provide accurate cultural representation. Now ethnicity is not the same as culture. This isn’t a silver bullet but it sets up guidelines that help avoid shitty writing especially if that background is fundamental to the character",
            "title_similarity": "0.7169138",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h1sai2a",
            "score": 1,
            "text": "I honestly think morgan freeman had it right when he said lets just stop talking about race. Its tough, though, considering we use words like white and black to describe all the billions of people who are all light tan to dark brown",
            "title_similarity": "0.6625133",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1sb14w",
            "score": 1,
            "text": "Voice Actors*",
            "title_similarity": "0.19608772",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1sbe08",
            "score": 5,
            "text": "Just to clarify, are you saying that it would be OK if in John Adams miniseries John Adams role was played by a Vietnamese person?",
            "title_similarity": "0.5540452",
            "sentiment_compound": 0.6523
        },
        {
            "id": "h1sbx78",
            "score": 1,
            "text": "I can agree with you to a point, but it seems like the whole \"colorblind\" approach just maintains a status quo. If we ignore the race/ethnicity of actors, that just reinforces the exclusion of minorities. I think there could be an improvement to how society voices disagreement or disappointment over this, but it's hard to be reasonable when those in power don't listen and don't care.",
            "title_similarity": "0.74625975",
            "sentiment_compound": -0.8687
        },
        {
            "id": "h1scu9e",
            "score": 1,
            "text": "ryan gosling as martin luther king jr",
            "title_similarity": "0.23940948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1sdu11",
            "score": 2,
            "text": "Just saying that BoJack is a very woke show where they constantly make fun and criticize the entertainment industry, so it's a little ironic that they'd hire a white actor to play a character that has an entire storyline and existential crisis about her family being vietnamese.",
            "title_similarity": "0.7998431",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h1sgs1n",
            "score": 1,
            "text": "I fully agree that voice actors, providing they can do the voice accurately (accents or w/e), should be able to voice absolutely whoever they want.\n\nBut actual actors, although I’d *generally* agree with your premise, do have constraints as to who they can play the roles of sometimes, and rightfully so imo.\n\nOften plays, TV shows, films, etc are set in either a historical setting, or a setting which is attempting to convey some sort of message. Many, for example, deal with themes of racism, and you can’t really demonstrate those themes if you don’t have actors of specific races playing the roles of specific characters in the script. \n\nLikewise, if you’re creating a historical show, or a fictional story set in a real time period (alternate history style stuff, for example), there are certain things you have to stay true to, too. Like the gender and race of monarchs, is one that would break immersion if changed around carelessly, for example.\n\nOften these themes don’t matter, but when you have a character with a precedent for ‘who they are’ - hell, even stuff like comic book super heroes, it would’ve been weird for a fan of the characters for Peter Parker to be black, or for King T’challa to be white - it does make sense to limit which actors can play which roles, because it could have an impact on both how the film portrays certain themes, as well as how people view the production.",
            "title_similarity": "0.80098945",
            "sentiment_compound": 0.9848
        },
        {
            "id": "h1sha3m",
            "score": 1,
            "text": "This is how you'd get Mark Wahlberg in \"The Michael Jordan\" story.",
            "title_similarity": "0.33411622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1shipc",
            "score": 1,
            "text": "I think the outrage stems more from those who get left out rather than those who actually got to do the job.\n\nThere’s also an economic factor to these decisions- those who voice things/act in things also go out to promote. Currently, with few exceptions, only a certain variety of ethnicities lead to sales globally. The purpose of the outrage, I think, is to make all ethnicities acceptable and marketable. \n\nIt’s not fair to the artists who are facing the often unjustified outrage but then most roads that lead to change are unfair…",
            "title_similarity": "0.70540303",
            "sentiment_compound": -0.4462
        },
        {
            "id": "h1simk5",
            "score": 1,
            "text": "In terms of VO work I agree. Unless maybe if the character requires a specific accent. But even then as long as it’s done accurately then what ever. If you have to do research to got offended by a cartoon maybe you should be putting your energy into something with a little more substance.",
            "title_similarity": "0.63469845",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1sj172",
            "score": 1,
            "text": "No. A bunch of white dudes remaking the Friday movies sounds so stupid",
            "title_similarity": "0.5892924",
            "sentiment_compound": -0.656
        },
        {
            "id": "h1sjkxs",
            "score": 1,
            "text": "I thinks as an actor of any color, unless you’re super famous, getting any kind of work is really hard, and most can’t be blamed for taking a role when one comes along.   \nHaving said that, ever since Hollywood started, POC have had very limited opportunities to get roles compare to white people. Traditionally, most non-white actors were hired when non-white roles were needed. And even then, a lot of ads for parts would read something like “Casting call open for latino looking male in late 40’s.”  The role could totally go to a white guy with dark hair and skin. But there are almost no roles that say “white looking male”.  You don’t see a light skinned black woman playing the role of a white woman.  \nSo when roles that are specifically written as a POC are cast with a white person, it can feel like a slap in the face to non-white actors who just had a possible role “stolen” from them.  \n  \nThat’s the feeling behind this kind of thing.  I don’t think it’s right to cancel the actor, though. This is largely on the producers and people behind the casting decisions.\n\nEdit: spelling",
            "title_similarity": "0.70381695",
            "sentiment_compound": 0.6433
        },
        {
            "id": "h1sjtis",
            "score": 1,
            "text": "Yes and No. In some instances it wouldn't make sense. Voice acting is different. I dont think that should matter-- it is literally just playing the voice. Hell, anyone can voice an ogre, a donkey a rabbit. It should not matter.",
            "title_similarity": "0.7132519",
            "sentiment_compound": -0.2672
        },
        {
            "id": "h1sjy3t",
            "score": 1,
            "text": "Tell that to Netflix when they advertise a white role in a novel only for PoC actors.",
            "title_similarity": "0.5410714",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1sk6yz",
            "score": 1,
            "text": "And now we have Jodie Turner-Smith As Anne Boleyn ",
            "title_similarity": "0.2859218",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1skbdd",
            "score": 1,
            "text": "You are totally right. That's what an actor does but let me offer a reason filmmakers tend to cast actors with an appropriate race....see, as a black woman, i always said I'd want Meryl Streep to play me if I ever got important enough to have a biopic but that was before Viola Davis came along. they are both great actresses and even though I am light skinned and  closer to Meryl's tone, I am undeniably black,there are some slight variations in the way I talk and move that if a white woman in America did them would come off as buffoonish and at it's worse blackface...I think the thing that started society's reservations about all this is partly because of America's past with blackface which is a shame because in Europe and Asia non blacks played blacks in theatrical roles all the time AND MEANT NO HARM (there was no Laurence fishburne around to play Othello during it's early productions just white guys) but because Americans used it as a way to demean people steer as far away as possible. For what it's worth, minstrel shows poked fun at every race and stereotype Asians and  Mexicans and racist white southerners got it hard too as the shows were northern productions",
            "title_similarity": "0.687628",
            "sentiment_compound": 0.792
        },
        {
            "id": "h1skfh0",
            "score": 1,
            "text": "If it's voice acting then I don't really care, but I understand the need for picking and choosing actors based on appearance, depending on what it is. If you are working your ass off to make a work of art, being precise is a must. Actors are more like the paint brushes rather than the painter, and you need certain brushes for certain things.",
            "title_similarity": "0.74012625",
            "sentiment_compound": 0.322
        },
        {
            "id": "h1sldqq",
            "score": 1,
            "text": "Context. \n\nIf there are race/gender swaps in all directions, cool. \n\nIf there is *one* race being routinely changed to another it feels and is racist.",
            "title_similarity": "0.6368903",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1slevs",
            "score": 1,
            "text": "Blazing Saddles' \"sheriff\" scene might not make sense though. . .",
            "title_similarity": "0.5633402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1slig1",
            "score": 1,
            "text": "I agree only for voice acting . The pool is too small to find the perfect voice and right color.",
            "title_similarity": "0.55088377",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1sm5d6",
            "score": 1,
            "text": "Should they be able to do blackface? like full on al jolson, shuck and jive 1920s stuff?  \n\n\nand no, i'm not talking they would be, like, PROHIBITED from doing blackface.  actors aren't prohibited from doing that now, legally.  i'm talking should society accept that and not criticize white actors for doing that.    \n\n\ni think if you say that that should be criticized, that's a social restriction on what actors should be doing.  that's not letting them do whatever role they want",
            "title_similarity": "0.7606397",
            "sentiment_compound": 0.7387
        },
        {
            "id": "h1smw5w",
            "score": 1,
            "text": "If your playing a white character you need to be white. Full stop. The only exception is voice actors, that doesn't matter",
            "title_similarity": "0.54208124",
            "sentiment_compound": -0.1215
        },
        {
            "id": "h1sn2uz",
            "score": 1,
            "text": "I heard there was uproar because the \"Adam\" character on the \"Mom\" TV show does not use a wheelchair in real life, but his character uses one on the show. I don't know for sure, but I often wonder if they chose the actor for the part and then decided to have him use a wheelchair because Allison Janney who plays \"Bonnie\" is 6 feet tall and he might be a little bit shorter. It has been difficult for tall women to be TV actors because Hollywood wants to portray men as taller than women. I have also read that people protest having straight people playing gay characters, but I never hear complaints about gay people playing straight characters such as Jim Parsons playing Sheldon Cooper on Big Bang Theory or Neil Patrick Harris playing Barney Stinson on HIMYM. Isn't it a 2-way street? I'm in favor of letting actors act the part they earn. I mean it's called \"acting\" for a reason, right? However, I would like to see Hollywood find a way to provide more acting jobs for minorities, LGTBQ, the disabled, etc.",
            "title_similarity": "0.69556844",
            "sentiment_compound": 0.9418
        },
        {
            "id": "h1snarb",
            "score": 1,
            "text": "I wouldn’t say in this case Allison was in the wrong. She’s a popular name trying to make a living. \n\nI will argue though that companies that have a POC character played by someone white is like companies throwing pride flags in June. They want the attention without the follow through. \n\nIn creating a show or production there are so many hands in these decisions (creators, producers, casting directors, marketing, etc.) Since there is no single person to blame it lands on the face (or voice) of the character, the actor.",
            "title_similarity": "0.7673014",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1snave",
            "score": 1,
            "text": "Leonardo DiCaprio as Django would have been an interesting choice.",
            "title_similarity": "0.40867347",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1snctv",
            "score": 1,
            "text": "I too look forward to watching Zendaya play Robert DeNiro's grandpa.",
            "title_similarity": "0.4320122",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1snmgc",
            "score": 1,
            "text": "ugly betty should get cancelled because she wasn't actually ugly!",
            "title_similarity": "0.69729364",
            "sentiment_compound": -0.4386
        },
        {
            "id": "h1snnth",
            "score": 1,
            "text": "yes; for ex. blackface may have had cruel intentions in the history of slave culture, but the manner in which they use blackface in tropic thunder is not intended to be cruel. thus we must remember that INTENT is everything. and you must definitely need to be able to differentiate cruel vs harmless intent. something might be harmless but may have cruel intent. its alllll about intent, literally everything in life is lol",
            "title_similarity": "0.6919044",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h1so5qp",
            "score": 1,
            "text": "Yeah let’s cast a white guy for a slave in 1800s America",
            "title_similarity": "0.33941415",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1sob7p",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20510904"
        },
        {
            "id": "h1soj19",
            "score": 1,
            "text": "I've thought that too, usually when people get upset because an actor \"isn't the right religion\" or doesn't look the way someone expects an ethnic group to look",
            "title_similarity": "0.75877106",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1sq52t",
            "score": 1,
            "text": "*As long as thier voice actors i don't care.*",
            "title_similarity": "0.5591898",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h1sra94",
            "score": 1,
            "text": ">This has been bugging me since Alison Brie was forced to apologize for voicing Diane Nguyen\n\nDid that fucking happen?  Sometimes I want to hang the whole human race and finish the farce.\n\n>Can you explain the reasons for outrage and change my view?  \n\nNo.  I cannot.",
            "title_similarity": "0.79598725",
            "sentiment_compound": -0.8253
        },
        {
            "id": "h1srsf8",
            "score": 1,
            "text": "It would be a little weird having whites playing the role of slaves in the South. Which is actually funny since there were white slaves.",
            "title_similarity": "0.5565758",
            "sentiment_compound": 0.5095
        },
        {
            "id": "h1srzoh",
            "score": 1,
            "text": "Let me talk about the Scarlet Johansson *Ghost in the Shell* movie.\n\nShe is a white actor playing an Asian woman in Japan. Literally white washing the character. I don’t think I need to explain that.\n\nThere is also an issue with the moral values between the original and the new one. Japan has a religion called Shinto, and in Shinto they believe everything has a soul. Im simplifying here but that is the gist. In the original movie the opening scene is the creation of The Major’s body, the vocals are an ancient Japanese marriage song. The marriage of the machine (the Shell) and the human (the ghost). Later, the major chases a rogue AI, and it turns out the AI is trying to escape its slavery and procreate, he does so by the Major and the AI merging. The essence of the Japanese *Ghost in the Shell* is that the AI and the Human are co-equal, weather the ghost that is occupying the Shell is artificial or natural makes no difference because they all have a soul.\n\nThe Western *Ghost in the Shell* is the exact opposite. Major had her body and identity taken to be a ghost in a Shell, her existence is basically an abomination. The meaning of the entire thing is that our actions define us but not our memories, but that essentially means nothing as memory is merely a record of past actions. The entire movie is devoid of any and all transhumanism. Frankly this basically won’t happen with strong Japanese voices at the helm.",
            "title_similarity": "0.6562965",
            "sentiment_compound": -0.8248
        },
        {
            "id": "h1ssudp",
            "score": 1,
            "text": "No one is being “forced” to do anything.  You’re acting like these things are laws or policies or otherwise something that anyone controls.  Some people on the internet complained about something and someone said sorry.   \n\nLike what do you actually want?  You want to stop billions of people from having their own opinions and/or the ability to share them publicly?   \n\nOr do you  just want to stop hearing about it?  Because there’s good news on that front: it’s super easy to ignore!  If you stop following and engaging with clickbait-driven culture wars horseshit it stops existing.  The only time I ever hear about any of these mindless scandals is from reactionary “conservatives” who heard about it from the bad faith propagandists they follow.  I would have gone my whole life having had no idea people complained about Alison Brie or that she apologized, if it wasn’t for you whining about it.  \n\nLike don’t you think it’ll be easier for you to just accept that people like to complain about stuff and you’ll never be able to control them?    What do you get out of caring about this?  In 20 years will you be glad you spent so much time being occupied by about these meaningless culture wars distractions?",
            "title_similarity": "0.7306256",
            "sentiment_compound": -0.4501
        },
        {
            "id": "h1st4sz",
            "score": 1,
            "text": "I think the reason people are concerned about this is due to misrepresentation and the diminishment out opportunity for already disenfranchised communities. In both older films and even more recent films (gods of Egypt, ghost in the shell, etc) whites portray characters of other races. I believe the concept of cross racial acting is mostly frowned upon due to minorities being portrayed  by whites as lazy, stupid, cowardly etc mostly in the pre-1960s periods. Although these forms of racial propaganda mostly came to a halt, the stigma of cross racial acting remains. I personally find it interesting how every time a POC plays a traditionally white character, their is almost always some kind of uproar. I find it interesting because whites have had the sole ownership of such iconic characters until only recently with only a few minority characters worth mentioning outside of the cartoon spectrum (Black Panther, Agent Jay (Men in Black), Mace Windu) in contrast. It's even harder to find prominent minority movie characters who arnt black. \n\nIn short, people want opportunity where it's already scarce. They dont want to feel misrepresented or that people dont think they're even good enough to play their own race.",
            "title_similarity": "0.7286813",
            "sentiment_compound": 0.722
        },
        {
            "id": "h1st5k5",
            "score": 1,
            "text": "There are some famously bad instances of Actors being allowed to play any role they want. e.g. Mickey Rooney in Breakfast at Tiffanys, John Wayne as Gengis Khan\n\nThere is no way that could happen today snd that is a good thing. \n\nWe obviously need to draw a line somewhere, and im good with erring on the side of caution",
            "title_similarity": "0.8218685",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1sugs4",
            "score": 1,
            "text": "I mean, of course you are right. Actors should be able choose any role they can be cast to. I can put a mop on my head and imitate my partner in a fake, nagging voice. I might say it’s just acting. She might say I’m sleeping on the couch.\n\nPut another way- beauty is in the eye of the beholder. And so is shittiness.",
            "title_similarity": "0.69920796",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1sugw7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20510904"
        },
        {
            "id": "h1suik7",
            "score": 1,
            "text": "And gender as well.",
            "title_similarity": "0.1460566",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1sv66y",
            "score": 1,
            "text": "You're right! Actors everywhere should stand up and make it about them!\n\nEdit: it",
            "title_similarity": "0.5464053",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1svy4d",
            "score": 1,
            "text": "Well, it depends what you are after. If you just care about the end product, sure, whoever plays whatever character doesn't matter in the slightest. At worst you will get some minor cultural/language things wrong but your audience is probably just as unfamiliar with those things so won't even notice.\n\nIf on the other hand you view this as a workplace diversity thing, then yes you should try and get people from different backgrounds to play characters from different backgrounds. And if you are feeling extra special, as per another user's comments somewhere, maybe even hire them for things that aren't just extensions of stereotypes. \n\nAs for the actors themselves, Alison Brie has enough money to live comfortably. If she actually cared about diversity or whatever, she never would have taken the role.",
            "title_similarity": "0.8005497",
            "sentiment_compound": 0.973
        },
        {
            "id": "h1swcuz",
            "score": 1,
            "text": "I think the voice acting thing is *very* dumb. If people can portray the voice, let them sing.\n\nAre we about to get on Nancy Cartwright for voicing a boy? She does the voice of Bart Simpson. Always has. No one can do it quite like her. Why would we suddenly say that's not okay because she lacks a male identity?",
            "title_similarity": "0.76245713",
            "sentiment_compound": -0.6157
        },
        {
            "id": "h1sx3cx",
            "score": 1,
            "text": "Horrors! Next thing you know, Cate Blanchett will play Bob Dylan!",
            "title_similarity": "0.45547223",
            "sentiment_compound": -0.4374
        },
        {
            "id": "h1sxd9c",
            "score": 1,
            "text": "THAT'S WHY THEY'RE CALLED \"ACTORS\" FFS. This is part of woke/cancel culture madness.",
            "title_similarity": "0.60493565",
            "sentiment_compound": -0.8143
        },
        {
            "id": "h1sxhn5",
            "score": 1,
            "text": "Bob’s Burgers has men doing women voices and everyone is okay with that.",
            "title_similarity": "0.41659275",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1sxv9d",
            "score": 1,
            "text": "I think that depends. On a lot of things. Is it supposed to be a historically accurate depiction, in which case, how well researched. Is it a canonical thing? Depends on your fanbase, you should always be respectful towards the people that made your thing a 'thing'. I'm not fond of forced representation, I always feel that if you are going to represent something, you should try to represent that actual thing. So if you want to represent minorities, you should represent their culture, not shoehorn them into different culture, when their own culture is equally vast and interesting and should be represented in itself.",
            "title_similarity": "0.6647186",
            "sentiment_compound": 0.8145
        },
        {
            "id": "h1sys39",
            "score": 5,
            "text": "The problem with this is there are stronger restrictions on actors of color than white actors. \n\nThere was a public outcry over Idris Elba playing [007](https://www.usatoday.com/story/life/2019/06/27/idris-elba-disheartened-bond-casting-backlash-because-color-my-skin/1591502001/)\n\nPOC aren't allowed to be [Starfire](https://www.vox.com/2018/7/27/17618954/teen-titans-starfire-racism-anna-diop)\n\n[In Star Wars](https://www.digitalspy.com/movies/a33912685/star-wars-john-boyega-racist-casting-backlash/)\n\nOr [citizens of Panem](https://marquee.blogs.cnn.com/2012/03/26/hunger-games-fans-tweet-displeasure-over-black-actors/)\n\nThat's the part of the conversation that tends to get left out. Without that context, seeing folks like Allison Brie apologize seems out of left field. The context is that POC actors are held back from roles far more often than white actors, and when roles that are designed to be characters of color, it's frustrating to see studios give those roles to white actors.\n\nYes there are angry twitter mobs on both sides, but the white twitter mobs scare studios much more than the POC ones.",
            "title_similarity": "0.8310591",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1sz9nw",
            "score": 1,
            "text": "Did anyone else see that Wesker in the next Resident Evil Series is gonna be played by Lance Reddick? Like really? Fantastic actor, but why the \"race\" swap? Makes no sense. Introduce new and interesting characters for POC's to play as, don't just swap a character's characteristics. It simply looks like pandering.",
            "title_similarity": "0.74196845",
            "sentiment_compound": 0.8701
        },
        {
            "id": "h1szinq",
            "score": 1,
            "text": "Also I don't get why a white person can't voice a black or Asian character etc. That's literally what make a voice actor good. If you need an Indian to do an Indians voice then what even is the point? Then anyone could do it, I don't think it would qualified as a skill.",
            "title_similarity": "0.66549635",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1szsts",
            "score": 1,
            "text": "I just want to know how Hank Azaria had to quit doing Apu but Bart Simpson is still voiced by a woman???",
            "title_similarity": "0.6336317",
            "sentiment_compound": 0.1754
        },
        {
            "id": "h1t0mne",
            "score": 1,
            "text": "I agree with you, an actor by definition is portraying someone they are not. An actors skill is judged by if they pulled off the job of acting the part convincingly, for the audience to believe the actor is the character they are playing.",
            "title_similarity": "0.7039517",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1t0o9f",
            "score": 1,
            "text": "Brad Pitt as Black Panther let’s go!!!!!!",
            "title_similarity": "0.50238085",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1t0qnf",
            "score": 1,
            "text": "Yeah in a perfect world, everybody should be able to play everybody BUT also everybody should be equal and THEYRE NOT\n\nI get so confused when people want to ignore all the inequality, and then complain when THEY get backlash.",
            "title_similarity": "0.7187771",
            "sentiment_compound": -0.7497
        },
        {
            "id": "h1t0ys5",
            "score": 1,
            "text": "Cause doing black face is wrong… that being said the movie white chicks is ok? So yeah there are double standards but that’s life",
            "title_similarity": "0.70013964",
            "sentiment_compound": 0.2342
        },
        {
            "id": "h1t1e7k",
            "score": 1,
            "text": "So if Hollywood makes a biopic about MLK and they cast Michael Cera in the role, that should be fine, right? Or maybe put Kevin Hart in the role for George Washington. Makes sense.",
            "title_similarity": "0.50426584",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1t1jyz",
            "score": 1,
            "text": "If you haven’t noticed, people only do that stuff so people will pat them on the back. They just want recognition on the internet. Welcome to Reddit.",
            "title_similarity": "0.56469214",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1t1vp4",
            "score": 1,
            "text": "Makes it more realistic.\n\nIf I were to make a film about Hitler, I'd cast a German actor to play Hitler, not an Indian actor, because it just doesn't make sense. It's not historically accurate.",
            "title_similarity": "0.72632325",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1t3m6w",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20510904"
        },
        {
            "id": "h1t4jgv",
            "score": 1,
            "text": "That’s strange. Diane Nguyen from BJ was a *cartoon* character. If it was live action then yeah it would be a bit strange... but it would be too if they had someone from Vietnam voicing a character who grew up in Boston... \n\nI understand it... but then actors are used interchangeably to play or voice English/Australian/New Zealander/South African roles when they are a) not from these countries and are typically American actors speaking painfully exaggeratedly (not to mention the dozens of localised English accents within England) and b) (especially the latter 3) - are actually nearly impossible accents to get remotely right as a foreigner... this is why an American or Englishman for example might live in Australia 50 years and still sound very distinctly from whichever country.",
            "title_similarity": "0.722826",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1t4xgm",
            "score": 1,
            "text": "Pick the actor that suits the role, simple as that.",
            "title_similarity": "0.337708",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1t58au",
            "score": 1,
            "text": "If the role they're playing already has a specific character built already, why change it? It would be weird having a black superman. Just make a new character with whatever race and go from there, changing the ethnicity is just virtue signaling.",
            "title_similarity": "0.6730447",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1t5gor",
            "score": 1,
            "text": "pppp",
            "title_similarity": "0.0378094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1t5hms",
            "score": 1,
            "text": "I saw a multi ethnic cast for A Christmas Carol in Chicago years ago.  Tiny Tim was black and his mother was Asian and I forget what the other actors were.  At first I was disappointed to see that cast but I forgot about it as the show went on.  It was an excellent show at the Goodman Theater.",
            "title_similarity": "0.5685715",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h1t5jqh",
            "score": 1,
            "text": "Voice acting isn't a huge deal with voice editing and whatnot but full on acting kinda is. This is especially true when setting has source material. Most people wouldn't be too happy if superman was all of a sudden Indian.",
            "title_similarity": "0.71170014",
            "sentiment_compound": -0.0871
        },
        {
            "id": "h1t6gg6",
            "score": 1,
            "text": "Trevor Noah does a pretty good job of voicing what the issue is in these videos:\n\n[https://www.youtube.com/watch?v=EwXWU6tC\\_Yo&](https://www.youtube.com/watch?v=EwXWU6tC_Yo&)\n\n[https://www.youtube.com/watch?v=adsnjzLVE7I](https://www.youtube.com/watch?v=adsnjzLVE7I)\n\nIn regards to the cancel culture side of things that is definitely some BS that I wouldn't be in agreement of.",
            "title_similarity": "0.48880354",
            "sentiment_compound": 0.7296
        },
        {
            "id": "h1t6grh",
            "score": 1,
            "text": "I am all for SAMUEL L JACKSON is JESUS.\nOr CHRISTIAN BALE is KOUNTE KINTE. \nhowever I don't know if they could be taken seriously as movies but I'd watch the fuck out of them",
            "title_similarity": "0.61348355",
            "sentiment_compound": -0.5766
        },
        {
            "id": "h1t6jut",
            "score": 1,
            "text": "\nCaveat \n\nFor purely fictional works it’s no big deal. But if it’s about an historical figure or event then you need some degree of accuracy.  \n\nIf Denzel shows up to play Bruce Lee in a biopic movie then my eyebrows will raised.",
            "title_similarity": "0.6428169",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1t7nmn",
            "score": 1,
            "text": ">Actors should be allowed to play any role they want, without restrictions on race and ethnicity.\n\nWell you're in luck because they already are.",
            "title_similarity": "0.5547148",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h1t81zm",
            "score": 1,
            "text": "Its ACTing. People shouldn’t have to apologize for playing a role. If anything the ones who should be held accountable should be the casting directors.",
            "title_similarity": "0.66931576",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1t88za",
            "score": 1,
            "text": "Wokeness eats ass.",
            "title_similarity": "0.269903",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1t8f6t",
            "score": 1,
            "text": "The way I see it is, unless the characters identity is ties to their ethnicity, I could care less who plays it. Want sherlock holmes to be played by a thaiwanese guy, go ahead, but there qre some characters whose ethnicity defines who they are, and are heavily used in their backgrounds.",
            "title_similarity": "0.69210494",
            "sentiment_compound": 0.5124
        },
        {
            "id": "h1t8fda",
            "score": 1,
            "text": "Only situation I can think of would be something like history. Would be weird to have a white guy play MLK for example.",
            "title_similarity": "0.57345545",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1t8t4j",
            "score": 1,
            "text": "For voice acting roles, sure, I understand. But for movie roles and roles where the actor will have to physically act, it just doesn't sit right with me. Like, if there was a movie made about George Washington, would you want him to be depicted as some black disabled dude? No, because it's not accurate. I'm all for diversity and stuff, but I also like accuracy",
            "title_similarity": "0.7741859",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h1t9kot",
            "score": 1,
            "text": "My main point to refute your view is that there are times when visual identity is important to the character and the story as a whole.\n\nIt's a bit difficult to have a movie about American slavery where the lead actor is a slave but is white, because the mistreatment that slaves endured was primarily because of their skin colour and that in turn was causing people to view them as less than human, or at least worth less than white humans.\n\nThe same for a Japanese family trying to get by in the USA when they had the internment camps, and adjusting to life after the war where they were still mistreated specifically for the the way look because it is associated with a specific origin.\n\nIt takes away from the immersion of the story and from some of the ability to really give meaning visually to what is happening and why. If someone is being shunned and mistreated for their racial attributes and you take that away, you have to change the story and give another reason for their being outcast.\n\nThat's what happens when you let any actor take that role. If you choose to push ahead despite the damage it does to the portrayal of the story, you really shouldn't be telling the story.",
            "title_similarity": "0.720619",
            "sentiment_compound": -0.2163
        },
        {
            "id": "h1tb7bb",
            "score": 1,
            "text": "Honestly, I could see how it's a problem for acting in movies and TV, but it shouldn't be a problem for voice actors. Yeah, the pool is small because there's already many talented people in the business. Allison didn't need to apologize. \nActing in film and tv though, I understand why a POC should play a POC. What I don't like is \"forced diversity\". Changing source material just so we can be more inclusive. It just irks me when someone creative vision is changed for other people's feelings.",
            "title_similarity": "0.7880554",
            "sentiment_compound": 0.9574
        },
        {
            "id": "h1tbd9x",
            "score": 1,
            "text": "That's been the case for a long time, and has generally led to mostly white actors playing almost all roles. My requiring that roles be played by their demographic, it opens more doors for marginalized populations.",
            "title_similarity": "0.4716641",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1tcch0",
            "score": 1,
            "text": "Jerry Seinfeld as the Black Panther would be a good argument here.",
            "title_similarity": "0.49718",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h1tcvhv",
            "score": 1,
            "text": "Imagine a movie where a black,jew,and gay plays Hitler",
            "title_similarity": "0.45092544",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1tdaj3",
            "score": 2,
            "text": "How does a black person play a white person? Exactly.",
            "title_similarity": "0.3630449",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1tdh1t",
            "score": 2,
            "text": "I agree. However I believe most of this stems from the history in acting and voice acting where almost all the roles were dominated by white actors. Any race or ethnicity would almost be played by a white actor/actress which leaves non whites with nothing much. Unless it was a character playing a racial stereotype and unless they had a white actor willing to do it they'd give it to the minority. We still see problems regarding this today like with the anime industry in the west. Notice how many Asian, Black, Brown VAs there are compared to White ones. Not many.",
            "title_similarity": "0.6117146",
            "sentiment_compound": 0.4445
        },
        {
            "id": "h1tdkio",
            "score": 1,
            "text": "Some roles have certain ethnicities of how they’re written and this is the reason why",
            "title_similarity": "0.39554584",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1tedge",
            "score": 1,
            "text": "For voice actors definately, but when it comes to live actors there's usually a degree of trying to match a role. Granted there are notable exceptions for people that just carry the soul of the character, like everyone remembers Samuel L Jackson as Nick Fury way more than boring white guy nick fury.",
            "title_similarity": "0.6666136",
            "sentiment_compound": -0.56
        },
        {
            "id": "h1tfyij",
            "score": 1,
            "text": "When you say \"allowed\", don't you actually mean you are against people having the right to voice their opinion on a casting?  What would you like the punishment for this violation to be?  \n\nNobody's \"allowed\" or not allowed to do what you're suggesting.  Alison Brie found it beneficial to apologize, just as some people found it beneficial for one reason or another to criticize.  Not being allowed doesn't come into the question at all, since there isn't a law against it.  If you're actually against the social pressures that some people express, then you'll have to make a case about why some people should be allowed to have an opinion and others aren't.",
            "title_similarity": "0.7544093",
            "sentiment_compound": -0.4515
        },
        {
            "id": "h1tg2q5",
            "score": 1,
            "text": "I would say for animated productions color of the VA should be irrealevant because unless you see the person theres no way of knowing the persons skin color. My hero Academia (anime) had the opposite problem with one character, Mirko someone on twitter said, \"black should sound black\" when the voice actress is black. \n\nFor live action though it would look really insensitive to have a person not match the color of the character  they're playing. Like if you want someone who looks native to the country then they should be that color. It would be strange to see someone pretend to be race they aren't. If race country of orgin isnt essential to the tale then it shouldn't matter the actors ethnicity.\n\nFor something thats meant to be historical/biography race would be essential. Because it would race-washing to use another ethnicity.",
            "title_similarity": "0.74662024",
            "sentiment_compound": -0.0431
        },
        {
            "id": "h1tgnpi",
            "score": 1,
            "text": "Tom Hanks stars in Marvels upcoming “Black Panther Wakanda Forever”",
            "title_similarity": "0.38941467",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1tgvlb",
            "score": 1,
            "text": "You are correct, but unfortunately people don't see it as art and performance anymore and instead only see acting as a job. Therefore in their eyes jobs are being taken away from minorities.",
            "title_similarity": "0.6972808",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1thbbh",
            "score": 1,
            "text": "I agree if one of the following is true:\n\n- It's voice acting\n\n- It's recorded in a country with low diversity so finding good actors won't be easy enough\n\n- It's very low budget\n\nIn case of voice acting, who cares about looks if the voice is fine. The other two - sometimes it's about availability. For example finding black actors for black roles in Poland is extremely hard because it's very homogenous country and finding good actors among them is as hard as multiplied by finding a good actor in a set of actors. If it's low budget - budget matters more. If there is no issue with budget of availability, then it should be as faithful to source material as possible.",
            "title_similarity": "0.67138356",
            "sentiment_compound": 0.8685
        },
        {
            "id": "h1thdum",
            "score": 1,
            "text": "It simply erases the literal voice behind a character. On screen acting should be obvious, but when it comes to voice acting, there are a lot of nuances with accents.\n\nIt might be cherry picking, yes. Some ethnicities you can’t really tell the voice apart.\n\nBut others, like black American vernacular, should be reserved for black actors. If you have any other actor doing a black voice, it’s racist, plain and simple.\n\nIf the intention of an Asian character is to have an “Asian” accent, me being Asian myself, would find it offensive for any other actor to mimic the “broken” English. It turns it into a joke when in reality, it’s how many Asians sound when speaking English. \n\nThere are plenty of actors out there that actually have the appropriate accents or can give the accents justice.\n\nIt doesn’t matter to me how “black” or “Asian” a white actor can sound, they end up just taking a job that shouldn’t have been theirs in the first place.\n\nUncle Iroh being the exception. RIP Mako.",
            "title_similarity": "0.77005005",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h1thv01",
            "score": 1,
            "text": "Agree with you whole heartedly. We can improve opportunities for all people instead if trying to force things or shoehorn x person into x role because they are the sam",
            "title_similarity": "0.5484097",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h1ti3vx",
            "score": 1,
            "text": "It's simple and it's the same reason white people should not appropriate other cultures. \n\nBeing non-white is a liability when non-white people attempt to gain equity in any way-jobs, promotions, education, housing, food security, economic security, property ownership, healthcare, small business loans. It is still something that is disrespected and discriminated against. Black people lose their jobs because of their hair. Are less likely to get hired because of their names. Our music, art, language, style and cuisines are often disrespected and deemed uneducated or classless. Our dispositions deemed angry, insubordinate, trashy, etc. BUT when white people do what we do- rap, sing, get braids, tan, etc. it is considered cool, cute, acceptable, harmless. Our characters are underwritten or secondary in scripts. We are often cast as criminals, poor, and crass. White people used to wear Black face when committing crimes like robbery. Karens call us dangerous and violent unprovoked.\n\nWe have less visibility and opportunity for acting roles AND we are given less support to tell our stories with our lived real perspective existing under these conditions. As a result, bigoted writing is approved and creates false and sometimes deadly stereotypes that further influence our safety and equity. So when any role for a person comes up for a specific marginalized group, it should go to someone who fits that culture, race, gender identity, sexual orientation etc. because it's ours. Plain and simple. Our story we fight very hard to tell. Even if our character is written by someone white, we suffered the right to interpret it and honor it and no one else.\n\nThere should also be more and better BIPOC,LGBTQ+, and/or women identifying roles. \n\nThis does not work in the reverse because white people are not marginalized. They hold the social power, being white is a statistical advantage in life, and they perpetuated a society through torture, rape, war, and resource hoarding, that overwhelmingly benefits them. So, they can give up space for other people to work, be that doing the voice of a white person or helping transition a white specific role into one of color.\n\nAnd any white actor or person who accepts one of these roles or specific jobs, is complicit in continued gaslighting and colonization of our identities. You don't get to patronize, mock, kill, undermine, incarcerate, and/or rape us to then get to be us, voice or whatever.",
            "title_similarity": "0.75872487",
            "sentiment_compound": -0.9819
        },
        {
            "id": "h1ti4d5",
            "score": 1,
            "text": "So I'm going to talk about the \"any role\" bit of this.\nI'll use Hamilton as an example cause it's pretty well known.\nOne of the reasons that Hamilton is the production that it is, was down to the casting directions for the show.\nThe only white person who CAN be cast is whomever plays King George. Every other cast member needs to be a POC.\nThe existence of shows and casting rules like this go a long way to ensuring that their are jobs for talents performers of colour, and to making sure that young people get to see shows that they could play in one day (along with all the other benefits of media representation).\n\nI totally agree that it isn't really the actor/ress's fault if they get cast for a role that was better suited (in terms of representation) to someone else. It's up to the people making casting choices.\n\nBut we should be really happy when we see a major production that insists on diverse casting options, and given the current state of the industry on this topic it's going to be important to be excited when we see productions with minimal whiteness in the casting, because those productions will give all of us the benefit of showcasing a bunch of talent that normally wouldn't get a shot.\n\nCasting choices, especially when they differ from the source material can have a profound impact on the work and how it is received.\nDoctor Strange was a great example of this, the Sorcerer Supreme is Tibetan in the comics, but Disney knew that casting the role that way would really piss of the Chinese Government, so they gave her a Celtic background, and gave the role to a white woman.\nI think that Tilda Swinton did a fantastic job of the role, but a lot of people were upset about that casting choice, cause we could have seen a new Asian female marital arts star get their big break instead, and it was done to appease an authoritative regime.\n\nIt's not something that is important in every character choice.\nBut a lot of the time it does matter, and the entertainment/art industry would be better if we had a bit more thought go into \"some\" casting choices.",
            "title_similarity": "0.66770434",
            "sentiment_compound": 0.9922
        },
        {
            "id": "h1ti61p",
            "score": 1,
            "text": "Agreed",
            "title_similarity": "-0.04707881",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1tjcte",
            "score": 1,
            "text": "I agree, we need more white people on blackface just like the good old days",
            "title_similarity": "0.36252692",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h1tjl8z",
            "score": 1,
            "text": "I love the show Big Mouth. Final episode of the last season, they replaced the white voice actor of a mixed (white mother, black father) character to a black one. I wasn't too terribly thrilled, because to me that meant they were saying \"a half black character is a black character, and cannot be white\" -- which sounds awfully similar to the [One-drop rule](https://en.wikipedia.org/wiki/One-drop_rule), \"racial purity\", and other hate speech drivel.  \nBut I put it aside and gave it a shot... only to be disappointed. The character went through a \"development arc\" to \"embrace her black roots\" and now comes off as a stereotypical black girl, which I feel should be more insulting.\n\nHowever, I don't think any of the replaced actors/actresses are \"cancelled\" as a result. Can you provide an example of a performer who was \"cancelled\" for taking such a role?",
            "title_similarity": "0.7072722",
            "sentiment_compound": -0.8868
        },
        {
            "id": "h1tjsx9",
            "score": 2,
            "text": "Diane Nguyen was basically a white character in yellow face. They even lampshade it with the family full of Boston accents. Tbh I didn’t care until she went to Vietnam. On a writing level, it doesn’t make sense.",
            "title_similarity": "0.65985346",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1tjym9",
            "score": 1,
            "text": "100 percent pathetic. So now we need killers to play killers in horror movies?  Woketivism is pathetic.",
            "title_similarity": "0.63391113",
            "sentiment_compound": -0.9601
        },
        {
            "id": "h1tkttm",
            "score": 2,
            "text": "Robert Downey Jr. has entered the chat.",
            "title_similarity": "0.17561588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1tl18u",
            "score": 1,
            "text": "They should have at least darkened up Jake Gyllenhaal for prince of Persia",
            "title_similarity": "0.49459207",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1tl870",
            "score": 1,
            "text": "It’s difficult to get right but the way I see it is no one should be canceled when it happens but there are wayyyyy more white characters than minority characters. The reason why I think it’s okay if a poc plays a white character is because there is not a lot of choices or opportunities for poc otherwise. When it’s a white character playing a poc it’s taking away one of the already limited opportunities for minority groups. It’s hard to get representation and in a ideal world people should be able to dress and play any role they want. But until poc have many more roles and have equal representation as the default that just won’t happen.",
            "title_similarity": "0.7134187",
            "sentiment_compound": 0.9382
        },
        {
            "id": "h1tlpsg",
            "score": 1,
            "text": "I can abide by this for voice actors, but not a for live action ones.\n\nThe second I see a black person playing show white or whatever, ima have an aneurism",
            "title_similarity": "0.7181668",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1tm5c7",
            "score": 1,
            "text": "Let‘s make a movie about racism and slavery and then only cast it with white people. So no. Sometimes to convey a story you look for a specific kind of actor/actress.",
            "title_similarity": "0.6813205",
            "sentiment_compound": -0.872
        },
        {
            "id": "h1tn1b7",
            "score": 1,
            "text": "It’s simply not appropriate at this time in history.  And it’s no mystery why. \n\nYes I agree actors of any race, gender etc “should” be able to play literally anyone.  One day I hope they can. \nBeing someone else for a while is literally the job we pay them for.  \n\nBut we are in generation that is also living with the mistakes of previous generations. \nRace still somehow precludes class and until that is fixed there is no equality. \nIn the mean time, as privileged people we can either forget and fail to see what’s happening around us because we don’t perceive any negative effects ourselves, start to think everything is cool because “I’m not like that” and go right ahead and cause some good old offence.   Then cry about it when we get called out. \nOr, we show our awareness for others. We at minimum respect the boundaries we are asked to and we remember that these are small sacrifices, compromises, signs of basic respect that make a huge difference.",
            "title_similarity": "0.80186254",
            "sentiment_compound": -0.3538
        },
        {
            "id": "h1tn4xj",
            "score": 1,
            "text": "I, for one, am dying to see a Verne Troyer biopic played by Dikembe Mutombo.",
            "title_similarity": "0.4894799",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1tnc88",
            "score": 1,
            "text": "Some of us want to watch TV and movies that are as historically accurate as possible.\n\nI’ve nothing against anyone of any race or colour but if these changes are forced on me I simply won’t watch and will stick to reading books.\n\nWhere race/colour isn’t important in a film then yes I agree it should be open to the best actor for the role regardless of race or background.",
            "title_similarity": "0.7536082",
            "sentiment_compound": 0.899
        },
        {
            "id": "h1tnede",
            "score": 1,
            "text": "Shame on the show runners of Bojack. I mean, they hired people to portray animals. WTF were they thinking.",
            "title_similarity": "0.6355883",
            "sentiment_compound": -0.824
        },
        {
            "id": "h1to2ig",
            "score": 1,
            "text": "So Danny divito can play the lead role in legally blonde 3???",
            "title_similarity": "0.3896727",
            "sentiment_compound": 0.5171
        },
        {
            "id": "h1tohcv",
            "score": 1,
            "text": "Sounds like what a white person would say.",
            "title_similarity": "0.11293037",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1tojqo",
            "score": 1,
            "text": "As long as it's the native accent of the character I'm good, I'm tired of Americans incapable of doing a proper Irish or Scottish accent.",
            "title_similarity": "0.67648804",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1toogn",
            "score": 1,
            "text": "Right. Also let the children play adults and vice versa.",
            "title_similarity": "0.3006516",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1tornf",
            "score": 1,
            "text": "https://en.wikipedia.org/wiki/The\\_Problem\\_with\\_Apu",
            "title_similarity": "0.25691015",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1tpgsh",
            "score": 1,
            "text": "Yeah - I think actors should be allowed to act. Although there's a fairly serious issue with POCs being massively underrepresented in the fim industry (improving slightly just recently). That's more a reflection of western society as it is right now.\n\nThere's also a history of other cultures and races being systematically mocked/dehumanised which makes it hard to stomach anything approaching an actor pretending to be someone of a different race. \n\nIn an ideal world, we wouldn't have had a huge racist hangover and hopefully one day, we will. When that happens, I'm sure no one will care who voiced what.",
            "title_similarity": "0.8049232",
            "sentiment_compound": 0.886
        },
        {
            "id": "h1tqh3q",
            "score": 1,
            "text": "Christopher Judge was fantastic as Kratos.",
            "title_similarity": "0.25802743",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1tqxk8",
            "score": 1,
            "text": "Cancel Tom Kenny for not being a sponge living in a pineapple under the sea",
            "title_similarity": "0.49238607",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1tqxyt",
            "score": 1,
            "text": "Ummm im not gonna say u sound like you support actors doing blackface stuff...\n\nBut you might want to clarify that u mean voice actors.\n\nHave a lovely Day.",
            "title_similarity": "0.6216277",
            "sentiment_compound": 0.85
        },
        {
            "id": "h1tr3yn",
            "score": 1,
            "text": "They come across as stupid as the people that were being whiny bitches about the rumour Idris Elba might play James Bond. They're actors ffs.",
            "title_similarity": "0.7777568",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h1trgx3",
            "score": 1,
            "text": "Can't wait to see Kevin Bacon in the lead role in the next Martin Luther King biopic.",
            "title_similarity": "0.4253578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ts2s0",
            "score": 1,
            "text": "I’m not sure where I stand on this. There was recently a UK show where one of Henry VIII wifes, Anne Boleyn was played, brilliantly, by a black actress. After the first five minutes, it just didn’t matter, as she did such a great job.\n\nHowever, when I watch and old western, where the native Americans are played by clearly white actors, or where a film where East Asian or South Asian people are played by white actors — It’s either laughable or uncomfortable.\n\nIt should cut both ways, but I clearly have double standards on this.",
            "title_similarity": "0.73378277",
            "sentiment_compound": 0.8711
        },
        {
            "id": "h1tshi8",
            "score": 2,
            "text": "Race and ethnicity are as relevant as sex and age when it comes to acting, as actors do not really *act* so much as they *portray* various characters, real or fictional.\n\nYour example is absurd of course, but there are valid examples too. Like how in the upcoming (Soon™) Halo TV series they are casting Danny Sapani as Captain Jacob Keys, a white dude who is completely dissimilar from him. Aside from casting a woman they could not have fucked up more and the series is going to suck more because of it.",
            "title_similarity": "0.79450727",
            "sentiment_compound": 0.6339
        },
        {
            "id": "h1tt23q",
            "score": 2,
            "text": "I think there is some cases where maybe the experience of the character is a uniquely African American one, then they hire a white guy to voice it. Like surely you could find a talented African American voice actor to voice the role and give it some depth because perhaps they have also dealt with the same experience. I get that for some roles, it's not the voice actor's fault - they got hired for a job. \n\nOnce there is parity across the board in terms of representation for actors, then yeah you can make the argument that an actor can play any role they want - but we don't really have that the now.",
            "title_similarity": "0.6212066",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1tt9po",
            "score": 1,
            "text": "Just as African historical films should only include PoC as actors, European medieval historical films should only include Caucasian actors. Imagine the outrage if an African king was played by an actor of any other race, but we can racebend any European historical figure, pathetic.",
            "title_similarity": "0.6818727",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h1ttalu",
            "score": 1,
            "text": "With Diane Nguyen, the racist part is that someone could think the voice of a Californian should sound somehow different because of her ethnic background.",
            "title_similarity": "0.6798261",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h1tu0vz",
            "score": 1,
            "text": "I think Steven Universe is the good example of a diverse range of voices adding to the story, worldbuilding emotional integrity of characters. If you just have a couple of white dudes you honestly dont even know what you could be missing out on.",
            "title_similarity": "0.54158425",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h1tu4pr",
            "score": 1,
            "text": "I think we shouldn’t care when it comes to voice actors as long as the voice fits the character, but you can’t have a black guy playing Queen Elizabeth in a biopic.",
            "title_similarity": "0.7428287",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1tuk1k",
            "score": 1,
            "text": "If it serves the final purpose, why not? Especially for voiceover, if a non-vietnamese is able to sound like a vietnamese and make it real, i wouldn't complain, it would be instead a big skill and have to compliment as actors fundamentally are \"lying\" to make fictional things credible to the viewers, It's like an unexplained magic trick, you just enjoy it. As someone other mentioned, in the past, women were unallowed to do actress therefore most of feminine role were played by men with feminine looks and tons of makeup, so the purpose given the conditions is fine. But most of the times, these things are done for other reasons, like using black people for characters that were originally white (for inclusivity or diversity, eg. Black Hermione in theater version of Harry Potter,  black human torch in fantastic four) and white people for roles like other ethnicity (eg.scarlet in ghost in shell), it's visually inconsistent to me.. like, of all the people in the World who could do a role like second nature (like Robert Downey jr. As Tony Stark) without affecting the final result (of consistency), why would a change of ethnicity of a character impact it (if not to create some drama/scandal/publicity around it)?",
            "title_similarity": "0.8321222",
            "sentiment_compound": 0.9731
        },
        {
            "id": "h1tuvmi",
            "score": 1,
            "text": "Disagree, OP. Actors should be allowed to play any role the *director* wants, without restrictions on race and ethnicity. Actors shouldn't be able to just demand roles, but should be cast based on the best actor who applies for the role. ;)\n\nA good example of what you are talking about, OP, is the movie \"Rub & Tug\". Scarlett Johansen was set to play FtM real life trans person \"Dante 'Tex' Gill\", but after backlash over the idea of an actor acting, she was shelved from the idea of playing the role. It seems the production were relying on her star power to make people give a damn about a fairly obscure IRL person, because all that has happened now is the entire film is canned. If your concern is to have the trans experience portrayed on screen, surely you wouldn't care if it was played by a glove puppet, as long as people get to see it, and the person is portrayed with authenticity and heart? Now, that \"representation\" just won't be seen at all, such is the nature of business.\n\nI've seen films with talking dogs and sentient toasters. Are people nowadays so lacking in imagination that these films could no longer be made?",
            "title_similarity": "0.8519158",
            "sentiment_compound": 0.9693
        },
        {
            "id": "h1tuzmu",
            "score": 1,
            "text": "I agree with this, but would ad a few restrictiona to that. Like historical figures should be casted in the right gender ans ethnicity IF the filmmakers goes for realism/historical \"accuracy\"\nWasnt a problem in Bridgeton tbh cause nothing there waa historical accurate or ment to be... A non white queen elisabth I in a Tudor hystorical docomamation or something similar that tries to go mlstly for a accurate picture of the time, would be strange to me. \nAlso book adaptions, IF the author described the person in a specific way.",
            "title_similarity": "0.7545253",
            "sentiment_compound": 0.6895
        },
        {
            "id": "h1tv31v",
            "score": 1,
            "text": "Depends on the role. It’s stupid for a black woman to play Anne Boleyn just like it would be stupid for a white guy to play MLK.",
            "title_similarity": "0.7332166",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1tvrhh",
            "score": 1,
            "text": "I think when movies are cast in a certain time frame of history it is disingenuous to cast a poc in a role that they clearly don’t fit into for the sake of diversity. Will Smith in Wild Wild West comes to mind right away, poc were treated so poorly at the time that the role was not believable. Will Smith was hot at the time and everything he touched turned to gold but the casting was one of the first times I felt that diversity came before common sense.",
            "title_similarity": "0.8156386",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h1tw4l4",
            "score": 1,
            "text": "Morgan Freeman played Red is Shawshank. Red was Irish in the book, but who gives a shit he is an actor and he was amazing in the movie.",
            "title_similarity": "0.56886196",
            "sentiment_compound": 0.431
        },
        {
            "id": "h1twkvt",
            "score": 1,
            "text": "Just lemme say this: John Wayne as Genghis Khan was pretty stupid.",
            "title_similarity": "0.64375657",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1twsuf",
            "score": 1,
            "text": "We've had these discussions recently in Britain.  I definitely think fictional roles be open to all backgrounds, colours.  Would there be a difference between fictional and historical roles? Jodie Turner-Smith is portraying Anne Boleyn at the moment.",
            "title_similarity": "0.57663447",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1twzkd",
            "score": 1,
            "text": "Are you just as mad at the voice actors(that are adults) doing the voices for children in cartoons as well\n\n Just look at the Simpson's ALL those children characters in that show, all voiced by a few adults, why aren't they hiring children to voice the roles of children",
            "title_similarity": "0.67003703",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1tx4l9",
            "score": 1,
            "text": "That’s super specific, and again it sounds like whoever made this post is a member of the dominant society, which would make sense.\n\nThere should be restrictions, if it’s about historically accuracy, or if people who fit the description are available, if I was doing a film based on the Vikings, I’m not casting Indians to play them. Cause they deserve to be accurately played and allotted their history. \n\nThe issue is that for a long time people who fit those roles were not casted based on race. Ie blackface instead of just casting black people. \n\nImagery is powerful, and images stick with peoples. However if the role is a fictional film where the origin isn’t essential to the plot then I agree, for example, lord of the rings could’ve been all Mexicans, because it wasn’t set in a specific place on earth, it was a made up place, with made up characters. \n\nAs for voice acting, it’s picky, I think some people are just upset with the fact that they can’t get into the business, or they can’t represent themselves and that’s a close but separate issue. \n\nI think you should look into the history of, how nearly all characters were played by white people in America, then when they let black actors, they casted them as lazy or just to add comedic puns. With Asians, it was similar, they were casted as uptight and quirky.",
            "title_similarity": "0.73313177",
            "sentiment_compound": 0.8381
        },
        {
            "id": "h1txubl",
            "score": 1,
            "text": "So if I as I director want to make a movie about slavery in USA I should allow a Chinese actor to play a slave role because of woke ideas?",
            "title_similarity": "0.6248468",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1txwkq",
            "score": 1,
            "text": "Don't change your opinion. Its all rediculous",
            "title_similarity": "0.3884272",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1tygh9",
            "score": 1,
            "text": "Do you feel the same for live action casting - would you cast someone who isn't Black to play Mandela, for instance? Where characters have a defined race - whether based on actual people or important for social/cultural reasons - then it's offensive to have an actor of a different race playing that character. What would your motivation be laziness or unwillingness to hire actors from a certain race? Neither look good.\nWith regards to other 'characteristics' such as gender, sexual orientation etc, this has to work both ways. For example, don't have only cis people playing trans characters but also refuse to cast trans characters in other roles. If there's no discrimination either way then you've more ground to stand on, but in general we still have more prominent cishet white actors of certain body types, and letting these actors play roles where the characters belong to minorities who are underemployed in the field is just gatekeeping acting as a profession, which is discriminatory.\nAlso, consider what the actor can bring behind the camera as well as in front of it. Are you an all-cis team creating a show about trans characters but only hiring cis actors, for example? Who is going to tell you that what you're trying to do is inaccurate or offensive if no one there understands what it would actually be like to be those characters? (Though also note, even if you hired an all-trans cast, asking them to make sure it isn't offensive and is accurate is work which they should be formally requested to do and duly compensated for, not something you'd be automatically entitled to.)",
            "title_similarity": "0.7791321",
            "sentiment_compound": 0.9377
        },
        {
            "id": "h1tz1k0",
            "score": 1,
            "text": "For voice actors, I would say there's really not a situation where a person's ethnicity, sexual orientation or anything like that matters. I think the voice actors should be chosen based on whether their voice fits what the character they're going to voice is supposed to sound like according to whoever came up with the character in the first place. \n\nFor movies/series I would say stuff like sexual orientation, religion and that kinda non visible stuff doesn't matter at all, in any situation. When it comes to visible features they might or might not matter depending on the specific movie. For some movie characters, things such as their race, their hair colour or any other random thing about their looks might be important for the story in some way. Maybe it's just important because the person who came up with the whole thing has a specific idea about it, maybe it's an adaptation of something else like a book or a play and the \"original\" character had some specific features that make them into who they are, and I would say in those cases it's better to find a \"matching\" actor to play the role, meaning an actor who either has these needed features themselves or can get them with the help of makeup or wigs or even through video editing. \n\nOtherwise, if a character's features don't directly matter to the story and don't affect or alter it in any way (which is the case for a lot of characters in a lot of movies and series), I would agree with you, none of those things really matter and anyone could play any character as long as they \"fit\" the role according to whoever is making the movie/series.",
            "title_similarity": "0.746191",
            "sentiment_compound": 0.9817
        },
        {
            "id": "h1tzavu",
            "score": 1,
            "text": "Samurai jack is fucking racist. Period. An Asian male voiced by a black male? Not in my cookie cutter world.",
            "title_similarity": "0.6121348",
            "sentiment_compound": -0.6478
        },
        {
            "id": "h1tzdji",
            "score": 1,
            "text": "So these people are saying minority actors are so untalented they need special treatment or else a more talented white person will always get the role.\n\nSo empowering 😍",
            "title_similarity": "0.71347046",
            "sentiment_compound": 0.8615
        },
        {
            "id": "h1tzqra",
            "score": 1,
            "text": "Forced equality. Yay, that will end well",
            "title_similarity": "0.3101046",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1tzu9q",
            "score": 2,
            "text": "Spoke about this on another post a couple of days ago\n\nI think it depends heavily on circumstance as to when it does and doesn't matter. When it comes to voices, and only voice acting, I feel its a different matter however. People can be one race and sound like a completely different races' following stereotypes. In this regard? No issue with anyone playing any role as its only a voice.\n\nIn regards to physical acting I am very on the fence with this. When characters are written, typically you'd hope characters aren't no more than token black man or token minority group simply for pandering sake, and as such, you'd expect their character to be subtly reflective of the culture, upbringing, and backstory (not to be mistaken with making it front and centre, but concious awareness is important I feel when developing characters as you must be aware of alternative motivations than simply current stimuli in whatever setting is going on) when an existing character or property is then adapted, yet already clearly stated as one race or one gender, changing this a. Is a dick move because just slapping a minority over the top of an existing character is just shoe-horning them in and not creating new interesting characters for said representation, but also b. Fundamentally changing the character. I feel there are some ambiguous characters that can be replaced easily, but switching them in and out for other races often times causes blatant changes to the character themselved, for otherwise certain aspects may just not make sense.\n\nAn example of an ambiguous character imo would be say the Doctor from Dr. Who where it can be any gender, any race. Alternatively, take someone like James bond, he's a semi ambiguous character. I feel you can change the race (though some disagree) however, changing the gender would destroy who the character itself is and just be pandering rather than respecting the property in itself. A character I would struggle seeing as anothet race or gender would be a representation of say the Queen of England. Changing that up would just be weird - especially if you are looking at the Royal family in some historical period piece - adding that context also matters in these situations. Another example would be characters in the black panther movie, it wouldn't be remotely as good if you just slapped some generic white people in there, as context matters to the story you're telling - the characters were written to be black, hiring a random white guy isn't gonna seem right given their background, culture, and setting. \n\nI'm very on the fence as I like the idea of people not caring about race or gender in general, but I don't think thats as easy to do unless starting with a new character. Preexisting ones are established and written for what they are the majority of the time.",
            "title_similarity": "0.81573236",
            "sentiment_compound": 0.8674
        },
        {
            "id": "h1u01iv",
            "score": 1,
            "text": "Well, she's certainly still allowed (no one is arrested over it), so your title is kinda moot. There's no law/regulation against casting a person in a role not inline with their race/ethnicity, and the director/producers of Bojack were not arrested for casting Brie on that role. However, just as they're free to do the casting, people are also free to **like** or **not like** the show as a result of the casting. You can't force people to like/support/agree with your opinion either, and I think the **cancel** movement is just that: people showing that they do not like/support a certain thing/product because of the political stance/situation behind that thing/product.",
            "title_similarity": "0.6682024",
            "sentiment_compound": 0.7346
        },
        {
            "id": "h1u041y",
            "score": 1,
            "text": "if you're voice acting thats different, how would you feel if Domhnall Gleeson played black panther in the next live action movie? it would be cringe and horrible but it is fiction so why not? what about Domhnall Gleeson as Shaka Zulu? now that would be historically inaccurate but should actors be allowed to play any role they want without restrictions on race or ethnicity?",
            "title_similarity": "0.7431033",
            "sentiment_compound": 0.6072
        },
        {
            "id": "h1u04l5",
            "score": 1,
            "text": "Yes and no, If the character they are going to play has some lore that have determinated his look and race, the movie should follow it",
            "title_similarity": "0.65648973",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1u1e5e",
            "score": 2,
            "text": "… Why are people getting angry about this in the first place?",
            "title_similarity": "0.57757986",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1u2z22",
            "score": 1,
            "text": "Well if we take your title word for word, then I can't agree at all.\n\nIf the movie is about Martin Luther King, I do not want a white midget to play him lol. Actors should play roles that make sense for the movie as their purpose is to animate a story, if the story is about an Indian midget then it should be played by an Indian midget.",
            "title_similarity": "0.77038455",
            "sentiment_compound": 0.8302
        },
        {
            "id": "h1u3vku",
            "score": 1,
            "text": "I agree, as long as they're doing their best, not doing a charicature and trying to be offensive. (Even doing it in earnest could still offend, but the casting crew and director have a lot of responsibility here too)\n\nI see complaints that a certain actor isn't gay but it's playing a gay character, or isn't disabled but it's pretending to have a disability. I can see why it could be offensive, but how specific does it have to be? What if you have a disability but it's the wrong one for the part? Does that push you up the list ahead of anyone who isn't disabled or does it go against you?\n\nI don't think it's a bad topic to discuss but I think any blanket statement that \"X can't play Y\" is dumb. It's acting, it's make believe. You don't have to be a killer to play a killer.\n\nBlacking up is always cringeworthy though. Everything I've said would say it's ok, but I just don't.",
            "title_similarity": "0.7853201",
            "sentiment_compound": -0.9825
        },
        {
            "id": "h1u3zw8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20510904"
        },
        {
            "id": "h1u4brz",
            "score": 1,
            "text": "The Last N***a on Earth starring... Tom Hanks.",
            "title_similarity": "0.38568404",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1u4xmn",
            "score": 1,
            "text": "The outrage is because it means we have one less role for asian actors.  We pretend like we are short on actors of ethnic diversity but we only hire 20 odd white people to play most of those roles.  Granted it has gotten much better.  But we then look at hollywood only having whote actors doing those roles and stuff and then we say things like \"well who could even do it theyre arent any asian actors famous enough\".  Its a problem of understanding that the people you see on tv are not the \"best\" actors in the world, they are the ones that got hired.  Its a problem because it creates this snowball effect of never using other races.  Again we are doing much better but it is a constant battle.  If you lose to much ground so to speak siddenly everyone that said qe dont have any asian actors is right because none of them are eve on screen in big roles.\n\nFor the record i agree to an extent, the bigger reality os if there is any anger it should be toward the casting director or whoever casted the actor not the actor.",
            "title_similarity": "0.6464747",
            "sentiment_compound": -0.6251
        },
        {
            "id": "h1u4y3j",
            "score": 2,
            "text": "Next thing you're gonna tell me is that Will Arnett isn't really part horse.",
            "title_similarity": "0.40628096",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1u585p",
            "score": 1,
            "text": "they should also not be restricted from playing roles of homosexuals, thats discrimination",
            "title_similarity": "0.5998647",
            "sentiment_compound": 0.4559
        },
        {
            "id": "h1u5rrz",
            "score": 1,
            "text": "Generally, there will only ever be one production of any film/TV show in a generation. Obviously there are exception, like the regular reboots of Spiderman, but that's the general thing.\n\nIf a show is conceived as about an Asian character, but you let a white person take that role, you rob that community of its chance for representation. Representation is hugely important for letting people realise what they can achieve. It's the old \"see a woman playing a doctor = girl thinks she can be a doctor growing up\" thing.\n\nOnce you cast a white person for a non-white role, no non-white person can play that role. And you're then improving the CV of the white person over the non-white person, giving them a better chance of getting non-raced/gendered roles because of previous roles.\n\nThere's an argument for more blind charactering/casting - is the race, gender etc of the character actually relevant, or can we just go out for actors and give the best actors the job and not worry about race/gender etc - but given most casting folks are white that would almost certainly lead to many cases of \"not what we pictured for the role\" where \"what we pictured for the role\" is \"white.\"\n\nI could see an argument for letting anyone play a character of any race etc where they are a villain - there's less chance you're reinforcing harmful stereotypes that way - but then you reduce chances for non-white actors to get more roles, a better CV, and a chance at better roles.",
            "title_similarity": "0.692442",
            "sentiment_compound": 0.9831
        },
        {
            "id": "h1u5rwz",
            "score": 1,
            "text": "Not sure if this would help at all, but my go-to example is Sia’s awful movie Music (I think it was released last year). Sia chose a non-autistic actress who ended up just watching YouTube videos of meltdowns (uploaded by parents of nonverbal children) for “research” and ended up as a walking caricature (who also is basically just a tool for growth for the non autistic characters in the story). The story is named after the “autistic” girl, and yet she’s not even the main character or an active agent in her own story. And that’s not even to mention how the movie advocates for restraints on autistic people that have been proven to be dangerous even in emergency situations.\n\nFYI: I don’t blame the actress for this. She was 14 at the time, and a lot of interviews point to her and Sia having an unhealthy pseudo mother-daughter relationship that would make it hard to stand up for herself and what she wants to do with her career.\n\nPeople who don’t know anything about autistic people (or worse, are actively afraid of them due to things like the antivax movement) and don’t know any better are going to take what they see in the movie for granted and view it as acceptable, and that could lead to real harm being done to individuals and the community as a whole. In the case I mentioned, people could be literally, psychically hurt.\n\nAutistic representation in the media falls into some weird categories (a lot of sociopaths, savants, some combination of the two, or just straight up infantilization), and if you only ever see people of certain groups portrayed in one or two ways, your brain just naturally assumes that is how life is. That’s the norm. The art is just representing life.\n\nBut in addition to the harm being done to communities from ignorant outsiders, there’s the internal harm of being made to feel inferior, a walking stereotype. Not a whole person with thoughts and feelings and complexity (which…isn’t that the goal of acting? To make characters interesting and dynamic?). The harm of directors and creative teams refusing to hire you or people like you (even for roles that you would have personal experience in and thus could recreate or portray well), while continuing to cast the same old people every time. Neurotypical people will be cast as both neurotypical and neurodivergent characters alike, but neurodivergent actors can’t even get roles that represent them or people like them, let alone roles that would allow them to be neurotypical characters. \n\nIn a perfect world, it would be awesome if people could just play whenever they wanted. And I would agree that actors (who may or may not really need a paycheck) shouldn’t be punished or made to apologize when they have virtually no control over a creative project. To me, that’s a bit like screaming at the fast food worker over a company policy that they have no say over, but just because they have a face you can see and yell at more easily than a board member, franchise manager, or CEO. \n\nThat said, we don’t live in a perfect world that actually values art and talent and everyone getting an equal shot. We don’t even live in a world where representation matters to most people. We live in a world in which art must almost always take a back seat to profit; the focus being on established talent that is bankable and will put butts in the seats, rather than filling the industry with new and upcoming talent that is only slightly riskier. Making token gestures at inclusion and diversity because they want to seem progressive (again, for money), but not so much to alienate most people or make them that uncomfortable with the status quo. Hell, anytime Disney or Pixar include a gay side character, it’s always someone (or scenes of someone) they can easily edit out for releases in countries that don’t like gay people. \n\nThe average white person doesn’t really care about representation because we have so many white characters in so many movies and tv shows and things that we don’t have to worry too much about being pigeonholed or tokenized. The only time i see people caring is when they feel like “white” roles and stories are being taken away from them (actors who look like them or characters they can easily relate to) to favor more diverse characters, which…as a white myself, I could not tell you how few fucks I give, especially when these same people complain about how everything these days is just remakes and stale retreads of stuff that was good once. I actually like learning about the human experience and people who are not 100% identical to my looks or heritage, because it gets me outside my comfort zone and adds some variety to the media I watch. \n\nBut I can honestly choose to care or not care, because I’m only affected so much personally. I talked about autism specifically because I have a sibling with non verbal autism and for years, between that and the lack of representation in media I saw growing up, I thought that was all autism was. All it COULD be. And when I was finally introduced to people who could speak and do basically everything I could, unlike my sibling? I was extremely skeptical, and I resisted changing my mind for a while, because to be honest? It felt weird to be proven wrong, even though I’ve never assumed myself to be all-knowing or correct about everything.",
            "title_similarity": "0.6613612",
            "sentiment_compound": 0.9912
        },
        {
            "id": "h1u75r9",
            "score": 1,
            "text": "An actor's ethnicity should have some restriction on the roles they should play. The character's ethnicity and background should be factored in when choosing actors for the roles. Superficially an actor should have some resemblance to their role since that's the first thing the audience notice. Hugh Jackman shouldn't play a Frederick Douglas and Sam Jackson shouldn't play Qin Shi Huang. \n\nAn actor's job is to play a role as convincingly as possible, taking into account the ethnic and cultural background alongside with the psyche of the characters. No one will say an actor mustn't play this character, the valid critique should be about how the actor failed to convincingly become the character.\n\nThe situation with Alison Brie sounds ridiculous tbh. Diane was supposed to be born and raised in Boston. She is probably second or even third generation immigrant and would probably not have a Vietnamese accent and should sound like a college educated Boston girl. Within every reasonable account, Alison Brie fulfilled the demand of the role, that is to sound like an educated Boston girl.",
            "title_similarity": "0.7503503",
            "sentiment_compound": 0.2714
        },
        {
            "id": "h1u7fxn",
            "score": 1,
            "text": "It depends on if it fits the story and how close they are to the original character",
            "title_similarity": "0.3769616",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1u7ggk",
            "score": 1,
            "text": "I’ve never understood the loathing of white actors and voice actors that has pretty rapidly developed in the US and other western countries. \n\nWhite people are the majority. Why wouldn’t they occupy the majority of the roles? If you watch anything out of China, India, Kenya, South Africa and other nations with developed entertainment industries you’ll rarely see white folk unless it for a niche role. Basically the exact same thing that happens in Hollywood but..literally nobody gives a shit.\n\nEdit : For example in China the token white guy is basically a standard in action movies and shit like that. Jason Statham for example kills it in China for this reason. He’s not overly tall, he’s balding and he’s white. In African cinema in my experience white folks mainly occupy the villain role. Yet here if we throw in a stereotypical warlord of a minority group or something it’s like the world is on fire.",
            "title_similarity": "0.6653408",
            "sentiment_compound": -0.5722
        },
        {
            "id": "h1u8qub",
            "score": 1,
            "text": "just try convincing reddit that Superman could be played by a black guy. go ahead and try.",
            "title_similarity": "0.53153217",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1u8tjj",
            "score": 1,
            "text": "Totally agree they are and should be allowed to play any role. However will a biopic about Winston Churchill featuring an all poc cast going to sell well or even look like a good movie? Probably not. Changing the race of a character can be anywhere from completely fine and irrelevant all the way to detrimental to the story and themes. It really depends on the story. No one is going to watch Hurricane with a white guy as the boxer or Django with a white lead because that's just not the tale.",
            "title_similarity": "0.7692869",
            "sentiment_compound": 0.8906
        },
        {
            "id": "h1u9gty",
            "score": 1,
            "text": "Counterpoint: there’s plenty of talented poc actors. Giving the role to someone else makes the casting director look racist and dumb. Like scarlet Johansson as all these Japanese women. Just hire a Japanese actress man.",
            "title_similarity": "0.7395463",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h1uanlb",
            "score": 1,
            "text": "I think it’s so funny that the people who are actually trying to change their view are being downvoted",
            "title_similarity": "0.5661423",
            "sentiment_compound": 0.5777
        },
        {
            "id": "h1uauoj",
            "score": 1,
            "text": "I could give two fucks about what color the person is in a movie. I don’t watch movies because of the color of someone’s skin I watch them for an escape from reality and occupy my mind for a 2 hours or less with something other than what is happening in the real world. I have enjoyed primarily black cast movies, mixed race character movies, etc. If there was a James Bond movie with Idris Elba as James Bond I could care less. It’s about the movie not the person’s color. Let’s take James Wan, Asian film director (Insidious, Malignant, Aquaman, the Lost Kingdom, etc.) He is Asian and hasn’t made a film with POC as main characters and there is no outcry about him not casting people of his own race. On the flip side of this coin I am sure that the struggle is real for POC in the movie business (JUST LIKE EVERY OTHER ASPECT OF LIFE) and I empathize and would like to see more of a variety. Here is an example of hypocritical. Zoe Saldana played a Jazz singer Nia Simonme and she got a lot of backlash for playing the character. Her father is Dominican and mother is Dominican with Puerto Rican ancestry. Hum she is a person of color but wasn’t black enough to play a black person and felt compelled to apologize so she wouldn’t  be canceled through today’s cancel culture. As long as there are different races of people there will always be friction because of that. I understand racism to a degree being of mixed race and being gay. I am fortunate enough to pass for white when other’s can’t take off their skin color. I definitely resent someone just looking at my skin color and judging me as a white oppressor guilty of all the bad things that have happened to women, POC, etc. etc. Point being people need to stop looking at a person’s color and judge a person for who they are and their actions. I am sure that there will be people who have a lot to say against this comment but I really don’t care what you have to say. Let’s figure out a way to move forward and not be fixated on the past or we will never be able to get to the point of equity for all to move forward.",
            "title_similarity": "0.7079675",
            "sentiment_compound": 0.604
        },
        {
            "id": "h1uazjf",
            "score": 1,
            "text": "Making a white character black may provide more casting opportunities but in terms of representation does it feel like a cop out? Like there are comics and books that have well developed characters that are POC but instead of turning those stories into movies or putting those characters in a movie they take a white character and cast a POC or remake movies with a female cast to be “inclusive.” I don’t see anything wrong with a the casting of Ariel or Deadshot but let’s be honest it’s not same as a Tiana or Miles. \n\nPeople fall in love with characters. People were outraged when Tom Cruise was cast as Lestat, or Heath Leger as the Joker. The difference is imagine falling in love with a character and already being under represented in the media and then that character is cast in a way you can no longer identify with them.",
            "title_similarity": "0.80160606",
            "sentiment_compound": 0.9459
        },
        {
            "id": "h1ubb1t",
            "score": 1,
            "text": "I think it’s also counterproductive to the people they are signaling for, because with this logic gay actors can only play gay characters etc",
            "title_similarity": "0.7726854",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1ubq68",
            "score": 1,
            "text": "Yes, because Django would have been so well portrayed by a white guy. \nLiterally every anime voice actor is white, and all those characters are Japanese. Who cares who does the voice acting. On screen is where it might matter, as per the Django example.",
            "title_similarity": "0.46918768",
            "sentiment_compound": 0.8196
        },
        {
            "id": "h1ubv7m",
            "score": 1,
            "text": "Actors are allowed to play any role they want.  There are no criminal penalties against doing so.  Do you mean that they should be able to do so without other people having an opinion about their action?",
            "title_similarity": "0.60543436",
            "sentiment_compound": 0.6679
        },
        {
            "id": "h1ucvp9",
            "score": 1,
            "text": "The only reason someone is willing to pay to make a movie, is to make a profit. And the difference between making a profit and losing money, can be  having the right actors.  \n\nSure most actors can do a very good job, but most actors can't get people to crack open a persons wallet and pay for that content.",
            "title_similarity": "0.7079855",
            "sentiment_compound": 0.4672
        },
        {
            "id": "h1ucxuo",
            "score": 1,
            "text": "I agree but there may be certain exceptions .. like “Snow white” may be confusing for some kids when played by non white actor :-) \n\nOn the other hand Im still waiting for Cleopatra being played by someone who actually looks like original Cleopatra :-D",
            "title_similarity": "0.61457765",
            "sentiment_compound": 0.9842
        },
        {
            "id": "h1udmti",
            "score": 1,
            "text": "Actors should try to play their role as best as possible. It's the job of the production team to hire the best actors for the job. So I don't blame actors at all and they shouldn't be the ones apologizing. Jake Gyllenhaal can try to be Persian but the studio should've chosen another actor that would have been more believable. Not Jake's fault. We can target our disagreements at the casting decisions.",
            "title_similarity": "0.76695704",
            "sentiment_compound": 0.6795
        },
        {
            "id": "h1ue4z6",
            "score": 1,
            "text": "Makes perfect sense to me, that's why they are called \"Actors\"!",
            "title_similarity": "0.32350224",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h1uhh81",
            "score": 1,
            "text": "For VAs I agree but not actors",
            "title_similarity": "0.47313136",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h1uiu6s",
            "score": 2,
            "text": "It's called acting for a reason.yes we should use actors of all colors but I think it's a directors choice and the script and I don't think quotas are good for anything.\nTalent is talent regardless of color.\nAll this outrage is wasted energy.",
            "title_similarity": "0.8369392",
            "sentiment_compound": 0.5086
        },
        {
            "id": "h1urbig",
            "score": 1,
            "text": "I understand your point wholly, but I think it’s a misunderstanding on both parts. \nFirst I agree Alison Brie should not have had to apologize.\n\nIt’s really two points\n\nThe first being that It wasn’t that she was MERELY a POC. It was that it was ABOUT her story of being a POC, or it incorporated it which is when people had an issue.\n\nWhen my story is being told on the television so intimately, I feel better when someone who shared that struggle is performing. Same thing with poverty. They can do it, but it doesn’t hit the same yanno?\n\nThe second being a lot of POC stories these days are personal testimonies; however, these “white” rolls you speak of are just rolls, with depth and complexity aside from their race. When white voices - who already take so many regular rolls - start to impede upon the rolls that POC ARE able to get them it leaves no more room for them anywhere",
            "title_similarity": "0.78739417",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1uvszy",
            "score": 1,
            "text": "Ok...allison bree wasnt forced to apologize, she just chose to. Like, imagine if every time somebody apologized for something they wanted to apologize for suddenly they couldnt do it cause people will think they are being \"forced\" to apologize. There are plenty of people playing different races, some actors and actresses have personal preferences and will can and will change their mind. Nobody is forcing anybody to do anything, it's all their own decision, and personally I want to give people the freedom to make their own choices.",
            "title_similarity": "0.83686244",
            "sentiment_compound": 0.8774
        },
        {
            "id": "h1uzp25",
            "score": 1,
            "text": "Voice actors yeah I agree but with live action actors nah",
            "title_similarity": "0.4213131",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h1vbprv",
            "score": 1,
            "text": "I wouldn’t care about voice acting, but casting a character that’s white for a black role I’d disagree, same if it were in reverse, like they’ve cast a black woman to play Ann Boleyn",
            "title_similarity": "0.7370971",
            "sentiment_compound": 0.6187
        },
        {
            "id": "h1vc0g1",
            "score": 1,
            "text": "Yes and no , when playing a historical character and in historical settings it important as well as established characters , with them we already have an idea of who the character is and would need sick close to it ,but at the end of the day Quilty is the most important factor even considering al of the above I guess it’s a case by case thing",
            "title_similarity": "0.6703893",
            "sentiment_compound": 0.4748
        },
        {
            "id": "h1vcesv",
            "score": 1,
            "text": "What is a character is a Klan Member or a Nazi?",
            "title_similarity": "0.32250565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vcirm",
            "score": 1,
            "text": "I think the responsibility should be mainly on the producers or directors, or the people that cast the roles. Because it's not about a singular person acting as someone with a different background. It's about a pattern, a pattern of under-representation of people of color, and a pattern of white-washing.\n\nIf there was no history of Minstrel shows and racism this wouldn't be a big issue.\n\nI also think that independently of that, if the character is made to be a stereotype, it would be very problematic.\n\nThis does not mean that I think actors should be free of guilt, but they are more like pawns in a game that is controlled by people with biases and they need to address that.\n\nRelated to this topic, there should be more representation of people of color not only in the acting roles but as producers and directors, this way I think we would get richer and more dimensional narratives and characters.",
            "title_similarity": "0.7858812",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h1veddl",
            "score": 1,
            "text": "The art is better when it’s people really using their own voices. Sure people can fake an accent but there’s more to it— there’s slang and nuance and knowing the culture. It’s boring to have white actors doing a fake accent reading lines by white writers. If Apu had been acted by an Indian guy he probably would been a better character in a better show.",
            "title_similarity": "0.6631441",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h1verdk",
            "score": 1,
            "text": "Uhhh… Blackfacing and Whitewashing are not ok.",
            "title_similarity": "0.5203234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vgltt",
            "score": 1,
            "text": "I don’t think Alison Brie was ever cancelled over this, or even threatened to be cancelled. I think she, and the creator of the show just apologized. It kind of seems like people that have the problem with cancelling blow it out of proportion sometimes.",
            "title_similarity": "0.7084924",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h1vifke",
            "score": 1,
            "text": "no.",
            "title_similarity": "0.13167357",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vpf12",
            "score": 1,
            "text": "I think the exemption is poc's in historical roles when they weren't poc's in history. History is history, these people were white.\n\nThere would be outrage if we cast someone like Rosa parks or malcolm x as a white person.\n\nSo you cast your black people as black people. And we'll cast our white people as white people.\n\nAlso, why do you want to play the roles of your oppressers?\n\nAlso, also, if u want more black people in historical dramas find people who were rly black and make dramas about them.\n\n\n( I don't count stuff like Disney or bridgerton in this, Disney has fucking talking animals and bridgerton is so satyrical I think it comes up as an example in the dictionary)",
            "title_similarity": "0.6951206",
            "sentiment_compound": 0.0232
        },
        {
            "id": "h1wacm2",
            "score": 1,
            "text": "Truth, it's the acting is about playing someone they are not. But race( and to lesser extent, ethnicity) is different from sexual orientation or political or religious beliefs IMHO. Race is more similiar to age, biological sex, to certain extent height. These are all visible characteristics that are extremely difficult to hide. You (typically) can correctly identify the race, biological sex and  ( approximate) age of actors whose names you don't even know yet, right after seeing unfamiliar actor for the first time in the movie. \n\nPlaying someone you are not means playing someone skillfully and believably pretending to love someone you don't love in real life( this often happens even when orientation of character and actor matches), believing in what you don't believe IRL, having personality you don't IRL or suffering from problems you don't and never did IRL( e.g. a person with happy childhood playing a child of horrible parents). \"Skillfully  and believably playing a black person/ a white person/a (biological) man/a (biological) woman etc\" sounds really weird... Biologically male actor acting effeminately absolutely doesn't equal playing a biological woman, black people acting elegantly and classily doesn't equal playing a white person( not all white people are like this and how you can portray \"whiteness\" if  you are playing not James Bond but real life white criminal who was raised by poor single mother... or Eminem?) etc.\n\nI believe features of actor, you can't know simply by seeing him in the movie, don't have to match to the ones of actor. Race and to lesser extent ethnicity aren't ones of such characteristics.\n\nIMHO, sex and race of cast are the characteristics that normally matter the most in live-action films, ethnicity less so( strongly depends on particular case) and sexual orientation( just like beliefs) don't matter. In voice acting sex matters more than the rest of mentioned characteristics.",
            "title_similarity": "0.7849269",
            "sentiment_compound": 0.5214
        },
        {
            "id": "h1wj1ff",
            "score": 1,
            "text": "This one I find really difficult depending on the role. \nSay James Bond. Can James Bond be played by a POC? Yes but are you looking for the traditional James Bond or is it your interpretation of the character. If you have a POC play James Bond but change nothing about the character, I ask what’s the fucking point?",
            "title_similarity": "0.646626",
            "sentiment_compound": 0.6265
        },
        {
            "id": "h1wlk7x",
            "score": 1,
            "text": "I agree. I fact the people who advocate shit like this are hypocrites. \n\nWhite people playing minorities characters = bad.\n\nThese Same people say that a Korean actor should be able to play a Chinese person.",
            "title_similarity": "0.67893755",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1wqymo",
            "score": 1,
            "text": "I feel like that to. The actor for cleavland from family guy quit because a bunch of people were sending him non stop hate mail and death threats for being a white guy voicing a black guy",
            "title_similarity": "0.6740905",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h1xkwhk",
            "score": 1,
            "text": "What are you going to do, make a WWII movie with a black Hitler? Make a Jackie Robinson movie with a white guy?",
            "title_similarity": "0.44510245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1yac8m",
            "score": 1,
            "text": "After reading all the comments, i realized the tru problems.\n\nFirst of all, people make casting mistakes or try to white wash stuff. Most prominent example is west side story. They could have hired a bunch of Latino actors/actress but they didn't. Or the whole thing about Hermione not being pretty( they could have found an ugly girl, not hard). Like if you are basing off if source material, at least be tru to what is written. They went out of their way not to be tru to source material. If there is source material, as a casting person, you should try to match it\n\nI don't mind added diversity in places. Like making certain characters different races/types of people/ethnicity. You can do too much diversity, but just picking people who would really fit the role would be a good start if it's doesn't have obvious source material.\nSome things need a rework and the rework is fun. Like Riverdale! They did an amazing job on reworking the characters and making an amazing drama and they added diversity to the character set. Or like Lovecraft country or like the watchmen.\n\nI think when people don't want colored/ethnic/ lgbtqia characters, they are acting on their own bias and they are uncomfortable with it. Or themselves.",
            "title_similarity": "0.85781217",
            "sentiment_compound": 0.9752
        },
        {
            "id": "h1yq1gi",
            "score": 1,
            "text": "As a comedian i agree with this... BUT i also disagree. The problem isn’t much about race/ethnicity but more about chance equality.\nAs a poc enby I am less likely to be casted in some roles than my fellow cis-white comedians. If everyone was equal and racism and transphobia wasn’t as present in the movie industry we wouldn’t have to fight for people to be equally casted for roles that they are more qualified for than mediocre white people",
            "title_similarity": "0.70348084",
            "sentiment_compound": -0.8668
        },
        {
            "id": "h1z49q3",
            "score": 2,
            "text": "I think there’s two cases\n1) Live action: BFOQ, bona fide occupational qualification is a legal term, saying employers can discriminate if there is a required trait or skill, to give an example, only hiring Asian actors for Crazy Rich Asians. \n\n2) I agree, I remember the guy who plays Cleveland on Family Guy had a similar situation. As long as one’s voice is not with an accent/dialect that makes it clear the race of the actor, there should not be any restrictions. If a southern farmer with a strong twang voice acted for an LA hispanic gang member, it might raise some suspicions, but otherwise I see no reason why they shouldn’t be able to. I imagine shows would want to prioritize voice actors who were similar to their character, but they can’t always realistically afford to find a different voice actor for every minor character",
            "title_similarity": "0.7199353",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h2gqj0v",
            "score": 1,
            "text": "Very true as long as it is okay for white people to play African god’s and MLK. It is either both ways or neither.",
            "title_similarity": "0.4281342",
            "sentiment_compound": 0.7501
        },
        {
            "id": "h2krcv5",
            "score": 1,
            "text": "It can't go both ways.  POC seem to want to be able to ay white characters ... but don't want white characterd to play POC.",
            "title_similarity": "0.62829894",
            "sentiment_compound": 0.4436
        },
        {
            "id": "h4sb3zb",
            "score": 1,
            "text": "Noooo. Go look up the new live action Cindarella and say this again. It is sickening",
            "title_similarity": "0.64381135",
            "sentiment_compound": -0.5267
        }
    ]
}