{
    "CMV: Fines should be proportional to a person's wealth\nWhen someone gets, for example (but not exclusively) a parking fine, the amount they have to pay should change depending on how much money they earn. This is because the fine is not a payment for an item, it's supposed to be a punishment and a deterrent. If someone with no income has to pay a £50 fine, versus someone with millions in the bank, the amount of punishment they're experiencing will be vastly different, even though they've done the same thing. I think in this situation it makes more sense to balance the level of punishment, than to have the same arbitrary cash amount.\n\nI'm sure I've just shown how little I understand the way the law and/or economics works, and I welcome anyone to fill me in.\n\nEdit: I'd like to clarify on what sort of system I'm envisioning - although I'm sure this has a few thousand issues itself. I picture it working similarly to tax brackets, so there's a base fine of X, and as the brackets go up people have a proportionately higher fine to pay.\n\nEdit2: I'd also like to thank everyone for commenting, this has been really, really interesting, and I have mostly changed my mind about this.": [
        {
            "id": "h1u3x68",
            "score": 1,
            "text": "/u/buttonbirds (OP) has awarded 4 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/o0bwf1/deltas_awarded_in_cmv_fines_should_be/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.44148415",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1uhix7",
            "score": 36,
            "text": "This is inherently unjust.\n\nI understand where you’re coming from, and I’m not sure if this argument has been made on the thread yet but consider this:\n\nEqual protection and application of the law is important. \n\nIf I make 100,000 dollars a year and commit Crime A, and someone makes 40,000 a year and commits the exact same crime it is inherently unjust and unequal to fine me more than the other person.\n\nWe have committed the same bad act, yet if I am fined more than the other person then the crime itself becomes MORE serious because I have more money. Not because the act itself is different or there are aggravating factors.\n\nIt’s the same thing as the disparity between sentencing for crack cocaine and powder cocaine offenses.\n\nThey are the same drug, yet for decades crack cocaine was punished almost 100 times more severely than powder cocaine. For the same amount of drugs, the crime was different based on the form the drug took — which led to disparate sentencing for poor people of color.\n\nSo we would be in a situation, if your view were the norm, where people would face enhanced punishment simply for having more money.",
            "title_similarity": "0.81212723",
            "sentiment_compound": -0.9957
        },
        {
            "id": "h1uhwv3",
            "score": 8,
            "text": "The law is supposed to be blind to race.creed.color.wealth...etc.\nHow about you just dont break the law. Then you dont have to pay a fine...",
            "title_similarity": "0.6994515",
            "sentiment_compound": -0.1541
        },
        {
            "id": "h1uapau",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.10924664"
        },
        {
            "id": "h1txhrr",
            "score": -1,
            "text": "What do you do in the typical scenario of wealth not being in the form of a number in a bank account? I.e. billionaires whose money exists largely in stocks/shares.\n\nDo you force them to sell? Put them automatically in debt to the government? Plenty of options to choose from but these ultimately have a shared problem: anything that forces a shareholder to sell shares, inherently lowers the price of the shares. Because why should anyone buy those at a high price if they *must* be sold? The whole point of earning something from selling is that there must be some level of demand and that the seller consents to the price point, but the seller in this case has been coerced instead.\n\n\\* By all means, fines for smalltime violations like speeding is really just a fee for driving faster, for the wealthy. Something *should* be done to combat law violations and make the wealthy actually feel the sting that everybody else feels. But maybe the solution lies elsewhere --- like, closing all legal loopholes for tax avoidance. Putting in more efforts to get back the taxes that ought to have been paid.\n\n\\** To be *very* clear: I do share OP's general sentiment about making the wealthy accountable, and again: feel the sting that everybody else does.",
            "title_similarity": "0.8248249",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h1ugked",
            "score": 1,
            "text": "Just make everything reflect off of the prior years taxes. Whatever your overall take home was make the fine x% of the total number. Obviously rich people won't bat an eye at the loss of a large fine because they have so much to begin with, but smaller households won't be hit as hard either. Additionally, it will give the state more incentives to charge rich people since they would make hand over fist on fines.",
            "title_similarity": "0.863991",
            "sentiment_compound": 0.942
        },
        {
            "id": "h1txro4",
            "score": 1175,
            "text": "The problem is that it's still unfair, even with fines being a proportion of your income.\n\nWhat does a 5% fine matter to someone who makes 1 mil a month? Cool, they pay 50k now. That looks like a big number, but they still have 950k to work with, which means they don't lose ANY quality of life and don't even have to think about it.\n\nCompare that to someone who only makes 1000 and has to pay 50 bucks. If you live paycheck to paycheck, 50 bucks of unexpected expenditure can FUCK you.\n\nSo even though the proportion is the same, the way that the fine affects these two people is still different. The rich person isn't inconvenienced by it even though he pays a lot. The poor person might not have enough money left to eat this month and the fine might be an existential threat.\n\nThat's the thing. Even proportional fines are only a fair punishment when everyone is financially stable and can afford to pay. As long as that isn't the case, they will always hurt the most vulnerable members of our society the most. You're right that making it proportional is a step in the right direction, but it still doesn't solve the problem.",
            "title_similarity": "0.7263747",
            "sentiment_compound": -0.9127
        },
        {
            "id": "h1tyh8x",
            "score": 49,
            "text": "So instead of having everyone treated equally under the law, we will have an incentive for people who have no money to pay fines to not have to worry about paying fines. \n\nBased purely on trying to incentivize wealthy people not to do things, it might perversely incentivise poorer people to do the exact same thing you are trying to stop. Unless of course this is purely as a money raising scheme. (Clamps on a Lamborghini are probably a better incentive to deter behavior)",
            "title_similarity": "0.8293246",
            "sentiment_compound": 0.3195
        },
        {
            "id": "h1vba7o",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.10924664"
        },
        {
            "id": "h1vlai8",
            "score": 0,
            "text": "This is actually a reality in Finland at least in some cases like speeding tickets.\n\nHere is an example: https://sports.yahoo.com/sabres-defenceman-rasmus-ristolainen-earned-himself-a-ridiculous-speeding-ticket-while-in-finland-000139701.html?guccounter=1&guce\\_referrer=aHR0cHM6Ly93d3cuZWNvc2lhLm9yZy8&guce\\_referrer\\_sig=AQAAAJR4gWFkalN7ohlFXjyJXlJe93UExCfhNM5nXjirXcukNPRusQobry\\_D3Ccf2FwRWLSDHgRWJOVJTGShjy9EjGp7aQePHZvIW7fg4fXftyO4Vm1lgHDG5oX8qvYGYb\\_DbljJdPKs3hsMWhWVA0O4U4MRJF9-\\_sVP2e8luGJKCn4G",
            "title_similarity": "0.61420256",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1wqyuj",
            "score": 0,
            "text": "No, they should be exponential. We want the median person to pay 0.5%, maybe in this city it's 40k. So we want them to pay $200. Reasonable. Now, we plug that into f(x) = x^2*a, divide both sides by x, giving 0.5%=40000*a, or a=1.25×10^-7. At minimum wage, you're now paying a little under $30. That's probably not even worth the hassle of ticketing for, and, while 30 is a lot on minimum wage, it's a lot less than a flat value of 0.5%, or $75.\n\nIt gets better. At 8 million a year, it's literally your annual income. Even if you could pay a driver, you'd be damn sure he followed the rules. You might even drive yourself with that kind of risk, forcing the rich to continue to live like normal people.",
            "title_similarity": "0.71165955",
            "sentiment_compound": 0.841
        },
        {
            "id": "h1xchz1",
            "score": 0,
            "text": "Progressive fines would be awesome, but it’d be nice for the rich to pay taxes at a progressive rate first",
            "title_similarity": "0.75425655",
            "sentiment_compound": 0.8898
        },
        {
            "id": "h1xg7ol",
            "score": 0,
            "text": "You forget that the function of the legal system in almost  every civilization has been to legitimize the position of ownership the ruling class has over what they claim is their property and the right to the working classes labour and surplus labour value.",
            "title_similarity": "0.6177235",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1xgx8u",
            "score": 0,
            "text": "I refuse to change your view.",
            "title_similarity": "0.20312174",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1xhuq5",
            "score": 0,
            "text": "\"If the penalty for a crime is a fine, then that law only exists for the lower class” - 🦍",
            "title_similarity": "0.68204165",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h1xidxy",
            "score": 0,
            "text": "Well fines should exist fuck off",
            "title_similarity": "0.4593183",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1xnwin",
            "score": 0,
            "text": "Fines are an entirely flawed system of punishment that is inherently classist and discriminatory.",
            "title_similarity": "0.49068356",
            "sentiment_compound": -0.7645
        },
        {
            "id": "h1xyytr",
            "score": 0,
            "text": "If a fine is the penalty, the law was targeted for poor people :(",
            "title_similarity": "0.6450693",
            "sentiment_compound": -0.802
        },
        {
            "id": "h1uk2kj",
            "score": 4,
            "text": "The issue I see is that the countries that are likely to implement that solution, very likely already over-tax the rich to a ridiculous degree (some countries manage to put over 80% of tax on their citizens).  \n\n\nConsider you are a guy who pays say, 1.2 million in taxes every year. Your taxes already built several miles of roads, a few bridges, and fixed a hundred thousand potholes.  \n\n\n*By all rights of fairness, you should basically own these roads in all but name*. After all you are not using more road than a poor person, but you fund an order of magnitude more.  \n\n\nWhy pay more fine then? Sure, you should be discouraged from reckless driving (even with jail-time or having your driver's license revoked), but should not be forced to pay an added cost for driving on the road that you personally funded.  \n\n\nI used road fines as an example, because these are being the only ones where the fine could possibly deter a dangerous behavior. Fines for things like littering or parking, or smoking are even more ridiculous in that regard.",
            "title_similarity": "0.7518631",
            "sentiment_compound": -0.7815
        },
        {
            "id": "h1uhhbw",
            "score": 1,
            "text": "Treating people differently based on income is a hallmark of a disegalitarian society. Private citizens are allowed to discriminate, but public laws shouldn't discourage people from working to own wealth in that jurisdiction.\n\nThey say Justice is blind, but I guess if fines are graduated by income then this lady is peeking out of the blindfold to see how she can make some money.",
            "title_similarity": "0.7931136",
            "sentiment_compound": 0.8537
        },
        {
            "id": "h1uivzp",
            "score": 1,
            "text": "It is in Switzerland 👏",
            "title_similarity": "0.1319904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w17oe",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10924664"
        },
        {
            "id": "h1w1k0o",
            "score": 1,
            "text": "As I (maybe misunderstood), the law was always supposed to be equal, regardless of any personal characteristics, two individuals should receive the same punishment for the same crime.\n\nWhilst I am not wanting to defend the rich, I do believe that changing punishment based on personal circumstances does create a worrisome path that society child go down",
            "title_similarity": "0.7388706",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h1wiiwe",
            "score": 1,
            "text": "In Finland it is that way! A few years ago some rich guy was speeding in his super car and received the equivalent of a $100,000  fine.",
            "title_similarity": "0.52049166",
            "sentiment_compound": 0.8622
        },
        {
            "id": "h1u6k3o",
            "score": 15,
            "text": "So, you are assuming the fine is intended to prevent a behavior. That is one reason for a fine, but I would argue that the larger reason is simply to generate revenue. Your system might actually reduce the instances of this minor infractions, this starving government agencies of funding. In addition, right now it is trivial for bill gates to pay a traffic violation, if you make it cost him a million dollars, he is going to fight every ticket in court with lawyers. We are going to need to dramatically increase the number of courts / judges / juries. Depending on where your fine brackets land this may have a very significant affect on our courts and on the cost to govern our society. \n\n\nOn the upside, making the police prove traffic violations, instead of the current guilty until proven innocent method we use in the USA, would be an unintended positive effect. Just keep in mind, this will dramatically impact how much wealthy folks will work to interfere in laws / elections because you are directly harming them. Get ready for a fight against sharply increased corruption. What's a few hundred thousand to buy protection for the local police if it saves you millions in tickets?\n\n\nIn general, I think this system would do more harm than good as it would require a major societal shift to actually incorporate it effectively and would likely take decades to get working right and get it to a point where it was less harmful than the current system.",
            "title_similarity": "0.8263025",
            "sentiment_compound": -0.7491
        },
        {
            "id": "h1u16hg",
            "score": 472,
            "text": "A proportional fine would go against the legal principle of « equality of sentences » (I am arguing from a French legal standpoint). In the Declaration of the Rights of man and citizen, the article 6 explains that the law « must be the same for all, either that it protects, or that it punishes ». \n\nIssue is, with a proportional fine, we are not only punishing the crime, but also the person’s status. This is why for example the crime « feminicide » is not recognized in the French legal system, because it would be creating a possible harsher sentence only due to the status of the victim. \n\nThis principle protects the integrity of the penal system to ensure people are punished for their actions and not for who they are. A proportional fine would be a massive exception to this principle and could possibly mean the end of it.",
            "title_similarity": "0.73508626",
            "sentiment_compound": -0.2589
        },
        {
            "id": "h1tz4iy",
            "score": 38,
            "text": "While is support progressive fines there are glaring increase in cost with them. You require police (or other authority) to check people's incomes and calculating propriate fines. With speeding tickets this should be the case but with minor tickets like littering or jaywalking, this increase in bureaucracy means that people are not punished. With things that have high penalty the new cost can be covered by extra income from high earners but with minor ones you just don't get that much more money in.",
            "title_similarity": "0.83758426",
            "sentiment_compound": 0.8204
        },
        {
            "id": "h1ujwuj",
            "score": 2,
            "text": "You would punish more only the honest, good, hardworking rich people.\n\nThe tax-evading rich people would only get around it by hiring a poor driver, or just dodge the \"wealth bracket\" they belong to by moving assets or wealth to companies/funds/people etc, as they already do.\n\nAlso police as a whole would be heavily, and I mean to the point it doesn't even make sense to stop anyone else, incentivized to stop rich people/expensive cars. And that's problematic.",
            "title_similarity": "0.82424927",
            "sentiment_compound": 0.9112
        },
        {
            "id": "h1ul831",
            "score": 2,
            "text": "If the only punishment for a crime is a confiscation of money, it is not a crime, but rather an unofficial tax on the poor. \n\nThe solution is not to charge some people more, but rather to abolish these pointless laws or give actual punishments, such as community service",
            "title_similarity": "0.7887315",
            "sentiment_compound": -0.8087
        },
        {
            "id": "h1vm68j",
            "score": 2,
            "text": "Unfair. I wouldn’t give me kids different punishments for the same thing just because one is smarter or whatever",
            "title_similarity": "0.5530604",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1uih9s",
            "score": 10,
            "text": "I believe laws should not be set up to deter behaviors, laws should be set up to restore justice. \n\nThe inconvenience for the illegal parking does not depend on the wealth of the person doing it. \n\nIf you’re serious about restorative justice as punishment, you should be opposed to laws that disproportionately hurt poor people all together.",
            "title_similarity": "0.76504076",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h1ul961",
            "score": 13,
            "text": "Fines are not a punishment, they're a way for the government to receive recompense for injury, whether actual or imaginary.\n\nI already dislike fines. I think fines are used by the government to monetize certain activities, not to stop them. In practice, a government has no desire to use fines as a way to prevent certain activities from happening. If the government wanted people to stop speeding, they would take away the speeder's ability to drive, not merely make them pay for the privilege.\n\nIn theory, fines are set at a value proportional a crime's damage to society. A poor person parking in front of a fire hydrant has committed the same crime as a rich person who is parking in front of a fire hydrant. However, society has been injured the same amount. Why should the value of the injury increase because the person who did the injuring has more wealth?\n\nIf however, the theory of fines was changed to be a punishment instead of a way to collect recompense, I *could* agree with you. But when that happens, your idea starts to get a whole lot more complicated.\n\nHow do we determine one's wealth for the value of the fine? Do we go by the cash in their bank account, the value of their property, or their income on their tax return?\n\nDo we also take into consideration that in some parts of the USA (for example), a six figure yearly income is not even middle class where in other areas it's upper class? Therefore a barely six figure earner in Northern Virginia, New York City, Hawaii, or Silicon Valley is the equivalent of someone who lives paycheck to paycheck in rural Idaho or Missouri?\n\nIf we don't take these things into consideration and are somehow able to make fines pass a means test, how to we keep them from causing more harm to higher earners who are in the same financial situation as lower earners?\n\nAnd if we do take these things into consideration and *are* able to keep the harm equal across all income levels, is it even worth it? At that point we've decided that the value of harm to society is equal to a proportion of one's wealth who committed the crime and therefore the value of the society itself is determined by the wealth of the people who harm it.\n\nThe only truly fair way to levy a fine is if the fine is equal for everyone who committed the same crime, regardless of their life's factors. \n\nThe definition of fairness is pretty simple: *impartial and just treatment or behavior without favoritism or discrimination.*\n\nA wealth test is discrimination.",
            "title_similarity": "0.8307866",
            "sentiment_compound": 0.9591
        },
        {
            "id": "h1uh48e",
            "score": 5,
            "text": "They are in Finland. Seems a yearly occurrence a pro hockey player gets a big ticket over the summer. \n\nhttps://www.reddit.com/r/hockey/comments/c95hk5/ristolainen_fined_120_000_euros_for_speeding/?st=KPY34ZRC&sh=cdee068c",
            "title_similarity": "0.5227949",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1up9yd",
            "score": 3,
            "text": "Using this logic we should give younger ppl longer jail time?",
            "title_similarity": "0.5428866",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1uav48",
            "score": 157,
            "text": "This is an easy view to argue. The problem with setting up fines based on a persons income, is that it incentifies the law enforcement to target people who show evidence that they are in a wealthy income bracket. \n\nFor example targeting someone driving a new bmw going only 7 miles over the speed limit.",
            "title_similarity": "0.7952255",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1udpcz",
            "score": 6,
            "text": "It’s weird that people think a single mother of 5 making 100k would be better equipped to pay a 1000 dollar fine than a 20 year old making minimum wage would be able to pay a 200 dollar fine. Who do you think is most hurt by your system?",
            "title_similarity": "0.68596685",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h1uevxv",
            "score": 6,
            "text": "Wealth and income are not the same thing.  A billionaire can be a billionaire with negligible income.  A family with $250k in income annually can have below zero wealth (on paper) by having a mortgage that exceeds other assets. How much wealth does the child of a billionaire have?  If you want a means-tested  system of fines you will have to navigate this and define a formula.\n\nGenerally speaking though - even after considering the disproportionality of fines for poor people - fines should be proportional to the damages they do.  Is it fair if I have to pay $500 for littering but a poor person can do it for free?  \n\nMaybe young people should get longer prison sentences because they have more time left?",
            "title_similarity": "0.78404886",
            "sentiment_compound": -0.2824
        },
        {
            "id": "h1u1vq1",
            "score": 8,
            "text": "What if im rich but dont work\n\nEarn alot but have no savings\n\nWhat happens in those situations?",
            "title_similarity": "0.6609782",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1ube91",
            "score": 81,
            "text": "Wealth and Income are two very different metrics too. A “Rich Person” and a “High Earner” aren’t necessarily always the same. Let’s take 3 different thirty year olds and see where you feel they fall into your idea of who should pay what\n\nTake someone who inherited 20 million dollars, and has no job and just lives on the money. They do a decent job of making it stretch, and after 10 years have only spent 1 million. For the simple sake of the example let’s put aside income from interest. Their income in effectively zero. Would they be fined a lot or a little in your system?\n\nNow let’s take a look at a young plastic surgeon who makes a traditionally structured salary with bonuses, earning a million+ a year. He isn’t married or has a family, and spends all of his money jetsetting around the globe, buying VIP booths at Vegas clubs and gambling it away. He rents a luxury penthouse apartment in his city that he resides in. In short, instead of buying assets that hold value and work towards his net worth, he squanders it all, yet he earns a lot. His wealth isn’t high because of this, and factoring in his debt from his education and credit cards, is effectively zero because he has so little savings. Would he be fined a lot or a little in your system?\n\nNow how about an individual who earns $50,000 per year as a retail store supervisor. This person is fiscally prudent, and has been saving since they began working for $16. Due to good credit this person bought a house at a young age and has been building equity for a decade through their mortgage payments. They also put money into a savings account every month. After ten years this person is worth $200,000. Where would they fall in your system?\n\nI do understand what you are trying to get at because when a fine is a penalty for sometime, it is functionally permitted for those with wealth. In my opinion, however, the only way to equalize a punishment for an infraction is through time. We only all have 1 lifetime to live and excluding factors like access to healthcare etc, 1 lifetime is much more of a level playing field across the population. I don’t mean every penalty should be jail time, but even hours of community service is a more equivalent way of meting out repercussions. Is it easier for the person in my example A to do community service than the person in examples B or C, yes absolutely. But the disparity of the time people have is much more limited than in the metric of personal wealth or income.",
            "title_similarity": "0.7022557",
            "sentiment_compound": 0.9769
        },
        {
            "id": "h1tyddk",
            "score": 227,
            "text": "I mostly agree with you, but there is one significant problem that I can see:\n\nDelegating work to lower earners.\n\nAny person with a personal driver would be effectively immune to speeding fees, everyone with an accountant would be immune to fees relating to their business practices, etc.\n\nThere has to be a very careful change of laws that balances the ability to trace such fees to the person giving the orders without enabling abuse of the system, which can be quite difficult.",
            "title_similarity": "0.79625",
            "sentiment_compound": 0.936
        },
        {
            "id": "h1ua8v2",
            "score": 277,
            "text": "So in your title, you reference wealth. In your text, you elude to earnings. \n\nIf you take it as income - if mark zuckerberg gets a fine, he’d pay as a poor person because his income is $1. He earns money through other means. But on paper, he’s a “poor earner”. \n\nIf you take wealth such as assets - if a retired person was fortunate enough to buy a house 40 years ago that today is worth around a million, they have wealth. But despite that stroke of luck, maybe they don’t have much cash income, they’re just on pension income. So to use wealth is unfair to them because their income continues to be low despite the assets. \n\nIf you start trying to mix and match and have some sort of investigation into assets and income, then that’s just not financially viable to investigate many people to then realise they’re only eligible for the low fine.",
            "title_similarity": "0.79374707",
            "sentiment_compound": 0.9629
        },
        {
            "id": "h1ucgqz",
            "score": 30,
            "text": "[https://en.m.wikipedia.org/wiki/Day-fine](https://en.m.wikipedia.org/wiki/Day-fine)\n\nFrom the article:\n\n\"A day-fine, day fine, unit fine or structured fine is a unit of fine payment that, above a minimum fine, is based on the offender's daily personal income. A crime is punished with incarceration for a determined number of days, or with fines. As incarceration is a financial punishment, in the effect of preventing work, a day-fine represents one day incarcerated and without salary. **It is argued to be just, because if both high-income and low-income population are punished with the same jail time, they should also be punished with a proportionally similar income loss.** An analogy may be drawn with income tax, which is also proportional to the income, even progressively. \"\n\n\"In Finland, the day-fine system is used for most crimes that are punishable by way of a fine. The system has been in use since **1921.** Most minor infractions are punished with a fixed petty fine (rikesakko, ordningsbot) such as minor traffic and water traffic violations, littering, and breaches of public peace.\"\n\n\"A Finnish fine consists of a minimum of 1 day-fine, up to a maximum of 120 day-fines. If several crimes are punished together, 240 day-fines may be sentenced. The fines may not be sentenced together with a prison sentence, unless the prison sentence is probational. The minimum amount of a day-fine is 6 euros. Usually, the day-fine is one half of daily disposable income. The daily disposable income is considered to be one 60th part of the person's monthly mean income during the year, after taxes, social security payments and a basic living allowance of €255 per month have been deducted. In addition, every person for whose upkeep the fined person is responsible decreases the amount of daily fine by €3. The income of the person is calculated on the basis of the latest taxation data.[11][12] For speeding in traffic, however, the fine is at least as high as the petty fine, i.e. €115.\"\n\n\"The person who is punished with a fine is responsible for giving accurate information concerning their income. Lying about one's income is a crime punishable with a fine or up to three months in prison. The police can, however, access the taxation data of Finnish citizens and permanent residents via a real-time datalink, so the chance of lying successfully is minor. There is no maximum day-fine, which may lead to considerably high fines for high-income persons. For example, in 2001, a Finnish businessman with a yearly income of 10 million euros, received a relatively mild punishment of six day-fines, amounting €26,000, for driving though a red traffic light. In 2009 a businessman was fined €112,000 for travelling at 82 kilometres per hour in an area with a speed limit of 60 kilometres per hour. In 2019, Maarit Toivanen, a business executive, was fined €74,000 for driving at 112 kilometres per hour (70 mph) in a 80 kilometres per hour (50 mph) speed limit area. As speeding is punished with a petty fine if the offender is exceeding the speed limit by up to 20 km/h, but with a day-fine if exceeding the limit by 21 km/h or more, the monetary amount of the fine can increase from €115 to over €100,000 although the actual change in speed is less than 1 km/h. This has given rise to some criticism, most vividly expressed by a Finnish member of parliament, avid motorist Klaus Bremer and other MPs of right-wing parties.\"",
            "title_similarity": "0.75261045",
            "sentiment_compound": -0.8903
        },
        {
            "id": "h1tzwjh",
            "score": 1,
            "text": "Some countries already have this",
            "title_similarity": "0.14386493",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1u228q",
            "score": 1,
            "text": "This would encourage under funded agencies to target the wealthy in the hopes of hitting jackpot.",
            "title_similarity": "0.6485934",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h1u7s0v",
            "score": 1,
            "text": "So rich can pay a poor guy to do crime for them.",
            "title_similarity": "0.6199542",
            "sentiment_compound": -0.5221
        },
        {
            "id": "h1ucvd8",
            "score": 1,
            "text": "There is a certain practical problem i think. I agree with you when it commes to more serious/expensive charges.\n\nBut if it's something like parking tickets, wouldn't that require way more burocracy and general effort? You'd have to figure out everyones income for usually rather small fines. And if rich people get a parket ticket for some hundred euros, they might decide to go against that, arguing that day it wasn't me driving my mega Benz, it was my homeless friend with no income or something like that. \n\nMaybe this could be worth it, but if it costs the society more money, it might also result in generally higher fines for everyone. Someone would have to do the math.",
            "title_similarity": "0.871304",
            "sentiment_compound": 0.9003
        },
        {
            "id": "h1ud445",
            "score": 1,
            "text": "I think you would want to distinguish fines for acts that endanger others from fines for non payment or noncompliance with policy.  A parking lot fine should be set such that the probability of catching the offender multiplied by the amount of the fine less the cost of fine enforcement is equal to the cost of the parking less the cost of collecting money(through kiosks, meters, meter collection, etc). It doesn't matter then which way it is paid.",
            "title_similarity": "0.8416791",
            "sentiment_compound": 0.2792
        },
        {
            "id": "h1udnls",
            "score": 1,
            "text": "No different than your \"voluntary\" Tithe at church.\n\nAlthough, we all know it's required...",
            "title_similarity": "0.42565024",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1ueiev",
            "score": 3,
            "text": "Not entirely sure where you are located from the information in your original post but I am assuming somewhere in Europe? \n\nThis wouldn't work in the US due to the fourth amendment. Most fines do not require proof or income or wealth especially traffic violations, parking citations etc. \n\nI suppose punitive damages in a civil suit are tantamount to income based fines as they are designed to punish the perpetrator. \n\nI think I'm general it may be more plausible shave income based fines rather than wealth based. If 10 people earn the same income year over year they will invariably have differing amounts of wealth due to saving, investments, and proclivity to spend. I would think a fine proportional to income would be much more reasonable in general as this doesn't make it possible to punish someone for making better savings decisions. \n\nDepending on the structure of searches in the country it may not be plausible depending on what information needs to be provided and what type of fines your plan is inclusive of.",
            "title_similarity": "0.81667197",
            "sentiment_compound": -0.8692
        },
        {
            "id": "h1uejkx",
            "score": 1,
            "text": "Theres essentially two ways of looking at how fair a punishment is in my book.\n\nIs the punishment the same for each individual?\nThats what we have now its essentially putting a price on a crime and essentially how unwilling you are to commit the crime can be reduced down to how much you can afford to pay it.\n\nIs the impact of the punishment the same for each individual? In this case a percentage based fine would in theory impact people in the same way because its relative. However taking 1% of someones income damages someone who makes less more than it does someone rich because every small part of their wealth matters more to them because they have less.\n\nSo I wonder is it worth changing at all ? At the end of the day there will always be people who are richer than others and they will always be in a better position to pay off fines regardless of how they calculated. I suppose basing them off percentage of income would make it more of sting but it still wont do much as far as im concerned.",
            "title_similarity": "0.85758597",
            "sentiment_compound": -0.2477
        },
        {
            "id": "h1uexzd",
            "score": 1,
            "text": "For the purposes of my statement, I am going to assume that the problems of delegated work can be addressed by extending responsibility to those employing the individual fined or some other system.\n\nI am generally sympathetic to your position. I think what someone arguing with us would point out is fines are meant to modify behavior. It's therefore worth asking if the proportionality of the fine has a meaningful impact on the likelihood that the behavior recurs?\n\nAnother problem, one that might be exclusive to the U.S., is enforcement departments that depend on fines for funding. Many small towns in the U.S. have police departments that are funded by tickets from motorists passing through. If ticketing a wealthy person suddenly becomes more profitable, enforcement will be incentivized to target them. Admittedly, any profitability would be limited by extensive legal fees as wealthy individuals fight the fines so maybe those helpless billionaires won't be so targeted.\n\nHowever, I think the main point of asking whether the fines are serving the desired function is worth looking at. Are people safer? Do people gain from these policies?\n\nI can see a real opportunity in expanding your position by setting minimums and making fines proportional to the wealth they control and setting the percentage to whatever the least wealthy individuals controls. So, if a £50 fine would represent 50% of the wealth that the poorest guy (broke Joe) in the community controls, then a fine to the wealthiest would also be 50% of the wealth.\n\nThe reason I say this is potentially useful is that it makes it worth wealthy people's time to increase the wealth of the lowest individuals because then the proportionality would decrease. Giving broke Joe another £100 would mean a 50% fine drops to 25%.\n\nSo, rather than trying to take from the top, it encourages the top to raise the bottom, which is what I think we all want more.",
            "title_similarity": "0.75695634",
            "sentiment_compound": 0.9894
        },
        {
            "id": "h1ufg2j",
            "score": 2,
            "text": "This is ridiculous. It's connecting two completely unrelated things.",
            "title_similarity": "0.23348539",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1ugehn",
            "score": 1,
            "text": "I see this opinion like every other day. Do people really have nothing else to discuss?",
            "title_similarity": "0.30373317",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1ugf32",
            "score": 1,
            "text": "In the uk this is already the case with some fines. Like speeding tickets.",
            "title_similarity": "0.63449925",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1uh8mq",
            "score": 1,
            "text": "I understand your thinking on this and see it comes from a place of compassion. I would disagree because everyone should know the laws before they take off in a vehicle. So if a rich person hits someone due to speeding or intoxication it does the same amount of damage as someone who is poor hitting someone.",
            "title_similarity": "0.7440314",
            "sentiment_compound": -0.2585
        },
        {
            "id": "h1uhbyo",
            "score": 1,
            "text": "What you are suggesting is actually the case in some countries:  \nhttps://www.bbc.com/news/world-europe-10960230",
            "title_similarity": "0.35728258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ui797",
            "score": 2,
            "text": "yeah, fines are just tolls for rich people",
            "title_similarity": "0.75491273",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h1uidrk",
            "score": 1,
            "text": "Nah. It could be an insignificant amount of money to someone and they take it serious, or a lot to someone and they're a repeat offender. The purpose of fines isn't to punish people, it's to correct them/keep them in line. It's a notice. For the most part fines a low amounts too all. As for people who get screwed by them... can't pay your money to the crown? We live in a big government world now.",
            "title_similarity": "0.82898915",
            "sentiment_compound": -0.78
        },
        {
            "id": "h1uit0l",
            "score": 2,
            "text": "Psst... laws are only for poor people",
            "title_similarity": "0.45471394",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1ujsn6",
            "score": 1,
            "text": "How much would you charge for going 5 over the speed limit for someone who has filed for bankruptcy?",
            "title_similarity": "0.603149",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1uksd3",
            "score": 1,
            "text": "While I agree with you in principle, I think the biggest issue with this is logistical. What does wealth mean? If its their yearly income, plenty of rich people people are living off of trust funds and dividends. If its the amount of liquid assets, well for many rich people the wealth isn't liquid. Likewise if its net worth, that's both hard to quantify and challenging to access -- would someone need to sell a house for a parking fine? Do we trust people to self-report, or do local and national governments need to hire on large workforces to determine someone's wealth to take care of parking tickets and other fines?\n\nWhat about equality of enforcement? Will police forces start targeting the Porsches and Teslas because they're way more profitable?",
            "title_similarity": "0.81109065",
            "sentiment_compound": 0.9898
        },
        {
            "id": "h1um8lo",
            "score": 2,
            "text": "- People with very low income/wealth will basically not be fined for crime. This is a problem as it means either there is no disincentive/punishment and no restitution for the victim OR that you have to use alternate punishments like prison, which are probably much worse.\n- Whether fixed fines are fair depends on what you see the purpose of fines being. if you see them as punishments/deterrence, then you're correct. On the other hand, if you see fines as serving a restorative function, e.g: victims charges in the UK where the criminal pays X which then are given to the victim to make them whole, then it's not clear why two criminals who inflict the same damage to another person/society should be charged different amounts.",
            "title_similarity": "0.82121897",
            "sentiment_compound": -0.9862
        },
        {
            "id": "h1umu6q",
            "score": 1,
            "text": "I don't think scales fines can ever work in America, as the higher end of those fines flies right in the face of the 8th amendments excessive fines clause. Paying $50k for a ticket is excessive no matter how much money you have.",
            "title_similarity": "0.70902705",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h1unct2",
            "score": 12,
            "text": "So, ultimately, a fine is just repayment for whatever monetary value the government weighs your crime as. The idea being, like if you steal something, then obviously give it back, but you should also have to pay for the act of having stolen it, and the time the true owner was deprived of this thing as well. The idea, at least, be that paying the fine is roughly an equivalent to having never committed the crime in the first place. \n\nOf course, in modern times it’s considered more of a punishment, but ultimately we still have a core of that “repaying your debt to society,” which is why everyone has to pay the same for the same crime. I also believe that, in America at least, this is technically unconstitutional. But I don’t necessarily disagree with you either. I just think people who look at Final Fantasy or whatever and think, “yeah, this video game perfectly represents the problems of the criminal justice system,” probably haven’t thought about the issue very much.",
            "title_similarity": "0.8463836",
            "sentiment_compound": -0.9422
        },
        {
            "id": "h1unhz1",
            "score": 1,
            "text": "but what if a fine *is* a payment for an item?\n\nI'm just pulling numbers out of my butt here, but for instance, if the cost of cleaning graffiti off a wall is $200, then the fine should be about $200. if parking next to a fire hydrant causes about $X more damage to the nearby building if it is on fire, then the fine should be $X * (the probability of being caught for it, perhaps) * the probability of the building catching on fire during that time, or perhaps more.",
            "title_similarity": "0.7227827",
            "sentiment_compound": -0.8569
        },
        {
            "id": "h1uny2n",
            "score": 2,
            "text": "I bet you a lot of rich people would have more offshore bank accounts",
            "title_similarity": "0.59525126",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1uo1fl",
            "score": 1,
            "text": "Let's be honest, fines are not a deterrence. Even if they are oppressive. They are a local and state government revenue stream. Balancing fines around equal deterrence is like balancing jail sentences around the same. It doesn't work. We could balance both around equal impact to resources, for fairness? Rich people get bigger fines, and young people get longer jail sentences? After all, a year of jail time is worth far less to someone with (statistically) 60 more years of life than someone with (statistically) 5 more years.\n\nThe problem with equality is that there's a lot of ways to determine it. Giving everyone who transgresses the same punishment seems fair... unless you judge fair by equal % of income. Or equal % of disposable income. Or based on how historically impacted their demographic has been. Or any of a dozen other factors.\n\nSo what's fair? How much should we account for when trying to balance the scales? How much should we spend finding out? If it costs as much to administer the fine as we collect, is there even a point to do it?\n\nAnd even if we answer *all* of that... who do we trust to implement it? A politician? Imagine, of all the senators, representatives, and presidents for the last 20 years, the one whose ideology was most abhorrent to you. Do you trust *that* person to administer fairness in fine levels? Because somewhere, that person might be doing just that.",
            "title_similarity": "0.8059454",
            "sentiment_compound": 0.9449
        },
        {
            "id": "h1uo8xl",
            "score": 1,
            "text": "How much per income should be left to experts but yes",
            "title_similarity": "0.6692872",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h1uobw2",
            "score": 2,
            "text": "I feel like if this was in effect there would be some wealth discrimination going on. People in nice cars will be targeted for tickets for little shit like not doing a full stop and a stop sign or not using ur turn signal every time you turn. I know these are the law but I'm pretty sure just about everybody can say they don't always do full stop at stop sign. Cops would also stray away from low income cities as they would make less money off tickets, and low income cities is usually where most crime happens. This will result in a longer time for the cops to respond to a call in that area because they are all in the higher income areas which have a lot less crime.",
            "title_similarity": "0.79858696",
            "sentiment_compound": -0.9031
        },
        {
            "id": "h1uod3p",
            "score": 1,
            "text": "I've got two questions for you OP: \n\n1) Are fines a deterrent or a punishment? Is it a debt you're paying back to society for a transgression or is it supposed to be retributive for your actions to make you hurt because of the damage you've caused? It largely seems like you're arguing that fines are in place to hurt the people that break those laws more than it is to pay back a debt that's owed to society since the former would need to scale and the latter would be finite.\n\n2) What problem is this solving? Do we have a problem with rich people regularly accruing lots of tickets and fines that continue doing it because it's cheap? Is this harming society enough that we need to do something extra about it?",
            "title_similarity": "0.8118963",
            "sentiment_compound": -0.9742
        },
        {
            "id": "h1up70e",
            "score": 1,
            "text": "Fines aren't \"supposed\" to be a deterrent.\n\nInfractions have a distributed cost to society. As such, it isn't worth the time/money (note: same thing) for many/any people to correct or seek compensation for these sorts of wrongs to society. The government is the one entity with the mandate to distribute benefits to society. Fines are compensation to society for individual or group infractions.\n\nTHEY ARE NOT A DETERRENT.",
            "title_similarity": "0.74230933",
            "sentiment_compound": 0.2344
        },
        {
            "id": "h1upb9t",
            "score": 1,
            "text": "I think it would be better to do it relative to income. So you are fined in hours worked essentially.",
            "title_similarity": "0.78179264",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1uq0ld",
            "score": 1,
            "text": "Yh but then it’s a punishment for making more money",
            "title_similarity": "0.64269555",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h1uqkem",
            "score": 1,
            "text": "This is the epitome of a double standard, and ALL double standards childish.",
            "title_similarity": "0.33106852",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1ur4n7",
            "score": 1,
            "text": "Wealth is an arbitrary thing - you cannot establish how much wealth someone has. The best you can do is \"I THINK YOURE A BILLIONAIRE - GO PAY!!!!ONEONE!!!\"\n\nWealth as a quantifiable thing does not exist, and never will. Hence your idea that something can be in relations to wealth is impossible, because it would either mean everyone is fined $0, or that some random policeman can just make up a number and fine you whatever they seem fit.\n\nWhich is BS both ways",
            "title_similarity": "0.77088463",
            "sentiment_compound": 0.9711
        },
        {
            "id": "h1urji0",
            "score": 1,
            "text": "That’s not how government works. Lynnwood Washington put the fines for red light cameras at max penalty. 129$ or around that price point.",
            "title_similarity": "0.7084239",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h1usd6j",
            "score": 1,
            "text": "Fines shouldn't be legal at all. It is essentially forced labor as a means of punishment which is inhumane.",
            "title_similarity": "0.55562544",
            "sentiment_compound": -0.7629
        },
        {
            "id": "h1usheu",
            "score": 1,
            "text": "It's not any fairer to punish people more harshly essentially just because they're rich.",
            "title_similarity": "0.7347851",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1uu27y",
            "score": 2,
            "text": "I want to try to evolve your view with some ideas on crime and punishment I was exposed to in law school.  There is one theory of fining- the restitution theory, and there is another theory, the punitive theory.\n\nThe restitution seeks to set the fine at a level that undoes the damage that crime inflicted on society - thereby making sure the burdens associated with that infraction are properly assigned to those inflicting them on society.  Hypothetically, the size of these fines should roughly be the cost of administering and running a \"cleanup\" that undoes the crime divided by the number of fines given out, weighted to severity.\n\nFor example, littering.  Littering is bad - however, if its promptly cleaned up, it's not actively harmful.  So, we give out fines for littering set at a level that makes litterers undo the damage they cause to the space in which they litter.\n\nRestitution style fines are great for crimes where money can undo the damage, and the violation is easy for the violator, but, in a macro sense, can cause society a harm.  Littering is a great example of a crime that would work for a restitution style fine.  \n\nThese crimes probably shouldn't be tied to wealth.  You don't want to administer a 100k fine to someone (which could create some perverse incentives) for littering.  That fine isn't proportional to their share of the damage they inflict, and the fine isn't really there to punish the behavior in the tradition sense (it's there to either disincentivize or un-do the bad behavior).  \n\nThe other end of this is punitive fines.  These are usually for more severe crimes where discrete victims are harmed (think Murder, where the victim dies, or Robbery, where the victim loses both possessions and peace of mind).  For these crimes, the fines/penalties are set to be so severe that people will avoid creating victims.\n\nFor these crimes, even if money could \"undo\" the damage, that's not why we're fining them.  We're fining these behaviors at an absurdly high rate in order to *prevent them from happening*.  While we don't want littering, it's not a big deal if we have funds to unlitter the park.  We ***Absolutely positively want to prevent murders, rapes, and robberies***.  For these crimes, income/wealth fines make sense (although, usually this is expressed as a jail sentence), since their higher wealth means that a flat fine is less of a disincentive for that bad behavior.\n\nFor most bad behavior, there are elements of punishment and restitution in the spirit of the how the fine was set and administered.  Speeding tickets for example, really are about stopping speeding - but the funding goes toward local police and EMS - the services that do their best to undo the costs of the crime.  You may not want to go full punitive or full restitution for speeding - but a little of both.  A \"poor bracket\" ticket, and a \"rich bracket\" ticket - two or three levels of ticket (say, $100 for people earning less than 50k, $250 for people earning between 50k and 200k, and $1000 above that), to keep the ticket painful, but not destructive, while keeping proper incentives for police and EMS.\n\nAlso - on other issues - for a lot of punitive type penalties we use time-based penalties rather than money.  And, since everyone has as much time as they have, it has wealth built in.",
            "title_similarity": "0.77730167",
            "sentiment_compound": -0.9967
        },
        {
            "id": "h1uu7a6",
            "score": 2,
            "text": "I think the main issue is, as with most things, that the brunt of this will likely be carried by the middle class.\n\nIn the US, there are towns that make a lot of their money from speeding fines and the like; they simply don't make enough from taxes to make ends meet, so they set up speed traps everywhere. Since most cars are worth roughly the same amount to them, they are pretty indiscriminate in who they pull over (though with an increased effort in out of town/state tags, since fighting means coming back).\n\nIf you apply this logic nationally, you'd run into a bit of an issue. Cars would come in a few different categories:\n\n* Beat up cars would imply that the driver has low income/wealth, and the ticket may not be worth the time of the officer to even write\n\n* Affordable but newer cars (like a family sedan or minivan) would imply that they likely have some income, but not necessarily imply that they have enough to be able to hire a lawyer to fight the ticket\n\n* Much newer, more expensive, cars could imply several things, most of which don't make the ticket worth it. Are they rich and avoid taxes, therefor have no \"income\" to fine? Their ticket would be less than a poor person's. Or would the ticket be so much it would be worth the money to hire an attorney and fight the ticket tooth and nail? That might be too much work. Etc etc\n\nUltimately, it seems like the result would be a much more heavy handed enforcement, for monetary gain, against folks in the middle. Anyone driving a nice-enough car could very well see themselves being pulled over constantly for the influx of cash that would represent to the city and, likely, the police department. But may not the \"too nice\" cars, which would imply they'd have to fight for the ticket or risk getting nothing at all from it because of rich people accounting.\n\nHonestly, this solution does make me pretty nervous since I know that it will continue to not affect the rich at all, but could be absolutely brutal on the lower-middle income bracket.",
            "title_similarity": "0.8000365",
            "sentiment_compound": 0.818
        },
        {
            "id": "h1uug9a",
            "score": 1,
            "text": "This will mostly sum up my views and what I would state in changing yours:\n\nhttps://www.reddit.com/r/changemyview/comments/minlt1/cmv_all_fines_or_other_monetary_punishments/?utm_medium=android_app&utm_source=share\n\nSo this same suggestion was mentioned on here about 2 months ago. My take away was that while there were ultimately a handful of pros, there were *significantly* more cons overall.\n\nI understand that this isn't *me* changing your view, and I'm hoping this doesn't break any sub rules (if it does, it does) but have a quick browse for the sake of me not regurgitating long paragraphs already mentioned prior.",
            "title_similarity": "0.62471986",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1uv4c8",
            "score": 1,
            "text": "If you fine the wealthy proportionately alongside everyone else, so for example say a 5% rate of your yearly income, or whatever calculation methods you choose, those who are financially well off won't be hindered by the fine virtually at all. It's still unfair.\n\nIf you make brackets, and increase the percentage fined at each higher bracket, and say someone who makes $1M a year is fined 15%, all you're doing is damaging their income, and it leaves the chance for the wealthy to be less wealthy due to fines, alongside us going after them for more taxes (but that's another argument) in which lesser corporate growth causes more inflation of the US dollar and the price of goods and services, and with less wealthy individuals and companies, the US would slow its rate of developmental growth. That leaves room for other countries to exceed us in economic wealth, power, trade, and multiple other things.",
            "title_similarity": "0.7905241",
            "sentiment_compound": 0.9333
        },
        {
            "id": "h1uv5s9",
            "score": 1,
            "text": "Positive reinforcement is better at curbing undesirable behavior than negative reinforcement. \"Hey you did a great job let's reward you\" is much more effective than \"you fucked up, so now I take something from you.\" Our legal system is based on taking things from people. Robbing people of their resources just because you have the authority to is extremely abusive to the masses you claim to be protecting. If we use social science to deal with offenders the whole of society benefits. Eye for an eye is an archaic form of justice and reframing the eye as  resources is bullshit. We're human beings not money machines. For some reason we decided profiting off of people's fuck ups is better than looking out for everyone's well-being. People will break the law to be thrown in jail just so they have the bare essentials. A warm bed, 3 hot meals, access to hygiene, and protection from the elements. We wonder why repeat offenders are a thing",
            "title_similarity": "0.74175596",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h1uvq0w",
            "score": 1,
            "text": "\"Hey Randy how you gonna pay those fines?\"\n\"Straight cash homie\"",
            "title_similarity": "0.65603024",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1uw8v8",
            "score": 2,
            "text": "Lady Justice is wearing a blindfold. That matters a lot. Everyone is treated the same, regardless of their status, gender, age (assuming adults). This is a very important aspect of a fair and just society.\n\nAnd there is a practical problem.\n\nSome rich people don't have an income. The late Roger Moore was paid a symbolic salary of $ 1 per year when he was working for the U.N. Does that mean that his fines should be less than yours? Probably not.\n\nSo let's do it based on wealth. Let's say you and me are both working at McDonald's. Same age, same job, same salary. There is one difference: you rent your apartment, and I got a mortgage-free house through an inheritance. Does that mean that I pay more? Probably not as well.\n\nIt is impractical, unjust and unfair. I'm always under the impression that these posts just want to punish rich people more.",
            "title_similarity": "0.67570174",
            "sentiment_compound": 0.7302
        },
        {
            "id": "h1ux9iu",
            "score": 2,
            "text": "I have a few issues with this idea:\n\n1. Evasion. As others have said, rich people would find out what exactly classifies them in the top bracket, and then either move around money or something similar to avoid it.\n2. Police time and effort. This is a big one.  I don't really want our cops spending the majority of their time trying to prove X person has Y income and chasing them down over overpriced parking tickets instead of solving crimes that really hurt people, like murders and rapes. \n3. Perverse Incentives. Similarly, if cops know that the municipality gets more money by ticketing the rich, they will naturally start to target them. Oh, you're driving a Lexus? I think your taillight is out! You're parked an inch too far away from the curb!  This isn't fair to rich people, and again, just incentivizes the rich to look poor or face discrimination.",
            "title_similarity": "0.83758307",
            "sentiment_compound": -0.7986
        },
        {
            "id": "h1uxqbz",
            "score": 1,
            "text": "If they're really worried about a big fine. Then they shouldn't be doing anything wrong. Simple as. A punishment is there because you did something wrong. It's not fair that Dave who spent every last waking hour building his company to become well off to have to pay £100 for littering, whereas josh who's a little nitty living at his mums and working at McDonald's because he's a lazy little shit only has to pay £10 for littering. This might come off as a little rude, which I dont mean it to be, but hopefully you see my point. It's just not fair to do it that way.",
            "title_similarity": "0.7297401",
            "sentiment_compound": -0.819
        },
        {
            "id": "h1uyb6j",
            "score": 3,
            "text": "Most fines aren't actually designed to be punitive in nature, they are designed to compensate for the damage done by the offending action. For example, a person who parks over their time limit does the same amount of damage no matter what their wealth is. Your argument would only make sense for punitive fines, but then that's what community service is for.",
            "title_similarity": "0.77377844",
            "sentiment_compound": -0.8093
        },
        {
            "id": "h1uysy5",
            "score": 1,
            "text": "This system could influence ticketers to disproportionately hunt higher net wealth individuals and potentially ignore lower net income individuals to meet quotas or simply generate additional revenue.",
            "title_similarity": "0.75239635",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1uyz7z",
            "score": 2,
            "text": "Income or wealth?\n\nIf income, there are lots of people who have lumpy income and they will be penalized heavily if the fine falls on a high income year. Most wealthy people play lots of games to keep their income low, since they can avoid taxes that way, so their fines would not be fair in this system either.\n\nIf wealth, how do you measure it? Do you include your house? Your 401K is easily measured, but most other things don't come with a very accurate valuation. The wealthier you are, the more hard-to-estimate investments are in your portfolio.\n\nIf we are talking traffic fines, I would go with a multiplier of the KBB value of your car. Caught speeding? Pay 10% of the value of your car",
            "title_similarity": "0.8124813",
            "sentiment_compound": 0.9456
        },
        {
            "id": "h1uz77b",
            "score": 1,
            "text": "I agree that the rich should be fined more, but I don't believe it should be proportionate, as someone who earns millions is hardly going to miss, for instance, a 5% fine? \n\nEven better we could reinvent our justice system......",
            "title_similarity": "0.7981706",
            "sentiment_compound": 0.9216
        },
        {
            "id": "h1uz938",
            "score": 2,
            "text": "This practically won’t end well. If you start charging people tens of thousands or more for just the most baseline infractions, I can’t imagine the wealthy will care for the area.\n\nEither they will move away, meaning your new fine system just punishes the poor again. If I owed $50k for going 70 in a 65 I’m going to lawyer up.\n\nScrutiny and accuracy become very paramount and most likely the wealthy will still walk away generally unscathed. Additionally, income doesn’t tell the full story. $100k/yr is below the poverty line in the Bay Area for a 4-person household, but under this legislation presumably it would just affect those in poverty even harder (unless each city implements it their own way).",
            "title_similarity": "0.7787192",
            "sentiment_compound": -0.6147
        },
        {
            "id": "h1uze41",
            "score": 2,
            "text": "This wouldn't make sense on multiple fronts.\n\n1. Logistically tracking the income to proportionally fine would require an insane amount of tracking and verification for what would be a minor violation.\n\n2. The point of most fines are as deterrents, not to be fair.  Yes someone with lost of money can blow off minor fees because it's pocket change but that one person with the tesla double parked in a handicapped fire hydrant zone is the outlier, not the norm.  \n\n3. This would absolutely be abused.  Fines would no longer be issued on a basis on infraction but now on how I could get the most money.  Groups would now target nicer cars in the hopes of a better pay out, either because it looks good for promotions or because I get a cut/bonus.  One does not have to look to far for examples of government shakedowns/corruption once the money starts rolling in. \n\n4. Policies based on 'fairness' usually lead to exacerbating the unfairness.",
            "title_similarity": "0.8531211",
            "sentiment_compound": 0.262
        },
        {
            "id": "h1v01nv",
            "score": 2,
            "text": "Why?\n\nSpeeding is illegal because it is unsafe. If you're speeding multiple times/excessively, your license gets yanked, as the fines are obviously not deterring you from speeding - whether it's because you're rich enough to afford it, or you're poor and don't really give a fuck, isn't really the point.\n\nSo why is it important that these fines have the same financial \"impact\" (by whatever definition) between classes? What purpose does that serve?",
            "title_similarity": "0.83015937",
            "sentiment_compound": -0.7652
        },
        {
            "id": "h1v05yg",
            "score": 1,
            "text": "No we don't need more discrimination.",
            "title_similarity": "0.29306427",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1v08q3",
            "score": 2,
            "text": "Well with a parking fine, how can you determine someone's wealth? You can't just access someone's financial records, first off, no one would trust the government with that kind of information, as it is YOUR wealth, not theirs. Also fines should just be equal for all, you cannot discriminate based on wealth. Parking ticket to whatever else it may be is equal across the board, that is one of the fairer things about society. Why should someone who has little wealth get off with a HUGE mistake by paying a small fine, whereas someone with a lot of wealth could make a simple parking error, yet get a huge one, when in reality under the law, your crime is proportional to the punishment, no matter wealth or status. All you're asking now is a new form of discrimination, wealth based. I'm not rich, but even I think this is just another device to divide people with. Why complicate a system that works (meh) and replace it with a hugely complex system that requires even more people to figure out how much you owe for a simple fine??? Instead of a police officer giving you a speeding or parking fine, you now have a \"Show Up For Fine Date\" Where you may have a couple people hash over your taxes, audit you in the process, and THEN determine what you owe in a fine, rather than a blanket, $50 parking ticket for parking in a fire lane, or whatever. Honestly this is indeed a horrible idea, which only proves to divide us more based on wealth.\n\nLet me turn it around, if you had wealth and the guy next to you didn't yet you both did say 55mph in a 45mph zone, yet he only has to pay $150 and you pay $750, yet you both were going the exact same speed, is that fair? Same crime, different punishment. \n\nAdditionally, this would most likely go against the 8th Amendment and you'd have Civil Rights cases filed. 8th Amendment states Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted. And what you're suggesting would be excessive fines imposed on a persons.",
            "title_similarity": "0.86494195",
            "sentiment_compound": 0.9307
        },
        {
            "id": "h1v0n2c",
            "score": 1,
            "text": "All traffic fines should be community service despite how much money you have. Why? A $500 ticket can be paid easily by someone with money and they will continue to do the same stuff while a poor person probably has to have a payment plan or community service.  Also, traffic fines have a way of becoming supplemental incomes for city county and state governments and in some cases the main income coming in, that is just not ethical.",
            "title_similarity": "0.7634084",
            "sentiment_compound": -0.5271
        },
        {
            "id": "h1v0oi6",
            "score": 2,
            "text": "Paying a fine by wealth requires accurately knowing someone's wealth.  Which means the government, and everyone with acees to government information, now knows you exact wealth.  Which can be used to target you for political, economic, or nefarious reasons.   It means an enforceable way of knowing everyone's wealth has to be created and maintained.  Which would mean massively increasing the size of the irs or the fbi.",
            "title_similarity": "0.7337957",
            "sentiment_compound": 0.9393
        },
        {
            "id": "h1v12ei",
            "score": 2,
            "text": "Something that has not been mentioned yet.\n\nLet's assume that a coworker and I are driving home the same route and we both get caught speeding.\n\nWe're doing the same job, have the same hourly pay, but my buddy works part time because he lives alone, and I have to support my family, so I work full time.\n\nSo for him, the fine is 50% of mine, which means that the time I have to work to compensate the fine is double that of my coworker. \n\nBonus question: I have to support my family of four, he is only supporting himself. Who would the fine hit harder?",
            "title_similarity": "0.6173059",
            "sentiment_compound": 0.9618
        },
        {
            "id": "h1v2dz5",
            "score": 1,
            "text": "I love the idea and would love people to enforce it,however those with a lot of money would hid there wealth and be punished less",
            "title_similarity": "0.6950567",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h1v2ekm",
            "score": 1,
            "text": "I'm looking through the comments and not seeing the point I would make. Your view of fines is as a deterrent to an action, but there's another view that also makes sense: moral offsetting.\n\nLet's say you think that cutting down trees is bad. But you find a really nice spot to build a house, that just happens to have a few trees in it. You could say \"Well, I guess I should find a new spot.\" But you could also say \"I'll cut down these trees, and just make sure to plant an equal number somewhere else, leaving me neutral.\" In practice, since you might not know much about tree planting, or might not have good spot to plant them, or whatever, you might just donate to a charity that does reforestation. That would be moral offsetting.\n\nSo, if the fine for illegal parking is less to deter you from parking there, and more to pay for the cost of towing your car, plus something extra as an estimate of how much inconvenience you caused people by making the road harder to drive down or whatever, then the fine is a required moral offset.\n\nIn this view, adjusting for income is weird. If someone cuts down 3 trees to build a house, and we say it's ok to do that if you replant trees elsewhere, why would the amount of trees you have to replant have anything to do with how much money you make, instead of just how many you cut down?\n\nJust to clarify something, the law is kinda a mess, and I would be very surprised if the values of fines were very consistent with the exact cost to society you have to offset. But I would also be very surprised if they were very consistent with exactly how much we want to deter things relative to each other either. I imagine in reality it ends up a combination of both: even if we didn't care much about illegal parking, the fine wouldn't go less than what it costs to tow the car.",
            "title_similarity": "0.64407396",
            "sentiment_compound": -0.8494
        },
        {
            "id": "h1v2syx",
            "score": 2,
            "text": "This would wreak havoc on incentives.\n\nI used to live in a city with recently-installed red light cameras. In the 5 years I lived there, I got somewhere over a dozen tickets from those cameras. It was later revealed that the length of the yellow lights had been dropped simultaneously with installing the cameras, and this was explicitly an attempt to generate revenue--which worked, it became a major revenue stream for the city. I'm convinced it reduced public safety, because the natural reaction is that people would _slam_ on their brakes to avoid getting a $300 ticket (so imagine what they'd do for a $20k ticket).\n\nI would worry that if cities looking at a much-increased revenue stream due to huge penalties, you could easily end up with shorter yellows, poorly-marked an arbitrarily low speed limits (another issue I had in <city>), [deliberately-unclear parking rules](https://i.imgur.com/446NAZJ.jpg), persnickety enforcement (oops, wheels insufficiently angled while parking on a light slope, that'll be $7k), etc.\n\nOTOH, that problem might be corrected by another side-effect this would have: if a person has a $20k ticket and the means to pay it, they'll also have the means to fight it. Now, people will grump a bit and pay their parking ticket, but if the price tag was the same as hiring a lawyer to contest the ticket for a couple months, I suspect you'd see a hell of a lot more court battles over simple tickets. You'd gum up the system with pointless fights over tickets.\n\nAlso: I would go out of my way to avoid a city where I got a parking ticket for several thousand bucks, even if, sure, I do have access to the funds to pay. I live in a suburb, but often head downtown for dinner and a movie or whatever (pre-pandemic, anyway). Such high fines could drive away business and engagement that (North American) cities are trying hard to encourage in their city centers.\n\nYou said it would be based on income. You realize that would mean that Jeff Bezos (with his $10k annual salary or whatever) might end up paying $10 for his tickets, right? Or would you base the ticket prices on net worth--in which case, would you have to get your house assessed whenever you got a ticket, to make sure you hadn't slipped into another fine bracket? That would also mean that middle-class grandparents who were nearing retirement (with a house, a 401k, some investments, etc) would get hit really hard, whereas reckless 20-year-olds would get off lightly. We don't really track net worth now, so that would be a fundamental change.\n\nFinally...what problem are you trying to solve? Are well-off people really violating the laws at higher rates because they're not as impacted by the fines? I've definitely seen badly-parked BMWs, but...I've also seen a hell of a lot of badly-parked beaters, too. I don't really see an epidemic of scofflaw rich people. Personally, I'm definitely a better and more careful driver now than I was while living paycheck to paycheck, and ticket price doesn't really factor into it. I'd just rather not have to deal with tickets or police stops. If there was evidence that traffic accidents were disproportionately caused by people with a high net worth, it might be a problem worth tackling. Otherwise I'd have a hard time getting excited about it.",
            "title_similarity": "0.6681148",
            "sentiment_compound": -0.9075
        },
        {
            "id": "h1v2uo6",
            "score": 1,
            "text": "The police would then target better looking cars/nicer dressed people over people that don't have as nice of things because the state would get more money because if they can afford those things they obviously have a higher income.  Targeting is my counterpoint",
            "title_similarity": "0.76303005",
            "sentiment_compound": 0.1451
        },
        {
            "id": "h1v47k5",
            "score": 1,
            "text": "Question: how is this different from encouraging low income people to commit crime?  When you've said explicitly that they will get a discount on the punishment for doing so.\n\nI think the fairest system is one where the fine is not designed to change someone's behavior, but designed to remedy the problem caused.\n\nSo you parked in a handicap spot?  The fine should be determined based on the 'cost' of having a handicapped person have to walk from the middle of the parking lot.  You stabbed someone?  You should cover their medical bills, any lost wages, and (if you caused permanent injury) an amount representative of their lowered quality of life.\n\nIf you feel the need for punishment for the sake of 'prevention' (which is a dangerous slope to slide down), use the prison system.  All people have (approximately) the same number of days.  Take those away if that's your goal.",
            "title_similarity": "0.8023525",
            "sentiment_compound": -0.9781
        },
        {
            "id": "h1v4zef",
            "score": 1,
            "text": "I don’t think there’s any way to make a fine fair at all. If you make $1000 a month, taking away 5% of that in a fine will mess someone up who isn’t financially stable. Take away 5% from someone who makes 100k a month and sure, they lose a ton of money but it in no way will affect their quality of life. \n\nYou also can’t just take away all but $950 of the rich person’s income because it still will barely affect anything. \n\nI doubt there is any effective way of fines that will actually punish people equally.",
            "title_similarity": "0.7213918",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1v6wdi",
            "score": 1,
            "text": "Don't use financial fines at all it only affects the poorest and usually in the worst ways, people of middle incomes slowly recover and people of higher income don't feel the hit.\n\nInstead handout community service orders that need to be done mid week. Higher earners will probably lose a larger chunk of money suffer more shame having to get the time off of work and lose holiday time, it is a much longer and impactful punishment, particularly if they are forced to work in a large gang of other law breakers and uniformed.",
            "title_similarity": "0.72644556",
            "sentiment_compound": -0.9732
        },
        {
            "id": "h1v759k",
            "score": 1,
            "text": "I think a factor that not many people have mentioned is that poorer people are significantly more likely to have to smaller fines such as parking tickets. For places like a downtown areas it’s easy for a rich person to just rent a parking spot for the day, or likely own the entire lot for their business. But a poorer person might not be able to afford expensive parking and have to find alternatives that could result in a ticket. \n\nRich people probably won’t get a speeding ticket when they are being driven by a chauffeur or an Uber. They aren’t going to be punished when they are late for work so they don’t need to drive fast. \n\nRich people have access to lawyers who can fight off fines easily.",
            "title_similarity": "0.7909069",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h1v7p2f",
            "score": 1,
            "text": "Parking fines are set by private companies usually, so they charge what they want. Speeding fines I'm the UK for example are proportional to monthly earnings.",
            "title_similarity": "0.7581948",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1v83qg",
            "score": 1,
            "text": "Repeat offenses should be doubled every time.",
            "title_similarity": "0.39809486",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1v8bk7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.12137998"
        },
        {
            "id": "h1v9xm5",
            "score": 1,
            "text": "We should have penalty brackets like tax brackets, that’s my take",
            "title_similarity": "0.6775409",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1vangc",
            "score": 2,
            "text": "Why not apply that to prison sentences as well? Young people should get longer sentences since they have more time.\n\nA better solution would be to remove any fines and make all legal punishments either jail or community service.",
            "title_similarity": "0.6260717",
            "sentiment_compound": 0.3321
        },
        {
            "id": "h1vasue",
            "score": 2,
            "text": "I thought you wrote \n\n\"Fitness should be proportional to someone's weight\"",
            "title_similarity": "0.4541185",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1vbi9r",
            "score": 3,
            "text": "I swear this was posted last month",
            "title_similarity": "0.16942893",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1vceuk",
            "score": 1,
            "text": "I don't hate your way of thinking, even though it's not quite logical as others have pointed out, but hypothetically, can we not discount the charge for people who break the rules because they are married or have kids - like tax breaks?  The fees should be higher if you have kids because you're responsible for teaching them to do the right thing.",
            "title_similarity": "0.73824644",
            "sentiment_compound": 0.8019
        },
        {
            "id": "h1vctwp",
            "score": 1,
            "text": "Please tell the SEC this. Thanks.",
            "title_similarity": "0.14857021",
            "sentiment_compound": 0.6883
        },
        {
            "id": "h1vdt9y",
            "score": 1,
            "text": "This would make wealthy people become targets. Police departments would invent fines to target the rich so they could get more money.\n\nI know that sounds like a \"big whoop\" kinda situation, but it is unfair for any group to be disproportionately targeted.",
            "title_similarity": "0.8210124",
            "sentiment_compound": -0.09
        },
        {
            "id": "h1vf7v1",
            "score": 1,
            "text": "What is the purpose of a fine (for something like a parking ticket)? Is it to be punitive? Is it to be retributive? Is it simply to be disencouragement? What is your specific view on that issue of public policy?",
            "title_similarity": "0.7256613",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vg5x3",
            "score": 1,
            "text": "What are you trying to accomplish with these parking (and other) fines?\n\n1. Are you trying to get people to park in ways that don't endanger or inconvenience their neighbors?\n2. Are you trying to fund your city's operations budget using parking fines as a major source of revenue?\n3. Are you trying to get reelected to city council by appealing to the retirees, or the yuppies, or the soccer moms, or the police union, or the guy who writes letters to the editor in green ink, or some other contingent?\n4. Something else?\n\nIt's important to distinguish between #1 and #2. *If everyone just started following all the parking rules all the time, and nobody got fined at all, would that be a problem for your plan?* If you're expecting to fund the playground upgrades by charging an arm and a leg to the dumbass out-of-towners who don't know how to park, then you *don't* want them to suddenly learn how to not get any fines!\n\n(I mention this only because some towns actually do try to do #2 there. #2 is evil; don't do it.)\n\nIt's also important to distinguish between #1 and #3. Whose interests are you counting when you devise the parking rules and the fine structure? Is it intended to prioritize the drivers from the suburbs over the pedestrian downtown workers? Is it intended to ensure that people who drive home from work can get parking near their house, or does it care more about keeping blue-collar cars out of sight of the real estate agents (and the property values)? ADA? Bikes? Do you stereotype skateboard and scooter commuters as annoyingly rich tech nerds, or as delinquent kids who skip school to fight and stick bubblegum on things? Can people park a bike in your town for thirty minutes without coming back to a bare frame?\n\n(Not you personally. The theoretical team that's coming up with the rules.)\n\nAgain, if you could magically get everyone to park nicely all the time, then there would be no fines. Maybe there is some clever way to draw the parking spaces that just makes people be all chill about parking and not do dumb things ever.\n\nSo then the question is — why *do* people park in ways that get fined? Is it because they expect to get away with it? Is it because they see everyone else doing it, so it feels like selective enforcement when they *do* get a ticket? Is it because there's literally no legal place to park within a quarter mile of the address to which they have to haul an awkward package? Is it because the signs are all bent and covered by a tree and the paint on the curb is all worn off or covered by snow?\n\nIs it just to be dick? Is it because they're afraid of getting yelled at or fired if they're five minutes late?\n\nIs it because there's literally no way to get that many cars in and out of downtown at lunch hour without something having to give, and most folks really should not have to drive most days just to get their ordinary stuff done?\n\nWhatever it is you're trying to solve, I have to wonder if diddling the numbers on the parking fines is actually the way to accomplish it.",
            "title_similarity": "0.6972092",
            "sentiment_compound": 0.8093
        },
        {
            "id": "h1vgjpl",
            "score": 1,
            "text": "For minor fines such as parking tickets, it's simply not practical to determine a persons income before writing a ticket. So those fines are fixed. If it is a fine decided by a court, it is possible and at least in Germany it is also done that way.",
            "title_similarity": "0.78213656",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1vglp7",
            "score": 1,
            "text": "I suppose you could make the fine based upon how much hardship you inflict on the perp. A person making $1000 a month might have to pay $50, which could mean they don’t eat for a day. So set the fine to take enough money away from anyone so that becomes the result. If you make $1M per month, your fine becomes $999050, leaving you with the same amount as the poor guy.\n\nOf course, this is impossible.",
            "title_similarity": "0.75424546",
            "sentiment_compound": -0.2815
        },
        {
            "id": "h1vhcf3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10924664"
        },
        {
            "id": "h1vi662",
            "score": 1,
            "text": "I feel like its hard to decide if someone should have to pay the same as everyone else or if they should be impacted like everyone else.",
            "title_similarity": "0.590099",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1vip9z",
            "score": 2,
            "text": "Sorry I'm too late, but I wanted to share this thought anyway.\n\nNot everyone's earnings are consistent from week to week or year to year. A farmer, for instance, might make all their money in one month, then not earn anything the rest of the year. They might have a bumper crop one year, then lose everything to drought the next.\n\nI think Dave Foley has famously talked about how the Canadian child support system has screwed him over. When he got divorced, he was the star of the sitcom News Radio. He was ordered to pay his ex-wife child support based on his earnings at the time. He had to continue to pay his ex-wife huge sums long after his News Radio gig was over. He couldn't sustain it, but they wouldn't revise the number.\n\nImagine someone making a million bucks in the stock market on a meme stock like GME, cashing out, spending it all on a house downpayment or something. Then getting a parking fine for $10k since their tax records show they make \"millions\". And now they have to take out a huge loan to pay off the parking fine.\n\nRules like the ones you are proposing often get made with particular people in mind, but then end up with far more casualties than intended.",
            "title_similarity": "0.6313468",
            "sentiment_compound": 0.9269
        },
        {
            "id": "h1vjidg",
            "score": 2,
            "text": "You are entitled to equal protection and equal application of the law.\n\nAn income based fine inherently infringes upon said right, as you’re punishing the individual for earning more money. Not for committing a more serious crime",
            "title_similarity": "0.823513",
            "sentiment_compound": -0.7425
        },
        {
            "id": "h1vjua9",
            "score": 1,
            "text": "They do this in Finland, it makes sense.",
            "title_similarity": "0.23784813",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vk3ru",
            "score": 1,
            "text": "This is the way fines are calculated in Finland.",
            "title_similarity": "0.4909365",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vklte",
            "score": 2,
            "text": "If we are going to punish people who have \"more\"...\nShould 18 year olds receive a longer prison sentence than 50 year olds, because they have more time to live?",
            "title_similarity": "0.6417907",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1vks01",
            "score": 1,
            "text": "Its not punishment, if it were punishment it would suggest that they want you to be sorry and not do it again. But they don’t care if you’re sorry and don’t care if you do it again because they will fine you again",
            "title_similarity": "0.5719613",
            "sentiment_compound": 0.8769
        },
        {
            "id": "h1vlbbi",
            "score": 1,
            "text": "Time is equal an hour of any ones time is an hour out of their life fines should be replaced with community service up to the fine amount at min wage.",
            "title_similarity": "0.58094823",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1vllxd",
            "score": 2,
            "text": "If youre rich a fine is only a pay for the pleasure.",
            "title_similarity": "0.6569874",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h1vn8x0",
            "score": 1,
            "text": "After a certain limit.\nOtherwise poor/broke people will just keep on committing fraud.\n\n\nEDIT : No it won't I guess , After seeing another comment, my logic seems flawed.",
            "title_similarity": "0.67363155",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h1vnp8f",
            "score": 1,
            "text": "You either intentionally or unintentionally just identified a really cool appendage of the Law&Economics approach to punishment. I'll try and lay out the L&E argument for non-proportional (and therefore nominal) punishments. I'll use the example of speeding, especially because the Finnish have implemented a system of proportional payments in relation to speeding fines which might help you envision the efficiency discrepancy: https://www.weforum.org/agenda/2018/06/in-finland-speeding-tickets-are-linked-to-your-income/#:~:text=In%20Finland%2C%20speeding%20fines%20are,day%20fines%20they%20will%20receive.\n\nAssumptions:\n1) There is a \"right amount\" of speeding, e.g. where the social cost of one more person speeding (in health, money, damages, etc.) is equal to the benefit of one more person speeding (speeding a woman in labor to a hospital is a net good).\n2) A traffic fine is nothing more than an excise tax. It might be better to think of it as an 'expected cost' of speeding.\n3) without speeding tickets, speeding-related injuries would constitute an externality, where the victim has no say in whether the speeder speeds.\n\nEconomic efficiency is achieved when all costs of a transaction are internalized by the agents in an interaction. Econ 101 teaches us that taxes (or subsidies) can be used to internalize externalities. Gas taxes would be a great example of this, where each person would pay for both the carbon and the damage they do to the environment (through the tax). Similarly, by 'taxing' speeding with a discreet amount, we ensure that damages caused by speeding are internalized in the decision to speed while maximizing the utility gained from speeding. If we hook the cost of speeding to income, then we don't achieve the optimal amount of speeding because people then speed based upon their income rather than the actual cost of speeding.",
            "title_similarity": "0.7378796",
            "sentiment_compound": 0.708
        },
        {
            "id": "h1vpfpr",
            "score": 1,
            "text": "Parking tickets (and other tickets where the actual driver isn't identified) could be proportional to the value of the vehicle in some way.",
            "title_similarity": "0.6709422",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1vpyf1",
            "score": 1,
            "text": "You shouldn't punish people for succeeding at life.",
            "title_similarity": "0.47493398",
            "sentiment_compound": 0.7163
        },
        {
            "id": "h1vq1ot",
            "score": 2,
            "text": "So a retired grandma with a 40k a year retirement and her house owned outright should be fined 5000 for going 5 over the speed limit, while an employee of mine who earns 110k a year but only owns his 2000 car, gets fined 4 dollars? And no, that isnt a hypothetical employee.",
            "title_similarity": "0.57529175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vqchx",
            "score": 1,
            "text": "Wealth is how much you have. Net income is how much you earn. Don't conflate the two or you're gonna have a bad time.",
            "title_similarity": "0.757907",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1vqgzm",
            "score": 1,
            "text": "Nah man they’re all committing the same crime and if u don’t have any money u also shouldn’t park there",
            "title_similarity": "0.6882118",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1vspe7",
            "score": 1,
            "text": "You are viewing the fine purely ad a deterrent. There are graduating scales for repeat offenders for some fines. However, an aspect of the fine is paying off your accrued debt to society. In your example of parking or similarly littering, you are essentially paying for the damages caused, indirectly or into infrastructure or cleaning crews. A poorer person paying a lesser amount would not result in fair compensation back into these services.",
            "title_similarity": "0.8544682",
            "sentiment_compound": -0.8299
        },
        {
            "id": "h1vy2gj",
            "score": 1,
            "text": "Rich people: that's communism",
            "title_similarity": "0.45806983",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1vy7uj",
            "score": 1,
            "text": "We have this in Norway in relation to traffic violations (severe speeding at least).",
            "title_similarity": "0.5062796",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h1vyxqc",
            "score": 1,
            "text": "We most likely do not have free will. So any fine for a crime is unfair since we aren’t truly responsible for the crime.",
            "title_similarity": "0.720337",
            "sentiment_compound": -0.7596
        },
        {
            "id": "h1vz6ss",
            "score": 1,
            "text": "Yeah proportional to wealth and proportional to disposable income are not the same. The latter, although more fair sounding at first, is completely impracticable because \"disposable\" is a qualitative word. Not quantitative. The intrusion one would have to endure to be checked against any reasonable criteria would far out weigh the precieved extra fairness gained.\n\nPhilosophically speaking however I also disagree. Fines are usually implemented as a deterrent against civil disobedience. Violation of parking conditions, littering and such. Not murder or treason. With this in mind I would say the level of badness that fine incurring behaviours posses can be measured without any crazy conclusions. Unlike trying to quantify human life for example. So if we accept that the level of financial penalty represents the severity of the misbehaviour then it is surely fair for that to hold constant in all cases. The level of harm created by over staying a car park in a Ford is equal to that of overstaying with a Ferrari. You could even argue quite reasonably, in my opinion, that if a fine is a punishment then legally ascertained wealth is a reward. Even if it is inherited. The original earner is entitled to pass that benefit to whomever they decide. It is their's. Surely a greater reward should go further.",
            "title_similarity": "0.8151255",
            "sentiment_compound": 0.9865
        },
        {
            "id": "h1vzq8s",
            "score": 1,
            "text": "In Finland speeding fine amount is determined by person's income. And IIRC some other penalties too. That's why the world record of greatest speeding ticket is held by a finnish billionaire.",
            "title_similarity": "0.72303236",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h1w0jvd",
            "score": 2,
            "text": "If your fine based on how wealth I am, then you are discriminating me.\n\nIf your fine based on how much I earn, I will be the company of CEO with income of 1000 while receiving money from another source.",
            "title_similarity": "0.710379",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h1w0vk4",
            "score": 2,
            "text": "The law shouldn't discriminate and should be applied equally to all citizens. Equal application of the law. If you tried to get equal effect, as an example, you'd have to make Lebron James wear big iron boots when he plays basketball.\n\nWe didn't always have an income tax in the US, either. The argument over progressive or regressive or flat income tax is moot because the whole idea is unconstitutional.\n\nIt is none of the state's business how much \"wealth\" someone has, if you can even get 2 policy makers to agree on the definition of \"wealth.\"\n\nWe all complain about unjust wars and drone strikes and then go champing at the bit to give them more money and power.",
            "title_similarity": "0.7461139",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1w2jlv",
            "score": 1,
            "text": "Fines should be proportional to the damage done to society by the action. If a rich person speeds, they don't do 1000 times more damage than a poor person who speeds. Their actions are the same, the risks that come with their actions are the same, and so their fine should be the same.",
            "title_similarity": "0.80370826",
            "sentiment_compound": -0.7363
        },
        {
            "id": "h1w3ey4",
            "score": 2,
            "text": "How do you track someone's actual net worth? Does my house count towards my net worth? Does my car count? My investments? Or just the money sitting in my bank account? What if I withdraw money and hold onto cash? Do we just go off how much money I make? Net worth is nearly impossible for someone else to figure out, and to have an actual chance at doing so would require a significant amount of man power and government oversight. It is likely people with money would hide it, just like they hide it for tax reasons now. So it would really only hurt people without money. The amount of man power required to track everyone's worth would almost certainly make it too expensive and not worth the effort or money.\n\nMaybe fined should be paid with community service. Time has similar value to everyone regardless of wealth. Also the community gets a small upgrade.",
            "title_similarity": "0.8352099",
            "sentiment_compound": 0.8962
        },
        {
            "id": "h1w4e2z",
            "score": 2,
            "text": "Punishment?  They already do this even if you haven't broken any laws. They do this in terms of tax brackets. \nHell, even car registration is more for a newer, more expensive car. Doesn't make any sense since the newer car use the road just as much as any older car. \nIf a billionaire wasn't paying attention and goes over the speed limit, he pays $100k for his ticket. Someone living on welfare pays $20. The guy on welfare wouldn't give a fuck and will speed every chance he gets. It's only $20. The billionaire will be afraid to ever drive again. Makes  no sense.",
            "title_similarity": "0.77903426",
            "sentiment_compound": -0.5568
        },
        {
            "id": "h1w4ls5",
            "score": 1,
            "text": "I think the biggest problem with that is privacy. I don't think GDPR would allow any company (since parking fines are mostly issued by private or half-private companies where I live) to know even my wealth bracket and I also don't believe that I would like them to know. The other problem is students who do not have a stable income nor any reall wealth but still get caught on public transport without a ticket. Do they not pay at all? Or do they get in the lowest bracket? Either way, someone will get angry.",
            "title_similarity": "0.7305406",
            "sentiment_compound": -0.8564
        },
        {
            "id": "h1w5133",
            "score": 1,
            "text": "Late fees and late penalties piss me off. I told these toll people I was recently unemployed. How do fees and penalties make that situation any better? And they’ll intentionally mail the late notice late. You get the damn notice 2 days after the window expires.",
            "title_similarity": "0.65855455",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1w5jw0",
            "score": 1,
            "text": "purely a socialist pipedream that will never be implemented, imo",
            "title_similarity": "0.33447433",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w6egw",
            "score": 1,
            "text": "I know this lesson better than anyone. I went to college downtown in a city center. I made hardly any money as an undergrad and I was always getting bled with parking fines because sometimes you had to park your car where there was room—and then sprint to class so your professors who took roll wouldn’t ding your attendance grade—and sometimes there’d be a strange rule like you couldn’t park in a certain spot on a Tuesday after 10am. These rules were almost written as if to make sure at least some people would pay the fine out of ignorance, because on the other side of the street (which looked exactly the same as the other side) there would be no such rule. So even after depositing hours worth of coins in the meter, the meter maids wouldn’t give you any grace at all if you were ignorant of one of these stupid rules on your way to class. They’d still write you a ticket for the full amount of the fine. And when you got back to your car all you could do was rage. In a bad month I might have to pay a couple hundred dollars worth in $25, $35, or $50 fines.  \n\nThe trouble with fines (like speeding/parking citations) is that municipalities often look to them as revenue generators to support runaway social spending. I imagine this has already been said by one or more of the 4 delta laureates, but, you can imagine the runaway incentive there would be to fine people with higher incomes or net worth into oblivion. They’d be like the geese that laid the golden egg to every cash strapped municipality. These earners would never want to work or plant roots in your town, and they’d avoid traveling in the area to save their money. \n\nSmall changes to the system would be helpful extremely healthy ones. I’m not for adjusting fines according to wealth or income but I am in favor of giving poor people (like I was—and sort of still am) a fucking break on the fines when they can demonstrate they have few assets or very low incomes, whereas higher earners be charged the full rate. If you want to punish the real scofflaws you could also tier the fines according to how often the rules are infracted by a particular person. Make the appeals process easier for low income/low net worth people. As it is now the departments or private contractors who handle and process the fees have no sympathy at all when you tell them “the money from the fine is going to feed me or pay for my prescription meds because I’m not insured.” Even a break in how quickly the fine is due or in whether it can be paid in installments could be a big deal for low earners.",
            "title_similarity": "0.66661143",
            "sentiment_compound": 0.9749
        },
        {
            "id": "h1w6vfm",
            "score": 1,
            "text": "Depends if you view fines as punitive or penance.  Is it forcing someone to give back because they caused some negative externalities to the public, or is it disincentivizing destructive behavior.\n\nImo, some fines are punishment, some are penance. Traffic violations are trying to discourage you, whereas, say, a fine for breaking some government property (even if it was an accident) is more about helping to pay for the damage you caused.\n\nI guess most fines are probably a bit of both, but for fines which are primarily for repairing the damage of a person's actions, what matters is covering the cost of remediation, not hurting the perpetrator.",
            "title_similarity": "0.8068925",
            "sentiment_compound": -0.8815
        },
        {
            "id": "h1w7ef5",
            "score": 2,
            "text": "I think the only major problem with your idea is it would be hard to put on a small sign post",
            "title_similarity": "0.50666535",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h1w8ao7",
            "score": 1,
            "text": "Look up speeding tickets in finland",
            "title_similarity": "0.52861214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w8bvq",
            "score": 2,
            "text": "I would challenge your view in that we should do away with fines altogether.\n\nRather than giving police departments and local municipalities incentive to favor enforcement on minute infractions like speed limits or brake lights, what if police *actually* spent their time protecting and serving?\n\nIf someone is speeding, but not to the point where anyone is in danger, cops should pull them over and tell them to slow down, check everything out, log the encounter. At the end of the year, when you're doing your taxes, you tally up your 'infraction' stops and past a certain number of \"warnings\" you get a higher tax burden. Those funds are then sent to the appropriate municipalities. \n\nThat way cops can't pull more people over if they want a new cruiser for the department. It may end up being spent on books in the library instead.",
            "title_similarity": "0.8172742",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h1w8dqc",
            "score": 1,
            "text": "Don't forget that this also depends on if the law and fine are applied to everyone equally without favoritism.",
            "title_similarity": "0.67532706",
            "sentiment_compound": 0.2378
        },
        {
            "id": "h1w8yaq",
            "score": 2,
            "text": "In the same vein, should sentencing crimes also be proportional to estimated lifespan remaining?\n\nBecause a 90 year old is going to feel a 5 year sentence way more than a 18 year old.",
            "title_similarity": "0.53065586",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1w9ahf",
            "score": 1,
            "text": "In Switzerland speeding tickets are proportional to your wealth.\n\nUnder a certain excess speed everyone pays the same (10 CHF per each Km/h over the limit). After a certain point you face more serious penalties (you lose your license for X months, you face trial but no jail, you go to jail) and you pay a fine calculated by Km/h in excess-your income.\n\nThere is a legend that a Swedish millionaire paid 5 millions CHF for going 200 in a 120 km/h motorway.\n\n(1 CHF = 1 USD more or less)",
            "title_similarity": "0.66650426",
            "sentiment_compound": -0.0378
        },
        {
            "id": "h1wa47s",
            "score": 1,
            "text": "Agree 100%",
            "title_similarity": "0.087844834",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1wael1",
            "score": 1,
            "text": "The CHP would just hang out in bel-air and ignore the rest of the state because of the disproportion of fees.",
            "title_similarity": "0.6314012",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1wajch",
            "score": 1,
            "text": "Fines are the elites way of staying out jail, and the poors way of getting thrown in jail. \n\nF fines",
            "title_similarity": "0.60025287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wb0p3",
            "score": 2,
            "text": "Why should a successful person, who contributes far more to society than a typical person, be more harshly penalized for doing the same action with the same negative effects as a typical person doing the action? That's utterly discriminatory, and even worse it is towards those in a society that are actually contributing to society and being rightly compensated for it.\n\nHaving a single small fine be enough to send your financials into the toilet should be a wakeup call that you need to start working harder and/or smarter and/or be less unwise with your spending habits. If more people looked to themselves when trying to fix a problem, there would be much more happiness in the world.",
            "title_similarity": "0.76268655",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h1wb13t",
            "score": 1,
            "text": "If a billionair has to pay 50% of their wealth they still have at least 500 million dollars, they're functionally just as rich. Take the same proportion from a guy who's living paycheck to paycheck working $10 an hour and suddenly he can't pay rent and gets evicted. It's not that black and white.",
            "title_similarity": "0.58136046",
            "sentiment_compound": 0.7715
        },
        {
            "id": "h1wbyck",
            "score": 3,
            "text": "I forgot where I got this from, but here's a quote:\n\n\n\"If the penalty for a crime is a fine, then that law only exists for the lower class.\"",
            "title_similarity": "0.6892233",
            "sentiment_compound": -0.8847
        },
        {
            "id": "h1wcce7",
            "score": 1,
            "text": "Fines in and of themselves are a bad idea because they inherently allow more wealthy people to get away with more (which your proposal seeks to rectify), but they also actually make many people feel that whatever they did to earn the fine is okay if they just pay the fine, so they don't even really deter the fined act regardless of proportionality.",
            "title_similarity": "0.8045037",
            "sentiment_compound": 0.6424
        },
        {
            "id": "h1wcqg1",
            "score": 1,
            "text": "Wouldn’t the rich just use loopholes like they do now to avoid income tax? Or would income be measured differently than it is for tax purposes?",
            "title_similarity": "0.8295513",
            "sentiment_compound": 0.644
        },
        {
            "id": "h1wdbcy",
            "score": 3,
            "text": "A level of fine to make someone with with \"millions in the bank\" care about the fine would almost certainly violate the [Excessive Fines](https://law.justia.com/constitution/us/amendment-08/02-excessive-fines.html) clause of the 8th Amendment. You would have to repeal that, and the juice is just not worth the squeeze on that point. The 8th still does good work curbing the worst excesses of both civil fines and civil asset forfeiture (see: [Timbs V Indiana](https://www.scotusblog.com/2019/02/opinion-analysis-eighth-amendments-ban-on-excessive-fines-applies-to-the-states/)).",
            "title_similarity": "0.83900434",
            "sentiment_compound": 0.5602
        },
        {
            "id": "h1we9g5",
            "score": 1,
            "text": "I think you’re wrong because if the punishment is to be proportional, you need to get it to be in line with what someone values. \nIf you’re poor, money means a lot. Taking that money away in a fine is a great idea as a deterrent therefore as that individual wouldn’t want to do it again.\nBut you’re wrong on financial proportionality. If I earn a million a month, as it’s been shown, you’ll lose a number that will seem large to some, not to others. But it’s just another bill, will be resented but not remembered as a lesson and have little impact on their lives as next month, another full million comes my way. Someone with large incomes and wealth value other things to money, as money isn’t the worry (there is a well known pyramid that describes what people value called Maslows hierarchy). Time. Quality of life. Freedom. Take away something proportional to what the individual may consider as valuable. Easily discovered with a little digging into lifestyle or expenditure, which the courts would do if establishing affordability for a fine anyway.\n\nSimple, effective, proportionate.",
            "title_similarity": "0.868453",
            "sentiment_compound": 0.9571
        },
        {
            "id": "h1weuur",
            "score": 2,
            "text": "Great idea in principle, in practice the upper limit ends up being what the average person thinks would be a lot of money, but actually it doesn't match the most wealthy.\n\nAlso, very wealthy people hide their wealth, in particular their salary is insignificant compared to their other sources of income. Your example of tax brackets highlights this exactly: very wealthy people are not concerned with income tax, they are concerned with capital gains tax (and the endless amount of loopholes available in that system).\n\nUltimately, this kind of rule ends up punishing relatively poor people (those that earn <$200k a year) rather than actually extracting fair fees from those who horde wealth.",
            "title_similarity": "0.8155801",
            "sentiment_compound": 0.9284
        },
        {
            "id": "h1wf20c",
            "score": 1,
            "text": "What if you don’t know how much a person makes?  If they didn’t pay taxes are they free from paying fines?",
            "title_similarity": "0.77435875",
            "sentiment_compound": 0.504
        },
        {
            "id": "h1wfj8w",
            "score": 1,
            "text": "Agreed. Only because fines are revenue for the city. But I also think there should be way fewer fines. And in the US, we need to dismantle vagrancy/loitering type laws that didn't really exist until after Reconstruction, with the end of slavery and then the great migration, as a way to imprison (and in essence legally re-ennslave and put to forced labor through the prison system) recently freed poor Black people (mostly men).",
            "title_similarity": "0.72065914",
            "sentiment_compound": -0.8735
        },
        {
            "id": "h1wft6z",
            "score": 1,
            "text": "So free is an appropriate fine?",
            "title_similarity": "0.3175152",
            "sentiment_compound": 0.659
        },
        {
            "id": "h1wgy5t",
            "score": 2,
            "text": "Why do people hate the rich? Maybe I’m a self-made millionaire who works 100 hours a week. Sure a $50 fine wouldn’t hurt me at the stage I’m in, but it’s still my money and there’s an opportunity cost tied to it. I have worked hard to reach a stage in life where I don’t have to worry about a $50 fine. I deserve to enjoy that privilege. Even if my parents were billionaires whose money I inherited, at some point someone worked hard for that money and have the right to decide what they do with it. Their children deserve to enjoy the privilege. It’s called privilege for a reason. Not everyone gets to live equal lives just because they were born.",
            "title_similarity": "0.69537807",
            "sentiment_compound": 0.9593
        },
        {
            "id": "h1whj7c",
            "score": 1,
            "text": "Lets say Mark Zuckerberg or Jeff Bezos or the Koch Brothers or Bill Gates or Warren Buffet or someone (probably anyone) from the Walton family (owners of Walmart) gets a parking ticket, and that the normal person cost of said ticket is $500. For people making 30-50,000 a year thats a big hit that will hurt, even if they can ultimately pay it. What would be the equivalent for any multi-billionaire? \n\n$1000? Please.\n\n$5000? Not close to what they make in 1 second.\n\n$10,000? Still not close to the level of pain a normal ticket causes an average income earner.\n\n$100,000? Ok, they may at least acknowledge this. But they also may decide to fight it just on principle. And make everyone connected with prosecuting the case miserable via harassment, investigating the past, and going through records to find things to make everyones life a public hell. And of course, they will also just pay off the judge.",
            "title_similarity": "0.6589289",
            "sentiment_compound": -0.9784
        },
        {
            "id": "h1wi8vq",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.12137998"
        },
        {
            "id": "h1wida4",
            "score": 3,
            "text": "I knew a person that would park in an area where he would get a ticket every day. The price of the ticket was less then the cost to park far away in a lot. \n\nOnce a month, he would pay off his tickets.",
            "title_similarity": "0.57985663",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1wixhv",
            "score": 1,
            "text": "What's the correlation between wealth and violation of the law? It is more of harboring hatred for the rich, not for reasonable reasons.",
            "title_similarity": "0.74087113",
            "sentiment_compound": -0.2177
        },
        {
            "id": "h1wj325",
            "score": 1,
            "text": "They do proportional fines in Switzerland already.\n\nhttps://www.bbc.com/news/world-europe-10960230",
            "title_similarity": "0.46548283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wk7rh",
            "score": 1,
            "text": "It should increase exponentially with increase in wealth. Coz $10 loss for a person having $100 is worth a lot more than a person losing $10K while having $100K",
            "title_similarity": "0.6128877",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1wkpf7",
            "score": 1,
            "text": "This assumes all laws are just, which we know isn't true, so what you're doing is simply further empowering a potentially unjust system.",
            "title_similarity": "0.6417341",
            "sentiment_compound": -0.684
        },
        {
            "id": "h1wlvrk",
            "score": 1,
            "text": "I'm pretty sure I've read here on Reddit that this is the case in a country or 2. I think I saw a $20,000(or higher) speeding ticket in maybe Italy or in that area of the world because of this law. It was a rich guy driving a Lambo.",
            "title_similarity": "0.5753545",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h1wlykb",
            "score": 1,
            "text": "I kinda see that it incentivizies being lazy",
            "title_similarity": "0.3153142",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1wmiv7",
            "score": 1,
            "text": "Do you have any evidence that this is actually a problem? Do you know of very wealthy people intentionally breaking the law because the fines are immaterial to them? If not, there are costs to your solution (enforcement / computation of wealth/income, fairness doctrines in many countries that this goes against, etc) and we would be paying the cost without much benefit.\n\nI know lots of wealthy people who drive themselves around (Silicon Valley types) and I have never once witnessed a person saying (or acting as if they were saying) “this speeding/parking ticket is 0.01% of my income, screw it, I’ll break the law!”. Wealthy people typically try hard to avoid breaking the law, especially for misdemeanor offenses like this.",
            "title_similarity": "0.81721437",
            "sentiment_compound": 0.3185
        },
        {
            "id": "h1wmvh9",
            "score": 2,
            "text": "All I know is, my wealthier friends joke about how speeding tickets are just their semi annual fee to drive faster than everyone else.",
            "title_similarity": "0.6888521",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h1wnbei",
            "score": 1,
            "text": "Look up Bezos parking tickets. Infuriating. Not even so much a fine as just paying to park wherever he wanted.",
            "title_similarity": "0.65050834",
            "sentiment_compound": -0.3262
        },
        {
            "id": "h1wovev",
            "score": 1,
            "text": "My concern is enforceability. It’s pretty hard to evaluate the wealth of a person. For many people it’s tied up in stocks or bonds. It’s also possible that someone’s wealth would report as some number, and that could just be savings for their children’s college, and they really don’t have much operating cash. There’s just no way to reasonably impose these fines.",
            "title_similarity": "0.7416739",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1wqj82",
            "score": 2,
            "text": "When it’s harder to be poor than it is to be rich, there is incentive to become rich. When being rich is is harder than being poor, there is incentive to stay in poverty. It’s easier to make 15-20k and live off govt assistance than making 35k and havin no assistance. It’s called trying to bend human nature so that we don’t try to provide for ourselves",
            "title_similarity": "0.80972195",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h1wqvk0",
            "score": 1,
            "text": "I'm not entirely opposed to the idea, but I'm hesitant to create another perverse incentive for law enforcement to see their job as a revenue stream for their department.  It also makes bribery very, very tempting because a billionaire can afford a $10,000 bribe to get out of a ticket that would cost them much more than that and a cop can't really afford not to take it.  Bribery like that feeds into its own vicious cycle, and cops begin to shakedown anyone they think will be worth it.\n\nMeanwhile, the rich can afford lawyers to fight the tickets and accountants to hide their wealth, giving the fine diminishing returns.\n\nInstead, I propose a fine that is in a currency that affects us all equally -- time.  Mandatory, in-person detention just like grade school.  A rich person may not care about a $500 ticket, but they care about wasting 2 hours watching paint dry.  Furthermore, it goes directly at the psychology of a lot of unsafe driving -- the idea that driving faster and more aggressively saves you time.",
            "title_similarity": "0.7931061",
            "sentiment_compound": 0.8614
        },
        {
            "id": "h1wr03a",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.10924664"
        },
        {
            "id": "h1wrzrm",
            "score": 1,
            "text": "How about all nonviolent crime be punished with community service?",
            "title_similarity": "0.49083498",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h1wswev",
            "score": 1,
            "text": "The OP is making a critical and frustratingly common mistake: wealth =/= income.\n\n\nIncome is highly variable (in the USA).  Many households cycle in and out of high income brackets from year to the next.  Under an income based fee system, you could have a millionaire (stocks, Bitcoin, etc.) with little earned income paying a small fee.\n\n\nWealth, on the other hand, is some function of net worth.  Governments generally do not track net worth.  When they try, it is incredibly difficult and do a poor job.  Moreover, there are often huge loop holes, like housing, art, farms, livestock, etc.  For example, do you count houses?  If you have a little old lady living off social security in an expensive house (maybe appreciated over decades of ownership), do you charge her a large fine or a small?  France infamously tried a wealth tax and [it was rife with so many problems, they gave up](https://www.investorschronicle.co.uk/education/2021/02/11/lessons-from-history-france-s-wealth-tax-did-more-harm-than-good/).",
            "title_similarity": "0.7178242",
            "sentiment_compound": 0.8451
        },
        {
            "id": "h1wt4yd",
            "score": 1,
            "text": "Finland has a system like this in place for their speeding tickets.\n\n>In Finland, speeding fines are linked to salary. The Finns run a “day fine” system that is calculated on the basis of an offender’s daily disposable income – generally their daily salary divided by two.\n\n>The more a driver is over the speed limit, the greater the number of day fines they will receive.\n\nSource: https://www.weforum.org/agenda/2018/06/in-finland-speeding-tickets-are-linked-to-your-income/",
            "title_similarity": "0.75694865",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1wu1np",
            "score": 1,
            "text": "I know this is an older post now but I kind of agree with you. But one thing is it is hard to judge most people's wealth.\n\nFor instance my boss, I don't think he is a millionaire but he is very well off, multiple houses and boats and such. On paper though the company only pays him like 5k a month so he doesn't seem rich. He puts everything on company credit cards and boats and houses are \"the companies\". \n\nI think there are many people out there like him, or the super rich who get paid in stocks or all their assets are in stocks.\n\nMaybe this was already discussed and a solution was found but I didn't read everything. This is the only issue I see.",
            "title_similarity": "0.6297848",
            "sentiment_compound": 0.9852
        },
        {
            "id": "h1wu7it",
            "score": 2,
            "text": "Every punishment will affect people differently. Prison will be harder on someone with kids, death penalty is worse if you’re 20 vs 99. A suspended license might not be a big deal if you’re unemployed, but could be devastating if you depend on your car. What about someone who works a ton of overtime vs someone who just works part time? The person who works more should get a higher fine because they’re wealthier? No. You dish out punishment equally. You find alternative punishments to fines where it would be unduly burdensome, and find alternative punishments to repeat offenders who are unaffected by fines.",
            "title_similarity": "0.8300818",
            "sentiment_compound": -0.9838
        },
        {
            "id": "h1wut6m",
            "score": 2,
            "text": "But I could get away with everything. I'm broke so fines would be like 0.3$",
            "title_similarity": "0.6367755",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h1wuy5j",
            "score": 2,
            "text": "lol imagine getting a parking ticket and having to basically do your taxes just to know how much you have to pay \n\nThis idea always comes up on Reddit and it’s always stupid. Nobody thinks it through on how it’d actually work.",
            "title_similarity": "0.7231933",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1wwafg",
            "score": 1,
            "text": "Many extremely wealthy do not  earn anything. They sit there on vast inherited wealth. Fines should be based on net worth, not earnings",
            "title_similarity": "0.66720665",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h1wxnpj",
            "score": 1,
            "text": "This will very likely lead to the city targetting the rich to make up for any deficits and possibly overlook any crimes the non-rich commit. Ironically, this will lead to more crime, as more police will be situated in affluent areas and not in areas of need",
            "title_similarity": "0.76002437",
            "sentiment_compound": 0.2516
        },
        {
            "id": "h1wxwxi",
            "score": 1,
            "text": "Yes, we call it here the Young Offenders Act, but someone who is 25 would be treated similarly to someone who is 45. Juveniles don't drive, so they're outside traffic ticket rules.",
            "title_similarity": "0.6411381",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1wyf9v",
            "score": 1,
            "text": "So if you have no wealth or income, you can do whatever you want without getting fined for it.",
            "title_similarity": "0.5208518",
            "sentiment_compound": -0.3244
        },
        {
            "id": "h1wyoj1",
            "score": 1,
            "text": "Ahh see you're missing the point. Punishable by fine just means legal for the wealthy.",
            "title_similarity": "0.7404102",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1x0gsh",
            "score": 1,
            "text": "There should be no fines. Only drug rehab.",
            "title_similarity": "0.4669693",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1x1edd",
            "score": 1,
            "text": "The admin costs of tracking people's total wealth - cash, savings, stocks, real estate, trusts etc etc - for each fine would be ridiculous. It's impractical.",
            "title_similarity": "0.7711195",
            "sentiment_compound": 0.7089
        },
        {
            "id": "h1x1u70",
            "score": 1,
            "text": "If you're bankrupt, you can commit crimes and get paid to do so! Quite a deal!",
            "title_similarity": "0.6376936",
            "sentiment_compound": -0.4559
        },
        {
            "id": "h1x1ubr",
            "score": 1,
            "text": "I’ve honestly never understood this mentality of fairness that some people have where fairness is based on someone’s socio economic status. To me fair would be each pays the same amount or has the same consequence. But definition of fairness aside, the goal should be to improve public safety. For example, if the goal is to improve the safety of the roads just take points off someone’s license if they demonstrate they are unsafe on the road. Rich or poor you can lose your license not based on how unfair it is to the person speeding but how unfair it is to those who may have to deal with the life threatening consequences of speeding. I would argue the point of fines and punishment should be to improve public safety and not to create revenue.",
            "title_similarity": "0.8078108",
            "sentiment_compound": -0.0054
        },
        {
            "id": "h1x2xig",
            "score": 1,
            "text": "There’s so much nuance in peoples situations, this will never be just. \n\nFor example, person A makes $120,000 as a software engineer, lives in San Francisco, has 4 kids and his wife is a stay-at-home mom. The family lives paycheck and now the guy gets a speeding ticket. Because he makes 6 figures, his punishment is much higher and now he can’t afford to feed his kids that month. \n\nPerson B makes $15/hr working some data entry job. He’s 25 but his parents still pay all his bills and rent. This person can get as many speeding tickets as he wants because it’s not like it’ll significantly affect his life. \n\nAdditionally, writing this part also made me realize how many reckless 18-25 year olds who are still supported by their parents will just completely disregard the law even more. Their parents might be millionaires but because they’re a college kids with no income, their speeding tickets are what? $10?",
            "title_similarity": "0.5649425",
            "sentiment_compound": -0.9045
        },
        {
            "id": "h1x35n2",
            "score": 1,
            "text": "How about you make it so people can work off their fines at an hourly rate or pay it .",
            "title_similarity": "0.6596098",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1x37a7",
            "score": 1,
            "text": "I think the scale has to be logarithmic, so it’s not “life threatening” for those with very low income. But for those that are rich, should definitely feel that the fine hurt them.",
            "title_similarity": "0.7858802",
            "sentiment_compound": 0.6546
        },
        {
            "id": "h1x4vpn",
            "score": 1,
            "text": "Agreed! I was in Iceland and we were pulled over for speeding by the police (I was not the driver and the driver really wanted to speed, despite my trying to stop them a number of times). The fee was proportional to his income at the time. Thought that was pretty cool.",
            "title_similarity": "0.67261356",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h1x4zqz",
            "score": 1,
            "text": "I’m actually open to the idea of a flat tax and pretty “regressive” when it comes to punishing the wealthy, but in the context of a literal punishment for a crime I think this makes a lot of sense. The only issue I could see is complexity (determining wealth) and potential for manipulation/loopholes that we see with taxes.\n\nInteresting idea, thanks for posting it.",
            "title_similarity": "0.80625904",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1x50rh",
            "score": 1,
            "text": "The biggest flaw with this was :\n\nIn Dubai, bosses usually let their drivers or low paying employees takes fines that has black points. Usually these black points go away within a year of good driving.\n\nSimilarly huge fines as per income will be transferred to these employees and paid off by boss.",
            "title_similarity": "0.70516",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h1x5b31",
            "score": 1,
            "text": "I think it’s an issue of fairness/liberty. If for example: 2 people commit the same parking violation, and 1 makes 50,000 a year and the other makes 150,000 a year. You charge the 50k earner 50$ but the 150k earner 150$ (hypotheticals) for the same crime, the court system would be booming with civil suits. Because the action was the same, therefore the punishment should be the same. “Liberty and justice for all”, type sh*t. \n\nIn more complicated crimes, such as attempted murder or something, fines and charges can vary greatly based on evidence. We also have seen how those from different racial statuses, genders, socioeconomic statuses receive different treatment when facing their sentences. (See: Brock Turner case🙄) However, these cases are always set before a court due to their significance, and in the court case, there are opportunities for the accused side to attempt to “clear” their name.\n\nBack to the issue of something more simple like a ticket for parking, MOST people will not bother to fight these in court. However, you can.\n\nWhen I was in college I got a few parking tickets. My campus police were relentless with them, and unfairly so, because my campus had more students with cars than they had parking spaces for. So someone was always left with no choice but to park somewhere “off limits”. \n\nI took my tickets to court and basically said all of the above, plus gave them my sob story about how I could not afford them, I could barely afford my books and tuition. And guess what.. I got off of every ticket without paying a dime. \n\nI’m pretty sure every state offers the ability to “counter” a ticket, usually on the ticket itself it will say pay this on X days OR if you believe you would like to fight the issuing of this violation, sending us back this letter and then they set a court date for you. (PRO tip: the court date is typically 30-60 days after you receive the ticket, depending on how bogged down your local court system is. You do not have to pay until your hearing. Even if you lose your case, you have those 30-60 days to save😉)\n\nSo in short there are ways around paying for those who truly try. Rich or poor.",
            "title_similarity": "0.76058877",
            "sentiment_compound": 0.5598
        },
        {
            "id": "h1x5hwe",
            "score": 1,
            "text": "The first problem here is that wealth includes all property. Proportionally, one person might have to pay a nickel, while another might be required to pay with a literal house. This is also problematic in that the property might have the capacity to accrue wealth which can not be reasonably calculated in that fee. \n\nAnother issue is that people with very little wealth would accept the low cost fee and work in cahoots with someone holding a lot of wealth for a low risk-high reward investment.",
            "title_similarity": "0.8126334",
            "sentiment_compound": 0.849
        },
        {
            "id": "h1x6bdl",
            "score": 1,
            "text": "It’s a good idea on paper until you realise that there are tax loopholes so some people - while on paper they earn millions - accounting wise they earn nothing and although they have ‘millions’ in assets in reality it’s not theirs it’s all owned by a trust or the business. \nGood idea in a perfect world, but until the tax systems are fixed it will simply result in rich people doing whatever the hell they want because technically they earn nothing so there are no consequences for them.",
            "title_similarity": "0.75369257",
            "sentiment_compound": 0.5506
        },
        {
            "id": "h1x858s",
            "score": 1,
            "text": "It would just create a system where rich people would simply stop engaging in the activity that could potentially be fined if a mistake happens and hire it out to minimum wage folks. For example if I am near retirement and have a decent 401k going there is zero chance I would ever drive again because I wouldn’t risk a 40k parking ticket. I would just use a car service and put that risk on the relatively lower paid driver instead.\n\nIf you do it on income that is also something that can be dodged. Some years Bezos makes low enough on paper income he gets tax credits.",
            "title_similarity": "0.82400715",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1x8cwh",
            "score": 1,
            "text": "Rich people make the rules so why would they do that?",
            "title_similarity": "0.6484833",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1x9dec",
            "score": 1,
            "text": "This is unconstitutional because the constitution says all citizens are created equal",
            "title_similarity": "0.5159506",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1x9qi1",
            "score": 1,
            "text": "Agreed",
            "title_similarity": "-0.069662556",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1xb096",
            "score": 1,
            "text": "If I got fined $300, it would be a big downer and I would be angry for a few days. If a poorer person was fined $300, they might become homeless. If a quite wealthy person is fined $300, they’ll have a funny little story to tell.",
            "title_similarity": "0.7121738",
            "sentiment_compound": -0.0276
        },
        {
            "id": "h1xb6zt",
            "score": 1,
            "text": "As I recall from similar posts, due to corruption, this can lead to major focus on 'rich' people, where they would meticulously find as much violations as possible to try and suck as many money as they could. As you would predict, this would heavily affect the people in the middle class instead, where they can appear rich, but are not actually fully suited to take a big hit in unexpected fees.",
            "title_similarity": "0.7752583",
            "sentiment_compound": 0.1486
        },
        {
            "id": "h1xbghn",
            "score": 1,
            "text": "If the punishment for a crime is a fine, that law only exists for the lower class",
            "title_similarity": "0.67503047",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h1xbp3r",
            "score": 1,
            "text": "Not here to change your view. I agree. \n\nFirst example: Was stuck in traffic on the 37 coming out of Novato on a Friday. (Anyone who lives near San Francisco knows this pain) Hours went by. But after the first hour, a Bugatti owner drove past everyone on the shoulder and jumped ahead. This dick valued their time so much and had such wealth that the fine would likely cost less than their last bottle of wine. \n\nSecond example: I made a terrible decision and drove under the influence one night because I really fucking wanted some munchies. I've payed $1k for classes, $1k to a privatized company for my Ignition Interlock Device, legal fees, required to work several weeks to keep out of jail and still owe 2300 for my fine. I'm so behind on the fine I may have a warrant out for me and my wages will be garnished soon. I also just payed my late registration and a mechanic bill to keep that from collections. My credit has dropped to ~520 and I have $120 to survive the next 14 days and 1500 in bills come the next check. My utilities have accumulated $3,000 that I owe after the pandemic lead to my wage being cut 1/5 and hours being cut to part time at the last job. \n\nI get that I made a mistake. But if this has taught me anything is that the legal system sets the impoverished up for failure because poor people are worth more in a cell than in society. \n\nAlso, if I ever win the lottery, I'm going to become a criminal of petty revenge.",
            "title_similarity": "0.6264696",
            "sentiment_compound": -0.9306
        },
        {
            "id": "h1xc0s6",
            "score": 1,
            "text": "Maybe it should be proportional to income minus core living expenses (food and shelter).\n\nSo if you spend 75% of your income on rent your done will be smaller than someone earning the same wage, but with fewer expenses.",
            "title_similarity": "0.64316726",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xck38",
            "score": 2,
            "text": "When you say a person’s wealth, are you including their equity in a company or a property? What if the vast majority of their wealth isn’t liquid? How do you know exactly what their liquid cash is? Also, that would take a long time to do for every fine...",
            "title_similarity": "0.7257868",
            "sentiment_compound": 0.829
        },
        {
            "id": "h1xcywz",
            "score": 1,
            "text": "You ain’t wrong",
            "title_similarity": "0.047064535",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1xd8d0",
            "score": 2,
            "text": "I’m not arguing against it, but how do you ascertain someone’s income? What do you base it off of? \n\nLast year’s tax returns? Which number do you take from a tax return? The gross income or the adjusted gross? What if I’m on unemployment or social security? Or pay alimony and/or child support? Do you base it before or after I pay those? Or what if have a non-taxable income from an IRA? For a lot of folks social security is also non-taxable. \n\nSay we take last year’s AGI and it’s $60,00. But then I lost my job in March this year, now what? What percentage do I pay? \n\nAlternatively, you wanna base it on salary. Great. But how many millions upon millions rely on tips if they work in the service industry or are self employed? My income this week could be $200 and next week it could be $2000. If you’re self-employed it could vary vastly from month to month. What if I work a seasonal job and make 70% of my income in the summer and have no income six months out of the year?\n\nYou have a million variables when basing fines on income. Again, not an argument against a more fair system, but making it a percentage is far more complex than it seems.",
            "title_similarity": "0.72389",
            "sentiment_compound": 0.6
        },
        {
            "id": "h1xdcne",
            "score": 1,
            "text": "So stupid and time consuming",
            "title_similarity": "0.2907138",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h1xegxy",
            "score": 1,
            "text": "So rich people can do worse shit than poor people?  Yeah no",
            "title_similarity": "0.6745099",
            "sentiment_compound": -0.7102
        },
        {
            "id": "h1xfvcf",
            "score": 1,
            "text": "Are alternative solutions allowed as top level comments?\n\nOthers have made the point that fines can be considered reimbursing damages, which I believe I saw you award a delta for that that could increase reasoning for why a flat rate could be ok. \n\nBut you'd still want some level of deterrence because the impact of crime compounds and otherwise its only a law for poor people. But as others have argued, making money a deterrent for rich people can be really impractical and complicated. \n\nWhy not make all non damage reimbursement penalties jail time? If it's important enough to be deterred beyond financially reimbursing damages, it's likely a crime that is damaging the lives of others more than financially. To try to cover that kind of damage with more money is gross. It should be payed with (a portion) of the offenders life too. \n\nPlus paying with time is inherently fair since you can't save it, earn it, or extort it. You can only try to spend it well. \n\nTake a speeding ticket. Sure there's some level of paying for the time it takes to police you, and maybe some fine should go into some sort of community liability insurance. But otherwise, the damage you are risking by speeding ( in theory ) is killing someone. Money shouldn't cover that for anyone. A night behind bars to pour one out for everyone who died in car accidents is a better penalty. \n\nPlus speed trap towns would lose income and get plenty of pressure to fix their bullshit",
            "title_similarity": "0.86631167",
            "sentiment_compound": -0.9969
        },
        {
            "id": "h1xilpv",
            "score": 1,
            "text": "They do this somewhere. Maybe Sweden?",
            "title_similarity": "0.2248544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xixvp",
            "score": 1,
            "text": "It do be like that in finland",
            "title_similarity": "0.15570378",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1xmaw0",
            "score": 2,
            "text": "Perhaps, in a perfect world. But think about all the work it would take to determine what someone should pay. That work costs money and takes time. I suppose you could factor those costs into the fine but how do you pay those accountants you have on retainer when there are very few violations?\n\nThe world operates better when the operations are simple.",
            "title_similarity": "0.75881207",
            "sentiment_compound": 0.0471
        },
        {
            "id": "h1xrwtp",
            "score": 1,
            "text": "They do this in Scandinavia. \n\nThis guy got fined 100k for speeding in his super car. \n\nhttps://www.theatlantic.com/business/archive/2015/03/finland-home-of-the-103000-speeding-ticket/387484/",
            "title_similarity": "0.59173155",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1xunx1",
            "score": 1,
            "text": "In Finland speeding tickets amount are based off how much money you make!!",
            "title_similarity": "0.7266438",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xypmx",
            "score": 1,
            "text": "Welcome to Finland where we have this. We have a concept of 'päiväsakko' (day fine is the direct translation). For speeding you can get e.g. 20 day fines depending on the severity of the violation. The cost of one day fine is based on your net monthly income. Rich people can and have gotten speeding tickets exceeding 100k€.",
            "title_similarity": "0.7105645",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h1z0h16",
            "score": 1,
            "text": "I have a good point I just thought of, and it’s that low or no income people would have ZERO incentive to follow the law. If I made 0 income or wealth (or however it was defined), my fine would be $0 if it’s a proportion, or a small number if I had a small income. While it obviously sucks to receive a $50 fine, it will deter that person from repeating the same behavior. A $2 fine though? Well that’s cheaper than parking in most places, so they would continue to do it. Maybe a principle where first fines can be proportional (since they are more likely to be honest mistakes) but every other fine has a higher minimum fine?",
            "title_similarity": "0.832579",
            "sentiment_compound": 0.8385
        },
        {
            "id": "h203nb0",
            "score": 1,
            "text": "If fines are proportional, the rich(er) suddenly become target by departments looking to raise money. They would ultimately be motivated to ticket anyone driving a Benz or Audi more frequently than a beater car. It’s not 100% foolproof plan but it’s close. Furthermore, if it’s based on income look at people like Jeff Bezos. He makes almost no income, his money is in stock, so if he got a ticket he would pay less than your family doctor. The rich will find a way around this and the poor will get hurt.",
            "title_similarity": "0.8179272",
            "sentiment_compound": -0.4858
        },
        {
            "id": "h20602o",
            "score": 1,
            "text": "Do you think the same for when you as an example destroy something and need to pay for it?",
            "title_similarity": "0.53299737",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2kqujm",
            "score": 1,
            "text": "The problem is that someones net worth and income is not necesscarily proportional to their day to day monetary obligations.\n\nThe person who is wealthier on paper may have less liquid money.",
            "title_similarity": "0.6877511",
            "sentiment_compound": 0.34
        },
        {
            "id": "h35n87y",
            "score": 1,
            "text": "At a certain net worth it should come with mandatory public service. Let's see if a millionaire keeps speeding if he has to spend every weekend for a month picking up trash by the highway.",
            "title_similarity": "0.66268855",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hbkowfu",
            "score": 1,
            "text": ".",
            "title_similarity": "-0.05999337",
            "sentiment_compound": 0.0
        }
    ]
}