{
    "CMV: Antivax doctors and nurses (and other licensed healthcare personnel) should lose their licenses.\nIn Canada, if you are a nurse and openly promote antivaccination views, you can lose your license.\n\nI think that should be the case in the US (and the world, ideally).\n\nIf you are antivax, I believe that shows an unacceptable level of ignorance, inability to critically think and disregard for the actual science of medical treatment, if you still want to be a physician or nurse (or NP or PA or RT etc.)  (And I believe this also should include mandatory compliance with all vaccines currently recommended by the medical science at the time.)\n\nJust by merit of having a license, you are in the position to be able to influence others, especially young families who are looking for an authority to tell them how to be good parents.  Being antivax is in direct contraction to everything we are taught in school (and practice) about how the human body works.\n\nWhen I was a new mother I was \"vaccine hesitant\".  I was not a nurse or have any medical education at the time, I was a younger mother at 23 with a premature child and not a lot of peers for support.  I was online a lot from when I was on bedrest and I got a lot of support there. And a lot of misinformation. I had a BA, with basic science stuff, but nothing more My children received most vaccines (I didn't do hep B then I don't think) but I spread them out over a long period.  I didn't think vaccines caused autism exactly, but maybe they triggered something, or that the risks were higher for complications and just not sure these were really in his best interest - and I thought \"natural immunity\" was better.  There were nurses who seemed hesitant too, and Dr. Sears even had an alternate schedule and it seemed like *maybe* something wasn't perfect with vaccines then. My doctor just went along with it, probably thinking it was better than me not vaccinating at all and if she pushed, I would go that way.\n\nThen I went back to school after I had my second.\n\nAs I learned more in-depth about how the body and immune system worked, as I got better at critically thinking and learned how to evaluate research papers, I realized just how dumb my views were.  I made sure my kids got caught up with *everything* they hadn't had yet (hep B and chicken pox) Once I understood it well, everything I was reading that made me hesitant now made me realize how flimsy all those justifications were. They are like the dihydrogen monoxide type pages extolling the dangers of water. Or a three year old trying to explain how the body works.  It's laughable wrong and at some level also hard to know where to start to contradict - there's just so much that is bad, how far back in disordered thinking do you really need to go?\n\nNow, I'm all about the vaccinations - with covid, I was *very* unsure whether they'd be able to make a safe one, but once the research came out, evaluated by other experts, then I'm on board 1000000%.  I got my pfizer three days after it came out in the US.\n\nI say all this to demonstrate the potential influence of medical professionals on parents (which is when *many* people become antivax) and they have a professional duty to do no harm, and ignoring science about vaccines does harm.  There are lots of hesitant parents that might be like I was, still reachable in reality, and having medical professionals say any of it gives it a *lot* of weight.  If you don't want to believe in medicine, that's fine, you don't get a license to practice it.  (or associated licenses)  People are not entitled to their professional licenses.  I think it should include quackery too while we're at it, but antivax is a good place to start.\n\ntldr:\n\nHealth care professionals with licenses should lose them if they openly promote antivax views. It shows either a grotesque lack of critical thinking, lack of understanding of the body, lack of ability to evaluate research, which is not compatible with a license, or they are having mental health issues and have fallen into conspiracy land from there.  Either way, those are not people who should be able to speak to patients from a position of authority.\n\nI couldn't find holes in my logic, but I'm biased as a licensed professional, so I open it to reddit to find the flaws I couldn't  :)\n\nedited to add, it's time for bed for me, thank you for the discussion. \n\nAnd please get vaccinated with all recommended vaccines for your individual health situation.  :) ": [
        {
            "id": "h2d8q2d",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.\n\nThank you for understanding.",
            "title_similarity": "0.5967955",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h2aww5m",
            "score": 98,
            "text": "So you want a world in which medical professionals toe the line and follow what the accepted treatments are?\n\nIf this was the case there would be significantly less advancement in the medical field.\n\nAlmost every advancement in medicine started with someone's unpopular crazy idea. After breaking through barriers and naysayers and getting the theory tested it became the norm. \n\nPenalizing people for having a differing opinions than the majority is a dangerous route to follow.",
            "title_similarity": "0.79841363",
            "sentiment_compound": -0.4256
        },
        {
            "id": "h2avwn5",
            "score": 654,
            "text": "Doesn't this depend on *why* someone is opposed to vaccines? Sure, there's the \"vaccines cause autism\" ignoramus whose position is based entirely on ignorance, but there are other more sensible reasons to oppose a vaccine in some contexts.\n\nI am allergic to the whooping cough vaccine. No one would presume that I am being unreasonable by not taking it.\n\nWhat if I have a serious, unmanageable phobia of needles and I just can't get the vaccine because of that?\n\nWhat if I'm in my early twenties and the risk that I get a bad reaction to the Pfizer vaccine is actually greater than the risk to me from coronavirus?\n\nSure, a medical professional who shows serious medical ignorance should lose their licence but at least sometimes under some circumstances it is clearly appropriate to tell people not to get a particular vaccine.\n\nAlso in a lot of countries you'd run into freedom of speech issues here- you can say what you like in your own time as long as you do your job competently, they can't fire you for that.",
            "title_similarity": "0.7289373",
            "sentiment_compound": -0.7978
        },
        {
            "id": "h2b53k0",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2b69d2",
            "score": 7,
            "text": "\"Antivax\" is by now a blanket statement that is being used not to promote science, but to curb dissent from an official narrative. Without you defining what you exactly mean by that, you could as well say \"all witches should be burnt\".",
            "title_similarity": "0.78752804",
            "sentiment_compound": 0.2635
        },
        {
            "id": "h2b5bu4",
            "score": -1,
            "text": "Medicine is not an exact science and despite the media and pharmaceutical companies are saying a LOT of corners were cut while developing this vaccine and a lot of people, doctors included are skeptical. That used to be what science was about, falsifiable results,  but now you got full Parrott yahoos like you screaming like a baby if some doctor says \"Wait a minute, I'm not fully convinced this is safe\" You're an embarrassment to your profession.",
            "title_similarity": "0.7168472",
            "sentiment_compound": -0.3209
        },
        {
            "id": "h2avuhq",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2awwfb",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2b3630",
            "score": -6,
            "text": "This is like saying that a prosecutor who is anti death penalty should lose his license because he's going against the established order and procedures of his profession.",
            "title_similarity": "0.74944365",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h2axdu2",
            "score": 54,
            "text": "I largely agree with all vaccines but the covid vaccine, which is the one thats the point of contention right now and will get people labled \"anti vaxx\".  \nSo, you believe the vaccine is safe because doctors say it is safe, but you also believe that doctors who speak up against the vaccine should be struck off? You see how this is circular reasoning right? You believe the vaccine is safe because doctors say so and \"academics\", but you think all doctors who dont say it is safe should be struck off and any publications censored?\n\nEven though there are no published papers on the vaccines interaction with people who have recently had asymptomatic Covid, or on possible longterm health complications, even though the rabies vaccine based on similar tech in 2018 wasnt even close to phase 1 trials because of safety concerns?\n\nSure, you can say the serious adverse effects in the immediate few days after the vaccine are low,  but you would have to be a fool to believe this is \"100% fully understood\" science with 0 risk of long term complications.\n\nAnd if the risk is not 0, then why should people professionals who may have very valid experience or expertise that is directly relevant to furthering our understanding of this very new technology, not be allowed to talk about it?",
            "title_similarity": "0.7537813",
            "sentiment_compound": -0.5122
        },
        {
            "id": "h2b8gqp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bbm59",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bhgvm",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2b366v",
            "score": 5,
            "text": "Doctors have all sorts of opinions about medicine and procedures but they are all professional enough to administer as instructed.\nA lot of teachers are religious and probably believe in creation- would you fire them all because they shouldn’t teach science?\n\nAlso, I would guess that if  someone had tried to change your mind those years ago when you were antivax, I’m sure you’d be just as staunch with your opinion then, and you probably had similarly strong feelings about the doctors that gave out those injections. \nNow, it seems that you are 100% sure of the completely opposite view. \n\nWith all due respect, this sort of one-way-or-nothing thinking doesn’t leave space for any criticism which could obviously \nbe very harmful for any progress or improvement in any institution.",
            "title_similarity": "0.7394817",
            "sentiment_compound": 0.9559
        },
        {
            "id": "h2b1pjt",
            "score": 18,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2awjk7",
            "score": 66,
            "text": "Counterpoint: I think as long as they're not denying their patients the vaccine or going around trying to talk them out of it, they should be able to work. The covid vaccine situation is a mess. It came out during a very politically intense time; where lies & money & power seemed more important that human lives. The only reason I got the Pfizer vaccine was because I trusted the data coming out of Canada & UK - I don't trust USA. While it is terribly unfortunate politics & misinformation completely wrecked things I'm not sure revoking licenses would be the best. If I'm not mistaken USA, or at least California, has a storage of qualified healthcare professionals.",
            "title_similarity": "0.7549974",
            "sentiment_compound": -0.5785
        },
        {
            "id": "h2b23rb",
            "score": -6,
            "text": "What if, as a nurse, i beleive that medical science isnt there yet, and a vaccine opushed to market in such a short duration can have long term effects not yet tested?\n\nI agree with you for the most part, just pointing out a scenario where ure wrong(im also vaccinated BTW, so im not anti vax)",
            "title_similarity": "0.763693",
            "sentiment_compound": 0.5755
        },
        {
            "id": "h2ayqn1",
            "score": 3,
            "text": "What about getting the vaccine if you’ve already had covid or just waiting for FDA approval?",
            "title_similarity": "0.5626044",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h2b1v3j",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2awjii",
            "score": 385,
            "text": "While I agree that antivax doctors shouldn’t be taken seriously as doctors, I also think that actually instilling a license revoking system like this is a bad idea in principle. Striping a doctor of their license just because they have an  opposing view is a slippery slope. I think having any organization oversee what views doctors are allowed to express would undoubtedly lead to some form of corruption and groupthink.\n\nI know that antivax doctors clearly don’t know what they are talking about, but where’s the line for who is antivax and who isn’t. My doctor for instance recommends me not to get certain vaccines just because he sees it as unnecessary given my medical history. Would he be considered antivax? Also consider that this will set a precedent that doctors can’t believe certain things if a larger or more powerful group deems it so. What if years down the line an actually dangerous vaccine comes out and No doctor is willing to speak out on it due to fear of getting their license revoked. Ultimately, I think the market of ideas works best as a free market.\n\nEdit:\n\nI wasn’t planning on responding to anyone, as there are too many comments to respond to, but I’ll try to further explain in this edit. to people who think I’m against license being revoked all together, this is not the case. If a doctor actually does something scientifically false and it’s dangerous, then sure revoke their license. If they think something scientifically false, that’s a different matter. \n\nIf a doctor thinks the best cure for headaches is a ketchup injection and they keep it as their little theory that they want to research, I would think they are stupid, but they can keep their license. If a doctor is actually giving people ketchup shots, take there license. the grounds for revoking someone license should be grounded in their actions and their knowledge, not what they believe. If you want to say if you want to say “all doctors have to present xyz facts about vaccines to their patients, or their license is revoked”,  I’m fine with that. However, Saying you are not even allowed to question vaccines as a doctor is just too far I’m my opinion.",
            "title_similarity": "0.78326935",
            "sentiment_compound": 0.9379
        },
        {
            "id": "h2axbip",
            "score": 58,
            "text": "I think people are allowed to be unsure of the long-term effects of any vaccine, when there is no reasonable proof they are safe long-term yet. The vax has existed for a grand total of less than a year basically. Anybody claiming to know the effect even 2 years down the line is a liar. This cannot be debated. You cannot blame people for highlighting the fact that vaccines have had very real, severe side effects in the past either.",
            "title_similarity": "0.5867592",
            "sentiment_compound": -0.349
        },
        {
            "id": "h2b0r34",
            "score": 5,
            "text": "In general, I agree with your points, but I there's something that doesn't allow me to completely share your view.\nI met someone who is not anti vaccines in general, but it is against the covid-19 vaccines. The reason, he argues, is that there are no long-term studies (years) to assess the potential side effects of the vaccine which might be serious, and we don't know it. While it's debatable if the lack of long term studies actually poses a serious risk, I think he has a valid concern. He seems informed, but he's just skeptical. If he were a doctor, do you think he should lose his license because he's defending a scientifically plausible doubt?\n\nEdit: to be clear, he defends that the scientific community cannot know for sure if serious side effects will appear some years after the vaccine, which may pose a greater risk than the one we are trying to mitigate by vaccinating people",
            "title_similarity": "0.58417684",
            "sentiment_compound": -0.9424
        },
        {
            "id": "h2cep0m",
            "score": 1,
            "text": "i think they should  have thier license suspended until they all get vaccinated and prove it, or even spouted it to patients, which might cause patients to complain.\nI wouldnt feel comfortable if they said they were anti-vax because it will affect thier judgement in treating patients.",
            "title_similarity": "0.843072",
            "sentiment_compound": -0.8075
        },
        {
            "id": "h2bend8",
            "score": 1,
            "text": "I am not by any means an antivaxxer but I support nearly all views that fight for people even if they may be misguided. They want to help people and think that they have been done wrong.\n\nTo address the cmv first, if there are antivaxxers, they need antivax or naturopath docs or else they won't go to a doc and that will just make things worse for them and all of us. Essentially, removing docs unless they are doing barbaric or inhumane or illegal things is a bad idea since even if only for the reason that people currently rely on them.\n\nThis reminds me of BLM because not all BLM leaders and supporters are in it for the right reasons, just as some feminists are anti-men, some BLM folks are anti-white and some anti-vaxx people also make claims such as vax causes autism...which sure if you have proof that would be a valid mission to champion...but we don't.\n\nWhat we do have is research on each ingredient within the vax. I personally don't feel safe with them, but I doubt they are as bad as the extreme anti vax ppl say they are...probably just run of the mill crap that may cause problems in the future like food coloring does.\n\nI personally recommend to those who don't need to get the vax to avoid it for a few reasons:\n\n1. It is safer for everyone to quarantine / mask / 6 foot and avoid all contact than it is to get the vax and go back to normal life without doing those things.\n\n2. It may be unsafe to even go get the shot depending on who/where/how it is administered because you enter a potentially contaminated area.\n\n3. The vaccine has no long term testing, meaning this new experimental research is relying on hope and really educated guesses for its long term safety.\n\n4. The vaccine does not prevent you from getting or giving covid...it just reduces the liklihood of transmission. So by going from quarantine to vaccine and normal life again, you are becoming more risky to self and other for transmission.\n\n5. You are almost guaranteed to get a host negative symptoms (my mom spent 10's of thousands on her symptoms and to take off work because she had extreme vertigo). There is also unknown chances of survival (often resulting from blood clots) and of getting serious diseases such as MS or Parkinsons.\n\n6. The ingredients in the covid vaccine (and most vaccines) are super controversial with not enough research on them. Most concerning is the nanolipids which have been linked to many health concerns including oxidative stress, DNA damage and cancer. They can also pass through blood brain barrier...just like covid can. Plus, there are some that don't leave the body I am pretty sure, and can accumulate in unsafe areas such as the brain, heart, liver, causing unknown potentially serious effects...like heart attack, liver failure, brain damage.\n\n7. You will likely have to get the vax over and over again because it wears off apparently? Talk about a dangerous and risky bandaid for the epidemic...at least they made a ton of money right? 😀 Sorry...not helpful but I am just baffled how they handled everything.\n\n8. Ok, we are getting super conspiracy now...but apparently they have been working on nanobots to be inserted into the vaccines (no joke) so that your smartphone can read the last time you got the vaccine and other things as well...making the gaps between them less in time...sort of like your sms dentist reminder! Who knows if there is any more added to the software and what other things these nanobots can do, but I am sure they will be added to the vax after a short couple months of testing. This whole nanobot thing could be some super shady dark conspiracy stuff or as simple as...hey look...now we can show you customized deals when you walk through the walmart entrance because we read your chip saying that you like x things because you bought related things before. Who knows where it could go, but I personally don't like the idea of nano bots inside of me. The other strange part about this is not only can you program the nanobots to do things, you can program nanolipids to do things such as rearrange their structure after already set and placed in the body. Yes, you could get injected, then the nanolipids can just poof change while inside of you based on what they program them to do. I have no idea what this actually means and what could happen, but it is at least concerning.\n\nNot trying to convince people to not get the vax if they need to (have a job that requires you to be around people or food or something)...just showing the folks who are on the fence more info that could make them consider quarantine instead if they have the option and can work remote or something to avoid contact.\n\nI personally have an autoimmune disorder and have had negative reactions to every single medication I have ever taken...so I don't feel safe doing it. The reason I researched all the above (can provide links if you want...just lazy on the phone atm) is because my wife wanted to get it so she could go back to normal life so I did some research for her...but she changed her mind once I showed her the research and all the angles to view it from.\n\nOne or two of the above points may not be that concerning and still be worth getting it to save others...especially if you are at risk and creating risk by being around others. However, for me personally, and for my wife who has thought this over, the above 8 items are sufficient to choose quarantine as our option since we are able and are proud of it because we are safe than those who get the vaccine and go back to normal life! Not judging those people, just saying we didn't have to, so we chose the safer option.\n\nSo then, hopefully this helped someone who is on the fence to see quarantine as a valid option and for someone who may have some issue like I do from avoiding lots of pain from potential vax complications.",
            "title_similarity": "0.7434436",
            "sentiment_compound": -0.9565
        },
        {
            "id": "h2c6fpn",
            "score": 0,
            "text": "Ok Karen. Those people probably know a lot more being plugged in to the medical community. Any opinion is valid and through your own research and critical thing draw your own conclusions. Punitive action for compliance is WRONG.",
            "title_similarity": "0.6640445",
            "sentiment_compound": -0.8038
        },
        {
            "id": "h2bcvm4",
            "score": 0,
            "text": "Freedom of thought is a wonderful thing.  The left loves to crush freedom of thought of the right. \n\nThe problem is, there will always be someone further left than you who will crush your freedom.  The left eats its own.",
            "title_similarity": "0.48893934",
            "sentiment_compound": 0.9524
        },
        {
            "id": "h2d87ek",
            "score": 0,
            "text": "No one is forced to believe these people. Why do you care?",
            "title_similarity": "0.37009162",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2bblin",
            "score": 10,
            "text": "Telling people who have more medical education than yourself that they should lose their professional accreditation simply because they choose different medical care than you believe they should accept, is a pretty wild ego ride. For the 2nd act: I'm curious to know what books you would like burn, because they offend you?",
            "title_similarity": "0.7795391",
            "sentiment_compound": 0.836
        },
        {
            "id": "h2ba3qf",
            "score": 7,
            "text": "So forgetting the doctors views. Living in a place with a chronic shortage of doctors and not enough applicants in the field to resolve this. Firing doctors based on they're views seems ridiculous to me.",
            "title_similarity": "0.6765677",
            "sentiment_compound": -0.5647
        },
        {
            "id": "h2b92jl",
            "score": 1,
            "text": "In my personal experience I’ve never actually met anyone who’s ‘anti-vax’, the entire thing only seems to have blown up since the introduction of the Covid vaccines which has brought about more vaccine hesitancy than ever before. I wouldn’t say it isn’t warranted in this scenario though. I think a lot of peoples problem with the mRNA Covid vaccines is that they are a new, novel technology that has never been used on the public before with very little long term safety data. In addition to this there has recently been studies coming out including the bio distribution data of the new vaccines showing they don’t work at all like we had first anticipated, unlike every vaccine before them that stay in the muscle tissue of the injection site, it’s now coming out that not only is the spike protein from the vaccine circulating in the blood, it is being found in alarming concentrations in women’s ovaries amongst over places. When you combine this with the fact that a good amount of the population can have upwards of 99.9% recovery rate from Covid I think a lot of people just don’t want to take the risk until we get more data on the vaccines.",
            "title_similarity": "0.5776757",
            "sentiment_compound": 0.4692
        },
        {
            "id": "h2bn80g",
            "score": 5,
            "text": "I'm not sure what's crazier... someone who says that all vaccines are dangerous,  or someone who says the entire universe of vaccines are all 100% safe.   Imagine if i said all dogs are not aggressive?  Or all days are sunny?  Or how about this,  all anti depressants have zero side effects.   That last one did sound pretty crazy huh? \nWhat's up with people just blessing the entire branch of medicine of vaccines, just the whole lot?  Madness.   If i take a medicine,  i always ask what the side effects are, individually.   I don't say hey,  I've taken penicillin before,  therefore i should be fine with any and all anti biotics.  Am i crazy?",
            "title_similarity": "0.6429701",
            "sentiment_compound": -0.6709
        },
        {
            "id": "h2b7dnm",
            "score": 1,
            "text": "It’s not malpractice for a doctor or nurse to give an opinion.",
            "title_similarity": "0.29869223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2b8x0t",
            "score": -1,
            "text": "Being against the covid vaccine only is not anti vac.",
            "title_similarity": "0.52802515",
            "sentiment_compound": 0.2411
        },
        {
            "id": "h2bb2ph",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bbnh7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2beok7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bi0ld",
            "score": 1,
            "text": "Spoken like someone that truly believes the government should control you life. \n\nThank what ever deity you believe in. Do not take medical advice off of stupid people on Reddit. Consult with YOUR doctor that you trust about getting the shot and what your individual risks might people. \n\nPeople have died from the vaccines and had horrible reactions to them, even if a small number. Easy to say if it isn’t your family members dying from it. \n\nConsult with YOUR doctor that understand your medical history. \n\nCanada has gone off the deep end, Trudeau is locking people up in government hotels for traveling and them MAKING THEM PAY 2k to stay there. While he just came back from the summit and spent less than 12 hours and not even at a government sanctioned one, while jailing his political opponents at the same time. \n\nCanada has no free speech, their doctors can’t be honest with their patients, if they don’t tow the government line they get locked up. \n\nRemind you of anything other time?",
            "title_similarity": "0.81824315",
            "sentiment_compound": 0.0683
        },
        {
            "id": "h2bifs0",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2b3yuh",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2awj5m",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bev0k",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2b3rlb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bijl0",
            "score": 2,
            "text": "So you’re telling me that when a different medical professional, one who has been a successful doctor for many years, reaches a different opinion based on their expertise and available information, you want their license pulled simply for having those opinions regardless of their actual actions as a medical professional or their reasoning?\n\nThat’s not medical science, that’s censorship.",
            "title_similarity": "0.6669282",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2bq4io",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2azfet",
            "score": 8,
            "text": "In this case the generic anti-vaxxer doctor seems like a straw man argument, because the word \"anti-vaxxer\" is fairly loaded now.  Is there any particular doctor you're thinking of?\n\nI don't know of any allopathic doctor that is against all vaccines, but perhaps you can give an example.  (Naturopathic doctors are another story)   I have heard some doctor talk about risk-benefit calculations so as not to be gung ho about all vaccines for all people.  I'm not a medical expert, so I can't speak to who is right, but I appreciate diversity in intelligent voices.  No one should be censured or canceled from speaking from evidence and having an alternate view.   While the autism link is a famous crackpot idea, there have been occasional serious health issues linked to vaccines, and we need to have a balanced approach, always having a risk/benefit analysis.   When there's an environment of fear of losing accreditation for simply questioning, it's harder to have the necessary debate to find that good balance.",
            "title_similarity": "0.70570016",
            "sentiment_compound": 0.0745
        },
        {
            "id": "h2b47eg",
            "score": 8,
            "text": "/u/sapphireminds (OP) has awarded 4 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/o3b93g/deltas_awarded_in_cmv_antivax_doctors_and_nurses/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.54486513",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2b3ae4",
            "score": 4,
            "text": "In general, I agree, if a doctor tries to convince a new parent not to get vaccinated, or if they try to convince someone to ignore the sudden stabbing pain in their chest. That’s dangerous and they shouldn’t be doctoring. \n\nHowever if we put in a strait up ‘no anti-Vax’ policy that is clearly defined and pushed at vaccination specifically (rather than any part of medicine) then a lot of vaccine hesitant people will worry that their doctor is only pro-vax for the purposes of keeping their job.",
            "title_similarity": "0.78555906",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h2b9sd8",
            "score": 0,
            "text": "How are you defining antivax in this context? I dont think any discussion can be had without tying down the term to a definition",
            "title_similarity": "0.53642684",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2bawmt",
            "score": 0,
            "text": "I believe that you're confusing people who are anti-vaccine\nThat went through the standardized approximate 5 years of testing and trials.\n\nAnd people who are anti experimental drug.\nI'm pretty sure that still not a single one of the available covid vaccines are FDA approved (no authorized for emergency use is not the same thing. These are still classified as experimental)\n\nPeople would much rather either take a drug that's been around for a while with similar effects or taking FDA approved drug that's made the proper time in development, testing, and human trials.\n\nAll of the covid vaccines were built and rushed through development, testing, and human trials in under a year total. They were definitely built by the lowest bidder and cutting as many corners as humanly possible to get out first because stock price.\n\nThe cool part is that since FDA give it emergency authorization even though it's not approved they are covered by United States vaccination laws. This means that they could be aware at any point in time of any range of unknown side effects up to and including death and they cannot be held responsible in legal or civil court.\n\nThat being said, if they had like a version of the flu virus or something that did pretty much the exact same thing this would be a non-starter and pretty much everyone would be vaccinated by now.",
            "title_similarity": "0.6486516",
            "sentiment_compound": 0.7407
        },
        {
            "id": "h2bnsmt",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2boybb",
            "score": 0,
            "text": "I know that's how it works in Canada, but America's a free country dude.  \nThere's one big hole in your logic: government licensing shouldn't even exist. You don't have the right to stop someone from hiring whoever they want to serve as their doctor, and you certainly don't have the right to prohibit another practicing doctor from having a different opinion than yours... but I wouldn't expect a canadian to understand freedom.",
            "title_similarity": "0.69654506",
            "sentiment_compound": 0.9186
        },
        {
            "id": "h2bpmfy",
            "score": 0,
            "text": "If you’re referring to the Covid vaccine, they aren’t antivax they are anti covid vax, which is fair. If you don’t want to change your mind I won’t try to convince you but there are a lot of reasons doctors and nurses aren’t getting Covid vaccines, if they were getting them I’d be more likely to get one but the fact that it still makes them nervous is a huge red flag to me.\n\n“But it’s safe”, but doctors and nurses don’t want one so how safe is it really",
            "title_similarity": "0.72535306",
            "sentiment_compound": 0.7696
        },
        {
            "id": "h2bqrdt",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bw7at",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2c6c5a",
            "score": 0,
            "text": "Let people make their own decisions. Since when does someone's opinion or decisions require someone's approval?",
            "title_similarity": "0.31773034",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h2c7tf3",
            "score": 0,
            "text": "Good thing I live in the USA and am a chiropractor. I tell all vaccine pushers to get fucked.",
            "title_similarity": "0.685286",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2c89ab",
            "score": 0,
            "text": "Sounds like someone who has morbid obesity running through their inner circle would say. But when the Dr says stop eating so much sugar he's uncaring and should be fired. Go get your \"fauci ouchie\" and make sure to take plenty of pics for social points since that disease seems so much more sinister than covid.",
            "title_similarity": "0.7265507",
            "sentiment_compound": -0.9039
        },
        {
            "id": "h2cfbxf",
            "score": 0,
            "text": "People who say stupid shit typically don’t think about what these rules/laws really do. God isn’t scientific there is no proof of god, should all religious medical professional lose their license? Judging people for their beliefs is a problem, only when those beliefs turn to actions should someone be punished.",
            "title_similarity": "0.73330283",
            "sentiment_compound": -0.9205
        },
        {
            "id": "h2cnnve",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2crzdp",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2csiee",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2ctnhz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2cwekv",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2d0bqe",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2d1or4",
            "score": 0,
            "text": "Yeah, vaccines are around for over 120 years people need to calm the fuck down and stop hindering humanities progress. I dont fancy a second run of the middle Ages.",
            "title_similarity": "0.6174261",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2d66hq",
            "score": 0,
            "text": "No, obviously not. Medical consensus isn’t some objective thing, it changes all the time. Just look at the AstraZeneca vaccine now, everyone pushed for it so hard like you were an absolute moron for refusing it and now its banned in Canada. \n\nWorshipping science is anti science.",
            "title_similarity": "0.82731104",
            "sentiment_compound": -0.7709
        },
        {
            "id": "h2b8cfv",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2b2d2n",
            "score": -1,
            "text": "Define antivax. Yes there is the \"vaccines cause autism\" crowd and removing licenses from people peddling that crap is probably reasonable. However where does the line get drawn?\n\n&#x200B;\n\nI know someone who is allergic to one of the ingredients found in a lot of vaccines, goes into anaphylactic shock. Is saying that he shouldn't get vaccines with this ingredient antivax?\n\n&#x200B;\n\nMost of my family members that have gotten the various covid vaccine have ended up getting sick for about 2-3 weeks immediately afterwards. I don't have any sick leave and have already gotten and recovered from covid (meaning that I still have naturally produced antibodies). If I wait 5 more months I will get my sick leave back and can afford to take time off if I get sick. I am not in any risk categories for covid and as I still have antibodies from my previous infection am unlikely to get sick. Due to my job, I will remain isolated from other people for this timeframe too. Is this antivax?\n\n&#x200B;\n\nAmerican pharmaceutical companies claimed that Ambien was safe and non-addictive. I have several family members that got addicted to it while it was thought to be safe and it was hell for them to get back off of it. The opium epidemic in the USA is another example of this. Pharmaceutical companies lied to doctors about the dangers associated with the opiate drugs that they were selling. Information on the damage caused by tobacco was heavily suppressed, there are records showing that the tobacco companies knew how dangerous the drug was while doctors were prescribing it to treat various medical conditions. In 2017 a vaccine for dengue fever called Dengvaxia actually made the disease worse because of falsified testing results. The USA has a massive problem with regulatory capture and pharmaceutical companies have had corruption scandal after scandal with people dying or being crippled in each. Is having low risk patients hold off on a brand new vaccine antivax (assuming it ISN'T the covid vaccine, for example say a brand new AIDS vaccine for a monogamous married couple?)\n\n&#x200B;\n\nWhat about the above argument for a covid vaccine (in an area that already has herd immunity and the person is low risk and isolated for example rural Alaska?)",
            "title_similarity": "0.72489613",
            "sentiment_compound": -0.9938
        },
        {
            "id": "h2bgbh4",
            "score": 1,
            "text": "I think Fleming and penicillin offer two separate reasons why we should not discourage minority viewpoints in medicine.  The first is the discovery and application itself.  The second is that Fleming himself warned against over-application of penicillin because it could lead to bacterial resistance.  It has.  Now, I personally don't think the same applies to vaccines, but I don't know (I also have no background in medicine).  But most people didn't know whether bacterial resistance would be a problem when Fleming issued his warning, and certainly for years anti-biotics were wildly over-prescribed.  More viewpoints should never be considered a bad thing in medicine (or science, or really any field).  We don't know what we don't know.",
            "title_similarity": "0.7215905",
            "sentiment_compound": -0.8997
        },
        {
            "id": "h2bh270",
            "score": -1,
            "text": "I work with nurses on a step down unit who I've overheard saying shit like \"oh I had covid before the vaccine and it wasn't that bad\" to a fucking patient! All the while there are patients who are actively dying on the ventilator from Covid in ICU.  I've never had my blood boil so much. Like... you dumb bitch come down the unit and see that Covid isn't that bad. Bitch should NOT be a nurse. Fuck you Anne.\n\nFound the nurses in here with room temp IQs. How some of you have the mental capacity to tie your own shoes is beyond me.",
            "title_similarity": "0.7327579",
            "sentiment_compound": 0.1135
        },
        {
            "id": "h2bhzca",
            "score": 1,
            "text": "Can't attempt to change your view because I agree wholeheartedly",
            "title_similarity": "0.22996947",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2birey",
            "score": 1,
            "text": "As a medical student, anti-vaxers are some of the dumbest people in the world. You wouldn't believe how rampant it is in the nursing community and even some doctors. Allowing medical professionals to be anti-vax is like letting me become a doctor if I didn't believe in viruses and bacteria and I refused to wash my hands before I treated you or your children and reused used needles. Have fun taking little Timmy for lifetime HIV treatments or having his legs amputated because I transferred the antibiotic resistant necrotizing skin infection to him from my last patient.",
            "title_similarity": "0.7614188",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2bjowq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2blgky",
            "score": 1,
            "text": "Going on a completely different path here.\n\nDo feel like all professions are better off with 2 sides. Look at the food pyramid for example, how much has it changed over the years? If all licensed doctors and nutritionist stood by the old one 30 years ago would someone fresh out of school saying it was wrong deserved to lose their license?\n\nNow yes anti vax is a completely different argument, but you can’t just silence someone who doesn’t stay with the pack. Every argument or cause needs opposing sides with some credibility it’s how we improve as a society people should be able to listen to both view points and make the choice for themselves.",
            "title_similarity": "0.741349",
            "sentiment_compound": 0.183
        },
        {
            "id": "h2blrw9",
            "score": 1,
            "text": "Why does it always have to be pro vs anti vax? I have yet to hear this for other medicines. Nobody is anti or pro paracetamol, as we recognise that some people can't take it. Similarly, my sister was injured by the DTAP vaccine and the neurologist she saw said he had seen it many times before. After her experience I wouldn't be keen to take a vaccine unless it was really needed. 1.5 years later she is still not 100%.\n\nAlso, many \"anti vaxxers\" were actually pro vaccine until they/their child had a bad reaction to one.\n\nOverall, the gaslighting about vaccine damage is insane. And taking away thee licenses of doctors for using their free speech rights is disgusting.",
            "title_similarity": "0.70677376",
            "sentiment_compound": -0.9596
        },
        {
            "id": "h2bmz1h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bnovk",
            "score": 1,
            "text": "How do we know the long term effects of this vax…\nNo one knows. It’s experimental and not fda approved.\nDo you think it’s a good idea to trust the pharmaceutical industry on an experimental vaccine when they are exempt from any lawsuits and are making billions? \n\nI’m not anti-vax, I just don’t want something in my body that could have a worse long term effect than the virus. \nNo one knows these answers yet. What we do know is survival rates with the virus.\n\nOne more point… if your in the USA and you still believe Fauci has been truthful thru this pandemic… you’re not paying attention or thinking critically at all.",
            "title_similarity": "0.65962183",
            "sentiment_compound": 0.12
        },
        {
            "id": "h2bp1yd",
            "score": 1,
            "text": "This is a dangerous position to have. \n\nIf a doctor or nurse is against vaccines, I want to know why they are.\n\nThese aren't everyday people, these are trained specialists that are much better at this sort of thing than the average facebook mom.\n\nThey should not have their license taken away because they hold a different professional opinion.",
            "title_similarity": "0.74838364",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2bqj30",
            "score": 1,
            "text": "So trust medical professionals until they don't agree with you? There is  \n no such thing as \"settled science.\" Science by definition is ever   \nevolving. If you want to create a Gestapo version of SciEnCe where   \nchallenging the status quo is verboten, you are actually advocating   \nmedical tyranny where informed consent becomes irrelevant and The State   \nowns your body. People who think this way are generally mindless sheep   \nwho live in a state of constant media induced fear.  Also, the point is that most people aren't anti-vaxx, they are anti-forced-vaxx which is a huge difference.",
            "title_similarity": "0.7425263",
            "sentiment_compound": 0.0984
        },
        {
            "id": "h2c10qj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c1lt9",
            "score": 1,
            "text": "Generally agree enthusiastically with what you are saying - if sound science says a treatment is safe and effective  (which is absolutely the case with COVID vaccines) and the alternative to treatment poses a significant medical or public health risk, people who are clinicians are not in the position to run their own studies or cherry-pick findings they like or want to be true. Personal or religious \"beliefs\" are not an excuse for medical malpractice.\n\nSome caveats that come to mind - what if the doctor (or other healthcare profession) isn't in a position to weigh in on vaccines specifically to any patients - let's say an orthopedic surgeon for example, and only expresses anti-vaccine or anti-science views with acquittances or on social media. Should there be consequences for this?\n\nAlso, if there is a specific vaccine or trial they take issue with (assuming this is grounded in informed judgement and they have done the work to have an informed opinion, and its not based on something frivolous like fringe news talking points), but support vaccines in general, does that change things? For example, if they had some question about RNA vaccines and so recommended their patients get J&J instead, where does that fall?",
            "title_similarity": "0.635943",
            "sentiment_compound": 0.9475
        },
        {
            "id": "h2c1yvz",
            "score": -1,
            "text": "So you understand medical science better than someone with a degree in the field?",
            "title_similarity": "0.3467528",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2c7ew1",
            "score": -1,
            "text": "A very dangerous idea right there. Not being apart of the general consensus should not be reason to revoke ones license. It is perfectly reasonable to not trust something new immediately, as we do not know the long term effects of it.",
            "title_similarity": "0.5825516",
            "sentiment_compound": -0.2252
        },
        {
            "id": "h2c8g2x",
            "score": -1,
            "text": "A chiropractor has much more validity than an RN as they actually have a doctorate degree whereas an RN is no more than a order taker. Healthcare professional LOL",
            "title_similarity": "0.41053522",
            "sentiment_compound": 0.3254
        },
        {
            "id": "h2c9dg1",
            "score": 1,
            "text": "Vaccines don't cause autism but they cause a child have his first sensory overload which makes it easier to detect.",
            "title_similarity": "0.3381331",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h2d16m6",
            "score": 1,
            "text": "This is a dangerous slippery slope. When you start punishing people for non consensus views, no matter how dumb, you risk creating an environment where the status quo is never challenged. Look at how no one challenged Fauci on the virus being possibly lab made even though he knew there was a meaningful chance because of they knew they would have funding cut for projects.",
            "title_similarity": "0.6515616",
            "sentiment_compound": -0.8549
        },
        {
            "id": "h2d4sy0",
            "score": 1,
            "text": "I mean I know plenty of folks who won’t take the covid vaccine purely on the basis that they do not trust the government, are they in the wrong? What exactly has the government done, especially in the last 10 years, that has earned them trust in regards to sticking a foreign substance into their body on the idea that it will protect you? Doctors and nurses are citizens just like you and me, and they are allowed to have their opinions regarding vaccines. Its one thing if a nurse refuses to give someone a vaccine, its completely different if they say they don’t trust the government to ok a new drug with less than a year in development.",
            "title_similarity": "0.7714967",
            "sentiment_compound": 0.8155
        },
        {
            "id": "h2d7ekq",
            "score": -1,
            "text": "Well thanks for labeling those that prefer to pick and chose what’s injected into our bodies. Just because an injection is deemed “safe” does not mean it’s safe for all. That’s the thing we take what big pharma tells us as truth. And if you think doctors aren’t payed by big pharma then think again. I’m not a sheep and neither are many I know. I’m not laying my arm out just because a government tells me I have to.",
            "title_similarity": "0.7016721",
            "sentiment_compound": 0.5986
        },
        {
            "id": "h2b0tww",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2b4wu4",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2bbkiv",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bc3wa",
            "score": 2,
            "text": "Personal opinion doesn't mean they are incapable of caring for their patients",
            "title_similarity": "0.3847049",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2bfhiq",
            "score": 2,
            "text": "There are many issues with vaccines as a whole and this so-called vaccine against covid especially..\n\nThere are doctors who have delved into the topic very deeply (a recommendation or example would be Dr. Suzanne Humphries), were pro-vaccine (because of false assumptions) and changed their stance after evaluating the body of evidence very carefully.Who decides which stance is fact and which is fiction, especially when there are logical/scientific arguments provided?\n\nHowever, the more frightening thing tough is that you call for a kind-of scientific dictatorship of opinions (or so-called \"consensus\" - by the way, don't forget that it took consensus to distribute Thalidomide and by the same token, if everybody opposing to it would have been \"neutralized\" we would still have this golden calf scourging our society - or how about DDT? Asbestos? Painting with lead? Dental amalgam? (I guess the last one is safe and effective for you as well and every criticism regarding that is from \"conspiracy land\")).  \nSo if someone would object to something like vaccines (regardless of his or her arguments) he/she is to lose every right or position where he/she could influence others regarding this topic with authority.What a brave new world you long for with myriad possibilities for open discourse - NOT.\n\nThe most frightening thing is your upside down worldview by submitting to (nowadays) obvious corrupt and biased sources. Some buzzwords for you: conflicts of interest; revolving doors; reproducibility crisis; the question of who's funding which research and the issue of flooding of the scientific literature (all of course just theoretical delusions from conspiratorial fundamentalists - because conspiracies don't exist and never have, right?).\n\nYou claim to be able to critically think, yet you prove the exact opposite with your \"understanding\". You're doing a major disservice regarding the criticism of vaccines and their ingredients by comparing the criticism to basically delusions like lamenting imagined dangers of pure water (I suppose that was what you were trying to convey - although there are issues with water and residues like drugs etc, depending on your water source and the like..).  \nI guess mercury, aluminum and formaldehyde are absolutely \"safe and effective\" (especially for new born children with different physiology as adults), as well as the moral dilemma for some people opposing abortions for example regarding fetal tissue in vaccines is just an objection from stupid inbred hillbillies.\n\nYour post is highly suspicious. I doubt if you were actually ever even remotely accustomed with the literature and/or arguments against vaccines/vaccination and were simply emotionally responding back then as you are now for vaccines - or - maybe this is just a PR-post to shape the opinion of people on the fence, that you were skeptical, looked at the evidence and got convinced the science regarding this topic is sound (to promote such stories because often, it results in the contrary convictions).  \nHowever, there is also the chance that you simply don't want to admit the hideous truth which would imply that you have allowed your children to get injected with basically poison (in the worst case) and that you have procrastinated this important topic until AFTER you have allowed that to happen, and thus you would feel guilty if it would be true and possibly even more so because you already had concerns, yet didn't delved into them accordingly at the proper time.",
            "title_similarity": "0.7602574",
            "sentiment_compound": -0.9597
        },
        {
            "id": "h2ca1uz",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2b8gwe",
            "score": -4,
            "text": "So you're saying that you trust totally what the pharma companies tell you, I'm sure that you're right because it's not ever been the case that pharma companies have falsified their data, it's not like there is evidence that they have sold drugs that don't work or drugs that are actually damaging to the population before now is it.",
            "title_similarity": "0.54880273",
            "sentiment_compound": -0.3421
        },
        {
            "id": "h2b51jl",
            "score": 345,
            "text": "This is more of a challenge to the 'how' than the 'what': this should not require new rules, by-laws, new processes and regulations.\n\nIMO doctors giving antivax advice is malpractice. Which is already defined relatively clearly. So the conversation here should be steered toward that existing legal framework. Some cases of malpractice warrant fines (and that's why malpractice insurance exists), some are more serious and are grounds to the license dismissal.\n\nSo we should rather push for 'antivax = malpractice' than 'one more way for a physician to lose their license'. There are enough rules already to make this legal space a nightmare.",
            "title_similarity": "0.7179711",
            "sentiment_compound": 0.5417
        },
        {
            "id": "h2b9y13",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bemx3",
            "score": 43,
            "text": "Pro-Vax here, but did a thesis on anti vaccine attitudes.\n\nI think one of the things you have to realise here is that people are often anti Vax are not always anti science, and nor are they always uninformed. Many antivax stands are driven by value judgements, which are not a case of \"science says\". \n\nEg. Much of the rhetoric around vaccines is based on the idea that good decisions maximise the outcome for the most amount of people, even if it means hurting a few. This is not the only ethical position you could take. \nYou could make decisions based on deontological principles, or duties (which may include not using coercion etc) and many other ethical positions. \nWhatever the science says can't touch these positions because you're arguing values at that point. Once you recognise this, then the question becomes \"should we be able to impose our values on other people?\". And a lot fewer people are happy with that. \n\nThere are a range of ethical stances that can preclude vaccine use, all while accepting the scientific data on their efficacy. \nLike bodily purity-\"vaccines work but it is of prime importance that I don't willingly introduce foreign substances into my body\" or individual autonomy- \"vaccines work but it is of prime importance that individuals get to decide what to do with their body\". Etc etc.\n\nSo if a medical professional is informed, but has different values, is this a good idea to fire them? Are there any other values we should fire them for?",
            "title_similarity": "0.5712125",
            "sentiment_compound": 0.985
        },
        {
            "id": "h2aw5x3",
            "score": 32,
            "text": "How do you define \"antivax\"?",
            "title_similarity": "0.33414477",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2b83vc",
            "score": 1,
            "text": "People won't change their view, they just would change the way in which they are talking about their views so that they don't have to face repercussions.\n\nI'd prefer that a doctor talks about their anti-vaxx mindest loud and clear, so that I can avoid them, rather than talking about it in more subtle ways.",
            "title_similarity": "0.62286174",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2b8l35",
            "score": 1,
            "text": "While doctors and nurses somewhat understand what a vaccine is \"supposed\" to do, it is hard to trust the US pharmaceutical and hospital systems when you learn more and more about their profit driven tactics that have no regard for human health.\n\nIn my view, there are three types of antivaxers: those that were persuaded by online stuff or people, those that benefit from the money that goes into antivax campaigns, and those that have a high understanding of vaccines and capitalist effects on healthcare decisions.\n\nYou have the freedom to choose who you trust.\n\n- vaccinated doc",
            "title_similarity": "0.7144381",
            "sentiment_compound": 0.9367
        },
        {
            "id": "h2b9onx",
            "score": 2,
            "text": "A specific medical contraindication is different than being anti-vax. It’s because people have legit medical contraindications we can’t “live and let live” with the anti vaxxers",
            "title_similarity": "0.7117597",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2ba7jd",
            "score": 4,
            "text": "To preface, I'll say I agree that medical professionals are put in a position of authority to give sound medical advice to parents and that includes advice on vaccines. There is no dispute vaccines have saved countless lives and this pandemic is no different, but it is fine to question vaccines and dispute claims of side effects. I think the AZ vaccine is the best example of this. Despite it going though all 3 phase trials, a small number of reports emerged of a blood clot killing patients who took the vaccine. Because of it, many countries started putting a hold on the vaccine or outright pulling it out of circulation. In Canada, AZ patients are now somewhat forced to take an alternative vaccine for their 2nd dose, namely Pfizer and Moderna because of the limited supply. People in the medical community are mixed right now with this approach including immune pathologists given the unconventional nature of how the vaccines are being rolled out across the country, which warrants legitimate concern to public health and can sever trust of the medical doctors working in public policy to make these decisions. My sibling who has taken the Moderna vaccine doesn't trust the medical advice of doctors anymore because of this decision and even I questioned the decision because the way I see it even with the preliminary studies shared to me with my scientific background Canada is using its citizens and residents as Guinea pigs to test the efficacy of vaccine mixing without knowing the side effects. Does the blood clot risk increase due to mixing AZ and Pfizer? Does the efficacy last longer or shorter than the traditional method of vaccine injection? These are legitimate concerns the medical community and public have and the medical community can advise to not mix vaccines or not to take the Pfizer or Moderna vaccine if you had AZ because they aren't confident about the public policy decision until the peer reviewed results come out proving it works. Preliminary results don't translate into the reality and array of medical conditions faced by people every day. It may work for me being young and relatively healthy, but my mom who has 3 underlying medical conditions might die from vaccine mixing. If a doctor advises a patient to not take or mix a vaccine because of their subjective medical opinion and lack of data to support the public policy, is that anti-vax and enough to pull the medical license? \n\nWhat you're really asking for in this question is how we remove medical bias out of the science that backs up vaccines. The truth is unless we can figure out a way to invent AI and replace human doctors by smart machines or have virtual assistants that provide sound and objective advice to medical professionals, you simply can't. Humans are naturally raised with bias as they grow older and learn more about the world. Those experiences manifest in our decisions when we make them and that's part of the human experience, to connect with those in our community and come to a middle ground of what is best for the patients and communities the medical profession serve. In order for science to dominate, emotion has to be removed from the equation and the simple truth is humans are moved by emotion. You can't fight science with human emotion, plain and simple. But do you know what people love to hear? Stories! And that is what will help people change their mind. A good story crafted by data and science (or conspiracy theories) will really help people change their position when they see how their view doesn't make sense or make sense of the uncertainty. My sibling and I are still on the fence of mixing vector and mRNA doses simply because of the logic to mix two different technologies to immunize someone and the limited data we know on this subject, but supportive of mixing mRNA vaccines as similar technologies will logically lead to similar results of efficacy vs. using the same dose and most medical experts will agree with this sound logic.",
            "title_similarity": "0.69038737",
            "sentiment_compound": 0.9814
        },
        {
            "id": "h2bb5ah",
            "score": 2,
            "text": "You're arguing that either you believe in modern medicine and you get to practice it, or you don't and you don't. I agree with you regarding vaccines, but modern medicine can be wrong, and when it is, how does it make progress except the people within modern medicine who are pig headed enough finally get everyone else to see this or that big mistake?\n\nWhile weeding out the obviously wackadoodle antivaxxers, you also strengthen the status quo and weaken our ability to make progress. \n\nMaybe the crazy ones are forced into research only, so they can either learn better or ultimately prove they were saying something worth listening to (not sure how that works in relation to licenses)",
            "title_similarity": "0.7528236",
            "sentiment_compound": -0.5496
        },
        {
            "id": "h2bcjjz",
            "score": 2,
            "text": "They shouldn't because it will make them martyrs and make the antivax movement stronger. \n\nImagine your uncle on facebook finding out that some quack nurse lost her license because she \"Spoke the tRuTh!!!!\". My god he would never shut up now.",
            "title_similarity": "0.7273952",
            "sentiment_compound": 0.7067
        },
        {
            "id": "h2bcl7e",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2bdkt2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2bdxjr",
            "score": 1,
            "text": "This is a great way to polarize people even more. It’s also a very slippery slope.\n\nI hate to break it to you but there are professionals in every industry with completely uninformed and idiotic opinions that their career paths should not allow, but it happens all the same.\n\nAlso keep in mind in a lot of ways being anti vaccine is being a victim of sorts. If you are anti vax you have almost certainly been fed case information that feeds your fears. Now you want to take people who are ignorant and not educate them but to instead take away a license they are properly worked for and earned.",
            "title_similarity": "0.7565201",
            "sentiment_compound": -0.9577
        },
        {
            "id": "h2bed93",
            "score": 1,
            "text": "If someone doesn't want this vaccine specifically due to its experimental nature, are you calling them an antivaxer?",
            "title_similarity": "0.6108917",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h2bejpv",
            "score": 1,
            "text": "Healthy skepticism is always important in such an important set of professions.  Now let me be clear, I’m not talking about vaccines in general, and I myself am pro vax, but I know many a doctor or nurse who don’t like a specific vaccine for when we give it or how new it is, and they still don’t feel like they can fairly expressed that concern at all without it being taken to the extreme.\n\nIt’s a sad state of affairs that’s some thing like that has been politicized to such an absurd degree, but if anything doctors and nurses need MORE healthy avenues to express their concerns about vaccines (vaccines cause autism absolutely 1000% is not a legitimate scientific concern).",
            "title_similarity": "0.747884",
            "sentiment_compound": 0.9223
        },
        {
            "id": "h2bfi1z",
            "score": 1,
            "text": "As someone in healthcare, there is a MAJOR difference between normal vaccines and a vaccine created in 8 months.\n\nI am sure this post may have been sparked from the covid vaccine, and the long-term science on this one is very unclear.",
            "title_similarity": "0.62755513",
            "sentiment_compound": 0.2516
        },
        {
            "id": "h2bfl8t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2bflbg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2bfmb3",
            "score": 1,
            "text": "I don't think they should lose thier licenses if they don't like new vaccines that are approved under emergency measures that haven't been tested to the set standard.",
            "title_similarity": "0.61737645",
            "sentiment_compound": -0.5588
        },
        {
            "id": "h2bfmye",
            "score": 1,
            "text": "Everybody somehow forgot pandemrix the swine flu vaccine that caused thousands of neurological disorders?\n\nI'm working in med sector and know many docs and nurses who are against flu vaccines for healthy people but not vaccines in general.",
            "title_similarity": "0.76383597",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h2bfu2y",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bg017",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2bg0n3",
            "score": 1,
            "text": "Lol wowwwwwww I don’t even know where to start here. You should lose your license if you PUSH someone to take this vaccine. I’m vaccinated and by no stretch am anti-vax, but I’m pro-individual responsibility and free thinking. Whatever happened to “my body my choice?”",
            "title_similarity": "0.8012358",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h2bghez",
            "score": 1,
            "text": "[what do you think about this student ?](https://www.reddit.com/r/Virology/comments/o35adi/could_the_mrna_not_being_specific_to_certain/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) would you consider him anti-vax?",
            "title_similarity": "0.6052798",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2bgp59",
            "score": 2,
            "text": "I kind of disagree because people have to be allowed to disagree and challenge beliefs. If doctors/ medical professionals lost their credentials because they disagreed with something, nobody would ever speak up if something were wrong. You can’t just declare that certain topics CANNOT be challenged or else you get punished without causing huge problems. That’s getting into some serious fascist stuff.\n\nHowever, I absolutely think antivaxx people are often paranoid and ignorant. But I also think people should be allowed to question whether or not medicines/chemicals are actually safe to be putting in our bodies, even if other doctors say it is.\n\nI’m aware that antivaxxers are currently going off the deep end lately with all the conspiracy theories that are popular right now and is certainly a problem, but the solution is not clamping down on “wrong speak”",
            "title_similarity": "0.77120376",
            "sentiment_compound": -0.631
        },
        {
            "id": "h2bgsv4",
            "score": 3,
            "text": "I think the difference should really lie in whether it's affecting their work/clients. A lawyer is allowed to disagree with certain laws personally, but as long as they can put that aside and defend their client to the best of their ability, they're not disbarred. Doctors should be the same way. They may personally disagree with a certain procedure a client wants, or with vaccines in this case, but as long as they either put that aside for their client or work in a field where it wouldn't come up, it should be fine. If it does impede with their work/ impact their clients, it's already considered malpractice. So the only other option is for malpractice to also apply to thoughts/opinions and not direct actions, which is pretty hard to police.",
            "title_similarity": "0.6840664",
            "sentiment_compound": 0.928
        },
        {
            "id": "h2bh1x9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2bhpot",
            "score": 1,
            "text": "I agree that if licensed medical workers openly speak against the vaccine, that is unacceptable in most cases but I don't think they should lose their licenses over it. I get both sides of the argument pertaining to this. Most vaccines now are not really needed and as far as coronavirus is concerned, it was never high on the list for leading causes of medical deaths ever, even at its peak. So a vaccine for a virus that didn't make it on the top 10 of leading Medical deaths but gets a very poor trial and error vaccine that must be taken and is often being bribed to take does raise red flags. For example, heart disease, diabetes, hypertension and stroke still will kill 20x more than coronavirus ever did. When you look at pandemics in history, millions of people died before any effective vaccine could be established. Yes it's 2021 and medical advancements along with science is modern and manufacturing is unlike any other time in history but the human body and the nature of viruses will never change. Scientist or waitress at a restaurant, you still need the virus to run its course through society before an effective vaccine could be made. Viruses change like the human body's response to it. In order to make an effective vaccine, you need to see all it can do and all it effects. The Spanish flu needed 2 years before they made a perfect or close to perfect vaccine for it. Over 80 million died before that could happen. This is not the case for the coronavirus because it has only been a year and it is still not done running its course. Not to mention it's no different than the flu except it causes clotting of the blood, the same thing the vaccine causes also. Bottom line there's an agenda at play and there's no way that particular vaccine has been prepared correctly with the virus STILL MUTATING AS WE SPEAK. I understand you feel like Medical licenses should be revoked but I say if someone that intelligent is speaking against it then I'm sure it's for good reason because they themselves wouldn't put it in their own bodies and you have to ask that type of person with those types of accomplishments, WHY?",
            "title_similarity": "0.70240456",
            "sentiment_compound": 0.9171
        },
        {
            "id": "h2bhrmu",
            "score": 1,
            "text": "All medical procedures should be done after a risk/benefit assessment. \n\nIs the risk of procedure X greater than the risk of foregoing?\n\nThis varies individual to individual, and procedure to procedure.\n\nIf there was a vaccine in which the risk of the vaccine was greater than the risk of the virus, would you want doctors who advise this shunned? Or should doctors that advise a riskier procedure be the ones that are shunned?",
            "title_similarity": "0.6865128",
            "sentiment_compound": -0.6174
        },
        {
            "id": "h2bhucn",
            "score": 2,
            "text": "So should the religious medical workers lose their licenses too, since they believe in a mystical creature that has superpowers?",
            "title_similarity": "0.7339011",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2bi72h",
            "score": 1,
            "text": "This is a horrendous take. Because of your stupid opinion, they should take reddit from you. Is that how this works?",
            "title_similarity": "0.6781111",
            "sentiment_compound": -0.802
        },
        {
            "id": "h2bid1l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bimk5",
            "score": 1,
            "text": "Meh if you've already had it, I'm skeptical of the need.  It hasn't been able to be tested for long term effects and the big kicker...THEY MADE THE VACCINE COMPANIES IMMUNE TO ANY LIABILITY.",
            "title_similarity": "0.6320198",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2bimtd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bj0pg",
            "score": 1,
            "text": "Lot has already been said but one point I haven't heard is that your target audience is antivaxxers themselves. Sure if they get an antivax provider you could have some bad outcomes in those rare cases\n\nBut I imagine the antivax audience might write off doctors altogether if supporting vaccines was a decision made by the liscencing authority (aka 'kabal') who then threw dissenting doctors out. \n\nI think it's much more powerful for the antivax audience that each doctor personally has come to the conclusion that vaccines are definetly worthwhile, especially because the suggeted answers to vaccine hesitancy often include \"I got the vaccine myself at the earliest opportunity.\"\n\nSo not a complete rebuttal but I think it might not convince the ones who need convincing",
            "title_similarity": "0.7357",
            "sentiment_compound": 0.9264
        },
        {
            "id": "h2bj2rh",
            "score": 1,
            "text": "I’m not going my to change your view because as a medical student, I agree with you. My cousin sees a PA for psych for long-standing depression. She asked him if he was getting the CoVid vaccine and when he said “not yet, but I plan to,” she went into a rant about how “he will become infertile.” Thankfully my cousin isn’t super impressionable and knew to call me to talk about it. \n\nI was fucking livid. Her responsibility is to her patients, and her can keep her bullshit fucking politics out of the exam room. She deals with vulnerable patients every day. Who knows what else she was telling other patients who may not be as educated or in mentally vulnerable positions.",
            "title_similarity": "0.7518666",
            "sentiment_compound": -0.8569
        },
        {
            "id": "h2bji61",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bjihs",
            "score": 1,
            "text": "This is a much bigger topic than I think you give it credit. And it’s sort of a moving goal post situation, if somebody says they aren’t sure about the data you say they are just being cautious and that’s not antivax. If they say well you should space out certain vaccines over a few years and certain ones aren’t necessary you can just say they are being a normal doctor who is managing their patients health effectively. On the other side of the spectrum are they anti-vaccine because they claim vaccines cause autism? Or are they anti-vaccine because of their religious beliefs? There are some sects of religion that are anti vaccines, but aren’t screeching on Fox News about it and you’d never know if they didn’t tell you. Are they denying to give vaccines? Or just won’t get them themselves? It’s hard to have this conversation without narrowing in on what specifically you are saying. What if a nurse in a remote wilderness town is the only medical professional for hundreds of miles? If they are antivax should they be barred from medical practice? That community relies on them.\n\nI think you are missing one big area of discussion as well which is specialization. Do I have an opinion on my general practice doctor saying they are anti-vaccines? Yes. Do I have an opinion on a sports therapist or other super specialist role being anti-vaccine? Not really.  I don’t expect a chiropractor to give me medical advice related to vaccines. I also don’t expect my GP to give me recommendations for surgery. Medical licensing spans a very wide spectrum of roles.  I have known plenty of doctors that were insufferable pricks in every social aspect I experienced with them. But when it came down to medical advice they are spot on and can make the right decision.\n\nTL:DR; This isn’t as simple a conversation as most people think it is. I am vaccinated (for covid too) and I encourage everybody to get vaccinated for whatever is relevant to them.",
            "title_similarity": "0.6983309",
            "sentiment_compound": 0.9361
        },
        {
            "id": "h2bjkxu",
            "score": 1,
            "text": "I think if your a quack that promotes Covid shots as a \"vaccine\" you deserve to be hung for human rights violations and ofc lose your license.\n\nCovid shots are not a vaccine, its a theraphy.",
            "title_similarity": "0.8096357",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2bjxt1",
            "score": 1,
            "text": "How about talk to your doctor personally if your doctor says you do not need it it’s between you and your doctor. Canada Sucks",
            "title_similarity": "0.7636827",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2bk6q8",
            "score": 1,
            "text": "Depends on your country. In the US where there have been cases of experimenting on people of color, delivering diseases to subjects in the name of providing cure, then people have the right to be weary of vaccines.",
            "title_similarity": "0.7456138",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2bk7bg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bke3q",
            "score": 1,
            "text": "I'm sure there were these types of people when the polio vaccine was introduced (minus the chip implant of course) and they'll either change or be left behind.",
            "title_similarity": "0.694181",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2bkpki",
            "score": 1,
            "text": "Not a fan of equating this particular vaccine with all vaccines from decades ago. It’s not the same to be against the measles vaccine and to be against the CoVid vaccine until we have more data. I’m not against it, but I also don’t like how we are shitting on people for wanting to know a little more.",
            "title_similarity": "0.67794526",
            "sentiment_compound": -0.2337
        },
        {
            "id": "h2blcmw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2blk1t",
            "score": 1,
            "text": "The vaccines are not FDA approved. They have emergency use approval. There is no long-term data. Everyone should retain the right to refuse the vaccine or criticize it, and its large-scale distribution until there is proof that the benefits outweigh the costs. It is not antivax to believe that a young child with a 99.997% chance of surviving the virus should not be mandated to receive the vaccine. Nevermind the fact that vaccine companies in the US are not liable for adverse reactions. Neither is the government.",
            "title_similarity": "0.68679523",
            "sentiment_compound": 0.0201
        },
        {
            "id": "h2blvgr",
            "score": 1,
            "text": "Science is based in skepticism and asking questions.  Healthcare professionals specialize in the field of medical science.  Just because this particular vaccine should be recommended for everyone doesn't mean the same thing applies to every future vaccine.\n\nIf there was hypothetically a vaccine for a disease even more mild than COVID with a rate of adverse effects significantly higher than our current vaccines, to the point where it's only worth taking in specific instances, and more deadly than the disease in other cases, do you think it would be a good idea to revoke the medical licenses of doctors who don't recommend a potentially dangerous drug?\n\nIn addition, in America there are arguably legitimate reasons to be concerned about the COVID vaccine.  A big one is the fact that getting the vaccine requires waiving all rights to financial compensation.  There are people who were hospitalized after getting the vaccine and left with a mountain of medical bills that the administering doctor, vaccine manufacturer, the government, and even their insurance companies refused to cover.  At the end of the day getting the vaccine is a personal choice, and as long as a doctor doesn't force the vaccine onto unwilling people or refuse to administer it to people that want it, their personal feelings and recommendations they make to patients shouldn't be grounds to revoke their medical licenses.",
            "title_similarity": "0.72230965",
            "sentiment_compound": -0.8025
        },
        {
            "id": "h2blwey",
            "score": 1,
            "text": "Hi Op， I think you should clarify that anti-vax are people who fundamentally disagree with the practice of vaccination, not the people who doubt certain types of vaccines. A lot of answers here do not acknowledge the difference and it's painful to read.",
            "title_similarity": "0.7367822",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h2bm2bn",
            "score": 1,
            "text": "The anti vax label is incredibly dismissive. Vaccines, just like all other medications, have the potential for side effects and risks. People with allergic reactions, or other adverse reactions should not be pressured to take or promote vaccines. Vilifying anyone with concerns about vaccines eliminates the opportunity for real, critical discussions seriously weighing the risks and benefits of each vaccine.",
            "title_similarity": "0.74105597",
            "sentiment_compound": -0.2579
        },
        {
            "id": "h2bm6m2",
            "score": 1,
            "text": "Not really a point agreeing or disagreeing with you, but my friend who's a nurse says one-third of her peers are anti-vax and will tell patients that if they ask. They don't ever force anything, but they don't hide how they feel about their worries. She works in an area with a big Orthodox Jewish population (about a quarter of my area's population is Jewish, myself included, one of the highest density's of Jews in the world), so that definitely influences it based on staffing, but still I was very shocked by it. \n\nI thought vaccinations were such a fundamental part of the modern medical profession for nurses, I'm very curious to why a nurse would be involved in it. If I was fully against surgeries of any kind, I feel like I would just avoid working with any patients that required surgery and never work in a hospital.",
            "title_similarity": "0.5994265",
            "sentiment_compound": 0.9105
        },
        {
            "id": "h2bmoqq",
            "score": 1,
            "text": "We still don't know the longterm (side) effects of these new vaccines. I now many people who have all the vaccinations avaiable but rather wait this one out, especially when they are not in a risk group and healthy.",
            "title_similarity": "0.61297935",
            "sentiment_compound": 0.6976
        },
        {
            "id": "h2bmsu8",
            "score": 1,
            "text": "There are idiots in every profession. We shouldn’t fire people based on the ideologies as long as they do their jobs correctly and they don’t hurt anyone. \n\nIf we made having an iq a requirement for jobs, many people would lost their jobs. Just think about it. Haven’t you worked with people that spew crackpot theories?",
            "title_similarity": "0.62915295",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h2bn09d",
            "score": 1,
            "text": "For some people, anti-vaccination stances aren’t even about the accidental mishaps of the chemicals, or “a belief in the science”. It’s about a belief in the *scientists*. \n\nI don’t trust Pfizer or J&J for shit. They don’t give a fuck about us. They care about money and if they could make another billion dollars for another million people to die I bet they’d do it in a heartbeat. \n\nI only trust a vaccine if the financial incentive and pressure allow it to be trustworthy. The world couldn’t afford a delay in the COVID vaccine rollout, so any number of issues with it would have gotten swept under the rug. 25% chance that every dose causes a second dick in 5 years? Fuck em, do it anyways. \n\nThey didn’t have the same downside pressure when trying to cure rubella or whatever.",
            "title_similarity": "0.6353215",
            "sentiment_compound": -0.7522
        },
        {
            "id": "h2bn1p4",
            "score": 1,
            "text": "That seems unconstitutional to me. While granting a license to practice is a privilege, the government can’t remove a privilege for things like protected speech.",
            "title_similarity": "0.5193145",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h2bn80f",
            "score": 1,
            "text": "I would say the argument depends on if there is misinformation present or if there is bandwagoning going on. For example, it is true that there are no long term studies on the safety of the covid vaccine simply due to the fact that the vaccine is less than 2 years old. This isn't a bad thing, but to remove everyone who doesn't follow the status quo is a disservice if there is no misinformation going on and some practicioners heir on the side of caution. Sometimes groups can have differences in opinion without either of them being anti science.",
            "title_similarity": "0.606738",
            "sentiment_compound": 0.0562
        },
        {
            "id": "h2bn9gp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bndt9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bnkdr",
            "score": 1,
            "text": "Chris Paul got the vaccine and then got Covid. What about the person who told him to get the vaccine? Should the doctor who administered the shot be de-licensed? \n\nReddit allows Pro-vax talk only. I accept your downvote if you feel strongly enough to do so. \n\nHave a great life",
            "title_similarity": "0.68152946",
            "sentiment_compound": 0.8466
        },
        {
            "id": "h2bnm0b",
            "score": 1,
            "text": "I have to disagree based purely on how you present this argument and statement.\n\nAntivax medical professionals should *not* lose their licenses simply for being antivax.\n\nIf they're actively promoting their beliefs/agenda and are telling everyone that they're really dangerous, sure, remove their license because that's dangerous behaviour that is directly affecting others. However, one's beliefs can be kept to oneself whilst still leaving them fully capable of performing their healthcare duties to other people.\n\nIt seems that you have a flaw in your critical thinking ability if you hadn't considered that this is a very real scenario that does not have to affect the way the healthcare professional treats their patients.\n\nAssume for the sake of argument that I'm antivax ^^I'm ^^not and a patient comes to me to be vaccinated; I can either give them the vaccine (if I'm a provider of said service) or I can direct them to the local vaccination hub.\n\nNeither of those two outcomes are neglecting my duty of care to my patient despite my personal beliefs.\n\nJust because ***I*** would refuse to take it, doesn't mean I'll tell others that they're not allowed.\n\nI don't smoke at all, and rarely drink alcohol (less than once a year), but I don't tell other people that they can't or shouldn't, because my beliefs are just that... they're *my* beliefs for how *I* want to live, and everybody is entitled to their own beliefs as long as they don't encroach on the rights and freedoms of others.",
            "title_similarity": "0.7899873",
            "sentiment_compound": 0.3571
        },
        {
            "id": "h2bno2r",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bnpic",
            "score": 1,
            "text": "i don't think that the state should have any say over who has a license to practice medicine. i am pro-vaccination in most cases but i also don't demand that others must share my views in order to supply services to willing parties. freedom is better.",
            "title_similarity": "0.61143184",
            "sentiment_compound": 0.9556
        },
        {
            "id": "h2bo7de",
            "score": 1,
            "text": "You would end up with entire counties without nurses if you did that. In principle I agree, but it's not practical. Even if you're anti-vaxx, your labor is still needed and in short supply, so we have to tolerate these reprehensible views for now.",
            "title_similarity": "0.6859912",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h2bpgvn",
            "score": 1,
            "text": "No",
            "title_similarity": "0.11578642",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2bph0d",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bpivq",
            "score": 1,
            "text": "This is a very very dangerous line to cross. Punishing people for what they think isn’t okay. Everyone’s entitled to their opinions, as horrible and as stupid as they may be….this reminds me of the “chilling effect”",
            "title_similarity": "0.62746096",
            "sentiment_compound": -0.9036
        },
        {
            "id": "h2bq0qf",
            "score": 1,
            "text": "This works until you get a system that evolves to hate anything other than what \"big pharma\" or other massive corporations approve of.\n\nYou can also have opposing viewpoints to generally accepted facts, just don't let them impact your job.\n\nA science teacher can be religious and reject evolution personally, but still teach it accurately and sincerely.",
            "title_similarity": "0.6963607",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2bqojm",
            "score": 2,
            "text": "What about against some vaccines? My children's doctor recommended they get some of the regularly scheduled vaccines, but others she said the risks of the vaccines for infants were greater than the risk of getting the diseases. I'm not positive which, but I believe the hepatitis vaccine infants normally get were one our doctor recommended we didn't need. Our doctor recommended us a book that had good information about each of the different vaccines individually, so we could decide about them individually. I'm thankful we had a doctor like that. I fear what you're recommending would've kept us from having a doctor like this.",
            "title_similarity": "0.651802",
            "sentiment_compound": 0.8739
        },
        {
            "id": "h2bqux8",
            "score": 1,
            "text": "Yay thought crime!  Maybe we can cut off one of their ears too so we can see at first glance that they're social dissenters!",
            "title_similarity": "0.6052172",
            "sentiment_compound": -0.4184
        },
        {
            "id": "h2br2va",
            "score": 1,
            "text": "That is kinda censorship. They may not be right, and sure they have to be a leading example. But you cannot censor people for thinking something else. They have to have a voice..",
            "title_similarity": "0.550207",
            "sentiment_compound": 0.5954
        },
        {
            "id": "h2br9di",
            "score": 1,
            "text": "Taking away a doctor's license is a huge legal minefield. Unless you commit a massive mistake, it's going to be a huge pain for the licensing boards to revoke your license. The ones who will rule on these cases are not doctors, they are regular judges. Doctors are allowed to be wrong and have mistaken beliefs and unless that mistaken belief DIRECTLY leads to someone's death or morbidity, they cannot be held liable.",
            "title_similarity": "0.75197184",
            "sentiment_compound": -0.886
        },
        {
            "id": "h2brcfd",
            "score": 1,
            "text": "All kinds of doctors practice with their own medical opinions.  If you don't like what that Dr. says, find another doc.  Same goes for everyone in the medical profession.  Why would you assume that you have the right to foist your opinions on others?",
            "title_similarity": "0.68373185",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h2brtds",
            "score": 1,
            "text": "In fact, it is my contention that a licensed medical practitioner shouldn't \"take a position\" on any medical issue, pro or anti. Where there is sufficient evidence available, they must act based only on fact, not opinion.\n\nThe position of authority they speak from must be rooted in the body of medical evidence, not in the fallacious appeal to authority which many sheeple are happy to accept. \n\n\"Taking a position\" means being willing to accept assumptions over facts, as long as it supports the position taken. That's a clear sign on a lack of academic integrity (or in your words \"grotesque lack of critical thinking\") and any such person should not be conferred a diploma, let alone be granted a license to practise that has life-or-death impact on others.\n\ntl;dr - if one takes a position, pro or anti, they already don't deserve a medical license.",
            "title_similarity": "0.68693835",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h2brubr",
            "score": 1,
            "text": "You have the right to choose your doctor. You do not have a right to decide what every doctor thinks or the services they are willing to provide (vax, abortion, etc). Your opinion on their opinion couldn't be less important. Being \"antivax\" does not hurt anyone just as being \"anti-abortion\" does not. You can go find another doctor if you, the patient, wants something a doctor does not provide.",
            "title_similarity": "0.66419697",
            "sentiment_compound": 0.3401
        },
        {
            "id": "h2brwa4",
            "score": 1,
            "text": "Doctors are people too, they should have the freedom to deny putting things in their bodies if they don't want either, no matter how dumb the reason.",
            "title_similarity": "0.6546695",
            "sentiment_compound": -0.2013
        },
        {
            "id": "h2bsaq9",
            "score": 1,
            "text": "Yeah? Well I think there should be laws regulating your BMI like in Japan. But then again, that's sort of the point of America.. lmao.\n\nAnd if you think my comment's cruel consider less than 4% if the population is obese there. Now consider if we treated \"dumb\" anti-vaxxers just like the \"inferior\" fat people in Japan, we could have 96% of people vaccinated and your STUPID herd immunity pipe dream will come true. \n\nBut OH WAIT, you've become  a nazi state? Yeah, that's pretty much your only option for controlling \"stupid\" people. \n\nAlso, should the person who discovered AIDS lose their career, because they don't support an experimental vaccine that has been proven to leak spike protein into your fucking skull? You useless cunt.\n* He asserted that variants are a consequence of natural selection due to vaccinations.\n* He says that ADE would lead to much stronger infection by variants in vaccinated people.\n* He calls massive vaccination a ‘medical mistake’.\n(https://science.thewire.in/the-sciences/luc-montagniers-views-on-covid-vaccines-are-latest-of-his-wrong-vexing-ideas/) \nNobel peace prize winner and expert in virology but obviously should lose his career because it doesn't fit big pharmas massive healthcare agenda. You are no better than a nazi and a bigot.",
            "title_similarity": "0.67352283",
            "sentiment_compound": -0.754
        },
        {
            "id": "h2bsm56",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bt6nt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bt76v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2btgo0",
            "score": 1,
            "text": "Fuck it, let's just start killing antivaxxers and conspiracy theorists, the world would be a much better place if everyone had complete utter trust in their governments and the megacorps that run them.",
            "title_similarity": "0.57660407",
            "sentiment_compound": -0.701
        },
        {
            "id": "h2btnvv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2btsx6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bty80",
            "score": 1,
            "text": "Most anti-vax doctors have there medical licences revocked (or never had one in the first place). The problem is medical boards can't revoke medical licences for saying dumb @$!#, they can only revoke a licences for malpractice. Untill a anti-vax doctor has done irrefutable harm to a patient, there's not a lot we can do about the quack. [Take this video essays about Andrew Wakefield by hbomberguy.](https://youtu.be/8BIcAZxFfrc) It took years for the British medical boards to revoke his licenses. And it wasn't even about his anti-vax @$!#, it was about his finanical conflicts of intrest, the abuse of the children in his study, and his falsification of data.",
            "title_similarity": "0.7830181",
            "sentiment_compound": -0.9508
        },
        {
            "id": "h2bu75z",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2buhoh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2buodq",
            "score": 1,
            "text": "But now aren’t you controlling someone’s living because of a belief?  Seems like it doesn’t prevent you from getting a vaccine, nor do you need their permission.  I guess I have a hard time with people using threats of losing their job as a means to control a populace/group.  This is not morally or ethically right.",
            "title_similarity": "0.64368546",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h2buwuf",
            "score": 1,
            "text": "Nope, plenty of healthcare workers in Canada post antivaxx publicly and don’t lose their jobs.",
            "title_similarity": "0.5856725",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2bv2wq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bvro2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bw61v",
            "score": 1,
            "text": "If I view this as a healthcare policy..I would say that openly promoting this view should trigger an investigation by a medical board from which that HCP holds a license.  They can be subject to disciplinary action, one of which is a suspension or permanent loss of license.  \n\nI think they should also be given the opportunity to retract their statements in public/to patients, or be educated/trained so they have an opportunity to change their anti-vax stance.  \n\nSo agree with the premise, but disagree with as policy.  Apologies if I just straw-manned your statement, I am sure canada has a well thought out process on HCP anti-vax promoters.",
            "title_similarity": "0.8640963",
            "sentiment_compound": 0.7368
        },
        {
            "id": "h2bw7b5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bwf1j",
            "score": 1,
            "text": "That's for medical review board to decide. You're idea opens up medicine to the theatre of public opinion, do you really want science influenced by anything but objectivity?\n\nI'm for a medical review board adding this criterion to their review slate but I'm not for that opinion being held or discussed by anyone not in the field. It's too dangerous for that to happen.",
            "title_similarity": "0.7623248",
            "sentiment_compound": -0.5932
        },
        {
            "id": "h2bwo5u",
            "score": 1,
            "text": "IMO anti-vaxx doctors should be asked to cite their reasons in the form of a peer reviewed scientific paper. They should be scientists as well as doctors (doctors first), this will give them a chance to look over the evidence and change their minds, if they don't then we don't need doctors who don't change their practices to meet centuries old scientific standards.\n\nAnti-vaxx nurses should be forced to attend vaccine courses or lose their license. Like any employee who doesn't meet company standards they obviously need some guidance.\n\nOf course both should be on unpaid suspension until they do what is asked.\n\nBut it's okay because most anti-vaxx doctors and nurses are actually chiropractors or energy healers, not actually MDs or RNs, (some actual nurses, but very few actual doctors are anti-vaxx). It's more the kind of \"I'm A dOcToR herp-derp\" types.",
            "title_similarity": "0.8131025",
            "sentiment_compound": 0.6059
        },
        {
            "id": "h2bwrji",
            "score": 1,
            "text": "Do you think doctors who were anti-mask should lose their license as well?  If not, why no consistency here?",
            "title_similarity": "0.8009317",
            "sentiment_compound": 0.165
        },
        {
            "id": "h2bwzrd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bx8df",
            "score": 1,
            "text": "People who are antivax in general are idiots. People who oppose specific vaccines may be correct and have a right to express those opinions without fear of persecution. There are many valid arguments against getting the new covid vaccines for example.\n\nAnyone who argues against free speech is a fool who should be told to shut the f up so long as it's not the government or an institution who's telling them.",
            "title_similarity": "0.7374099",
            "sentiment_compound": -0.312
        },
        {
            "id": "h2bxat8",
            "score": 1,
            "text": "Vaccines have directly caused over population issues. I am against them only due to the fact that we are not letting nature take its course. This overpopulation is causing a massive extinction on earth, covid is just one of many of earths responses to an infinite supply of people. Sure go strip doctors licensees away, I agree with that, the more medicine consists of people that can’t think the better. In fact fire every doctor for disagreeing with you, and fire your teachers for failing you in class. It benefits humanity if we’re all yes men that gladly take a 9 incher in the pooper for some old farts that should’ve died a long time ago. Watch this comment be removed, but fuck old people. Let them all fucking die. No one gave a fuck about my friends in Iraq dying, or the kids in Syria, no one shut the world down for millions of young people dying. No one is shutting the world down till we figure out how to make driving not kill 1 million or so people every year. But the second some old fart sneezes “SHUT THE WORLD DOWN”. My point is fuck you, fuck modern medicine and yes everyone should be fired, including you for even having a thought in that thick skull of yours.",
            "title_similarity": "0.75338435",
            "sentiment_compound": -0.9809
        },
        {
            "id": "h2bxcft",
            "score": 1,
            "text": "I still have a major phobia of needles, but I can say that the needle from the Moderna vaccine was tiny so I had nothing really to worry about. Also being in my early 20s, the only reaction that I had was sleepiness but that can be different from other people and the soreness of my arm but that was pretty much all that was it. But there are some people who think that there is a microchip in the vaccine and some doctors think that you shouldn’t get it because you might possibly be tracked and that’s a little bit far out there because it’s just it’s a little unlikely sure it might be possible but to me in my opinion it’s very unlikely",
            "title_similarity": "0.5887269",
            "sentiment_compound": 0.852
        },
        {
            "id": "h2bxd8i",
            "score": 1,
            "text": "People are entitled to freedoms and nobody really knows for sure long lasting effects for every individual. Your talking about taking peoples careers away for a personal decision that people can choose to or choose not to listen too. I’m not for ruining peoples lives",
            "title_similarity": "0.5391115",
            "sentiment_compound": 0.7652
        },
        {
            "id": "h2bxh0j",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bxne8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bxo37",
            "score": 1,
            "text": "This is like saying an astrophysicist who doesn't endorse the big bang theory should have their PhD revoked or nullified or whatever you do with PhDs.\n\nScience is about asking questions first and foremost. It's about trying to disprove a theory or practice. By revoking a doctors licenses for questioning the safety or efficacy of vaccines, you are punishing them for following the scientific method.",
            "title_similarity": "0.7906361",
            "sentiment_compound": -0.1685
        },
        {
            "id": "h2bxuug",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bxysg",
            "score": 1,
            "text": "Might want to check out some of the latest research on the Covid vaccines. Due to FOIA requests at least one thing that has been found is that instead of the lipids staying in the shoulder area and being broken down the lipids are spreading throughout the body. The largest  concentrations within the first 48 hours settle in the ovaries and the bone marrow. It has also been found that the spike protein itself is dangerous and cytotoxic. There is a difference between being anti-vaccine and continuing to do research on something that is brand new. If you ignore new research because it doesn’t fit your preconceived ideas about a subject than you are just as bad as an anti-vaccine person and perhaps need to lose your license.",
            "title_similarity": "0.7196473",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h2bxz33",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2by8ae",
            "score": 1,
            "text": "I agree with the sentiment but we have to be careful when making broad statements. I think if medical professionals are spreading misinformation about health in any capacity then it should be looked into and seriously scrutinized, however one of the great things about science is that it’s critical of it’s self and if and expert can back up their thoughts with real evidence than it should be taken seriously even if it goes against common rhetoric.\n\nThat also doesn’t necessarily mean it’s ok to be using evidence that the medical community at large hasn’t had a chance to look into properly to make decisions on health  for patients but using extremely broad language like “ativax doctors should loose their license” leaves a lot up for interpretation even if it’s specific enough for society as a whole to use on a I know it when I see it basis.\n\nBut yes, the alarming amounts of misinformation being spread about vaccines needs to be addressed, especially in the medical community where vulnerable people should be able to trust their providers.",
            "title_similarity": "0.70970714",
            "sentiment_compound": 0.8499
        },
        {
            "id": "h2byalo",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2byl5i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bytie",
            "score": 1,
            "text": "I think saying “people that are anti-vax can’t think critically” shows that you can’t think critically. You just listen to everything someone says and don’t even question it.",
            "title_similarity": "0.5871987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2byw12",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2byy2q",
            "score": 1,
            "text": "Speaking of Quackery….. when Dr. Oz says on national TV that he won’t endorse vaccinations because his wife is not sure they are safe, you know he should never have been given a medical license, and should not be allowed to spout nonsense on TV to the millions of half-wits who watch him every day.",
            "title_similarity": "0.6935575",
            "sentiment_compound": 0.1376
        },
        {
            "id": "h2byypt",
            "score": 1,
            "text": "I had COVID recently, I don’t even have my smell back. \n\nI will not be taking the vaccine, at this point it’s a simple equation of risk management. \n\nWe don’t know the long term affects of COVID, we also don’t know the long term affects in the vaccine, If any. I’m young and survived and now I should have immunity for the foreseeable future. This is basic science and immunology. I still have people angry at me I’m not taking the vaccine and it’s ridiculous. \n\nI don’t think any doctor should recommend me the vaccine, I see no point in having it.",
            "title_similarity": "0.7222918",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2bz1i5",
            "score": 1,
            "text": "So, they are unable to heal and save lives because of one of their opinions? You will ruin lives of capable doctors and nurses because of their medical opinion? You are talking like doctors and nurses grow on trees, like they are some fast food workers who are easy to replace. You are a terrible person and you should lose your life. See, I can also do it, just to a higher degree. No, I'm not joking, people like you shouldn't exist.\n\nHow about listening to their arguments and having open debates with them? \n\nI'm not pro or anti vax, I'm \"i don't give a fuck what happens vax\".",
            "title_similarity": "0.76946133",
            "sentiment_compound": 0.4545
        },
        {
            "id": "h2bzhjx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2bzmy3",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c0m6m",
            "score": 1,
            "text": "My goal after I graduate Nursing School is to call these people out and help make the medical community weed these types out for the future. If Scientists are partial to Anti-Intellectualism/Anti-Science sentiment, we are in a lot of trouble. Small numbers, but enough to build a movement...which we are seeing and need to reeducate.",
            "title_similarity": "0.76283455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2c0o4r",
            "score": 1,
            "text": "Would this policy have good consequences?\n\nMy estimation is that this policy would actually have bad consequences, as it would needlessly exacerbate the already-critical shortage of nurses and physicians that we have.",
            "title_similarity": "0.7330185",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2c0tru",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c0zsv",
            "score": 1,
            "text": "You can be pro vaccination, but not be pro covid vaccination.  I've had every shot under the sun, but I am hesitant to get an experimental, non FDA approved form of gene therapy that doesn't even do what it is supposed to do.\n\nMy prerogative has little to do with being an antivaxer.  I am being proactive about my own well being.  That being said, I have no issue with others getting it.  It's just not what I would consider wise for myself at this point in time.",
            "title_similarity": "0.5993724",
            "sentiment_compound": 0.872
        },
        {
            "id": "h2c13b9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c1f1h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c1fpb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c1k7w",
            "score": 1,
            "text": "I don't think doctors are antivax in general but rather their patients are antivax. Instead of arguing with their brain dead patients the benefits of vaccine outweighs the risk, it's easier just to agree with patients and hope herd immunity save them. Trying to convince antivaxxer to take vaccine is like beating your brain against the concrete wall. Their \"infallible\" logic will make your head spin.",
            "title_similarity": "0.6795333",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h2c1nc0",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2c1uo9",
            "score": 1,
            "text": "I couldn’t agree with you more. It’s an complete outrage that a competent medical professional of ANY kind would be anti-vaccine.",
            "title_similarity": "0.69715834",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h2c2lhg",
            "score": 1,
            "text": "I agree only during this pandemic, because drs are supposed to recommend something based on the benefits outweighing the risk. At least that’s my understanding, so the doctors who oppose it either don’t believe in covid to start with, or must have some incredible research about the vaccine will harm us.",
            "title_similarity": "0.74862874",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2c31ax",
            "score": 1,
            "text": "So...the axiom of 'my body, my choice' no longer matters? \n\nThat's horrifying.",
            "title_similarity": "0.5043344",
            "sentiment_compound": -0.7162
        },
        {
            "id": "h2c35t7",
            "score": 1,
            "text": "Question: Why do you think so many healthcare professionals, nurses, doctors, and scientists are speaking out against the vaccine? What's the incentive to do so?",
            "title_similarity": "0.7218157",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h2c3645",
            "score": 1,
            "text": "\"reward me with internet points for posting about an overwhelmingly popular position\"",
            "title_similarity": "0.18845704",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h2c3fwd",
            "score": 1,
            "text": "Antivax or anti-covid-vax? It is perfectly reasonable to be hesitant about the covid vaccines, as they have not had the same long-term trials as other vaccines. It’s also reasonable to be against the flu vaccine, because it’s just a guess of what strain will be going around that year, and they’re usually wrong.",
            "title_similarity": "0.69040304",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2c3ina",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c3nc0",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c3vrz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c3z2a",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c4499",
            "score": 1,
            "text": "There are good reasons to oppose the vaccine, like it not being fully FDA approved for us in the US. \n\nAlso, everyone deserves the right to their own opinion and the right to speak how they want. A doctor or medical professional opposing the vaccine doesn’t make them any less qualified to do their job.",
            "title_similarity": "0.7037955",
            "sentiment_compound": 0.8307
        },
        {
            "id": "h2c44yx",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c4fyy",
            "score": 1,
            "text": "I'm curious if you also agree healthcare providers should lose their license for refusing *any* vaccine on the recommended schedule.\n\nIn the U.S., the flu vaccine is on the CDC yearly schedule. Incidentally, it is *not* on the recommended schedule in the EU because the U.S. And EU have different philosophies and a different number of vaccine doses available to the general populace.",
            "title_similarity": "0.7999288",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h2c4qxc",
            "score": 1,
            "text": "Idk, I think vaccines in general this could be true.  However, the covid vaccine could be taken with skepticism.  The medical field is always changing and exploring what the truth is, sometimes they are wrong.  Smoking used to be \"healthy\".  We are coming out of a horrible opioid epidemic because the medical field was being unethical.  Is it possible they are doing it again?  Right now, there are several prescription medicine or medical procedures that have class action law suits going on.  They all went through rigorous testing by the fda.  I think Doctors could say, \"You need to do the research for yourself, here are legitimate sources.\"  For me the risks of taking the vaccine were worth it, but for others Im not so sure.",
            "title_similarity": "0.7499466",
            "sentiment_compound": -0.7657
        },
        {
            "id": "h2c4uzs",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c517u",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c57l5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c5fug",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c5txn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c64ab",
            "score": 1,
            "text": "what if one day a secret agency invents a vaccine that will kill the world and only a bunch of doctors find out and try to warn society ?",
            "title_similarity": "0.668419",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h2c65gv",
            "score": 1,
            "text": "Answer is always - it depends.\n\nIf they believe that vaccine was not tested enough or that we don't know long term consequences - that's a reasonable argument.\n\nIf they are that autism group - you are right.",
            "title_similarity": "0.6490009",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2c6d6d",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c6kfn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c77hn",
            "score": 2,
            "text": "Depends what you see as antivax views\n\n\"vaccines are all bad and cause autism and contain 5g chips\" yeah those people are cavemen\n\n\"this specific vaccines can cause bad allergic reactions for you so I'd advise against it\" is not an antivax view despite being against a vaccine for someone.",
            "title_similarity": "0.75409484",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h2c7rgm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c7zsb",
            "score": 1,
            "text": "There have been many proven examples in the past of people being treated unethically via vaccines. [The Tuskegee Experiment](https://en.m.wikipedia.org/wiki/Tuskegee_Syphilis_Study) was preformed by the CDC and the US Public Health Service, mainstream institutions that you would today argue that physicians should tow the line of.\n\nHealth institutions are also influenced by the powers-that-be, private or governmental. Many of them are not doing what is best for the public, but what is best for profit or the state in general. If there were unethical practice coming from some institutions through vaccines, a blanket law like this could be used maliciously to silence people who would get in the way of a genocide campaign, profit, or any intentionally unethical practice in general.",
            "title_similarity": "0.697919",
            "sentiment_compound": 0.8674
        },
        {
            "id": "h2c80fo",
            "score": 1,
            "text": "I am a doctor, i took two coronavac doses (china's vaccine) and will take a third and forth pfizer vaccine sometime this year... And I'm antivax supporter in a way, let me explain...\n\nFirst of all, you cannot force anyone who is not a child, has a mental disability or a person with a acute mental state that inhibits him/her from passing judgement to ANY medical prosedure... It includes even life saving, must have ones... And I think vaccines are no different.\n\nYou cannot force people (mentally capable adults) to take any drug, any procedure or any vaccine, its againts all the things we are told in medical school... No, we are not living in a dictatorship (well most of us) and even if its for the better of millions, we cannot force people into injecting what they thought is poison (well its idiotic but who am i to judge idiots)\n\nWell, thats all i guess, one major \"contraindication\" for you...\n\nYou can limit access to people who are not vaccined, like banning them from privately owned stores, you can limit their working passes and make them leave their jobs, by passing laws to enforce it... But you can never, under any law, force someone directly to take a vaccine...",
            "title_similarity": "0.68993986",
            "sentiment_compound": -0.1318
        },
        {
            "id": "h2c8dls",
            "score": 1,
            "text": "Yeah... nobody should be able to speak out against the almighty corporations, whose intentions are always pure and whose products are always harmless and perfect. You're perfectly right about everything.",
            "title_similarity": "0.4245462",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h2c8f9m",
            "score": 1,
            "text": "“Someone who disagrees with my opinion should loose there ability to work because I say so” is the most idiotic/selfish thing I have ever heard. Get off reddit and go read a book troll.",
            "title_similarity": "0.68272614",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2c8r92",
            "score": 1,
            "text": "There is only one reasonable Antivax viewpoint. And that is specifically for the Coronavirus vaccines.\n\n\nIt is absolutely reasonable to be leery of getting a vaccine that requires you to sign away your right to sue the company in case of dire side effects. There is a tacit implication that not even the creators can be reasonably sure of the vaccines safety. It doesn't make you a crazy person to be cautious of this fact.\n\n\nOther than this specific viewpoint all licensed Healthcare providers should overwhelmingly support vaccines.",
            "title_similarity": "0.7231424",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2c8z9n",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2c90ds",
            "score": 1,
            "text": "Its like the Pope who doesn't believe in God.",
            "title_similarity": "0.4619561",
            "sentiment_compound": 0.1744
        },
        {
            "id": "h2c91to",
            "score": 1,
            "text": "Anyone of some level of authority who knowingly and intentionally propagates out right, objectively false medical information that results in one or more death should be shot in the stomach with small caliber weapons' until dead.",
            "title_similarity": "0.64148927",
            "sentiment_compound": -0.902
        },
        {
            "id": "h2c92pj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c9hve",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c9pn0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2c9wpf",
            "score": 1,
            "text": "Can we add into this adding or running a healthcare facility with a religious bias?\n\nReligion needs to be kept entirely separate from things and places that people from all backgrounds need. Theres a hospital sort of close to where I live that will flat out refuse certain procedures for people on a religious basis.",
            "title_similarity": "0.77083373",
            "sentiment_compound": -0.128
        },
        {
            "id": "h2ca1ex",
            "score": 1,
            "text": "Can a nurse that refuses a vaccination and then quits their job (without being fired) collect unemployment insurance?",
            "title_similarity": "0.6627263",
            "sentiment_compound": 0.0062
        },
        {
            "id": "h2ca6sy",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2caq45",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cavkh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cb8r3",
            "score": 1,
            "text": "Most certainly not, it’s a doctors responsibility to know the side effects and long term impact or taking a medication any doctor or nurse advising against taking and experimental vaccine is doing their patients a huge favor",
            "title_similarity": "0.7405624",
            "sentiment_compound": 0.7713
        },
        {
            "id": "h2cbbn3",
            "score": 1,
            "text": "yeah forget all the schooling and knowledge you have, let's just bar you from the medical field bc of an opinion.",
            "title_similarity": "0.7138284",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2cbh5u",
            "score": 1,
            "text": "I’m a nurse in the US and while I have not gotten the vaccine myself I would never discourage anyone from doing what they think is right for themselves. I don’t see why I should have to lose my license for that.",
            "title_similarity": "0.6338878",
            "sentiment_compound": -0.0946
        },
        {
            "id": "h2cbkjh",
            "score": 1,
            "text": "I am a registered and have taken vaccines and not against them. I think they are important. I believe people should have choice. I personally will not take a COVID vaccine. However, you come off very arrogant as if science or healthcare has no blemishes on its history and has been wrong on many occasions. Your opinion is not fool proof yet you are willing to snatch people’s livelihood because their opinion does not align with yours. That is a dangerous and wicked logic imho.",
            "title_similarity": "0.67915183",
            "sentiment_compound": -0.883
        },
        {
            "id": "h2cbtzv",
            "score": 1,
            "text": "u/daisychained23 You are trying so hard to find a reason not define anti-vax , to the point you are making no sense. I’ll help OP here, since I work in pharma. \n\nYour first point about phobia of needles is the exact reason why people that are able should be vaccinated, among others, however, I’ve yet to see that. \n\n\nYour second point; as long as you understand what you get injected with? I can promise you that you will not  understand what every component does and why it is needed. There is so much we don’t know, but we are trying to learn and get better. So this line of thinking as: There’s no proof that vaccines don’t cause autism. It’s illogical. \n\n\nHave a stranger inject you? You mean a nurse? A doctor? A person that followed an education to do this? \nA phobia will disqualify them from working with blood, e.g. injecting you with these needle containing this substance you don’t understand. Why? Because once you work with blood, you need to be vaccinated against blood born diseases. Same goes for allergy… it would be like you have a peanut allergy and you choose to work in a peanut factory. \n\n\nAnti-vax, as far as I know it, are people that think vaccines cause autism, have a microchip to control or a similar thought process. \nMost vaccines or other medications are made with animal free chemicals / products and if possible, kosher chemicals. \n\n\nLastly, if you are allergic, you are immune compromised or you have a religious exemption, you are not anti-vax? \nSo my question to you is, what is this all about?\n\nEdit: changed @ to u/\nEdit 2: grammar and changed calling poster anti-vax to defining anti-vax",
            "title_similarity": "0.7664207",
            "sentiment_compound": 0.7892
        },
        {
            "id": "h2cc41o",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2ccbwr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2ccl65",
            "score": 1,
            "text": "Just for the record any shot that contains MRNA technology is gene therapy and not a vaccine at all.",
            "title_similarity": "0.5504307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2cd2cl",
            "score": 1,
            "text": "Just so we are clear, your doc offering an alternate schedule is not an endorsement of vaccine hesitancy. Alternate vaccine schedules exist for lots of reasons. The most common reason they are used is because someone misses a vaccination by accident. I am not sure why you thought they an offering for alternative vaccine scheduling was an endorsement of vaccine hesitancy.",
            "title_similarity": "0.71948034",
            "sentiment_compound": -0.6768
        },
        {
            "id": "h2cd32l",
            "score": 1,
            "text": "I’m sorry but that’s how a free country works. We’re all entitled to our opinions, and I disagree with you. I think doctors should be the most critical thinker and not just be a yes man to the government. Reality is the health care professionals have not be taught to think critically but rather to obey guides and regulations. \nI live in hell after taking mri vaccine. I took at age 3 and now I have problems. Not everyone can take it. Plus I literally got blood clots from Covid so i don’t want to risk getting the Covid vaccine and get more blood clots when I’m already immune and the virus is no stronger than influenza.",
            "title_similarity": "0.7579186",
            "sentiment_compound": -0.5747
        },
        {
            "id": "h2cdiaj",
            "score": 1,
            "text": "Where do you draw the line?\n\nIf you believe in freedom then people have a right to make decisions you disagree with. \n\nI'm vaccinated but I think it's reasonable to be concerned that long term testing for Covid19  vax is non-existent.",
            "title_similarity": "0.66451013",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2cdk8p",
            "score": 1,
            "text": "The *inventor* of mRNA vaccines has expressed concern over the way spike proteins work in the mRNA-based covid vaccines. Should he lose his license?",
            "title_similarity": "0.67476976",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2cdqiw",
            "score": 1,
            "text": "How much information do you gain from a one sided argument where every professional has no choice but to agree with you for fear of losing their job or worse?\n\nSounds like what it must be like to be a doctor in North Korea",
            "title_similarity": "0.6884066",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h2cdt0j",
            "score": 1,
            "text": "This post shows the inability to critically think.  Critically. Thinking requires hearing the opposing viewpoints and the reason those viewpoints exist.  Silencing or punishing anyone for bringing the viewpoints required to think critically opposes the entire concept of critical thinking.",
            "title_similarity": "0.6257827",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h2cdtj9",
            "score": 1,
            "text": "Such an extreme point of view. Yeah sure you can have it but haven’t you asked yourself why people are anti-vax?\nFollow the money. \nParents would not speak out unless their child has been injured. Normal working people who have been affected by medicine have no motif to inform others of the dangers of medicine. They simply care about human. \nDrs and alike have incentives and it is money. This has always been known but too many people are blind to the truth.",
            "title_similarity": "0.68283486",
            "sentiment_compound": -0.5647
        },
        {
            "id": "h2cduem",
            "score": 1,
            "text": "If I had a dollar for every time I heard “I know a nurse”, or “My friend is a nurse”...leading to a stupid amount of misinformation. 🤦🏻‍♂️",
            "title_similarity": "0.59531665",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2cei1x",
            "score": 1,
            "text": "The medical community used to use leeches to let blood. It was a standard practice of the time.\n\nThe medical professionals are not always correct. That's why when people are allowed to form their own opinions and conduct research into that hypothesis using scientific methods new information is gained.\n\nIf dissenting thought was not allowed, and doctors had been told they'd lose their license for speaking out against letting blood with leeches the practice would most likely still be used.\n\nClosing off a differing viewpoint with threats of \"cancel culture\" is about as anti-science as it gets",
            "title_similarity": "0.74551225",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2ceig7",
            "score": 1,
            "text": "Why tf did you post here, only a complete dumbass would try to change your view",
            "title_similarity": "0.542404",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2cejy7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2ceng0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cewde",
            "score": 1,
            "text": "And have the soles of their feet beaten with big sticks.",
            "title_similarity": "0.26220798",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2ceyay",
            "score": 1,
            "text": "Threatening them with loss of license doesn't make them stop holding those beliefs.\n\nProfessionals who will say so openly give a clear signal to their patients that they need to exit that office and go find someone competent.\n\nA professional who holds those beliefs but won't voice them for fear of losing the license will discourage vaccination through plausible sounding counsel, which endangers the patients who don't know that their professional is antivax.\n\nInstead of revoking professionals' licenses, redouble and retriple efforts to dispel myths and reach antivaxxers, and in that same vein get the word out that every patient has a right to health care professionals who aren't antivax.",
            "title_similarity": "0.76844597",
            "sentiment_compound": -0.7849
        },
        {
            "id": "h2cezn6",
            "score": 1,
            "text": "So what if a doctor promotes or prescribes drugs that eventually have to come off the market for harming people? It has happened more than once. should the doctors who followed the consensus on the product be held liable?",
            "title_similarity": "0.6913432",
            "sentiment_compound": -0.3736
        },
        {
            "id": "h2cf021",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cf090",
            "score": 1,
            "text": "Whether you’re for or against vaccines I don’t care. But Canceling people and destroying their lives for having different opinions than you. Sounds about as liberal as you can get. Don’t like what that doctor has to say about vaccines, go to a different one.",
            "title_similarity": "0.74837136",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h2cf3s6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cf4v8",
            "score": 3,
            "text": "At this moment I am working up to 4 extra shifts this weekend because a fellow radiology technologist who chose not to get the shot. Suddenly came down with COVID and can’t work     Everyone who has contact with patients should be required to be vaccinated or you don’t work. And yes he is from conspiracy land.   I don’t need the extra money and I would rather be spending time with my family. Then picking up someone else’s slack.",
            "title_similarity": "0.64674944",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2cg236",
            "score": 1,
            "text": "This would set a bad precedent if there were bad vaccine or medicine because then the doctors would fear losing their license if their opinion doesn't match with future hospital policy or if pharmaceutical brands had more say and then doctors had to push meds you don't need.",
            "title_similarity": "0.7439121",
            "sentiment_compound": -0.9153
        },
        {
            "id": "h2cg36d",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cgge8",
            "score": 1,
            "text": "What counts as “anti vaccine”. Is it any vaccine or just a single, specific one?  \n\nLots of people have all their vaccinations… just not the Covid vaccine.",
            "title_similarity": "0.65424263",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2cggfe",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cgo12",
            "score": 1,
            "text": "Is it possible to be against this spurious “Covid Vaccine” but not be an anti-vaxxer?",
            "title_similarity": "0.6091992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ch7ut",
            "score": 1,
            "text": "There is no reason to change your view",
            "title_similarity": "0.1964667",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2cha13",
            "score": 1,
            "text": "Seems like a strawman argument you are making.  I read some thoughtful comments/responses below, where you respond to the various scenarios that those aren't antivax positions.\n\nCool, so just how prevalent do you think actual antivax doctors are then? Real antivax, not someone who is against the particular use of a covid vaccination for instance because there is no longer term data on its use, or an explanation why the spike protein is taken up throughout the body and not just at the site of injection, or other unexplained and valid concerns a medical professional may have about the use of a brand new experimental vaccine treatment that has only narrowly passed the loosest requirements of the EUA?",
            "title_similarity": "0.71600175",
            "sentiment_compound": -0.2316
        },
        {
            "id": "h2chact",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2763399"
        },
        {
            "id": "h2chdpp",
            "score": 1,
            "text": "Nurses can theoretically lose their licenses for being anti vax, at least in BC. Our license standards  require us to provide patient education that is competent and evidence based. Using the profession as a platform to cause distrust in vaccines would be a violation of that, especially in the context of a nurse-client relationship.",
            "title_similarity": "0.8847612",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h2chvq0",
            "score": 1,
            "text": "What is a medical license if not the approval of a regulating body that allows you to practice medicine because you've met and continue to meet standards of care? \n\nIf that regulating body (the ADA?) identified vaccinations as a standard of care, the way it has been in Canada, I suppose this would be the case.\n\nTo me this doesn't mean that continued research can't be done on vaccinations, or that doctors can't personalize their treatment, but if their practice diverges from the standard they should lose their license.\n\nAgree 100%",
            "title_similarity": "0.7661379",
            "sentiment_compound": 0.3576
        },
        {
            "id": "h2chz7q",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2ci29l",
            "score": 1,
            "text": "fun fact japan is wildly anti  vax, sitting at 4% for the covid vax, and a hilariously small covid death rate.",
            "title_similarity": "0.54293334",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2ci3yy",
            "score": 1,
            "text": "If it’s about Covid, it’s not anti vax. It’s anti vaccine that was made in less than a year, isn’t Food and DRUG Administration approved, can have severe side effects, isn’t necessary if you’ve had Covid, etc. Don’t get the two confused",
            "title_similarity": "0.6191529",
            "sentiment_compound": -0.3481
        },
        {
            "id": "h2cic4u",
            "score": 1,
            "text": "There are no long term studies to determine the long term effects of these shots. Yes, I refuse to call them vaccines.  If a physician cannot explain the long term effects of any shot, then that physician should consider him or herself morally obligated to let their patients know and understand that no one on this planet can guarantee that these shots are beneficial in the the long term. There is a reason that the FDA refused to certify these shot's when they came out. I am not necessarily an \"anti-Vaxer\" I just want to wait as long as I can before I get this shot. By the way, what ever happened to herd immunity?",
            "title_similarity": "0.70438874",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2cijyr",
            "score": 1,
            "text": "Doctors  have the right to believe whatever they want to believe, its a human right,  freedom of thought. Nobody is forcing you to go to an anti Vax doctor.",
            "title_similarity": "0.50110257",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2cio9p",
            "score": 1,
            "text": "I would agree if they are strictly anti Vax. But I was listening to CBC radio yesterday and the government has changed their mind on the astra Seneca vaccine again and they are talking about how entire indigenous communities were fully vaccinated with that one first and now they're telling everyone else not to take it for the time being.  Also the heart inflammation happening in young males.  Don't get me wrong I've had my vaccine but I can understand the hesitancy on the new one",
            "title_similarity": "0.7582792",
            "sentiment_compound": 0.8352
        },
        {
            "id": "h2cirju",
            "score": 1,
            "text": "In the US, due to a decentralized and often private system of healthcare, it is difficult to \"standardize\" how medical professionals treat and advise their patients. This results in the patient having to be educated enough to see through every doctors or nurses bullshit when it arises. If you want to revoke a license for antivax rants, then you also need to define all the other situations where you consider their opinion dumb and revoke for those as well. The problem there is that medical care is not cut and dry, and varies widely from doctor to doctor. Doctors are doing much worse things than spreading antivax information, like over prescribing opiods/benzos/statins/SSRI's or any other easy fix drug that doesn't address the actual root cause of the condition and can act as literal poison to the patient.",
            "title_similarity": "0.74147505",
            "sentiment_compound": -0.7708
        },
        {
            "id": "h2citom",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2ciuch",
            "score": 1,
            "text": "To be fair, taking several vaccines at once can be hard even for an adult. It's convenient for the doctor's office, of course.",
            "title_similarity": "0.55190974",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2civ2w",
            "score": 1,
            "text": "I feel they should be allowed to study the long term effects on the vaccines rather than be shot down immediately",
            "title_similarity": "0.5866649",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2cj23a",
            "score": 1,
            "text": "Which vaccines? All of them? Or the untested, unapproved ones with relatively high numbers of side effects and death???",
            "title_similarity": "0.5697967",
            "sentiment_compound": -0.8053
        },
        {
            "id": "h2cj6nk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cjj98",
            "score": 1,
            "text": "I think that what we’re learning from this is that medical professionals (nurses and doctors ) are not intelligent people. The doctors are just good at science classes and the nurses are capable of following orders. The fact that they’re not using the education that they’ve received in order to do their job, to understand the importance of vaccines right now, is the biggest indicator that they’re fucking dumb. But good at their job.",
            "title_similarity": "0.7095716",
            "sentiment_compound": 0.6917
        },
        {
            "id": "h2cjlue",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cjq00",
            "score": 1,
            "text": "Hope this helps some people as this argument keeps coming up. I'm a nurse. As a student I was so scared of needles I'd cry during vaccinations. Now that I administer them I am no longer afraid if them. As a HCP they are a very very normal part of your job. We are required to stick IV needles into people, some HCPs are even required to stick needles into people's bones. \n\nThere is no way a nurse or doctor working in a hospital setting will be competent enough to keep their license if they are afraid of needles.",
            "title_similarity": "0.7318704",
            "sentiment_compound": -0.7443
        },
        {
            "id": "h2ck5ap",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2ckfi3",
            "score": 1,
            "text": "I’m not anti vaccine but I support the right for those who do not want to take it, and I believe that bodily autonomy extends to doctors and health care professionals. HOWEVER, they should not be speaking about their own personal opinions to their patients.",
            "title_similarity": "0.61591315",
            "sentiment_compound": 0.8673
        },
        {
            "id": "h2ckq47",
            "score": 1,
            "text": "Hello,\n\nI would agree with you if they tried to avoid actively people to get their vaccines by sabotaging vaccination centers or by taking action to enforce their opinions to people (put lives in danger by administrating vaccines in a wrong way to kill/harm people just to prove they are right). \n\nI don't think make them losing their job will help them consider change their views on the subject and this can also be dangerous for the children of the said Doctors or Nurses (not only about the vaccines but about their living conditions if one of their parent lose his job).\n\nIt can even be counter productive and these people can spread lies even faster.\n\nMaybe a suspension with training to make things clear but I'm not sure it will be useful for every anti-vaxxers. \n\nUnfortunately and fortunately free speech exists this is why people need to be educated about their health to be able to distinguish good and bad advices even if they are coming from doctors or nurses.  \n\nI often see people blaming anti-vaxxers but imagine people mocking your beliefs and treating you like you're idiot. I don't think you will suddenly say I'm an idiot who have stupid beliefs and immediately change. \n\nIf a single Nurse or Doctor can make people believe that vaccines are bad maybe there is also a problem in the education system.\n\nEducating and giving facts about how vaccines works and gave us a better quality of life with respect of the opinion of anti-vaxxers (even if they are wrong about a lot of things) is the only way to really stop fear and wilful ignorance (like you did for yourself). \n\nThere is an other problem : Confirmation biais.  People will always search what help them feel good about themselves and reinforce what they believe in.  It is human nature, so this need to be addressed also. \n\nAnd you only reinforce the conviction they have to be in the truth so hard that they are persecuted for their opinion by doing that (you can clearly see it with flat-eaters, some feminists and red-pillers). \n\nTo be fair, vaccines for CoronaVirus should be in test phase even now but we administrate them because of the sudden pandemic and maybe also for economical reasons (9-14 years of research and tests for vaccines if you refer to the authorities and only 1 to 3 years of tests for Corona).\n\nMaybe nothing will happen and we will be able to celebrate how fast humanity is capable to create vaccines in case of an emergency (let's hope). \n\nNow it does not mean these vaccines are bad (I have a doubt with AstraZeneca for young people but this is not the only vaccine you can get obviously). But we did not have enough time to really test them. There was a possibility of a very bad sanitary crisis so we needed a quick fix. \n\nI vaccinated myself with Pfizer and except 2 days with a little pain in the arm where I received the vaccine, nothing happened. Same for my grand-mother and mother, pain in the arms during 2 days and nothing else.\n\nVaccines is a good progress but we need to remain critical (maybe not like anti-vaxxers) because it is not perfect at 100%. \n\nWe eradicated some diseases with them and control some others, life is good. \n\nI'm sorry about mistakes, English is not my main language ! \n\nHave a nice day/evening !",
            "title_similarity": "0.7529958",
            "sentiment_compound": -0.9922
        },
        {
            "id": "h2ckqag",
            "score": 1,
            "text": "The nurses in Canada are suing the nurses association over this. \n\nThe covid vaccines are authorized under emergency use. \n\nThat means they cannot be administered unless there is an emergency, and there is no other effective treatments.\n\nDoctors and nurses in Canada have been threatened by their respective associations to not even mention Ivermectin or vitamin D, even though there are numerous studies proving them effective in treating covid. \n\nThe government is pushing an agenda with these vaccines, and medical professionals are being censored from providing informed consent to their patients. \n\nMost people don’t know the vaccines aren’t even fully approved. Most people don’t know that their doctors and nurses are only allowed to inform them of the benefits of the vaccine without providing them with any other option for treatments, even though there are some. \n\nPeople cannot accurately make an informed decision without all of the information. \n\nI don’t know how anyone can be in support of that kind of censorship.",
            "title_similarity": "0.87395275",
            "sentiment_compound": 0.4096
        },
        {
            "id": "h2cl4vq",
            "score": 1,
            "text": "There’s a difference between being antivax and suggesting that a specific person not get vaccinated.",
            "title_similarity": "0.7059738",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2cldop",
            "score": 1,
            "text": "I think your suggestion would set a terrible precedent not only in medicine, but also science at large. The scientific process is heavily reliant critical opposition.",
            "title_similarity": "0.74872655",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h2clhff",
            "score": 1,
            "text": "Ruining people’s lives because they have different ideas or beliefs then you do makes you the bad guy",
            "title_similarity": "0.5778999",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h2clouu",
            "score": 1,
            "text": "As a doctor there is no way im putting a 1 year vaccination into my body \nThe average vax is 10 years old people , 10 years",
            "title_similarity": "0.4955398",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2clqmq",
            "score": 1,
            "text": "Yeah thats not how it should be. We are not talking about the vaccine for smallpox here. Its COVID with a 99% survival rate with an untested long term vaccine that already has given young people heart issues.\n\nI have yet seen any reason why young people ought to take it. If youre at risk and 80 years old, yes take it, protect yourself.",
            "title_similarity": "0.6402176",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h2clv64",
            "score": 1,
            "text": "You want that to be a rule in canada then you go for it.  In America we believe people have the right to make their own decisions.  I could care less if a dr or nurse is anti vax as long as they do their job.",
            "title_similarity": "0.7573452",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2clwmk",
            "score": 1,
            "text": "Honestly I believe in personal beliefs and choices. Just because you’re a nurse or doctor doesn’t qualify you as a virologist or somebody who knows and studies viruses. If you want to hold out, wait or just simply don’t want one you shouldn’t be punished for that belief.",
            "title_similarity": "0.70344377",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2clycf",
            "score": 1,
            "text": "Isn't this already illegal? If a doctor or nurse is intentionally misleading you on medicine, that's malpractice and you lose your license. You can't be anti-vaxx and be a doctor or nurse.",
            "title_similarity": "0.7970059",
            "sentiment_compound": -0.3561
        },
        {
            "id": "h2cm4it",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cm778",
            "score": 1,
            "text": "Maybe loss their employment, but not their licenses.  We have a severe shortage of trained medical professionals in this country.  They might be anti-vaxxers, but they might still know how to treat cancer.",
            "title_similarity": "0.7222101",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h2cmfwt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cmjto",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cmma2",
            "score": 1,
            "text": "I do not think we should “legislate” uniformity of thought within the medical industry. Let the patients have the freedom to hear different view points from their doctors and make the best decision. \n\nI think we are going down the wrong path by forcing doctors to promote certain medical views despite them being correct or not. We will run the risk of doctors in the future wanting to speak against new issues within the industry but fearful of losing their license resulting in a wrong practice to continue. \n\nAllowing for the freedom of views will allow for the new ideas to grow and bad ideas to die. Fear of loss of your license may result in less growth within the industry.",
            "title_similarity": "0.7518215",
            "sentiment_compound": -0.9445
        },
        {
            "id": "h2cmnun",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cmw90",
            "score": 1,
            "text": "The vaccine is still experimental, no long term testing available, and natural immunity lasts longer than any of the vaccines but is ignored. That’s a red flag.",
            "title_similarity": "0.5387421",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2cn334",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cn6o6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cn7z7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cn84j",
            "score": 1,
            "text": "Teachers too: am teacher.",
            "title_similarity": "0.2683447",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2cn9pc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cnbz3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cnebl",
            "score": 1,
            "text": "After visiting the doctor’s yesterday, my doctor asked if I got the vaccine yet. So I told him my concerns why I was waiting a few more months to “see how things pan out”\n\nHe addressed my concerns and basically said covid affects everyone regardless who’s in office. Although I don’t engage in politics, I was like sweet, a professional who keeps it to science. \n\nThen the icing on the cake was he mentioned I was in the military. He said “do you know half the shots you got while you were serving?” I said fuck no lol. “Well… what could this do to you”\n\nSo my mind is definitely open to getting vaccine asap and I’m glad I had a medical professional to educate me and make me feel at home with it. Rather than getting my info on doctors on Facebook and such",
            "title_similarity": "0.6364802",
            "sentiment_compound": 0.7762
        },
        {
            "id": "h2cnju5",
            "score": 1,
            "text": "I don't believe that medical standards are handed down from on high. It is accurate that almost all medical knowledge that has ever been believed to be true has been proven to be demonstrably false. Medical professionals are therefore required to challenge whatever is currently believed to be true in order to distill the truth out of that. You don't get better medical practices by blindly accepting bloodletting.  \n  \nA medical professional's duty is to the safety of the patient based on the patient's request for care, not to mandate standards of care the patient has not approved and accepted.",
            "title_similarity": "0.71267676",
            "sentiment_compound": 0.9253
        },
        {
            "id": "h2cnjz9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cnktj",
            "score": 1,
            "text": "Video of the literal inventor of mRNA vaccine technology calling them too risky. https://youtu.be/Du2wm5nhTXY",
            "title_similarity": "0.61689544",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2co10f",
            "score": 1,
            "text": "As long as people are free to practice without that license, do whatever you want. Otherwise you are an authoritarian bully.",
            "title_similarity": "0.5631982",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2co8s8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2co9az",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cogvz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cohdp",
            "score": 1,
            "text": "The same reason you feel about them being single minded is exactly what you’re being. I’m not against the vaccine but I also don’t think people should be forced to get it or risk their job. People like you trying to force others to do something for your beliefs of what is right and wrong is no different than all the people that you hate for the same reasons. You just happen to think that you are correct. \n\nIf you could understand how arrogant and single minded you’re being about trying to force Control on not only doctors but I’m guessing the United States as well, Then maybe you wouldn’t do it, but then again maybe you would",
            "title_similarity": "0.6652509",
            "sentiment_compound": -0.9366
        },
        {
            "id": "h2col1d",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2comh4",
            "score": 1,
            "text": "I think at most they skills be allowed to professionally say they don’t agree with it, however; should only be limited to if they get asked directly their personal non professional views of it.\n\nI think that is the issue, many are using their PROFESSIONAL platform to boost their un professional OPINIONS in an age where many people can’t tell the difference and just see it as fact from a professional.\n\nBut, that’s why second opinions exist and also why some practices go out of business. Eventually the market decides who is a qualified professional or not with their visit/money.\n\nSpread enough bad information and you’ll be out of business (or just keep a small clientele) and be pushed out of the professional loop as you’ll be seen as a “quack.”\n\nIn short, it sucks they spread bad info but eventually it always comes back on them.",
            "title_similarity": "0.5968425",
            "sentiment_compound": -0.9118
        },
        {
            "id": "h2coy3p",
            "score": 1,
            "text": "Doctors do not agree on everything. Are we going to have a panel that sets the  standard on what is the \"truth\", and fire anyone who disagrees?\n\nLook at nutrition. We *still* can't get that right and we've been eating shit since our inception. \n\nIt's a dangerous precedent that if you don't agree with us you're not allowed to practice, especially when the evidence is all over the place.",
            "title_similarity": "0.72739315",
            "sentiment_compound": -0.9066
        },
        {
            "id": "h2cozaj",
            "score": 1,
            "text": "The purpose of a vaccine is to provide immunity or increased resistance to a disease where it's not feasible to obtain natural immunity due to potential severe effects of the disease, death or permanent harm.  Examples include: rabies, diphtheria, tetanus, mumps, measles, chicken pox (due to shingles), pneumococcal pneumonia, HPV (cancer risk), hepatitis B.\n\nFor the vast majority of people under the age of 70 with no major disease states, the risk of death or permanent harm from Covid is under 0.1%.  Risk continues to drop as you look at younger people.  Couple this with the fact that natural immunity is superior to vaccine immunity, and there's a legitimate reason not to recommend the EUA Covid vaccines for certain people.\n\nThis should be reconsidered once the long-term data of the vaccines are known or the traditional type vaccines are approved, as these have a more well known safety profile.\n\nMedical professionals know that you must take each patient on an individual basis.  Recommending the same intervention for every patient is irresponsible.  That's why they're called guidelines and not rules or laws.  Also, remember not recommending the EUA vaccines doesn't make a person anti-vax.  Most healthcare professionals are vaccinated against several diseases, and rightly recommend these vacccines for their patients.  Therefore, suggesting medical professionals lose their licenses simply because they don't recommend the EUA vaccines for every person isn't a rational course of action.",
            "title_similarity": "0.6534543",
            "sentiment_compound": -0.9569
        },
        {
            "id": "h2cp5b1",
            "score": 1,
            "text": "I went ta skoo and I did learn how to think good and read papers and do the sciences and I realized umm, vaccines are 100% safe and proven by Science? Science that questions the safety of vaccines? That's fake science, real science says that vaccines are safe and effective and anything that I call a vaccine (including mRNA gene therapy) is 100% safe and effective against whatever science says it is.\n\nIf a scientist says something bad about vacine he's a fake scientitst and you should take away his science license and same for doctor. Thank u. I went to college and I learn how to think good and I am smart and I can't find a hole in my rock solid logic, I am a woman online. Thank u again.",
            "title_similarity": "0.6246215",
            "sentiment_compound": 0.966
        },
        {
            "id": "h2cp6h5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cpbic",
            "score": 1,
            "text": "I think others have said this.  They can hold the view and if it is legitimate go to media, write a paper whatever, but if you work for a healthcare company that is prescribing a vaccine based on evidence and policy, maybe follow that or leave.",
            "title_similarity": "0.65479225",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2cpcie",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cprlw",
            "score": 1,
            "text": "Be specific here.. You are talking about only the covid vaccine aren't you?",
            "title_similarity": "0.5524532",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2cq01r",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cq4we",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cq9ig",
            "score": 1,
            "text": "What if you believe in the idea of herd immunity and know that as long as you are in the slim minority, the slim number that doesn't vaccinate is protected by the herd that did and can potentially save some lives because of extreme adverse effects of a vaccine. For example in a controlled group of 10000, and at a herd immunity threshold of 90% and a 0.1% chance of extreme adverse effects, then 9000 would be vaccinated with 9 possibly maimed/dead. If you are the doctor that convinces the 10% to not vaccinate, herd immunity still kicks in and technically you've saved a life(possibly) now multiply it by a larger number and you'd have actually some impressive numbers when it's in the millions control group so technically it can be a good thing? I'm not anti Vax, but I'd just like to argue.",
            "title_similarity": "0.62975824",
            "sentiment_compound": 0.6581
        },
        {
            "id": "h2cqctf",
            "score": 1,
            "text": "I take the exact opposite stance. Some 50% of medical research is false, according to the previous editor of the Lancet. Corruption is rife across the peer review system. Doctors get away with performing heart surgery on healthy patients despite medical peer review systems that should catch such abuse, namely because of a blind faith in the idea that, somehow, a degree precludes a person from immorality.\n\nThe medical field hasn't earned out trust, and I don't think harsher punishment will help. Sham peer review affects upwards of 15% of medical professionals, who get prosecuted, often with little to no recourse, for simply upsetting management.\n\nI think we should get rid of centralized licensing altogether. Decentralize it. We have more connectivity than ever before, yet data is just as hoarded as ever. \n\nDelicense everyone. Delicensing only those that dare to investigate \"settled science\" will lead further down the road into the new dark ages. The covid shots pose many risks and professionals across the globe are discarding unfavorable data on the premise that the vaccines are safe and side effects must originate from elsewhere. There's been more reports of harm with these shots than with any other medical product in history, and that's just the tip of the iceberg when you realize how censored those reports have been.\n\nHaving gone through the process of getting licensed, you should be fully aware how tedious and unfair that process is.",
            "title_similarity": "0.67706203",
            "sentiment_compound": -0.8192
        },
        {
            "id": "h2cqfie",
            "score": 1,
            "text": "A lot of close-minded people in here.\n\nSo you're saying if two people go to the same school and get the same degree in both become doctors and the only difference is one opposes the vaccine.. he should be pulled?\n\nMan I thought the point of doctors was to look out for your well-being.  If someone that's devoted their life to helping people say something is unsafe maybe they're on to something.\n\nDo you ever wonder why there are doctors that believe the copper vaccine does not work? Maybe it has to do with the fact that it was rushed and untested and they do not know what type of side effects there will be in 5, 10 or more years.",
            "title_similarity": "0.746707",
            "sentiment_compound": 0.644
        },
        {
            "id": "h2cqi52",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cqjin",
            "score": 1,
            "text": "Couldn’t agree more I have a friend who’s a nurse and she’s not getting her shot because her family “feels weird about vaccines” and at this point I don’t know how to tell her I don’t feel comfortable hanging out until she gets one..",
            "title_similarity": "0.7110426",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h2cqorp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cqrn0",
            "score": 1,
            "text": "If you don't take this vax. Or future covid vaxes you are anti vax conspiracy nut job! How many fucking vaccines do you want us to take? Already talking about more next year and that's no conspiracy. And if the anti vaxxers don't get this then they will be made the enemy by the rest of society! And if conspiracys turn out to be true as has already shown signs.. We won't have any freedoms left. If you really still believe this is all about a virus then you need to get a grip! Look at all the shit going on outside of covid media state! And tell me you don't see the changes being forced upon society",
            "title_similarity": "0.7266885",
            "sentiment_compound": -0.7704
        },
        {
            "id": "h2cr23b",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cri1i",
            "score": 1,
            "text": "If they're publicly anti-vax, they should have to answer to a medical board of their peers and the board makes the decision. I'm still upset that Jenny McCarthy convinced so many people not to vaccinate their children and we started seeing diseases that were almost eradicated making a comeback. She's not even a doctor and had that kind of influence. An actual doctor who tells patients to not vaccinate their kids is a danger to everyone. They're helping diseases propagate! Anti-maskers upset me too.",
            "title_similarity": "0.8244734",
            "sentiment_compound": -0.6114
        },
        {
            "id": "h2crkrv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2crltb",
            "score": 1,
            "text": "My mom's physical therapist is treating another patient who got paralyzed after receiving the covid-19 vaccination. When people hear such incidents their anxiety shoots up to the point where they nope out of considering getting vaccinated. They can choose not to get vaccinated as a result, but the important thing is that they keep their distance, wear a mask, and make sure to sanitize everything.",
            "title_similarity": "0.7715536",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2crn6u",
            "score": 1,
            "text": "Nope... They should not lose their license but they should be fire from government managed hospitals. If they lose their license they may start revolting. If they just get fired government can easily justify why, thus keeping the ambient steamed but stable.",
            "title_similarity": "0.73869467",
            "sentiment_compound": -0.7202
        },
        {
            "id": "h2crttg",
            "score": 1,
            "text": "If you don’t like your dr get a new dr.  It’s not the dr or the nurses fault for your poor decisions.  I’m sorry you were misinformed but because you had an idea about what you wanted to do and the dr agreed with you assessment and advised you on how to proceed in a medically safe way you can’t hold them accountable.  Maybe next time instead of reading a bunch of articles on line you should ask a dr or a ruse what they think then if you don’t like what the dr has to say go get a second opinion.  THIS IS ESPECIALLY THE CASE WHEN MAKING DECISIONS FOR SOMEONE ELSE LIKE A CHILD!!!",
            "title_similarity": "0.66046774",
            "sentiment_compound": 0.9165
        },
        {
            "id": "h2crv5k",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2crwx2",
            "score": 1,
            "text": "If you think that making the medical establishment *more* rigid, authoritative, and top-down is going to solve antivax sentiment, I think you are misunderstanding the *source* of antivax sentiment.\n\nThe source is a mistrust of the medical establishment, and of authority in general. Unfortunately this mistrust is not unearned. Authority regularly gets things wrong, and they will often double down or divert attention rather than admit error.\n\nInstead, the only way to reduce antivax sentiment is radical transparency on the part of those in power. I don't think that is happening any time soon.",
            "title_similarity": "0.7078972",
            "sentiment_compound": -0.8448
        },
        {
            "id": "h2cs6px",
            "score": 1,
            "text": "I've seen some dumb shit... But this definitely is towards the top",
            "title_similarity": "0.27793485",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2cs7p3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2csr2l",
            "score": 1,
            "text": "This isn’t “not understanding vaccines” because  this mRNA shot is not a vaccine. It’s gene therapy. That’s fine if you want to get it, but it is not in fact well understood yet partly because of the PEG added. They’ve only studied how PEG takes the lipid nanoparticles throughout the rest of the body, NOT tested how this “vaccine” works in humans as a whole. So saying it’s been tested and is safe is false. Many real doctors who are not anti vax have spoken out about vaccinating children with this new technology specifically, because traditional vaccines stay in the arm where you administer them, then your body takes it to your lymph nodes nearby. This technology spreads to your entire body which is why we’re seeing so many odd adverse side effects. To call a healthcare professional anti science or saying they don’t understand how to do research is ignorant to say the least. It’s simply a difference of opinion based on real scientific data. That’s pro science. Science is never black and white. It’s ever changing and not recognizing errors and correcting them is anti science.",
            "title_similarity": "0.7011725",
            "sentiment_compound": -0.8119
        },
        {
            "id": "h2ct1zu",
            "score": 1,
            "text": "I think we should allow trained medical professionals to form their own opinion. This is very authoritarian, the beauty of America is difference of opinion and free thought",
            "title_similarity": "0.69456506",
            "sentiment_compound": 0.8505
        },
        {
            "id": "h2ct8wl",
            "score": 1,
            "text": "How about letting people be free to choose? Nobody should be made to deal in absolutes or have to guard what they say in fear of loosing their job because it goes against popular opinion, being able to see both sides of an argument allows people to make balanced/critical decisions for themselves. Oppositions to this are darn right oppressive!",
            "title_similarity": "0.6153717",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h2ctfcs",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2ctiwb",
            "score": 1,
            "text": "Haven’t read through all the arguments in this thread, but one thing I wanted to add.\n\nI think it’s important to remember biases in the evidence we collect about vaccines, and all therapies for that matter.  Pharmaceutical Industry funded research needs to be viewed through the lenses of the monetary incentive it has to report and interpret data in a particular way.\n\nI would break your argument down into a corollary of: a health care provider should be expected to promote therapies with proven benefit, and should be penalized for promoting therapies with proven harm.  I think that everyone can agree with the base of that argument.  The corollary is that: HC providers should be penalized for actively promoting AGAINST therapies with proven benefit.\n\nOverall I agree with that.\n\nHowever, the idea of proven is not always a black and white line - and especially in the age of pharmaceutical funded research, phase 4 post market surveillance is one of the most important aspects of safety monitoring for new drugs and vaccines.\n\nLet’s take a primary care provider who has noticed within her care population and community an uptick in cases of venous thromboembolism, and does a case-control to review.  The PCP finds that a clinically significant portion of these patients have had a particular vaccine.  She understands that this is correlation and not causation, but is also more concerned.  She reviews phase III data and finds that her local community population differs greatly in demographics from the trial data.  Furthermore, she finds several other research papers structured as cohorts in other communities with more similar demographics to her own community.\n\nNow, based on these new findings shes entirely unclear about whether to recommend this vaccine or not.  And despite overwhelming phase III evidence, she decides it’s best to recommend holding off on this vaccination for now for patients with increased risk of VTE given the low incidence of the disease in her community and the uncertainty about this safety question based on existing data.\n\nI don’t think this person should lose their license, even though she might be labeled “anti-vax.”\n\nWhereas, yes, the provider that as argued a child shouldn’t get the MMR because it causes autism should absolutely lose theirs.",
            "title_similarity": "0.7070108",
            "sentiment_compound": 0.992
        },
        {
            "id": "h2ctpnj",
            "score": 1,
            "text": "What's odd is in the US, 98% of doctors are vaccinated yet only about 45% of the rest of medical personnel are vaccinated.",
            "title_similarity": "0.36338198",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2cufj3",
            "score": 1,
            "text": "There was a nurse in England that lost her job and was taken off the nurse registry,  basically her license. She is a huge anti-vaxxer. She had done interviews claiming that vaccines cause damage to children.  Good riddance to her. Any other nurse or doctor with the same beliefs should be fired and lose their license to practice.\n\nBut, if you have medical reason on why you can't have the vaccine that is understandable. I believe that is why we try to reach a certain level of vaccinated people to create a herd immunity.  I know you can't get one vaccine if you are allergic to eggs.",
            "title_similarity": "0.8718755",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h2cul2o",
            "score": 1,
            "text": "The vaccine was rushed though. What if there are long term side effects? I am not antivax but there is a reason why vaccines usually need a lot longer to be developed and that reason is based on scientific study.",
            "title_similarity": "0.5454484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2cuodz",
            "score": 1,
            "text": "I'm not going to write anything long here. I say we need to stop with cancel culture. If someone doesn't hold a view you like, then you are free to use someone else or to not listen to them. Cancel culture has gone too far and those doing the cancelling need to be careful what they wish for given the worm will turn.",
            "title_similarity": "0.6771682",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h2curyn",
            "score": 1,
            "text": "You seriously have to look at the bigger picture in this situation to understand why some people are against the vaccine in the first place. \nPeople have a growing lack of trust in what the goverments around the world are doing for years now and it's all for good reasons based on facts, not opinions.\nThere is absolutely no trustworthy evidence that getting vaccinated is going to help you or the people around you from getting sick. Same goes for evidence that this isn't the case and you shouldn't get the vaccine. \nYou really have to be instanely naive and shortsighted to look past all the propaganda and lies that are being spread regarding the topic. \nPeople base their opinions on so called medical tests, experts knowledge...how the hell do you know there is any truth in any of these? The short answer is that you can't.\nMost of the leaders in various major countries are real shitbags which I don't trust a tiny bit with pretty much anything. \nSo I'm going to do my thing and you do yours OP, we are just going to have to see who's right. \nRegarding the antivax doctors - no, they shouldn't absolutely lose their license. If a doctor/nurse, who spent their entire life dedicated to treating others is risking their reputation and possibly their life/job by being against vaccines that is evidence enough for me that there is some shady business going on.",
            "title_similarity": "0.7101183",
            "sentiment_compound": -0.6294
        },
        {
            "id": "h2cuzsi",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cv10m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2cv772",
            "score": 1,
            "text": "Should anti-birth control practitioners be held to the same standard? (Genuine question)",
            "title_similarity": "0.5497102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2cvuny",
            "score": 2,
            "text": "Antivax is being used as a fear term lately. Why get vaxxed for something you have zero chance of getting, like small pox? There are also risks like adverse effects with all vaccines. Every vaccine should be weighed with risk and reward. \n\nIf a doctor is straight up in denial that vaccines even work, that is a completely different story than say taking a stance that there are some vaccines that just aren’t necessary for some people.",
            "title_similarity": "0.7371411",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2cw3yk",
            "score": 1,
            "text": "I wouldn't demonize a individual who helps hundreds of thousands of people over a stupid opinion. If you were bleeding out in the back of an ambulance and knew the EMT or Nurse treating you was opposed to a vaccine or even believed the earth was flat I don't think you would think twice about denieing treatment. The only reasson they should be fired or experience a loss of license is if their views directly affect their ability to do their job. If we take that free speech away who knows what else they will fire people for.",
            "title_similarity": "0.7956992",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2cw5sl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2cwhvv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cwmzu",
            "score": 1,
            "text": "If you get the vaccine and I don’t, how exactly am I putting you in danger?",
            "title_similarity": "0.62054896",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2cwqwr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cwtd7",
            "score": 1,
            "text": "Nurses and doctors are susceptible to the same social forces as other citizens and it is unreasonable and perhaps even unwise to draw red lines at the individual level when anti-vaccination is a broader media phenomenon. \nAnti-vaccine attitudes need to be more rigorously stomped out by media outlets and platforms that have allowed them to reproduce and fester for profit, and the major initial players like Andrew Wakefield and Alex Jones should be held accountable, and public pro-vaccine education that recognizes and combats major anti-vax planks should be publicly funded. Some professional controls should exist, but they should focus on pro-vaccine continuing education and the adverse impacts of disseminating anti-vaccine attitudes.",
            "title_similarity": "0.76110756",
            "sentiment_compound": -0.288
        },
        {
            "id": "h2cwu1u",
            "score": 1,
            "text": "Ok Karen",
            "title_similarity": "0.011751816",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2cx7q3",
            "score": 1,
            "text": "This can also go the other way...prove vaccines work...the flu has not gone anywhere. Fda did not approve the vaccine til this day...Johnson n johnson had to stop giving the shot...other countries don't want the vaccine...wonder why🤔. Not wanting the shot or wanting to offer it is not a crime noir antivaxx...it's called freedom to do as you choose, you can always ask for another doctor to get the poison🙆",
            "title_similarity": "0.75003594",
            "sentiment_compound": 0.5942
        },
        {
            "id": "h2cx9l1",
            "score": 1,
            "text": "Hahaha. 80% of our rural medical personal would instantly quit. Exacerbating an already understaffed region in the US. And also, no vaccine is actually FDA approved, ya nut. They’re approved for emergency use only. \n\nYes, the risk of cardiomegaly and cardiomyopathy is MOST LIKELY higher with active COVID infection, rather than from a vaccination; however, younger people are disproportionately affected by this complication of the vaccine-albeit still very rare. This alone I believe is enough to make parents second guess if they want their child to get vaccinated. I for one do not.\n\nFurthermore, there are SEVERAL cases where co workers of mine, both nurses and providers, have still gotten severe infection, DESPITE being fully vaccinated. The most misinformation I see is the statement that vaccination prevents infection, which is ignorant at best, and full out BS at worse as we all know how vaccines work, and they definitely never prevent infection, but rather give your immune system a “jump start” should you get an infection.\n\nDon’t be another sheep...actually think for yourself. Furthermore, utilize the SCIENCE you were taught in school.",
            "title_similarity": "0.66682345",
            "sentiment_compound": 0.622
        },
        {
            "id": "h2cxk6j",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2cxng5",
            "score": 1,
            "text": "While I am adamantly for vaccinations, I fear the repercussions of automatically banning members for speaking out in a profession...  not for this particular case, but the precedent it could set for others.\n\nFree speech must remain free to encourage those who would speak out against popular ideas as a means of checks and balances.\n\nGood ideas such as vaccinations will always have a rational and logical argument to back it up for those who care to find...  while those who dont care to find the answers will remain willfully blind no matter who they can use as justification.\n\nBanning them just turns them into a martyr for those who want to believe the lie.",
            "title_similarity": "0.6987152",
            "sentiment_compound": 0.9451
        },
        {
            "id": "h2cxp3t",
            "score": 2,
            "text": "What if a doctor / nurse generally approves all vaccinations except one specific? Are you talking about blindly supporting everything or having critical thoughts?",
            "title_similarity": "0.6984769",
            "sentiment_compound": 0.5661
        },
        {
            "id": "h2cxpye",
            "score": 1,
            "text": "I think thousands of people have died, in war, for our country's freedom, so we can absolutely have the right to think and stand by whatever the fuck we want to...\n\nAs an American, I whole heartedly downvote this crap. Get a grip...",
            "title_similarity": "0.63410455",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h2cy50p",
            "score": 1,
            "text": "Doctors, nurses and other licensed healthcare professionals who say everyone should take the vaccine, without looking at medical history or if the patient has had covid recently for example should all lose their licenses. CMV plz.",
            "title_similarity": "0.88931894",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2cy6qb",
            "score": 1,
            "text": "What if you found out that vaccines cause life long illnesses and even death in people who would have otherwise been healthy individuals? Children’s lives were taken away and many parents suffer due to lack of information and ignorant pediatricians and Doctors thinking the way you do and not giving proper information about the risks. Some risks are worth the reward but unfortunately the science on vaccines has not been settled. \n\nI hear people way too often giving credit for the decline of diseases to vaccines and not to clean water, good hygiene and proper sanitation. If you look in the parts of the world where they don’t have clean water, proper sanitation and good hygiene these diseases still exist. No matter how many vaccines you force on people if they live in filth they will get sick.",
            "title_similarity": "0.72705317",
            "sentiment_compound": 0.3036
        },
        {
            "id": "h2cyae4",
            "score": 1,
            "text": "What I’m wondering is when the anti-vax nurses and professionals will be given their own legal ground to operate a medical system under an authority that is attuned to their ideals, understandings, and objectives.\n\nWhat I mean is. We have essentially a government, assigned medical authorities the role of making clear and crucial decisions on a matter as debatable as the mass vaccination of the whole world.\n\nI for one, want no part of any modern medicine, clinic, or health system, that operates under the authority of a medical college and government making their own best decisions on what my health should or shouldn’t be.\n\nFor now, I won’t be calling 911, seeing a doctor, or visiting a hospital.\n\nBut I would be happy to see medical establishment in our current world that is not catering and controlled by authorities with the motivation to publicly pressure coerce or control the direction of society.\n\nThe problem in this case, is that politics has taken precedence over medicine. I think that a very good doctor, who has a good awareness of the reasoning behind anti-vaccination belief and practice, should be able to be a licensed practitioner in the full disclosure of their motive and medical practice.\n\nNot vaccinated? Don’t want to be? Visit the hospital on Main St. They are licensed in the alternative practice, and can suit your needs better.\n\nMy two cents.",
            "title_similarity": "0.7469523",
            "sentiment_compound": 0.9626
        },
        {
            "id": "h2cyw5t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2cz2ba",
            "score": 1,
            "text": "I took one dose of the vaccine THEN read the paper they gave me (that I should have read first but they didn't really give me time to.)  I will not go get the second dose. That particular vaccine is NOT FDA approved yet.  I am fine with giving people the choice to take it anyway, we all have to calibrate a risk/benefit ratio, and I am not antivax in general. \n\nThe reason I have this attitude is decades ago I was around for the swine flu vaccine push. THEY WOUND UP TAKING THAT ONE OFF THE MARKET before I could get my second dose (those of us a certain age were supposed to get two vaccines. If I recall correctly you also had to be 18 before they wound up taking it off the market.)   That particular vacccine made me sick as a dog, and I do not remember ANY of the other vaccines I have taken over the years giving me that effect. \n\nThe more people push this thing without any nuance the more I am convinced this is just as much if not more about money in the pockets of pharmaceutical companies as it is preventative health care. \n\nIf you are at risk of Covid and want the vaccine by all means take the vaccine. But that is a decision we get to make for ourselves.",
            "title_similarity": "0.7601651",
            "sentiment_compound": 0.7389
        },
        {
            "id": "h2cz42l",
            "score": 1,
            "text": "Cant lie and say it will completely protect you. You cant say that the pharmaceutical company will be liable from injuries. You cant say there is long term research on the vaccine. You cant say that there is no deaths associated with the vaccine.\nNurses need hide no facts and this should be included with the benefits. This is your job as an advocate. The benefits and potential issues.\nThis is the job.",
            "title_similarity": "0.6424848",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h2cz4u7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2cz7gz",
            "score": 1,
            "text": "I think there is a difference between BEING antivax, and holding views that sometimes align with antivax.  I remember when testing first started for some of the vaccines and when rumors about the J&J started coming out. \n\nI’m not anti vaccine but if you ask me if I’m going to be first in line, the answer is hell no.\n\nI’m already vaccinated, but I did not need to rush that.\n\nThe three things I don’t do just after they come out: new medicine, new restaurants, and new rollercoasters. \n\nJust because experts and professionals are working on something doesn’t mean it is without flaws.\n\nI stand by my decision to be vaccinated by I also stand by my decision to wait.",
            "title_similarity": "0.70466864",
            "sentiment_compound": -0.7857
        },
        {
            "id": "h2czey0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2czfu5",
            "score": 1,
            "text": "I’m ok with this. I’m a nurse. It boggles my mind at some of the shit I hear about vaccines. Like. Y’all I know the education you got. How is this a thought your fucking brain has? I understand vaccine caution and vaccine hesitance. I disagree with it but I get it. But outright anti? No thanks.",
            "title_similarity": "0.7487557",
            "sentiment_compound": -0.5885
        },
        {
            "id": "h2czmgu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2cznvx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2czvm6",
            "score": 1,
            "text": "Drunk drivers, domestic abusers, drug addicts/thieves, smokers, dead beat parents... All work within most facilities. Refusing a vaccine carrying no liability and long term questions should be pretty far from the main reason to terminate employment. \nThose facilities should be sued into the dirt. They likely will be. \nHowever, as a med professional, you have easy ways to avoid it with knowledge of valid excuses, fake cards, and more. Its better to atleast know than to assume they have.",
            "title_similarity": "0.73347116",
            "sentiment_compound": -0.8781
        },
        {
            "id": "h2d0271",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2d034v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2d0a8l",
            "score": 1,
            "text": "As someone with a rare primary immune deficiency and various other health complications that make me unable to get a vaccine yet, I trust my immunologist’s judgement to tell me when I should or should not take the vaccine.\n\nI don’t trust those in oversight positions who are less informed on specific conditions to correctly judge when a doctor is making the right decision about their patient’s care. My doctor should not face repercussions or more importantly for me, be swayed in my care for fear of them loosing their license and livelihood.\n\nThose who are completely anti-vax for all patients should face repercussions though but doctors shouldn’t be swayed in making certain decisions that could greatly effect their patients.",
            "title_similarity": "0.76427364",
            "sentiment_compound": 0.8292
        },
        {
            "id": "h2d0aek",
            "score": 1,
            "text": "I am pro vaccine.  My entire family is vaccinated against all the usual shit and covid.  \n\nIn attempt to change your view, consider that a cience has been wrong a lot.  How old are you?  After loving just 4 decades and having been through a couple of sides of the medical system I have developed a healthy skepticism.  Have you ever been terribly sick and had to rely on scientist and doctors who usually don’t know what’s going on?  How much do you know about the pharmaceutical industry?  And why the incessant call to cancel people you don’t know?   There are so many ways to live life.  So many opinions which will change over time.  Why attack your fellow country men and women, calling for their cancellation when you don’t know them or their story?  Instead, why not go help someone if you want to make the world a better place. Help someone you personally know, or get to know someone you don’t.  Vaccinate your family and relax in demanding the persecution of people who have other ideas.  Then go do some actual good.",
            "title_similarity": "0.71646017",
            "sentiment_compound": -0.7592
        },
        {
            "id": "h2d0h5e",
            "score": 1,
            "text": "This is probably very late but why do you want to change your views? Why not post this statement in 100s of other subreddits where your viewpoint shouldn't be opposed? There should be a reason or you must feel there is a hole in your argument.",
            "title_similarity": "0.6127213",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h2d0vr4",
            "score": 1,
            "text": "I only agree ‘if’ they are promoting this to their patients or in a public forum. If this is their belief, but they do their job and don’t let this view interfere, I see no problem.",
            "title_similarity": "0.43014818",
            "sentiment_compound": 0.6583
        },
        {
            "id": "h2d10fu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528069"
        },
        {
            "id": "h2d11xi",
            "score": 1,
            "text": "They aren't necessarily advocating against it as a medical treatment, they're advocating wether absolutely every individual needs such medical treatment. For instance the people who already had covid, there's honestly no reason to even bother getting vaccinated it makes absolutely no difference but people still feel the need to villify those people for recognizing that fact. If we're being honest about who's the antivaxxer isn't it the people who don't have faith in their own vaccine Enough to be content with themselves having it? They're taking a hundred times more risk than they're even  putting on anyone else.",
            "title_similarity": "0.67456555",
            "sentiment_compound": -0.3987
        },
        {
            "id": "h2d13h9",
            "score": 1,
            "text": "Because you're doing the only easy part of this job -- deciding that anti-vax is completely idiotic. That was trivial. Now, how do you implement this feature such that the next time a similar question is asked the line is *abundantly clear and leads to the correct outcome.* What metric will you use to define when it is permitted to strip a doctor of their license.\n\nImagine the quadrillions of edge cases that could come about. Imagine the countless medical procedures that are done daily that have varying levels of consensus amongst the medical professional field. What level of consensus do you think would be mandatory to agree with or else you lose your job? 99%? 95%? 99.9? \n\nHow long is it until we find a case where the 99.99% was wrong and the guys who held out in the .01% are proven correct and win a Nobel prize in medicine? This happens in the sciences often enough that you'd have ruined the career of Nobel laureates. \n\nTo be clear, I **despise** anti-vaxxers. But just pointing out that this really is not an easy problem. Your system has to be fair and if you can't find a fair system then replacing the current one probably isn't reasonable. It's the same reason why billionaires will never be taxed more aggressively. How do you design a adhoc tax application system that you trust to be used by somebody as obviously good willed as Gandhi and also as obviously evil and miserable as Trump. You don't. And so it won't happen.",
            "title_similarity": "0.72659343",
            "sentiment_compound": -0.7439
        },
        {
            "id": "h2d16ki",
            "score": 1,
            "text": "As a licensed professional, I’ll humbly disagree. I’m all for folks getting their shots, or choosing not to for their own reasons. \n\nThis seriously is roe vs wade type territory. Should a medical professional lose their license because they don’t believe in abortion? No they should not. \n\nPatients should be free to make their own decisions based on not just facts, but the opinions of those they trust. \n\nMedical field cannot advance without free will thinking and different opinions. I have my shots; and respect my fellow co-workers who choose not to for their own reasons. \n\nToe the line is a dangerous line to promote.",
            "title_similarity": "0.80209637",
            "sentiment_compound": 0.8482
        },
        {
            "id": "h2d24ip",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d26jl",
            "score": 1,
            "text": "I think the only time I'd disagree with you is in cases where things aren't in a connected field. Like, an eye doctor should know how the immune system works, but it's not necessarily a part of their repertoire. Then again, the bigger issue I think is people who say, \"Look at me, I'm a doctor. I know stuff in unrelated fields.\" Think andrew wakefield. Dude was a gut surgeon, but used that doctor title and lots of lying to make people listen to him. Long story short, nurses and doctors who are in fields related to immunization and immune system stuff should lose their license for selling obviously wrong information that shows they obviously don't know what they're talking about. Doctors and nurses who aren't experts in their fields shouldn't be saying anything anyways.",
            "title_similarity": "0.72261775",
            "sentiment_compound": -0.8735
        },
        {
            "id": "h2d2et7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d2s3g",
            "score": 1,
            "text": "People have the right of opinion, it shouldn’t impact the decisions of others and the education they receive about the vaccination in a professional institution, but if people lose their licenses because of it, that’s just corrupted bull crap.",
            "title_similarity": "0.6702285",
            "sentiment_compound": -0.7876
        },
        {
            "id": "h2d3jh6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d3lkt",
            "score": 1,
            "text": "In America we can't mandate that anybody, even healthcare professionals that should know better, to get vaccines or believe the science. People have the right to be idiots if they want and should keep thier opinions to themselves and just do their job.",
            "title_similarity": "0.7158037",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2d3pin",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d3u49",
            "score": 1,
            "text": "they have every right to refuse a vaccine if they do not want it. it’s unsafe, was created within less than 6 months, multiple adverse reactions have happened. it’s their body, it’s their choice. nobody should be able to tell another person what they can and cannot do unless it’s written in stone as a law. it’s a right.",
            "title_similarity": "0.7377745",
            "sentiment_compound": -0.4445
        },
        {
            "id": "h2d425h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d44ao",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d4jvr",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d4kdw",
            "score": 1,
            "text": "I work in the medical field and I didn't get the vaccine. If people want it or not is up to them. I don't care either way if people get it or not.",
            "title_similarity": "0.6482754",
            "sentiment_compound": -0.3244
        },
        {
            "id": "h2d4waa",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d4zq7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d50bh",
            "score": 1,
            "text": "As a Canadian prosecutor in the general professional  regulatory field, I would be hard pressed to understand how there would not be some form of professional discipline regulatory proceedings against any licensed healthcare professional professing such an opinion.",
            "title_similarity": "0.71098876",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2d5215",
            "score": 1,
            "text": "Idk if we could afford to lose over half the nurses.",
            "title_similarity": "0.54067683",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2d55qg",
            "score": 1,
            "text": "I haven't really read too deep into the comments but since so many people seem to be trying to say \"Allergies\" or \"Untested\" how about changing your tldr to something like this\n\n\"Healthcare professionals should not promote antivax views, specifically those which say vaccines are unsafe etc when there is clearly data suggesting otherwise. Having an allergy or an adverse reaction or having some sort of condition in which someone is unable to take a vaccine is not being antivax\"",
            "title_similarity": "0.7428069",
            "sentiment_compound": 0.196
        },
        {
            "id": "h2d55xk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d58cx",
            "score": 2,
            "text": "You can oppose certain vaccines without opposing vaccination in general",
            "title_similarity": "0.5482497",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2d5awp",
            "score": 1,
            "text": "I work In the pharmaceutical industry, and I got to colleagues that are not willing to get the COVID vaccine. I just don’t understand the hypocrisy in being willing to produce a drug that people pay you good money for, and then not being willing to get a shot of a different drug produced to the same standards you are",
            "title_similarity": "0.6508219",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2d5cr8",
            "score": 1,
            "text": "I think people over this thread are committing some evaluation mistakes, not based in what the OP is really trying to say (medical responsibility and misinformation of the general public leading to serious health implications), but their political perspective of freedom (that people should be able to say any s*** that comes up to their mind - that I'm sorry to tell you, but not equates freedom).\n\nI don't get how people go from losing a license, duo to public misinformation, to some kind of dictatorship.\n\nI don't gonna be analyzing it in the health perspective, since I don't have the grounds, but most of you either, so...\n\nI see in here, in any case, some wrong evaluations. Medical or any other scientific review of ground work research isn't made by opinions guys. Since a vaccine need to pass by trials (not just one agency, but today multiple international agencies and by it, a lot of international experts), if a doctor see any issue with the trials or the components of a vaccine (do most doctors even have competence to evaluate it? I mean, like many other areas of study, and specifically the clinical, a doctor doesn't have the knowledge to just look to it and probably make that kind of assessment), he need to give proof of it and base it upon evidence. You see a problem in taking action against a doctor or nurse that would discourage their patients to take certain vaccine, but you don't see any problem in him doing it, probably based in a wrong assessment? Because of his freedom and critical thinking, that can be wrong, he may be the cause of deaths and by that end, he would fail in doing the job that he is responsible for.\n\nWould fear of losing a license a circumstance? Sorry, but I don't see it. Where? She is calling out against antivax doctors, not doctors that can by paper review or research, differ against one particular vaccine, but vaccines in general, if I understand correctly. By any means any specialist should agree with certain treatment if he has evidence of otherwise, and if it is done by the means at his disposal, that should be the means used, any repercussions would be required, since he didn't change the view of anyone based in it's own misconceptions.\n\nAgain, the risk in here is what a wrong misconception means in terms of national security and general health. In the National Institutes of Health you have an article about the \"Decline in measles vaccination is causing a preventable global resurgence of the disease\". The problem in here isn't just about the covid vaccine, is about preventable diseases that are returning duo to misinformation from not only individuals who spread some information bias, but also health specialists who contributed to the false assessment of something proven and not debatable, that vaccines work. So, the problem wouldn't be a doctor doubting the covid vaccine, to it is just question: \"yeah? Why don't you think it works?\" he just need to give proof of it, the problem is when you have some doctors and nurses saying: \"vaccines don't work, so don't give it to your children.\" sounds to me that this is the discussion of the thread.\n\nWould it stop speculation about certain vaccines and the advance of science? I don't agree. Science have grown in moments of true repression. Also, against something I read over here, agains many beliefs and not based upon it. Science didn't come of someone believing that doing something will prove certain result, but upon some thought and testing it. Believes are for Gods and that the earth is flat, science put to trial different hypothesis and ideas. Every science started from the philosophical instance of asking a question and finding the proper answer to it, that means asking if: \"is the earth really flat?\"\n\nWhat could lead to the end of the science advancement, is doubting the science, what he see behind those groups. The spread of misinformation about the subject and treating it like other ways to see the subject, instead what they can possibly be, plain stupidity.\n\nSo, is any risk to free speech, that is what people are really evoking in here. What you intend to be free speech? Saying anything that you see fit based in your view system? That sounds everything except freedom. You can think that you are speaking something out of your mind and you are entitled to it, but you can just being offensive towards a certain group of people or you can be promoting hate. You need to evaluate if your freedom doesn't go against the freedom of others and if what you are doing doesn't constitute an abuse, in this case, an abuse of your authority. You are a medical professional and your words have their way of impacting someone's life. To you is just a question of freedom, to say whatever you want, like: \"hey, I am a certified doctor and the cure to tuberculosis is a spoon of bleach in the morning [I'm not and what I say have no medical value whatsoever]\" and cause a lot of harm, to me is crime, since you are using your authority to giving your opinion in a subject with a very dangerous impact in someone's life.\n\nSo, I think people are just looking it wrong.",
            "title_similarity": "0.73989296",
            "sentiment_compound": -0.9844
        },
        {
            "id": "h2d5efz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d5i5k",
            "score": 2,
            "text": "Your asking to have your mind changed on vaccines. That’s not going to happen. Vaccines are absolutely important a true miracle of science. \n\nYou and I both don’t know what or how they teach about vaccines. \n\nWould you send the worlds best heart surgeon packing because he thought children shouldn’t get the COVID vaccine?\n\nAnother thing is mandatory compliance in, 1942 would be massive doses of synthetic arsenic, or other mercury compounds that were generally more dangerous than syphilis itself. Popular knowledge was this was thee only way to treat it. There were people treating infections with penicillin at the time but, other methods were still more popular with syphilis and less effective. \n\nGranting people the power of authority on science is dangerous, although I agree with you anti vaccine doctors are dangerous. But argue science with science. Show that they’re arguments are moot. \n\n“But the general public was not a part of the larger conversation regarding treatment and prevention of syphilis, thanks to the social hygienists. In November 1934, Dr. Parran was scheduled to give a radio broadcast on future goals for public health in New York. Notified that he would not be able to mention syphilis or gonorrhea by name, he refused to give the speech. Dr. Parran went on to lead the charge to reduce the moral cloud that blocked the ability to address syphilis openly and scientifically. With his extensive experience in public health, he proposed plans the following:”\n\nDr. Parran was the one that was the “doing harm to the public”",
            "title_similarity": "0.7397566",
            "sentiment_compound": 0.3948
        },
        {
            "id": "h2d5o65",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d5ogo",
            "score": 1,
            "text": "Sorry, I agree with your view",
            "title_similarity": "0.090525866",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2d5q00",
            "score": 1,
            "text": "The FDA also has approved cigarettes. Does that mean they’re safe?\n\nBeing approved or unapproved doesn’t matter. 500k have died in the US, vaccine trials have shown they’re safe and effective. 310 million doses administered, 5300+ deaths reported on Vaers. Your chances of dying are much higher with covid",
            "title_similarity": "0.51014674",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h2d5yop",
            "score": 1,
            "text": "Absolutely not. They’re people too. If you don’t like their opinions, that’s on you. Not them.",
            "title_similarity": "0.46192533",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2d60ve",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d61l7",
            "score": 1,
            "text": "What about vaccines that haven't gotten F.D.A. approval yet? As someone who has gotten the Moderna shots I don't see the danger of being at least a little bit skeptical of vaccines that haven't gotten through the full approval process from the F.D.A.",
            "title_similarity": "0.54120237",
            "sentiment_compound": 0.3183
        },
        {
            "id": "h2d6h71",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d6i23",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d6yqc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d703o",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d76de",
            "score": 1,
            "text": "I’m in the health profession and anti-vax. I dont go around telling people to get/not get the vaccine.  Its up to the individual to make an informed choice on their bodies. I’ve made mine decision…make your own.",
            "title_similarity": "0.75093716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2d7ary",
            "score": 2,
            "text": "Science isnt law. It should always be debated. There are many many reasons why you should be vaccinated, but also many reasons why you shouldnt. Contrary to what we might think, we are not always correct.",
            "title_similarity": "0.6605525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2d7b9w",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d7e70",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d7gt8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d84bn",
            "score": 1,
            "text": "There is always a problem when the solution to any argument is “They should lose their license”",
            "title_similarity": "0.6268281",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h2d86a3",
            "score": 1,
            "text": "What if a doctor is opposed to just the mRNA vaccine and/or PEG personally, but don't let this affect their work?",
            "title_similarity": "0.64132047",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2d8dvk",
            "score": 1,
            "text": "The problem is these are people more knowledgeable in medicine than the average person. Not every doctor is an immunologist, but what if an immunologist is anti-vax? Do you revoke their license, or do you listen to them because they are experts in the field and trying to flag a potential issue?\n\nThis is something the medical community needs to handle internally, not be coerced into by law or regulation.",
            "title_similarity": "0.6844443",
            "sentiment_compound": 0.2903
        },
        {
            "id": "h2d8ezg",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d8g1x",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d8gzf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2528068"
        },
        {
            "id": "h2d8k9n",
            "score": 1,
            "text": "What happened to freedom of medical choice and privacy? Vaccinating your child with vaxes that make medical sense makes sense. Show me the last documented case of polio and if it’s nearby, I’ll vaccinate my child. 50 shots by the age of 12 is outrageous. When my father was a kid it was 12.",
            "title_similarity": "0.6277012",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2d8oez",
            "score": 1,
            "text": "When I gave birth to my first child, the Chicken Pox vaccine had just come out and I was asked if I wanted my baby to have it. I was so excited to think that there was a new vaccine that would prevent my child from having to go through the misery and suffering of having Chicken Pox that I said \"yes\" emphatically. My neighbor also had a baby around the same time and another neighbor who was a home healthcare nurse told her not to have her baby vaccinated with the Chicken Pox vaccine because children need to have Chicken Pox so that they don't come down with it as an adult, so she decided not to have her child vaccinated. That left me with these questions:\n\n1. Why would you discuss vaccinations with a home healthcare nurse instead of a pediatrician? Which one is considered more of a medical expert? Which one is more educated? \n2. If the vaccine works, your child would never get Chicken Pox and therefore the problem of having it as an adult is not an issue.\n3. Not vaccinating your child against Chicken Pox runs the risk of them getting it which means that the virus lives in their body in a dormant state and can cause Shingles when they are adults. Adults can have Shingles multiple times and I can attest that it is miserable and painful.\n\nI have the greatest respect for nurses and I have several good friends who are nurses, but there are nurses out there who are giving medical advice to people that they are not qualified to give.\n\nI think it is heartbreaking how many people are buying into the misinformation that has been spread about the COVID-19 vaccines (and all vaccines) that people are buying into, then they contract COVID-19 and die or have other dire health consequences.",
            "title_similarity": "0.639936",
            "sentiment_compound": -0.9323
        },
        {
            "id": "h2d8okw",
            "score": 1,
            "text": "Here in Houston, nurses are being fired for not getting their C19 vaccines.",
            "title_similarity": "0.71219265",
            "sentiment_compound": -0.5574
        }
    ]
}