{
    "CMV: It's not ableism to exclude kids from parts of a program if they cannot properly participate.\nI was reading this article: https://www.cnn.com/2021/06/18/opinions/down-syndrome-cheerleading-photo-utah-perry/index.html. and all this person seems to care about is the special needs kid's experience. \n\nI want to start off by saying I do not think the girl with down syndrome should be excluded from the yearbook photo for her perspective squad. If she didn't make varsity and was on the backup squad then her photo should be on the squad that her skills allowed her to participate at. Which it seems is what happened from the article. But if she couldn't do the moves required to be varsity or on any squad then they gave her a nice photo to keep for memories and published the varsity only photo. \n\nBut the author goes on to describe his special needs son and how he was \"discriminated\" against. Like being in choir but he likes to dance and move around while the choir that practiced hard to create a show for their families has the spotlight stolen by a distraction. He says they allowed him on stage for a couple of songs but then he was told to come off stage. Which seems completely reasonable. At some point the show should be about the kids that have practiced for months and not the disabled kid dancing with a choir in the background. When are the able bodied kid's parents allowed to snap their photos for their memories if your son is not participating in line with everyone else? He even goes on to say his son is a non speaking autistic boy so he literally could not participate correctly and they still included him in a program about singing. He also states his sons dancing is a delight to all the audience members and only the teacher saw a problem with it. What a big assumption. \n\nHe also implies disabled children should be allowed to compete in competitive sports. So how does that go? Hey we are putting in our disabled kid as defensive line can you tell everyone not to try their best so we can give him some feel good memories? Hey we are putting our disabled kid in as pitcher because he really likes throwing the ball can you not smash a homer on him? At what point is hindering 60 other people's time so that your child can be in the spotlight enough?\n\nMy daughter currently has 3 disabled children in her 8th grade classes. She says you can tell right away because they have a helper with them at all times and her classes are being constantly disrupted by the special needs kid's. She has had her hair pulled by a disabled kid. Saw two disabled kids stabbing each other with pencils to the point a resource officer had to be stationed in her math class the remainder of the year. And even has one disabled kid who soils himself and doesn't shower in 3 of her classes which heavily disrupts her ability to learn. \n\n\nI believe inclusion ends where other kids progress and hard work is being undermined. The people with disabled children seem not to care about the disruptions as long as their child gets to pretend they are normal; while my daughter has to compete in the real world where her grades and extracurriculars matter for her future. Does hurting 26 other kids future outweigh helping one disabled kid do slightly better in class? I do not believe so. \n\nMy mom, aunt and cousin have been teaching for 20 years or more each and all of them say that teaching with 29 kids and 1 or 2 disabled kids is damn near impossible. The normal class was already challenging. Now tell kids that they have one period  to take a test while one kid screams every couple of minutes and is actively fighting his para. Tell the kids they have to get over the unrelenting smell of teenage bo and poop in their pants and just focus on taking their itbs test.\n\nIts not ableist to exclude disruptive kids from what an entire group is doing if they cannot participate properly. Its disableist to believe that your special needs child trumps everyone else's experiences and hardwork because you think they deserve it regardless of those other children and their parents feelings.": [
        {
            "id": "h2h7pmf",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2hrcaw",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2hyoft",
            "score": -3,
            "text": "Thank you for the very narrow minded world view.  Why should my daughter be excluded? She is just as human as anyone else.  You act like your kid is so put upon. You have no clue of the up hill battles we face everyday.  Here’s a fast fact we all want for our kids, the same as you want for your kids.  We want them to have friends and learn  e apart of groups and most of all we just want our kids included.  We have to fight for every opportunity. People like you always stand up and grand stand about how concerned they are and really you just sound mean. Like uncaring and lacking empathy . This post and you op make me very sad.  I suggest you meet a family with a kid with DS and live a day in their shoes.",
            "title_similarity": "0.7080071",
            "sentiment_compound": 0.785
        },
        {
            "id": "h2gry59",
            "score": 319,
            "text": "Hello, I am a person with a disability, albeit an invisible one (I suffer with severe bipolar disorder).\n\nLet me see if I can shed some light on this. So first of I see both in your OP and in the source article, a rather ambiguous use of the word disabled or disability. Disability is a wide ranging field and includes defects illnesses and variations of the psyche, the body or intellectual capability, so to just assume that all disabled kids are one way or another is flawed logic imho. A kid with Down’s syndrome can still be a great athlete, and depending on how severe their disability is, they may be more intellectually capable than you think. There are even actors with Downs syndrome. A child that’s born with no legs can still excel at maths, or poetry, or throwing a ball. Nuance is important in this conversation. \n\nThe second thing I noticed here, and this refers specifically to your OP, is that you at various points say that the disabled child shouldn’t “steal the spotlight” of the children on the choir or “ruin a memory” for the parents of the other cheerleaders. Why does the presence of a disabled child automatically ruin something or make it less meaningful?",
            "title_similarity": "0.5339016",
            "sentiment_compound": -0.6621
        },
        {
            "id": "h2ierr5",
            "score": 0,
            "text": "That's a lot of words to say that you hate disabled people.",
            "title_similarity": "0.3243779",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2hgtmg",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2hu24o",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2ig1xx",
            "score": 0,
            "text": "Hi disabled adult here who was basically left out of sports in school because the school couldn’t give a shit, my experience is if a child is good enough they should be allowed and I don’t know where your from but where I am you cannot discriminate. Your argument is basically keep the disabled kids away from the normal kids and that’s not right,",
            "title_similarity": "0.72390735",
            "sentiment_compound": 0.3215
        },
        {
            "id": "h2h6jih",
            "score": 251,
            "text": "I've got a son with autism and I was fine with the first half of your statements but the second half is where I gotta step in and argue, rather forcefully because of what you're insinuating.\n\n>I believe inclusion ends where other kids progress and hard work is being undermined. The people with disabled children seem not to care about the disruptions as long as their child gets to pretend they are normal; while my daughter has to compete in the real world where her grades and extracurriculars matter for her future. Does hurting 26 other kids future outweigh helping one disabled kid do slightly better in class? I do not believe so. \n\nSo what then? Do we go back to the 1980s where you just let children be excluded based upon arbitrary levels of skill? What happened back then was that regardless of your level of disability, if you were autistic, had Down syndrome, CP, MS, even dyslexia for some... you were put in the 'special needs' classroom. This is what you are arguing for? That the needs of the many outweigh the needs of the few?\n\nIt's very disappointing that you feel your daughter's value is over what my son's is. On a human scale that's rather disappointing. From a moral standpoint even more disappointing. Do you not think that my son's grades and his outlook on life is even more challenging and therefore might need MORE help not less? Your view that him being in the classroom somehow lowers her chance to succeed in life is flawed. Does she not have to deal with all kinds of people in life when she's in the real world? Or is she somehow going to be sheltered throughout her life so as not to have to deal with people who have less value in your mind.\n\n>My mom, aunt and cousin have been teaching for 20 years or more each and all of them say that teaching with 29 kids and 1 or 2 disabled kids is damn near impossible. The normal class was already challenging. Now tell kids that they have one period to take a test while one kid screams every couple of minutes and is actively fighting his para. Tell the kids they have to get over the unrelenting smell of teenage bo and poop in their pants and just focus on taking their itbs test.\n\nThat is a failure of the school system, not of the classroom. Each student has an IEP or a 504 plan. In it, it explains very clearly what can and can't be done to help a child out. If a child is disrupting the classroom in such a situation, there should be a process or an alternative written inside of it. If not, that's a failure of the school to provide assistance to the teacher, not a failure of the student to somehow adapt in a way that they have not yet achieved.\n\nFor example, my son can't write quickly. He's in 2nd grade now. He uses an aide to write out his words and is taken out of the classroom to help practice. Another child might need to be in a sensory room to take a test. Or they might assign that child to an aide to do a test in the hallway as my son has done before. If a child is suffering from BO/etc then that's something that is a MUST have in the IEP. As well, those are not something that just stays in the classroom, but usually those are handled by the nurse station, which again is a failure of the school to provide help for the teacher.\n\n>Its not ableist to exclude disruptive kids from what an entire group is doing if they cannot participate properly. Its disableist to believe that your special needs child trumps everyone else's experiences and hardwork because you think they deserve it regardless of those other children and their parents feelings.\n\nAgreed. It's not ableist to make changes for those who cannot adjust to the needs of the classroom. It IS ableist to simply view those children as lost causes who are secondary to the needs of your child because of some view that your child will be successful and the other has very little chance of doing so.\n\nNo child left behind. That doesn't mean that you hold typically behaving children back. It means that you put into place assistance for those who cannot yet achieve the same education without help. You give water wings to those kids who can't swim in a pool yet. It's a rather concerning thought to just let those kids drown since they're never going to be Olympic swimmers. \n\nBecause simply shoving those children into a classroom was how we treated them in the 70s/80s. And it didn't work then. \n\nI do wish you'd view those kids with a better light. Many children with special needs grow up and develop into well rounded individuals in society. The issue is what you view as success. Which really isn't the point of elementary/high school. That's literally the minimum amount of education the state has determined you need to function well in society.",
            "title_similarity": "0.76426864",
            "sentiment_compound": 0.957
        },
        {
            "id": "h2ibb4f",
            "score": 1,
            "text": "> Its disableist to believe that your special needs child trumps everyone else's experiences and hardwork because you think they deserve it regardless of those other children and their parents feelings.\n\nThis is an interesting point to close out with, because essentially every point you made preceding this could be boiled down to “able- people are more valuable and their experiences should be prioritized above disabled people’s”. *Your* daughter needs to learn. And since these disabled kids are never going to learn as much as your daughter, get them out of the classroom. Disabled kids are never going to actually be good as baseball, so why even allow them on the field! You make several assumptions about hard work, as if disabled people can’t work hard. Unfortunately, they can work very hard and still not be able to participate the same way your daughter can.\n\nEssentially, you hold a hypocritical view on the topic. You hold the same belief as the parent you are describing. Your child’s experiences trump theirs *because* your child is able-bodied. You are an ableist.",
            "title_similarity": "0.7622886",
            "sentiment_compound": 0.7396
        },
        {
            "id": "h2hvq9o",
            "score": -2,
            "text": ">\t…where her grades and extra curriculars matter…\n\nLiterally, not once in my life has that mattered. FWIW.",
            "title_similarity": "0.5757476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gr0s4",
            "score": 41,
            "text": "Would it change your view to call this ableism, but to add the caveat that it is justifiable ableism? Ableism is defined as:\n\n> discrimination in favor of able-bodied people\n\nThe definition is a statement of fact, and less a statement of ethical or moral principles. The real world depends largely on discrimination and ableism. The military will exclude several types of physical and mental disabilities. Many occupations will disqualify those with disabilities. There are no blind pilots, there are no paraplegic firefighters, there no non-verbal autistic opera singers, there are few (if any) scholars that have an IQ below three standard deviations, etc. This is technically ableism, but justifiable ableism.\n\nSo yes, having activities in school that favour those without disabilities is ableism. However, that's not necessarily wrong.",
            "title_similarity": "0.656556",
            "sentiment_compound": 0.9506
        },
        {
            "id": "h2hwn88",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2hxbtg",
            "score": 1,
            "text": "The year was 2081 and everybody was finally equal…",
            "title_similarity": "0.2469351",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ic4pr",
            "score": -1,
            "text": "What is ableism and nefarious is the fact that none of the student activities are inclusive for special needs children. The fact that special needs kids have to pick something where they are least likely to bother others says something about the options available and the people who pick the curriculum. Most school extra curricular activities are the same ones that have always been in place for years-nobody questions them even though they were created at a time when nobody gave a damn about special needs education and before disabled people had the ADA. To me its the administrations ableism that makes them fail to consider the people who arent a perfect fit for football or cheer-leading or choir or any of the many  groups schools continue to fund and promote unquestioningly every year instead of thinking about the many kids who are forced to take extra curricular activities but may not fit in  one of those boxes.\n\nI went to a performing arts school and THANK GOD because in Texas PE and extra curricular activities are mandatory to graduate and while Im an amazing dancer I suck at team sports and I could only imagine having to  go through those PE courses or being forced to join a sports team that didnt want me and the felling would be mutual.  And as a dancer I got 10 times the physical education any body on a team sport ever could. \n\nSo yes it is ableism and a complete lack of giving a damn about making things accessible  so that everybody can have something that they can be a part of in school. And its the fault of the peple who plan the state curriculum--often times these people are dumb ass elected officials with no real background in  anything other than PTA",
            "title_similarity": "0.7415091",
            "sentiment_compound": -0.8755
        },
        {
            "id": "h2ho228",
            "score": 42,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2hr3k2",
            "score": 16,
            "text": "I have an autistic brother who has a hard time connecting to his peers. He loves sports, singing, and telling jokes. He’s not the best at everything but he tries his best. So does every other kid who plays a sport or has a hobby.\n\nAt the end of the day, he won’t be a quarterback or a famous singer. He’s pretty good at telling jokes, but he probably still won’t make it big because it’s just rare to get a voice out there like that. It didn’t stop us from letting him participate in every activity he wanted to with school. Sure, he wouldn’t be able to play varsity or on anything that is for competition, but there are other ways of inclusion for kids like him that won’t take away from the games or hobbies he plays with other kids. There are ways of training and interacting and feeling like you’re part of something even if you aren’t on the field or able to follow all the steps everyone else can and still be included. \n\nI get that it might seem odd if you see a kid unable to keep up with the rest of the group, but I can assure you that kid tries ten times harder to get whether they are compared to his or her counterparts and even if they can’t do all the dance moves or can’t play on the field during the games, it doesn’t mean they shouldn’t be a part of the team and help and feel needed. Everyone wants to do their best and feel like their making a difference whether they’re able bodied and neurotypical or not. I don’t think that it is justified enough to not at least try something out. Worst case scenario? They can’t do it, so they find another way to be part of everything. It’s not just about playing the game, it’s about feeling like you can do something other than be disabled. It doesn’t mean that we can’t do better than we’re at already. It doesn’t mean there won’t be hiccups or issues. But with the right mindset with the kids/players, the right person who can make everyone feel they’ve done their best and aren’t “outshined” in events, the better things will be. To be Frank, the only kid I pay attention to on stage is the kid I’m rooting for, whether it be my autistic brother or my neurotypical nieces. \n\nNo one cares if there’s someone up there who can’t keep up because your still watching something where everyone is trying their best. I agree that it can be handled better in a lot of situations, but that just means that the needs of the disabled just aren’t met correctly by the adults trying to include them, which doesn’t make it the disabled person’s fault whatsoever. I get that you want to see a perfect ensemble or let kids have their perfect game, but real life isn’t like that. \n\nYou’re gonna have to get used to having people around you that can’t perform like you can but still get to be included and you just have to accept that. It doesn’t mean the people who aren’t so good don’t get consequences or always get to participate in certain things, but they still deserve a chance. It’s just how life is, and I really don’t think that inclusion takes away from other peoples hard work as much as you make it sound.",
            "title_similarity": "0.6064111",
            "sentiment_compound": 0.9986
        },
        {
            "id": "h2h6gqg",
            "score": 29,
            "text": "In my highschool there was a specific classroom for mentally disabled students. Between classes they would walk around the halls and were a huge moral boost for the entire school. They went to sporting event, where in the schools plays. They did not take any experiences away from anyone, they added to the experience.",
            "title_similarity": "0.6289521",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h2huqak",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2hpcj3",
            "score": 133,
            "text": "So, I’m in a wheelchair, and I did show choir in high school, and now I’m a music teacher who also teaches special ed. When I was in school, my choir teacher made a huge fuss about my wheelchair and how it would be distracting from the choreography. He didn’t want me to be in the group, but our school was very small and show choir was the only choir we had. I was a good singer- in fact, I made all-states every single year and all-nationals (top 20 singers of my voice part in the nation) three times. There is no way I should have been prevented from participating in choir, and the school agreed, forcing him to include me. For all the fuss he made, I have gotten peoples opinions years later that it really didn’t make that big of a difference. Yeah, I was in a wheelchair, but Danielle was also huge and didn’t fit into her costume properly, and Mia was always a beat late on the choreo no matter how hard she tried. I wasn’t any more distracting than either of them, and moreover, none us were actually “distracting” because *we were all a part of the group*. None of us were perfect; every single person in a group adds something and takes something away. \n\nNow, as a teacher, it’s my job to be inclusive and make accommodations. They are a part of life- EVERYONE’s life. Your argument could be extended to the fact that a wheelchair ramp in front of an old building takes away from its beauty or a hand rail on an architectural staircase detracts from the artistry. Too bad. It’s about finding a balance between accommodation and aesthetics/excellence. If one of my kiddos with autism is going to scream through the entire musical performance so that you can’t hear it at all, then sure, they only participate in a song or two and we do our best to try to let them be relaxed so that the screaming is reduced, such as letting them have fidget toys on stage. But if a kid is just moving? Dancing to his own beat? The developmental benefits to him outweigh the negative impact of the parents not seeing a “perfect” show choir. It’s important to consider whether an accommodation can be made or not, but 99% of the time a meaningful accommodation *can* be made, especially at the elementary-high school level. I wouldn’t put a kid who can’t run or hold a bat or glove on my high school varsity team, but I will find a league for kids with disabilities, inform his parents about it, and take the other members of the team to his games to support a member of our community. \n\nIt’s just like gun laws: we’re trying to balance conflicting rights while making sure no one is being excessively harmed. I teach several self-contained special ed classes, and if a child is nonverbal and extremely aggressive, a mainstream math class is likely not the place for them. That’s an issue of funding for the school, not of the parent thinking their child is more special than anyone else. There, I will side on the right of the traditional ed kids to learn safely. But worrying about how a cheer squad looks? You have no idea how much or little the girl with Down’s Syndrome contributed to the team. Down’s is a huge spectrum and there are professional dancers with Down’s who I’m sure would have been more than capable of handling a high school cheer squad. And even if she doesn’t contribute in the same way as the other girls, when the problem is looks vs the value they will all get from being teammates, I 100% side with the developmental benefits to *all* the girls, but especially the one with Down’s Syndrome over the aesthetics of the team. If a special-needs parent does push too far, it’s usually because at one point they were prevented from pushing far enough for the well-being of their child. There are some situations that specific people (disabled or not) are not suited for. But the idea of “participating properly” *is* ableist, because there are plenty of ways to participate meaningfully and beneficially that don’t look “normal”.",
            "title_similarity": "0.6659749",
            "sentiment_compound": 0.995
        },
        {
            "id": "h2hlsfx",
            "score": 8,
            "text": "High school sports and activities are just an iceberg.  In the workplace, and society as a whole, we need to rethink what labor value, productivity, and the whole paradigm for what is considered successful. \n\nI have a couple individuals on my archive/technology team at work. I am one of the few departments that do, But the fact is that the perspectives offered provide interesting, innovative, and a necessary perspective. \n\nIs there a threshold? Certainly, but the more voices the better.",
            "title_similarity": "0.6256845",
            "sentiment_compound": 0.9472
        },
        {
            "id": "h2ihh2j",
            "score": 0,
            "text": "See here's the thing, it is ableism it's just ableism isn't wrong in most cases. Like discrimination against someone because of a disability is ableism it's also often common sense. \n\nPeople are tripping over themselves to be woke they forget common sense or try to redefine words to make exceptions for that common sense so they can use it as a slur or whatever. \n\nBut bottom line it's discrimination against someone for their disability and if it's a literal limitation that makes sense.",
            "title_similarity": "0.5364227",
            "sentiment_compound": -0.1491
        },
        {
            "id": "h2ix326",
            "score": 0,
            "text": "I think after reading all of his comments 2 things became clear and would have helped give a bit of context. Several things he states:\n\n-I have bipolar disorder. \n\n-My sister is disabled. Mental retardation \n\n-If you teach people that they deserve to be treated differently then that is how they will live their life\n\nThese are the the places I believe OP is coming from. I am a layperson who lived with a bipolar person for years. Their brains implode/explode with certain stimuli and the sometimes the treatment for kids is massiive impulse control and therapy and like 20 drugs.\n\nWhat I am really trying to say is he is a not a paragon of mental wellness and his subjective and objective claims and reasoning are prolly not the droids we are looking for, as his lens is a bit skewed from the rest of us. \n\nSo while we can't make excuses for all mentally divergent people, we can for some, and we can do it on a case by case basis.",
            "title_similarity": "0.63677967",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h2j5ym0",
            "score": 0,
            "text": ">> I believe Inclusion ends where other kids progress and hard work is being undermined.  The people with disabled children seem to not care about the disruption as long as their child gets to pretend to be normal; while my daughter has to compete in the real world where her grades and extracurricular s matter for her future. Does hurting 26 other kids future outweigh helping one disabled kid do slightly better in class? I do not believe so?\n\n1. Do you have **ANY IDEA** what it takes for someone disabled to PRETEND to be normal?  It takes hiding away that disability and convincing others you’re normal, when in fact you lack something the rest of that class has.  I was diagnosed with autism when I was one year old.  That was 1989.  I spent from then till 6 receiving tutoring STRICTLY to be able to pretend I was just a normal kid.  Why?  Because back then, as it seems to still be today, mental disability seems to be targeted by EUGENICS, rather than tolerance.  For me with autism, it’s like making everybody believe you have all the same parts of your brain in the same condition they do, so that they don’t send you adrift to die in the North Atlantic and make you die …. And it was like that all through college AND the military, having to pretend for the benefit of all those other “normal“ children that I was the same as them, when I’m sad they were born with more of a leg up than I .  And part of it comes from the hostility people show to disability.  How can Someone like me go outside, with both my PTSD AND my autism, and believe we have a fair chance at life believing the rest of the world wants us dead?\n\n2. Your daughters grades and extracurricular activities honestly DON’T matter in the future.  If she has skills she can bring to an employer which they need, nothing she learns in school will matter, and that’s why colleges and universities don’t bother to provide employment pipelines for their majors because they don’t want to teach standards.  They think you’ll learn your job when you get hired.  And also if she ends up attractive, then on that first interview impression she has a higher probability of impressing an employer…… people with disabilities who end up excluded from obtaining the skills needed for the job, and who sometimes end up genetically INFERIOR to someone like your daughter in the department of appearances, have ZERO chance of being hired on the basis of their merits.  So I would say your daughter probably has much less competition on her plate.  \n\nI don’t think you’re an ableist with regards to your standpoint, but rather altogether a bigot. And that if there wasn’t an EEOC protection for disability, the same way there isn’t for political inclinations, you would be more than welcome to target disabled people on a more open basis for the benefit of promoting a eugenic State where lonely people who met an ever rising genetic standard of normality would be allowed to live.",
            "title_similarity": "0.79147625",
            "sentiment_compound": 0.8532
        },
        {
            "id": "h2j61y3",
            "score": 0,
            "text": "You’re acting like a school performance is an audition to Julliard, so what if the special needs kid “distracts” people, it’s just parents watching anyway they’re only there to watch their kid. Also how would you feel if you got excluded from every activity in school cause some asshole thought you were an eye sore over something you can’t control?",
            "title_similarity": "0.71280944",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2j87ss",
            "score": 0,
            "text": "Honestly, it’s children events why do you care so much.\n\nThey aren’t getting paid and honestly they don’t matter. You’re just annoyed you have to exclude people which is ableist.\n\nI’m autistic, I have an IQ of 130-140. I was put in remedial classes for most of my life. Do you not see the problem.\n\nHonestly your daughter isn’t as smart as me most likely, why are we wasting resources on her when she’ll just be a barista probably. I’m sure there are 5 kids in that class smarter than her, they should get all the resources. Why do we waste resources on her sports team, she’ll never be as good as the average man and it shows. We live in a society, we sacrifice so things can be equal.\n\nIt’s not as fun when it’s your kid being discriminated against is it.",
            "title_similarity": "0.69791716",
            "sentiment_compound": 0.8151
        },
        {
            "id": "h2jgpyx",
            "score": 0,
            "text": "I've never heard of the word \"ableism.\"  It sounds like it is made-up to promote a specific narrative.",
            "title_similarity": "0.42844397",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2i0r17",
            "score": 9,
            "text": "I think the issue really comes from parents.  I don't think kids should be excluded from things because of their disability.  I think every child no matter the condition should be able to try out for everything, but if they fail they fail\nThe issue is when the children's parent or parents get all bent out of shape and start throwing around lawsuits at the school.  A disabled child can learn to deal with rejection the problem is when parents get pissy because they belive that because they have a special needs child they are suddenly the strongest person in the room, and that mentality is what leads to problems like this\nA parent feels entitled to shit because they are raising a special needs child and just strong arm their way into doing anything they can to make their child a star.  Even if the child dosent want to do it.  It's a brutally manipulative situation where a parent uses the child as a tool to get praise\n\nObviously this isn't always the case, but it is a big issue that needs to be addressed",
            "title_similarity": "0.7515552",
            "sentiment_compound": -0.867
        },
        {
            "id": "h2gt2r1",
            "score": 264,
            "text": "I agree with the fundamental principle of your post. If you got no leg, it's reasonable you can't partake in the hill-climb event on your own. Efforts should be made to enable it, but it's not always possible, and that's life.\n\nHOWEVER, and especially in the central parts of Europe, there is a tendency to \"punish\" these people. For example you can't partake in hillclimb because no leg, but hillclimb awards credits; because you can't participate, you get a 0, which means a lower average score, which impacts your chances to get into university or trade-school. It's not MADE to punish you, it's a generic rule: event X = Y points, if event X = 0, then your Y = 0.\n\nAnd that is ableism, and EXTREMELY frequent in some regions. What is needed to understand, and include, is accept the limits of different kids, and have it so the system doesn't punish them. Either make rules flexible like in Southern Europe, or inclusive like in the North. But the central rigidity just doesn't work, and so many young people are marginalized by the system through no fault of their own.",
            "title_similarity": "0.6989385",
            "sentiment_compound": 0.9629
        },
        {
            "id": "h2gpuqc",
            "score": -31,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2gpioy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2hkhwr",
            "score": 7,
            "text": "I believe it's not a discrimination or ableism  to exclude a kid from if they can't do something, but school should encourage them to try to do something, to make ways to make all possible activities accessible to them and generally to make sure that they provide means or at least an alternative. Also if extracurriculars matter for the future of the kid, then should be extracurriculars for disabled kids based on their abilities.\n\nAlso  some things are accessible for everyone and these should also be accessible for disabled kids and with the same criteria as able-bodied kids.\n\n>My mom, aunt and cousin have been teaching for 20 years or more each and all of them say that teaching with 29 kids and 1 or 2 disabled kids is damn near impossible. The normal class was already challenging. Now tell kids that they have one period to take a test while one kid screams every couple of minutes and is actively fighting his para.\n\nI believe that education is a right and someone has the right to enroll in the class, but if they are unable to properly participate in that class then they will fail and they won't pass, same as with able-bodied kids.\n\nSo there is no need to exclude them and the not to give them the same opportunities and if they can't do something they would fail or not pass, but it would be unfair to exclude them without giving them the opportunity to try , if you give that opportunity to other kids.",
            "title_similarity": "0.69378614",
            "sentiment_compound": -0.8573
        },
        {
            "id": "h2h0alb",
            "score": 177,
            "text": "While I won’t disagree with your title, I will disagree with some of your examples.  Many sports, especially at the elementary and middle school level are not primarily about competition even if they are competitive.  The kids are there to learn physical and social skills, which they can still do while losing.  Competition can be a motivator for these, but it’s not the only one, and learning to be proud of how you did regardless of whether or not your opponent did better is a vital life skill.  \n\nIn the classroom there is certainly a line to walk between inclusion and disruption, but saying that disruption is automatically a bad thing ignores all of the non-academic skills that are learned in the classroom.  Adjusting to distractions, empathy, and simple exposure to different people are all things that benefit all of the kids and can be weighed against the academics.",
            "title_similarity": "0.69385374",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h2hpkcj",
            "score": 17,
            "text": "It wasn't that the girl with Downs was \"on a squad\", SHE WAS A COACH. Her photo should have been included with others in her part of the program.\n\nThat said, I do agree that IF there is an actual, demonstrable safety issue with having someone in any arena, they shouldn't be allowed unless they can consistently demonstrate their ability in a safe environment. And a good coach or leader should recognize talent and let a person advance as far as they can!",
            "title_similarity": "0.7814778",
            "sentiment_compound": 0.9381
        },
        {
            "id": "h2hjkyv",
            "score": 92,
            "text": "It sounds like your real problem is the overcrowded and underfunded school system. The disabled kids are just very easy to point at and blame for the subpar education the kids were already going to receive. Like I don't know a real fix for that besides society deciding it wants to fund education.",
            "title_similarity": "0.5944666",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h2icwai",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2ih4yr",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2j5d4a",
            "score": 2,
            "text": "Who gives a fuck? You're a grown person worried about whether or a not a child deserves to be in a photo? I just really don't understand this take. People just want shit to get upset over and be opinionated about like I cannot even believe you took the time out of your life to make this post",
            "title_similarity": "0.5563855",
            "sentiment_compound": -0.8577
        },
        {
            "id": "h2ig1ra",
            "score": 3,
            "text": "Threads and comments like this one remind me why the ADA was such transformative legislation. Most of the arguments in this thread were the same ones levied against wheelchair ramps, assistance animals, readability, and a thousand other accommodations we now consider natural or obvious.\n\nLarge-print dictionaries in schools, zoomable text, handles for doors instead of spherical knobs. \n\n\"It's too expensive, and why is it our responsibility anyway?\"\n\n[But these things made life livable for millions of Americans.](https://www.npr.org/2020/07/27/895651325/americans-with-disabilities-act-examining-its-impact-3-decades-later). People in wheelchairs, the blind, amputees, before the ADA the general consensus was that these people had little to offer society. But now children finished school and become doctors instead of charity cases.\n\nThis isn't a specific response to this CMV so much as a recognition that much of this thread can be summed up with, \"more of the same.\"",
            "title_similarity": "0.62716675",
            "sentiment_compound": 0.17
        },
        {
            "id": "h2hxhzk",
            "score": 4,
            "text": "I would like to add that there are different forms of special needs. People with ADHD or Asperger’s are also technically special needs. They are just high functioning. As someone with both of those things, I can personally attest that social isolation is one of the worst things that happened to me in high school. \n\nI would also like to point out that because Asperger’s is on the autism spectrum, it is simply a different form of autism. Someone with the same condition who is lower functioning Or with some other form of social handicap will not always understand why they can’t participate in something or why people don’t want to include them.  There needs to be alternatives in place for those kids so that they still get the social direction that they need while still allowing those peers the attention they need. \n\nNow I am not personally someone that is interested in sports, and I do agree that depending on what it is that it’s probably for the best that someone who is not physically capable not participate. But for something like choir, just place them near the edge and let them do their thing. There is no chance of physical bodily harm. \n\nIn my middle school there was a gym class where normal activity occurred, but there was also one where it was a mix of the special-needs and the regular kids. We did a lot of the same stuff that’s a normal gym class did, just with less intensity.",
            "title_similarity": "0.6040484",
            "sentiment_compound": 0.0895
        },
        {
            "id": "h2ieh08",
            "score": 4,
            "text": "No one is pretending their special needs kid is normal. It is very obvious and every lack of skill and missed development is a loud reminder our kids aren't \"normal\". \n\nI can't speak for every type of special needs kid but with autism, inclusion with pull out supports seems to be the most helpful in gaining skills for that child. They don't do that for every kid or for every subject but if the kids IQ is average, research has shown this is the most beneficial. I honestly doubt you and your daughter that kids are shitting themselves in class each week and just sitting in it. Any parent of a special needs kid would flip the fuck out about that. \n\nBut again this inclusion is so beneficial it could bring a child from living in a home for the rest of their lives or being able to deal with classrooms, get a degree, and be independent while your child gets distracted and maybe goes from an A+ to an A-? \n\n\nAnd to jump back to the cheerleader thing, if the backup cheerleaders were in the picture then all of the backups should be in the picture. If they took the picture just for the DS girl to have, they should communicate that and set expectations. \n\nI've never heard of anyone thinking the special needs kid should be quarterback and no one can tackle him. That is some made up fantasy bullshit you created to try to strengthen your argument. What has actually happened to was a special needs kid who was the ball boy or water boy who helps during practice was allowed to run the ball after both sides agreed to it and the point never counts. \n\nI'm just amazed at how fucking pathetic you have to be to shit on special needs children.",
            "title_similarity": "0.7509208",
            "sentiment_compound": 0.9721
        },
        {
            "id": "h2gqtb8",
            "score": 1343,
            "text": "[deleted]",
            "title_similarity": "0.087697916"
        },
        {
            "id": "h2hhs2j",
            "score": 143,
            "text": "[deleted]",
            "title_similarity": "0.087697916"
        },
        {
            "id": "h2hu0eq",
            "score": 6,
            "text": "I think a lot of this may have to do with exponentially magnifying the participation award culture.  I don't discriminate and believe that everyone should have the same opportunities but then I'm also salty for the so called AP classes I was in throughout school where myself and a handful of other students were, in fact, held back from instruction on further knowledge due to a portion of others not understanding. \n\nInstead of encouraging those not grasping the material after a few days on the same topic to seek tutoring, the teachers/ professors held up the rest of the class who was ready to move on. \n\nThis is why they have special education or ESE (both spectrums) as well as advanced classes vs normal.  Yes I worked ahead with other students on our own time, but that was the majority in some cases having to go beyond due to a minority having to take initiative. \n\nThere are also clubs that can be all inclusive as well as  special events for those who are disabled or unable to compete athletically with their age group. \n\nMy point is that some things are able to be more inclusive than others for the best of all those involved.  And I do think that participation awards can cheapen the experience for those who put in the extra effort to achieve.  We are all good at something, those seeking acknowledgement should go after their forte.",
            "title_similarity": "0.71314836",
            "sentiment_compound": 0.9923
        },
        {
            "id": "h2hmzi5",
            "score": 9,
            "text": "I think this is dependent on the child in question, what his condition actually is, his accommodations/modifications, etc. Special Ed is a broad and misinterpreted term I think. As a history high school teacher, I can say I’ve seen it vary in regards to disruptions, but because I work hard to effectively co teach with paras and other special Ed teachers, we usually can find a balance of making sure everyone receives a fair and public education (which is law), and are able to mitigate disruption potentially arising from some students who have maybe moderate to severe special needs. \n\nI also believe it is the responsibility of the parent to decide what is the appropriate school where their child will receive the best opportunities to succeed. I believe all people deserve that. Schools in particular though are heavily underfunded. Special Ed support structures are completely pushed to their feasible limits, and therefore I would say in disagreement with you it’s not always so much the issue about the cognitive or behavioral condition of the child, but the environment and staff around them to make them successful. I think integration is crucial - I always balance student groups and accommodate/modify so that student strengths and weaknesses are actually maybe creating a mutually beneficial scenario. What most people don’t understand is in planning mode, and when pondering the whys of how classrooms “allow” these students to disrupt it to the point others suffer, they don’t often think about practicality or the pedagogical needs of the specific students and how that lesson might translate. That’s why it takes a lot of work beyond content knowledge - and therefore allowing these students to be fully integrated into regular or mainstream education. I really think lack of resources, parent disillusionment/disagreement on services provided (somewhat like your saying although it is rare rare that we say this is not working out), lack of staffing and alternatives to regular Ed settings (especially when it is clear they are not making progress from an empirical stand point, or objectively observed position, not because of feelings or emotions). I think too that the process for “eliminating” or removing students because of ability or disability can get into some sketchy waters - what constitutes a student to be determined to not succeed or be such a detriment to the class that they are simply removed from the equation? I know it’s easy to say the physical issues, the drag on others education (which by the way I agree with the obvious that ALL students fair and public education are paramount and that one student and their issues should not be necessarily the catalyst to preventing that ), but if more resources and training were provided to schools and school like settings, or more information and education was available for parents to actually make a cohesive and correct decision and facing realities, than the idea that the student needs to be removed altogether is I think a cheap shortcut.",
            "title_similarity": "0.6808162",
            "sentiment_compound": 0.9942
        },
        {
            "id": "h2hols0",
            "score": 43,
            "text": "When I was in high school, our star defender on our varsity soccer team suffered a really really bad leg injury. For the entire last year of high school, she couldn't play and walked around in a brace. So she never did tryouts, she never played a game, never touched the ball. However, she came to all the practices and games anyway. This girl helped our coach with the odds-and-ends things needed to coach a successful team... we didn't have a name for it, but she essentially fulfilled the \"student manager\" role a lot of schools have for sports. She was included as part of the varsity team to our events and in our photos because of her participation. \n\nThe article says that Morgyn was \"devoted\" to the team and they had given her the title of cheerleader manager. Usually, the yearbook crew has their own ways of doing things. Are student managers of other teams included with their teams? Have you student managers been included in the past? Probably. \n\nIf she went to all of the practices and games and helped out as a student manager, she should be included in something, whether it be the picture with the whole team or a picture with the coach, etc.",
            "title_similarity": "0.684742",
            "sentiment_compound": 0.7056
        },
        {
            "id": "h2hpgjk",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2huh7a",
            "score": 46,
            "text": "[removed]",
            "title_similarity": "0.045561105"
        },
        {
            "id": "h2ht3de",
            "score": 3,
            "text": ">My daughter currently has 3 disabled children in her 8th grade classes. She says you can tell right away because they have a helper with them at all times and her classes are being constantly disrupted by the special needs kid's. She has had her hair pulled by a disabled kid. Saw two disabled kids stabbing each other with pencils to the point a resource officer had to be stationed in her math class the remainder of the year. And even has one disabled kid who soils himself and doesn't shower in 3 of her classes which heavily disrupts her ability to learn.\n\nWow, that is pretty crazy. (I have a disability as well but not a disrupt-the-class type one) But I personally think that these disabled children have cognitive disabilities and issues adapting to certain situations. Although, us people with mild disabilities or completely normal people are disturbed by this behavior, we cannot control them. Would you blame them for doing these specific actions that could be out of their control?",
            "title_similarity": "0.61551774",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2i0pze",
            "score": 7,
            "text": "You can't use a blanket policy either way, and that's where proper IEP (individual Education Plan/Program, in the USA) management comes into play.\n\nEach child is different, and each child's capabilities have to be balanced. Excluding disabled kids simply because their mannerisms are off-putting isn't an appropriate action. \n\nI do agree that one should not try to force a child to participate, but these opportunities should be offered to the children if they're able... and you can't just say X group is unable. A nonverbal child with autism can participate in orchestra, for example.\n\nI may be biased- I have two sons with special needs, and I have had to fight for my younger Aspie to be permitted accommodation for activities pretty much his whole life.",
            "title_similarity": "0.7161654",
            "sentiment_compound": 0.8248
        },
        {
            "id": "h2i171o",
            "score": 9,
            "text": "So I simply want to share my story which is actually a very similar one the cheer leader story you began this post with. I was born with cerebral palsy that primarily effects the muscles in my lower body. I have a relatively minor case all things considered in fact I didn’t even get a diagnosis of it until my sophomore year of high school. I actually received my diagnosis when I went to see a doctor when I went to see a doctor about why my leg muscles were having a notably harder time with track and cross country than my team mates. (I spent about an hour at the school trainer after every practice) I ran for our distance track team (800 meter plus events) and was cut from the cross country team. I ended up being the manger for the team. I’d attend every practice and record everyone’s times and run most workouts with them. I never ran a single varsity race in either sport or even scored a single jv point. My fastest mile was 5:52 and my best 5k was 22:43ish (I don’t remember that one exactly) despite these bottom end of average scores at the end of my cross country season at our end of season ceremony my senior year, my coach surprised me and awarded me a varsity letter for my dedication to the team. I honestly cried because of it. My coach looked me in the eye and told me I earned it. I was also congratulated after by most everyone on the team including the other people who got letters. I talked with my coach about it and he said he recognized the effort I put into it. (I both never missed a practice and actually organized some off season workouts. I also taxied a lot of the team to an from practice. ) the point of this story is to simply point out that we are not recognizing skill level as much as the effort put in.  I will say other examples you gave after the cheer leader one are for the most part agreeable, but if the individual in the picture put in as much effort or dedication as the rest she deserves the same recognition. There were people who showed up to about half as many practices as I did and basically never tried who I could physically never beat. If the goal is to create good memories for everyone at the end of the day the goal is teach them hard work and camaraderie. Giving an award to a disabled individual recognizing there hard work over encourages both. (I would like to end this by simply acknowledging that as this is a person issue to me and due to that I am biased but I hope despite that you can come to understand the massive positive impact that can have for someone who constantly  has to work harder than everyone else to even remotely have a chance at keeping up.)",
            "title_similarity": "0.66250944",
            "sentiment_compound": 0.9895
        },
        {
            "id": "h2i9u6t",
            "score": 1,
            "text": "There are sports and extracurricular programs specifically geared toward kids with delays and disabilities, and I feel like it is important that disabled children participate in activities at their own pace with people who have similar strengths and weaknesses as they do. Children with special needs have to learn in a separate environment from other children because they need accommodations, so having separate extracurriculars *with accommodations* sounds fair. Schools (with enough budget) should probably invest more money into extracurricular programs for their students with special needs, and having abled students join those programs *willingly* would be awesome. You could have a program for students with disabilities playing soccer for example, and able students can sign up to be assistants or play positions that need to be filled and would have to go at the pace of their peers with disabilities.",
            "title_similarity": "0.6303669",
            "sentiment_compound": 0.9623
        },
        {
            "id": "h2iapg5",
            "score": 1,
            "text": "I think a lot of these problems could be solved with a better school system. I live in Canada where we have much more funding for special needs programs. I think generally every kid who has severe mental disabilities will have a person there to help them all day. Also, grades don’t really matter at all in Grades 1-8. In high school I’m not exactly sure what goes on because the special needs kids are separated from the regular classrooms. They might be in some classes that they can participate in but for the most part I believe they aren’t learning the things needed to go to university, rather focusing on the skills required to be a functioning adult. It’s not perfect but I think it’s an improvement over what I’ve seen in this comment section.",
            "title_similarity": "0.6824601",
            "sentiment_compound": 0.5024
        },
        {
            "id": "h2ibgxc",
            "score": 8,
            "text": "Long time teacher and coach here and I’d like to weight in on the various discussions. First off, the cheerleader picture discussion. The girl that was excluded from the yearbook has every right to be furious. I read a few articles about this and everything I read said she was treated as part of the team throughout the school year. Even if she was thought of as being the team manager, she was still part of the team. I’ve coached for years, from football, soccer, basketball, track, and softball, and we have regularly had kids that just weren’t athletic enough to make the team but loved the sport. Those students showed up at every practice and went to every game. I had one student that wore a suit to every basketball game and sat next to me on the bench. They were included in every team picture and every yearbook as part of the team. Now for the classroom stuff. I will agrees with only one point in OPs argument, if a student is a distraction they should be removed from the classroom until they are no longer a distraction. That’s any student. Not just a student with a disability. There are a lot of comments about lowering the academic expectations to meet the needs of the lowest students. This is where I’d like to point out a misconception that some of the commenters have about today’s education. A good teacher should be able to meet the needs of several different levels in the same class. I have taught both math and social studies to middle school students for years. In one class, I have taught 7th grade level math, 8th grade level math, and pre-algebra. All at the same time. I have also taught both US and World history in the same class at the same time. I’m not saying I’m special or anything, it’s just the way that teaching has evolved. You learn to facilitate learning in groups and pair or group your students up in ways that meet the needs of the individual learners. The one thing that does continue to bother me though are the comments about the funding of education. I’m not advocating on sacrificing the education of any disabled students, but I do want to recognize that the funding for the bottom 10% of students greatly outweighs the funding of the other 90%. In a perfect society, I would love to have paras in my class to work with the top 10% of my students as much as the bottom 10%. Let’s push those students to much higher levels as much as possible. Overall, I believe we are only ever going to be as successful as we can be with a joint collaboration between teachers, parents, and community. Thank you for listening to my TedTalk.",
            "title_similarity": "0.75550747",
            "sentiment_compound": 0.9327
        },
        {
            "id": "h2ichwk",
            "score": 1,
            "text": "A thank you to the OP for their honesty.  My only retort would be to point out that the current system of providing as much integration as possible exists under federal law because the old system of separate sped education before IDEA was enacted resulted in disabled people who were far less capable and independent than what is currently possible, and thus more of a societal and family burden in the end.  This made the old system not just inhumane, but simply dumb. \nWe’ve been down that road before.",
            "title_similarity": "0.6584666",
            "sentiment_compound": -0.4398
        },
        {
            "id": "h2iftem",
            "score": 2,
            "text": "I was a primary school teacher and one particular year in my classes of 35 children I had 10 children there with varying disabilities. Although this was challenging for me as an educator in terms of differentiating activities and ensuring I had all the specialised equipment needed, and meeting all the criteria for my slides visually for various types of learners, that is part of my job. \n\nIn terms of the children in the class, it would have not been in the least bit detrimental at all to any of them. If anything, more beneficial. \n\nDisabled people of varying degrees exist in the world, and discussing them as if they’re an inconvenience, or that we have to make special allowances, or patronise them, or deny ourselves of something is something I’ve never heard come out of a decent human being before. \n\nWe all co-exist and we can all learn so much from each other, but putting people in boxes with this “us” and “them” attitude will warp your world view and inhibit your life experience. The world is a much richer place when you embrace all the people within it.",
            "title_similarity": "0.64199996",
            "sentiment_compound": 0.7577
        },
        {
            "id": "h2igco4",
            "score": 1,
            "text": "I think Mist peoplr will agree with you, but, what is different for everybody is '' where to draw the line? ''\n\nI would be angry if my kid can't learn at school. Regardless if my kid is the able one or not.",
            "title_similarity": "0.7168108",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2ihjpo",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2ij0hv",
            "score": 1,
            "text": "So what you are observing is simply a failure in good integration. It’s what happens when people get lazy (sometimes through no fault of their own; I’m using the word ‘lazy’ very literally here and not as a way to cast anyone in a bad light). There often times do exist better solutions (at the same or cheaper monetary cost of the current solution), but it may take some forethought or planning. This is, in my opinion, where the parents of the children should be helping. They should actively be trying to help develop non-disruptive solutions that meet their child’s needs, but that’s a whole other topic. \n\nThe thing people need to be aware of though is these non-disruptive solutions wouldn’t even be part of the conversation if the requirement for inclusion wasn’t already there. Why do I say that? Well because the easiest solution is the one where problems don’t exist. And a person with a disability, in a classroom context, is full of “problems”. But that means it simply is one more issue that requires creative problem solving, like all of the needed solutions of a classroom. \n\nFor instance, the choir student: if he enjoyed dancing, then there was nothing stopping that teacher from selecting pieces that incorporated choreographed dancing. Problem solved. Now the kid can dance.\n\nAnd that example is merely to illustrate the point of problem solving for students with disabilities in a non-disruptive way. That specific solution may or may not have worked, who knows. But it’s a start.\n\nSo TL;DR: you’re watching patch fixes fail rather than people come together in an effort to create real solutions. (And real solutions don’t always cost money.)",
            "title_similarity": "0.64536875",
            "sentiment_compound": 0.9861
        },
        {
            "id": "h2ime2u",
            "score": 3,
            "text": "There was a big stink in my hometown a while ago in where a young girl who could not physically do all of the moves the other girls were doing for competition in a jazz dance class. The owner of the studio decided it wouldn't be fair to the other girls if their chances were lessened because precision and coordination were key to these dances so they decided not to let her join (alongside the fact that they didn't have the resources to have someone working with her specifically to learn the moves necessary at a her own pace.)\nThere was a bunch of angry people demanding the studio be shut down and how DARE they not allow this physically disabled girl to not dance. They even made a sob story with their own hashtag online. \n\n\nI honestly don't get it. If she can't do the moves she's not on the team. This is the same with any sport.",
            "title_similarity": "0.6540869",
            "sentiment_compound": -0.6734
        },
        {
            "id": "h2in8l9",
            "score": 1,
            "text": "I was a big choir guy in high school. We had a dude who was suuuuper out there with dancing and even how loud he sang. We gave him solos and let him do his thing. Never effected our shows or anything. Didn’t matter in competitions. He didn’t get in to our auditioned jazz choir, but he was always fully included in the concert choir. \n\nJust wanted to speak on that one specifically as I have real experience with it. I don’t think having special needs kids in all the same stuff is harmful or hurtful to anyone.",
            "title_similarity": "0.6311338",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2io1jd",
            "score": 6,
            "text": "As someone who is blind in one eye and impaired in the other.. I personally hate it when people try to include me in sports that I cant do or would limit other people by me being there.. thats most of them.. I play drums because I can sit down and compete on a more even playing field.. I think its a cruel and mocking to to give pity applause.. and it makes kids \"without problems\" resentful..",
            "title_similarity": "0.58645236",
            "sentiment_compound": -0.6136
        },
        {
            "id": "h2io9yd",
            "score": 1,
            "text": "What we are really discussing here is the purpose of formal education.\n\nAs I see it (and I am an education researcher who worked in a number of different countries, so I'd say I have an informed position), for kids of all backgrounds and profiles to meaningfully spend time together in schools is as important for their education as any actual curriculum content, and surely more important than a perfect outcome in whatever performance they might be involved in.\n\nIt's also important to highlight that \"meaningfully\" is really key here, and that to be properly implemented it requires some serious public funding AND strong, research-based teacher education programmes.",
            "title_similarity": "0.58326393",
            "sentiment_compound": 0.9432
        },
        {
            "id": "h2ip79q",
            "score": 1,
            "text": "I should have made it clear It hasn't happened since I was in school which was about 15 years ago",
            "title_similarity": "0.5287724",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2iqhy9",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.087697916"
        },
        {
            "id": "h2ir3w7",
            "score": 1,
            "text": "Schools are guided by a few principles, none of which you seem to factor in. \n\nFirst, budgets. Inclusion classes are cheaper than a special education classroom. \n\nSecond, avoiding lawsuits. Inclusion classes have the special education student in an environment more similar to that of their peers. It makes avoiding lawsuits way easier. If the student passes their inclusion class, there are very few grounds for lawsuits. \n\nThird, typical students are primarily at American schools for free babysitting while parents work. Education of our students has been a secondary objective ever since NCLB. NCLB says that all students must be at a minimum standard. Once that student is at standard, any additional teaching of that student is not a part of the extrinsic metrics of school success. There have been initiatives the last few years to overcome this, but the intervention systems and RTI structures are all about returning failure back up to above 70%; there is scant support at >71%. \n\nHere is the CMV: your view is of a school system long ago with different laws and incentives. That’s not the modern system. There is no ableism nor disablism. There are budgets, babysitting, and avoiding lawsuits.",
            "title_similarity": "0.7100513",
            "sentiment_compound": -0.2382
        },
        {
            "id": "h2iri0u",
            "score": 1,
            "text": "I’m sorry your kid was hurt by a disabled classmate but I’m confused what you’re trying to argue here. Is hair pulling really unusual in school settings, and is it only disabled students who do this? Are you saying all disabled children are badly behaved? It’s really offensive to a lot of people if you generalise across a whole population on the basis of one anecdotal incident. Would you suggest segregating black people from the white majority on the basis that some black people commit crimes?",
            "title_similarity": "0.58997124",
            "sentiment_compound": -0.9406
        },
        {
            "id": "h2it88r",
            "score": 1,
            "text": "“As long as their child gets to pretend to be normal” \n\nYou almost had an argument up until here.",
            "title_similarity": "0.5605668",
            "sentiment_compound": -0.3892
        },
        {
            "id": "h2its2j",
            "score": 1,
            "text": "You might see it as excluding one or a few kids. Tbe experience of people with a disability is they are ALWAYS excluded and not even because their disability is the issue. a lot of people have a lot of prejudice against people with a disability and are often excluded just for being disabled and not on the actual skills they have",
            "title_similarity": "0.5554603",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h2ivexe",
            "score": 1,
            "text": "I want to live in a world where even if they can't play well they CAN feel included. No one is asking to put the nice but not so able boy in at the 11th hour when we are down by 1. but we can damn sure make sure he feels good. We should strive to make everyone feel welcome, because a child who does not feel the warmth of his village will burn it down to feel some. Prioritizing humanity is the way to enlightenment. Making excuses not to change is how we keep failing.",
            "title_similarity": "0.70755446",
            "sentiment_compound": 0.2628
        },
        {
            "id": "h2ivezg",
            "score": 1,
            "text": ">I want to start off by saying I do not think the girl with down syndrome should be excluded from the yearbook photo for her perspective squad. If she didn't make varsity and was on the backup squad then her photo should be on the squad that her skills allowed her to participate at. Which it seems is what happened from the article. But if she couldn't do the moves required to be varsity or on any squad then they gave her a nice photo to keep for memories and published the varsity only photo.\n\nWhere's this varsity stuff coming from? It wasn't mentioned in the linked article. For the first photo I count 27 faces, and for the second I count 26 faces. That's not how varsity/jv works.",
            "title_similarity": "0.91998357",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h2iwang",
            "score": 1,
            "text": "Okay, your CMV is \"it's not ableism to exclude kids from parts of a program if they cannot properly participate.\"\n\nLet's look at ableism. The definition from Oxford Languages is, \"discrimination in favor of able-bodied people.\" \n\nThese kids are being treated differently because of their disabilities, so no problem there. Let's move on to your qualifier.\n\nParticipation is to, \"take part in an action or endeavour.\" They're definitely doing that so it seems to come down to \"properly.\" What is \"properly?\" That seems so subjective. Who gets to decide what is proper, and why do they get to decide?",
            "title_similarity": "0.7263551",
            "sentiment_compound": 0.8815
        },
        {
            "id": "h2ix48v",
            "score": 1,
            "text": "I agree. A large lass once fell on me because she was too large and weak to keep her footing in the salt marsh. She had been warned but insisted on coming.",
            "title_similarity": "0.60479593",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h2izsmo",
            "score": 1,
            "text": "If I remember right, the stats on inclusion state that mixed classes help disabled kids and can work against the rest of the class. Don’t quote me on that though. \n\nI’m going to give you a different perspective because I have experience in this department: we should include disabled people in everything. Now, before you get all in a tussle, hear me out. Disabled people (we don’t call them that anymore btw) are able to do way more than you think. Sure many can’t sing well. In fact, I’ve had the pleasure of sitting through disable choir practice sessions. However, they can always contribute to everything in meaningful ways because it’s a disability not an inability. That being said, they do need our love, time and some accommodations to work around their issues, but, that’s it, there’s absolutely no reason the majority of disabled people can’t lead inclusive lives.\n\nNow, since you’re talking about severely disabled kids (I’m assuming) participating in programs with normal kids, I’d say we should work with what they can do and go from there. The truth is a lot of schools don’t have the funding to keep sped kids in different  classes and everyone involved is burnt out. However, that doesn’t mean that the disabled kids don’t deserve the chance to be somewhat normal. \n\nI think what you’re getting at is that it hurts your kids and that’s what you care about. If that’s so, thats completely understandable, but think about the good those programs do for the disabled kids that want nothing more than to be normal even if it’s just for one night.",
            "title_similarity": "0.68315816",
            "sentiment_compound": 0.8988
        },
        {
            "id": "h2j0kv7",
            "score": 1,
            "text": "Other people have responded to you already but I'm sorry; what you're presented here is essentially a lense where disabled kids are hinderanced by nature. If you believe they can be nit a hinderance, you've not done a good job at showing that. If you believe integration can be done better, again you've not shown that. What you've done is completely focused on abled people and described disabled people in disgusting ways.\n\nBut giving you the benefit of the doubt that you're doing this to provide a counter narrative and you're more compassionate than that, whats your solution? Surely its not to completely institutionalise disabled people so that we are out of sight and out of mind? So that our treatment can be basically forgotten about because it no longer affects your kid?\n\nMy last point is that I'm not sure precisely why you bring up the hair pulling and pencil stabbing. Children are... children... and they are sometimes mean and destructive. Hair pulling and (rarer) pencil stabbing happens and the result should be the same regardless of who did it, an adult intervening, stopping it and explaining/disciplining those involved in doing the bad actions. If the disabled child got off the hook then thats not okay, but the act itself is nothing to do with disability.\n\nI'm not gonna ignore the problem though. Disabled education is a catch 22, and I have my own problems with mainstreaming and how it fails disabled kids, tho non-mainstreaming is often not good either. But what you've given me is a rant. A rant that provides no solutions for either group.",
            "title_similarity": "0.6323478",
            "sentiment_compound": -0.9766
        },
        {
            "id": "h2j10gt",
            "score": 1,
            "text": "When I was in school, the special ed kids had their own classes and curriculum. It should be that way.",
            "title_similarity": "0.46327183",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2j1ie1",
            "score": 1,
            "text": "One of the hidden realities about mainstreaming is that the rest of the students come in contact with differentially abled people their own age. And hopefully are taught how to interact with them in a positive way.\n\nBecause in adult life we come in contact with different people all the time. \n\nI grew up in the 60’s, with a brother with severe learning disabilities and cerebral palsy. He was sent to “special school”. Kids in our neighborhood would yell at him and try to keep him away because they didn’t understand. I would explain him to them. And occasionally get in fights protecting him.\n\nMy kids grew up understanding and helping the different kids in their schools. And that makes a lot of difference.",
            "title_similarity": "0.6201222",
            "sentiment_compound": 0.5367
        },
        {
            "id": "h2j22ea",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.045561124"
        },
        {
            "id": "h2j3iwl",
            "score": 1,
            "text": "Who tf would have any other view? It just makes logical sense",
            "title_similarity": "0.19649816",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2j4vi5",
            "score": 1,
            "text": "im 24 and since elementary school, no exceptions there has been someone in one of my classes with some kind of learning disability. Thank god I was in the classes with them. I am beyond happy that I not only saw what they had to deal with every fucking day with a caring instructor or assistant but also saw the IMMENSE cruelty these children go through and cant begin to imagine what it could be like when I wasent seeing them get a shred of sympathy. \n\nRemoving more children from spaces where they can feel normal may be one of the more \"sick\" cmv's ive seen, but if you really want to change your view id suggest looking in and asking youself \"why do I care?\" \n\nFrom all your evidence, or info on this im gonna make a gross assumption and say perhaps youre not viewing them as people, who DO deserve to be in a yearbook photo, even if its not their EXACT team or cheer squad. Why? Because at the end of the day, without realizing it  we make so many exceptions for kids to feel happy and normal but when it comes to \"non able bodied kids\" its too much work for some people.\n\nAlso as a side note if you think telling a kid on a football team to not absolutley murder the kid possibly playing one game in the season to feel normal is somehow disgustingly wrong to one party it isint! Judo, Football, Soccer, Baseball, Swimming, Water Polo, Chess, Debate team, Golf...... probably even more that im forgetting but these are all instances where either on my team or the opposite there have been kids with disabilities, i never had to give up a ribbon or a place in a photo because of it but fuck it man if that kid came every practice because he loved it and loved being with people that didnt make them feel broken then HELL FUCKING YES they deserve the trophy and deserve the happy memories.",
            "title_similarity": "0.6391562",
            "sentiment_compound": 0.9612
        },
        {
            "id": "h2j5160",
            "score": 1,
            "text": "I have an extremely unpopular opinion on this...",
            "title_similarity": "0.15965363",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2j7phm",
            "score": 1,
            "text": "This is a response to one your anecdotals about your relatives who are teachers. \n\nIf your relatives are struggling to teach a class with just one or two students with disabilities (SWD) in the classroom then they aren't very good at their jobs. Anyone can teach good students without extra needs who are all roughly on the same level. If they struggle with even a slight variance then they aren't trying hard enough or need to stop teaching. Sounds like they do more harm than good.\n\nWe literally have classroom models to include up to 40% of students with disabilities along side their general education peers. The Least Restrictive Environment (LRE) is common practice and has been very good for (SWD) and their Gen Ed peers. Out of my 150 students every year, most of them are SWD ranging from mild to moderate. Historically they would all be put in a \"Sped class\" with few resources and low self-esteem. The integrated classes yield much better results academically, socially, and emotionally. The technique is to simply differentiate assignments, activities, and groupings when one needs to. If you're a good teacher, even without experience with SWD, you'd do this naturally because you'd recognize that not all students are on the same level. \n\nI think the craziest part is that you think just because a SWD is in a class or activity with your kid means your kid's potential is cut short. A good teacher would also differentiate up, giving them harder assignments or alternating it so they'd need to be more independent.",
            "title_similarity": "0.67024547",
            "sentiment_compound": 0.7216
        },
        {
            "id": "h2j80hq",
            "score": 2,
            "text": "There is one kid at my kids school who needs to be removed. My 2 kids have had no problems with any of the other kids, but they've both had serious problems with this one kid. He savagely attacked my son (8 at the time), and tried to molest my 7 year old daughter (made her pull her pants down and was telling her to pull her knickers down or he'd cut off her tits. The kids dad is a teacher at the school so they just keep gaslighting me, and reckon he was made apologise. So what? I don't care if he apologised or not, if he has behavioural problems then they're his problems, not everyone else in the schools problems. Kids have a right to feel safe.",
            "title_similarity": "0.6613179",
            "sentiment_compound": -0.9689
        },
        {
            "id": "h2jgczy",
            "score": 1,
            "text": "I think the issue is more in the public school system. There are large, overcrowded classes which do not allow the teacher to focus individually on all of their students even if they are not disabled, and the aides generally make minimal wage, so there isn't enough of them.\n\nMy (central European) country is currently in the process of inclusion and closing special schools. On one hand, I think it's good that kids with, say, Asperger's or heavier dyslexia won't be excluded. On the other, these schools used to have smaller classroom and staff generally better trained to deal with more severe disabilities.\n\nI myself had one disabled kid in the class, his aide was the janitor's wife (not trained in SpEd, because that's usually the best schools can make) and now my cutting line is that, the disabled child shouldn't be in any way dangerous (physically) to the other kids in classroom. We had this boy try to gouge a girl's eyeball out, to rip a fistful of another's hair out, to kick one in the head. One teacher quit because of him, even.\n\nWith many public schools out there, underfunded as hell, it quite becomes like having two HS seniors, one first-grader and five ninth-graders in a class full of fifth-graders and trying to teach everyone something at the same time. There is a huge issue already with kids running away into schools with entry exams after 5th grade, because they simply can not learn enough like this, I was one of these kids.\n\nMy step-mother, not trained in SpEd either, used to work as an aide in a rural area school to a developmentally stunted girl. Her job was to just help her pass, but she says you simply cannot teach 6th grade physics to a kid that's developmentally in 1st grade, and no other alternative was feasible in their conditions. Except moving her down to a class that would be manageable for her, but IIRC the girl's mother didn't allow it.\n\nSo my point is, inclusion isn't bad as long as no one is being endangered, and public schools need more money to ensure this.",
            "title_similarity": "0.6435357",
            "sentiment_compound": 0.7502
        },
        {
            "id": "h2jpcph",
            "score": 1,
            "text": "The only thing I’d really disagree about at all is there’s no reason a disabled child shouldn’t be allowed to do something if they’re able to do it at a level that would get anyone else that same position. If someone with a disability can throw a baseball 100 mph, and understands the game, why shouldn’t they be allowed to pitch? My cousin is disabled, but very high functioning. He runs marathons, and has become very passionate about it. I’d hate to see that discouraged by anyone.\n\nThat said, the “my kid should be treated the same no matter what” crowd definitely does more harm than they realize. I manage a golf course, and we run a large junior program. The cost is really low to try and get more kids playing the game (lessons would literally be 20x the price normally). The one year we had 4 mentally disabled kids that were signed up without the parents giving us any notice beforehand. The one child was extremely low functioning, and it resulted in us having to shut one of the 4 stations down so that one of our main teachers could stay one on one with the child. With how low the cost is, we mostly operate the program with volunteers (we’re losing money already just running the program, but it’s good for the community how it is), and that child caused us to be unable to run our full program, for the entire summer. That’s not fair to the other 70 kids trying to participate. We also had one child that was higher functioning who in his second year suddenly threw a golf club and hit another child. Luckily we didn’t get sued, but the parent of the child who was hit stopped being a member after that year (costing us money). Because of those parents, we now have to insist that any child with a disability be accompanied by a parent or aid at all times. That’s not fair to the kids who are high functioning and wouldn’t cause any issues, but we can’t pick and choose, so now those entitled parents have wrecked things for other kids",
            "title_similarity": "0.6610862",
            "sentiment_compound": -0.9314
        },
        {
            "id": "h2js6fp",
            "score": 1,
            "text": "I’ve heard of this. There are programs that schools use to keep kids who should under no circumstances be in that class. However, people are so sue happy and every single school I’ve been to has had such shit attorneys that they lose almost every single lawsuit. There was a story I read about a disabled child was being forced into normal people classes by parents, and also if the school would try to move them out the school would get sued. I’ll try to find it, as it was \nr/EntitledParents\n\n\nEdit: I’ll keep looking but can’t really find much",
            "title_similarity": "0.71957517",
            "sentiment_compound": -0.5543
        },
        {
            "id": "h2jtzaa",
            "score": 1,
            "text": "Wow what a shit perspective my dude.",
            "title_similarity": "0.020457298",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2jux9c",
            "score": 1,
            "text": "I think you’ve made extremely reasonable points, include them when it makes sense. Just came to say I agree.",
            "title_similarity": "0.22879322",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2jyfdh",
            "score": 1,
            "text": "Your foundational understanding of the issue is correct. The points you raise do need addressing in a better way than we've been doing.\n\n\nYour offered solution of \"just sweep them under the rug\" is bad. This is a systemic issue that requires systemic change. Centering the disabled kids, themselves (of which there are just SO many varieties, so even lumping them together at all is problematic), as the source of the issue is not going to help. They're going to exist, regardless. It's not their fault their school districts either misuse their money or don't have enough, it's the adults' fault.\n\n\nAll of the first half or so of your post makes complete sense. It falls apart around the middle, though, and I think that's because your true feelings on the matter start to show. If your argument only works when you make disabilities into a monolith and falls apart with several many specific examples, which has been happening all over the comments, it's a bad argument that requires revision.\n\n\nAgain, I agree on principle, but it's clear that you're ignoring the realities of what you're suggesting. I think this might be the wrong sub for you, friend.",
            "title_similarity": "0.6744671",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2k0asa",
            "score": 1,
            "text": "I agree, ultimately it only breeds resentment",
            "title_similarity": "0.1610575",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2k20je",
            "score": 1,
            "text": "I would agree that disabled kids sometimes are not able to participate in sports in the same way as abled kids. But there should be an attempt to reasonably accommodate them and find a way so they can participate in sports in some level. Not even considering them and completely denying them any access to sports certainly is ableism. \n\nIn the case of the cheerleading team, note that they did find a way to accommodate the girl with downs syndrome. She was their team manager. But then they excluded from the yearbook picture even though previous team managers had not been. That's a pretty blatant example of ableism, having a disability shouldn't exclude you from being in a team picture.",
            "title_similarity": "0.8436422",
            "sentiment_compound": 0.7438
        },
        {
            "id": "h2k7gps",
            "score": 2,
            "text": "I agree, I tried out for the basketball team and didn't make the cut. Not because im disabled, but because I sucked at basketball lol. Their disability is unfortunate, but you can't hurt the whole team for one person, its not fair for everyone else.",
            "title_similarity": "0.67916596",
            "sentiment_compound": -0.2316
        },
        {
            "id": "h2kauop",
            "score": 1,
            "text": "Imma be honest, you need to give a bigger explanation….because honestly this could go south really fast.",
            "title_similarity": "0.34455538",
            "sentiment_compound": 0.743
        },
        {
            "id": "h2knpw0",
            "score": 1,
            "text": "In this case - what the school did to Morgyn was in bad taste.  She is either on the team or she is not.  If she is a part of the team as cheerleader, manager or pom pon wrangler - then she should be in the picture and in the yearbook.\n\nIn the case of the article authors son - no reason he couldnt be standing on stage, beside the choir, doing his dance (just as if there were a sign language interpreter standing there).   No, I am not comparing an autistic child sporadically dancing to a sign language interpreter - just saying that it one is no more visually distacting than the other.\n\nThe real issue would be if someone with a prosthetic leg wanted to particiapate in sport... they dont have muscles to fatigue in that part of their body - should they be included?\n\nAll that said - there is always room for contribution some way some how from everybody if you look hard enough.  For example - some children might rather help setup and take down the concert than be in it themselves.  These children might go on to be stage crew in high school plays.",
            "title_similarity": "0.81220794",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2mgmqq",
            "score": 1,
            "text": "lets say you suffer an accident and our now paralyzed from the legs down. you are not confined to a wheel chair for the rest of your life. That sucks. and what sucks even more is that alot of the opportunity you had to be able to do things have been stripped away from you.\n\nYou can't be on a soccer/baseball team. You can't participate in a marathon. And if in school you have to sit in the front of the class at an easily accessible desk because your wheelchair doesn't fit in between the desks. You carry around a urine bag, because you can't control when your urine comes out anymore. and the bully's at your school are not picking on you for being \"crippled\"\n\nSure lets say you do cause some other problems for the kids around you, you take up a lot of space, your urine bag smells. and you can bump into people, ramps have to be build, maybe even an elevator! buttons have to be put on doors. this is probably not as much problems as a mental disability but still an inconvenience. But because of your state I assume it can be argued that these inconveniences on others can be brushed off as you just can't help it. and further more, why exclude you from things. Why can't you be on a soccer team.\n\nIn your statement you made a logical leap from allowing disabled kids in sports to forcing everyone to go easier on them. This isn't necessarily the case courses the disability matters. but hey you in a wheel chair can still move your arms. You could be the next great pitcher!\n\nthat's what I find abilist about your post, you assume people with disability's are unable to function in life. Sure a person that can't move the lower half of their body can't function in life, so we give them a wheelchair despite the inconveniences. A mentally disabled person can function in life if they are given the support and help. It's unreasable  to say they can't have help. but it's also unreasable to say they can't function. \n\nI'd say we can brush off the little inconveniences that these kids bring. just like kids in wheel chairs. It's the same logic. The same principle.",
            "title_similarity": "0.6578121",
            "sentiment_compound": 0.8537
        },
        {
            "id": "h2mixfu",
            "score": 1,
            "text": "Well... I think that if you have a disabled child that of course you want him or her to be felt normal. Every parent want that for their child. But the one thing you can not expect from other non-disabled kids is to lower their work pace or to not try their best in order for your kid to feel normal or good in class. \n\nThere are special school for disabled children where I come from (the Netherlands). They can all have the same learning pace, good education, more time, more accompaniment by teachers, and the classes are way smaller than \"normal\" classes. \n\nI do think that parents don't want to coop with the fact that they either they have disabled children, that they want them to feel \"normal\" (probably they already feel normal), or they just don't want their kids to go to a school for disabled children... \n\nLet me tell you one thing; nothing is wrong about school for disabled ones. These schools have perfect arrangements! You will be picked up by a schoolbus, more time in class, more time with the teachers for explanation, better, slower explanations so they can understand the education, low fees, and for example the schoolbus drops you off at home. \n\nI don't see why a disabled school should be less good then a \"normal\" school where you as a \"normal\" kid can be bullied, get in to fights, where teachers are to busy for good explanation, and the classes are too big.\n\nI know this writing is quite long but if I would have a disabled kid, I would do everything for him or her but I would not get him in to a \"normal\" school whereas he or she will be fake respected.",
            "title_similarity": "0.6591059",
            "sentiment_compound": 0.9255
        }
    ]
}