{
    "CMV: It is hypocritical to advocate for cancel culture and a rehabilitative justice system at the same time.\nI believe there are mainly two types of cancel culture that we see today. The first type is just cancelling someone from the platform where they committed egregious behavior on. If you act like a piece of shit at a bar, the bar can cancel you from stepping foot in their business in the future. If you are harassing people and being racist on Twitter, Twitter can ban you.\n\nThe second type of cancel culture is advocating for the person's cancellation outside of just the platform where they committed egregious behavior. I've seen people go as far as getting people fired from their jobs, getting people kicked out of college, getting people evicted, etc. This is the type of cancel culture that I am focusing on in my CMV.\n\nTo be clear, I would consider myself on the left politically. However, I am against the left's embrace of this second type of cancel culture because I find it very hypocritical. How can you on the one hand laugh at someone for losing their job for saying something racist or insensitive online, then on the other hand advocate for a more rehabilitative justice system where even murderers should have a path towards redemption and a normal life?\n\nI see this all the time where the same people that ridicule a white person for getting fired from their job or kicked out of college will go around saying that a black guy involved in gang violence should be offered rehabilitation. Either both should be extended a path to redeem themselves, or both should be subject to retributive justice. Having one position for one type of person and another position for another shows that you are ideologically motivated, have no principles, and are hypocritical. CMV": [
        {
            "id": "h2jcm5t",
            "score": 1,
            "text": "/u/rollingboulder89 (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/o4vq61/deltas_awarded_in_cmv_it_is_hypocritical_to/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.48400033",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2jr1hs",
            "score": 1,
            "text": "It's not hypocritical because they view people who go against their ideology as worse than murderers. \n\nIt's disgusting, it's fucked up and it's basically communist gulag mentality but it's not hypocrisy",
            "title_similarity": "0.6918262",
            "sentiment_compound": -0.782
        },
        {
            "id": "h2jcorh",
            "score": 2,
            "text": "Depends on what they were doing and how they act now.\n\nSo if you get into a bar fight and the bar kicks you out, that is bar related. If you willfully act racist towards another person, that's not something that is limited to a situation or place, but is a personal position that you decided to take.\n\nThat's one part of that. And the other is thing is whether you're still that kind of person. And not in the sense of \"C'mon it was the XX's and everybody did that\", that still doesn't make it ok and the fact that you don't see it makes it worse, but if you actually had a change of heart about your action and came clean, one could and often should give people a second chance or what else do you plan to do with them?",
            "title_similarity": "0.893975",
            "sentiment_compound": 0.3855
        },
        {
            "id": "h2j8s4i",
            "score": 1,
            "text": "Its not hypocritical at all. Just because rehabilitation isn't actually jail time doesn't mean its not a consequence for their actions. If anything we should arguing for rehabilitation for the victims of cancel culture.",
            "title_similarity": "0.540603",
            "sentiment_compound": -0.5886
        },
        {
            "id": "h2j99ab",
            "score": -1,
            "text": "\"How can you on the one hand laugh at someone for losing their job for saying something racist or insensitive online, then on the other hand advocate for a more rehabilitative justice system where even murderers should have a path towards redemption and a normal life?\"  \n\n\nBecause the person who is loosing their job has not yet preformed any sort of rehabilitative or redemptive acts that justify them getting their job back after preforming a transgression that justifies them loosing it..",
            "title_similarity": "0.7957936",
            "sentiment_compound": 0.2212
        },
        {
            "id": "h2ja9ee",
            "score": 0,
            "text": "Well this depends on the definition of cancel culture you are applying. \n\nSome people who advocate for *cancel culture* are not advocating for them to be negated, but instead, a boycott until they apologize and/or accept responsibility. That doesn't seem really contradictory towards rehabilitation. So are we using the mediatized version or the original version? Both are technically still viable definitions for the term.",
            "title_similarity": "0.64798605",
            "sentiment_compound": 0.7528
        },
        {
            "id": "h2jg8wn",
            "score": 0,
            "text": " We don't say \"we should let the rapists continue to rape while we try to rehabilitate them\".\n\nCanceling stops the behavior that is harmful and undesired.  Rehabilitation helps the person have the capacity to not behave in harmful ways.  I dont think they are at odds here.",
            "title_similarity": "0.670048",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h2ka6nj",
            "score": 1,
            "text": "> The first type is just cancelling someone from the platform where they committed egregious behavior on. If you act like a piece of shit at a bar, the bar can cancel you from stepping foot in their business in the future. If you are harassing people and being racist on Twitter, Twitter can ban you.\n\nWhy is this \"cancel culture\", and not just how civil society has worked forever? Idk, when the right talks about \"cancel culture\" in this way, it feels awfully disingenuous. Like, has \"cancel culture\" really been this widespread for all of human history? Are bars throwing out drunken patrons really \"cancelling\" them?\n\n> The second type of cancel culture is advocating for the person's cancellation outside of just the platform where they committed egregious behavior.\n\nIsn't this just basic personal accountability? Like, play stupid games, win stupid prizes sort of thing? The first amendment gives you all the protection in the world to say whatever awful thing you want, but that doesn't mean that you're immune from any and all consequences, that people can't choose to no longer associate with you or do business with you if they find your language and actions morally repulsive, that's again just how basic liberal democratic society works.\n\nI can see how maybe what you don't like is just when some people unrelated to the matter actively try to bring these consequences down on people, but I'm both not at all convinced that this is anything new, but also that it's not actually good. Like, if people are expressing overtly racist views, shouldn't we as a society want to remove them from positions of power and influence? Isn't the fact that they violate a core bedrock value of liberal democracy grounds enough for their \"cancelling\"? I can certainly see how being too zealous in this regard can be bad, anything in the extreme is usually bad, but I think we're far from that point right now.\n\n> Either both should be extended a path to redeem themselves, or both should be subject to retributive justice.\n\nI think the difference you're detecting isn't an egalitarian difference. The difference is that, on average, the privileged white person doesn't really need society's aid or sympathy to recover from the sort of \"cancellation\" you're concerned about. They'll be fine in the end. The average young black male is sadly a different question due to about a million different reasons that I'd rather not delve into here, but suffice it to say that two and a half centuries of bondage didn't set that community up for longterm success and prosperity. This gives us an egalitarian reason to be more lenient/understanding/supportive/etc. with young black males than rich white men.\n\nThis is kind of derivative of a debate in philosophical egalitarianism between giving people equal resources vs. equal opportunities. The worry is that if you just treat everyone identically, then you're just going to preserve any preexisting inequalities. This gives us a good reason to give some degree of preferential treatment to the disabled and other disadvantaged individuals in an attempt to ensure equality of opportunity. If you treat the rich white man and the poor black man identically, one on average has a much higher rate or future happiness, prosperity, and reintegration into society. So, if you want them to both have an equal chance at redeeming themselves, you can't treat them identically.",
            "title_similarity": "0.9632433",
            "sentiment_compound": 0.9451
        },
        {
            "id": "h2kpcue",
            "score": 1,
            "text": "For years and years our culture has been dominated by the intolerant, and cultural norms and mores have been used to enforce privilege. People have been fired from jobs for being gay, people have been (and still are) paid less for being a woman, people have been locked up for life because they are black.\n\nIt's a slow and arduous process, and it's definitely not easy or complete, but our culture is changing. Intolerance is becoming the fireable offense rather than difference. Rather than enforcing privilege with these cultural forces, the culture is (in places) actively working to further equality and justice. That's a huge win, but for people who are used to having their privilege reinforced by these mechanisms (essentially economic sanctions at a small scale) it can feel like they are having something taken away.\n\nTough shit.\n\nI'm not going to talk about \"cancel culture\" because it's made up — a straw man used to justify continued intolerance. All we're dealing with is the adjustment of cultural norms and mores such that we're reinforcing tolerance, equality and justice rather than reinforcing bigotry and hatred.\n\nThat adjustment is in no way incompatible with also rethinking and overhauling our so-called justice system, which has also been a tool of oppression hatred and bigotry for hundreds of years.",
            "title_similarity": "0.731753",
            "sentiment_compound": 0.9
        },
        {
            "id": "h2j7nmw",
            "score": 146,
            "text": "It's not something \"the left\" does. Have you ever  heard of Woody Guthrie or the Dixie Chicks? The right goes after people's career all the time.  You only hear about it when it comes from the left because the right is professional at marketing themselves as the real victims in society even though they control all of the mechanisms of power.",
            "title_similarity": "0.6433575",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2j7bac",
            "score": 1059,
            "text": "I think it’s important to remember that they are two radically different systems. One is a set of consequences of free trade and social interaction and the other is a designed justice system enforced by the societal monopoly in violence and backed up with the threat of state violence. \n\nIt makes total sense that they be treated differently.",
            "title_similarity": "0.6699132",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h2ka6xv",
            "score": 2,
            "text": "I would argue that people who are canceled never receive any real punishment, at the very least not at the same level where they would need rehabilitation. \n\nI mean, if you look at the bigger names, all of these people still have jobs. John Lasseter, Morgan Wallace, Louis CK, they all make money in the fields that they were \"canceled\" from.\n\nOn a smaller scale, people who get fired for saying the n word, abusing employees, even police officers who are known for serial violence and harassment--they generally don't lose their jobs and are often working in very similar fields months later.\n\nLook at it like this, do people who are canceled face punishment at the same level as people put in jail or worse? People in jail also lose their jobs, they also have a hard time finding work, they also have a stigma attached to their name. But most importantly, they actually went to jail, they actually spent time in inhumane conditions, they actually served time. \n\nIf you are guilty for a crime and your punishment is going to jail, why would you still have these problems after going to jail? Why is there still a stigma? Why don't exconvicts have the ability to vote? There's a list of reasons as to why we should rehabilitate prisoners, but the most important part is that they were removed from society and have a hard time reentering it. People who are canceled rarely have that problem. People who are canceled are treated poorly (less great than they were, they still have a life), but they aren't treated as bad as previous prisoners.\n\nIf you have a problem with Cancel Culture, the problem should be that the people who are \"canceled\" never face permanent consequences.\n\nCancel culture gets hyped up as this big force that the left uses to punish people who don't deserve it, but Cancel Culture has had no significant impact on society other than the fact that people generally don't agree about what it is.",
            "title_similarity": "0.5943915",
            "sentiment_compound": -0.9907
        },
        {
            "id": "h2j7qco",
            "score": 95,
            "text": "People losing their jobs for saying something racist they said, isn't a \"culture\" that anyone decided to create, it is just an emergent property of at-will employment, employers who want to maximize their workplace's reputation, and social media  that draws oversized attention towards whatever topic is trending, even if it's just a rando's comment going viral.",
            "title_similarity": "0.7825231",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h2jm62o",
            "score": 0,
            "text": "Murderers still have to go through a rehabilitation process. They still get sent to jail and its simply a different way of treating them and a different se of goals while they are here. \n\nPeople getting cancelled is a similar thing. They aren't getting sent to prison. They aren't getting the death penalty. They are getting things taken away from them. They will learn from the process.",
            "title_similarity": "0.73479193",
            "sentiment_compound": -0.8575
        },
        {
            "id": "h2jxzcr",
            "score": 0,
            "text": "The two situations involve two different \"societies\", and have ultimately the same aim: making the entire \"society\" better.\n\nWhen someone goes against the rules, they hurt society as a whole: they reduce the trust among society members and hurt someone. The society takes measures to improve itself: first the individual is taken away from society, then pushed to rehabilitate in order to become a better person and no longer hurt other people and society as a whole.\n\nIn a nation, when someone commits a crime, the government has the power to detain the criminal and force them to rehabilitate. After this, the person will have paid the price for their crime, and can return to society.\n\nIn a social media platform (which is a society), the platform itself doesn't have the power to force you to improve yourself and to stop you from hurting others. It has only a single power over the members of its \"society\": to forbid them from using their services, temporarily or permanently.",
            "title_similarity": "0.7439749",
            "sentiment_compound": -0.8916
        },
        {
            "id": "h2jyz2m",
            "score": 0,
            "text": "Prison isn't the process of no one going near you. Prison is the process of taking you somewhere no one you know can go, excluding visiting hours.\n\nCancel culture is the process of no one going near you.\n\nYour premise makes no sense. You don't have a view. You might as well claim that bike riders are hypocritical if they also support grocery stores over subsistence farming.",
            "title_similarity": "0.6792859",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h2k32fd",
            "score": 0,
            "text": "A bar doesn't \"cancel you\" from entering. That's being banned.",
            "title_similarity": "0.55941796",
            "sentiment_compound": -0.3094
        },
        {
            "id": "h2k34ux",
            "score": 0,
            "text": "Cancel culture is using market forces to remove a platform. Rehabilitative Justice is a government force for criminal behavior.   \n\n\nOne simply says you don't deserve to have a place in popular culture. It's the removal of the megaphone from which you express a one to many broadcast. You are free to do as you wish, continue, or do something else entirely.  \n\n\nCriminal justice removes one freedom. You are not free. They are fundamentally different forces acting on different behavior.",
            "title_similarity": "0.78753465",
            "sentiment_compound": 0.8513
        },
        {
            "id": "h2k3k21",
            "score": 0,
            "text": "I think ideally cancelling someone would just remove them from the public sphere by getting them banned from social media while leaving their life alone but the people who want to have them face real consequences are too loud to be ignored. I do however think that it's right to decide not to financially support someone if they are in turn supporting other negative groups. for example, I used to be a big fan of a certain author and loved his books, however in the last couple years I found out he was part if a strongly anti lgbt Mormon church (more so than the standard) and since I knew that he would be donating a 10th of his income to them I no longer felt comfortable buying his books since I would be directly supporting these horrible people. my point is, at a certain point a person is too big to just ignore and people need to take action to mitigate their harm. in an ideal world, after a year or so of being out of the spotlight a person could come back to the public having changed and apologising for their actions but this just isn't realistic.",
            "title_similarity": "0.8161801",
            "sentiment_compound": 0.5208
        },
        {
            "id": "h2k3qgd",
            "score": 0,
            "text": "Unrelated, one happens in the courts and the other happens on Twitter",
            "title_similarity": "0.46224073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k3tpw",
            "score": 0,
            "text": "It’s hypocritical to hold people socially accountable for offenses they got away with but unfair to rehabilitate our criminal justice system? That’s a very interesting take",
            "title_similarity": "0.67931104",
            "sentiment_compound": -0.4424
        },
        {
            "id": "h2k63lu",
            "score": 0,
            "text": "I think this is a false equivalency.  Rehabilitative justice assumes that some penalty for unacceptable behaviour is being paid, hopes that some part of that penalty includes education and that once the penalty has been paid society should grant something approximating a clean slate.  Cancel culture tries to impose some cost for unacceptable behaviour that would otherwise have little consequence.",
            "title_similarity": "0.6607895",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h2k8i0k",
            "score": 0,
            "text": "Some people who publish names, addresses etc their desire is to put a name on record to an action.",
            "title_similarity": "0.40565175",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2k8qij",
            "score": 0,
            "text": "There’s just such a big difference between taking someone’s platform away and putting them in prison. Does this really need to be debated?",
            "title_similarity": "0.6294978",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2k8tkc",
            "score": 0,
            "text": "restorative justice (not synonymous with rehabilitative justice, but certainly there are overlaps) doesn't posit there shouldn't be consequences for bad actors. It reframes the process from the victim's perspective. \n\nThe broader term you're discussing (rehabilitative justice) doesn't argue \"there shouldn't be consequences for one's actions\" but instead focuses on what should be done after/in addition to punitive action. \n\nThink of literacy, job training programs in prison. Think of re-entry programs. And yes, there is also often an effort to reshape/rethink the punishment itself, but it's disingenuous to say that it's advocates fight for no punishment whatsoever",
            "title_similarity": "0.5792674",
            "sentiment_compound": -0.4027
        },
        {
            "id": "h2k8wuk",
            "score": 0,
            "text": "When you say \"advocate for cancel culture\" what do you mean?\n\nI am well aware that everyone makes mistakes, but I also don't consider it anything less than common sense when people have to face the consequences for their actions.\n\nIf you say something that could easily get me fired from my own employment, and that lands you in trouble, do you blame \"culture\" or suck it up and try to be better going forward? \n\nI ask because your original post defines it like a verb, synonymous with a ban. But from what I've seen, people banned from one job who rehabiliitate their image tend to get numerous second chances. I don't see any people who have had to just give up on themselves because of a firing.",
            "title_similarity": "0.84172595",
            "sentiment_compound": -0.9443
        },
        {
            "id": "h2k9zwr",
            "score": 0,
            "text": "A rehabilitative system aims to remove people from situations that will tempt/allow them to indulge in similar behaviour.\n\nPeople who are banned/removed from platforms are also removed from situations where they can repeat the offending behaviour. That being said, these platforms are under no obligation to rehabilitate anyone using it (I.e. it costs resources to do so when they gain very little).\n\nPeople who are fired from their jobs... Again these workplaces are under no obligation to rehabilitate people, and have a duty of care to their staff. \n\nTo bring it back home... A rehabilitative justice system would bring people back into society, having visibly gone through the process. Inmates would have no option but to go through it. Other situations, however, require the person themselves to *seek* rehabilitation, in a much less visible way. Most people in those situations, however, don't seek it out anyway",
            "title_similarity": "0.6923809",
            "sentiment_compound": -0.1576
        },
        {
            "id": "h2kapb7",
            "score": 0,
            "text": "You can say that criminals are usually victims of social structures stacked against them when serving 15 years and come out even less adjusted to society. \n\nYou can't say a videogame developer worth $170 million is a victim of anything when he gets shit on Twitter for being a bigot who fucks the very people who made him rich, and he retires to spend the rest of his days on a private beach. \n\nIt's not the same. He's not a victim of being a bigot the same way a drug addict is a victim of poverty or mental illness or trauma. It's not the government's responsibility to sink resources into helping him rehabilitate from being a bigot.",
            "title_similarity": "0.6923455",
            "sentiment_compound": -0.945
        },
        {
            "id": "h2kb6n5",
            "score": 0,
            "text": "There is a large and powerful sociopolitical engine whose goal is to bolster the kinds of ideas and behavior which people are \"cancelled\" for as a means of retaining power and oppressing others, coupled with a secondary push towards general out-group distrust and resistance to change. One direction of fighting against that engine involved dealing with the people sucked up into it. More patient and compassionate responses over the course of previous decades seems to have lead to nothing but a hidden festering of such things rather than their removal and their own rhetoric and disinformation has been escalated, so stronger tactics became necessary.\n\nThere is no such power structure related to crime pushing some large-scale agenda of control and oppression, especially not through some sort of belief in criminality.\n\nThe answer to your question is that the calculation with respect to the Paradox of Tolerance shifted with Trump and subsequent revelations about our country.",
            "title_similarity": "0.7554363",
            "sentiment_compound": 0.3251
        },
        {
            "id": "h2kb7dc",
            "score": 0,
            "text": "Looks like you've had a CMV regarding the idea that Cancel Culture as a \"thing\" and rehabilitative justice are not diametrically opposed to each other. \n\n&#x200B;\n\nSo the point I'll address is your concerns about it being hypocritical to take pleasure in the consequences of someone being canceled for their bad behavior.\n\n&#x200B;\n\nEmotions are not a choice. You feel how you feel, and so feeling an emotion is not in and of itself moral or immoral. \n\n&#x200B;\n\nArguably, the act of ridiculing someone on social media for their bad behavior IS the mechanism by which they are facing the consequences of their behavior. Say something offensive, people will act offended, and in being the offender you will face social consequences such as social ostracization and potentially losing your job. \n\n&#x200B;\n\nThis is not a partisan thing, as you have acknowledged, but rather a human thing. \n\n&#x200B;\n\nSo when a bad actor faces justice, people will have positive attitudes such as amusement, joy, relief as a result. They aren't choosing these emotional reactions - but they are expressing their emotions reasonably.  \n\n\nNone of that interferes or otherwise invalidates rehabilitative justice as a moral good and thus a more ethical approach to justice. You can both laugh at a Nazi getting punched AND be a pacifist, because not advocating violence as a solution doesn't mean that you can't appreciate seeing an asshole get creamed.",
            "title_similarity": "0.70850897",
            "sentiment_compound": 0.9906
        },
        {
            "id": "h2kd1vz",
            "score": 0,
            "text": "Stop calling it cancel culture thats a trick like calling torture enhanced interrogation. \n\nIts the arseholes of the world that have coined the term cancel culture when its really just sanctions. If a person, company or country does something you find unacceptable you put sanctions / boycott them. \n\nIm for rehabilitation- nordic style and i support taking actions against the Dick Chaneys of the world so i have sanctioned chaney, bush and various business and wotld leaders. - if it was done on mass there woukd be people complaining they were \"cancelled\" when in reality they are just horrible people who some of us want nothing to do with.\n\n  It was a very clever social manipulation framing having moral standards and ethics as cancel culture. Dont buy into it people.",
            "title_similarity": "0.83072054",
            "sentiment_compound": -0.9576
        },
        {
            "id": "h2kevod",
            "score": 0,
            "text": "IMO, the first type you have given isn't cancel culture... cancel culture is when some random person or mob self-deputizes themselves as the morality police and pesters someone who has power over the offending individual until they cave and dole out consequences that are way out of proportion to the offense or are extrajudicial.\n\nLike Twitter shutting down an account for clearly violating their terms of service isn't cancel culture, but a raging mob of petty people calling for Twitter to do so for some perceived indiscretion IS cancel culture.",
            "title_similarity": "0.88361484",
            "sentiment_compound": -0.8587
        },
        {
            "id": "h2kfkm6",
            "score": 0,
            "text": "Cancel culture is a vague term meaning different things to different people.  Some people think it's unfair to cancel Hitler.  I honestly don't know what that means.\n\nAlso, it's worth saying, cancel culture is a new term for an old idea , and not something we can legislate away.",
            "title_similarity": "0.72261137",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2kfq1z",
            "score": 0,
            "text": "For rehabilitative criminal justice, for one thing, that person HAS ceded rights. And is under agreement to follow the guidance of the program.\n\nFor cancel culture, there is no mechanism of control over the other party. That's partly why the cancelling may be seen by some as necessary; they feel that participation is their most effective voice.",
            "title_similarity": "0.60705894",
            "sentiment_compound": 0.6764
        },
        {
            "id": "h2kfzuo",
            "score": 0,
            "text": "From a social worker who works in detox:\nRehabilitation requires a few things but most importantly it requires effort and a want to change. Without those it cannot happen. You cannot rehab with time passed feeling guilty post a apology video and expect your past to be finished. You need to work and get help to rehabilitate yourself.\nSecondly criminals pay for their crimes forever. If I had any criminal record I wouldn't be allowed to do my job regardless of time passed.",
            "title_similarity": "0.7087008",
            "sentiment_compound": -0.7587
        },
        {
            "id": "h2klb2d",
            "score": 0,
            "text": "There's a lot going on there, but I mostly agree with what another had posted. One is based on laws that restrict or prohibit, while the other is based on the court of public opinion. For the former, they are forced, by law, to pay in some way for their behavior and should have ways to earn lifted restrictions after time. The latter would be to work towards improving your view by public opinion, which can be much harder based on what you've done.",
            "title_similarity": "0.67746305",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h2klxh2",
            "score": 0,
            "text": "Oddly I agree with you that it is a bit hypocritical to  have the different standards. Yet at the same time I am guilty of it myself.\n\nI think part of the reason why I have the two standards is my life experiences with both groups of people.\n\nThe criminals if you give them a chance to change and show them a reason to change, many times they will change.\n\nThe people who are racist assholes usually won't change and many times will flat refuse to even acknowledge they even are racist (or homophobic or whatever other group you want to put in here). \n\nI've gotten tired of fighting with them.",
            "title_similarity": "0.7786125",
            "sentiment_compound": -0.9753
        },
        {
            "id": "h2kmi70",
            "score": 0,
            "text": "Cancel culture does not exist.. at all. It’s all based upon subjective grievances. For (one) example... republicans think they’re victims of cancel culture, when in reality, society as a whole is moving away from conservative viewpoints. So, to develop a whole ‘other’ theory about cancel culture and “the justice system” on top of an already flawed bass theory, is sus.",
            "title_similarity": "0.7189438",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h2knoxk",
            "score": 0,
            "text": "This is a really insulated take and would take a discussion to point out how the two things are different. It's online life vs offline. You don't have to be online but you do have to be offline. That's about as easy as you can put it.\n\nBringing in the white person and black person seems like you're being dishonest about your motivations for this post.",
            "title_similarity": "0.7425755",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h2kqll3",
            "score": 0,
            "text": "You’re comparing apples to oranges. If someone does something that is brought to the attention of their boss and their boss decides to fire them, they have options. They can get another job, go on unemployment, live off their savings, change careers, move, make amends, double down, get a job at Fox News, make a movie with Ben Shapiro, etc. No one is actually taking away their freedoms and the stakes are relatively low most of the time (not every time, but a vast majority of the time). On the other hand locking someone in prison is the definition of taking away someone’s freedoms, has lifelong and even generational consequences which contribute to systematic racism. I don’t care if someone (regardless of race) gets fired for being an asshole, it happens all the time. I do care if someone is sent to a for profit prison to be locked down 24 hours a day, put in solitary confinement, and is not given a path towards rehabilitation.",
            "title_similarity": "0.7063628",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h2ksn4y",
            "score": 0,
            "text": "Cancel culture is a consequence of the fact that everything associated with a company is advertising and marketing for that company, either for good or for ill. Even if there is no direct connection, merely being associated in people's minds with a disreputable person can taint a company's image, and thus hurt their bottom line. Similarly, being seen to act against the disreputable person can cause a company to be perceived favorably by the public, and is this good marketing - people are quick to think \"the enemy of my enemy is my friend.\"\n\nConsequently, if there is a disreputable person working for a company, firing them serves the dual purpose of both breaking clear of the taint by association while at the same time establishing the company as a friend of the public. If the person is supported by advertisers, the advertisers might break away for the same reasons for fear of losing the business of the public\n\nCancel Culture is simply the natural result of \"voting with your wallets\" in an age where the accessibility of information  makes the tactic extra effective. Such voting, I will remind you, is what Conservatives have traditionally pushed when the company in question took a stance that Conservatives favored and Progressives opposed; \"If you don't like it, vote with your wallet!\" Conservatives cried, and they themselves partook in the earliest form of Cancel culture: the boycott.\n\nTLDR: Cancel culture is nothing new, and for Conservatives to condem it is rank hypocrisy.",
            "title_similarity": "0.7743236",
            "sentiment_compound": -0.8088
        },
        {
            "id": "h2kszzk",
            "score": 0,
            "text": "Uhhh rejoicing when karma slaps back at abusers when thenjustice doesn't isn't in contradiction to wanting a justice system that focuses on rehab.\n\nIt's 2 different things...",
            "title_similarity": "0.6631429",
            "sentiment_compound": 0.4682
        },
        {
            "id": "h2ktkfy",
            "score": 0,
            "text": "You get canceled from a career but not from everything. People just do not want to see you still be able to use a platform to possibly spread hate when you didn’t take accountability before you got called out. \nBut you absolutely can find a new career that just isn’t giving you the power to spread hate. \n\nActress does domestic abuse and try to look as a victim? She can absolutely find a job in an office and get her life back on track. But she will not be given a place to spread lies to a big part of the population. \n\nIdk if I am clear english is my second language and I am pretty tired lol",
            "title_similarity": "0.7548965",
            "sentiment_compound": -0.9386
        },
        {
            "id": "h2ktw6s",
            "score": 0,
            "text": "This is not necessarily theologically sound, depending on one’s religion, but:\n\nRedemption requires repentance. \n\nA path back is fine, redemption is good. We want people to redeem themselves. Their victims are under no obligation to forgive them, but at some point it should be possible for the punishment to cease and the offender to be accepted back. \n\nBut insisting that they accept responsibility, repent, and apologize before this happens is not unreasonable. Restorative justice has “restorative” right in the name; these are key concepts there. \n\nCall the other “restorative uncancellation”.",
            "title_similarity": "0.62125456",
            "sentiment_compound": -0.2878
        },
        {
            "id": "h2kvlxk",
            "score": 0,
            "text": ">However, I am against the left's embrace of this second type of cancel culture because I find it very hypocritical.\n\nIs this the case? Truly? I have yet to see compelling reasons to believe that 'cancel culture' has been as widely accepted as the internet likes to make it seem.\n\nSocial media certainly has a 'cancel culture' issue, but I don't see how it is at all based in politics.\n\nThere have been instances where false or unfair reasons have been used to 'bring someone down', but usually it seems to be people who have hypocritically achieved levels of \"internet status\" and exposure being called out for behavior they should be held accountable for.",
            "title_similarity": "0.8043119",
            "sentiment_compound": -0.4509
        },
        {
            "id": "h2kvu3i",
            "score": 0,
            "text": "Why do you believe people who are cancelled don’t have a chance to redeem themselves?  The woman who flew to Africa and tweeted a joke about getting AIDs got fired before her flight landed, but eventually got her job back with that company.  \nJames Gunn lost his job at Marvel and got his job back.  \nAl Franken could run for Senate again if he wanted.  \nRehabilitation in part requires admitting what you did was wrong, then not doing it again. Anyone who committed gang violence in the past carries that record for a long time and can be a suspect in later unsolved gang related violence, but can also be observed not being violent and can earn trust through observable action. People cancelled for speaking thoughts employers don’t want associated with their business, their stigma is based on vocalized views, and it’s a lot harder to prove your views have changed and your not just hiding your true beliefs out of fear of further repercussions.  \nIf you are now saying, “your examples earlier included only liberals.” You would be right. That is because they had a lot of people step up to defend them based on the strength of their character.  Context matters in all things. Conservatives are far less likely to get this kind of character defense because it’s embarrassing to defend credible attacks about truly reprehensible behavior, unless of course you’re a Supreme Court Justice nominee.",
            "title_similarity": "0.74948514",
            "sentiment_compound": 0.7097
        },
        {
            "id": "h2kw12c",
            "score": 0,
            "text": "Some people are irredeemable and I see the extreme cancel behavior as justice for those who are ignored by the justice system. \n\nIf a violent offender can’t get out of the jail pipeline no matter how hard they try then that racist karen should stay jobless. It’s “social justice.” People who are socially shitty within the law should still face consequences, or in other words, be cancelled.\n\nYou commit a crime but feel sorry for it, chances are, you’ll still be punished for the crime.",
            "title_similarity": "0.82117367",
            "sentiment_compound": -0.9458
        },
        {
            "id": "h2kw3d6",
            "score": 0,
            "text": "Cancelling someone in the way you are describing does not prevent them from redeeming themselves.\n\nJust like with being incarcerated though, redeeming yourself and building back public trust takes time and sacrifice.\n\nBoth parties are essentially taken away from their jobs and forced to start at square one building up their public trust, the only difference is one of them is incarcerated while the other is free to roam the streets.",
            "title_similarity": "0.6828438",
            "sentiment_compound": 0.8814
        },
        {
            "id": "h2kw44m",
            "score": 0,
            "text": "Nobody stays cancelled.",
            "title_similarity": "0.15067989",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2kwdl0",
            "score": 0,
            "text": "I personally believe that \"cancel culture\" should be reserved only for the people who make it clear that they have no interest in being rehabilitated.  Anyone who posts something, or is caught on camera doing something, that is problematic, has the chance to atone for what they have done by apologizing, learning, and making commitments to do better in the future.   When people take those steps, I think that they deserve, second, or even third chances.  However, when people choose to decry cancel culture instead of taking any form of accountability for their actions, I think that social consequences that are a bit more extreme, like deplatforming or losing a job are appropriate.  With the hope that those consequences encourage more people to go the route of trying to do better, or being rehabilitated.  Thus, I think it is quite possible to advocate for cancel culture and rehabilitative justice without being hypocritical.",
            "title_similarity": "0.7869494",
            "sentiment_compound": 0.927
        },
        {
            "id": "h2kxuge",
            "score": 0,
            "text": "Cancel culture has existed since the beginning of people. They would just execute you or banish you from the village",
            "title_similarity": "0.6036806",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2ky0vg",
            "score": 0,
            "text": "Do you think harvey weinstein should have kept his job? I mean technically I don’t think he ever did anything bad on set.",
            "title_similarity": "0.45088878",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2kz9kw",
            "score": 0,
            "text": "For me, the first question is whether you believe in universal basic income or a \"right to work\"\n\nIf not, then individuals don't have a right to income, and being \"cancelled\" out of their job is a much more severe penalty, hence why you might be averse to that penalty.\n\nIf you do believe in UBI (or some form of guaranteed employment, even if in a different line of work) then  job-canceling becomes a much more proportional/appropriate penalty.\n\nSo, I think we should advocate for UBI, and then allow people to be called out for bad behavior and not sweat it if they lose their job over it. Win win",
            "title_similarity": "0.7357507",
            "sentiment_compound": -0.8793
        },
        {
            "id": "h2kzhme",
            "score": 0,
            "text": "People often get \"cancelled\" after a rehabilitative/restorative/transformative justice approach fails. Keep in mind that unless you are directly involved in the situation, you are likely only aware of a fraction of what has gone on, that which has been made public, sorta like an iceberg. Most people (aside from sociopathic or antisocial people, really) would much rather settle a dispute with as few people involved as possible. Making any sort of a public statement about someone and a negative situation they've been involved in, is usually done as a very last resort. Nobody would want to deal with the inevitable backlash and prying into their personal life and shredding of their privacy that usually comes with that, at least not anybody in a healthy mental state. I've been involved in several of these type processes (not celebrities, of course, but people of note in local scenes and people with white power connections), and in each instance there were weeks if not months of attempts at communication, attempts to establish accountability processes, attempts to get as objective as possible facts of the situation. And in nearly all instances, the attempts were ignored or treated with hostility/retaliation/intimidation. That's not to say that these processes are never productive; in the cases where they are though, the dispute it kept between only those involved and mediator(s). In situations where someone has been \"cancelled\", however, the choice to do that almost always comes the failure to participate in smaller more private attempts to resolve whatever has been wronged.",
            "title_similarity": "0.7485008",
            "sentiment_compound": -0.9403
        },
        {
            "id": "h2kzlkt",
            "score": 0,
            "text": "Cancel culture is socially holding people accountable as a consequence of the justice system failing to acknowledge whether there's justice to be served.",
            "title_similarity": "0.68366134",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2l014l",
            "score": 0,
            "text": "The left doesn't embrace cancel culture that's just Twitter",
            "title_similarity": "0.58970785",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h2l04lb",
            "score": 0,
            "text": "I don’t know who first coined the term “cancel culture”, but I know commentators on the right side of politics like to throw it around as if it’s new. Calling a horse a dog doesn’t make it a dog. Boycotting has always existed. People losing their jobs for shitty behaviour has always existed. We live in a time where the world is more connected than ever because of social media. It just amplifies what’s always been happening. And I don’t see how you can equate a rehabilitative prison system with this. Someone committing a hate crime, such as making a false report about a black person to police, should be charged with a crime and get locked up to be rehabilitated - same as any other crime with an active sentence. Seems to me that you’re comparing two different things.",
            "title_similarity": "0.7859495",
            "sentiment_compound": -0.9862
        },
        {
            "id": "h2l0qfo",
            "score": 0,
            "text": "Note, there is a difference between a ban, a boycott and canceling.\n\nBan: Company decides to stop doing business with you.\nBoycott: People decide to stop doing business with company.\nCancelling: Other people bully a company to stop doing business with its customers.\n\nNot going to Planned Parenthood is a boycott.\nHarassing people going to Planned Parenthood is cancel culture.",
            "title_similarity": "0.85863924",
            "sentiment_compound": -0.9803
        },
        {
            "id": "h2l1a4u",
            "score": 0,
            "text": "There's no such thing as cancel culture. Problem solved",
            "title_similarity": "0.32038936",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h2l1hvk",
            "score": 0,
            "text": "Cancelling someone, usually, is about trying to get people to claim accountability for their actions. Obviously it doesn't always go like this, especially with Twitter's algorithm not pushing the replies that people agree with most to the top, since people get different levels of outraged, many people become vindictive etc.\n\nBut there have been many, many people who did bad things but since have GENUINELY apologised for them and they're not \"cancelled\". Chris Evans, for example.\n\nGetting people to take accountability IS part of rehabilitation.\n\nPeople who lose their job or get de-platformed elsewhere - they've caused serious harm and haven't shown any repentence for their actions. In a rehabilitative justice system, the person doesn't necessarily get off scot-free. You can restrict someone, and then rehabilitate them later. \n\nIf someone needs intensive, psychiatric help for their mental challenges, they're going to be placed somewhere that means they get that help AND can't harm others.\n\nEssentially, the two can co-exist. It depends a lot on context. Just saying some wrong and apologising or recognising it is different to actively spreading hate etc. and losing your job.\n\nWith that said, if someone is genuinely vindictive about cancelling and doesn't think people can change etc., then I highly doubt they're the same ones pushing for a rehabilitative justice system. As far as I've seen, but I could be wrong, the two demographics don't seem to overlap. So the question would be moot in the first place.",
            "title_similarity": "0.8028252",
            "sentiment_compound": -0.943
        },
        {
            "id": "h2l2gm0",
            "score": 0,
            "text": "If racism is the crime, cancellation is the punishment, and sensitivity training/public apology and recognition of the issue is rehabilitation. \n\nWith prison, selling weed is the crime and prison is the punishment (for example) but the pathway to rehabilitation is extremely difficult.\n\nYou're comparing crime+punishment with punishment+ rehabilitation, so it's not really a perfect comparison. There is a path to correction in cancel culture, so the two systems exist in a better parallel than you assume.\n\nOn top of that, it's all part of reparations for a systemic issue which has been engrained for centuries - people have gotten away with discrimination and abuse for so long and people have been targeted by the justice system because of race for just as long. So cancellation is an aggressive correction of habits and rehabilitation is equally a correction of the system.",
            "title_similarity": "0.74568135",
            "sentiment_compound": -0.9758
        },
        {
            "id": "h2l3lkc",
            "score": 0,
            "text": "OP. You stole this for a Freddy deBoer article called Planet of Cops.\n\nhttps://medium.com/@jesse.singal/planet-of-cops-50889004904d\n\nGive him credit!\n\nEdit. Here is the quote: \"we can’t simultaneously be a movement based on rehabilitation and restorative justice AND a viciously judgmental moral aristocracy.\"",
            "title_similarity": "0.6682749",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h2l3xgz",
            "score": 0,
            "text": "I mean it really isn't. If in the present someone says and/or does something egregious they deserve  cancelation. However if they put in the effort to improve on themselves, whtether through counseling or self-reflection, they should absolutely be welcomed back. \n\nTake the James Gunn situation. About a decade ago he posted some realy dicey tweets. Not much attention was given to them at the time, likely because he didn't quite breakout big as a director yet , but he had apologized for them sometime afterwards. Fast forward a few years he's made the Guardians of the Galaxy movies and has made a name for himself. Someone digs up those old tweets in an effort to cancel him and it almost worked. Disney fired him from Guardians 3, and some other stuff dropped him too, I believe. However several people went to bat for including Dave Bautista, who has been known to be very outspoken about people he doesn't like. Fans, citing that he apologized for the tweets years prior, gave Disney all sorts of trouble for the firing and were eventually pressured into hiring him back.\n\nNow let's take Hulk Hogan's situation. A sextape of his got leaked, which in of itself is not an issue, and most people were actually fairly supportive of him when he sued the company that leaked it into oblivion. The problem with him was he said some really racist stuff in that tape. Private consensual sex, while gross to some, is not a problem with most people. However saying some racist and dehumanizing stuff based on a person's skin color is not acceptable with most people. And even worse is he hasn't really shown that he's learned from it. Even his apology to the wrestling locker room, which was behind closed doors, apparantly didn't come off as sincere. And as a result he still gets massive boos when he makes wrestling appearances. \n\nPeople, though obviously not everyone, will absolutely be willing to welcome you back. You just have to show you have learned or are willing to learn from your mistakes.  Rehabilitive justice is the same way.",
            "title_similarity": "0.67499924",
            "sentiment_compound": -0.9865
        },
        {
            "id": "h2l61fi",
            "score": 0,
            "text": "What the right refers to as \"cancel culture\" is really just people exercising their right to do business with whomever they please. No business is entitled to my patronage or anyone else's.\n\nNothing is cancelled except my dollars going to someone whose views or actions I detest. What the right hates is that any of this stuff gets reported, like which companies donate to congressmen who support the big lie. They want it to stop because people might quit buying that company's products and services and make the company pay an actual price. So they play the victim and whine about cancel culture.\n\nYou may be a concern troll because this sounds like an argument a concern troll would make, but if not, don't allow the right to define the teens of the discussion.",
            "title_similarity": "0.7983304",
            "sentiment_compound": 0.064
        },
        {
            "id": "h2ldkv5",
            "score": 0,
            "text": "Cancel culture is some dumb shit.  Discrimination to correct discrimination is some dumb shit.  The good news is, I think most progressives disagree with both of these strategies.",
            "title_similarity": "0.69666135",
            "sentiment_compound": -0.9411
        },
        {
            "id": "h2lfpsj",
            "score": 0,
            "text": "Lots of other good comments here, just wanted to point out an obvious one, that \"cancelling\" can often be minor consequences and a hit to one's reputation, nobody's locking them up and throwing away the key.\n\nAnd two, \"cancelling\" is just independent people and entities no longer wanting to support or promote a person who has done something despicable.  It's not a state run process with defined rules, and authority figures forcing you into a situation.\n\nI think people are also open to change in these people, many people that were \"cancelled\" have shown remorse and regained sympathy with the public and companies they work with. But it's up to individuals what they're willing to accept. Incarceration should be held to a higher standard, it's honestly kind of mind blowing that you would even compare the two.\n\nI think a more accurate statement would be that it's hypocritical to strive for rehabilitation in our prison population, and also hope that people who get \"cancelled\" never improve. Which I don't think is as common as you think it is.",
            "title_similarity": "0.77815557",
            "sentiment_compound": -0.1923
        },
        {
            "id": "h2lg8jd",
            "score": 0,
            "text": "Cancel culture is about accountability. People in the justice system are already, to some degree, being held accountable. They are not the folks getting canceled, those folks are rich and powerful, or privileged, people still out an about in society, enjoying it's benefits, despite their bad behavior. Cancel culture is about voting with ones dollars to hold accountable those that society does not, for whatever reason. It's also about spending money in a way that supports whatever a person believes ethically and morally. Of a canceled person demonstrated true remorse and make legitimate amends for their actions, socially conscious citizens could decide to accept them back into good graces. But, as everyone knows, those kind badly behaving folks generally cry crocodile tears, if they shed any at all for their bad actions. The main difference between rehabilitation in the justice system is that those folks are demonstrably paying a price to society for their actions and have to meet certain criteria before they advance back into social acceptance. There is generally no such mechanism for evil CEOs that kill people overseas for profit margin (as this week's SCOTUS Nestle ruling makes clear), or celebrities that abuse their fame at other people's expense, or random citizens that inflict racist/sexist upon society at large.",
            "title_similarity": "0.62818825",
            "sentiment_compound": 0.3016
        },
        {
            "id": "h2lkovx",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.22117987"
        },
        {
            "id": "h2m4pst",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.22117987"
        },
        {
            "id": "h2j7dti",
            "score": 26,
            "text": "The free market and the justice system are different.",
            "title_similarity": "0.38091117",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h2j71hq",
            "score": 34,
            "text": "\n\n>I've seen people go as far as getting people fired from their jobs, getting people kicked out of college, getting people evicted, etc. This is the type of cancel culture that I am focusing on in my CMV.\n\nDo you have an example? I see a lot of people laughing at people suffering consequences of their own actions, but I don't see a lot of people calling for endless retribution. Me laughing at someone who said something racist losing their job because of it, and me clamouring for that person to lose their job are two very different things.",
            "title_similarity": "0.8245634",
            "sentiment_compound": -0.8979
        },
        {
            "id": "h2j86pz",
            "score": 63,
            "text": "In the OP, you said \"even a murderer can be rehabilitated\".  So let's go from there.  \n\nDo we let someone who has demonstrated a willingness to kill, after they have served their sentence, have access to guns?  No, and in fact \"violent criminal\" is a pretty easy restriction for people to agree with, even if they are pro gun.\n\nLikewise, I don't want someone who has demonstrated prejudice against minority groups to be in a position to exercise that bias.  Property managers who decide who gets housing, bosses that decide who gets jobs - these people probably should be fired for the same reason you don't let a murderer own a lethal weapon.  People like that in positions like that keep racism alive in this country.",
            "title_similarity": "0.7579345",
            "sentiment_compound": -0.9399
        },
        {
            "id": "h2jd3sr",
            "score": -1,
            "text": "Can you explain what you mean by \"hypocritical\" here?   In the dictionary, \"hypocrisy\" is about expecting higher moral standards from other people than yourself, but there are plenty of credible reasons to want a rehabilitative prison system that have little to do with morality or even ethics.   An example of hypocrisy (as defined in the dictionary) would be canceling people in public for saying the same sort of stuff that the canceler themselves says in private.",
            "title_similarity": "0.76376677",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h2k93u0",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.25463557"
        },
        {
            "id": "h2kiq8t",
            "score": 1,
            "text": "I think the real distinction in cancel culture is not whether it is done by twitter or twitter users, but rather whether the target is a powerful person who cannot be held accountable otherwise, or a normal person who made a mistake.",
            "title_similarity": "0.7453804",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2kmzyz",
            "score": 1,
            "text": "This is an interesting viewpoint I'd never considered.\n\nI have 3 primary prongs in my response (I would number them, but markdown doesn't actually preserve the numbers with the way this comment is written):\n\n* Why do view rehabilitative justice systems and \"cancelling\" someone as inherently at-odds or contradictory? You say\n\n> How can you on the one hand laugh at someone for losing their job for saying something racist or insensitive online, then on the other hand advocate for a more rehabilitative justice system where even murderers should have a path towards redemption and a normal life?\n\nBut this seems to me like a very specific example constructed only to point out hypocrisy. Do you have examples of instances where people who advocate rehabilitative justice systems have a campaigned for and taken glee specifically in the social retribution in the manner you present? Because it seems to me that, much like imprisonment, social pressures (e.g. losing a job) can be used in service of a rehabilitative justice framework as well; social pressure of that kind is merely a tool.\n\n* Is there any reason to assume that all offenses can be \"rehabilitated from\"? Some murderers can likely be taught the errors of their ways and made into upstanding members of functional society, but some cannot because they recognise that society views their actions as wrong, and they themselves might even understand why, and yet choose to commit the acts anyway. In the same way, is it not possible for someone who views \"being a neo-Nazi\", say, as an offense so heinous that it is not possible to rehabilitate such a person even if they believe in a rehabilitative justice system? After all, that's not a crime committed in the heat of the moment or some similar, it's a political position that both historically and currently explicitly advocates for extreme cruelty and inhumane acts.\n\n* Would you accept \"pragmatism\" as a means of resolving the hypocrisy in the dynamic you put forward? For example, in the \"Nazi\" case above, getting such a person fired from their job can be viewed as simple pragmatism in that a person who holds those views likely donates money to politicians, media personalities/influencers, and political/paramilitary groups who hold the same views and who work to consolidate, strengthen, and spread their political powerbases, and by getting this person fired, these \"more dangerous\" figures are denied an additional source of money in a kind of bottom-up \"starvation of the cause\", if you will. Cancelling a person from an individual platform (like Twitter) is a start, since it means that they won't be able to spew their rhetoric personally, but that's all it does.",
            "title_similarity": "0.7709709",
            "sentiment_compound": 0.6545
        },
        {
            "id": "h2krcs7",
            "score": 1,
            "text": "You consider yourself a leftist yet your most frequent political subreddit is r/neoliberal?   \n  \nI’ve got some news for you.",
            "title_similarity": "0.48663482",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kts3a",
            "score": 1,
            "text": "\"Cancel culture\" only exists and has potency as a last vestige and refuge of societal shame. \n\nWe are in a post-shame era for rich, powerful, and famous individuals (sometimes, very nearly, institutions and brands too).\n\nIt was an important mechanism for curtailing the abuses of those powerful individuals when their transgressions came to light. To save face, reputation, and legacy they would most often retreat from the public eye to some degree. That does not happen anymore. And when these transgressions don't meet the requirements of civil or criminal law, then what recourse is left to the public other than to apply pressure to these individuals in other ways?\n\nI think when this tool is applied to the established and favored, then it is appropriate because it can only do a limited amount of harm. These individuals have often accumulated the means to live very well without their main career and often manage to start a completely different career after leaving the public eye for some time.\n\nFurthermore, I think it is only a potent tool when it is applied to those who have prominent profiles in their communities. This is not a tool that is easily wielded to \"punch down\".\n\nAlso I think it is a false equivalency to pretend that rehabilitation resources and reform that should be offered to the people most damaged and exploited by our current justice and economic system is even remotely similar to the social leniency you would like to offer those being cancelled. Those are 2 completely different systems and segments of society. \n\nI would need a statistically demonstrable overlap between those segments before I even break a sweat about hypocrisy. Granted, I don't care as much about core principles as I do about measurable improvements to the humane treatment of our most vulnerable parts of society and so your perspective may differ.\n\nFinally, I would like to circle back around to how I started this argument, by putting quotes around the phrase \"cancel culture\". I specifically did so because I think it is important to emphasize that this is a rebranding of a concept and practice that has been with us for a long time. Whether it is voting with our wallets, blacklisting, shaming, slandering, gossiping, protesting, stigmatizing, excommunicating, banishing, exiling, or ostracizing, humans have been doing about the same behavior for our 200,000 year existence. And so, in that context, I would re-emphasize 2 things: 1) Clearly, it serves a mechanism within our society that has some utility for it to stick around and 2) the modern \"cancel culture\" form is really one of its most impotent iterations.",
            "title_similarity": "0.76295197",
            "sentiment_compound": -0.6883
        },
        {
            "id": "h2lu33j",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2211799"
        },
        {
            "id": "h2j7pfi",
            "score": 263,
            "text": "You realize that a rehabilitative justice system doesn't mean you are permitted to commit crimes and be free of consequences, right?  You've still got to pay your fine and serve your time. It's just that the objective is to have you leave prison a better person than when you went in.  To produce someone who can function in society and contribute to society in a positive manner.\n\nHow is that inconsistent with having someone face social consequences, like losing their job, for committing a social wrong?  The idea would be that the bad actor would respond to those consequence by becoming a better person who, in the future, will avoid those social wrongs and will instead contribute positively to society.",
            "title_similarity": "0.661775",
            "sentiment_compound": 0.885
        },
        {
            "id": "h2jss4q",
            "score": 22,
            "text": "“Cancel culture” isn’t a system. It’s the process by which a set of aggressive opinions are signal-boosted by a Trending system to the point that they have real-world consequences. It’s nothing like a real justice system, it’s basically a social media platform error. It’s also a very minor problem for working-class people, and tends to only have unavoidable consequences for those who are prominent and successful enough to recover from them. The only people out there who seriously have to worry about the consequences of “cancel culture” are YouTubers and TikTokers with obsessive followings - and that’s an extremely small slice of the population\n\nSo to draw a parallel between cancel culture and the justice system, which is a formalized structure that applies to us all, is dishonest. You cannot avoid jail by becoming friends with people who dislike jail. You can for cancel culture. \n\nPeople who are anti-punitive measures aren’t necessarily saying that they’re against *any* social punishment at all. For instance, if a friend is a constant asshole to me, I’ll stop being friends with them. That’s technically a punishment. Does that alone mean that my calls for the abolition of a punitive justice system are hypocritical? \n\nThat’s the big difference we’re dealing with here. Informal social consequences and formal systematic consequences are simply not the same. You can argue that the former are flawed, that’s your right, but you can’t draw a parallel between the former and the latter. \n\nIt’s highly likely that, even if we had a rehabilitative justice system for murderers, they would still be subject to informal social consequences *much more severe* than those who are accused of saying something racist. Do you *truly* believe that a convicted murderer would have an easier time getting a job than a racist? Or getting married? Or buying a house? Or even just making friends?",
            "title_similarity": "0.76181096",
            "sentiment_compound": -0.978
        },
        {
            "id": "h2k101e",
            "score": 16,
            "text": "Say you're an employer.  One of your staff has been going to white supremacist rallies and chanting \"death to the Jews\" and the like.  But he didn't do it at \\*your\\* business.  Would you feel ok keeping this person on?  Do you think your other staff would be ok working with him?  Do you think it would be a tremendous blow to morale if everyone on your staff knows you have a white supremacist on your staff and he's got an implicit approval from you?\n\nThat's an extreme, but not unheard-of example.  If you think the employer is justified in letting this particular person go, then where do you draw the line?",
            "title_similarity": "0.77260447",
            "sentiment_compound": 0.9388
        },
        {
            "id": "h2jcb6c",
            "score": -2,
            "text": "Are you talking about Gina Carano?",
            "title_similarity": "0.19537653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k54vj",
            "score": 2,
            "text": "But people who have served prison time face the same if not more social consequences, usually it is hard for them to find a job or housing, they may lose a partner, experience ostracization, etc. \n\nThe goal of rehabilitation is to both reduce the amount of prison time by accelerating their ability to reenter society. But even then, no amount of rehabilitation is going to eliminate the social stigma they will face. Even laws that work to expunge criminal records aren't going to prevent someone from googling the person and finding their arrest records. \n\nHowever one is clearly far more serious than the other. Someone who is cancelled is not physically removed from society. They aren't imprisoned by the state. They may face some social consequences, but then again they may not. They can technically \"rehabilitate\" almost immediately, if they choose. Saying that we must treat both situations the same ignores that the consequences for \"cancel culture\" are far less severe than those for criminal charges, so it's not necessary for one to believe that these consequences should be alleviated if they aren't as severe in the first place. \n\nSaying that people \"cheer or celebrate\" cancel culture is also not inconsistent. These same people would presumably celebrate when a dangerous criminal is arrested and convicted.",
            "title_similarity": "0.6749665",
            "sentiment_compound": -0.9803
        },
        {
            "id": "h2kkfxh",
            "score": 2,
            "text": "I see this all the time, too.  My city has a huge homelessness problem and activists are very much on the side of \"everyone has a right to housig, no one should ever be evicted, etc\".  That sounds noble, of course, but then they will also call for someone accused of racism/sexism/xenophobia to lose their job and be kicked out of their apartment.  There seems to be a huge disconnect, like okay, now this potentially racist guy becomes homeless, and now it's unjust that he was fired and lost his home? You advocated for it!\n\n&#x200B;\n\nIt's just a case of \"an individual I don't like is bad and has no one but himself to blame, but a group of people are victims of society\".",
            "title_similarity": "0.7594379",
            "sentiment_compound": -0.9762
        },
        {
            "id": "h2kmu1u",
            "score": 2,
            "text": "They want to cancel you from you job and lifestyle because they don’t yet have the power to cancel you from life. But they do want that power.",
            "title_similarity": "0.76067686",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2kw92p",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2211799"
        },
        {
            "id": "h2k86av",
            "score": 12,
            "text": "> The first type is just cancelling someone from the platform where they committed egregious behavior on. If you act like a piece of shit at a bar, the bar can cancel you from stepping foot in their business in the future. If you are harassing people and being racist on Twitter, Twitter can ban you.\n\nWhat is the difference between this and \"accountability\"? Isn't that just holding people accountable for their actions? In what way is that \"cancelling\" them? \n\n>The second type of cancel culture is advocating for the person's cancellation outside of just the platform where they committed egregious behavior.\n\nSure. If I murder someone, that has nothing to do with my job. So should I be fired from my job for murdering someone? Because that would be unfairly cancelling me from my job when I did nothing at my job, specifically, to warrant being fired? \n\n\n>However, I am against the left's embrace of this second type of cancel culture because I find it very hypocritical.\n\nI personally don't understand how any of it is \"cancelling\" at all. Are you saying that people should not be held accountable for their actions, if their actions aren't part of whatever they're being held accountable TO? \n\n>I see this all the time where the same people that ridicule a white person for getting fired from their job or kicked out of college will go around saying that a black guy involved in gang violence should be offered rehabilitation.\n\nI think that is a gross oversimplification that doesn't actually happen in reality. Can you give me some citations?",
            "title_similarity": "0.98251784",
            "sentiment_compound": -0.9942
        },
        {
            "id": "h2jscvg",
            "score": 44,
            "text": ">How can you on the one hand laugh at someone for losing their job for saying something racist or insensitive online, then on the other hand advocate for a more rehabilitative justice system where even murderers should have a path towards redemption and a normal life?\r  \n\r\n\n\"Rehabilitative\" doesn't mean there's no punishment, it means the punishment is designed in such a way that the offender is psychologically guided towards improvement instead of being punished in such a way that they become worse off. People who are anti-prison are usually in favor of things like fines, community service, house arrest, etc. \n\nTo make it clear, \"rehabilitative justice\" is not anti-punishment, it is against punishment for the sake of punishment - that is to say, punishment done to hurt the offender, with no concern about whether or not it makes them less likely to reoffend.\n\nYou can say that cancel culture is also \"done to hurt the offender, with no concern about whether or not it makes them less likely to reoffend\". However, the difference (apart from how horrific prisons are) is that cancel culture is not an organized institution. It is a vague descriptor used for people responding to an event. This means that:\n\na) It has no functional power to directly punish a person, only to create a furor that a company can *choose* to act on. In many cases the \"cancelled\" person is simply quietly rehired when the noise dies down, because, again, \"cancel culture\" is not a legal body with any coercive powers.\n\nb) The fact that it has no power to directly punish a person means that it cannot change the nature of punishment to one that is harsher or gentler. The actual punishments are meted out by private companies trying to avoid controversy, they are not voted on by the \"cancelling public\" or anything of that nature.\n\nc) Therefore, \"cancel culture\" cannot propose a \"rehabilitative\" form of punishment because it's not actually proposing anything in the first place. It is simply saying \"this behavior is bad\", and any specific suggestions made by individuals are merely that - suggestions. \n\nWhen the US government sends someone to prison, it decides on the sentence and the method of punishment, and uses the threat of violence (or the actual thing) to enforce it. When cancel culture punishes someone, it is simply a mob of people saying \"this person should be punished somehow\" with no power to enforce what that punishment is, how it will take place, or what will happen afterwards.",
            "title_similarity": "0.78047657",
            "sentiment_compound": -0.9979
        },
        {
            "id": "h2jcn30",
            "score": 423,
            "text": "To make sure we're comparing apples to apples, let's compare the two processes. First, a rehabilitative justice system model:\n\n* A person commits a serious crime\n* That person is removed from society\n* A system of rehabilitation is applied\n* Finally, the person returns to society\n\nCompare that to the idea you're proposing. What are the comparable middle steps?\n\n* A person commits egregious behavior\n* ???\n* ???\n* The person is allowed to return to the platform\n\nDeplatforming/cancelling is step two. What rehabilitation system exists for people who commit egregious moral acts? In the absence of such a system, how actionable is your suggestion that the two ideas should be treated the same?",
            "title_similarity": "0.6337517",
            "sentiment_compound": 0.644
        },
        {
            "id": "h2kc6o5",
            "score": 11,
            "text": "It's not hypocritical (to advocate for cancel culture and for a rehabilitative justice system at the same time), because those two things are not direct opposites.  They're quite different societal \"features\", intended to do different things.\n\nA rehabilitative justice system is intended to mod people who misbehave into people who work okay with society.  It is a major part of a functioning society: it helps people to work within that society, rather than just punishing them for failing to mesh with the society.  One may argue whether rehabilitative justice *works*, and of course there are dangers of perverse incentives etc.  But that's what a rehabilitative justice system is for.  It's an engineered portion of a functioning society.\n\nCancel culture is a version of informal ostracism, a very old social technique to help enforce social norms.  In modern society, it is a form of semi-organized vigilante \"justice\" in which people have organized informally to *replace* the formal justice system (which is perceived to not be functional), with something that works marginally better than nothing at all.  Vigilante systems in general are what organized justice systems are put in place specifically to avoid.  Vigilante \"justice\" isn't really justice:  it involves swaying public opinion via hearsay, doesn't have any way for the accused person to face his/her accusers, is often arbitrary and/or disproportionately harsh, etc.  Vigilante systems tend to rise up semi-organically in the absence of a functioning real justice system.\n\nCancel culture is a response to the perception that there are social wrongs which are very hard - or even impossible -  to identify and correct within the existing justice system.  It exists precisely because there is no functioning rehabilitative justice system for certain types of misbehavior.   \n\nSo advocating for a rehabilitative justice system is advocating to improve, or in some cases invent, a working formal justice system that prevents vigilante \"justice\" groups from forming around certain abuses.  \n\nMeanwhile, advocating for cancel-culture solutions to those very same abuses recognizes that they are occurring and are a problem -- and that vigilante \"justice\" may be a better solution than no justice at all for those abuses.  In reality, vigilante systems suck.  People accused of bad behavior are often assumed guilty until proven innocent; they can't face their accusers; and they have no real pathway to exoneration or rehabilitation.  So vigilante actions tend to be more like witch hunts than like real trials.  But they do provide one major feature of a justice system: they deter people from the deprecated behaviors, by making examples of (at least some) people who (are perceived to) engage in them.\n\nIn your strawman examples, of course the college guy should be offered a formal tribunal and, if guilty, rehabilitation just like the gang member should.  But advocating for people to organize and to denounce abusers (in the absence of other effective means of controlling that behavior) is not strictly opposed to advocating for a justice system to include a rehabilitative element; and it is not inconsistent nor hypocritical to advocate for both of those things.",
            "title_similarity": "0.57743007",
            "sentiment_compound": 0.9867
        },
        {
            "id": "h2jy6ri",
            "score": 3,
            "text": "I think if you’re saying you agree that private company’s should be free to include or exclude who they feel like that’s fair enough. Equally though if a private organisation wants to give people you would see depalatformed /canceled a voice then they should be allowed to do that to. \n\nI don’t care if my views don’t align with others, it would be exceedingly boring and monotonous if we all thought the same. What I do care about is that it’s fair. You have to listen to everything and all sides and arguments if you ever want to learn something, or change someone’s view or debate them in any meaningful way. If you want to hear someone’s views (no matter how abhorrent they might be to you) then if a private company want to give those people a voice then they should be well within their rights to do so. \n\nThe opinion that liberal views are all 100% correct is ridiculous…the rights views aren’t 100% correct. No one is. Instead of everyone thinking what they are doing is “right and just” and trying to cancel someone who expressed a view you find horrible why not sit and talk. The deplatforming and cancelling is the media equivalent of a teenager going silent and giving you the cold shoulder…all that happens is these people find other platforms that will allow them to discuss their opinions and beliefs and if those are taken away they’ll go underground to air their views. \n\nI think it takes a whole lot of ego and pride to believe that you know exactly what is right in the world and should be given the power to silence others. No matter how awful their words are, they are just words. As long as they aren’t making real open threats and encouraging people to actually approach others in an aggressive way either physically or verbally everyone should have their time to speak. I also think it’s just insulting when people say “but others might be influenced by those beliefs” \n if that’s the case people shouldn’t really watch films about bad things or historical documentaries because we can go watch hitler give a speech online if you wanted and no ones trying to take that down, people are good and bad and will do good and bad things no matter what’s in the media. \n\nI’d rather live in a word where I can hear everyone’s view even if I hate it than one where someone is controlling what it is and isn’t alright to think and deciding for me who I should and shouldn’t get to listen to. \n\nPeople should have the power and if that means they want to listen to trump or Biden or sturgeon or Boris or Farrage then they should be allowed to. No matter the view, no matter how disgusting you think it is, would you want someone saying you couldn’t listen to or have access to the people you feel some relatability for? \n\nIt’s really insulting to assume as well that people need things restricted from them or they’ll turn abusive and horrible and bigoted. Do you think you’d be that swayed by something you see or hear in the media? Do you want an echo chamber?",
            "title_similarity": "0.6624947",
            "sentiment_compound": -0.968
        },
        {
            "id": "h2k3y0d",
            "score": 3,
            "text": "I want to start out by saying that I agree with you. Rehabilitation is the only way in my view, the only compassionate way, especially in a society designed so that certain people are more likely to fail. \n\nCancel culture in the latter sense you outlined I think is an extension of the mindset of punishment. People see someone being racist on the internet and want to punish them, as a reaction to all the pain they've felt or seen at the hands of other racist people. But this isn't how you change and heal a society.",
            "title_similarity": "0.8250958",
            "sentiment_compound": -0.8173
        },
        {
            "id": "h2k7lkr",
            "score": 3,
            "text": "But what's cancel culture's definition of egregious behavior? People who have different political, religious, or social beliefs? People's lives ruined for having a different opinion? That's just plain wrong.",
            "title_similarity": "0.7080109",
            "sentiment_compound": -0.907
        },
        {
            "id": "h2ku3k7",
            "score": 2,
            "text": "The justice system is a legal system. Justice has the force of law. Or, as proponents of rehabilitative justice see, the law does not give effect to justice insofar as it seeks to punish above all else. This coheres along racial lines. But the point is that it occurs in the confines of the legal system, according to certain principles and procedures prescribed by law. \n\nCancelling someone from their job etc is just leveraging a more nebulous, not-legal form of persuasion (or coercion). It does not derive its legitimacy from the law, but from more general social mores and cultural whims. \n\nThese are not the same system. Therefore there’s no reason they necessarily have to coincide in their effect. In fact, it would be terrifying if that were the case.",
            "title_similarity": "0.7452285",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2kvrti",
            "score": 2,
            "text": "Another point to your argument:\n\nIf you are for unions and otherwise increasing the workers' power, why would you want a corporation to have power over their workers choices outside of the workplace?",
            "title_similarity": "0.56963694",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2l3lue",
            "score": 1,
            "text": "I think a big part of the difference is whether the person is actually sorry/changed or not.",
            "title_similarity": "0.4758978",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2l82te",
            "score": 1,
            "text": "What is cancel culture besides paying for your actions? Cause and effect?",
            "title_similarity": "0.6101571",
            "sentiment_compound": -0.3313
        },
        {
            "id": "h2l9ahj",
            "score": 1,
            "text": "You will likely read here that these are two different situations (privileged vs opressed) and cannot be compared. This is not entirely true, the difference is not factual (a public lynch is an extreme form of oppression). These situations are treated differently because the public is biased, because the Left itself is biased. It is not even the hypocrisy. It's an integral part of this political view, declared by the founders (Marcuse 1965).",
            "title_similarity": "0.76827466",
            "sentiment_compound": -0.4308
        },
        {
            "id": "h2lbczl",
            "score": 1,
            "text": "I find r/ByeByeJob pretty gross, especially how hard people revel in it.\n\nAnyone ever consider the impact it may have on that person's family if they lose their job? Probably not because the people that push for it are all detached keyboard warriors that treat it like a game and immediately forget about things after they're out of focus.",
            "title_similarity": "0.7418376",
            "sentiment_compound": -0.1226
        },
        {
            "id": "h2lcbc4",
            "score": 1,
            "text": "I believe in a path to rehabilitation, but nobody on the left is saying that a murderer shouldn't do time in jail... so, yes. You say some heinous shit, you get put on a social time out and when you've spent some time making the necessary changes in behavior that are required to be accepted by the general public, welcome back! But the same way we don't just let a murderer tell us when they've been rehabilitated, I don't believe a lot of the Hollywood assholes who got away with being disgusting people for so long and then just turn around to say \"Ooops.\"\n\nI'm sure that a fair number of people actually are sorry by the time they got caught, but again, using your analogy with law and order systems, you did a social crime for which you hadn't paid and when you're caught, then you gotta take your lumps!\n\nBut I do think that comparing it to Legal Justice is apt... because there are so many nuances involved with both. We are socially evolving as a species... so the same way crimes against weed aren't prosecuted like they were a decade or two ago, I think that it's fair to consider the time and place in which the cancelation offense occurred, and whether or not it was an isolated incident or ongoing, etc.",
            "title_similarity": "0.79522",
            "sentiment_compound": -0.957
        },
        {
            "id": "h2ld9td",
            "score": 2,
            "text": "\"Cancel culture\" has existed for a long time. After all, the Tulsa race riots of 1921 are rarely included in the sanitized version of U.S. history taught in most high schools.",
            "title_similarity": "0.45451674",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h2ldoq2",
            "score": 1,
            "text": "I’ve seen people lose their jobs but I’ve never ever heard of someone getting booted from college or their apt because of “canceling” no college or land lord could kick you out for being super unpopular. If you’re kicked out of college it’s with grounds. You had to have done something to get kicked out, it might also be the thing that got you cancelled but that’s not the same as being kicked out because of public pressure. And a land lord could evict you but also has to have grounds to do so like not paying rent or having a meth lab. And even then it’s gotta be a poorly made one. But even if you pay a little of ur rent that makes it even harder and a longer process to evict someone. Even if you have some anecdotal evidence of these things there is no doubt a credible reason buried beneath the hype of cancellation. You don’t wanna get cancelled? Don’t have a Twitter account or if it’s part of your job then don’t post ur opinions there. No one needs to know anyways.",
            "title_similarity": "0.7659097",
            "sentiment_compound": -0.1213
        },
        {
            "id": "h2lehc5",
            "score": 1,
            "text": "While I agree with you politically and somewhat on the surface, I personally would not want some extremist working for me. Nor would I want to patronise their business.\n\nPeople with extreme views make other uncomfortable. I can't imagine how they alienate my customers, make coworkers uncomfortable, waste my time/money/etc. \n\nThere are correctable behaviours, but these aren't correctable. You have to cut ties. I mean, I'd like to rehabilitate all of those serial killers, but I know I have to \"cancel\" them to jail. \n\nYou still believe these people can be rehabilitated. I don't. And unless we extinguish their behaviour and make consequences both real and significant, they lack the incentive to change.",
            "title_similarity": "0.8322016",
            "sentiment_compound": -0.8527
        },
        {
            "id": "h2lfl61",
            "score": 1,
            "text": "Remove people from society that cause societal ailments. \n\nTreat said people, when they recover, they are released back into circulation.  Toxic people create toxic environments.  The removal of an individual can create a manifold effect on everyone who has to deal with said toxic person. The effect of a bad employee (for example) can hamper the abilities of your most capable producers.",
            "title_similarity": "0.7659343",
            "sentiment_compound": 0.7425
        },
        {
            "id": "h2lgzv2",
            "score": 1,
            "text": "Are you American?",
            "title_similarity": "0.058736965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2lh2br",
            "score": 1,
            "text": "Facing consequences / repercussions for your actions is not being cancelled. Grow the fuck up.",
            "title_similarity": "0.3891123",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h2limfi",
            "score": 1,
            "text": "I would love to see the world open up to the idea of rehabilitation for everyone. Sometimes I think we are still stuck in the middle ages.\nWe still see good people or bad people, criminals or victims.\nI feel people are driven by spite more than anything.\nAll this has lead to is a bigger chasm between people, why can't we let people make mistakes and rehabilitate? If someone says something racist then mends their ways they should be applauded not criticised.",
            "title_similarity": "0.7194128",
            "sentiment_compound": -0.858
        },
        {
            "id": "h2lizsk",
            "score": 1,
            "text": "The first thing you'll need to understand is that cancel culture isnt really a thing any more than say video games causing kids to be violent. Meaning when you frame cancel culture as consequences for shitty behaviour it rings more truthfully than this great political orchestration. The common denominator for any of the truly honest uses of cancel culture is behaviour for egregious social prejudice. Most any other uses are inherently see through as petty like say most buyer beware posts on facebook yard sale. These demonstrations of cancel culture are generally recent acts and given the currency of the act alone makes it early to have a discussion on whether they are redeemable or not. So the question in that time isnt should they be punished or should they be rehabilitated and more a question of how much of an impact does this person have on the situation, on others, and how much of an impact can this person have if his or her behaviour goes unchallenged. This will give you some conclusions that are most likely skewed by emotions and most everyone else witnessing it will also be in that state. You could probably say that the chosen judgement would be arbitrary and I would probably agree with you that you are right. But your question is wrong my friend. You should be asking what is the correct punishment for being a scumbag? Because deep down my man you dont like Karen's or Kyle's and more than we do. So let's try and figure out how we can properly straighten out these douchebags and then well talk about whether they are rehabilitatable.",
            "title_similarity": "0.75323784",
            "sentiment_compound": -0.9263
        },
        {
            "id": "h2lj6ce",
            "score": 2,
            "text": "The biggest problem here is cancel culture is a partisan term used by Republicans who are trying to lash out at their critics.  However as it's become more broadly labeled its about consequences, and that actions have them.  One of the sad things about Fox News is how much misleading, intentionally false, or flame fanning is done with no consequences.  Fighting for people to be held accountable for their actions is something we as society learn in kindergarten yet we find ourself surrounded by overpaid, undereducated personalities who have the ability with their action to cause harm to society.  This has to stop and it begins with consequences.\n\nRehabilitative justice however I feel you have the wrong view on.  This is for people who have 1. Done something of criminal nature which in turn they were caught, tried, and convicted. 2. Seeks to match the type of crime with a punishment that actually fits the crime, profile, and aims to bring the person back into society with a new outlook that doesn't just deter relapse, but actively sets people up to succeed as opposed to release back into an environment suited to relapse.\n\nIt's a shame your examples are so focused on things such as Twitter or whatnot seeing as they are a  microcosm of consequence culture.  When someone does something abhorrent, or in many current cases dangerous it's necessary to remove seeing as how reform isn't possible in a non-guaranteed way.  Twitter, Facebook, etc can't lock your computer until you pass a civics test where as the government can take a driver's license away for speeding type of comparison.  They do what they can because it's all they have the power to do.\n\nTo touch on your \"white people should get equal treatment of others with reformation justice\" I'll just say where have you been?  White people have historically been treated VERY well by the justice system, and if you need actual comparisons I'm sure posters can provide however hopefully you won't be so dense.  The common retort to an example of white people getting easier sentences is people finding an example of something a minority did asking \"why the leniency \" yet specific examples are a shallow argument in comparison to cold hard statistics so go read those instead of specific cases (which I can find one for almost anything). The saddest part is most examples people give of minorities being given leniency is because of things like proof of exoneration, lack of evidence, or other ridiculous attempts to make charges stick.",
            "title_similarity": "0.72670454",
            "sentiment_compound": -0.6663
        },
        {
            "id": "h2llhkl",
            "score": 1,
            "text": "Most of the time people aren't cancelled when they have properly apologized or otherwise 'paid' for their trangressions",
            "title_similarity": "0.4875072",
            "sentiment_compound": 0.466
        },
        {
            "id": "h2llunx",
            "score": 1,
            "text": "Counter argument: Most people aren’t **really** for rehabilitation. It just sounds good and makes them feel better about themselves, especially when the offender is physically located nowhere near them.",
            "title_similarity": "0.52983516",
            "sentiment_compound": 0.1372
        },
        {
            "id": "h2lmv41",
            "score": 2,
            "text": "Christianity suggests canceling anyone who does not agree with your religious beliefs UNTIL they conform\nSo... canceling someone until they change was their idea anyways...",
            "title_similarity": "0.6600612",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h2ln1vq",
            "score": 1,
            "text": "if you won't forgive someone, there is no reason for them to change, since changing nets them nothing. \n\nhow far does cancel culture really go? a prominent person, like aziz ansari, getting canceled because of a controversial story about his personal life. \n\nso he's not allowed on tv anymore? but they also threw a fit when he was performing small time stand up. so what's the limit? where does penance lay? should he be forced into a non managerial position at a minimum wage job? what does that logic reveal about how the cancelers feel about people in menial labor?",
            "title_similarity": "0.8231143",
            "sentiment_compound": -0.474
        },
        {
            "id": "h2lnlyb",
            "score": 1,
            "text": "You seem to be confusing legal consequences and social consequences",
            "title_similarity": "0.5049323",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2lnvlu",
            "score": 1,
            "text": "It’s really clear that very few in this thread have the intellectual honesty to address the point of your post and instead prefer to present the ‘reasons’ that focusing on pursuit of boundless punishment for people who hold different views, particularly if they’re white, is totally different than the eagerness to punish individuals for crime. \n\nThrough the art of distraction they present these things as dissimilar, citing weak and unimportant arguments about structure and entities and asymmetric authority...which are all just canards dodging the moral question which is, “If you believe in the compassionate helping of others to see their error, and not in the effectiveness of punishment, then this must be universally applied or it is falsely held.”",
            "title_similarity": "0.7306477",
            "sentiment_compound": -0.8558
        },
        {
            "id": "h2lp708",
            "score": 1,
            "text": "I’d like to take this two parts:  First is your adoption of cancel culture put forth mostly by white people, mostly older.  A lot of us find this ridiculous.  For one, wait till you hear about how whites canceled non whites leading up to their pity party of facing pretty tame consequences for their horrendous actions. For another, this version of cancel culture is merely capitalism as it was intended function.  People don’t like how you’re behaving in a money making capacity?  Well you’re about to find out how strong the arm of the market is as it solves you out the door.  Welcome to life as a minority orchestrated by you.\n\nThe next is the somewhat insane equating losing freedom to losing monetary status.  You might see why a lot of us don’t even engage in good faith when we hear arguments like this because it’s like talking to a fucking toddler.",
            "title_similarity": "0.7694857",
            "sentiment_compound": 0.9411
        },
        {
            "id": "h2lpeql",
            "score": 1,
            "text": "Being an advocate for rehabilitation does not mean being against the idea of punishment.\n\nYou can do both.  You kind of need both.\n\nAs for people losing their job, you have to realize that random people are not getting that person fired.  That is exclusively the decision of their company.  That isn't \"cancel culture\", that's \"I don't want to lose business because my employee is a psycho\".\n\nIf I was to show up to a job, kick the head engineer in the balls and spit on the GC, I'm pretty sure I wouldn't have a job anymore.  If I started catcalling office workers, I know for a fact I would not longer be employed at my company the moment any of them called the president of my company.\n\nThey didn't cancel me.  The people employing me canceled me.\n\nI point this out because you seem to think there's two kinds of being canceled.  It's the same thing.  If I get pissed because some piece of crap restaurant employee won't serve a gay couple, and I help make that fact more visible in the online space, then sure, I'm part of it.  But ultimately it's the restaurant that decides.  Not me, not you, not anyone else.\n\nIn the case of small business, hey, if they make themselves into people no one wants to give money to, then that's their fault.  They didn't get canceled.  People went \"I don't want you to receive any of my money, because you suck.\"\n\nCancel culture in general really doesn't exist the way people think it does.  If people don't support someone or some business because of false information, then that's a problem with someone making stuff up, but that's been happening since... well, forever.",
            "title_similarity": "0.7679033",
            "sentiment_compound": -0.9639
        },
        {
            "id": "h2lrc30",
            "score": 2,
            "text": "If you want rehabilitation in prisons, how can you possibly not want neo-nazis on twitter\n\nwhat a logical pain train this is",
            "title_similarity": "0.70083356",
            "sentiment_compound": -0.4976
        },
        {
            "id": "h2lrcs7",
            "score": 1,
            "text": "I'm a free speech absolutist, so for me even 1st form of cancel culture is wrong",
            "title_similarity": "0.57995415",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2lshs2",
            "score": 1,
            "text": "What the shit is cancel culture anyways.  Any one I see who is “cancelled” are usually racists or sex offenders.  Tell me one person who was “cancelled”.  If their fans don’t like them anymore they don’t like them, if they say something shitty on a platform that wont allow it they are idiots.",
            "title_similarity": "0.81867516",
            "sentiment_compound": -0.7065
        },
        {
            "id": "h2lu06f",
            "score": 1,
            "text": "I don't understand why these things are mutually exclusive. Even in a rehabilitative justice system the person who commits the act is removed from society and then has to prove that have been rehabilitated enough to be released back into general society. With the consequences of having been jailed as the result of their actions. \n\nWhen it comes to cancelling, you are removed from society, losing your job or being deplatformed and then if you want to return you have to prove some sort of rehabilitation or change in outlook.  They seem like basically the same thing to me and in no way mutually exclusive. \n\nBy the way this idea that cancel culture is a new thing is hilarious. This has been around since human kind has been a thing. You hear plenty of stories of people being exiled, shunned, ostracized etc. throughout history. This is just the modern internet version of what used to be done. That also includes literally branding people.",
            "title_similarity": "0.7920027",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2lw1li",
            "score": 1,
            "text": "I kind of agree with this only insofar in that racism can sometimes be the consequence of the kinds of economic oppression some white people experience. I’m sure growing up in incredible hardship doesn’t exactly lend itself to open-mindedness. Other than that, one is usually a consequence of privilege and the other oppression. While I get that at some level people can’t help their upbringing so it’s the same on that level, it’s not really reasonable to say taking advantage of your fellow human beings because of your **advantage** in society should be treated with the same level of sympathy as taking advantage of people because of your **disadvantage** in society",
            "title_similarity": "0.69951046",
            "sentiment_compound": 0.7517
        },
        {
            "id": "h2lw515",
            "score": 1,
            "text": "Can you point at an example of anyone doing both of these things?\n\n\"Hypocritical\" means that one person is doing two things that contradict each other. It doesn't just mean that two different people you dislike are doing two different things that contradict each other.\n\nLike, if a preacher is preaching monogamy while cheating on his wife, that's hypocritical.\n\nBut if you can point to *one* preacher who's preaching monogamy, and a *different* preacher who's cheating on his wife, that doesn't make the first preacher a hypocrite.",
            "title_similarity": "0.6764819",
            "sentiment_compound": -0.9109
        },
        {
            "id": "h2lw6xz",
            "score": 1,
            "text": "this is very simple.  \n\n\na rehabilitative system still takes you out of an aggravating situation.  if you're problematic, the idea would be to put you in a special place where you can get the mental health help you need, and the personal coaching required before reintegrating you into society.  \n\n\ncancel culture isn't a call to ruin someone forever without question.  it's society saying, \"maybe what you did isn't necessarily illegal, or maybe it is but you won't see trial because it isn't about proof, necessarily... but this is Social justice and so you need to take time OUT of our system while you work on yourself.  work on your mental health, get the assistance you need and the personal coaching required for you to understand what led to your toxic behaviour and how that can be remedied before re-entering society.  \n\n\nthese two ideas are actually VERY much related, but your understanding of them, of their goals, is flawed, and this is why you see them as being hypocritical of each other.",
            "title_similarity": "0.6085898",
            "sentiment_compound": -0.6529
        },
        {
            "id": "h2lwgva",
            "score": 1,
            "text": "It's because people who commit crimes are usually victims of circumstance. People who are cancelled for racism/sexism/ect are usually willfully ignorant and outright refuse to learn.",
            "title_similarity": "0.7293513",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h2lxllh",
            "score": 1,
            "text": "I feel like if someone did something so bad that they can legally be fired, evicted, or kicked out of college, for that action alone then they probably did something bad enough that they need an awakening to start the rehabilitation process.  If you commit a crime, I think that most rehabilitators would say that you may need to be removed until you are rehabilitated if you are a threat to others or have not stopped the negative behavior.  Rehabilitation doesn't mean freedom from consequences it means getting another chance and a chance to grow, it doesn't mean you need that chance at this very moment to be let back into society.  Of course laws are different depending on where you live and a lot of this is opened to interpretation.  I doubt anyone is saying that people involved in gang violence should have no consequences and be free immediately after they are charged.  Its that they should have a path to redemption, not that they should be assumed to be redeemed.",
            "title_similarity": "0.804512",
            "sentiment_compound": -0.9441
        },
        {
            "id": "h2lxz3v",
            "score": 1,
            "text": "I’d like to point out that the term “cancel culture@ was coined by the right as a dog whistle to excuse behavior that impacts conservative politicians more frequently than it does liberal politicians. Conservative voters are more likely to hold racist beliefs and act out with said racist and therefore embrace this term.\n\nSo while I agree that workers should not always be fired for their job I don’t think this is actually a punishment that the left embraces. And I think the frequency of it has been inflated for political purposes in order to distract from the conversation about inequality that the right does not want to have.\n\nNow that that’s out of the way, I agree that lives should not be destroyed but I also think there needs to be some negative reinforcement first before the rehabilitation phase. Otherwise people may continue the same behavior. As far as jobs go, some jobs do have a public image component to them. Entertainers, politicians, teachers, CEOs, etc are very public jobs that for better or worse people look up to. Therefore it is expected that integrity must exist for people in those job types. I think a temporary “cancellation” is appropriate.\n\nThe bigger issue however, is what happens to people without jobs in the US. People without jobs should still be entitled to food, health, eater, shelter, justice, and the freedom to pursue new ways to contribute to society. I think we should first focus on that problem and the inequality in our society before focusing on what consequences someone should get for tweeting something offensive.",
            "title_similarity": "0.7281499",
            "sentiment_compound": 0.7349
        },
        {
            "id": "h2lz524",
            "score": 1,
            "text": "It’s funny that the right blames the left but I’ve seen quite the opposite, just ask Kapernick, the Dixie Chicks, Kanye and many others when they spoke against Bush.",
            "title_similarity": "0.7349721",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2m1hb4",
            "score": 1,
            "text": "Consequences for violating the rules of a social  platform isn't cancel.culture, it is just the punishment for.xontract violations. To call it anything else is just disingenuous and intentionally obsfucatory.",
            "title_similarity": "0.7307872",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h2m1p4g",
            "score": 1,
            "text": "Agreed OP. \n\nSeems people responding can't seem to understand the underlying issue you're making.",
            "title_similarity": "0.50080365",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2m2v4d",
            "score": 1,
            "text": "I think you’re confusing two separarte mechanisms here, assuming they are one and the same. I also think you’re assuming the worst intentions of people who are for “cancel culture” without really thinking about what it actually is.\n\nFirst, let’s separate what “cancel culture” is and what a rehabilitative justice system is.\n\nA justice system seeks reparations for **legal** infractions. We have a society with a system of laws. If you break them, you are processed through the legal system in some way. Sometimes, it means a black dude who owned a dime of weed back in the 80s has gotten decades of prison time, and other times it means a prominent white swimmer by the name of Brock Turner barely serves time in jail for actually being caught in the act of raping somebody. We have a justice system that plays favorites and seeks primarily to punish people *instead of figuring out what went wrong to push the person to crime in the first place, and giving them the tools to reintegrate into society.*\n\nBut, again, these are all **legal** issues. Is owning a dime of weed morally reprehensible? Do you personally want to be around somebody you *know* has issues stealing and murdering, and rehabilitation hasn’t worked on him? The justice system is only concerned with 2 things: trying to be impartial, and upholding the laws by which out society functions.\n\nBut what happens when somebody doesn’t technically do anything illegal, but they act out in morally reprehensible ways? You have a nazi working somewhere. You have a man who speaks in racial slurs and breathes in misogyny. Are people themselves free to make a choice about how to associate themselves? Aren’t people free to make their opinions heard about what standards the world around them chooses to uphold? Would you personally walk into a store that you *know* discriminated against your partner because of their gender, sex, religion, race, or other protected class?\n\nNow, let’s take a step back. A store you work for employs a known nazi. Everybody in the town knows about it. You *know* this nazi makes life miserable for everybody, and you don’t want to associate with him. The owner of the store themselves knows all of this. This nazi has been the talk of the town since he got there.\n\nWhat do think the owner should do in that situation? Do you think the people in the town going to want to shop at a town where a known nazi is unashamedly employed? The owner *knows* what a piece of shit the guy is. How long do you think the store lasts?\n\nThe justice system you labeled a “justice system” is a method to remove somebody from society who broke a legal mandate. The idea is that somebody who breaks the law faces consequences. \n\nWhat kind of “justice system” do you think should exist for somebody who repeatedly breaks **social** norms? What kind of rehabilitation exists for somebody who legally follows every letter of the law, but they’re just an insufferable douchebag everywhere they go? Would you be okay if twitter didn’t take down people known to harass others on their platform? In a world where money lets the rich sidestep a lot of legal issues that poor people wound go through, how do you feel essentially removing social consequences from the equation.\n\nTo finish up, way is happening here is that you’ve unknowingly accepted conservative propaganda regarding “cancel culture”. They’ve made a lot of noise about it, and it has, unfortunately, muddied the waters regarding what it all is.\n\nTo put it simply **”cancel culture” is nothing more than a pejorative term that was invented to make fun of people who believe there should be social consequences for your actions.**\n\nLaws and regulations are not measures of morality. There are things I would never toss somebody in jail for that I still would judge them harshly for, and there are things I wouldn’t judge a person for that I believe still meantime deserve some time in jail.\n\nHow those two systems interact is something that is constantly evolving.\n\nAnd, just like literally all of humanity, there are *some* people who believe in extremes and actually.\n\nCancel culture is a loose, social form of justice. It is nothing more than people getting together saying “we refuse to associate with people who have broken social norms, and we will not associate with you of you choose to support them.”\n\nHow else do you expect assholes be reformed if they never do anything technically illegal, but their allowed to be the biggest fucking asshole the works has never seen and nobody will fire them, people have to continue to associate them, and they get to face 0 social consequences on top of the lack of legal consequences.",
            "title_similarity": "0.7127254",
            "sentiment_compound": -0.9797
        },
        {
            "id": "h2m3bxm",
            "score": 1,
            "text": "Can you give me an example of someone that cancel culture was too hard on?",
            "title_similarity": "0.6595887",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2m3j8n",
            "score": 1,
            "text": "Not sure why cancel culture is a term that people decided to use..... Did Firefly get canceled for any good reason? Nope. Did Bill Cosby get canceled for good reasons? Yes. Is it a culture? What? Nazi's got killed in droves for good reason but they didn't really get erased from history they just became the bad guys in movies, TV, video games. USSR didn't kill anyone I know and no one I heard of ever fought them for all that Cold War drama plus USSR really kicked more Nazi ass then America ever did or had to suffer through. Give Israel enough time and they could actually be seen as the bad guys for how they want to genocide their Arab neighbors. Why do bad people think that people should be forced to listen to their bullshit like the anti vaxxers or the Trump cult? Are there any doomsday cults that are allowed to post on social media about giving their church all your money then drinking the Kool-Aid? Was the Tulsa Race massacre in 1921 just cancel culture? WTF is wrong with people? Hell no bad evil people doing bad evil shit and being shunned, imprisoned, prosecuted etc is not just cancel culture or just social justice it is what is right, its good, its decent. Since Trump was taken off Twitter the world has become a better place already. He spit poison and lies and he should have been impeached, Congress needs to investigate for years and drag them all out. Ted Cruz should even be in prison etc..... That's not cancel culture..... This is necessary for the sake of humanity...... Folks like that have no humanity.....",
            "title_similarity": "0.7070005",
            "sentiment_compound": -0.9977
        },
        {
            "id": "h2m4q5s",
            "score": 1,
            "text": "“Cancel Culture” doesn’t exist. It’s just people being held accountable for their shitty actions. The only credible examples of people being “cancelled” is when people go through celebrities’ social media posts from when they were like 14 and trying to go after them when we’ve all done stupid shit as a kid. Otherwise, if someone does or says something super shitty and people/companies choose not to support them any longer, that’s not being “cancelled”. It’s being an adult and having consequences for your actions.",
            "title_similarity": "0.8205475",
            "sentiment_compound": -0.8767
        },
        {
            "id": "h2m4q8o",
            "score": 1,
            "text": "No one is denying “restorative justice” to celebrities or anyone else who loses their job for being racist or offensive. Any celebrity who makes a genuine effort to understand and have real empathy for the people who were offended is usually forgiven. In some cases they were never relevant enough to merit a second chance, but that is just a function of their value as an entertainer rather than a “punishment”.",
            "title_similarity": "0.6761215",
            "sentiment_compound": 0.4118
        },
        {
            "id": "h2m56pi",
            "score": 1,
            "text": "Cancel culture is just another term that self proclaimed pretending to be victims want to use to justify their bullshit.",
            "title_similarity": "0.70673704",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h2m6zdg",
            "score": 1,
            "text": ">To be clear, I would consider myself on the left politically\n\nMhmm, interesting. Do tell more.",
            "title_similarity": "0.45728162",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2m7qll",
            "score": 1,
            "text": "No matter which side anyone is on, we need to understand that no one is born perfect. We have done a fair share of things we regret, because this is just who we are as humans. The same ones advocating for this are the same ones who have skeletons in their closet where they too would be cancelled, if people found out. It’s a vicious and dangerous cycle that will backfire.",
            "title_similarity": "0.7346517",
            "sentiment_compound": -0.5383
        },
        {
            "id": "h2m7ve4",
            "score": 1,
            "text": "Tell me you’re privileged without telling me you’re privileged\n\n“People reacting negatively to me is the same as jail guys!!!”",
            "title_similarity": "0.64754844",
            "sentiment_compound": 0.7701
        },
        {
            "id": "h2m9wul",
            "score": 1,
            "text": "I’ve never seen an more egregious false equivalency on this website.",
            "title_similarity": "0.46662468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2m9zx0",
            "score": 1,
            "text": "I don't see how that is hypocritical.\n\nA rehabilitative justice system doesn't rule out punishment at all.\nIt doesn't mean that you can't get punished hard as well. Rehabilitation is about the aftermath of your punishment.\n\nMany racists won't be bothered too much if they can't visit a place anymore but losing their job will be something to remember.\nAnd often losing their job over racism is also a logical move: you are unfit to work in some jobs when you are racist: nurse, soldier, police officer and anything with customer contact of different races.",
            "title_similarity": "0.7437573",
            "sentiment_compound": -0.9605
        },
        {
            "id": "h2ma3j2",
            "score": 1,
            "text": "As far as losing jobs, there’s something you need to remember. If you are identified as an employee of a business, you represent that business. If you then say or do something to cast that business in a bad light, they need to respond. Part of that response can and does include removing the person who injured the business. Deplatforming them, in other words. This has been true for decades, including such notable events as the Red Scare and gay activism.",
            "title_similarity": "0.76020795",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h2ma67l",
            "score": 1,
            "text": "Would you, personally, feel comfortable continuing to contract the services of a person who had so diametrically opposed views that you would not call them a friend? Remember as an employer you are now financing their political views. Would you be okay with financing the views of someone that fundamentally doesn't believe in democracy and equality? Would you be okay financing someone who believes in Critical Race Theory?\n\nAs an entrepreneur I can honestly say that I would have reservations about certain schools of thought, and if I want someone who espouses that school to work for me.",
            "title_similarity": "0.6710763",
            "sentiment_compound": 0.9176
        },
        {
            "id": "h2maec8",
            "score": 1,
            "text": "I dunno, I don't find it hypocritical to want to cancel a known Nazi, but want to rehabilitate someone who used to deal drugs. I always believe the two can co-exist when circumstance is involved.",
            "title_similarity": "0.6297859",
            "sentiment_compound": 0.212
        },
        {
            "id": "h2mafuk",
            "score": 1,
            "text": "I'm a public defender and 100 percent agree with this",
            "title_similarity": "0.11374709",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2mao4n",
            "score": 1,
            "text": "Having to come to terms with the screwup that got you fired and find a new job where you start over fresh sure sounds rehabilitative to me.",
            "title_similarity": "0.55686635",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2mdcdj",
            "score": 1,
            "text": "Black History is the biggest Cancellation of a Culture in Our History.",
            "title_similarity": "0.46830773",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2mhq90",
            "score": 1,
            "text": "Consider the case of Poetry magazine where it came under fire for [publishing poetry from a convicted child pornographer](https://slate.com/culture/2021/02/poetry-magazine-prison-incarcerated-writers-kirk-nesset-child-pornography.html). The magazine got criticized by many people including ones who'd go on about rehabilitation.\n\nThere's no hypocrisy here as far as I can tell it's simply dissonance, tell people about rehabilitative justice in the abstract and they'll be all for it, tell people you're for rehabilitative justice for John Doe who murdered Liam Smith and watch as all of a sudden John Doe is actually some incredible exception \n\nEveryone is for rehabilitation for the faceless masses they've never heard of who's crimes are on a balance sheet, put human faces on it and all of a sudden people are for punitive justice",
            "title_similarity": "0.76016164",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2mj54o",
            "score": 1,
            "text": "It's a war between unproductive people vs  productive people. Some guy in a Starbucks on his $2200 Macbook canceling someone he hates for being a Capitalist. Apple is obnoxiously Capitalistic. Why do they make sure you're forced to buy a new Computer every 6 years? The whole world could be saved if we stopped the Consumption Culture from Apple, but it's the most woke LGBTQ friendly company. Facebook Servers and the impact to the environment.. All social media has a major environmental impact because of the Data Centers  and electricity needed to run them, but yet they're the ones preaching the average person is responsible for global warming. I work in Data Centers, you won't understand it until you see a big one. So woke. If people were really woke they would advocate getting off all social media because of the environmental impact from the Data Centers.",
            "title_similarity": "0.67004037",
            "sentiment_compound": 0.6243
        },
        {
            "id": "h2mklwb",
            "score": 1,
            "text": "Whatever happened to \"I might find what you say abhorrent but I will defend your right to say it\" \n\nCancel culture is the most extreme form of censorship and a chilling effect on free speech.",
            "title_similarity": "0.7729027",
            "sentiment_compound": 0.0644
        },
        {
            "id": "h2mle62",
            "score": 1,
            "text": "I see a lot of people commenting on this, and I have to say that cancel culture is both stupid and often unnecessary. Yeah, a business can fire employees and ban customers if they’re found to be racist/sexist assholes and it’s all public knowledge. That can hurt a business in a lot of cases. But don’t go out and ruin the person’s life, instead try and get them the help they really need. They may have been raised in a toxic environment, or maybe they even have mental issues. But it sounds like these kinds of people aren’t caring about the actual person, they’re only focusing on their crimes. It sounds a lot like the game Persona 5, and is an actual problem in a lot of countries. \n\nIf we want to get better, we need to advocate for rehabilitation for all. So long as the person is open enough to receive help, then we should keep pushing and help them get better lives so these crimes can stop.",
            "title_similarity": "0.8738555",
            "sentiment_compound": 0.9109
        },
        {
            "id": "h2mlrhd",
            "score": 1,
            "text": "There is a difference between social and legal consequence. Arguing the two should be handled similarly is narrow sighted at best.\n\n'Cancel Culture' is not only not new but it is one of the fundamental modes of social change and has been throughout all of history. It is the idea that when someone says something you find morally corrupt, you stop supporting them. From a 'Karen' yelling at a barista to a neonazi... being a neonazi, being seen doing/being these things has consequences. Social ramifications that one could not reasonably argue are unfair, since the whole point is that it's merely conflicting moral viewpoints butting heads.\n\nRehabilitative justice systems on the other hand are the idea that justice should be reformative instead of purely punitive. This DOES NOT MEAN free from consequence. I do believe a full on rapist can turn their life around but that doesn't negate the damage they have done and it certainly doesn't guarantee them forgiveness from the effected parties nor should it necessarily guarantee them freedom from further social consequence. Eg. Reformed child rapist? Maybe shouldn't be allowed to be a teacher. Reformed murderer? Maybe don't become a cop. Reformed Fraud? No an accountancy accreditation wouldn't be appropriate. Etc. Reformation is about giving people a second chance and humanity back, it isn't about giving them free reign.",
            "title_similarity": "0.8046043",
            "sentiment_compound": -0.8304
        },
        {
            "id": "h2mnzyb",
            "score": 1,
            "text": "Well, I think that both are not automatically antithetical:\n\nRehabilitative justice focus on making sure that people can reintegrate correctly in society once they paid the price of their immoral acts, generally through going to jail.\n\nThe 2nd form of cancel culture you define is about making people pay a harsh price for their immoral acts/words.\n\n**TL;DR;** you could logically argue that being canceled is Step 1 (punishment) while rehabilitation is step 2, once your paid. Without punishment, offenders can't understand that they acted wrongly and desire rehabilitation.",
            "title_similarity": "0.74324393",
            "sentiment_compound": -0.3944
        },
        {
            "id": "h2mpwjw",
            "score": 1,
            "text": "You seem to think that 'cancel culture' is a real thing, when really is just a blanket term for varying types of behavior than generally just describe something that's always been around under various guides and is general rather natural. Someone acts like a piece of shit, and you'd rather not interact with them.  The only real difference is that with media and the internet, that plays out differently than it used to. It used to mean something approximating 'shunning' in social groups, now that people are trying to make a living 'being popular', being shunned by a group of people who make up the platform you are trying to use for a living, the repurcussions are larger. Not saying it's good, or that people aren't overly sensitive, but it's not really a 'culture' kind of thing, it's just normal human behavior that impacts differently.",
            "title_similarity": "0.7476428",
            "sentiment_compound": 0.102
        },
        {
            "id": "h2n0cee",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2211799"
        },
        {
            "id": "h2n1346",
            "score": 1,
            "text": "Hey, if racist shitbags on Twitter apologise and agree to put themselves in confined racism rehab I will welcome them back to polite society with a hug and a welcome aboard sonny jim.  \n\n\nBut until they do, they should pay a social price for their racism.",
            "title_similarity": "0.7829148",
            "sentiment_compound": -0.6858
        },
        {
            "id": "h2n50rm",
            "score": 1,
            "text": "You can believe in cancel culture because the existing justice system, due to its “ideal” standard of evidence fails to procecute certain types of crime like sexual assault. So one has to go outside of the legal system to achieve justice.",
            "title_similarity": "0.7356273",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2n9v2l",
            "score": 1,
            "text": "Firstly, the responsibility for the loss of job, scholarship, eviction etc lies entirely with the person committing the egregious behavior and no one else.  Lamar Burton got it right;  it isn’t about canceling but consequences for behaviors seen as undesirable by the group.  “Consequences are finally encompassing everybody in the society, whereas they haven’t been ever in this country.”  It harkens back to one of the earliest forms of punishment: shunning and shaming. \n\nSecondly,  Restorative justice views crime as more than breaking the law – it also causes harm to people, relationships, and the community. So a just response must address those harms as well as the wrongdoing. (restorativejustice.org).  Consequences are part of the rehabilitative process.",
            "title_similarity": "0.7123593",
            "sentiment_compound": -0.967
        },
        {
            "id": "h2nrv6c",
            "score": 1,
            "text": ">How can you on the one hand laugh at someone for losing their job for saying something racist or insensitive online, then on the other hand advocate for a more rehabilitative justice system where even murderers should have a path towards redemption and a normal life?\n\nRacism, homophobia, etc effects someone's job performance.\n\nFor example, if a doctor was openly racist, I would 100% want them fired, regardless of if they were explicitly racist on twitter or in a bar. Racist doctors put the lives of people of color in danger because of their bias. This is obviously just one example and is not indicative of *everyone* who people try to get fired.\n\nFunctionally these systems are different, as others have said. Restorative justice isn't just meant to be a slap on the wrist/\"don't do that again\" - it's a direct challenge to the current system of throwing people in prison to rot. \n\n>I see this all the time where the same people that ridicule a white person for getting fired from their job or kicked out of college will go around saying that a black guy involved in gang violence should be offered rehabilitation.\n\nThere are many factors that contribute to someone being in a gang, many of which are environmental, social, and neccessity-based. I actually met someone who was a former gang member and went to prison for murder. He fully regrets everything and also had been brought in as a very young child with no (known) alternatives due to his poverty and has taken restorative justice steps to make up for what happened.\n\nWhite people generally have ample opportunities to not be racist, including direct education. Many colleges now have orientations that include basic intro to racism (or other social issues). In college, white people being racist directly impacts other students learning and safety. Often it is *extreme* cases where someone was overtly racist and then lost their job/schooling. Most cases of minor college racism aren't dealt with this way, lol.\n\nAlso... people can find it funny when a racist gets fired while also supportive restorative justice over the prison industrial complex. I do think it's funny when an extreme, overt racist loses their random job. Sue me.",
            "title_similarity": "0.8280893",
            "sentiment_compound": -0.9965
        },
        {
            "id": "h2ol5jm",
            "score": 1,
            "text": "Cancel culture is associated with the left but the right is certainly responsible for their fair share. To me it really exemplifies everything wrong with political discourse in social media.\n\nThe ultimate goal discourse is no longer to persuade someone with an opposing viewpoint but to take away an opponent’s ability to speak. It’s hypocritical in terms of reform and it’s also hypocritical in terms of promoting business rights to free speech at the expense of censoring individuals. \n\nWorse yet, it undermines the validity of the movements that support it. Adversarial discourse has been a cornerstone of debate for centuries. If an argument cannot tolerate dissent then it calls into question the validity of the argument. Take Alex Jones. He is, by all accounts a scumbag that pushed some pretty extremely transphobic views along with wild conspiracies. He was pretty successfully kicked off of just about every outlet and it would be hard to argue that his cancellation wasn’t warranted. But what about all of the people that bought into his bullshit? At no point did anyone try to persuade them. Instead kicking him off of all these platforms just proved that the tolerance movement is particularly intolerant. It galvanized their conviction that he was a threat, that his arguments were too strong for the powers that be and so they kicked him off rather than debate him. And they moved on to the next scumbag who knew how to drive clicks: Trump.\n\nNow I see these comments promoting twitter and facebook’s right to free speech and supporting their decision to kick trump off, fully oblivious to the fact that, by their own TOS, they should have kicked him off years ago. They profited off of the traffic he drove and were truly complicit in promoting not only his rise but the rise of nationalism, conspiracy theories, pseudoscience and hate worldwide. They didn’t suddenly start caring about LGBT issues. The Jan 06 insurrection didn’t “make them change their minds.”  The administration changed and they wanted to make sure section 230 doesn’t come up for review. If Trump had won do you think they would have banned him?\n\nAnd perversely, in a world where profit is based on engagement, the very people trying to get opposing views “cancelled” end up supporting that view indirectly. If you don’t support racism, then don’t reply to/retweet/share some racist tweet #smh and drive millions of clicks to a change.org petition in an effort to get them fired. Don’t engage with headlines where someone “shuts down/claps back/slams some politician that said something you disagree with. \n\nFinally, the most abhorrent thing about cancel culture: it really doesn’t give a shit about issues either. Deep down it’s about how many shares can I get? How many upvotes will make ME feel validated? Look how many people agree with ME that this guy is definitely involved that girl’s disappearance and he’s a piece of shit and should be banned from the internet. What? He was in Mexico at the time and couldn’t possibly have been involved? Oh well, that video he made creeped me out anyway. Good riddance.",
            "title_similarity": "0.7806716",
            "sentiment_compound": -0.9717
        },
        {
            "id": "h2oyg3o",
            "score": 1,
            "text": "Seeing as how so-called \"cancel culture\" is simply having standards and asking people to comply with them, which is not necessarily unreasonable, I think your premise simply doesn't hold.",
            "title_similarity": "0.5404974",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2pxmi4",
            "score": 1,
            "text": "100% agree with ya. My friend (who is less left than me, but more so than the average dem) and I frequently joke about this.",
            "title_similarity": "0.3052993",
            "sentiment_compound": 0.6858
        }
    ]
}