{
    "CMV: Covid-19 has been used repeatedly as an excuse for extremely poor service and outright laziness by numerous companies contributing to a decline in service quality and a rise of inflation in effort to drive profits up and overhead down, all disguised as being health conscious.\nSomething I’ve noticed for a while has been the terrible excuse of covid to explain manufacturers, distributors, and store fronts blatant laziness. For example normal store fronts would have you purchase a product, take if home, find out it’s defective and rather than offering an exchange, they would ask you to deal remotely with the manufacturer resulting in 3 hour+ hold times and numerous months for replacement which still had to be shipped to store fronts. This is just a common example I’ve seen. \n\nCovid is coming to a close and companies are still practicing this level of laziness. I think the new normal is going to be garbage customer service and sky high prices. We have nobody to blame but ourselves and we should have driven the offending businesses out of business for such practices. \n\nIf you yourself have any examples of this please speak up because I’m struggling to recall every example I’ve seen since March 2020.\n\nEDIT: most of what I’m speaking on has more to do with management and corporate planners. I understand small businesses are doing their best, it’s those that have capitalized under covid that should be scrutinized": [
        {
            "id": "h2qjfoo",
            "score": 1,
            "text": "/u/upinflames26 (OP) has awarded 6 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/o6633g/deltas_awarded_in_cmv_covid19_has_been_used/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.40696886",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2qs4zo",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2r6487",
            "score": -3,
            "text": "I know it’s tough, people really should have died for your convenience bro . I would bet the house you have a job that you can completely do remotely even before the pandemic? Computer programmer, sell software, something of that nature ?",
            "title_similarity": "0.72482026",
            "sentiment_compound": -0.6931
        },
        {
            "id": "h2qqm4v",
            "score": -1,
            "text": "Honestly, I think you are just flat out wrong.   I would love for you to name a single storefront that actually requires you to deal with the MANUFACTURER for returns. \n\nBecause that straight up is not how it works.   There are/were a handful of companies doing remote returns only but those went through the larger corporation.    The manufacturers themselves simply aren’t set up to even begin to deal with returns. \n\n\nI’d also love an example of a company whose prices have gone up because of Covid. \n\n\n\nI think what is actually happening is you are experiencing the effects of labor shortages from a few places and mentally extrapolating that out to a bunch of other things.",
            "title_similarity": "0.84873164",
            "sentiment_compound": 0.836
        },
        {
            "id": "h2rv6kh",
            "score": 1,
            "text": "just like you said i can't think of every example but here are just a few off the top of my head. You shouldn't be doing exchanges at the store as you may be carrying covid and possibly infect the returned item with covid, which them hangs around the store for a while waiting to be picked up by the manufacturer... returning it straight to the manufacturer cuts quite a few people out of that chain. Also I've had boot manufacturers tell me to keep the defective boots and send me new ones instead of exchanging. Thus cutting down on transmission. As for long wait times, many companies don't have big warehouses for storage, they order parts as needed just as you do... The supply chain dwindled, lots of factories closed, a ton of boats were kept in port bays and not were not docked for months. The suez canal was blocked, which is a major supply channel for the ENTIRE WORLD. Human lives were lost( astonishingly so, in developing countries where much of the world's production comes from), workers were cut, remaining workers were over worked, store hours were cut, profits were lost. Just because you can't see the full picture doesn't mean it's not there. A lot of the time the company has no control over these things. If you are chosing to do business with a small business then chances are they are struggling greatly. I'm not a fan of how customer service is right now, but to not understand why is dense.",
            "title_similarity": "0.8101504",
            "sentiment_compound": -0.9574
        },
        {
            "id": "h2r5y2n",
            "score": 4,
            "text": "My family owns a restaurant, which we had to change into a takeout shop during COVID. Our customers are clamoring for us to open our dining room, but so many of our employees left because it was more profitable to take unemployment benefits than to work (or pay was close without having to work). We barely have enough employees now to staff the kitchen, never mind have table service. Hiring has been near impossible. Until extended unemployment benefits run out and it’s again worth it for many to return to work, I’m not sure how much better service we could provide if we wanted to. \n\nFYI - Massachusetts, USA. Minimum wage $13.50/hr. Most employees make more than that.",
            "title_similarity": "0.6949322",
            "sentiment_compound": 0.8704
        },
        {
            "id": "h2qvcej",
            "score": 5,
            "text": "I have a great example that I dealt with a few weeks ago. One of the fast food restaurants in my city refuses to open their Lobby back up and the reason they're giving is that they don't have enough people working there to fill the position of one cashier in the front of the restaurant. I think that the real reason is they don't want to pay any one extra and are just giving the current employees there the extra burden of doing additional work when they shouldn't be doing that. But even before covid-19 companies loved to force a few people to do the work of a large group of people. Just to save money and have more to give to the exec's and CEOs.",
            "title_similarity": "0.7127627",
            "sentiment_compound": 0.9292
        },
        {
            "id": "h2r6tmt",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qreh7",
            "score": 2,
            "text": "Yes this is quite obvious.",
            "title_similarity": "-0.10848788",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2r5fry",
            "score": 2,
            "text": "so you've noticed, huh.",
            "title_similarity": "0.028386764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2r8gqd",
            "score": 2,
            "text": "And the shipping. So many things we have delivered suddenly take the whole month \"due to covid.\" Yeah. Sure.",
            "title_similarity": "0.54434574",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h2r7657",
            "score": 5,
            "text": "My company is experiencing huge order volume for the recovery and our lead times are doubled.  Suppliers have inconsistent quantities and we don’t have enough workers.  Excuse?  What else can we do?\n\nJust because Sue in service couldn’t make magic happen for you (a complaining customer, which is basically scum 90% of the time), does not mean the company is using covid as an excuse to issue top down orders to suck.  \n\nIt would be actually more difficult to purposefully suck.  The company you’re complaining about (if your complaints are even legitimate) was doing this before covid and Sue in service isn’t gonna be their best employee anyway.",
            "title_similarity": "0.73715574",
            "sentiment_compound": -0.6545
        },
        {
            "id": "h2sxw5i",
            "score": 0,
            "text": "Nah, most regular people/small business wouldn't do that. I think the government is scarring everyone so they can grab more power and enforce more control on people",
            "title_similarity": "0.7611567",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2qfbb1",
            "score": 68,
            "text": "I feel like the opposite of this is true for me. many stores in my area added services to help keep customers safe. having certain hours for older folks to shop when it's less crowded or removing fees for pick-up services. workers also have a ton of new job responsibilities when it comes to keeping the place clean and enforcing rules line distancing and mask requirements. \n\nif you feel like you're getting inexcusably bad service from a business, use a different one. but I don't see the trend you're seeing at all.",
            "title_similarity": "0.70022833",
            "sentiment_compound": 0.7469
        },
        {
            "id": "h2qjmn1",
            "score": 16,
            "text": "I generally disagree\n\nThere are definitely companies that have used the pandemic as an excuse, but majority haven't, since covid-19 caused serious economic disruption; It takes time to come back from this, especially if you were not extremely economically profitable before or during (from online utilizations). To add on even more, once the shut down period ended, facilities had to  starting running at a reduced productivity because of new health regulations. This prolonger the process of economic recovery even more. Even now, we do not necessarily know the true economic effects of the pandemic in totality, since adjustments are still being expressed to a certain extent.\n\nOverall, this is a pretty relative statement. The economics support businesses and this appears to stem down to personal inconvenience. This is not o say that is negated either, but it still goes against your original argument.",
            "title_similarity": "0.80341005",
            "sentiment_compound": 0.5764
        },
        {
            "id": "h2rif8n",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qei4q",
            "score": -1,
            "text": "What makes you so sure that the companies will be able to act in such perfect unison to maintain low quality of service once physical interaction with other people is no longer fraught with the risk of spreading a deadly disease.  \n\n\nBecause remember the companies involved are actually stuck in a sort of prisoner's dillemia...  \n\n\nIf every company does this then they can lower your quality of experience...  \n\n\nBut if every company but one holds out... or one company suddenly changes its policies... then that company will suddenly reap huge market share benefits for offering obviously superior service than its competitors.  \n\n\nEven if all the companies are being lazy right now... what makes you think there's no possibility one company won't end up seeing the profit to be made via superior customer service outweighing the cost of delivering said service?",
            "title_similarity": "0.7010113",
            "sentiment_compound": 0.9516
        },
        {
            "id": "h2rtlga",
            "score": 1,
            "text": "COVID is a joke",
            "title_similarity": "0.44766808",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2s8j23",
            "score": 1,
            "text": "Just wanted to point out that covid isn’t “coming to a close.” I know that’s not the main point of this post, but things look really different outside of the US (or wherever you are where the covid situation is improving). I’m from the US, and many places outside of here where we manufacture things, source labor, and get our raw materials are still in the height of the pandemic. Additionally, covid doesn’t magically disappear after we start vaccinating people. Vaccination rates in places like Florida are so low that they’re still having outbreaks and “herd immunity” is not happening. Many of these things we from the outside see as lazy and upcharging might be us misunderstanding what is still happening to these businesses in the face of this ongoing situation.",
            "title_similarity": "0.5816248",
            "sentiment_compound": -0.7151
        },
        {
            "id": "h2sh6b4",
            "score": 1,
            "text": "I know others were talking about the supply chain side of things, but I did want to address the hold times and laziness you mention. You do realize that the hold times are due to employees having to field other calls, right? You have absolutely no grounds to be frustrated with the wait time on a call as they employee you vent it at has been dealing with the issue all day. Or if you are upset, keep it to yourself. It's just a very antiquated way of viewing how a company \"should\" work, if something takes X amount of time then that's just how it is. Complaining and trying to force things through does nothing. I work in a role that requires me to work with stores, customers, and the supply chain/logistics side of retail and the amount of bullshit I hear about what customers try to pull when they are frustrated with a lead time is just absurd. If they tell you something will take weeks to come in, all you can do is wait. That's it. No one is trying to screw you over or anything. Saying that you'll take your business elsewhere is like going into a crowded restaurant and screaming about heading to another place when you are told there is a 40 min wait. You aren't the center of the world.",
            "title_similarity": "0.6784055",
            "sentiment_compound": -0.9805
        },
        {
            "id": "h2ranrz",
            "score": 7,
            "text": "I know this probably isn't that you're talking about, I haven't actually received an Amazon delivery within the 2 days it normally takes for almost a year.  At first there were good reasons for delays, but at this point I don't know why things aren't back to normal",
            "title_similarity": "0.53667974",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2qu881",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2r5wi5",
            "score": 2,
            "text": "I agree. 100%.",
            "title_similarity": "-0.043253772",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2r95xl",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qzqc4",
            "score": 3,
            "text": "I work at a company that you would probably call lazy and would want to drive out of business. \n\nManufacturing would start and stop periodically for a full year, at first it wasn't so bad because I could usually call around and find what I needed in stock somewhere but now it feels like any stock people had got bought up. Now that things are opening up people are starting projects that they've put off for a year and the demand shot up before manufacturing could catch up. \n\nWe've had customers waiting on a generator since February, I called our vendor the other day and they said they were currently filling orders from November. If someone wants a battery I know the soonest I can get one is September. There was just a Covid outbreak ( yes they're still happening) at the warehouse we get all our railing from so now that's difficult to get. \n\nIt's not fun for me to tell customers bad news. Trust me, if there was anything I could be doing I would be doing it to avoid all the rudeness I get.",
            "title_similarity": "0.6774406",
            "sentiment_compound": -0.813
        },
        {
            "id": "h2rb1wf",
            "score": 3,
            "text": "My massage therapist used it as an excuse to DOUBLE her prices and said it was because she had to take longer to clean between sessions. I was like umm….we’re you not cleaning before? I literally couldn’t justify paying 180 for a massage AND her still having the awkward tip bar on checkout.",
            "title_similarity": "0.7168664",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h2rbe2a",
            "score": 3,
            "text": "If McDonald's gives you the wrong coffee / food in the drive thru, they won't take it back after giving you the correct one, even to just throw it out for you... Despite the fact that the workers pass a garbage can on the way inside. It's because of covid they said.",
            "title_similarity": "0.6621206",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2qemob",
            "score": 498,
            "text": "The one example you have was a common practice with some companies prior to covid when dealing with warranties. Do you have an examples actually relevant to your complaint?",
            "title_similarity": "0.4681965",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2r9huw",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qklg5",
            "score": 83,
            "text": "In the beginning everyone who kept working within the service industry were overworked and certainly weren't being compensated their worth. Society in general has taken on a collective **** it mentality as a conscious attempt to drive up wages that have been stagnant for decades. In the meantime all these corporations are trying to operate as seasoned tech companies in order to cash in, in this heavy consumption market. Depending on your personality type you may or may not have noticed that algorithms aren't empathetic. Behind the scenes it's worse than the poor service you're experiencing. Now the economy is unbalanced. The costs associated with making sure corporations appear clean to the average consumer have went up. Welcome Mr./Mrs. Manipulation 5.0.",
            "title_similarity": "0.84542304",
            "sentiment_compound": 0.1635
        },
        {
            "id": "h2qmszl",
            "score": 9,
            "text": "It may be happening but not on a large scale, it goes against business sense of ensuring that goods and services are available at a fair price and of suitable quality. Deliberately curtailing the delivery of these opens up a business to competition from someone less \"lazy\". As others have pointed out most businesses have complex layers of suppliers, even apparently \"simple\" business do e.g. coffee shop is dependent on coffee cup wholesaler, who is dependent on cup manufacture who is dependent on paper and plastic wholesalers, who are dependent on manufactures of plastics and paper, who are dependent on suppliers who are dependent on oil and forestry industries, who are also multi-layered. All this for the apparently \"simple\" coffee cup. Also supply interruptions or resolutions to interruptions to one link in the chain don't manifest instantaneously across the entire supply chain. Think of cars that have stopped at a traffic light, the moment the light turns green the cars at the back of the queue don't & can't immediately start moving forward in sync with the car at the head of the queue. The removed impediment takes time to work it's way back through the supply line. You making the mistake of thinking supply chains are perfectly efficient and completely aware of all real-time events up stream. In most cases this is impossible to achieve as the business would spend more time keeping track of it's suppliers and their suppliers etc etc than actually producing the goods and service that they provide.",
            "title_similarity": "0.7295338",
            "sentiment_compound": 0.1875
        },
        {
            "id": "h2qqix5",
            "score": 11,
            "text": "I dont have much to say in terms of inside knowledge or anything as I have no experience, but I think you will find this video by Wendover Productions relevant : [https://www.youtube.com/watch?v=b1JlYZQG3lI](https://www.youtube.com/watch?v=b1JlYZQG3lI) It really helped explain things for me at least as someone who does not really deal with logistics or am part of any industry that heavily rely on regular access to supplies. \n\nTo boil down the content of that video it says what many others here have said: most companies implement the Just-In-Time supply line management methodolgy which in general means a lower stockpile to weather supply line issues. Ironically Toyota that seems to have started the whole Just-In-Time hype are doing pretty well because, while pioneering the principle, also ensure good supply stockpiles. The video also mentions man power due to covid issues as OP talk about in some comments.\n\nMy primary take away of the video is just that by doing the JIT supply line in a not-so-stockpiled way it creates a bottleneck at each step, and most modern prodects have at least several dozen steps from various factories, mines, transports, etc. Adding just a day delay at any one of these steps wont just add a day in total, but have a cascading effect because all other steps are affected due to suddenly having to deal with more production overhead. So instead of a 12 step process with 1 day delay per step becoming 12 days delay, you end up with an exponetial delay where every delay causes 1 day plus a multiplication factor. Essentially a very delicately, fine tuned engine keeps getting choked on sand or something due to continously shifting circumstances.   \n\n\nAs for my own personal experience I have personally felt I have gotten much better customer service most places because people have become much more concerned with customer retention and loyalty in a more connected fashion, not just the money grubbing Return on Investment way from before. H&M for example has, at least where I live, expanded their return policy from their normal 14 days to 30 days, pretty much with not questions asked or exceptions. Grocery stores such as Safeway has generally been more accomodating towards elders and at-risk people. \n\n  \nIn my experience it has only really been big companies like Amazon, Apple and Microsoft that have being cutting in on their customer service, relying more heavily on chat bots, closing store fronts (Microsoft has basically just removed all physical stores) and giving longer wait times with covid as an excuse. That is despite the fact that they have by far been the best positioned to pivot as they are primarily software and service providing companies with heaps of money they can throw at the logistical issue of expanding their primarily virtual customer support experiences.",
            "title_similarity": "0.5252626",
            "sentiment_compound": 0.9855
        },
        {
            "id": "h2qhgob",
            "score": 306,
            "text": "A lot of the issues with goods has to deal with J.I.T, or just in time manufacturing. A great deal of companies receive their parts for fabricating a product “just in time” rather than warehousing. When covid shut a ton of stuff down, certain items were left in limbo causing delays, in parts, causing delays in products. Combine that with a shortage in truck drivers and you have expensive goods due to shortages. Supply and demand. As far as courtesy and other pleasantries in customer service...man, everyone is stress. It’s only problematic if you fail to see the larger picture.",
            "title_similarity": "0.8194601",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2rb9hl",
            "score": 22,
            "text": "As a small business owner, supply chain issues and shipping issues are KILLING US. \n\nShipping costs are going up (and customers want free shipping),  but packages are taking forever to get to their destinations, not to mention most people expect all businesses to run like Amazon (I have a custom printing business, and the number of people who expect a custom item, delivered across the country in 1 day is ridiculous.) \n\nWe are exhausted, I haven’t taken a single paycheck in over a year, but I’m working 50-60 hours a week- plus for a long time I was homeschooling my kids on top of it. \n\nAnd customers are people too, they are stressed and exhausted- and unfortunately a lot have been letting that anger out on anyone, including employees, so employees are even more burnt out. \n\nWe are ALL in this mess, maybe a little kindness could turn some of these issues around a whole lot better than negativity and criticism.",
            "title_similarity": "0.7082609",
            "sentiment_compound": -0.9662
        },
        {
            "id": "h2qs0az",
            "score": 88,
            "text": "I think one thing that has been mostly untouched so far is how this is being exacerbated by lower level employees. My background is in restaurants and retail for the past 15+ years. I just left a job managing an incredibly successful restaurant.\n\nThere's a few things to point out for almost everyone who wasn't able to work from home. And, of course, these are broad strokes.   \n\\-Poverty Wages while watching the unemployed thrive.   \n\\-Overworked every week. Understaffed every day.  \n\\-The company made record profits and did jack squat for their employees (More than usual).  \n\\-Left in the dust by their government and their employers.  \n\\-Government regulations and company policies in a constant state of flux.  \n\\-Some states shut down multiple times. Sadly had to lay off one of my employees 3 times. I felt so bad.  \n\\-Customers have been worse. So much worse. I can't stress this enough. I've been involved with and witnessed conflicts with customers more times in the past three months than I have in the past decade and a half.   \n\n\nIf you thought min wage employees didn't give a F\\*\\*\\* about their job before the pandemic, there is an entirely new level of apathy that's emerged. We have people who now know concretely that nobody in any system cares about them in the slightest mixed with knowing that they have supreme job security because no one can afford to fire what little employees they have left. And this thought process has been flowing upstream to management. Oh man everyone in my company and my industry friends all have the same stories of how management exhibited depressive symptoms when they couldn't get any new hires and couldn't re-hire their employees. I read that 3% of the American work force quit in April. The light at the end of the tunnel caved in.\n\nYou have some valid points. I totally agree that companies are using this as an excuse to be dirtbags. You get all the bonus points for coming here instead of screaming at some poor soul. I'm sorry to say that most employees that deal with the public are no longer capable of caring.",
            "title_similarity": "0.62879395",
            "sentiment_compound": -0.8144
        },
        {
            "id": "h2qemdz",
            "score": 2,
            "text": "What makes you think this is “laziness” rather than a genuine disruption in service patterns or supply chains due to an unprecedented pandemic?",
            "title_similarity": "0.72381026",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2qj493",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qnhb2",
            "score": 2,
            "text": "Inflation isn’t solely to blame on Covid, but moreso the excessive debt spending. But on every other point, completely agree",
            "title_similarity": "0.5641312",
            "sentiment_compound": -0.0671
        },
        {
            "id": "h2qq51g",
            "score": 1,
            "text": "In certain sectors and wage ranges, there’s a significant labor shortage right now. Hospitality, restaurants, construction & manufacturing are all having a hard time hiring good talent — some of which is attributed to the supplemental unemployment benefits many are receiving that exceed low wage jobs. That could be a factor in the decline of customer service you’re seeing — folks are understaffed and it’s tough to hire good talent.",
            "title_similarity": "0.7776129",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h2qqscj",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qrdow",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qrk12",
            "score": 2,
            "text": "I think part of the equation you may have left out is the additional pressure, workload, and stress experienced by those you have interacted with. \n\nI believe there is significant overhead caused by the non-habitual steps involved with providing service to the public during a pandemic.  There’s certainly much more to think about.  \n\nEven being away from family is a big deal for many people when there is a mass outbreak.  And that’s just leaving the house.  Everything is different out there and it’s heavy. \n\nThese and other factors from the fallout could easily contribute to lapses in productivity and poorer service than normal. \n\nSomething that could be beneficial in the future is government subsidized payments to workers who remain working during a pandemic.",
            "title_similarity": "0.8120333",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2qujf1",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qwjw6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2qwkf1",
            "score": 1,
            "text": "The postal system in my country was shit before the pandemic, now it's even worse. Many of us have been working from home, so any parcels that arrive can be delivered by the postal worker by hand. But no, they don't even ring the doorbell to see if you'rehome. They just leave a paper in the letterbox telling you to pick up your parcel from the local post office. Any fellow Maltesers here?",
            "title_similarity": "0.7109532",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h2qx9ab",
            "score": 2,
            "text": "Ok so this one is from personal experience of getting a new driveway and also getting the front and back garden done.\n\nHe had to order the paving slabs 3 months in advance; the reason is because everyone saved money last year by not going on holiday or eating out as much etc and now everyone has decided to invest in their property (it’s amazing how many issues you notice when you’re locked down and in the house all hours). This wasn’t an expected exponential rise in demand and this has meant there are now shortages in paving slabs, timber, even too soil and sod. All of this combined means that for a long time there is going to be a backlog as they try and produce extra for the people with new found savings who want to invest in improving their property.\n\nThe guy doing the garden said the place they get the stuff from get a delivery of various materials and what would last a few weeks is gone before lunch.\n\nThis has also driven up the prices. I was going to get railway sleepers for the borders in my garden and he costed them at around £12 a sleeper. They are now not available and the cheapest he can find (he is still searching) are around £50 a sleeper. Completely driven by the extra demand.\n\nA lot of these companies are doing their best to try and fill the shortfall but they just don’t have the ability. When their factories or stone yards are at full capacity, it still isn’t anyway near filling the demand. In order to do that they would have to increase capacity, and that requires heavy investment, and it’s money they don’t have due to the drop off last year, and it wouldn’t be wise to increase capacity when in all likelihood this extra demand will disappear within the next 12-18 months.\n\nSo what we have currently is people supplying what they can, but until the demand drops or someone heavily invests, the service is going to be impacted.\n\nI imagine it’s like this with other industries as well. At the end of the day they want to give a good service because you’re more likely to recommend them or use them in the future. So long as they can manage your expectations and be clear it isn’t going to be smooth sailing, I think that’s the best service you’re going to get in this period of time",
            "title_similarity": "0.60158354",
            "sentiment_compound": 0.9865
        },
        {
            "id": "h2qxqhp",
            "score": 1,
            "text": "It hasn't been all declines. \n\nA lot of stores now have curb side pick up which is pretty convenient. Don't even have to find inside the store, they just bring your order out to you. \n\nRestaurants have been creating lots of new and expanded patio service which is great for the summer months.\n\nMany cities are still running full transit service despite significantly reduced ridership to allow for extra space for passengers to spread out.",
            "title_similarity": "0.41196477",
            "sentiment_compound": 0.886
        },
        {
            "id": "h2qy1jx",
            "score": 1,
            "text": "High street banks are just getting pathetic in the UK for some reason they decided to reduce opening times due to covid which meant banks would normally be open 9.30/10am until 4/4.30pm\n\nWhile everyone else is at work",
            "title_similarity": "0.71220505",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2r18h8",
            "score": 1,
            "text": "I think you're confusing laziness with cost savings.",
            "title_similarity": "0.59106874",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2r29o0",
            "score": 1,
            "text": "First thing I noticed during lockdowns and with the Gov.\n\nAt National Parks they were closing campgrounds and bathrooms but charging full price to enter and walk around?\n\nIt really bothers me bc you can’t tell the Gov. to go fuck themselves like a  private company seeking to remain competitive",
            "title_similarity": "0.8002924",
            "sentiment_compound": -0.4748
        },
        {
            "id": "h2r3gr1",
            "score": 1,
            "text": "Bestbuy is dead to me",
            "title_similarity": "0.41844296",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h2r3ntt",
            "score": 3,
            "text": "I work in manufacturing. It’s easy to see how this could happen. The company I work for builds large heavy equipment, our orders take several months to build. Order slowed for a while last year but we had enough to carry us through. We closed the shop for two weeks but otherwise have remained open. We have not laid off a single employee or withheld purchasing any inventory.\n\nEven so, all material prices have surged and availability of material is getting very difficult to find. Orders for new equipment have remained very steady, but orders from existing customers for repair have surged, which means the inventory we had previously forecasted have to stretch further, even though we are looking at leadtimes over a year for some components. \n\nAll that said, our products are far simpler than a company like Ford. The majority of our components are sourced here in the US or built internally, and we probably have 1/10 the parts of the average F150. \n\nThe real answer here is that we need to bring manufacturing back home. Pay attention when you buy your products to where it’s made and components are sourced.",
            "title_similarity": "0.5745206",
            "sentiment_compound": -0.0231
        },
        {
            "id": "h2r8v41",
            "score": 1,
            "text": "You can't blame businesses for inflation, that's the fault of the federal reserve. As far as customer service, most large companies have been lacking good customer service well before the pandemic. It's a bit tiring to see \"ree evil corporations profits bad\" every other post in this sub, and it comes across as childish and ignorant.",
            "title_similarity": "0.8517894",
            "sentiment_compound": -0.7153
        },
        {
            "id": "h2r8xeb",
            "score": 2,
            "text": "Here is another thing to consider, from the way you are talking about the pandemic, it sounds like it's over or basically over. Except it's not. It's finally somewhat under control in the USA and parts of Europe. However that's not true in India and many other countries, who are part of many supply chains. And even now the delta variant is quickly spreading and causing problems in under vaccinated areas.\nIt's not over yet and the tail will be long.",
            "title_similarity": "0.7170572",
            "sentiment_compound": -0.3678
        },
        {
            "id": "h2r9vbl",
            "score": 1,
            "text": "Rise of inflation is due to the lax monetary policy and literally printing “free”money and handing it out. The velocity of money increases. \n\nhttps://en.m.wikipedia.org/wiki/Velocity_of_money",
            "title_similarity": "0.6579483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2rbczy",
            "score": 1,
            "text": "Workers are disgruntled. It's not only prices that have gone up, but for many, workload has also increased. Staffing is low. Management will break their workers to make their bonuses, in spite of covid, and then go on extended leave. \n\nI dont blame the front line workers. They're stuck between panicking Management and butthurt customers who are rustled because of inconvenience. \"Driven the offending companies out of business\" lmao. I'm sorry. But what world are you living in  where business integrity means anything? Enough money and you can let workers die on the job without significant  repercussion.",
            "title_similarity": "0.83358276",
            "sentiment_compound": -0.8869
        },
        {
            "id": "h2rdfxd",
            "score": 2,
            "text": "DMV good luck",
            "title_similarity": "0.046379942",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h2re9yw",
            "score": 7,
            "text": "Most restaurants I visit have removed all condiments. Some will begrudgingly give me a ketchup packet or two. Also napkins seem to have gone extinct.",
            "title_similarity": "0.61478525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2rfaw8",
            "score": 4,
            "text": "The wait times and poor food quality in restaurants is an easy fix. I’m glad I got out but tipping culture doesn’t have a place in the new normal. COVID taught us that the people we work ‘for’ aren’t the ones paying us and it promotes discourse.",
            "title_similarity": "0.65295815",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2rgosf",
            "score": 3,
            "text": ">For example normal store fronts would have you purchase a product, take if home, find out it’s defective and rather than offering an exchange, they would ask you to deal remotely with the manufacturer resulting in 3 hour+ hold times and numerous months for replacement which still had to be shipped to store fronts.\n\nThere's literally nothing stopping you from taking your \"defective\" item back to the physical store and demanding a refund/exchange. \n\nMaybe what you perceive as \"laziness\" is actually companies dealing with the fallout of a **GLOBAL PANDEMIC**. Maybe there are only 1/4 of the employees working on-site filling orders. This isn't \"Bad Customer Service\" it's literally an anomaly.  \n\n&#x200B;\n\n>We have nobody to blame but ourselves and we should have driven the offending businesses out of business for such practice.\n\nOk Karen.",
            "title_similarity": "0.7548003",
            "sentiment_compound": -0.676
        },
        {
            "id": "h2rh0cg",
            "score": 1,
            "text": "Glad I'm not the only who thinks this OP",
            "title_similarity": "0.28481853",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2rhbk3",
            "score": 1,
            "text": "Well in defense to stores, and as one who works within the warehousing and distribution industry, I read a lot on the current state of things, but with the current Infrastructure Bill having quite a large bill, we are potentially looking at terrible levels of inflation, with that bill being discussed to be anywhere between 3-6 trillion dollars, all of which will come from more money printing, thus devaluing the USD even more, therefore all industries are indeed quite nervous to see what happens.\n\nI work in the glass bottle industry, specifically with beer bottles, and we are noticing a lot more test pallets coming in for breweries to test on their line, they are a little thinner and appear to cut out much of the unneeded glass printing and lines and molding. Additionally you may even see an increase in everything made with glass, there is a HUGE shortage in recycled glass, which is best to use as a base material when smelting glass with the raw materials, so you may even see a potential increase in your bottled goods.\n\nNow there is indeed a shortage in microchips, computer chips, etc because most of that is made in China, which has little to no environmental protections, so they're the ones contracted out to make these things, which otherwise would be much more expensive to make if they were made in any 1st world nation I.E. US, Japan, Canada, France, etc. which all have environmental standards when it relates to manufacturing products. So there is indeed a shortage and a supply strain on all warehousing and distribution. We aren't the largest warehousing company by any means, but we can't find people to work as forklift drivers/operators, or even temp workers, which are usually ex-cons looking to re-enter society, so we offer our temp work to them to help them, and two of them actually became drivers here and are quite pleasant to talk to and learn more about their experiences. \n\nThis can also be seen in customer service jobs, no one wants to work in customer service, answering phones, when they can just get a check from the government, as most states are still offering more than what unemployment should pay out, at 200-500 dollars extra a week! So yes, you will see that places like Walmart or Target, don't have enough customer service staff to answer phones, so it's easier, and within the scope of the law, to pass you off to the manufacturer, for a refund/replacement. This is probably how things will be until all states have stopped the additional money for unemployment, and when the world comes back to normalcy. \n\nI've always said, America should never have stopped making things for herself, otherwise we will find a day where if we depend on a nation to make our products, as soon as that nation turns against us or faces an economic downturn, we will be caught up in a supply and demand hell.",
            "title_similarity": "0.7770905",
            "sentiment_compound": 0.0815
        },
        {
            "id": "h2rhx7g",
            "score": 1,
            "text": "I can't speak for all companies, but the travel industry is still struggling to provide the same level. Of service after covid.\nOne of the things people don't understand is that even though demand (domestically) has returned, if not higher in some cases, but the downsizing of the industry has left many places understaffed, or lacking skilled and experienced staff. This then creates b2b issues which then go on to affect b2c. \nIt will be a different story for every business, but the point is that impacts are not always obvious, and often indirect.",
            "title_similarity": "0.77314067",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2ri1ek",
            "score": 3,
            "text": "I have quite a few contacts (close friends and family) that work in construction manufacturing. As in they manufacture items like doors, windows, bath tubs, etc. and my sisters husband work for a major national building supply chain as a VP. For the record I do not work in this industry, I work in homeowners insurance. But we did have a chat about everything going on since it’s effecting my field. \n\n\nBasically most companies operate under the principal of lean manufacturing or J.I.T. Manufacturing. It serves a few purposes for the companies doing the ordering. For one most of them cannot hold a massive amount of inventory just due to the shear size of it all. So each retail unit might have inventory of a certain product and they might have a warehouse with a bit more. Those stores have yearly history of about how much each product will sell at a certain time so the system will automatically order more from the warehouse. When big orders are placed usually they will give a lead time of 6-8 weeks (everyone knows a few months ahead of time that they will need shingles for instance when they start a new construction) this tells the warehouse to prepare the order. All of this controls how much they order from a manufacturer. The manufacturer does not store that much product either because they likely are tooled for producing hundreds of different products so there not going to waste space trying to store every different product. \n\nThe second reason is cost. It costs a lot to buy a product let alone if your supply store and have thousands of different products. So most companies cannot afford to have millions tied up in product either. \n\n\nSo with all of this in mind what happened was at the beginning of Covid everyone thought that this was going to have long term effects on some industries and they canceled orders. Companies wanted liquid capital and not to be tied down with product. So the manufacturers were faced with a dilemma and most of the ramped down all production and tried to find alternative products to produce (there not making money if there not manufacturing). So most of them retooled for other profitable items. Then all of a sudden most places realized they weren’t slowing down in work and started ordering. A lot of people were suddenly home and wanted to do projects, have remodeling done, etc. combine that with a large population having stimulus checks and demand was soaring. Then a series of bad storms across the country (prior lake Charles LA damage that wasn’t fixed, west coast wind storms, Texas/OK freeze, Texas hail, etc) and you have a bigger demand on these manufacturers. \n\nThen you have to consider that a manufacturing plant probably services multiple companies and each company probably has multiple store fronts. So like assume the manufacturer for water valves makes them for 10-15 companies. Then those companies take those valves and other parts and build faucets or something. So now this faucet company is waiting on multiple manufacturers to send them their parts. Then produce their product and then sell that to hundreds of locations. If one of their manufacturing plants has tooled up for another job there will be delays. \n\n\nAll this is to say that the world revolves on very tight schedules and any interruption will fuck the system up. \n\n\nMost retail units handled warranty/exchanges for us as a courtesy to attract more business. Who are you going to buy from the guy you can exchange a defective product from or the guy making you deal with the manufacturer? Most products even have a paper that asks you to contact the manufacturer any way because that’s how they want it. But no one ever did. Now businesses are being forced to do that because they might not have the inventory on hand to do it. Imagine your Best Buy and you have no stock of PS5s. Some guy comes in with his three week old PS5 and it’s broke. How are you doing to exchange it for him? You don’t have any (this just happened to me with a $300 headset). Now imagine your a smaller non national wide business that doesn’t have the purchasing power to be a priority for those manufacturers, your at the bottom of the list when it comes to orders.",
            "title_similarity": "0.61678416",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2rjhmv",
            "score": 1,
            "text": "for every person doing customer service with a side of labor, tgey now additionally have to wear a mask and wash their hands while maintaining the same amount of tasks.",
            "title_similarity": "0.34280437",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2rk12q",
            "score": 1,
            "text": "Can confirm. I was the assistant manager of an ice cream shop up until a few weeks a ago. The weather in the UK started getting warmer but “due to COVID-19” we were short staffed. But in reality it was my manager’s lack of ability to post the job on indeed despite me nagging for more staff for months",
            "title_similarity": "0.6290573",
            "sentiment_compound": 0.5403
        },
        {
            "id": "h2rk2bp",
            "score": 1,
            "text": "Sounds like a good avenue to research unfortunately with the the whole “Covid” thing we are just able keep things going in the research dept.",
            "title_similarity": "0.33547658",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2rka2w",
            "score": 3,
            "text": "Was working with customer service with a relatively small performance parts manufacturer. They said the call volume was extremely high (9:00am) due to COVID, said that they would callback and hung up",
            "title_similarity": "0.5892477",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2rkgx8",
            "score": 2,
            "text": "I ordered a bed frame 20 weeks ago - Feb 6th. Shipping was supposed to take 8-10 weeks but it’s still not here due to covid, apparently. No one seems to know when it will be here “but I’m sure it will be soon!” Covid has been around for a year and a half now. Why.",
            "title_similarity": "0.52709",
            "sentiment_compound": 0.1134
        },
        {
            "id": "h2rlcz7",
            "score": 1,
            "text": "Spot on. Went thru this crap with home renovations.",
            "title_similarity": "0.5241088",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2rmyke",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2ro11l",
            "score": 1,
            "text": "Is it laziness or is it the fact we are still learning new information about this virus and, since businesses face legal liability if they do not take reasonable precautions, anything which goes wrong by not being cautious exposes them to financial ruin?",
            "title_similarity": "0.7762867",
            "sentiment_compound": -0.7604
        },
        {
            "id": "h2roifn",
            "score": 1,
            "text": "The company I worked for was under performing and had huge issues before covid. When the pandemic arrived they started to blame it all on the pandemic. Finally they had an excuse for the poor management.",
            "title_similarity": "0.8447393",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2rokxj",
            "score": 1,
            "text": "I’m not planning on buying a new console but I see that stores are still not selling PS5 or Xbox in stores.  The only view I’d want to change is that a majority of businesses in regard to the people who run them really don’t care about the people that work the lowest paying jobs or the people in their stores only their profits.  They’ll put on a show just to get the consumer to have a more favorable image of the company.",
            "title_similarity": "0.70647967",
            "sentiment_compound": 0.9044
        },
        {
            "id": "h2rp9im",
            "score": 1,
            "text": "*cough* FEDEX *cough*",
            "title_similarity": "0.3653636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2rrkx0",
            "score": 1,
            "text": "That’s it dude!  Exactly right.  Thank you.",
            "title_similarity": "0.02034542",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h2rrluj",
            "score": 1,
            "text": "I've had zero problems with making returns during COVID-19 either online or in store fronts. The few warranty claims I've made have been seamless & easy as well. Suspect this is company specific. What kind of products are you having trouble with and in what country?",
            "title_similarity": "0.3979467",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2rs35x",
            "score": 1,
            "text": "oof don't get me started. it's been booms for the economy over here, and total dystrophy over there.\n\n5 star sushi place from 2019 has dropped down to a 3 star this 2021. Even the google reviews are sad that the customer service down-spiraled.\n\nThen a lot of business owners are getting COVID checks but there is no policy on how you use these checks. I heard stories of local business owners using their funds to pay off their cars or buy brand new ones. Since they don't invest into their business, it slowly falls apart. I know the checks are meant to make up for no pay, but the businesses you run give consistent pay and give back to the community. With the vaccines rolling out, more and more people are getting out there.\n\nI am also victim to telework and my communication skills were rusty when I was allowed to be in office.  It took me a few months to get back on my feet, but I noticed a lot of people are taking advantage of COVID times. One says \"I don't have to go into office, I can do all that from home. Please telecom me in today's meeting.\" No. No! Get yo butt into this conference room! You've had a \"supposed\" fever every other meeting day XD it was kinda obvious.",
            "title_similarity": "0.7430083",
            "sentiment_compound": 0.7251
        },
        {
            "id": "h2rtj1h",
            "score": 1,
            "text": "High prices are a result of inflation, which is defined as an expansion of the monetary supply. Raising prices are the result of inflation, not inflation itself.",
            "title_similarity": "0.46970958",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2rty5u",
            "score": 3,
            "text": "As someone who works at Panera (though not for much longer, but I’m parting ways amicably), I can agree with you to a point. We were at 50% capacity long after the governor relaxed the mask mandates, and corporate had a stupid policy that we HAD to require masks, even if it meant customers verbally abusing us and threatening violence. My sweet managers somewhat ignored this rule, and it seems like they’re relaxing the policy since people were pissed about it, but still. Unhappy associates won’t perform at their best.\n\nThat being said, there were some other things that I believe were and still are necessary. I’m assuming you think most if not all of the new policies were inconvenient and “just excuses”, and if this wasn’t your point I greatly apologize. I personally believe that it was and still is very important to require associates to wear masks, wash hands often, and clean the dining room after each customer leaves - that’s just good sanitization, even if it yields us twice the work. Other seemingly inconvenient issues, such as long wait times for curbside and delivery, were due to the fact that at a time people greatly preferred ordering online over going in and risking COVID. More orders = more chances for things to go wrong and more people who need to be served.\n\nOf course, all I can give are my own experiences as a food service worker, but your view was a bit vague to begin with. I would need to know what businesses you’re referring to, what policies are inconvenient in those businesses (you gave an example), and if you’ve considered possible alternative reasons to the inconveniences already. Then I could give a more specific answer. :)",
            "title_similarity": "0.7389762",
            "sentiment_compound": -0.7047
        },
        {
            "id": "h2ruhhe",
            "score": 1,
            "text": "Yes I had this experience at several restaurants or fast food places in the past couple months. Closing down restrooms or not offering straws unless asked “due to Covid 19”. \nNo. You just don’t want to pay someone to clean the restroom.",
            "title_similarity": "0.67925435",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2rux4y",
            "score": 2,
            "text": "What you see as laziness is actually massive product shortages due to production delays. There's no way to custom order anything right now. Companies move slowly through their catalogue producing a couple of things at a time. If you miss it, you miss it. As a small retail owner you have no idea how frustrating it is to stay afloat right now. Not because people don't want what we have to offer, but because what we have to offer is 15% of a normal year.\n\nPrices are sky high because the cost of shipping has exploded and the price of the fewer commodities that we have less of right now, cost more. \n\nYour rant is lazy and uninformed.",
            "title_similarity": "0.74807227",
            "sentiment_compound": -0.8985
        },
        {
            "id": "h2rvf0s",
            "score": 1,
            "text": "Eh. You will be ok.",
            "title_similarity": "-0.09773961",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2rvq5n",
            "score": 1,
            "text": "I work for a company as a territory sales person. \n\nHalf of me agrees with you. We hired all new technicians and cleaners and they do a dog shit job. I am constantly having to apologize to my clients for their mistakes, some of which have cost our company thousands in repairs. My boss, the owner, explains it off the same every time blaming it on Covid, shipping delays, manufacturer delays, etc. In reality it’s a really poorly ran business that I can’t help but feel that I personally keep afloat through my 100+ clients. \n\nThere is the other half where I do see the rising costs and shipping issues play out in real time due to Covid. \n\nOverall though, it’s provided a perfect excuse for my companies lack of foresight, preparation and integrity.",
            "title_similarity": "0.7072673",
            "sentiment_compound": 0.8641
        },
        {
            "id": "h2rvusa",
            "score": 1,
            "text": "It’s almost as if the NPCs are starting to realize that covid was a manufactured crisis",
            "title_similarity": "0.59311616",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h2rvwmm",
            "score": 1,
            "text": "I've definitely experienced this with numerous larger companies online. A few months ago I ordered a case from OtterBox and noticed it was the wrong type on the order so I tried contacting support immediately. I never could contact them even after attempting to go through Paypal. All their phone lines say is \"sorry, support is closed due to covid\". Exact same thing happened with HP support. \n\nIf I order anything online I make sure their support is functional first. It isn't fair to the consumer to be straight up ignored.",
            "title_similarity": "0.7936511",
            "sentiment_compound": 0.8417
        },
        {
            "id": "h2rxez9",
            "score": 1,
            "text": "Service like wait staff and restaurant food was declining before the pandemic and really since reopening while it’s slow the actual vibe feels better. I’ve been comped hella shit recently because the kitchen was slow. I feel the wait staff in the restaurants that I frequent has been more attentive than before the pandemic.",
            "title_similarity": "0.69339365",
            "sentiment_compound": 0.1298
        },
        {
            "id": "h2rxo4y",
            "score": 1,
            "text": "100% agree, despite things opening up, covid is used as an excuse for shitty customer service",
            "title_similarity": "0.6882103",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2rxte2",
            "score": 1,
            "text": "Restaurants locking one of the two double doors. Like funneling everyone through the same door is anything other than lazyness.",
            "title_similarity": "0.54940426",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2ry908",
            "score": 1,
            "text": "Of course! 🤣🤣🤣\n\nThis is what happens when you have shitty employment laws that don't protect workers.",
            "title_similarity": "0.7831515",
            "sentiment_compound": 0.6259
        },
        {
            "id": "h2s0rza",
            "score": 1,
            "text": "Now you are getting it pal. Its been the plan all along 🤗",
            "title_similarity": "0.13496444",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2s0wpa",
            "score": 1,
            "text": "Agreed.  There are some companies that are using Covid as a go to excuse for things that have nothing to do with Covid (emphasis on the some).\nFor me, the most consistent example of this was outdated website info.  Covid would be blamed for this over and over—which is ridiculous because updating a website obviously can be done from home with no Covid risk.\n\nThat, and my mechanic lied and told me he ordered a part for my vehicle.  He said it was to arrive in 6 weeks (I understand production delays because of Covid are legitimate).  I wait 7 weeks and ask for the shipping info because my part has still not arrived.  He admitted he forgot to order it.  I was semi-stuck with him because my insurance had already approved his shop.\nHe lied and used Covid as an excuse for him lying, and then forgetting, about ordering the part.",
            "title_similarity": "0.7728392",
            "sentiment_compound": -0.8549
        },
        {
            "id": "h2s205g",
            "score": 2,
            "text": "I love thrift shopping; the Goodwill game in my city is strong. But the local stores changed their policy since the pandemic: no fitting rooms, and all sales final. No returns/refunds.",
            "title_similarity": "0.6813966",
            "sentiment_compound": -0.2144
        },
        {
            "id": "h2s37w6",
            "score": 1,
            "text": "I always say, the greatest victim of COVID was customer service. It’s been a great excuse for any service issues, reducing quality, removing value adds, massive staff reductions, and a scapegoat for dealing with problems and not accepting returns. \n\nIt’s the greatest crutch businesses have ever been given and they’re abusing the hell out of it.\n\nExample: my home warranty company (2-10) now has average 6-8 hour wait times to talk to anyone.",
            "title_similarity": "0.7946451",
            "sentiment_compound": -0.0217
        },
        {
            "id": "h2s3hw8",
            "score": 1,
            "text": "YES!!!!!!!!!!!!\n\nI wrote an heated email to a few head offices about this (probably in vain, but it felt good). \n\nMy doctor's office has had a regular 45 to 1 hour hold every time you call them, even for quick questions, like reschudling. Every time I mention it, I get the \"its covid blah blah\"... No. No. Covid happened 18 months ago, we all stumbled to adjust, but if by this time you still haven't gotten your act together, thats just BAD MANAGEMENT!!",
            "title_similarity": "0.69095445",
            "sentiment_compound": -0.4217
        },
        {
            "id": "h2s3yq9",
            "score": 1,
            "text": "Sounds just like recycling. It's not saving the planet.",
            "title_similarity": "0.52628136",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2s5pot",
            "score": 1,
            "text": "Every takeout i get only gives me 30% of the amount of food they used to give me pre covid. And they charge 15% more.",
            "title_similarity": "0.47849",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2s81k5",
            "score": 1,
            "text": "I’ve noticed no matter where I go, if I grub hub or door dash a meal, it’s less than the quality you would get if you went and got it yourself. I always thought maybe it’s cuz they don’t ever have to deal w the customer that they’re like “fuck it”",
            "title_similarity": "0.69057465",
            "sentiment_compound": 0.3455
        },
        {
            "id": "h2s882r",
            "score": 1,
            "text": "It really is an excuse. When most people are on unemployment and refuse to even attempt to go back to work there’s going to be massive inconveniences customer service wise. Sure some people are just making an excuse for laziness but most of the time it’s legitimate.",
            "title_similarity": "0.7890489",
            "sentiment_compound": 0.1486
        },
        {
            "id": "h2s8g5z",
            "score": 1,
            "text": "We recently had a bad hailstorm and it damaged our roof.  We filed a claim with our insurance company, and they will not send out an adjuster to look at our roof.  They would not even have to come in contact with anyone to do this (and everyone in our house is fully vaccinated!)  My husband had to go on the roof and take pictures and do all the measurements.",
            "title_similarity": "0.58986557",
            "sentiment_compound": -0.7712
        },
        {
            "id": "h2sajky",
            "score": 1,
            "text": "I think if said poor service is caused by supply issues, it's easy to believe that covid has something to do with it. If the poor service is because the place can't hire or retain employees? I'm more likely to believe that's just a shitty business that doesn't treat people well enough to get away with paying them so little anymore. Of course the shitty businesses are using covid and everything else they can as an excuse.",
            "title_similarity": "0.8325801",
            "sentiment_compound": -0.9227
        },
        {
            "id": "h2samd6",
            "score": 1,
            "text": "The Noon Normal",
            "title_similarity": "0.0860683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2sbgps",
            "score": 1,
            "text": "Airlines… I fly over 100 times a year for work, and did so during the pandemic. They used it as an excuse to not serve food and drinks all the way till like March 2021. It’s ridiculous… so we can all sit in this tiny germ box for hours breathing on each other, but all of a sudden serving us sodas and water is impossible? BS.",
            "title_similarity": "0.67229974",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2sbjda",
            "score": 1,
            "text": "Not only companies but the government too. Had a hard time getting married because of the extreme laziness and incompetence of government.",
            "title_similarity": "0.783584",
            "sentiment_compound": -0.754
        },
        {
            "id": "h2sbv5y",
            "score": 1,
            "text": "I would say there’s a general lack of “give a fuck” in all sectors that have some sort of customer service. Been brutal the last year and a half",
            "title_similarity": "0.6432782",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h2sckuf",
            "score": 1,
            "text": "I own a minority stake in a restaurant in Tampa, simply an investor, but I know for a fact that a lot of restaurant workers were collecting the added benefit of covid unemployment. It incentivized not working because they're getting paid more to be at home doing things they want to do versus taking punishment from customers everyday.\n\nThis translates across multiple industries. When you're staffing is lower than anticipated, it's difficult to fill shifts, especially in industries that require training.\nThe work is already piling up, there are not enough people to perform the work, and new hires require training in SOPs, but there's little time to train because you were already drastically short-staffed. \n\nUndoubtedly, many sectors have suffered due to covid. Some are surely taking advantage of this by not holding themselves to a higher standard even if they are capable.\nIt's difficult for small business owners who had to take the nastiest hit of their life in revenue for an entire year if they were able to survive. It's difficult to justify taking a further loan to save your life's work, thereby leveraging yourself further as we approach and an unavoidable economic crash.",
            "title_similarity": "0.7035612",
            "sentiment_compound": -0.9398
        },
        {
            "id": "h2scvuc",
            "score": 1,
            "text": "If I'm understanding your point correctly an example of poor service quality would be stores, such as department stores and clothing retailers, that closed their fitting rooms and stopped doing returns during the lockdowns (understandably so) that have now opened their fitting room again but are still not allowing returns. Why?",
            "title_similarity": "0.7774365",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2sf2vt",
            "score": 1,
            "text": "Every single aspect of the Covid response was bullshit disguised.",
            "title_similarity": "0.55371416",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h2sg1be",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2sgmug",
            "score": 1,
            "text": "I swear if I hear “because of Covid” again I’ll blow up the fucking building",
            "title_similarity": "0.63642335",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2sixon",
            "score": 1,
            "text": "Listen.  Corporations will never change.  Know why?  Stock holders only care about money.  If the dude on top isnt making the numbers go up then they fire him and get someone else in.  Welcome to the new standard.",
            "title_similarity": "0.6109283",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h2sja0z",
            "score": 2,
            "text": "Retail employees get a ridiculous amount of abuse on a daily basis. I’ve been belittled, insulted and physically threatened more times than I can remember and I just work in a restaurant. I’ve seen the same happen to my colleagues. If you feel like every place is giving you bad customer service, maybe you’re the problem or part of it?\n99% of places are following government guidelines, and places do get fines if caught breaking these rules.  It’s not the employees or even business owners decision in most of the cases, just following the current rules.",
            "title_similarity": "0.7554935",
            "sentiment_compound": -0.9538
        },
        {
            "id": "h2skqhk",
            "score": 3,
            "text": "No one will see this but in the US Aldi stores private listed individual stores phone numbers so they were unfindable to customers/anyone that might need it. The corporate number wouldn’t connect you to a real person for months. This changing the phone number thing also seems to coincide with not paying for work done by independent contractors. So independent contractors would try to call the store they did work for and either couldn’t find it or if they did have a number from when they were hired, it no longer worked. So then contractors would try to contact corporate to get past due invoices paid and you couldn’t get anyone on the phone. Now they have a new call menu for the listed corporate number and it tells contractors to just go into the store and talk to the manager on duty about it. However; the phone number for the store is still unlisted CaUSe CoViD so you can’t call to see if a manger is even at the store before you head there to try to get payment from work completed over 6 months ago. Oh and mailing notices to corporate who was supposed to pay in the first place were left unanswered and unpaid. I can’t imagine how many small businesses they managed to fuck over with this tactic.",
            "title_similarity": "0.68552",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h2slczf",
            "score": 1,
            "text": "oh no, you have realized why people were against working for those kinda people and why they don't like them",
            "title_similarity": "0.72084403",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h2slnft",
            "score": 1,
            "text": "I work for a local company. For some products we handle the first year warranty and for others like electronics and appliances we have contracts with the manufacturer to handle it so yes you have to go to the manufacturer if it breaks outside our return policy. Getting mad at us isn't going to change the fact that due to legally binding contracts we literally cannot do much to help other than offer to talk to the manufacturer for you, and even then you need to realize we also have hundreds of customers with claims ahead of you who we have to help first. Our department is literally build for handling customer issues and complaints and covid has made things higher volume.\nManufacturers are having more trouble getting products out and we have dealt with backorders on product with some customers waiting since January for product and we literally have zero control over it other than offering full refund or reselection to item that might have better availability. We do not physically make the products ourselves we have factories contracted to make some products for us and some big names like Samsung to let us retail other products and all of them have been experiencing issues.\n\nCovid fucked up a lot and even though a big portion of life is back to normal, covid backed up A LOT of orders to begin with and we are all still playing catch up while still trying to make the ability to purchase product possible even at the expense of a long wait.\n\nNo one is being lazy, you're just assuming it's laziness and excuses because you don't understand everything that has been effected and the long-term effects still being felt. \n\nIf you want product without a long wait go to Walmart or home Depot, national brands that can afford to pay to expedite and take priority for manufacturers but for my company which is in multiple states but is not a national chain, we may be a multibillion dollar company but we can't afford to compete for priority with bigger brands like Walmart, target etc. \n\nWe aren't lazy we are understaffed and doing the best we can to help but some things are out of our hands and swearing and accusing a minimum wage worker of being lazy and not caring because you weren't affected by covid outside of not being able to go out to eat and movies is so tone deaf and privileged. \nIf you're nice and understanding about it maybe we will give you a discount but we aren't gonna offer or fulfill one if you're a jackass accusing us of lying or being lazy about shit you have no idea about because you don't work for our company. \n\n\nI get cursed at every fucking day by people like you that think I can wave a magic wand and have their product appear from the factory but it doesn't work that way and we have no control over it while the manufacturers get through their backlog. All I can do is try to instruct our stores to be more open about the backorders and not brush off the severity in favor of making their commission and try to work with you to give you timely updates but I can't control the date it actually arrives in store. No one in our company not even the owner has that power. It's out of our hands. \n\nUgh. This is my day off too fuck you for making me mad about work on my only day off this week.",
            "title_similarity": "0.7079141",
            "sentiment_compound": -0.9338
        },
        {
            "id": "h2smsme",
            "score": 2,
            "text": "Look up the bullwhip effect.  Essentially the size of reaction to changes in demand will increase with every step back to the manufacturing company.  As demand dropped off for a month everyone cancelled production orders which compounded due to the bullwhip effect.  As a result little was made as no one wanted to take risk, when things resumed there was no more inventory in the pipeline and whole supply chains has to start up again from 0.  I equate it to stopping and starting a car.  You can break from 100-0 faster than it takes to get back to 100 and it takes much more energy.  Global supply chains work great when we are all going 100.  They are not great at getting from 0-100 if stopped.",
            "title_similarity": "0.7186061",
            "sentiment_compound": -0.6706
        },
        {
            "id": "h2smzgb",
            "score": 1,
            "text": "While I would agree with you for MOST cases this happens - I don't blame businesses that were forced to rethink their business model or supply chains. Here's a nice video explaining the shortages across industries and how they have less to do it with covid directly now but more to do with how covid fucked with supply chains semi-permanently. https://youtu.be/b1JlYZQG3lI",
            "title_similarity": "0.76945335",
            "sentiment_compound": -0.7377
        },
        {
            "id": "h2sntzx",
            "score": 1,
            "text": "How exactly do you want your view changed here? \"Numerous companies\" is incredibly vague and difficult to dispute.",
            "title_similarity": "0.62212986",
            "sentiment_compound": -0.7056
        },
        {
            "id": "h2sro4q",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2ssi58",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2stah8",
            "score": 1,
            "text": "Look up our finate world",
            "title_similarity": "0.17100966",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2szd3u",
            "score": 2,
            "text": "I work for a flooring distribution company.  While the disease \"Covid-19\" is not directly responsible for a lot of the delays we are experiencing, the aftermath of the disease is still responsible.\n\nExamples: \n\nA **major** dealer located in NY is still operating at minimum capacity as required by law there.\n\nWe can't get anyone to work in the warehouse, they're still collecting copious amounts of unemployment.  Meaning we are grinding our minimum staff just to receive in backorders and ship out new orders.  \n\nOther examples for long lead times that I don't know the reason for (enlighten me please):\n\nRaw material shortage, lumber shortage.",
            "title_similarity": "0.742309",
            "sentiment_compound": 0.0098
        },
        {
            "id": "h2t0rkv",
            "score": 1,
            "text": "So so true.",
            "title_similarity": "-0.09518758",
            "sentiment_compound": 0.5222
        },
        {
            "id": "h2t199f",
            "score": 2,
            "text": "A lot of companies no longer have a phone number that you can call.  I work in IT and my company provided us with headsets and a software so that we can take calls from home.  It is entirely possible, some companies just saw an opportunity to no longer take phone calls.",
            "title_similarity": "0.63403845",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2t8jc4",
            "score": 2,
            "text": "I realise this won't apply to all aspects of the service industry but in some cases I believe COVID19 has improved customer service.\n\nI work in luxury department stores as a sales associate, and in my experience I've seen customer service across multiple stores improve. Partly out of a desire to make the most out of diminishing customers, partly because we have emptier stores and more time, and partly because we have to be more conscientious about how we look after customers health than we ever were before.",
            "title_similarity": "0.66362983",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h2t8td1",
            "score": 1,
            "text": "It's either sit down and wait while these companies sanitize everything in sight and create delays or return to pre-covid and deal with the health conscious Karen's who will complain about \"unsafe\" working conditions and protocols...",
            "title_similarity": "0.7801669",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2tc2y1",
            "score": 1,
            "text": "I work back office customer service, I delegating escalations to different departments for a major electronics company in the Netherlands. The problem is that instead of adjusting to the pandemic it was business as usual. Which of course led to greater number of unsatisfied customers and we just kept making promises to customers we couldn't keep. However people  have definitely gotten a bigger stick up their ass and not allowing room for delay given the pandemic. Messaging our CEO won't do shit. Have we used the pandemic as a crutch? There was probably some laxness but we genuinely try to provide the best service. That said fuck big corporations.",
            "title_similarity": "0.7698847",
            "sentiment_compound": 0.2411
        },
        {
            "id": "h2tcmqi",
            "score": 2,
            "text": "A lot of business has been incredibly slow because of a staggering effect of Covid on industries over months. For example, numerous companies are unable to obtain the proper resources to build certain machinery - the company that would outsource manufacturing to a country that is struggling with vaccinations and other health problems (India, for example). The lack of building materials that is usually manufactured in India therefore causes the OG company asking for the materials to have to force clients to wait. And these companies can’t turn to another company to source that material instead, as many companies already bought these parts in advance. This on the client side makes service and other businesses a poor experience.",
            "title_similarity": "0.7844958",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h2tdw6u",
            "score": 1,
            "text": "this is by far the dumbest CMV I've seen",
            "title_similarity": "0.49545455",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2tdwjo",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25911325"
        },
        {
            "id": "h2ti1s4",
            "score": 2,
            "text": "Super specific example that will probably get downvoted… my sister in law sends her kids to sleep away camp in another state. It’s common practice for these camps to accommodate children coming from other places by having a chaperone pick up the kids on the group flight from the airport and take them to the camp. This year the camps are not doing so “due to covid” so the parents have to either chaperone the kids themselves or work out alternative transportation on their own for their child or forgo sending the child to camp. Very first world problem obviously but such a dick move (and possibly stupid biz decision) to take away this service when the parents are already paying a bunch to send their kids to the camp. At that point why not just forbid kids from flying to camp if you’re concerned about Covid?",
            "title_similarity": "0.67034626",
            "sentiment_compound": -0.7986
        },
        {
            "id": "h2ti6hf",
            "score": 2,
            "text": "“Never waste a good crisis”",
            "title_similarity": "0.15287578",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2tmjxl",
            "score": 1,
            "text": "Confession time: I work as a waitress and whenever someone asked for their meal for takeaway I just bring them a takeaway box and a bag and say that I’m not allowed to pack it myself because covid. It’s not a rule in my restaurant. It just takes so fucking long to pack up",
            "title_similarity": "0.59704673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2tn9f0",
            "score": 1,
            "text": "I've notices that there is less product in my hummus container, and the thickness is decreased. Something so small , but really obvious when ur trying to not have watery hummus.",
            "title_similarity": "0.55524564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2tpbon",
            "score": 1,
            "text": "I assume you are from the US. And the only people to blame are the law makers not safeguarding your rights. Go anywhere in Europe, and consumers are legally protected in instances of faulty products. Giving you the right to a full refund, exchange or full repair. \n\nBut your assessment of Covid coming to a close seems pretty naive. Because what's the measurement of the impact caused by Covid returning back to normality look like? \n\nCustomers are demanding more than they did before. Affordability. Availability. Safety. Time dependent. Convenience. Etc etc. All whilst stores are running with fewer staff numbers. Fatigue. Extra obstacles. Communication difficult with masks.\n\nI mean I work in car rental. We went from checking out 300 cars a day on average to only 10. Our availability and selection is limited because we obviously sold everything we didnt need and will only buy what we do need. Customers come in thinking we have 3000 cars in a field because no one is renting. Didn't anticipate we would only keep a sufficient volume of vehicles to run a high utilisation.  Or the occasions that customers return their vehicles late or unrentable, these same customers get pissy a few weeks later collecting their next rental because there is a small delay in preparing their vehicle.... I mean. Customers are the worst. Our expectations and impatience is what's contributing to killing businesses also.",
            "title_similarity": "0.7653584",
            "sentiment_compound": -0.9785
        },
        {
            "id": "h2tq8ep",
            "score": 1,
            "text": "Bruh, until money stops ruling you, this shit's only going to get worse.  \n\nCoViD-19 has nothing to do with it, businesses are incentivized to get away with absolutely whatever they can to reduce costs or increase revenue, and when your government is elected by money provided by businesses, there's no one to stop them getting away with whatever they want.  I'm sorry to be the one to have to tell you, but this is what capitalism does whenever and wherever it's unregulated.\n\nYou've awarded deltas for things like JIT manufacturing, without asking: why is JIT manufacturing an important process?  Because it *saves someone a fucking buck* in predictable times at the expense of our society's resilience in tough times.\n\ntl;dr the problem isn't that CoViD makes things tough, the problem is we already made things maximum tough on ourselves in the name of \"efficiency\" (read: another yacht somewhere) so we have *zero* flex when the unexpected happens",
            "title_similarity": "0.687367",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2u3yjl",
            "score": 2,
            "text": "I would not call it laziness, I think management is capitalizing on a reason to reduce workforce and expenses.  Companies have found that the job can be done with fewer people and changing policies, increasing profit margins.  These changes have caused complaints from employees and customers, yet the bottom line speaks loudly for middle and upper managers.\n\nI work as a store manager, my company urged fiscal caution at every turn during Covid.  Our business level did not drop.  We laid off our staff from 8 full-time employees to two.   At the same time, the excitement of soaring profit margins could not be contained by my supervisor.  The new normal was to do more with less.  \n\nJust typing this out is irritating.  Good night and good luck.",
            "title_similarity": "0.73864806",
            "sentiment_compound": 0.9172
        },
        {
            "id": "h2udnyz",
            "score": 2,
            "text": "This is just companies trying to maximize profit, which they always try to do. Covid shows that they will use any excuse to do so.",
            "title_similarity": "0.49768215",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h358w9e",
            "score": 2,
            "text": "considering how badly its affected businesses, i think its definitely warranted and valid when companies say that their service has declined because of covid",
            "title_similarity": "0.762462",
            "sentiment_compound": -0.25
        }
    ]
}