{
    "CMV: There is a legitimate discussion to be had about trans men and women competing in sports.\nI was destroyed in the comment section earlier for saying I think there’s a fair discussion to be had about trans folks and sports. Let me be clear I wholeheartedly support the trans community and I want trans people to be accepted and comfortable in all aspects of life including athletic competition. That being said I’m not aware of any comprehensive study that’s shows (specifically trans women) do or do not have a competitive edge in women’s sports. I hope I don’t come off as “transphobic” as that’s what I’m being called, but I don’t have an answer and I do believe there are valid points on both sides of this argument.": [
        {
            "id": "h2vhcxm",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\r\n\r\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\r\n\r\nWe are actively cleaning up the thread now, and will unlock it shortly.\r\n\r\nThank you for understanding.",
            "title_similarity": "0.6385964",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h2s98di",
            "score": 28,
            "text": "I'm a man.   This isn't our problem.  If a human that was born female wants to compete against me because they now identify as a man; go for it and I will show you no mercy. \nFor \"women's sports\" that is to say the inverse when a human born male wants to compete against women it's for the women to decide.    \nMuch like abortion issues this isn't a question for men to decide; we need to step away and let women make these  choices.",
            "title_similarity": "0.8019012",
            "sentiment_compound": 0.3915
        },
        {
            "id": "h2s96ru",
            "score": 330,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2s9k1a",
            "score": 11,
            "text": "I think this topic is totally overblown. There is no need to have laws one way or another. Why not just let the sports leagues deal with it on their own? The reason this even causes any controversy in the first place is because you have conservative governments trying to ban people from playing sports when it's really just a non-issue for the most part.",
            "title_similarity": "0.6631349",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h2s8elg",
            "score": -6,
            "text": "Here's the thing to think about...  \n\n\nWe left handed people participate in fencing events.  \n\n\nLeft handed people have an unfair natural advantage against the more numerous right handed people.\n\nNobody complains about this.  \n\n\nSo clearly a certain amount of \"competitive edge\" **is** acceptable.  \n\n\n&#x200B;\n\nAll that needs to be done is figure out how much and prove that being trans falls within the same amount.",
            "title_similarity": "0.6195928",
            "sentiment_compound": 0.7687
        },
        {
            "id": "h2svtj9",
            "score": 4,
            "text": "A legitimate discussion? What if that discussion is no longer relevant in a few years? More and more young trans people are taking puberty blockers. And since athletes cannot complete well after a certain age, that means in theory very soon trans athletes will all have taken puberty blockers and then hormones so they never will have developed the secondary sex characteristics that would change how well they do in a sport.",
            "title_similarity": "0.7452299",
            "sentiment_compound": 0.1396
        },
        {
            "id": "h2s6z19",
            "score": 12,
            "text": ">That being said I’m not aware of any comprehensive study that’s shows (specifically trans women) do or do not have a competitive edge in women’s sports. \n\nFair discussions typically begin with evidence and facts, no? If there haven't been any comprehensive studies on it, then there really isn't much evidence, so therefore, there really isn't much legitimate discussion to be had is there?\n\nSeems to me it would be better to learn about the issue then discuss it. Otherwise it's just unsupported conjecture based on personal assumptions and biases.",
            "title_similarity": "0.7681295",
            "sentiment_compound": 0.3822
        },
        {
            "id": "h2t896o",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2teouj",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2tnuxd",
            "score": 0,
            "text": ">That being said I’m not aware of any comprehensive study that’s shows (specifically trans women) do or do not have a competitive edge in women’s sports\n\nSo we need to exclude trans people until this study that hasn't happened eventually maybe happens?  A study so comprehensive that it covers every sport?\n\nAnd how will this study work if trans women aren't able to compete in sports in the mean time?\n\nIf you think there is a study that needs to be done, push for the study.  There is decades worth of sports results data from trans athletes already there.  Push to get it analysed and show whether this problem even exists.  When you have the results, *then* we can talk about excluding a vulnerable minority from a right everyone else has. Pre-emptively excluding trans people because \"we just don't know\" is exclusionary to a vulnerable minority, with real world impacts here and now, to avoid a problem you don't even know to exist in the first place...",
            "title_similarity": "0.862283",
            "sentiment_compound": -0.8056
        },
        {
            "id": "h2u4s0a",
            "score": 0,
            "text": "I'm not going to downvote or try to say you're a transphobe, as on the outset, when you first hear about this topic (especially from one particular 'side' of the debate) you can certainly look at it as a common sense thing.\n\nI suppose, the only thing i will say on it is \"ok, what about everything else?\"\n\nI.e, the argument here seems to be that trans athletes have an unfair advantage in sports.\n\nI would make the case that this is very much a rare occurrence, otherwise western womens' sports would be dominated by trans women, which it certainly isn't.\n\nSo if the issue is not that we're anti-trans, and that unfair advantages are what we're worried about, why can't we talk about issues that are... sorry, but, more important?\n\nLike [Transgender employment rates?](https://www.thetaskforce.org/transgender-workers-at-greater-risk-for-unemployment-and-poverty/)\n\nor greater [likelihood of murder](https://transequality.org/blog/murders-of-transgender-people-in-2020-surpasses-total-for-last-year-in-just-seven-months), or [Sexual assault](https://www.abc.net.au/news/2020-06-26/study-finds-high-sexual-assault-rates-for-trans-women-of-colour/12395226) or any other [number of disadvantages](https://en.wikipedia.org/wiki/Transgender_inequality) that transgender people face?\n\nIn case anyone is confused, *this is why people assume you are transphobic* when you talk about this issue, even though you may not feel like you are.\n\nBecause the whole problem is a right wing talking point, and not much else.\n\nLike, I care about inequality in general, and if trans women were absolutely crushing women's sport, because of higher T levels and bone structure, then i might see it as a problem. But they simply aren't. It is really just such a non-issue that appeals to conservative talking points because of how simple it seems as a form of inequality that also seems like a new modern issue. Same as the \"Transgender bathroom\" problem - it's a non-sequitur disguised as a massive problem, because it allows talking heads to thump tables.",
            "title_similarity": "0.8705916",
            "sentiment_compound": -0.9212
        },
        {
            "id": "h2snubj",
            "score": -1,
            "text": "There is,however it has been done mostly to justify transphobia and directing hatred towards trans peope including the massive number of bills directed towards trans children. Some have severe consequences for doing anything to help them out rather than tormenting them or trying to basically get them conversion therapy which has been shown many times to not work. One even allows genital inspections on children. Grown adults making kids take off their clothes to examine their genitals. That sounds pretty damn wrong. These people are not doctors or anything and they really do not have good intentions. This just humiliates and violates these kids. There’s no way it will happen only to trans kids either. They will suspect cis kids who “don’t look like their gender.” So very tomboyish looking girls and things like that. There’s so much potential for abuse that it is inevitable that it will happen. \n\nWhat people don’t realize is that bribed trans isn’t a one size fits all thing and it doesn’t necessarily give them an edge in sports. A trans man playing with cis men could very easily be way outperformed. \n\n\nThis issue is also bringing out a lot of sexism because it assumes all cis women are physically weak when that is really really not true and insulting.",
            "title_similarity": "0.67179966",
            "sentiment_compound": -0.9465
        },
        {
            "id": "h2tvmiu",
            "score": 0,
            "text": "Whether they have an advantage or not is a pretty bad justification. Individuals always have advantages/disadvantages versus their competitors. That is the very nature of sports.\n\nWhenever you create \"divisions\", you always create subgroups of participants... in which there is still variability.\n\nIf you take the position that it is bad to have members in your division be better than others, then you need infinitely granular divisions with only one person each, so that is a non-starter.\n\nIf you take the position that it is ok to have members in your division be better than others, then you should be ok with a trans person potentially having some advantage.\n\nTo make things more concrete, I am not particularly athletic. I don't go around complaining that it's unfair for genetically more muscular people to be in a division with me because I want to win at sports.\n\nAnd, what's even more importatn, really - I don't go around arguing that making \"sports\" more fair for people like me justifies denying the identity of other people.\n\nIf you do want to have divisions so more people can be competitive, why not just make them based on a non-identity-denying criterion, like weight classes or ELO score?",
            "title_similarity": "0.7390621",
            "sentiment_compound": 0.9436
        },
        {
            "id": "h2sqcgr",
            "score": 66,
            "text": ">That being said I’m not aware of any comprehensive study that’s shows (specifically trans women) do or do not have a competitive edge in women’s sports.\n\nIt should be noted, that while others posted such studies, there is another big angle of this: \n\nEven if one could poke holes in such studies, and imply that trans women may yet have some lingering possible subtle advantage over other women, so do other women have advantages over each other. \n\nThere COULD be interesting legitimate discussions to be had about the philosophical principles behind dividing sports into \"fair\" categories. \n\nWhy do we have weight classes in wrestling and boxing, but no height classes in basketball or horse jockeying?  \n\nWhy do we have paralympics for disabled people, but no special olypics for people whose bodies are only *mildly* shittier than those peak superhuman pro athletes? \n\nWhy don't we have different leagues for people of different races, that strongly correlate with performance? \n\nUltimately the answer to these is that sports are a social construct, and it's up to us what communities we want to go out of our way to represent, otherwise it is inevitable that most people in the world don't have a chance to compete in an open league. \n\nThe anti-trans position has to keep going on about how men are super strong and women are super weak, and never the twain shall meet, otherwise, if we are talking about subtle arbitrary dividing lines between fair and unfair advantages, they would have to get into openly spelling out that they don't see trans women as women and that's it.",
            "title_similarity": "0.82824266",
            "sentiment_compound": 0.9008
        },
        {
            "id": "h2t8zp0",
            "score": 24,
            "text": "I think it warrants discussion, but it's a discussion that has already be done. The International Olympic Comitee and international regulators of most sports have already reached a conclusion. Both trans women and trans men can compete in their respective sports categories if they fulfill certain conditions. They include having transitioned and their hormone levels being within certain limits. Those conditions ensure a level playing field and there hasn't been any problem as of now.\n\nI can perfectly understand why some people may doubt about it, specially if they don't know that. However, what I perceive is there are some transphobic groups who are trying to reopen a debate that's already closed in any serious institution and to drag uninformed people with it. They want to ban trans people from sports period. This isn't supported by science at all. It has been debated scientifically and a fair decision has been made.",
            "title_similarity": "0.8568582",
            "sentiment_compound": 0.9568
        },
        {
            "id": "h2t9jvp",
            "score": 59,
            "text": "Are we looking at this from a purely political standpoint or science based standpoint. I am certainly no expert in this area and I think some concerns are valid but I do want to ask about the biological advantage standpoint, my thoughts are\n\n• doesn’t Michael Phelps produce half the lactic acid (naturally) than his opponents? His limbs also give him an advantage biologically. Right? Should he have been penalized for that? Or should his opponents be able to have some kind of head start? Something to ponder. How would one adjust for this. \n\n•many intersex people have a condition called “Complete androgen insensitivity syndrome occurs when the body cannot use androgens at all. People with this form of the condition have the external sex characteristics of females, but do not have a uterus and therefore do not menstruate and are unable to conceive a child (infertile).”  Should they be able to compete as a male? Or female? How do we determine this? Just ask them to drop their pants?\n\n•PCOS. A condition affected biological females..Dr’s believe that high levels of male hormones prevent the ovaries from producing hormones and making eggs normally. Genes, insulin resistance, and inflammation have all been linked to excess androgen production.” How should these women compete? With men? Should it just be based on hormone levels? That’s also extremely complicated \n\n• Olympics have had strict trans inclusive guidelines for almost a decade ? Edit: since 2004!! Can you name how many trans athletes have won ? Or have even competed? Can you name even one off the top of your head?\n\n•I believe the NCAA also has had trans inclusive policies in place for years now. Edit: since 2010z Again, can you name any athletes that have outperformed non trans competitors? How many have participated?\n\n•much of the time when these stories make headlines it’s purely political, fear-based nonsense. To make a buck. To get a few clicks. 99% of the time the talking points are coming from political commentators who don’t really care what the outcome is. \n\n•suicide rates among trans youth are absurdly high. Trans inclusive policies saves lives. Edit: source, In a national study, 40% of transgender adults reported having made a suicide attempt. 92% of these individuals reported having attempted suicide before the age of 25.3 https://www.thetrevorproject.org/resources/preventing-suicide/facts-about-suicide/",
            "title_similarity": "0.6749065",
            "sentiment_compound": -0.8735
        },
        {
            "id": "h2tpqde",
            "score": 1,
            "text": "No, there need not be any discussion. Here's the question without changing it to be politically correct:\n\nShould biological men compete in women's sports?\n\nNo, and that should be the end of the matter.",
            "title_similarity": "0.6752809",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2tz0vt",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2t3drp",
            "score": -4,
            "text": "No there isn't.\n\nThe Olympics and similar events have reasonably clear cut rules and they sum up to men in one category, women in another and invalids in the Paralympics.\n\nThere is no discussion, that is it.",
            "title_similarity": "0.6085123",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2t1j73",
            "score": 2,
            "text": "I have been thinking about this a lot lately and r/TooAfraidToAsk. And I can’t help but think about the article I read of a girl who was the top track and field athlete in her state and lost 5 titles just behind a trans woman. I just feel really bad for the other girls I can’t imagine how that’d feel",
            "title_similarity": "0.6237531",
            "sentiment_compound": -0.7261
        },
        {
            "id": "h2trff9",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2svwhd",
            "score": 25,
            "text": "I think the only reasonable compromise that can be made is that men and women cannot compete in the opposite gender's sports if they went through their biological gender's puberty",
            "title_similarity": "0.7112826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uh2y1",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2tgc4j",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2takvv",
            "score": 155,
            "text": "I used to work for a guy that is now a representative. He was approached by a stranger at his church to run for office. They funded his campaign and the smear campaign of his opponent. Once in office they handed him a piece of legislation to ban trans athletes and told him to push for it.\n\nHe told me this story himself. I asked him why during a global pandemic he was fighting for this. “Student safety”.\n\nI asked him how many students were injured by trans athletes in our state. He didn’t know.\n\nThen I asked him what other measures they are taking to make sports safer for students. Anything to reduce head injuries or over training? “No plans yet but that’s a great idea for the future” he said.\n\nSo, yea there is legitimate discussion. But make no mistake, this is being pushed for by the religious right for bible reasons not by people concerned for students safety.",
            "title_similarity": "0.65847814",
            "sentiment_compound": 0.8463
        },
        {
            "id": "h2sxmr9",
            "score": 1,
            "text": "There really is no Men's and Women's leagues other than a few sports (gymnastics, figure skating, etc). There is an open league allowing anybody to participate and there are Women's leagues only allowing women to participate.  If you want to get all technical, then women's leagues are sexist for not allowing men at all whereas the open league allows anybody to compete.  Unless you were born a woman, you should only be eligible for the women's league, and everybody else is eligible for the open league.  It should be as simple as that.  Nobody should be guaranteed allowed to compete professionally.  I can't just create an NBA league for people under 6' and be expected to be paid for it.  If you can't cut it in your league, play pickup or recreationally like 99% of the people do already.",
            "title_similarity": "0.735258",
            "sentiment_compound": 0.4062
        },
        {
            "id": "h2tjlp3",
            "score": 2,
            "text": "Men competing in women sports and vice versa its completly unacceptable and unfair! I really cant belive this is happening. You dont want to compete in your ,,biological” league? Create a trans league and the problem is solved.",
            "title_similarity": "0.78856295",
            "sentiment_compound": -0.7281
        },
        {
            "id": "h2tq0ka",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2trz6b",
            "score": 0,
            "text": "It's not fair, imo. Just because ur trans doesn't mean that ur DNA isn't male, which is naturally stronger and faster than females. Therefore, they will always have an advantage over biological females.",
            "title_similarity": "0.6915601",
            "sentiment_compound": 0.3895
        },
        {
            "id": "h2txobp",
            "score": -2,
            "text": "There is a legitimate discussion to be had. But it's by experts like those at the IOC who have already ruled that trans athletes can fairly compete in sports like weight lifting.\n\nThe problem is when non-experts keep pushing the issue even when they don't know anything about it. If you have a degree in sports science or a related field, and you question the IOC ruling or any other athletic governing body, then maybe you're acting in good faith. Otherwise, it's pretty disingenuous.",
            "title_similarity": "0.78898674",
            "sentiment_compound": 0.9413
        },
        {
            "id": "h2ubgzl",
            "score": 6,
            "text": "I’m not sure what the discussion would be. You must compete against the gender of your birth. There is an insane number of reasons why. Bone density is a huge one. T levels... not to mention the hormones they take. The vast majority of male to female trans people -dominate- the real women they face... and in reverse the female to male trans folk largely get dominated by the actual men they face. Either one is wrong. Just ask the combat sport community.\n\nWhat’s -really- worth discussing, is how it’s become so commonplace to punish people for freely speaking their minds on subjects like this that people have to fear mass reprisal for simply taking a different philosophical position. IMO? LGBT community is harmed greatly by virtue signaling and a complete lack of objectivity when discussing their issues.",
            "title_similarity": "0.73855793",
            "sentiment_compound": -0.8643
        },
        {
            "id": "h2snza5",
            "score": 0,
            "text": "Well honestly this would do best to start at the fundamentals and test where the resistance occurs starting from basics all people agree upon and expand from there.\n\nOff the top of my head:\n\n1. Maybe my most solid point:   \nTransgender athletes are most similar in Biology/ natural ability to and competitive against other transgender athletes.\n2. We agree generally men and women should have separate leagues of sports competition.\n3. It is not an issue for women and men to compete against each other in intellectual domains.\n4. It is a non issue if a woman plays in a male dominated sport and the female may be competitive but she is usually not an immediate champion..\n5. A male is not allowed to compete against women because it is understood he has a generally higher level of athletic/ physical ability due to his Biology.\n6. It is easier for a man to win a competition when physically competing against women vs when competing against men.\n7. A winners circle being dominated by individuals sharing a common characteristic is not a coincidence.\n8. Competitions usually separate people to establish competitiveness within the competition and place participants against those of similar ability.\n9. Weight classes exist to help support having people of similar capabilities compete against each other. Yes a 220lb man can beat a 300lb man in some competitions, but this is not the normal arrangement for a good reason.",
            "title_similarity": "0.8691152",
            "sentiment_compound": 0.9935
        },
        {
            "id": "h2thj2k",
            "score": 0,
            "text": "What I find irritating even in these \"legitimate duscussions\" that do occur, is that they often simply dismiss the transgender people who haven't physically transitioned or don't even desire to do so. So even if an argument of testerone and it's effects is made (in benefit of either side) it still doesn't address the entire populace of transgender persons.\n\nAnd that just makes the debate over segregation of the leagues based around hormones and physical development (which is more in line with sex), not gender identity, even though that's how the debate is always framed. We don't seem to be discussing being trans (based upon gender identity), we are discussing physically transitioning one's sex.m and thus when one becomes \"enough of the sex\" to qualify. \n\nAnd from those that *do* wish for gender identity to actually drive all, I don't think they even have the support from many others that often do support the \"LGBTQ agenda\" with an immense furvor. So that's why they aren't present in the discussion. **And I think that is because they lack valid points that competive sports should be segregated on the basis of personal identity.**\n\nI think the discussion has shifted to those physically transitioning sex. And that's unique from being transgender. A male can physically transition to female without being trans. Being transgender is based around a gender identity, not the desire to transition sex. And you hear that repeated all the time when discussing trans topics at length, but when it comes to sports it seems to be completely disregarded.\n\nEven the bathroom discussion seems to often settle on \"Trans people have been using the bathrooms they've desire for decades so why stop them now\", but that only addressed those that *present* a certain way and not all trans people desire to present to the gender identity they prescribe to. Desiring to segregate bathrooms on the basis of presentation would be a different argument of one based on personal identity. \n\nSo many keep stating \"trans\" or \"gender identity\" protections/rights in these specific instances, but rarely actually make arguments in favor of such. And I'm coming to the conclusion, in an attempt to change your view, that such hasn't been happening because there isn't a legitimate discussion to be had for such.",
            "title_similarity": "0.7274151",
            "sentiment_compound": 0.6977
        },
        {
            "id": "h2tiafp",
            "score": 0,
            "text": "My preference is to keep rules of behavior as straightforward and simple as possible. The science clearly indicates that if you pass through puberty as an average male you have a lifetime athletic advantage over the average female.  Muscle mass, bone structure, etc.\n\nNew Rule: If you pass through puberty as a male, you are banned from athletic competitions as a female. Simple, easy to understand and reasonably fair.",
            "title_similarity": "0.7344012",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h2tmnxx",
            "score": 0,
            "text": "Men have an obvious advantage over women in sports. Mens skin is on average ~20% thicker than a womens, men’s muscle fibers are denser, they have denser bones, they have larger lung capacity. None of this changes. It blows my mind that people don’t get this.",
            "title_similarity": "0.60480845",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2ttvfr",
            "score": 0,
            "text": "Well  to some, a trans person is still the gender they once were. WOmens rights have come a long way, for them to be destroyed by a guy that had a sex change so he can be faster, stronger and more athletic than a female is not the way to get your point across that trans people deserve equal rights",
            "title_similarity": "0.8093315",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2unzsk",
            "score": 0,
            "text": "I'm trans myself, and I somewhat agree. However, there are a few factors that turn conversation/debate into a complete clusterfuck.\n\nFirst, more often than not it ends up being led by transphobic people who don't otherwise give a crap about sports but happy to find a topic where they can look reasonable or justified in shitting on trans people, against trans people who want to enjoy sports just like anyone else and generally don't have a ton of knowledge on medical transition outside of what's relevant to them and bits of anecdotal evidence. There's a lot of complicated shit involved, the average person can't reasonably have a fully informed view.\n\nSecond, it's become a political/cultural thing, lot more going on than just biology. Hard for experts who actually know enough to have relevant views to get involved without being accused of bias by one side or the other. Sports are also a pretty big thing in general, so we're not just talking about who can fairly compete, but who can get access to scholarships, careers, and even become famous.\n\nThird, not every sport is the same. MMA, basketball, and golf are all completely different subjects, as well as very different levels of competition, huge difference between a casual sports club, high school team, and the Olympics. Hard to have a meaningful conversation when everyone is talking about different things.\n\nFourth, the idea that sports are fair in the first place, and that trans people are unique in possibly disrupting that, is nonsense. Not really much of a consensus on the much bigger issue of what we actually want to prioritize with sports, do we want them to be fair, inclusive, or whoever's best, and casual or competitive, for fun or for careers.\n\nOverall, there's way too much going on with sports to really come to an answer that all or most people will accept. Having the conversation over and over again doesn't really help anyone. Better to just let the organizations actually able to make these decisions nake the best judgements they can, and go with that, much more important things to worry about anyways.",
            "title_similarity": "0.8249571",
            "sentiment_compound": 0.9941
        },
        {
            "id": "h2tdrsk",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.032677636"
        },
        {
            "id": "h2toid2",
            "score": 52,
            "text": "I don’t think there’s really a discussion to be had here. To say that trans women don’t have a major natural advantage over biological women is complete science denial. It’s obvious that men are more athletically gifted than women. How many women have run 100m in less than 10 seconds? None. And how many men? Hundreds.\n\nAnd as for taking hormones, etc.: imagine if a 7 footer, who can’t make an NBA roster, transitioned and played in the WNBA. No matter how much hormonal treatment he gets, he’ll still be a 7 footer who can run and jump, meaning that he would be the greatest WNBA player ever.\n\nThe reason why trans women currently aren’t dominating women’s sports (yet) is because not many people transition and especially not many elite athletes. Not a single top50 athlete has transitioned and competed in women’s sports yet. But still you have many trans women who are the best or close to being the best at their sports.\n\nLastly, if you’re not convinced by any of these arguments, Google: giant trans athlete (or something similar) and you’ll see just how ridiculous this advantage can be.",
            "title_similarity": "0.6886895",
            "sentiment_compound": 0.9071
        },
        {
            "id": "h2t6qed",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.032677636"
        },
        {
            "id": "h2tos6l",
            "score": 0,
            "text": "Discussion, sure.\n\nBut there’s no legitimate reason for legislation, and sufficiently even handed legislation is impractical.\n\nLeagues and tournaments will make their own rules.  They already do.\n\nGetting the government involved in what amounts to individualized personal medical determinations about whether or not you’re woman enough, is a terrible idea.  \n\nThere’s enough variability that any blanket rule will inevitably disenfranchise some people, and the testing needed to make fair determinations would be ridiculous to perform on children.\n\nSally is winning, so some Karen on the other team starts rumors and now Sally is required to go get invasive sexual testing done?  Ripe for abuse.",
            "title_similarity": "0.71683156",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h2uqp3c",
            "score": 3,
            "text": "After 2 years a trans person muscle mass is similar if not exactly the same as their cis counter parts. And sports in general is unfair in general basketball is a great comparison to it.\n\nInstead of just gender it could further be divided by weight and height",
            "title_similarity": "0.60337496",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2thyz6",
            "score": 18,
            "text": "As a 6'6 230 lb man I don't think it would be fair for me to decide to be a woman and compete regardless of the surgery I've undergone\nAt 30 I've already grown and developed into a large person with the muscle mass of someone with high testosterone for 30 years",
            "title_similarity": "0.60027105",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2u1qk6",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.032677636"
        },
        {
            "id": "h2s6vry",
            "score": -1,
            "text": "Can you expand on what you mean by \"legitimate\"?",
            "title_similarity": "0.24227126",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2tjs59",
            "score": 1,
            "text": "Some high schools/colleges are allowing 'social trans' (as in, they say they identify as 'other sex' but have not begun the hormonal process) allowing trans to compete. This presents an insurmountable challenge for females at birth. \n\nThose that have completed the transition, there is a, at the minimum a 10% advantage for males-at-birth. \n\nMegyn Kelly podcast had two people, a trans advocate who has studied tgis issue, an anti-trans-in-sports supporter for a fair discussion. Regardless of her politics its a well discussed podcast that is fair to both sides. Check it out.",
            "title_similarity": "0.8177817",
            "sentiment_compound": 0.9209
        },
        {
            "id": "h2tkguy",
            "score": -1,
            "text": "Why the hell would we let a trans woman compete in womans' sports, and why the hell would a trans man want to compete in mens' sports.",
            "title_similarity": "0.79570323",
            "sentiment_compound": -0.872
        },
        {
            "id": "h2troqt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.032677636"
        },
        {
            "id": "h2v7saj",
            "score": 1,
            "text": "It's such a non-issue that the right claims is epidemic to rial up its base. \n\nLike honestly, who cares? It's just sports. It don't matter.",
            "title_similarity": "0.5751941",
            "sentiment_compound": 0.8139
        },
        {
            "id": "h2u1wx9",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "-0.032677636"
        },
        {
            "id": "h2tf342",
            "score": 215,
            "text": "I'm transgender (male to female). \n\nMy personal belief is that a blood test should be necessary to allow MTF transgender kids to compete with cis girls. FTM transgender kids wouldn't need to do this, as their hormone levels would never be able to create a physical advantage over their teammates and opponents. The blood test would have to show that their testosterone levels are closer to that of a female than a male.\n\nThe simplest way to put it: Testosterone is a PED. I've been on T-blockers and Estradiol for less than a year, but I feel a very significant change from before I did. My muscles decrease in size and strength at a consistent rate, my cellulite is more noticeable by the day, I'm far less pushy/aggressive, and I also have much less of a drive to win (video games, arguments, bets...). \n\nIf you have not transitioned hormonally, I do not believe that you can give a totally valid answer to this (unless you have clinical or peer-reviewed data).\n\nIf you're transgender and you think AMAB kids should just be thrown in with cis girls on a whim.... I believe you're just virtue signaling. \n\nTL,DR: Children should always be ALLOWED to compete with those who have an advantage over them. Children should never be FORCED to compete with those who have an advantage over them.",
            "title_similarity": "0.77566",
            "sentiment_compound": 0.9745
        },
        {
            "id": "h2u09zi",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2tp0hf",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2u13hq",
            "score": 5,
            "text": "You have qualifying rounds in car races to make sure the car is appropriate to compete in that 'weight class'. All sports should have qualifiers like this in some form appropriate to the sport in order to group people into the weight class they can compete in fairly.\n\nDone.\n\nYou don't even have to separate men and women anymore because who the fuck cares about gender in physical feats of strength, dexterity and teamwork.\n\nAnyone saying gender is important to sports cares more about the gender than people competing on an even playing field.",
            "title_similarity": "0.74046934",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h2tdrpl",
            "score": 1,
            "text": "Discussion is indeed needed but not in they way it’s happening now. We need to discuss “how” instead of “can” transgender athletes compete. When drafting rules we can set essentially limitless parameters to ensure fairness. Testosterone is only one aspect. In theory we can regulate BMI, body fat percentages, estrogen levels or any other factor. We could even incorporate weight variances when applicable (lowering a weight class), But these discussions only happen when we accept transgender athletes can compete. The discussion we’re having right now is if we should be discussing how to include transgender athletes. Now the rules will not be perfect immediately and there will be an unfair advantage at some point. That being said long distance running is having records shattered because of a new shoe. TLDR discussion is important but the discussion we are having right now is only delaying the one we should be having",
            "title_similarity": "0.81492746",
            "sentiment_compound": -0.6482
        },
        {
            "id": "h2sdgtq",
            "score": -3,
            "text": ">CMV: There is a legitimate discussion to be had about trans men and women competing in sports.\n\nThere isn't a legitimate discussion to be had because all the facts are known and the science is clear. There's nothing to argue. There are only those that wish to deny objective facts and push political opinions and those that wish to defend the sanctity. We no longer debate classical Newtonian physics anymore because there's no new additional information that needs to be or existing info that is to be debated.",
            "title_similarity": "0.8619454",
            "sentiment_compound": 0.5
        },
        {
            "id": "h2tfuyx",
            "score": 0,
            "text": "This is one of the more respectful posts I've seen regarding this subject. Thanks for that. I think that as long as trans women have completely medically transitioned, all surgeries, and they've been on HRT for a significant amount of time, they should be allowed to compete. \n\nHowever, in prepubescent children or teens on hormone blockers, who have never gone through male puberty, I see no reason for them not to be able to participate. They've never had more testosterone levels than any cis girls, and they're just kids. Let them have fun and get exercise.",
            "title_similarity": "0.7750164",
            "sentiment_compound": 0.8439
        },
        {
            "id": "h2thks3",
            "score": 0,
            "text": "I’m gonna start by saying this I’m not against lgbt community’s but I’m not for them either I do not care what you do. If a man identified as a woman fine that’s his choice but I feel like it should be more like a drug test thing if you are a biological male the you should have to compete with males and same for females you shouldn’t be able to cheat the system in anyway you want and play both sides of the field",
            "title_similarity": "0.7826704",
            "sentiment_compound": 0.6425
        },
        {
            "id": "h2tkh2u",
            "score": 0,
            "text": ">That being said I’m not aware of any comprehensive study that’s shows (specifically trans women) do or do not have a competitive edge in women’s sports.\n\nSo what if they did?",
            "title_similarity": "0.7119636",
            "sentiment_compound": 0.1235
        },
        {
            "id": "h2tkkdb",
            "score": 0,
            "text": "Anything we do here is transphobic, make a different league fir trans men and for trans women, entirely different from women and men, transphobic, have trans men (who were born as men but identify as women) be competing with men and trans women with women, transphobic, have no diffeeent leagues, all in one, thats the worst by far, because on that logic we should put the prisons together too, which is obviously bad, the men convicted for 50 woman raped and killed, be closed together with a woman convicred of petty theft, its so bad on so many levels",
            "title_similarity": "0.6865084",
            "sentiment_compound": -0.9901
        },
        {
            "id": "h2tp7kd",
            "score": 0,
            "text": "Yeah we can’t have discussions when everything even remotely controversial is being censored into oblivion, can we??",
            "title_similarity": "0.45805436",
            "sentiment_compound": -0.1431
        },
        {
            "id": "h2tqw3c",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2trd69",
            "score": 0,
            "text": "I honestly dont have enough knowledge to correctly discuss this topic so i generally dont. But I was wondering.. Would it be a practical sollution to just get rid of the genders in the olypics and maybe do like levels or just hormone levels? Kind of like weight classes in boxing or something. Seems too easy but im wondering what the arguements for or against this would be.",
            "title_similarity": "0.69954824",
            "sentiment_compound": 0.8981
        },
        {
            "id": "h2tsalv",
            "score": 0,
            "text": "Trans people should be allowed to compete in sports IF their hormone levels are balanced enough for it to be fair, so if you have someone who is MTF they should be allowed to participate in sports if their estrogen levels are high enough and their testosterone levels are low enough to make that all biologically fair",
            "title_similarity": "0.7768034",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2tse5u",
            "score": 0,
            "text": "hell nah",
            "title_similarity": "-0.049734507",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h2ty27v",
            "score": 0,
            "text": "I think the discussion has already been had for years now. Joe Rogan brought up this issue at least half a decade ago. And it has been discussed ad nauseam since then. Conservatives using it as another reason to place blame on a minority group and liberals to espouse gender equality. What is there left to say that hasn't already been said?",
            "title_similarity": "0.54665524",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2tzmg7",
            "score": 0,
            "text": "Trans men are usually taking testosterone which would be against the rules for cis men I believe",
            "title_similarity": "0.63652694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2u0djo",
            "score": 0,
            "text": "What is going to happen is the more trans athletes , the less women are actually going to compete because they are going to lose. So then, they will have to set up their own league ... again.\n\nIt’s not a big secret that men who transition to women are stronger than women.",
            "title_similarity": "0.7929701",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h2u0n8s",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2u0ro3",
            "score": 0,
            "text": "What exactly is your position - no position?!  Seems hard to change your mind",
            "title_similarity": "0.2999403",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h2u0uly",
            "score": 0,
            "text": "How many profs are willing to do objective, unbiased  research and risk discovering there is an athletic difference and then have the options of 1) scrap the project, 2) lie about it and make up data, or 3) publish the data and write a transphobic paper that will be publicly available and stay on your CV forever?\n\nEven with tenure all of the above could cost your grants, get you in trouble with the university, or totally ruin your career. So nobody with a cushy professorship is going anywhere near this.",
            "title_similarity": "0.7467628",
            "sentiment_compound": -0.796
        },
        {
            "id": "h2u32st",
            "score": 0,
            "text": "Venus Williams tried to compete with men. worse than 200th position male player",
            "title_similarity": "0.53963083",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2u3gff",
            "score": 0,
            "text": "If your dumb enough to play men’s sports as a women do it, if your bold enough as a man to play women sports do it.",
            "title_similarity": "0.6374301",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h2u6ci8",
            "score": 0,
            "text": "I think if gender doesn’t matter, then just have one event rather than split it into men’s and women’s. That way we have just the fastest “person” in th world.",
            "title_similarity": "0.59095854",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2u6ki8",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2u6ted",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2uax4h",
            "score": 0,
            "text": "After learning of intersex people and women with abnormally high levels of hormones that give them a distinct edge in performance, I thought a possible solution is to essentially have \"testosterone weight classes\" in competitive sports. Probably 3-5 \"weight classes.\" The low level would be women with normal testosterone levels. The mid-low level would be women with abnormal testosterone levels, intersex, and transwomen on hormone replacement with levels too high for low level. The mid-level would be men with lower than normal levels of testosterone and maybe women on performance-enhancing drugs. The mid-high level would be men with normal levels of testosterone for athletes. The high level would be freaks of nature and men on performance-enhancing drugs. Let me know what you think about this possible solution.",
            "title_similarity": "0.641096",
            "sentiment_compound": -0.128
        },
        {
            "id": "h2udil4",
            "score": 0,
            "text": "The solution is very simple. You segregate based on presence of the measurable hormones and anatomical features that give advantages, and allow smaller leagues to use simpler measures (such as gender-during-puberty or time-on-hormones) as proxies if they correlate well and testing is too difficult.\n\nYou don't have an open and a women's league. You have an open and a >x amount of testosterone for y years league.\n\nDoping laws still apply if you do not have a legitimate medical reason for the intervention.",
            "title_similarity": "0.7336658",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2uh16w",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2ukso7",
            "score": 0,
            "text": "It’s common sense bro. Stop being so afraid to say basic facts",
            "title_similarity": "0.43626755",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2um184",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2umn90",
            "score": 0,
            "text": "I used to be concerned about this myself.\n\nI'm a cisgender biological male with primary hypogonadism.\n\nThere is plenty of evidence that I was exposed to higher than normal levels of testosterone in utero and at a young age and I develop sexually at a young age compared to my peers.\n\nMy bone structure and musculature naturally reacted to higher levels of testosterone and I was always the biggest kid in class, and then I experienced several concussions and a testicular injury that essentially shut off my natural testosterone production to the levels typically associated with a woman who has moderately High T.\n\nI went from deadlifting 605 lb to struggling to curl a 30 pound dumbell for reps.\n\nDue to some other health issues that were completely unrelated (we think) bone density scan were conducted, as well as a series of neurological tests well before we discovered that I was suffering from extremely low testosterone with the predisposition to aromatize more testosterone into estrogen than most people.\n\nOver 2 years as my testosterone levels dropped and my estrogen levels increased and we were unaware of these things happening I experienced multiple side effects.\n\nI was weak compared to previously. My bones were less dense and I began to accumulate fatty tissue in areas that biological males don't typically accumulate fatty tissue.\n\nIt took me what seemed like an eternity to recover from strenuous exercise compared to what I was accustomed to. I hurt myself lifting something that weighed less than what I used to live 4 repetitions.\n\nAll it took was a couple of concussions and a testicular injury and it was discovered that I had started to develop more breast tissue and I was weaker than I had been before I began lifting weights on a regular basis.\n\n%nbsp;\n\nThis was all without hormonal intervention to increase my estrogen levels and decrease my testosterone levels.\n\nImagine that. You don't even have to go on hormone replacement therapy to start to feminize, certain injuries or exposure to certain chemicals that are prevalent in our environment (pthalates for example *check your shampoo lmao*)\n\n&nbsp;\n\nOne of my best friends in the entire world went to a high school where they allowed girls to play on the \"regular\" football team, and that was the first and last year that football team ever made it to the Nationals.\n\n&nsbp;\n\nJust to be clear here, if you have an issue with transgender people playing sports that are divided along imaginary gender lines, you have some problematic attitudes that you need to examine, and you almost certainly don't understand the science behind any of this.\n\nThere are people who are born with more than two sex chromosomes... XX and XY are not the automatic default, there are people born with as many as for sex chromosomes or with a mutation on one or more of the sex chromosomes they possess that change how their body and brain develops. There is no doubt about this it's been proven, and the consensus among the scientific Community is that gender is a spectrum which is obvious because gender is a societal constructs and not an actual scientific classification. The current consensus among the scientific Community is that sexuality and gender are not binary and if you would like more information on this I would be more then happy to share peer-reviewed scholarly articles with plenty of sources and citations the back up their research with you if you're interested in such a thing. Just send me a direct message.\n\n&nbsp;\n\nStop worrying about wheter girls are going to beat up boys, or boys are going to beat up girls, and start thinking about this being a world where everyone is competing with one another in some way, shape, or form. It's survival of the fittest, and if your regressive views that were informed by indoctrination from a young age or even radicalization at an older age you're going to have a problem with this. Suck it up buttercup and stop being a snowflake.\n\n&nbsp;\n\nThe jury is out and they've determined that trans people are people. If you have a problem with that, we can skip the judge injury and go straight to the final step. Fuck you with all my heart to any bigot put there.\n\n&nbsp;\n\nLove, Hate, and Indifference\n\n-Kveldson",
            "title_similarity": "0.59499294",
            "sentiment_compound": 0.8272
        },
        {
            "id": "h2uouos",
            "score": 0,
            "text": "I thought I knew exactly what the comment section would be as soon as I read your post. I’ve overestimated Reddit. I applaud that your first instinct is to look for a “comprehensive study.” I did the same when I first heard of this issue, and if I had not found one, I might also have come to the conclusion you did. Many people try to use their raw intuition, which is a dangerous mistake in such a situation. Always look at the science; intuition is often wrong. You seem like a well-meaning person which is a nice surprise on reddit. Here’s what I found:\n\n**Sport and Transgender People: A Systematic Review of the Literature Relating to Sport Participation and Competitive Sport Policies**\n(https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5357259/)\n> “Currently, there is no direct or consistent research suggesting transgender female individuals (or male individuals) have an athletic advantage at any stage of their transition (e.g. cross-sex hormones, gender-confirming surgery)”\n\nThis article looked at 8 research papers reviewing 31 sports policies so I would say it’s definitely a comprehensive study. \n\n**Race Times for Transgender Athletes**\n(https://cgscholar.com/bookstore/works/race-times-for-transgender-athletes?category_id=common-ground-publishing)\n\n> “This study analyzed race times for eight MTF runners who have competed in distance races in both genders, using a mathematical model called age grading. Collectively, the age graded scores for these eight runners were essentially the same in both genders.”\n\n\n\nYou can find lots more information and scientific sources in a digestible format in these two videos I found as well!\n\nhttps://youtu.be/PWUgd7PY7W0\n\nhttps://youtu.be/nE7chPseZKY",
            "title_similarity": "0.66966426",
            "sentiment_compound": 0.8122
        },
        {
            "id": "h2us6tc",
            "score": 4,
            "text": "They should either go based on biological sex or add a trans men class and a trans women class. I believe the biological sex because it disregards gender because gender is what people call a social construct but the Olympics or for the best biological men and best biological women to compete to see who's the best not what people feel like. It is ironic that you only ever hear of trans women breaking records but not the other way around (cough cough South Park Episode). My main concern is that have trans women in women's sports is that it now makes it harder for women to win which is soooo unfair and not only that but it takes a spot of a biological woman which is again what we are looking for. Also if this was common practice we wouldn't have athletes like Serena Williams and others because there would be only trans women, it may seem slow now but it will eventually catch on and become worse. We might end up saying good bye to female sports and just have men's and trans women's. Also this isn't some small thing records can be broken my milliseconds. Also no matter what you do you can't just take away the competitive advantage that these people will have specifically trans women. Also trans women when they were men usually aren't that good but when they are in women's sports they somehow come out on top so it seems a little fishy. I do like my second option but there could a problem since there may not be enough trans athletes to fill an entire Olympics games. To finish this off there is a reason that we separate women's sports from men's and again no matter the amount of surgery and hormones we give trans athletes they will never be, biologically speaking, entirely their preferred gender there are things that we just can't change. Some examples would be bone density, muscle mass, and many other things. Personally I don't believe what someone feels they are should be taken into account for these sports.",
            "title_similarity": "0.8456929",
            "sentiment_compound": 0.9535
        },
        {
            "id": "h2uu0fd",
            "score": 3,
            "text": "Anyone who thinks trans men competing in womens sports should be fucking ashamed to call themselves progressive. Being progressive means you believe in science and the fucking science clearly show males are physically stronger than females. Before you say “i know this girl who is stronger than most guys”, yes exceptions exist but we are talking about professional athletes here so you bet your ass literally every male and female are in top shape so those exceptions are meaningless in this conversation. \n\nStill aren’t convinced? Go look at the record breaking happening when a trans man competes in a womens sport. They can literally break every record set. Even some highschool boys can win in sprints against world champion women sprinters.",
            "title_similarity": "0.7956726",
            "sentiment_compound": 0.8829
        },
        {
            "id": "h2v04me",
            "score": 0,
            "text": "Sports shouldn't be divided into man and woman in the first place. There are many other physical factors like weight etc. that could be the sole measures. What I really don't get is things like soccer where there is the \"real\" soccer and the women's soccer. It's a strategy, accuracy and endurance game, it shouldn't be a problem for different genders to compete against each other. Also don't get why women are so underrepresented in esports on big tournaments, when many teams have women members and they are oftentimes better than to man in the teams.",
            "title_similarity": "0.7427597",
            "sentiment_compound": 0.8465
        },
        {
            "id": "h2vcvys",
            "score": 0,
            "text": "It’s not about being anti trans or trans phobic, that’s moronic liberal logic that’s stupid, it’s about being wholly unfair to true females who can’t compete against guys, because no matter what they identify with or what they have left between their legs they are biological men.  What the thrill is about being a guy and beating women at weight lifting or any other sport is beyond me.",
            "title_similarity": "0.76380676",
            "sentiment_compound": -0.8486
        },
        {
            "id": "h2ve4hh",
            "score": 0,
            "text": "I don't think people want to consider how vastly these issues affect people.  Imagine you spent every year competing in a sport since kindergarten. You make it to high school and need a scholarship to attend a decent college and get a degree.  This would improve your and your families lives.  Your senior year while you are competing and scouts are looking for talent at major events you go from number one at your school to two or three to another trans athlete. Imagine losing the scholarship and the opportunity to use the skills you spent your whole life working toward to someone who didn't even compete until 2 years before transitioning.  This isn't a hypothetical it has happened to quite a few young women.\n\nI don't think we have to exclude trans individuals from participating. I do however think that we need to create new scholarships to award them along side others so we are actually being inclusive.  Or we could just make everything coed and set the bar at the male sports level.  Say what you want about HRT but there are people competing before they have extensively started HRT or have recently identified.\n\nIt's a complicated issue and it will take some time and open INCLUSIVE minds to accept that trans people are taking the place of another human being and sometimes the chance at a better life from that person.  Also I have yet to see a FtM break any male world records or place first above their cis counterparts.  Why does no one talk about this?",
            "title_similarity": "0.5892298",
            "sentiment_compound": 0.9089
        },
        {
            "id": "h2vegjv",
            "score": 0,
            "text": "I think we all need to be asking ourselves, do we really need sports at all? It's all a bit silly isn't it?",
            "title_similarity": "0.58897614",
            "sentiment_compound": 0.1179
        },
        {
            "id": "h2vggp4",
            "score": 0,
            "text": "There’s no legitimate discussion to be had. Males have no damned business in the female category. It’s a bad joke.",
            "title_similarity": "0.50023115",
            "sentiment_compound": -0.3217
        },
        {
            "id": "h2vgtn8",
            "score": 0,
            "text": "Trans women athletes are just failed male athletes. Keep them out of women’s sport.",
            "title_similarity": "0.71126235",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2txub1",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2t5gwd",
            "score": -1,
            "text": "While I personally could not care what someone identifies as, it is definitely a topic that needs extensive discussion and study. While the IOC has done some of this, the level of testosterone that is allowed is still higher than naturally born females. The main thing that needs to be looked at is does this give them an advantage over women. If it does then, they shouldn't be allowed to compete against women. Don't remember where I was reading a story about high school girls running into this issue but it was pretty clear that they had an advantage. They went from running track meets with boys and finishing in 4 or 5th place to running against girls and winning most of the races. This clearly shows an unfair advantage. But this is also during the age where you can't really rely on news so who knows how accurate that is. I would like to see a detailed study that shows that it will be a fair competition for all involved. If they can prove that, then by all means let them compete. But make sure you are not giving one group of competitors an advantage over the other competitors.",
            "title_similarity": "0.75680935",
            "sentiment_compound": 0.9798
        },
        {
            "id": "h2tc4vw",
            "score": 1,
            "text": "I think the discussion you are suggesting should have some specific parameters:\n\n1. A recognition that it is about solving an ethical puzzle, not solving a significant  societal problem. There are too few trans athletes to warrant the attention it’s currently getting in right-wing media.\n\n2. Athletic identify and gender identity are not equally important. Being an athlete can be an important part of who you are, but gender is foundational.\n\n3. People don’t change gender just to win at sports. Related to 2, but important to emphasize anyway.\n\nDo you setting ground rules like this could lead to good-faith discussion ?",
            "title_similarity": "0.7823941",
            "sentiment_compound": 0.8988
        },
        {
            "id": "h2u18xe",
            "score": 1,
            "text": "Is there a reason why we don’t have more “co-ed” sports for people to choose from? This way no ones rights are violated and everyone gets the choice to participate or not. Agree or not, you are taking away the rights of females that do not want to participate against biological males if you force them to.",
            "title_similarity": "0.7582085",
            "sentiment_compound": -0.7865
        },
        {
            "id": "h2u3pqr",
            "score": 1,
            "text": "My threshold is post-op. If you’re willing to do the sex change then by all means compete in your chosen sex. Unfortunately I can’t endorse pre-op because I know biological hormones are a thing and will give certain advantages.",
            "title_similarity": "0.7573129",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h2u5m12",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2u80s2",
            "score": 1,
            "text": "Women are being used as political pawns again. This isn’t the first time, I’m sure it won’t be the last.",
            "title_similarity": "0.51629865",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2ub6ym",
            "score": 1,
            "text": "I had this discussion with my 85 year old dad yesterday. Chair lift challenge--I'm going to complete as a man. I'm gonna bring home the gold! * My point is, even without the sex hormone aspect, there are lever and centre of gravity differences that hormones don't affect. If chair lift challenge was an Olympic sport, men would have a hard time completing with women cause their center of gravity is different. Men are going to jump higher cause their center of gravity is higher. Hormones? That's only a part. You can suppress or enhance hormones but what are you going to do about pelvis shape, longer levers, and different Q angles? All that stuff is a mechanical advantage depending on the sport.",
            "title_similarity": "0.67409885",
            "sentiment_compound": 0.477
        },
        {
            "id": "h2ufyfl",
            "score": -1,
            "text": "Medical consensus seems to be that trans women who are on estrogen and testosterone blockers for about 2 years have very similar physical abilities to cis women of similar height and build. Those differences, especially height and bone structure, become essentially non-existent if the trans woman gets on blockers as a teenager and medically transitions as an adult. So, anyone who actually cares about evening the playing field between trans and cis athletes should naturally support making blockers available to trans kids and teens . In my opinion, anyone who complaints about trans athlets and is against making blockers available to trans teens doesn't care about athletic integrity, they just want to hurt trans people.\n\nI'm less savvy when it comes to trans men, but from what I've seen testosterone is a **hell** of a ride, those guys tend to be **swole.** Not in a way that'd be unfair when competing with cis men, from what I can tell.",
            "title_similarity": "0.787495",
            "sentiment_compound": -0.8905
        },
        {
            "id": "h2ui42q",
            "score": 1,
            "text": "Trans women dominate their competition. If you were born a man you will die a man. It's silly to allow a man to break women's world records because he feels like a woman. He can feel like a woman all he wants but he's still a biological man. That means regardless of his feelings he should never be allowed to compete in a womens team. He can compete with other men. They don't need to change anything about themselves to say they are a woman. No drugs, therapy, hormones, surgery, etc. It's outrageous to think people would let a man compete in a woman's league. There are separate organizations for a reason. No, it's not transphobic to not allow men to play in women's sports or into women only areas. They are taking advantage of this hysteria and sending women back decades.",
            "title_similarity": "0.7863066",
            "sentiment_compound": -0.775
        },
        {
            "id": "h2umjxd",
            "score": 1,
            "text": "It’s funny you said trans men and not trans women. We need a balanced discussing inclusive of both. \n\nI think the real discussion to be had is if someone becomes the gender they change to after they transition. If they do, then competing in sports as that gender becomes a non issue. However, since the trans community is so diverse, there’s a lot of debate about that. \n\nWhat strikes me as odd, is that trans people in sports are such a small minority that the issue isn’t even really about being trans at all: it’s a way to discuss americas deeply divided social landscape. Once we look at it that way, we can see why there hasn’t been much productive discussion. On one side we have liberals that use science to rationalize their beliefs, and in the other, we have a conservative population that is so heavily steeped in traditionalism that any challenge to that is met with chaos. Both sides are wrong of course, but that chasm in American politics means that things devolve into a kindergarten style argument that impedes any productive discourse we might have. So, while we need to have a serious discussion about our values, necessary discussion like trans athletes in sports don’t happen because  we’re so divided. \n\nThis has nothing to do with trans athletes and everything to do with how stuck we are as a culture. Once we start to solve that problem, discussions like this can start.\n\nOn a personal note: I think the new waves of feminism use theory that is too microscopic because they look at othering on such a small level. So, I think we also need to start moving beyond neomarxism. If we do, we can find an approach that doesn’t alienate people with different beliefs.",
            "title_similarity": "0.8811475",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2umtzt",
            "score": -1,
            "text": "Transphobe.",
            "title_similarity": "0.1682448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2un3wx",
            "score": 1,
            "text": "Don’t try to talk sense into these people that support this type of nonsense. They have no concern over facts or logic, only emotional vitriol. Using facts and logic will only net you negative reactions. Reddit is a liberal hive mind. Good luck.",
            "title_similarity": "0.6330997",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2uqb5p",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2urxfq",
            "score": 1,
            "text": "No woman should be forced to compete against a man. If they agree, it's whatever, but to tell a girl to achieve your athletic goals you must best a male is beyond a absurd. The presence of a mental illness in the male doesn't change that.",
            "title_similarity": "0.7411034",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2urxlc",
            "score": 1,
            "text": "As a trans woman myself, no. Trans women should not be put in women's sports. Since, biologically, someone who is amab has a much easier time gaining muscle. That's all I have to say.",
            "title_similarity": "0.7928337",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h2uuel3",
            "score": 1,
            "text": "you're not transphobic, just stating the differences of human anatomy and physiological hormonal differences and bone structure. Its the same argument Joe Rogan was making and getting the same shit because people don't really critically and just get easily offended",
            "title_similarity": "0.65050924",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2uxk2w",
            "score": 1,
            "text": "The way i see it is if trans women (biologically born men) want to be included in women’s sports and the women are okay with it, let it happen. Just don’t let the women (biologically born) go back on it when they never win another championship because they’re getting dominated by new competitors with potentially decades of residual testosterone, increased bone density, and larger muscle mass. \n\nJust remember that Wendy Williams, the beat female tennis player in history, was almost completely shut out (she got a single point the whole match) by a male college tennis player who drank whiskey during the game ranked somewhere in the 200-300’s iirc (exact details may be off)",
            "title_similarity": "0.7318123",
            "sentiment_compound": -0.291
        },
        {
            "id": "h2v26kv",
            "score": 1,
            "text": "Yes, it is objectively a dilemma that will hurt someone no matter what you choose is right.\n\nI was very dissappointed when I recently got banned from the transgender subreddit for discussing the issue, even though its about page stated that the sub is open for discussions.\n\nI saw multiple comments calling those who didn’t want trans-female Laurel Hubbard to compete in the Olympic Games “transphobes”, which is absurd! A choice HAS to be made, so if, say, you had to go on a trip with either your mom or your dad, does picking your dad mean you hate/dislike your mom? NO, of course not! Not to mention that by their logic, wouldn’t choosing to want Laurel to compete make them cisphobes, because they choose to put the cis-female competitors in an unfair situation?",
            "title_similarity": "0.749218",
            "sentiment_compound": -0.8367
        },
        {
            "id": "h2v2dqk",
            "score": 1,
            "text": "Well, let's assume that some trans women have an advantage in physical sports, right? We don't really have any evidence of that but sure, hypothetically. What is an advantage? What then qualify as an unfair advantage? Blood testosterone levels? So that one Cis Woman with super high blood testosterone because of PCOS or any other of a variety of disorders shouldn't be allowed to compete? \n\n\nWhat about build? Broad shoulders and whatnot? Trans women aren't the only people with super broad shoulders or big noses or large hands or coarse body hair either, hell there's an entire online community dedicated to finding celebs they think are secretly trans and then cyberbullying them despite all evidence to the contrary, what the fuck is random Dave the Admin for the amateur basketball league supposed to do? Ask you to strip for an inspection? Those aren't guaranteed to show anything either and I thought \"protecting women from predatory men\" was what it was all about? The simple fact of the matter is that you can't come up with a guideline that doesn't hurt Cis Women in some way too.",
            "title_similarity": "0.82020473",
            "sentiment_compound": 0.9213
        },
        {
            "id": "h2v4vra",
            "score": 1,
            "text": "I dont know fuck about athletic competition, but getting voted into oblivion is standard when dealing with lgbtqa+ topics and not being 100% supportive. I once asked a transperson doing and AmA if they had health concerns regarding hormone therapy and all i got was like 50 downvotes and defensive / aggressive answers that made no sense.\nTrans is amazing but many people caring about it as if its their entire meaning in life are dumb as fuck.",
            "title_similarity": "0.7905227",
            "sentiment_compound": -0.1045
        },
        {
            "id": "h2vbu3r",
            "score": 1,
            "text": "With all do respect to anyones preferred way to live life.  There is a huge difference between male and female bodies though. Even if you alter hormone levels you will not have a level playing field.  \n\nLets say you alter hormone levels: I'll list the remaining advantages biological men have over women in sports. \n\nHeight, smaller pelvises (less susceptible to ALC injuries), muscle growth from pre-transition, differences in the brain (women have slower reaction times).  This will sound bad but 3D awareness, most women have a hard time parallel parking, and that is not just a social construct.  3D awareness is valuable when reading the ball on the field.  \n\nThere are so many advantages to being a male while playing sports, you can't just say that athletic ability is solely dictated by your current levels of testosterone.  \n\nIt's important that people feel free to be their best selves, so I'm sorry if what I wrote was offensive but its my 2 cents.  Keep doing you!",
            "title_similarity": "0.7453382",
            "sentiment_compound": 0.9714
        },
        {
            "id": "h2vdl5a",
            "score": 1,
            "text": "Studies show that trans-men do have an edge in women's sport competitions. Despite their change in gender, trans-men are still as strong as regular men. Which creates a inequality in the competition since men are physically (and only physically) superior to women. My argument for it would be that we either create trans exclusive competitions or that trans athlete can only compete in their initial gender competition. So if you were a man but became a woman then you compete in masculine competitions and vice-versa.\n\nWhile these arguments holds up from a biological stand-point, it does imply an ethical problem. Trans only competitions would separate them further from common athletes, which is not what they want, and the 2nd solution would be a way to deny the trans's change in gender in the eyes of society.\n\nThere is a dilemna at play here. Each is legitimate. To be logical would be to aim for athletic equality despite the restrains it create. To be empathetical would be to aim for athletic accessibility despite the competitive inequalities it creates.",
            "title_similarity": "0.82741904",
            "sentiment_compound": 0.8171
        },
        {
            "id": "h2s9r2l",
            "score": 348,
            "text": "[deleted]",
            "title_similarity": "-0.01010034"
        },
        {
            "id": "h2s9v6r",
            "score": 2165,
            "text": "You are right, it is a topic that does warrant examination. The IOC has strict guidelines for trans athletes, so it is something that they have investigated and are taking seriously. It is isn't a case of simply letting all trans athletes compete without any further vetting.\n\nThe problem with this discussion is that all too often, it is not done in good faith nor done properly. Far too many people are using this as an opportunity to discredit trans people as a whole. Far too many people are not arguing with validity or soundness. This is especially true on the internet. If you took a university or specialist sports ethics class (or something along those lines), they could very well discuss the pros and cons of integrating trans athletes because it is a more disciplined form of discussion.\n\nIn short, due to the nature of online discussions, where nobody has to identify themselves, their credentials, and rarely cite any sources, most of what is said is either deliberate or ignorantly unintentional bullshit. I generally agree with your point that this is an interesting puzzle, but the debates that do take place online are completely toxic. If you don't believe me, take a close look at all the comment you will get here and how your question will essentially become a left vs. right pissing match.",
            "title_similarity": "0.8139242",
            "sentiment_compound": -0.195
        },
        {
            "id": "h2tmsiw",
            "score": -2,
            "text": "I agree but honestly what a boring topic at this point. It was interesting 4 years ago but no one cares about this stuff anymore.",
            "title_similarity": "0.44540232",
            "sentiment_compound": 0.0849
        },
        {
            "id": "h2u6ndu",
            "score": -2,
            "text": "It's fair to have this discussion but it's understandable why you would be called transphobic since many who share your concern are wildly uneducated and arguing in bad faith.  For starters, it's a bit sexist to imply that men are objectively better than women athletically.  Many female athletes are equal or superior to their male peers.  It would be disingenuous to ignore the debate of whether sports teams should be separated by gender in the first place.  Secondly, trans women have been able to compete in the Olympics since 2004 but none have even qualified.  If the advantage were as clear-cut as some make it out to be then clearly this would not be the case.  Thirdly, trans women are often demonized as men trying to invade women's spaces.  The idea that a man would transition just to succeed in women's sports is based on no real examples and implies that trans women are unanimously accepted.  Fourthly, medical transition is largely ignored.  The assumption is made that trans women are exactly the same as cis men biologically.  In reality, many trans women are only able to compete after having been on HRT (or puberty blockers for teens) for a certain amount of time.  Fifthly, trans men are also ignored.  There are examples of trans men being forced to play on women's teams even when they are on T.  To reiterate, it's not like these people view trans men as biologically any different than cis women.  If they truly cared about there being an unfair advantage then this would be addressed.  In conclusion, transphobes make these arguments because they believe trans people are more similar to their AGAB than what they identify with.  They think they can easily clock any trans person, which is both disrespectful and incorrect.  In almost every case, trans women are indistinguishable from cis women.",
            "title_similarity": "0.82989585",
            "sentiment_compound": 0.9115
        },
        {
            "id": "h2uwkx8",
            "score": 2,
            "text": "Isn't there like 10 trans athletes in the U.S.? Why do we need to discuss that lol",
            "title_similarity": "0.51463556",
            "sentiment_compound": 0.1754
        },
        {
            "id": "h2t6f2f",
            "score": -2,
            "text": "When trans people compete in sports and achieve greatness, it's a win for all people.  It's a reminder how amazing our bodies are.  Trans athletes show us the different and incredible ways our bodies can compete just like anyone else's do.",
            "title_similarity": "0.73132634",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h2tccy3",
            "score": -3,
            "text": "CMV: Most Womens sports leagues are just affirmative action. Why should they be given a separate league with lesser competition anyway? Then they complain about making less money than male athletes when they can't compete with a 13 year old or 45 year old male in alot of cases (WNBA). There is no league that I know of that bans women from competing so there should be none that ban men. Problem solved. You would still have Danica Patrick and other female athletes it would just be rare.",
            "title_similarity": "0.7715852",
            "sentiment_compound": -0.3348
        },
        {
            "id": "h2u6hc2",
            "score": 5,
            "text": "I would have no problem having a serious conversation with people regarding this topic, but usually people lie about their position or take it to the extreme.\n\nConservatives will often say; \"I don't care what people want to call themselves or identify as. I just don't think biological men should be participating in women's sports.\" Ok, we can have a serious conversation about when it is and isn't acceptable for trans people to participate in sports. \n\nBut then when trans people get added to protected classes, meaning they can't be discriminated against in the work place, school, college admissions, housing, banks, etc. These same conservatives who said they only had a problem with trans women in sports lose their mind. Turns out they were lying about their only issue with trans people being sports. They just hate trans people all together and want to oppress them. \n\nTalking about sports is an easy Motte and Bailey for them to avoid talking about their real positions, taking people's rights away. They misrepresent their own positions and back track after you think you've made some progress to meet them in the middle.",
            "title_similarity": "0.83391905",
            "sentiment_compound": -0.9202
        },
        {
            "id": "h2uhxhn",
            "score": 7,
            "text": "Pardon my getting a little post-modern, but its important to understand that nothing, no argument, no discussion, no stated fact, nothing takes place in an objective contextless void. Everything has some context that shapes how others will interpret what is said. For example, uttering the fact \"75% of those arrested by NYC's Stop and Frisk law were people of color, despite only being 50% of the city's population\" portrays something much different than that same utterance with \"People of color made up 90% of those who were stopped and frisked, despite people of color and white people having been found to be carrying contraband at the same frequency\". The first one gives the image of PoC being rampant lawbreakers, while the second gives the image of a racist police department. Sorry for this side-track, but what I'm getting at is this: Facts themselves are objective, but if when you transcribe a fact into language and communicate it to someone else, it adds a subjective character that is unavoidable. That's why someone saying \"BuT I'm JuSt SaYiNg FaCtS\" when warned about disruptive/harmful/problematic behavior isn't a valid excuse/justification. \n\nOkay, onto this topic at hand. Trans people participating in top level athletic sports programs. And unless I'm mistaken this truly is only about very top-level competition; if a mediocre trans athlete's ability is perfectly fitting with some lower-level sub-varsity team of their gender, there is no issue, right? If they were really above and beyond the ability of their gender peers, they'd just get bumped up to the next level. And I say, sure, there is a reasonable time and situation where it would be appropriate to discuss this.  Likewise, there's also a time and situation to discuss whether people with prosthetic implants, as those implants get better and more advanced and powerful, should only compete against each other, or if they should be allowed to compete in traditional top-level sports programs as well. Here's an article on the subject: https://www.scientificamerican.com/article/blade-runners-do-high-tech-prostheses-give-runners-an-unfair-advantage/. Now here's the thing: I wouldn't be surprised if this is the first article you've read on THIS subject. Compare that to transgender people in top-level sports, which I feel I can safely assume you've had extensive debate about in multiple forums of discussion. A quick search found that transgender people make up about 0.6% of the population, which is right around the same level as people with limb-loss. Yet how come one has so much more discussion than the other?\n\nFor people who've been part of the LGBT movement and followed its struggles and successes, we are painfully aware of exactly why. This might be why some people can be rather short and seemingly irritated when it comes to discussing this. During the 90s there was a \"culture war\" between the LGBT community and (mostly) fundamentalist christian conservative neocons, it started just as a fight for gay/lesbian acceptance (think Pride parades and such), and by the 2000s had solidified into a fight for marriage equality. Quite frankly, we crushingly defeated them, to the point where its now (somewhat) common to see token gay/lesbian neocon types used as props to show just how much a friend they can be to queer people (as long as they act straight and hold traditional patriarchal morality etc etc).\n\nThere were 2 (two) direct results that stemmed from this overwhelming victory that are of notable importance to this subject. (1) First of all, the plethora of Gay/Lesbian equality organizations that had been established and developed over the past decades found themselves having completed the primary objective they had laser-focus on for practically an entire generation of the LGBT community. There was now a moment to ask \"What Next?\". (2) Second of all, the christian right felt humiliated in their defeat, and became very bitter, vowing to never let it happen again.\n\nSo bla bla bla, the Trans Rights movement emerged with great passion, the christian right found their next target in \"promoting traditional family values\", and the rest is history, which takes us to about a year or two ago. If you remember back then, the big thing the right were trying to frame in the culture war was \"Transwomen are just perverted men trying to get into girl's bathrooms\". This got them a bit of success for them from conservatives, until the dog managed to catch the car, and some legislation/policy started being enacted. When stories started popping up of the \"Moral Majority\" doing things like demanding someone in the bathroom show them their genitals to prove they're in the 'correct' bathroom and not just some pervert trying to peep at other people's genitals, that mode of attack naturally started to fall apart. \n\nSo they moved on to the next strategy. Frame it as transgender people ruining their children's athletic programs. By bringing up this topic, they are successfully able to \"other\" transgender people, and bifurcate the population into choosing sides of \"For school sports\" or \"For Transgender rights\". Because of America in particular having an obsession with especially high school and college sports, this gave them the opportunity to get many people (many who have never even met anybody transgender in their lives) to automatically place themselves in opposition to transgender rights by default.   And of course, they aren't interested in any actual solutions, and any legislation that may pass is only a secondary bonus of about banning transgender people from sports as a way of repressing/punishing them. By keeping this \"issue\" which probably only a fraction of a fraction of a percent of the population in constant discussion by the greater population as a whole, they are furthering their goal of forcing people to take sides on their holy war.\n\nSo while it may be appropriate if you happen to be a sports official in a situation where there are trans athletes on your team, the average person really has no reason to discuss this anymore than they'd discuss prosthetic amputees competing in top level sports. The reason you see it being discussed so much more often is because a group WANTS it to be a hot topic of debate in their culture, and almost all of it is artificially induced conversation for their ulterior motives. By contributing to this discussion (where everything that could be said absolutely has been said already, many times over) and keeping it \"hot\" and \"fresh\", you are, perhaps unwillingly, contributing to the othering of transgender people and promoting the dichotomy of either being \"pro-trans\" or \"pro children's sports\"",
            "title_similarity": "0.5027397",
            "sentiment_compound": 0.9778
        },
        {
            "id": "h2van8h",
            "score": 5,
            "text": "Have you heard about the concept of concern trolling? It's a strategy often used by conservatives to halt social progress by less explicit means, where instead of saying \"we need to not have rights for x minority\" they repeat \"there are legitimate concerns that must be heard!\" to stall progress indefinitely. This is what you're doing right now, wittingly or not. You don't take a stance such as \"trans people are people that should be allowed to participate in society or equal footing with everyone else, even when that requires unequal treatment (for instance cis people do not need gender affirming treatment generally, but leaving that out means trans people can't live equally with everyone else)\", but instead say that discussion must be made, and thus there is no view to change. Take a stance or leave.",
            "title_similarity": "0.733711",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h2sds00",
            "score": 18,
            "text": "/u/DrBonghit (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/o6h8ga/deltas_awarded_in_cmv_there_is_a_legitimate/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.57870495",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2uewur",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "-0.010100358"
        },
        {
            "id": "h2tg6mc",
            "score": 1,
            "text": "So, serious question with no malice, just my ignorance.  No offence meant.  \n\nI assume that M2F and F2M trans people continue to make use of hormone therapy on an ongoing basis.  Aside from any \"benefit\" or \"deficit\" from their birth sex, I'd yhere any performance boost or decrease due to the additional hormone ls taken (if indeed they are).",
            "title_similarity": "0.75989556",
            "sentiment_compound": -0.0289
        },
        {
            "id": "h2tijma",
            "score": 3,
            "text": "Tbh I really don't think it's about wether they are or aren't competing with an edge...it's obvious. It seems more of an effort to make people acknowledge them as the trans gender they are more than anything. And the phobia of having the discussion falls on the other side trying to shut it down by shouting down and shouting out transphobic at anyone even questioning it.",
            "title_similarity": "0.7966637",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2u8f4y",
            "score": 1,
            "text": "No matter what you say you will sadly come across as transphobic friend.  They set up invisible trip wires of offense all around.",
            "title_similarity": "0.54906845",
            "sentiment_compound": -0.1714
        },
        {
            "id": "h2u9k9o",
            "score": 1,
            "text": "It angers me that you even need to start off by explaining you support the trans community to avoid being attacked in the first place. This works is just so shitty and annoying.",
            "title_similarity": "0.68249375",
            "sentiment_compound": -0.9243
        },
        {
            "id": "h2ua2mo",
            "score": 1,
            "text": "I also believe that this is a subject that is not really clear cut and we need to keep talking about it. I wish it was not so scary to try and talk about stuff like this. I want  trans people to be able to compete for in sports but I also can see how that might not be fare.",
            "title_similarity": "0.7597067",
            "sentiment_compound": 0.5737
        },
        {
            "id": "h2uarpc",
            "score": 1,
            "text": "they should have their own division, simple as that.",
            "title_similarity": "0.27244496",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ubwx4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.032677628"
        },
        {
            "id": "h2ue5bl",
            "score": 2,
            "text": "I think there's fair discussion to be had about any topic, if it's done in the correct context, but most objections to discussion of this topic are more concerned with the context of the discussion. Much of the discussion is centered on a binary that excludes trans men and many opinions, which is something like \"either trans women and cis women should be allowed to compete against one another, which is often framed as a morally neutral outcome, or trans women and cis women should not be allowed to compete against one another and to do so would be unethical.\" This framing ignores trans men and it also ignores the fact that *all* athletes have some degree of innate biological advantage, regardless of whatever demographics they might belong to. This is why combat sports have weight classes.\n\nRather than discussion of how or if we ought to equalize athletes' participation in a sport based on biological factors, the discourse is largely devoted to saying it would be villainous or anti-feminist to allow trans women to participate. The framing is reductive and reveals a disinterest in the fundamental principle that trans-exclusionary participants claim to care about - athletes not having intrinsic advantages. If that were truly the case, we would be having conversations about introducing weight classes, height classes, use of hormones to reach the arithmetic mean of the competing population, et cetera in order to uphold this principle in other circumstances. Because of that, most people who engage in the discussion from a non-exclusionary stance view dissent as being more about excluding trans athletes than creating a biologically level playing field.\n\nAnd, because discourse is centered on whether trans inclusion is fair to cis women, there is also little attention being paid to the question of how important biological equity is when compared to inclusivity. It also ignores that forcing trans women to compete against cis men is not only psychologically and socially harmful, being exclusionary, but glaringly ignores that such a situation is unfair to the trans women for the very same reasons, like differences in testosterone and estrogen.\n\nWere the discourse more faithful and curious about the principles of the trans-exclusionary position, the trans-inclusive debaters would be less inclined to say discussion of trans athletes in sports is generally illegitimate.",
            "title_similarity": "0.8036964",
            "sentiment_compound": 0.9448
        },
        {
            "id": "h2ugave",
            "score": 3,
            "text": "I am very ignorant to any studies that have been done. And harbor no ill will to anybody. With that said, I have one simple question/suggestion....is it an option to have a separate category for competing...like one for trans women against other trans women? Idk...just a thought",
            "title_similarity": "0.7611464",
            "sentiment_compound": -0.0157
        },
        {
            "id": "h2uhm2u",
            "score": 1,
            "text": "Indeed, I've looked into this myself. Honestly the science still seems to be out on the issue with many studies saying they have advantages and others that say they dont",
            "title_similarity": "0.52422696",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h2ui2si",
            "score": 1,
            "text": "My personal opinion is that we should either create a separate athletic group so we would have mens, women's and trans sports or just eliminate gender in sports altogether and have it go by weight and muscle mass instead.",
            "title_similarity": "0.6787202",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2uiyzl",
            "score": 1,
            "text": "If trans women have no advantage over biological women, why can’t trans men dominate men’s sports the same way trans women dominate women’s sports?",
            "title_similarity": "0.794602",
            "sentiment_compound": -0.4098
        },
        {
            "id": "h2ukamr",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.010100358"
        },
        {
            "id": "h2ukisj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.032677636"
        },
        {
            "id": "h2ukmce",
            "score": 1,
            "text": "those arguments can be addressed by sport bodies instead of transphobic politicians. no law should be discriminating on the basis of gender, even transgender. sports bodies can determine whether trans women have any competitive advantage and whether to ban them from women's leagues. we don't need laws that are just plain transphobic.",
            "title_similarity": "0.8397213",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h2umkqw",
            "score": 1,
            "text": "Men and women have different bone densities. In Olympic Boxing, you have two contrasting strengths of skeletal resilience. If we can separate according to weight and class, it seems reasonable to separate whose face is easier to punch in; just so happens we have a way to distinguish that. \n\nI feel bad this topic serves as a cruel reality check. Life is cruel. But we can minimize pain, which seems like the number one prerogative these days. But in doing so we have to appreciate whether or not it is causing pain in someone else, if so then it is purposeless.\n\nI imagine we are heading down a route of where we are going to make an exact science of it. What is said athlete's years lived through their body's puberty, what is their hormonal balance on the dot?\n\nOne could say we make a separate Olympics but that just seems condescending since it serves the same function as the Special Olympics.\n\nIt's a tough subject, especially if you want to be empathetic continuously through out finding a solution or compromise.\n\nHeight is a cruel discriminator when it comes to sports. So is weight despite it being changeable. Mental health is another factor, if an athlete has severe ADHD should they be deprived of their Amphetamine meds, the thing that makes them feel normal, before the big event? That's not fair. My reasonable response would be to allow them so long as everyone else is allowed to use said performing enhancing drug. \n\nThis is what Testosterone acts like, whether it be the active amount coursing your veins or the remnants of the features it crafted. \n\n\"Many feel that the use of testosterone replacement therapy gives an advantage to athletes in sports such as MMA and boxing where it is not as closely regulated or monitored. It is thought that athletes benefit from increased strength, speed, and endurance.\"\n\n\"Testosterone replacement therapy (TRT) was banned by the Nevada State Athletic Commission (NSAC). Hours later the UFC followed suit with its president, Dana White stating “We follow Nevada! ...",
            "title_similarity": "0.70287156",
            "sentiment_compound": 0.7472
        },
        {
            "id": "h2un3ee",
            "score": 1,
            "text": "Not really because sports are stupid and pointless.",
            "title_similarity": "0.42359576",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2uowvn",
            "score": 1,
            "text": "You were destroyed in the previous post because you were wrong",
            "title_similarity": "0.34974054",
            "sentiment_compound": -0.743
        },
        {
            "id": "h2up9gt",
            "score": 1,
            "text": "Disgusting both topics 🤮🤮🤮🤮",
            "title_similarity": "0.15673485",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2upd17",
            "score": 1,
            "text": "Despite all the red herrings and straw mans(straw men?), there is a legitimate debate to be had on every issue. Gun Control, Minimum wage, healthcare, trans women in sports.  \n\n\nThe problem starts if people say \"NO! 0 checks on guns, no government mandated minimum wage, your insurance company already gives you healthcare and trans women are just men who want to beat and sexually exploit women on the sports field.",
            "title_similarity": "0.8061249",
            "sentiment_compound": -0.7712
        },
        {
            "id": "h2upod0",
            "score": 1,
            "text": "Of course there is. The problem is that this is an issue that affects virtually nobody. There are much bigger issues in the world.",
            "title_similarity": "0.40808296",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2upr9v",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.010100358"
        },
        {
            "id": "h2uqifg",
            "score": 1,
            "text": "They already have different competitions for men and women why not have one specifically for Trans people?",
            "title_similarity": "0.735706",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uqrr0",
            "score": 1,
            "text": "i agree but im inclined to give a lot of leeway when it comes to the high school level and below",
            "title_similarity": "0.41350722",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h2uqtew",
            "score": 1,
            "text": "Yes there does.",
            "title_similarity": "-0.07740102",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2ur7qh",
            "score": 1,
            "text": "There isn't.\n\nTrans shouldn't compete with non Trans. It just isn't fair to the players.",
            "title_similarity": "0.5118314",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h2urac0",
            "score": 1,
            "text": "I find The Trans-Atlantic Call In Show discusses these issues well:  https://youtu.be/ZSI4bWtgDhI",
            "title_similarity": "0.44522232",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2urwn6",
            "score": 1,
            "text": "They should be allowed to compete in mixed competition. Yes some would have advantages against others but hey : no one is genetically born equal,  there are already differences among participants of the same sex",
            "title_similarity": "0.7207939",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2usf2i",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.010100358"
        },
        {
            "id": "h2ut48p",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.010100358"
        },
        {
            "id": "h2uu1xw",
            "score": 1,
            "text": "Give them their own league, people who physically matured as a man should not be able to compete against women.  It’s legit not fair to women.\n\nThere’s no way anyone can argue that men don’t have physical advantages over women. I’m gonna puke if I see another trans athlete rob hard working women of titles especially In power lifting.",
            "title_similarity": "0.7891978",
            "sentiment_compound": -0.8876
        },
        {
            "id": "h2uu2yk",
            "score": 1,
            "text": "Why is nobody mentioning how trans people tend to perform worse than the cis athletes because of hrt and other things? Granted it's what I've heard and I don't have exact sources, so take that as you will.",
            "title_similarity": "0.7494303",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2uu6fy",
            "score": 1,
            "text": "There is but it's such a boring discussion who would want to?",
            "title_similarity": "0.318696",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2uubqr",
            "score": 1,
            "text": "aren't there only like 3 of them total? You wanna ban all 3? Jesus christ it's already been debated for decades, how much more time do you think a problem involving so few people needs to be debated?",
            "title_similarity": "0.42143935",
            "sentiment_compound": -0.8486
        },
        {
            "id": "h2uusyf",
            "score": 1,
            "text": "I've really struggled at having this conversation in a constructive way. There's a lot of research still happening about it, and as such it's hard, I daresay irresponsible in some ways, too come out too strongly in one direction or another. I personally think that one of the better solutions to the problem is rarely discussed in favor of more reactionary takes.\n\nMy best example of this is a PragerU video about the subject narrated by a \"victim\" of trans girls in track, you may know what I'm referencing here. I personally thought she made one salient point - the trans girls' times wouldn't place in boys' competitions, yet yielded them podium places in girls' competition. In addition, Allyson Felix (who I believe just made the Olympics for the fifth time just the other day) has personal records that are routinely beaten by high school boys. I even checked that against HS state championships in my state, and they were correct.  Sadly, the rest of their arguments were couched in blatant transphobia. \n\nI obviously agree with you that there is legitimate discussion to be had. However, I believe we should be talking about something else besides banning them: normalizing hormone blockers and therapies for trans kids at earlier ages. The science has come a long way, and with careful observation and care by child psychologists, we can at least mitigate, and hopefully eliminate, a lot of the problems facing trans youth today. \n\nI looked through a good chunk of the top comments so far and didn't see much of a mention of that possibility. Now with that said, there's still a few catches. Like, what about those who discover their trans identity later in life? It is true that this doesn't completely solve the case, but it does make a big dent at the least.",
            "title_similarity": "0.7073609",
            "sentiment_compound": 0.6334
        },
        {
            "id": "h2uvd12",
            "score": 1,
            "text": "I just think they should only compete with their biological gender",
            "title_similarity": "0.55808246",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uvifq",
            "score": 1,
            "text": "Having honest concerns about the physiology of biological males and biological females and how they translate in competitive sports during or after transition hardly makes you a transphobe. Those calling you that lack a logical argument to counter any concerns you have.\n\n**DISCLAIMER**: Before I jump in too deep I want to make clear that going forward I will be using male and female for those born that way and haven’t (or will not) transition. I am in no way trying to imply that trans-men aren’t men or trans-women aren’t women. This is purely for clarity in what I’m about to post and nothing else. I am trying to keep my post purely on the topic at hand and intend no offense whatsoever.\n\nThat said, I genuinely believe that there should be a trans-league for competitive sports because of the biological differences mixed with hormonal therapy and how that changes things. You don’t see trans-men competing at record setting levels in male sports like you see trans-women doing on the regular in women’s sports.\n\nWhat do I think studies will reveal? Exactly what I stated above with some additional information. Things like trans-women, having effectively reduced or removed testosterone, will be less competitive against men due to the lowered testosterone levels and reduced physical strength. By that same token, the advantages testosterone (and skeletal structure) would have given them before transitioning gives them an advantage against women.\n\nOn the flip side by adding testosterone trans-men will gain strength and endurance advantages (among others) over women. However, as the skeletal structure of trans-men are still that of a woman, and they didn’t have testosterone throughout puberty as men have, they will be at a disadvantage against men.\n\nNow, as to whether or not the changes that hormone therapy bring to both sides equate to a level playing field I haven’t the foggiest idea, and this is where I think studies would be fantastic. If trans-men and trans-women are on par with each other this makes trans sports leagues more feasible and viable as you’ll have a larger pool to draw from than say if you had to form two leagues, one for trans-men and another for trans-women respectively.\n\nAnyway, yes, I think there are grounds for legitimate discussion. Even for those that oppose my stance completely. Instead of screaming transphobe and getting derogatory, this is a chance to articulate opposing views in a way to help others to learn your position and why you take it. A flies honey vinegar sort of thing.",
            "title_similarity": "0.85122055",
            "sentiment_compound": 0.9903
        },
        {
            "id": "h2uvl7v",
            "score": 1,
            "text": "My view is whatever you wanna think bro, your beliefs are your beliefs.\n\nBut I don't see the problem in just opening up a Trans division in all sports",
            "title_similarity": "0.73271215",
            "sentiment_compound": 0.438
        },
        {
            "id": "h2uvwu8",
            "score": 1,
            "text": "Kind of a side point but I do think a thing that is ignored to often is that trans men exist. Rules that ban trans women from joining women's sports, also force trans men to stay in women's sport even though testosterone treatments would give them an advantage.",
            "title_similarity": "0.85573614",
            "sentiment_compound": -0.7469
        },
        {
            "id": "h2uwg6m",
            "score": 1,
            "text": "I think there should be male and female separate sports but also a third sports league for pretty much anyone who wants to join the only requirement being that it’s strictly regulated based on weight, height, muscle mass, bone density etc.",
            "title_similarity": "0.67960656",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h2ux5qs",
            "score": 1,
            "text": "Transgender people should have their own section in sports.\n\nYou don't see many female->male people dominating male competitions.",
            "title_similarity": "0.7279916",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2uxgp1",
            "score": 1,
            "text": "Oh no. You can't say anything about trans persons on Reddit without being transphobic. For a group that claims to want equal treatment, they sure get treated much better here than many other groups. I bet I won't get one up vote and will told to fuck off and I haven't even said anything about transgenders. I've only commented on their supporters, and I'm sure I'll be called transphobic.",
            "title_similarity": "0.8378236",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h2uy4ay",
            "score": 1,
            "text": "Trans people should have their own separate sports teams. Problem solved.",
            "title_similarity": "0.64287424",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h2uyroc",
            "score": 1,
            "text": "There is no discussion imo. They're just other human beings, let them do what they want to",
            "title_similarity": "0.40754056",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2uys7w",
            "score": 1,
            "text": "This again. This comes up all the time on here and r/unpopularopinion. There are literally more posts about this then actual transgender athletes. And I meant the true meaning of the word literally.",
            "title_similarity": "0.6574339",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2uz03f",
            "score": 1,
            "text": "Create a 3rd category?",
            "title_similarity": "0.043866824",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2uziu4",
            "score": 1,
            "text": "I say let them. We know who's gonna win anyway, might as well teach it the hard way",
            "title_similarity": "0.44914865",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h2uzqc6",
            "score": 1,
            "text": "Why you care about being labeled as \"transphobic\" is beyond me. You know you're not that should be good enough for you.",
            "title_similarity": "0.5452289",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h2v06ax",
            "score": 1,
            "text": "I’ve spoken about this with a buddy of mine who has made a career writing about LGBTQ issues. He is of the opinion that there is no clear way to divide sports into male or female because gender is not actually binary. I believe they’ve tried a variety of methods for determining sex, and each methodology has a flaw. They’ve tried measuring hormones, but that varies within sexes. They’ve tried looking at peoples junk, but there’s more variety than just plain old peaches and bananas. I think they’ve tried some other methods too. I don’t believe that we will ever find a satisfying answer to this issue because the premise is flawed. My buddy who writes about LGBTQ issues for a living has also stated that he probably won’t write about this topic because it’s a lightning rod both within the LGBTQ community and from without.",
            "title_similarity": "0.78663385",
            "sentiment_compound": -0.1882
        },
        {
            "id": "h2v09go",
            "score": 1,
            "text": "There is a legitimate discussion to be had here. \n\nThere is a legitimate discussion to be had about literally anything. \n\nThe amount of apologizing and reassuring you had to make while making your point here is rather ridiculous and pretty telling of why you feel like you had to make this change my view. \n\nThere is an incredible hostile and unpleasant & unreasonable group of people residing in the trans debate.",
            "title_similarity": "0.6434777",
            "sentiment_compound": -0.1672
        },
        {
            "id": "h2v1omq",
            "score": 1,
            "text": "Create a section in the paralympics for them. Whether they can admit it or not, it’s their decision to live and compete as the opposite sex they were born as. This gives them unfair advantages over natural athletes",
            "title_similarity": "0.7118279",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2v1p3a",
            "score": 1,
            "text": "Hey man, don't ask me OP, you're the doctor here.",
            "title_similarity": "0.34652972",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v1pgm",
            "score": 1,
            "text": "You speak the absolute truth my friend",
            "title_similarity": "0.22909793",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h2v1tkc",
            "score": 1,
            "text": "I think 99% of the people involved in said discussion probably have no valid reason to be there. These discussions should be handled on an individual basis, and not handled with blanket laws and statements. In fact, almost all major sports associations have most certainly been discussing this.",
            "title_similarity": "0.6568494",
            "sentiment_compound": 0.1263
        },
        {
            "id": "h2v1x5d",
            "score": 1,
            "text": "There shouldn't even be a discussion. \n\nBig fat hell no.",
            "title_similarity": "0.30420685",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h2v252d",
            "score": 2,
            "text": "The simple solution is integrating professional sports and abolishing school sports. Problems solved, stayin solved.",
            "title_similarity": "0.51038754",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2v2fc6",
            "score": 1,
            "text": "Well, I don't disagree with your general premise, so I'm not going to change your mind on that. I think we're basically on the same page: I fully support trans people, fight transphobia where I see it, and I'd like to see everyone - men, boys, women, girls, non-binary, trans, cis, able-bodied or otherwise - have the opportunity to play in sports leagues, in a fair environment. I'm not really into sports that much, so I'm far from a sports scientist or anything; so I don't really know what that would look like. From what I gather the people who *do* have the expertise to answer that question are still figuring it out themselves, so, yeah, I fully agree the discussions need to happen. \n\nWhere I disagree is that there's a large contingent of trans people or trans rights activists who don't want the discussions to happen. Of course there are *some* people who think, trans women should just be allowed to play in women's sports on self-ID, no questions asked, and anyone who disagrees is a transphobe, but I'm not sure how big those voices really are - from my experience, that's a pretty fringe viewpoint. Certainly, I don't know of any mainstream trans organisations that hold that view. If anything, I think the real threat to having these discussions is the people on the extreme of the other side (who are much more numerous), who think the answer is just for trans people to not play sports, or for trans women to play in men's divisions (trans men are *never* mentioned) - they'll come out in droves any time the topic is brought up, and try to shut down anyone who actually wants to have the conversation by calling anyone who falls short of their hardline view a woke SJW lunatic. As I said before, I don't really have any expertise in the area, so I sometimes (foolishly) come into these discussions to maybe learn something, and *those* guys are the ones that are making that more difficult.",
            "title_similarity": "0.89808595",
            "sentiment_compound": -0.6197
        },
        {
            "id": "h2v3bql",
            "score": 1,
            "text": "None of us can change your view since there already is discussions going on, and anyone who doesn't want to talk about it is just in denial and missing the point.",
            "title_similarity": "0.55567884",
            "sentiment_compound": -0.3447
        },
        {
            "id": "h2v3ekh",
            "score": 1,
            "text": "It’s hard to comment unless you are a athlete competing at a high level, most time these conversations I had by people who’ve no interest other then the political aspect.",
            "title_similarity": "0.53784037",
            "sentiment_compound": -0.4367
        },
        {
            "id": "h2v5eli",
            "score": 1,
            "text": "It's only a conversation because we need to entertain people who haven't caught up or want to manipulate the understanding. Because it's the proper way to handle things, a fair discussion.",
            "title_similarity": "0.61213565",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h2v5xtf",
            "score": 1,
            "text": "> That being said I’m not aware of any comprehensive study that’s shows (specifically trans women) do or do not have a competitive edge in women’s sports. \n\nThere are numerous muddled studies but frankly I'm not sure why we need to have this conversation now. We're not dealing with a massive influx of trans women dominating women's sports. We just had the first _ever_ trans woman olympian qualify.",
            "title_similarity": "0.80528635",
            "sentiment_compound": -0.6126
        },
        {
            "id": "h2v5zmy",
            "score": 1,
            "text": "All people should be treated equally, however in sport where fractions of seconds/ strength/ reach/ height can mean victory or defeat,the deck is loaded.\n\nImagine a trans Tyson or Bolt, nobody could touch them.",
            "title_similarity": "0.6790576",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2v608x",
            "score": 1,
            "text": "Anyone who disagrees that Laurel Hubbard competing is a TRANS PHOBE",
            "title_similarity": "0.62907386",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2v67cf",
            "score": 1,
            "text": "Give trans folk their own division.  Women, Men, Trans.  If people who are kf the opinion that it doesn't matter, that athletes are athletes regardless kf hormones and gender, then the top contenders in each sport will be a mix of MtF and FtM.  If those against trans integration in to sports are right, only one trans type will dominate the top spots in each sport.\n\nProblem solved.",
            "title_similarity": "0.8527005",
            "sentiment_compound": 0.1093
        },
        {
            "id": "h2v6e2f",
            "score": 1,
            "text": "I never hear the opinions of woman in these sports nor the opinions of the trans athletes. I think it's their discussion no?",
            "title_similarity": "0.72783494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v6hua",
            "score": 1,
            "text": "Let's have 4 genders in sports, everyone is happy, everyone unoffended. \n\nEnd of story.",
            "title_similarity": "0.50795823",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2v6lni",
            "score": 1,
            "text": "Why don´t measure in weight classes instead of gender?\n\nJust my onion",
            "title_similarity": "0.5099773",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v80th",
            "score": 1,
            "text": "Discussion needed. Science on the subject is super individual, meaning we could take the same shit and our athletic performance (if we were equal before) could completely change. That being said, testosterone is a steroid somewhat. Trans women stop producing this or lower it drastically. It’s basically saying that I should be better than you if we are the exact same strength. Technique doesn’t change, tits dicks and balls don’t change. If you’re transitioning in high school the bone structure is harder to distinguish. \n\nThat being said, those small differences make a lot of difference the higher up you get. Everyone’s strong, everyone’s technical. Olympic Games, NFL, whatever highest level sport should maintain a level of equality in competition. Born male stayed male should compete against the same. Vice versa. Even if a trans man was against a born man the competition changes. Inclusion is important, but these leagues are meant to represent the highest level of fair play. It’s fair for trans people to play at that level, it’s not 100% scientifically fair to put them against odds that tip for or against them. \n\nTrans sports should ideally have their own league in (this is a random judgement part) levels collegiate and higher.",
            "title_similarity": "0.76386255",
            "sentiment_compound": 0.9484
        },
        {
            "id": "h2v85pf",
            "score": 1,
            "text": "Its sad that you have to explain yourself like everyone is 5.",
            "title_similarity": "0.27204657",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h2v88b1",
            "score": 3,
            "text": "There has been research that shows that testosterone has effects on the body's ability to build mass, muscle, strength. Testosterone increases bone density and improves reaction time. Testosterone basically makes you stronger, better, faster harder. This weunderstand and we understand that these effects are LONG TERM.\n\nWe have research that shows that when one goes off testosterone they become weaker, slower, smaller, softer that they would have been with testosterone.\n\nThere has been NO research, as far as I can tell, that proves or disproves that a normal healthy \"testosteroned\" man that chose to have a sex change and lost his testosterone would lose his bone density, muscle memory, strength, power to the point that it is literally reversed and they would have exactly the same bone density, strength etc that they would have if they were born female.\n\nIt would be literally impossible to prove this unless you could somehow find two identical twins that also somehow came out of the womb with 2 different genitals, put them through the exact training program, let them mature as adults, measure their bone density, strength, power, athleticism, THEN had one of them transition to a female,put them through the sex/hormone change and then remeasure their performance afterward. If their results are basically identical then, maybe we'd have a convincing argument. If the results show that the formerly male twin has any advantage at all...even one, then this would prove that trans women have an unfair advantage, the debate would be over.\n\nIf you look at bone density alone. Based in the research so far, trans Men that transition to female maintain their bone density or have had little change in bone density after their hormone replacement therapies. There is a higher incidence of low bone density in these men (than normal healthy men), not because of the hormones, but their lifestyle and the choices they made to live as trans before their procedures. An athletic man that transitions is never going to lose that bone density, a weight lifter of any kind is most CERTAINLY never going to lose that bone density; their bones are consistently stimulated and kept developing.\n\nI think because of how new this trans stuff is and how little research we have, these organizations like the Olympics, that are constantly trying to be politically correct, are kind of stuck with trying to find scientific ways of dealing with this stuff, but the scientific research is non existent. What little research there is, is inconclusive or suffers from the near impossible of research that tries to compare men's physiology, with women's physiology, with trans men & transwomen's physiology, PLUS the mental & behavioral aspects of associated with these different peoples.\n\nThese are lot of considerations to be made, with very little science involved. At the end of the day the Olympic commission had to make a choice with what little they have, and being the politically correct liberal westerners that they are, they went with the liberal westerner choice.",
            "title_similarity": "0.65211606",
            "sentiment_compound": 0.9662
        },
        {
            "id": "h2v8f71",
            "score": 1,
            "text": "The fundamental issue here is that sports are an arbitrary game, separated by gender to begin with. If genders weren't separated in sport, trans people would be fine to compete without any need for discussion, barring allowable hormone replacement levels. \n\nMy position is that all women (shouldn't have to say this, but including trans women) should be allowed to compete in the male events. If you arbitrarily bar men from the women's events, Why not barr trans women and anyone else you want that you think has an advantage genetically.",
            "title_similarity": "0.8611546",
            "sentiment_compound": 0.5187
        },
        {
            "id": "h2v8ljf",
            "score": 1,
            "text": "You know what would change your mind about this? Consider that there is no good faith arguments that can happen at this point in time. There will be a time and a place for a discussion about this topic, but right now in today's climate this will only be used to discriminate and hurt trans people by saying they are not who they are and segregate people even more. This is only used as a tool for bad faith arguments right now.",
            "title_similarity": "0.6645705",
            "sentiment_compound": -0.9249
        },
        {
            "id": "h2v8zas",
            "score": 1,
            "text": "I think everyone knows it's an issue but people these days people care more about agreeing with the crowd than actually giving their opinion.",
            "title_similarity": "0.6068786",
            "sentiment_compound": 0.8983
        },
        {
            "id": "h2v93l0",
            "score": 1,
            "text": "I think the real discussion should be about how we separate people into categories for sport as people are so wildly different regardless of gender that the way its done now of just separating people by male/female is so haphazard and issues have always existed, just it's more noticed now because of transphobes (not referring to OP here)",
            "title_similarity": "0.7666927",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v97m0",
            "score": 2,
            "text": "Yes there is a legitimate discussion there, especially for trans women competing in women's sports. The most common argument against the idea is that trans women at their initial stage of transition have high testosterone levels and muscle mass which gives them an unfair advantage over women. It's an honest point worth looking into but the LGBT community view such discussions as fostering the idea that trans women are not women and therefore discriminatory. \n\nIt's sad though that simply engaging a discussion on this topic will get you labeled \"transphobic\" or \"bigot\". It now appears to be mantra of the LGBT community to avoid counter opinions or ideas that they perceive to challenge their lifestyle.",
            "title_similarity": "0.87281287",
            "sentiment_compound": -0.3376
        },
        {
            "id": "h2v9pdy",
            "score": 1,
            "text": "It's a white supremacist moral panic. Move along",
            "title_similarity": "0.3541032",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2v9xnc",
            "score": 1,
            "text": "IMO, you either have both Men and Women competing in the same events, against each other, or have a completely separate ranking for trans athletes. There are other options, but this is how I see it as easiest to figure out",
            "title_similarity": "0.81627196",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2va0v3",
            "score": 1,
            "text": "British Journal of Sport Medicine is currently the top ranked journal in sport science. Their latest review https://bjsm.bmj.com/content/early/2021/02/28/bjsports-2020-103106 showed that after 3 years of hormone treatment, MtF are still stronger than biological Female. So MtF athletes definitely should not compete with female athletes until there is strong evidence that they are equal after certain period of treatment",
            "title_similarity": "0.63721687",
            "sentiment_compound": 0.8948
        },
        {
            "id": "h2va603",
            "score": 1,
            "text": "I mean it’s a pretty open & shut discussion. Not a whole lot really needs to be said.\n\nA biological male cannot compete with biological women.",
            "title_similarity": "0.5577227",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2va9qf",
            "score": 1,
            "text": "All these paragraph long posts.. it takes approximately 2 brain cells to realize that men have an advantage in sports. Men in dresses are still men, even if you call them “trans women”. Pull your heads out of your asses ffs. Morons.",
            "title_similarity": "0.71033764",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h2vafxw",
            "score": 1,
            "text": "I give u one better I don't accept  TODAYS Trans people at all.  It's a crazy delusion you cannot be the other gender no matter how much you try.  You can only be a Trans person not the whole other gender and then there is sports. What a fucking shit show.",
            "title_similarity": "0.74759233",
            "sentiment_compound": -0.6859
        },
        {
            "id": "h2vat7x",
            "score": 1,
            "text": "There is legitimate discussion to be had about anything.",
            "title_similarity": "0.32979932",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vbr8w",
            "score": 1,
            "text": "Honestly, I think they should have a section that both men and women can compete in, so it doesn't matter what gender you identify as. If they already have something like that just forget this post.",
            "title_similarity": "0.80151117",
            "sentiment_compound": 0.5044
        },
        {
            "id": "h2vbw40",
            "score": 1,
            "text": "The Olympics committee disagrees",
            "title_similarity": "0.31948274",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2vch4h",
            "score": 1,
            "text": "And how many women who are now men want to compete against men in sports? I would say very few.",
            "title_similarity": "0.6291343",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2vcoet",
            "score": 1,
            "text": "There are plenty of other classifications in sports other than just men’s and women’s.\n\nYou have weight divisions in plenty of sports, without them being branded as discriminatory. \n\nThe Paralympics literally categorises athletes by how disabled they are, without being branded as ableist.\n\nSimilarly, you have people like [Caster Semenya](https://en.m.wikipedia.org/wiki/Caster_Semenya) who is currently appealing a ban from certain events based on her *natural* testosterone levels.\n\nSo now we have the ability to test a person’s testosterone levels, the means and knowledge to control a person’s testosterone levels, would it not make sense to classify events based on testosterone levels rather than binary gender?",
            "title_similarity": "0.7480068",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2vcp8h",
            "score": 1,
            "text": "Oh I fully agree. The big issue is that..well...\n\nIt's not being done properly. Almost every single discussion I have seen on the subject is either political/religious horseshit from unrelated political debates or done on a level that...affects exactly nothing at the moment. \n\nOr it's completely batshit like the Florida law that would allow grown men to check underage genitals.",
            "title_similarity": "0.61346066",
            "sentiment_compound": 0.7559
        },
        {
            "id": "h2vcw8o",
            "score": 1,
            "text": "It is a 0.0001% of the population problem.",
            "title_similarity": "0.14396624",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2vcy1a",
            "score": 1,
            "text": "We have men's competition and women's competition, why not add a third? Assorted gender competition!",
            "title_similarity": "0.61456776",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vd0k9",
            "score": 1,
            "text": "Yea, and it almost always begins or devolves into thinly veiled transphobia. So... yea.",
            "title_similarity": "0.35414487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vdosj",
            "score": 1,
            "text": "Bring on the steroid games let’s see what humans can do",
            "title_similarity": "0.36298364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vduoy",
            "score": 1,
            "text": "The way I see it is that in sports it's not always just about physical strength, there is strategy discipline etc. No matter the biological sex we are all born differently with different strengths and cons and as long you train harder than someone who biologically on average is born stronger than you it doesn't necessarily mean they are stronger than you *now*",
            "title_similarity": "0.62574136",
            "sentiment_compound": 0.8758
        },
        {
            "id": "h2ve6vw",
            "score": 1,
            "text": "The trans athlete has extreme advantages. For one, her test cutoff is much higher than that of an average female. I think she's allowed to be at over 200ng/dl where the average woman is doing good to have over 90ng/dl. Among other advantages like not having a menstrual cycle to deal with. It is completely unfair..",
            "title_similarity": "0.67293787",
            "sentiment_compound": 0.743
        },
        {
            "id": "h2veb39",
            "score": 1,
            "text": "How come you always see female trans athletes but never male trans athletes. That’s the big problem",
            "title_similarity": "0.7484796",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h2vebfm",
            "score": 1,
            "text": "Just gunna jump right over the trans issue and say: \n\nLet women compete with men. Let them have their own league too. Let men have their own league but there should be a unisex leagues, too. \n\nHumans are evolving and tech in sport is getting ridiculous. Let women compete against men and trans folks. They *will* improve.",
            "title_similarity": "0.83280325",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2veew3",
            "score": 2,
            "text": "How about all sports be open to all genders and gender expressions and then set up in tier systems kinda like a weight class or skill level",
            "title_similarity": "0.5099584",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h2vefx5",
            "score": 1,
            "text": "This is the deepest, fairest dive into the subject I’ve seen: https://youtu.be/02FCYz8bOo8",
            "title_similarity": "0.34367144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vffi6",
            "score": 1,
            "text": "I do think it's fair to have a discussion about this, especially at competitive professional levels. I am personally not an expert but we obviously know so much more about human bodies, performance, training, natural differences, hormones, etc, which all impact someone's athletic performance. \n\nHowever I do not believe transgender children should be banned from playing sports at schools or join local groups. Sports are important in a young person's life and I think all kids should get to experience them, mostly because it encourages exercise, allows them to blow off steam, and teaches them skills, for example social skills in team sports.",
            "title_similarity": "0.80263144",
            "sentiment_compound": 0.887
        },
        {
            "id": "h2vfjau",
            "score": 1,
            "text": "https://bjsm.bmj.com/content/55/11/577.full?ijkey=yjlCzZVZFRDZzHz&keytype=ref",
            "title_similarity": "0.16985367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vfl6s",
            "score": 1,
            "text": "all i can say is that realizing who i was made me quit all organized sport. because i don’t want to be part of a bunch of other peoples “discussions”. i’ll just find new hobbies. not like getting into drawing or singing or some shit is any harder than living while transitioning is for someone. it’s just that, and i know you mean well, why are all the “important discussions” about people like me. never made by people like me. or really involved substantially by people like me. i played soccer and did track for fun. not to be reminded i’ll never be a “real” woman or even have the opportunity to start a biological family with someone i love.",
            "title_similarity": "0.7033702",
            "sentiment_compound": 0.9447
        },
        {
            "id": "h2vg1mp",
            "score": 1,
            "text": "Its pretty simple..make extra categories. Sports are a weird mix of \"lets test who has the best body to do certain tasks\" this is inherently exclusionary. Thats why we have womens sports now and the paralympics for example. Its very weird tbh. So why not just make 2 new categories so everyones happy?",
            "title_similarity": "0.747596",
            "sentiment_compound": 0.8953
        },
        {
            "id": "h2vgary",
            "score": 1,
            "text": "Genetics runs the gamut. There are many women naturally born with more muscle mass than other women. These women are allowed to compete without question. Why are transgender women, most of whom are undergoing hormone replacement to lower testosterone levels, suddenly a huge concern?\n\nAlso, regardless of the merits or lack thereof when it comes to this conversation. The origin of these laws and \"concerns\" are based in bigotry. You need only look at the rhetoric and originators of these bills to see that this is not a good faith argument.",
            "title_similarity": "0.7564645",
            "sentiment_compound": -0.6945
        },
        {
            "id": "h2vghau",
            "score": 1,
            "text": "Its easier to call someone ____phobic when they spit perfect logic than it is to accept you're wrong about something... \n\nLGBTQAI+ do it a lot...",
            "title_similarity": "0.57378924",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2vgugm",
            "score": 1,
            "text": "Maybe I'm wrong but I don't think anybody debating in good faith is really debating the idea that there are biological differences between sexes.\n\nWe are going through a very complex, fundamentally transformative social change. We're asking people to massively shift their thinking, and for people who haven't grown up around this shift, there is a lot to relearn. \n\nThere is a nuanced discussion to be had with, say, men transitioning into a woman then doing MMA. Would this give anyone an unfair advantage? Does oestrogen put 2 people on the same playing field? So many questions that most people don't know the scientific answers to. \n\nBut I think before a lot of people feel that they are safe to have that conversation absent bad faith or nastiness, the discussion is still on the big thing right now - Trans rights are human rights. I think before we can have the detailed discussions, we need to have everyone in agreement that everyone's right to humanity matters. If there's even a well intentioned and nuanced point raised, I suspect it feels like pushback to a lot of people, and a slowing down of the train of progress.",
            "title_similarity": "0.7255914",
            "sentiment_compound": 0.9572
        },
        {
            "id": "h2vgzb8",
            "score": 1,
            "text": "The real problem here is that you can’t say anything about trans people in public forum whatsoever without being crucified by people on both sides of the discussion. This is honestly what’s going to be the biggest problem for trans-rights...That just having the discussion at all has become vilified.",
            "title_similarity": "0.7121217",
            "sentiment_compound": -0.34
        }
    ]
}