{
    "CMV: A person should not be able to be charged with a DUI or DWI unless you are actually driving.\n\nWhen I was in college a roommate went out drinking one night, got in an arguement with someone in the bar, and decided to leave.  He realized that he had had too much to drink, so he called a ride.  It was mid August and super hot outside, so while he was waiting on his ride he sat in in his truck and ran the A/C.  A police officer saw him and took him in for a DWI and he was convicted.  It effected his employment and schooling for the next couple of years.\n\nI never liked the guy much, but I always thought he got a raw deal. He was doing the right thing and got the same penalty as if he decided to drive home.  You should be able to sleep it off in your car without fear of consequence.\n\nI have heard the argument that if the officer saw a drunk sitting in their car and just walked away from it, the person could start driving at any moment.  I argue that it would be just as easy to take the person home as it would be to take them to jail, and it doesnt ruin their life. The police could even take them to the jail to dry out for the night just to be sure, but there is no reason to suspend their license, fine, and imprison a person for simply sitting in their car with the keys in their possession, or even sitting in a running vehicle. \n\nTo head off the first argument I see coming, this doesn't apply to a vehicle in a lane of traffic, obviously if you are passed out at a stop sign or something you deserve a DWI.\n\nUpdate: After reading tons of comments my view has been changed marginally to believe that what he did should not be completely legal.  I believe that there should be some form of moderate traffic citation with a fine associated with it along with a ride home or a night in the drunk tank.  That way the police can prevent tragedies while not making the assumption that the person was definitely going to drive and ruining the person's life.\n\nDont expect any more replies from me, I have the day off with my family and I'm not spending any more time on my phone. Feel free to discuss amongst yourselves.": [
        {
            "id": "h3uz5w9",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.\n\nThank you for understanding.",
            "title_similarity": "0.5714286",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h3rm562",
            "score": -1,
            "text": "If a person points a loaded gun at your face, but ultimately doesn’t pull the trigger, would you argue it is a non-issue?\n\nA bar must be set to define when a situation unjustifiably increases the real risk of personal harm to others. Waiting until a drunk driver is actually driving sets the bar to “has pulled trigger, hopefully misses.”\n\nEdit: speling",
            "title_similarity": "0.72215724",
            "sentiment_compound": -0.8945
        },
        {
            "id": "h3rmalz",
            "score": 2,
            "text": "When I was a child, I would play tag in the playground.  There was this big pole that we used as “base”, so as long as you were touching the pole, you couldn’t be tagged as the next “It”.  There were some shitty fat kids who would never leave the base.  They would tease the “It” by going a foot away from the pole, but would immediately reach out to grab the pole if the “It” made any motion towards them.  It really sucked playing with those kids, and it made the game boring.\n\nYou can’t play these kinds of games with law enforcement.  If you are drunk and behind the wheel of a car, the default assumption is you could have driven under the influence.  There is no “base” because the car isn’t moving.  And hell, you’re drunk anyway.  You have poor judgment, and might be about to drive off.  You clearly weren’t sober enough to start the car from the passenger seat, which could have saved you.\n\nUnless you were forced to drink, it was entirely your decision and fault to get behind the wheel.",
            "title_similarity": "0.62092274",
            "sentiment_compound": -0.9727
        },
        {
            "id": "h3rgpsq",
            "score": 825,
            "text": "We have to draw the line of \"operating a motor vehicle\" at some point, and sitting in the seat with it powered up seems like a pretty dang good one to me.\n\nThe point of not allow machines to be operated while drunk is that you you 1. are less physically coordinated and prone to making mistakes and 2. have impaired judgment.\n\nWith that perspective isn't someone sitting there shitfaced with a powered up car and their hands by shifter and feet by pedals pretty dang risky?  \n\nIf you say \"not really\" then you're almost certainly going down the route of \"wasn't really too drunk to drive\" and \"most people are capable of safe operation even when above the legal limit\" and a bunch of other stuff we know is just generally not very true.",
            "title_similarity": "0.64089215",
            "sentiment_compound": 0.9099
        },
        {
            "id": "h3s2obv",
            "score": 1,
            "text": "So your drunk, sat in the drivers seat, keys in the ignition, your a good guy though and have no intention of driving home…\n\nA few hours into the night, your starting to feel uncomfortable, you look out, it’s quiet, suppose just this once won’t hurt, and off you go..\n\nAnd this is why. You are in control (even though not driving) of a 2 ton killing machine,  your brain functions are impaired, but you don’t realise that.\n\nThere has to be a line somewhere, the drivers seat is a fair one, you know the rule, you can choose to break it, but better a cop stops you at that point before you make a silly decision and make some kid have to grow up wondering why daddy didn’t come home that night, and why that guy in the van couldn’t have just looked behind him before pulling out.",
            "title_similarity": "0.7390832",
            "sentiment_compound": 0.1182
        },
        {
            "id": "h3s2zfx",
            "score": -1,
            "text": "Then no one can be charged, since they have stopped driving to be pulled over. Genius level.\n\nYou're friend was lying to you.",
            "title_similarity": "0.5911075",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h3rmspm",
            "score": 139,
            "text": "I think you're focusing on the driving aspect to the exclusion of the operating aspect.\n\nYour friend was legitimately operating the motor, there was ongoing transfer from chemical energy to kinetic energy happening within the engine in order to power the fan and the AC. \n\nThat process was giving off toxic fumes and heat that are normal for the operation of an internal combustion engine, but are meant to be monitored by a competent person. Your friend was not competent due to intoxication.\n\nIf a person parks a car and leaves it running but doesn't properly engage the brakes or if the car goes into gear they are responsible for the effects of the vehicle's activity even though they were not present. That's because they are the operator of the machine and a drunk person cannot legally be the operator of a car.",
            "title_similarity": "0.7507118",
            "sentiment_compound": 0.7621
        },
        {
            "id": "h3ry93w",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3ridmk",
            "score": 7,
            "text": "This is definitely a tough one as others have pointed out you could have operated a vehicle, parked or stopped. \n\nThe statutes vary by state, so this is in effect in certain places. https://dui.drivinglaws.org/resources/can-i-get-a-dui-for-sitting-in-a-parked-car-while-drunk.html\n\nPhysical control is really the sticking point as you started a vehicle and could have been operating that vehicle. Without video evidence it's fairly difficult to prove the negative of not operating the vehicle. \n\nIn most cases it's way easier to plan ahead for a ride.",
            "title_similarity": "0.68153524",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3rfdxv",
            "score": 252,
            "text": "Was he in the driver seat?  Perhaps in these circumstances in order to show you are not intending to drive you sit in the passenger seat or a back seat.  Otherwise I can totally understand law enforcement erring on the side of caution.\n\nBetter a ticket to someone who \"may\" have been intending to drive, than allowing drunk people, you know, people who may not be thinking correctly suddenly deciding they are now well enough to drive.",
            "title_similarity": "0.6766045",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3rx9ke",
            "score": 6,
            "text": "The problem with your argument is that our society frequently punishes people for behaving as though they are about to commit a wrongful act, and for good reason. \n\nImagine you own a shop and I come in with a gun and point it at you. I don’t shoot, I just point. I stand there and look at you with the barrel pointed your way and say nothing at all. At some point, I get bored and leave. Should my behavior be allowed? I mean, I didn’t actually shoot you I just made it look like I was about to shoot you.\n\nOf course in our society I would rightfully be charged with the crime of feloniously pointing a firearm. \n\nWe punish people for these things because though they are not the actual “bad act” in themselves, the preparation gives way to more opportunity for the harm to occur. By pointing the firearm at you, I’ve taken the majority of steps in killing you. Perhaps my finger slips, perhaps I just change my mind and decide to kill you anyway. After all, I wouldn’t have to do much else if that was the case.\n\nLaws like this are meant to deter us from increasing the chances of harm. When I point a gun at you, even if I don’t mean to go through with it, the chances I hurt you go up significantly. \n\nIn your friend’s case, our society punishes his behavior because he’s done everything he can to drive under the influence except put the car in motion. What this means is he’s significantly more likely to actually commit the bad act than if he was sitting on the curb. He could be, for example, so drunk that he accidentally puts the car in drive or reverse while trying to do something else within the car, something that could not happen unless he was drunk sitting in the front seat with the car on. What if your friend is sitting in the car and in his drunken state he says “fuck it, I’m already here. Might as well drive.” Getting in the car and turning it on significantly increases the chances he will make that decision. \n\nThe law prohibits operating a vehicle AT ALL while drunk because a vehicle is a big responsibility. Even while parked, when the car is at rest malfunctions can occur. The malfunctions are less likely to cause harm if they are tended to by a sober person. \n\nAgain, this is extremely common in the law to criminalize behavior that is more likely to lead to objectionable acts. I agree that your friend is not the most important person that this law targets, but let me give you the most important argument for why this law exists:\n\nMost drunk people sitting in a parked car that is turned on are not like your friend. Most are sitting in that car because they are about to drive their car. If a police officer can stop them before they are in motion, that means that a police officer essentially stopped them before the opportunity to harm people. Your argument is like saying that someone should be allowed to do everything they need to do to commit a crime and the police have no recourse to stop them until they actually do it. That not how the law has worked throughout history, nor would it be sound public policy.",
            "title_similarity": "0.71459067",
            "sentiment_compound": -0.9916
        },
        {
            "id": "h3ryf83",
            "score": 0,
            "text": "Disagreed, the idea is that someone sitting in the driver's seat is MORE likely to drive. And also, urm... That'd be a nice cop. As far as the law is concerned he's slapping the DUI on 'em, but a nice cop who actually cares about the person would try to intervene. I MAYBE agree, that the cop should intervene and ask them to contact their friends or something, a cab, or to be taken to the police station and if they refuse ALL of that, THEN be slapped with a DUI.  \n\n\nNot to mention, that the stopped car could be that the person DROVE all the way there, the cop couldn't really know. Either way, this is not a very smart thing to do and if I was in that situation where I was VERY clearly drunk and didn't intend on driving, I'd just sit in the back/the passenger seat. Cops can't accuse me of anything, I can even have the car running and get a friend to drive me, AND it looks like I'm waiting for someone.",
            "title_similarity": "0.720073",
            "sentiment_compound": 0.9581
        },
        {
            "id": "h3s4jxu",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3s95n4",
            "score": 0,
            "text": "is this some american problem I'm too european to undestand?",
            "title_similarity": "0.33462963",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3t4fc5",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3t6620",
            "score": 0,
            "text": "My neighbor (let's call him fuck face because every second word out of his mouth is fuck at full volume) was outside in his driveway blaring music from his car at a high volume. I had just gotten back from work and it was nearly midnight. It was a long day because I had started work at 7:30 and wasn't going to put up with fuck face's bull shit. I called the police for a noise complaint and was surprised that they took him away in handcuffs. They came back later with a tow truck. It apparently was his second DUI. I think he lost his job too because he could no longer get to work. Did he deserve this harsh treatment. Absolutely, the guy is an absolute loser and karma cashed in.",
            "title_similarity": "0.8680401",
            "sentiment_compound": -0.9768
        },
        {
            "id": "h3tfmq6",
            "score": 0,
            "text": "__On Thanksgiving in 2002, my 18-year-old brother went to the store for some extra cranberry sauce and never came home. He was killed by a drunk driver.__ Witnesses from the bar where the ~~driver~~ murderer had been at earlier in the day said that he told people he was going to his car to “sleep it off” until he was sober. That lasted all of an hour before he turned on the ignition, and drove into my brother at 100 mph in a 35mph zone. He hit my brother’s car, which spun it into a big truck in oncoming traffic. My brother suffered a direct hit to the head, but was alive and semi-conscious when he was pulled out of the car. The driver of the big truck suffered fractures to the legs and pelvis. A young woman in a car that just missed being hit cradled my brother in her arms until the EMTs arrived. Before passing out, he uttered his last words to her: “Others ok?” That was the kind of guy he was: concerned about other people. She came to the hospital to tell us about his final moments of consciousness — still covered in his blood and her vomit. So not only did our family suffer, but so did bystanders, the innocent driver of the big truck, and the emergency personnel. The drunk driver, however, wasn’t injured (enough) to prevent him from physically fleeing the scene. He has never been found and we believe he left the country. \n\n__The driver had many choices that day:__ call a taxi or ask somebody to call one, take a bus, give his keys to somebody, ask a friend for a ride (of which there were many at the bar, including sober drivers), stay at the bar to sober up, get in his car and toss the keys in the trunk (which I’ve known people to do), and so on. While he may have *intended* to sleep it off, that either wasn’t a long enough time period or he just changed his mind. We’ll never know because, like I said, he was never caught.\n\nMy brother spent three days in the ICU before it was clear he wouldn’t regain brain function and we had to take him off life support. We practically carried mom outside to the lawn of the hospital so she could just scream and scream. __Unless you’ve heard it first hand, there is no forgetting the sound of a mother who has just lost a child.__ __There is no forgetting the image burned into my mind of dad laying on the ground next to my brother’s grave, using his bare hands to scoop earth onto the coffin.__\n\nJust for remembrance... my brother was a gentle soul, and incredibly thoughtful: he went to the store to get cranberry sauce because he knew our 4-year-old cousin loved the chunky kind and we didn’t have any. We’ve never told her that was the reason he went, and never will. He had a wicked sense of humor, was great with anything mechanical, and loved harmless pranks: he once re-engineered the toaster to pop up with extra force so the toast would go flying a foot into the air. He had just started college and wanted to be an mechanical engineer. He had ADHD and dyslexia, so even getting to college was a huge accomplishment. __One final thing about him: my brother was an organ donor.__ We’ve met several people whose lives were saved from the transplants — including the person who got his heart. So please consider signing up to be an organ donor. I hope it’s never necessary, but it’s a moment of grace in tragedy. \n\n__So, all of this is to say that while the driver who killed my brother wasn’t caught before he could drive, the law that allows a DUI for sitting with keys in the vehicle can save lives.__ And it should be enforced.",
            "title_similarity": "0.8642856",
            "sentiment_compound": 0.965
        },
        {
            "id": "h3tl5e0",
            "score": 0,
            "text": "The police aren’t ubers. Tell your snowflake friend to wait in the heat next time or don’t get drunk.",
            "title_similarity": "0.5507283",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h3u354d",
            "score": 0,
            "text": "Its simple really. If the keys are in the ignition you can receive a DUI. If you sit in the car and your keys are in your trunk, you won't receive a DUI. \n\nI have a DUI. Its pretty simple to understand.",
            "title_similarity": "0.55165416",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3rfg6p",
            "score": 82,
            "text": "I think the reason they arrest for that is because some people try to be sneaky and just pull over and pretend they weren't drining if there is a cop around. Here is a great example of someone who claimed they were just 'waiting for a mate' when clearly they have been driving.\n\nhttps://youtu.be/N0ALppj8Anc\n\nIt isn't always that obvious though.\n\nI have heard in the past that you'd be allowed to get into the back of your car as long as you don't have keys in the ignition and you aren't in the driver's seat, but not sure what the exact law is and how much it would vary by state and country.",
            "title_similarity": "0.7260655",
            "sentiment_compound": -0.101
        },
        {
            "id": "h3s03il",
            "score": -1,
            "text": "Your friend should have sat in the passengers seat.  \nProblem solved",
            "title_similarity": "0.42019394",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3s2q37",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3s5lb3",
            "score": 1,
            "text": "Jesus all these fuckin drunks in the comments wanting to defend their/ their friends/ family’s shitty behavior. Just don’t sit in your damn car if you’re drunk. Take an Uber. Plan ahead if you wanna get shitfaced. I knew a guy who got a DUI for falling asleep drunk in his neighbor’s yard with his car keys in his pocket. It was fairly obvious he’d driven home shitfaced and just fell asleep outside so he got charged.",
            "title_similarity": "0.891837",
            "sentiment_compound": -0.8646
        },
        {
            "id": "h3sw5lc",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3rrgpq",
            "score": 8,
            "text": "I think the main issue here is enforcement. To enforce a law that supposed to be preventative, because god knows people will find the loophole to just park their car and pretend to not be operating, then how would you write it? You can’t single out parking lots as safe spaces  - drunk drivers can exploit that loophole. \n\nDrunk drivers can ONLY be convicted while in motion? Do you know how many lawyers would get legitimate drunk drivers off because of that? \n\nIn terms of prosecuting a law, you would genuinely HAVE to make it full-stop behind the wheel, keys in ignition.",
            "title_similarity": "0.77379626",
            "sentiment_compound": -0.5484
        },
        {
            "id": "h3rnsn6",
            "score": 7,
            "text": "/u/GrannyLow (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/oc2r0e/deltas_awarded_in_cmv_a_person_should_not_be_able/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.4046145",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3swwxb",
            "score": 2,
            "text": "Agree 100% . We need to encourage better choices.   For many people a ride home with out their car doesn’t help much, they still need to get to work. Now if they can’t afford an Uber or whatever maybe they shouldn’t be drinking at the bar, but this is about making better choices, we’re not perfect.\n\nIf we want to save lives we need to encourage better choices.  If you’re tired we encourage a driver to pull over and rest rather than push through right? Drowsy driving is just as dangerous.\n\nThe difference is policing is less and less about actual safety and more and more about revenue generation under the guise of safety. \n\nI think we need an established “I’m sleeping it off recovery procedure “ for motor vehicles. The engine can be on but you’re not in the driver’s seat.  I had a sister in law accidentally mix some alcohol with antidepressants and she blacked out. It was -20f outside, she wandering around walking home . She eventually found an unlocked car to sleep in, long story later she’s better now. Point is the drunk / impaired brain is often incapable of making the perfect choice, or the best choice. If they can pull over and sleep it off , I’m all for that better choice as opposed to just trying to get home and then hurting someone.",
            "title_similarity": "0.70210284",
            "sentiment_compound": 0.9841
        },
        {
            "id": "h3t17z7",
            "score": 2,
            "text": "No, I won’t attempt to change your view, because you’re right.  As long as the vehicle is in park, there should be no convictions as nobody is in any danger.\n\nThe current law is BS and is made to reinforce the prison industry and to generate revenue for the state.  It is not about keeping people safe.",
            "title_similarity": "0.5003607",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h3t4o7q",
            "score": 2,
            "text": "Well, it seems like people believe if you own a car, you should never be allowed to drive.  I can’t believe people are okay with some of these laws.  You can’t sit in your car with keys not even in it in some cases and people are arguing it is okay.  DUI should only be enforced if the driver puts the car in motion.  Period.  DRIVING under the influence.  The logic is that someone is sitting in a car, so therefore can drive.  That same logic says if I get drunk at home, and own a car, I could drive so I should be charged.  I don’t even drink, and this is horribly flawed logic.",
            "title_similarity": "0.7883874",
            "sentiment_compound": -0.743
        },
        {
            "id": "h3u02tg",
            "score": 2,
            "text": "OWI enforcement/prosecution in America is nothing but a racket. It began with, and continues to hide behind, a good, noble cause (drunk driving, REAL drunk, inebriated driving should be illegal, because it DOES indeed kill people, all the time). But most drunk driving convictions involve someone getting pulled over for dubious reasons and then blowing .08-.09 on a breathalyzer. It's no longer about keeping people safe. Its turned into a revenue generating scheme used by local governments to pad their budgets with. \n\nMADD doesnt want people driving drunk.\n\nOther drivers dont want people driving drunk.\n\nBut a lot of people on the executive side of the government DO want people getting busted for it. \n\nThat's why they lowered the limit to .08. .08 bac is not drunk driving. Not even a teenager would feel intoxicated @ .08 bac. To this day, there is still no scientific basis whatsoever for setting the legal limit so low.\n\nIt's also why people get convicted of drunk driving simply for sleeping it off in a parked car that isnt even running. \n\nOver time, the police learn what people do, and then they figure out how to criminalize it, so they can monetize it! \n\nDoesn't make a bit of difference if it's fair. They believe that anyone out late at night getting drunk doesnt deserve to be treated fairly, they deserve to be targeted by law enforcement, excessively punished, and exploited for money.\n\nIf the government was truly concerned about people's safety, all theyd have to do to virtually end drunk driving is mandate that all newly manufactured vehicles be equipped with ignition interlock devices that require a clean breathalyzer reading to operate.\n\nUsing just 6 month's worth of OWI fine revenue collected nationwide, they could pay for this for the next 10 years.\n\nBut the govt would never do this, because  they aren't concerned with drunk driving, nor are they concerned with people's safety, nor are they concerned with passing and enforcing fair legislation. \n\n**All they care about is the money train that follows each conviction.**",
            "title_similarity": "0.8009087",
            "sentiment_compound": -0.9374
        },
        {
            "id": "h3rkjg7",
            "score": 62,
            "text": "It sounds like they had a horrible defense attorney. It should have been reduced to a lesser charge if he never drove and was able to show that he called a ride who was en route. Not sure what part of the world this was in, but your friend may be able to get it expunged over time as long as they don’t commit any other “crimes”. I get that the arresting officer was just following procedures, but they could have confirmed he had a ride and had him turn his keys in to the bar or taken them to the station for him to get the next day… something other than an arrest and prosecution. I feel like there is a little more to the story.",
            "title_similarity": "0.7713938",
            "sentiment_compound": 0.3002
        },
        {
            "id": "h3rpqyh",
            "score": -3,
            "text": "Passenger seat.... Problem solved.",
            "title_similarity": "0.15522397",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h3rx7u3",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3rzrhi",
            "score": 2,
            "text": "How would this work for a tesla? The car is always on and your phone is the key. What if someone is watching netflix on the screen? How about if they put it in camping mode and fall aslepp?",
            "title_similarity": "0.5626407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3s36kj",
            "score": 2,
            "text": "In the U.K., if you’re sat in the drivers seat with the engine running, (regardless of it’s moving or not) you are responsible for that motor vehicle. \n\nIf you are intoxicated, you could make a bad call and try to move it/drive somewhere. You could accidentally put it in gear, or all manner of things. \n\nIt’s defined in law and makes sense really. No point creating grey areas in such laws, especially those laws that stop irresponsible people killing innocents. Similar to laws around heavy machinery",
            "title_similarity": "0.72037",
            "sentiment_compound": -0.9566
        },
        {
            "id": "h3rwrje",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3sbjx8",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3s6qcb",
            "score": 24,
            "text": "I think he would have a stronger case if he had been in the passenger seat or in the backseat \n\nNot quite the same thing, but I feel like it's a little bit like if someone had had 10 candy bars in their jeans pockets in a convenience store.  Like, maybe they *could* be using their pockets to carry their purchases instead of a grocery basket. I think technically it is only shoplifting after you leave with the items,... But having something hidden in your pants in the store isn't on the up and up either.",
            "title_similarity": "0.5908778",
            "sentiment_compound": 0.87
        },
        {
            "id": "h3rusdy",
            "score": 50,
            "text": "The DUI laws vary from state to state, but in CA there can be an argument that being in a parked car while drunk does not constitute a DUI. But being in the drivers seat, with the engine running, makes it very difficult to give the jury a reasonable doubt that you are not a “driver” as defined in the state vehicle code.",
            "title_similarity": "0.7200265",
            "sentiment_compound": -0.923
        },
        {
            "id": "h3rvky6",
            "score": 1,
            "text": "What state was he in?",
            "title_similarity": "0.020694565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rw06e",
            "score": 2,
            "text": "I agree with your thought here.\nUnless the vehicle is in motion it isn't impaired driving. \nIf you are found sleeping at the wheel with vehicle in gear that is dui.",
            "title_similarity": "0.42477983",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3rzmto",
            "score": 1,
            "text": "I generally agree with you, that the police officer should assess the situation and risk to the public and act appropriately BUT\nIf your friend was too drunk he should have sat in the passengers seat. (I know sometimes you have to depress the brake, ok, but then move to the passengers seat).",
            "title_similarity": "0.69537795",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h3s30k0",
            "score": 1,
            "text": "Laws that allow people to be charged with a DWI when not actually driving came about because drunk drivers would see cops (or heck just approaching headlights) and pull over, shut the car off, and claim to be not driving.\n\nI'm all for a system that allows someone too drunk to sleep in their car, but how do you write that law while preventing drunks from just pulling over real quick?\n\nMaybe based on engine heat? But that seems like a tricky thing, to try and train cops to lay hands on a hood and determine how long ago the car was last running.",
            "title_similarity": "0.8484336",
            "sentiment_compound": -0.1306
        },
        {
            "id": "h3s34ms",
            "score": 2,
            "text": "Im with you on this. If i wanna sleep it off in my car i should be able to do so. If im in an RV and its running and im drunk on the couch should i be charged with a DUI",
            "title_similarity": "0.7410755",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h3s5ymc",
            "score": 1,
            "text": "this is a broad spectrum comment for how law is perceived:  in some countries, they have a 20 year maximum sentence for any crime, including mas murder, the reason behind it for how i see it is that \"the law makes mistakes\"  with that said, the law will catch people who dont deserve it, but, there demise is for the greater good. wrongful arrest might make up 10% of arrests, but the government sees it as \"90% of true criminals are put behind bars\"  this might seem in-humane. But this is just a statistic a population can live with without making a civil uprising. \n\nit sucks, but when your in government, you rely on statistics, life isnt fair, and the government mostly looks for a \"greater good\" explanation then anything else.",
            "title_similarity": "0.65427387",
            "sentiment_compound": -0.6697
        },
        {
            "id": "h3s69o7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3s6f5t",
            "score": 5,
            "text": "There are a million rules regarding DUIs that are completely against everything else in our legal system. They are constant Jeopardy questions for aspiring lawyers both in the US and here in Canada. By any reasonable metric, almost everything we do regarding drinking and driving violates the factors of intent, mens rea, incapacity and several other things.\n\nThe response from the courts and the legislature has been consistent though. Yes, they are inconsistent with the bulk of the law. Yes, the public is served best by ignoring that.\n\nThat's it. Reddit and the public at large loves rule lawyering but the actual legal system doesn't for the most part. DUI investigations and prosecutions are clearly violating many, many basic tenets but we've decided that it doesn't matter and that's likely wise of us.\n\nNow, if you've got some money though, you can probably always get off due to the options for argument. Which annoys me to no end.",
            "title_similarity": "0.65620536",
            "sentiment_compound": -0.5124
        },
        {
            "id": "h3s6ghf",
            "score": 1,
            "text": "If the ride arrived while the cop was busting him, I might agree. But the law is the law and I’m sure the cop has heard every excuse in the book plus some more.  Without additional evidence he wasn’t bs’ing, I can see why the cop would bust him.",
            "title_similarity": "0.6250361",
            "sentiment_compound": 0.631
        },
        {
            "id": "h3s6yty",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3s7u3w",
            "score": 1,
            "text": "If he was in the passenger seat, then you have a point. But if he was sitting in the driver seat with the car on, he is technically operating it at that point. So the DUI was deserved.",
            "title_similarity": "0.64103925",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3s87ts",
            "score": 2,
            "text": "I have heard the argument that if the officer saw a drunk sitting in   \ntheir car and just walked away from it, the person could start driving   \nat any moment.  \n\nWell, if that was a valid argument you might as well have police walking around arresting intoxicated people everywhere...because you never know, they could get in their car and drive somewhere at any moment!",
            "title_similarity": "0.8287224",
            "sentiment_compound": -0.5411
        },
        {
            "id": "h3sd2ge",
            "score": 1,
            "text": "In TN you can be drunk sitting in the driver seat as long as the vehicle is turned off and the keys aren’t accessible, such as putting them in the trunk. Not sure how this applies with push button start though.",
            "title_similarity": "0.6938902",
            "sentiment_compound": -0.5207
        },
        {
            "id": "h3serun",
            "score": 1,
            "text": "I see both sides of the argument. To avoid such situations you should never drive to the bar in the first place. He was obviously going to drink drive home but then had one more tequila for the road and had a bright idea of getting in a vehicle and starting the engine. I wonder how it would have turned out if he was sat in the back or passenger seat, he could have claimed he was waiting for the driver to return 🤷🏻‍♂️",
            "title_similarity": "0.8590832",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3sf5cy",
            "score": 1,
            "text": "While I agree with your view, I can provide some info to the contrary.\n\nPolice officers cannot give you a ride, just like they can no longer help you if your keys are locked in your car (at least this is what an officer told me years ago).  They could get in trouble from Cab companies, Tow, or locksmith companies, for taking their business.\n\nSecond, it is just as easy for the person to turn on the car, NOT in the driver seat, and turn the AC on.  That way they are not capable of driving the car, as their feet are nowhere near the pedals.",
            "title_similarity": "0.7574535",
            "sentiment_compound": -0.1134
        },
        {
            "id": "h3sg956",
            "score": 1,
            "text": "I think the moment you turn the key whilst sitting in the driving seat you are operating the vehicle.\nIf he was sat in the passenger seat with vehicle running he would technically be operating the vehicle but could argue policeman was being unreasonable.\n\nThe problem is that he is drink and therefore could behave irrationally. He could start driving, you just don't know how your brain will react when drunk. We all do stupid things so it's better to avoid the scenarios all together.",
            "title_similarity": "0.7680025",
            "sentiment_compound": -0.9458
        },
        {
            "id": "h3sgs7g",
            "score": 1,
            "text": "If he really wanted A/C that hard, he could has sat on the passenger seat or back seats instead of the driver one. Very easy, and it doesn't give him the temptation to simply push the throttle",
            "title_similarity": "0.4601075",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h3sh67b",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3shjve",
            "score": 1,
            "text": "Police arent here to serve and protect theyre here to keep the general population in line and fill a quota.",
            "title_similarity": "0.49921903",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3shpj0",
            "score": 1,
            "text": "In Germany you can be as drunk as you want and not get a DUI or DWI as long as you don't drive. But if you even admit to ever having smoked weed or are caught in possession of it you can loose your driving license. I think that's really fucked up and all this just because it's not legal like alcohol",
            "title_similarity": "0.74732244",
            "sentiment_compound": -0.9195
        },
        {
            "id": "h3sifwu",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3sivjz",
            "score": 1,
            "text": "I think there is a point to be made here. In your friends case he got screwed, but you have to understand why being in the drivers seat of a running vehicle counts as a DUI. It’s just too easy for someone who was just driving or is about to start driving to pull over once they see a cop and get off so to say. \n\nNow there does need to be a change if someone is not in the drivers seat and/or the vehicle is not running. If someone decides to sleep it off in the backseat of their car they can get a dui if the keys are in the vehicle. That’s where the change should be made. If someone is not in the drivers seat of a vehicle, or/and if the vehicle is turned off they shouldn’t get a dui. If you’re not in the drivers seat or if the vehicle is off you’re not operating it and you are multiple steps away from operating it.",
            "title_similarity": "0.76732445",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h3sj2cw",
            "score": 1,
            "text": "How isn't it arbitrary if a hood can be 100 degrees hot and not driven, or 30 degrees cold and just driven? \n\nHow can that be an accurate test with the same challenge...100 degree hit hood might mean undriven and 30 degrees cold might be recently driven?\n\nAlso, how can it be accurate if the method of measure is to 'feel the hood'.  People aren't going to have any idea how many degrees they are feeling.\n\nShy of carrying around a heat-gun they won't know...and even with the heat gun both external temp and how long/short the person was driving comes into play\n\nFinally, a 'hand test' being the indicator will just open it up to abuse.  If a cop makes someone do the field blow kit, that's recorded and can be shown in court.  Same with the touch your nose, walk the line (which is why it's done in front of the dash cam) and even then those by themselves mean nothing more than justifing taking them to the police station and having them blow into the calibrated breathalyzer which gives an actual readout which is then used as evidence.",
            "title_similarity": "0.54417014",
            "sentiment_compound": -0.4329
        },
        {
            "id": "h3sj4l1",
            "score": 1,
            "text": "You can get a DUI in Florida on a bicycle... i would say sitting in a running car is more a DUI than riding a bike drunk...",
            "title_similarity": "0.58865076",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3sj7cj",
            "score": 1,
            "text": "I don't understand why we hold citizens to a higher standard then we hold law enforces. He ruined that guys life the whole system is busted this guy tried to do the right thing and got screwed for if he would have drove he would have had a better shot at getting home safe and not being thrown in jail.",
            "title_similarity": "0.7455269",
            "sentiment_compound": -0.128
        },
        {
            "id": "h3skc4u",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3skqm7",
            "score": 1,
            "text": "I have a friend from high school who got a DUI for sleeping in his car while drunk. He was literally in the back of his minivan.",
            "title_similarity": "0.80098075",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h3smlxz",
            "score": 1,
            "text": "Intent is important to consider here",
            "title_similarity": "-0.060837913",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h3smpd8",
            "score": 1,
            "text": "Out of curiosity, does the US have any laws about being drunk in charge of a firearm?    The DUI rules described by OP would presumably also apply to firearms?",
            "title_similarity": "0.6172749",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h3sp3q0",
            "score": 2,
            "text": "I'd never heard of this, but this does sound like a raw deal. I saw you mention that he had been in the driver's seat, which I do find strange and based on that I see how a cop would assume he was driving and think he should be arrested. It's true as others have said that he was technically operating the vehicle if he was sitting in the driver's seat and had the engine on.\n\nThat said, though, this sounds like an issue with policing behavior rather than the law (as it often is). Cops are pretty trigger-happy to arrest. This is something I think wouldn't really be fixed by changing the law/making it more specific... it's yet another example of cops being eager to jump to conclusions whether or not they're actually doing any good. I 100% understand the line of thinking that led a cop to arrest this dude because I know what the cop mentality is like. I don't agree that this was a good use of the justice system or that the dude got what he deserved. IMO, the cop should have waited it out to see if the guy tried to drive or not - since he was sitting outside a business, so it's just as reasonable to assume he's waiting for someone as it to assume he's been driving drunk.",
            "title_similarity": "0.7435965",
            "sentiment_compound": 0.9515
        },
        {
            "id": "h3spfxh",
            "score": 1,
            "text": "In a vehicle with engine on while on public property? I gotta side with the officer.\n\nIf it was parked on private property tho that changes things. I mean you don’t need a license to drive on your own property anyway.",
            "title_similarity": "0.6039115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sq8cm",
            "score": 1,
            "text": "What if they were laying in the back seat with it running? Does that matter at all? What if they had been in the passenger seat? If Im drunk and my wife is DD, drives us home but stops at a gas station for something, leaves the car running while I wait...would I get a DUI?",
            "title_similarity": "0.8215092",
            "sentiment_compound": -0.5439
        },
        {
            "id": "h3sqbpx",
            "score": 1,
            "text": "Beside the point, but, can we also have it so having a record being used against you when it comes to education?",
            "title_similarity": "0.33191812",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sqfj6",
            "score": 1,
            "text": "He could have sat in the passenger seat. That gives him a much more plausible excuse to the officer than the one he gave.",
            "title_similarity": "0.47501653",
            "sentiment_compound": 0.1477
        },
        {
            "id": "h3srd7u",
            "score": 5,
            "text": "I have a similar story.   Campus police at the University of Conn. \n\nA few of us went to visit our friend for the weekend.  This is the mid 90's.  We were staying in his dorm and some ahole pulled the fire alarm at 3am.\n\nWe were all drunk and sleeping when it happened.  Went outside to wait but it was freezing out.  Literally.  We were all in t shirts and my friend remembered that heleft his keys under his floor mat so we went to his car to run the heat and warm up.\n\nThe cop must have been watching us because as soon as he started the car we had a knock on the drivers window.  \"Have you been drinking?\"  \"Yes, but we're not going anywhere, just staying warm until we can go back into the dorm.\"\n\n\n\"Step out of the car please.\"\n\nHe was arrested and charged with OUI.",
            "title_similarity": "0.8642304",
            "sentiment_compound": 0.7615
        },
        {
            "id": "h3ssk6u",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3ssnd4",
            "score": 1,
            "text": "I think in the UK, if you want to sit in your vehicle when drunk, you need to ensure the keys aren’t in the car.",
            "title_similarity": "0.6192843",
            "sentiment_compound": 0.128
        },
        {
            "id": "h3st7vl",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3stgvp",
            "score": 1,
            "text": "A dui is operating a motor vehicle while drinking. I’d argue that by even being in the vehicle, and the keys being in the ignition, you are operating that vehicle.  \n\nHe easily could have sat in the back, or even outside on the curb if he didn’t want to take the chance. But he put the keys in and turned it over, that is an operation.",
            "title_similarity": "0.77988064",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h3sv6ms",
            "score": 1,
            "text": "Since \"Blackout Drunk\" is a thing, being in the drivers seat is a huge red flag to a police officer... Treble that if the vehicle's still running.\n\nGet a cab, or face repercussions for your irresponsible behavior.  If you have no way to get home without driving, *don't get fucking drunk*.",
            "title_similarity": "0.80099934",
            "sentiment_compound": -0.4492
        },
        {
            "id": "h3swde6",
            "score": 1,
            "text": "If you want to get drunk enough to not be able to drive, you should always have prearranged your ride situation. It’s 100% on you, the law isn’t a surprise. \n\nThat said, you should be able to be convicted. What if your friend had driven a few miles down the road, and then decided “I’m too drunk”. He didn’t hit anyone but clearly has now driven drunk. Should an officer that pulls up on them not be able to arrest them for DUI just because they aren’t moving when they obviously *did* drive to get that far while drunk?",
            "title_similarity": "0.80613136",
            "sentiment_compound": -0.5647
        },
        {
            "id": "h3swq1e",
            "score": 1,
            "text": "I agree, and I disagree.  Sitting in the drivers seat of a car that is running, is about like aiming a loaded rifle with your finger on the trigger.  Just because you aren’t actively shooting people does not mean you aren’t a threat.",
            "title_similarity": "0.5841053",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3swzsb",
            "score": 1,
            "text": "I think it's reasonable for a cop to assume the intent of a person, in a powered vehicle, behind the wheel, is to operate that vehicle. Had they turned the car on and sat in the passenger seat, they could've easily argued that \"Oh, my friend is getting smokes and is driving me home. I'm just the passenger\" or some other plausible excuse.",
            "title_similarity": "0.7002053",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h3sxa9n",
            "score": 1,
            "text": "I remember learning about this in driver's ed. He would have been okay if he put his keys on the backseat floor or in the glove box. Of course then he couldn't run the a/c, but he would not have gotten DUI. When I first learned this, I agreed with you. But now I'm a lot older & I think that the law is sound. Drunk people aren't able to use good reasoning skills, so it's a risk for them to be behind the wheel of a running car.",
            "title_similarity": "0.7760732",
            "sentiment_compound": 0.2034
        },
        {
            "id": "h3sxkgk",
            "score": 1,
            "text": "I think the issue is that if you're drunk and sitting in a running car you can easily decide to drive for a short distance or something. It also prevents people from claiming they were just sitting in the car while drunk.",
            "title_similarity": "0.66598475",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h3sy6h7",
            "score": 1,
            "text": "I've recently moved to a country where \"rules are rules\", from one where \"what are rules? Snacks? Smth with mayonnaise maybe?\".\n\nYou may think the former is more unfair, a lot of people punished for doing smth morally right or innocuous, and getting punished on a technicality. But here's the thing: it's easy to manage it. Just read the rules, and follow them. Yes, they may be dumb. They may make your situation illogical. BUT you're protected. Assuming you're not talking about a truck in the European sense (as in, a long-distance haul with living compartment), then yeah, it's unfair morally for the driver, sure. But he knew the rules, he broke the rules. If there's a crash, and he has proof he is innocent, it'll be easy. If it goes to court, he'll be fine. But what about the policeman just said \"yeah, the rule says X, but nvm\"... then the same can happen the other way around.\n\nCar crash with old people, specially old woman, where almost IMPOSSIBLE to get any compensation or condemnation for where I'm from. The rule just were not apply, not only because if they had a car was a sign they were pretty wealthy, but also \"deference and respect for the elders\". So basically your only recourse was \"pray you don't get hit by an old woman\". Hell, you yourself could easily be charged even if you had proof you were innocent, because \"poor old lady\".\n\nI will take \"rules as written\" anyday. And if the rule is \"no alcohol inside a vehicle (that's not also used as living quarters) then so be it\". It's easy and clear, either don't drink, or stay outside. AC is nice, but I've lived through >45C and done fine, and so have millions upon millions. If you're too weak for it, then use your brain, don't drink, get in, use the AC.\n\nFinally, if you're rich enough to afford a car, specially a large one, anyway, you're already doing pretty well to begin with.",
            "title_similarity": "0.5426904",
            "sentiment_compound": 0.9797
        },
        {
            "id": "h3sz2h9",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3t1inp",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3t1ld3",
            "score": 1,
            "text": "He could have just sat in the passenger seat or in the back of the car after turning it and the ac on.",
            "title_similarity": "0.49416262",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3t23gw",
            "score": 1,
            "text": "Here is another law that is messed up.. Say I buy a six-pack of beer on Tuesday and I grab one can or bottle and leave the rest in my car.  If I get pulled over on Friday I can be charged with open container. Since the pack of six beers only has five beers in it now. The six pack is considered \"open\" Even though all the 5 individual beers are closed and I blow a 0.0",
            "title_similarity": "0.7355373",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h3t23z0",
            "score": 1,
            "text": "TIL you can drunk drive as a passenger",
            "title_similarity": "0.51050645",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3t26wj",
            "score": 1,
            "text": "Something doesn't make sense. Sitting in a running car is not probably cause for a DUI. Something else happened.",
            "title_similarity": "0.4965951",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3t3w8v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3t3zf0",
            "score": 1,
            "text": "Wonder if he would have been convicted if he was sitting in the passenger seat.\nCop comes up and say you are waiting for the driver.",
            "title_similarity": "0.695398",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3t4io0",
            "score": 1,
            "text": "Actually that was the case where I used to live. I was drunk as shit sitting in my car and the cops rolled up and sobriety tested me but said they couldn’t charge me with anything because the keys weren’t in the ignition. \n\nI was just waiting for a ride and wanted to sit down.",
            "title_similarity": "0.8192948",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h3t4o3f",
            "score": 1,
            "text": "Ultimately what this comes down to is that the DUI offense is not about actually hurting anyone, it's about increasing *risk* to others, not about actually *doing* anything that damages others. \n\nEven when moving, it's not that you actually *hit* someone, it's that your lack of judgement has increased the risk that you *might* hit something.\n\nAnd being in the driver's seat with the engine running is *exactly* the same thing. \n\nIt's not that you're *doing* something, it's that your lack of judgement has caused you to do something that increases the *risk* that you *might* do something that would hurt people. \n\nIt would be very *easy* for someone at that level of lack of judgement to do something even just slightly dumb while sitting in the driver's seat with the engine running, such as accidentally (or stupidly) put the car in motion, and cause damage to a person or property. \n\nThat that's it. DUI is not about actually *doing* anything, it's about being in an activated 2 ton death machine while you lack the judgement to avoid doing something dumb. \n\nAnd finally: I don't know if you've ever been *seriously* drunk, but up at the blackout levels you don't even remember what you're doing 5 seconds after you do it. It's much less likely you'll be able to put together a sequence of actions, though (like getting out keys, putting them in the ignition, and correctly starting the car). So sitting in an active running car really *is* a risk to others. \n\nHe could have *easily* forgotten he  called the Uber at any moment and put his car into motion, hurting or killing a pedestrian in the parking lot.\n\nIf he'd been sitting in the passenger seat with the engine off but the windows down, I'd agree with you.",
            "title_similarity": "0.5826032",
            "sentiment_compound": -0.9665
        },
        {
            "id": "h3t4v5s",
            "score": 3,
            "text": "In Connecticut, “operating” a motor vehicle includes any action that “intentionally could set the motor power of the vehicle in motion.” This can refer to doing something as simple as putting your car key in the ignition. It could also include starting the engine with a remote, or even just opening the door. So in *theory*, if you’re sitting at home, three sheets to the wind, and go out to the garage to retrieve something from the car, the very act of opening the car door *could* be considered an act leading to physical operation of the car, and you *could* be arrested for DWI. \n\nGoing a step further, in CT a person is considered “under the influence” if their ability to drive is affected by alcohol or drugs to an “appreciable degree” (Infeld v. Sullivan, 151 Conn. 506 (1964)). This may be prosecuted with or without any direct evidence of his or her BAC. So you wouldn’t have to be above the legal limit to be charged, AND the state doesn’t need any direct evidence that you were intoxicated to convict you. \n\nThis is a pretty extreme example, but it’s theoretically possible to be charged and convicted in this circumstance under the law as written.",
            "title_similarity": "0.65573686",
            "sentiment_compound": -0.2382
        },
        {
            "id": "h3t5459",
            "score": 1,
            "text": "Not sure about other states but in mine, it’s illegal to just be in a motor vehicle with the keys while intoxicated whether it is running or not.",
            "title_similarity": "0.61295736",
            "sentiment_compound": -0.7492
        },
        {
            "id": "h3t5ri0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3t64b3",
            "score": 1,
            "text": "While the laws can be changed, there's no harm in differentiating yourself from a person who's willing to drive. A person who was going to drive off and then pretended to fall asleep looks exactly like the situation your friend was in.\n\nSo just don't sit in the drivers seat, don't start the engine, roll the windows down to as safe as it in depending on what area you're in, and doze off while being alert enough to respond to your phone.\n\nThese precautions will also help prevent doing something you would have done while asleep /drunk. Our inhibitions are low and there's no harm in staying safe, right? It's just a few moments to suffer, but everyone's safe EOD",
            "title_similarity": "0.6342507",
            "sentiment_compound": 0.8765
        },
        {
            "id": "h3t6a7m",
            "score": 1,
            "text": "My coworker drove to a bar, got drunk and planned to take an uber home. She went out to her car to get her purse, entered through the passenger side, and got a dui. A cop charged her with intent to drive while drinking. She had to pay a fine and to 100 hours community service. She was not driving, not planning to drive home. It was straight bs.",
            "title_similarity": "0.86792517",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h3t6nzl",
            "score": 1,
            "text": "In Norway you will lose your driver's license for drunk driving a scooter. Not like a moped, a literal [scooter](https://cdn.shopify.com/s/files/1/0251/7817/7615/products/micro-beginner-stunt-scooter-ramp-cyan-full.jpg?v=1614301441). Yes, your car driver's license.",
            "title_similarity": "0.7371671",
            "sentiment_compound": -0.5439
        },
        {
            "id": "h3t6t2l",
            "score": 1,
            "text": "Maybe this has been posted already. But could an officer in a situation like this not simply observe the “potential” offender while the car is not in motion and THEN IF the car is put into motion make the arrest then. I have to agree with OP the punishment does not fit the crime. A ticket would be almost understandable or a verbal warning. Making an arrest for something like this is not ethical simply because it is lawful",
            "title_similarity": "0.6152395",
            "sentiment_compound": -0.8605
        },
        {
            "id": "h3t74xl",
            "score": 1,
            "text": "Where are you located? I've live in 4 US states and in all of them you have to have the keys in the ignition for the officer to prove intent.\n\n&#x200B;\n\n>or even sitting in a running vehicle.\n\nReally? You don't think a drunk man sitting in a running car might be indicative of them about to drive it? This is certainly enough in my mind to arrest them, assuming they're in the driver's seat, to keep the rest of the people on the road safe. There's no reason for an officer or civilian to assume they're not about to drive drunk. \n\nNow some states have WAY too harsh punishments in general and will destroy your life on your first DUI; license  suspended and have to have breathalyzer installed for 6 months (which costs like 3 grand according to an old coworker). The punishment and handling of mistakes is where we should be most upset I think.",
            "title_similarity": "0.75133896",
            "sentiment_compound": -0.9392
        },
        {
            "id": "h3t7c8l",
            "score": 1,
            "text": "Not long ago a guy was trying to sleep off a hangover in his car outside of a convince store by my apartment. Apparently sometime around 6 in the morning, someone decided to call the police because the car sitting in the lot made them \"nervous\". Two officers arrived and less then 20 minutes later the entire block was shut down and a fucking SWAT team was moving in. The suspect fled on foot, two civilians got caught in the crossfire and wounded, and one officer kicked the stores window open so she could hold a gun to the cashier's head. Apparently he had the same name as the suspect- Mohammed- and he nearly lost his life for it. \n\nLater they claimed an officer \"thought he saw a gun\" in the parked car. It's horse shit. No gun was ever recovered from the car, which at this point was riddled with bullet holes and sitting in a ocean of shattered class. It took 5 hours to clean up the mess. And all of this just because a guy made a responsible decision and took himself off the road. It makes no fucking sense.",
            "title_similarity": "0.8812378",
            "sentiment_compound": -0.9506
        },
        {
            "id": "h3t7dic",
            "score": 1,
            "text": "The laws do need to be changed. If a person has a key fab and sits in the back,what then. I Live in newfoundland and know of a person who got convicted of a DUI for having the cars heat on during the winter to not freeze instead of driving home . I'm not advocating for giving people a chance to drive drunk but there needs to be a line.",
            "title_similarity": "0.7855553",
            "sentiment_compound": 0.0536
        },
        {
            "id": "h3t8itt",
            "score": 1,
            "text": "If you are going to be turning on the a/c, then they should be in a passenger seat and not the driver's seat. At least that would show the intention to not drive. Once you are in the driver's seat, it is assumed that you are trying to drive.",
            "title_similarity": "0.50172067",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3t8zbw",
            "score": 1,
            "text": "**\"Physical control of the vehicle.\" He was guilty 100% and deserved the arrest.**\n\nYou are wrong. He made a mistake. He will HOPEFULLY never make that mistake again. He was not on his own property.\n\nIf you made the mistake of drinking beyond your ability to function properly, you do not get to act like you aren't drunk. A drunk person is not allowed to have control of a running vehicle. That is a law.\n\nYou cannot have access to the keys if you sit in or sleep in your vehicle when failing to drink responsibly. Keys go outside the vehicle. Set them on a tire. Stick em in the fuel door.\n\nThe true issue with DUI/OWI is that if you run from the police and crash with drugs in the car, they won't charge you for the most dangerous aspect. You were fucking zonked out of your mind and drunk while operating the vehicle. Pisses me off.\n\nReddit is the glorious headquarters for the most fervent fanatical NOTHING IS MY RESPONSIBILITY mental illness club on earth. I AM NOT RESPONSIBLE FOR MY ACTIONS.\n\nPlease interact with law enforcement in real life. Go visit them.\n\nThe police take drunk people home every hour of every day. Sorry that they don't post it on reddit for the children to see.",
            "title_similarity": "0.7841517",
            "sentiment_compound": -0.8467
        },
        {
            "id": "h3t9buz",
            "score": 1,
            "text": "While his intentions were probably harmless, he shouldn't have turned the car on. He could have accidentally put the vehicle in motion and hurt someone else.",
            "title_similarity": "0.53331244",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h3t9ehp",
            "score": 1,
            "text": "I think keys in the ignition and car on means intent to drive.\n\nPerson in the car while hammered with keys not in the ignition should be told to get out and be taken home or something to a similar effect that removes them from the possibility of driving because they were in a car after all and also doesnt make the police a taxi service.\n\nI think the main logic is that if you are in a car you theres intent to use it for its purpose which would be driving and if you are under the influence then thats a no no.",
            "title_similarity": "0.7237571",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3t9r2h",
            "score": 1,
            "text": "If you have keys in your pocket in my state you have the potential to drive. You could not be even near your car. You literally have to physically give your keys away. I knew a guy that was charged with DUI because someone told the cops he was driving intoxicated. He got the court summons in the mail. No evidence whatsoever just eyewitness testimony. Trust me cops and prosecutors can ruin you without a shred of evidence.",
            "title_similarity": "0.8354436",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3ta200",
            "score": 1,
            "text": "So in the us, you can be charged for driving under the influence despite not being behind the wheel? the us are embarrassing.\n\nI would understand if you are charge for being complicit or not preventing the driver from driving. But this. Some things are debatable only in the US",
            "title_similarity": "0.630257",
            "sentiment_compound": -0.2876
        },
        {
            "id": "h3tajeu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3tazy1",
            "score": 1,
            "text": "There was a video I saw a while back from a Coos dash am where he was driving at night and came across a set of headlights just stopped in the middle of the road, blocking both lanes. As he got closer and got out, it turned out to be a guy who was hammered to the point he was asleep at the wheel. He has apparently driven at least that far, only to realize that he was passing out and stopped the car right in the middle of the road.     \n(To be fair, I don’t recall if the car was in park, or if he just had a parking break on (driving with it on) or if his sleeping just had him pressing on the break pedal. Either way, he was stopped. \nBy your definition, this guy would be still innocent right?     \nWhen the ignition is on, the car is more or less waiting for a command. It could be an accident that the individual hits it into gear (depending on the car, yes) and starts moving. That can still happen even in a turned off manual car, and so even that could almost be a bad thing depending on the officers risk assessment.",
            "title_similarity": "0.8153603",
            "sentiment_compound": -0.8093
        },
        {
            "id": "h3tb8cd",
            "score": 1,
            "text": "You could always start you car and sit in the passenger seat , that would work",
            "title_similarity": "0.42749935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3tbuwr",
            "score": 1,
            "text": "I've never been drunk, so I'm just going to go by what I've heard about this.\n\nWhen you're drunk, your inhibitions are lowered and you don't always realise that you're as drunk as you are. You are liable to do stupid things including deciding to make that stationary vehicle a moving vehicle, on impulse.\n\nThe officer that sees this wouldn't know what state of mind you're in when they come across you, so they do the safest thing that they can. Yes, it paints everyone with the same brush, but that's to prevent catastrophes that are preventable. It's judgemental for the best reason possible. \n\nAs for them charging the drunk person or not, I have no idea because I don't know much about the law, but I'm sure they have criteria to decide on that, and of course the person in question would probably have a lawyer to represent them.\n\nIt's ultimately done for the safety of everyone. Yeah, the officer could drop off said person at their home, but that may also be inconvenient for the officer. There are many external factors that are unique to situations, and a general guideline that's strict is the safest bet.\n\nIt just sucks for the guy you know. Maybe he was judged too harshly, but there may not have been a better and safer alternative available at that time.",
            "title_similarity": "0.68052053",
            "sentiment_compound": 0.9493
        },
        {
            "id": "h3tbvet",
            "score": 1,
            "text": "In my opinion In order to get a pass, you'd have to be in the back seat, away from any way of controlling the vehicle.\n\nThere's so many videos of people just sitting in their parking spot, about to reverse out, but suddenly just floor it and smash into something.",
            "title_similarity": "0.6571337",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3tbzyg",
            "score": 2,
            "text": "Just toss a wheel lock on and let them call to have it removed the next day.\n\nThat being said, if you are drunk in your car you should not be cited if you are not in the driver's seat.",
            "title_similarity": "0.7510989",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3td4nl",
            "score": 2,
            "text": "I think in this case, if he had merely been sleeping in say the passenger seat, with the keys not in the ignition I could see your argument holding its weight. \n\nBut by hun having the motor running, yeah it’s being operated. Step one of operation is turn it on. \n\nI’ve had my fair share of “car-campouts” where I poorly planned that I wouldn’t be drinking. I always place the keys in the locked trunk and sleep in the back seat with the driver seat fully reclined forward. Nobody can say I have been/will be driving if I don’t even have the key on me(and no your not searching my car, never consent!).",
            "title_similarity": "0.7456493",
            "sentiment_compound": 0.5095
        },
        {
            "id": "h3tdnxu",
            "score": 1,
            "text": "This is good and I had a similar situation I was out of town working I got off in middle of Aug went to a bar which was cpl streets away from our hotel tied a good one on so I was gonna walk back to hotel I am crossing the parking lot I hit the key fob  and locked the  truck now I'm going across the  highway and there is Walmart well as I stop in there to get some sober up food and I wanted trail mix so I go to aisle and there is a pallet in the aisle and no trail mix on the shelf so I start opening boxes if it wasn't trail mix I Chuck It over the shelf I don't find none the employee asked me to leave the store so I do as I'm about to hit the road to cross to hotel I see abunch of cops and they pulled up on me and asked me to stop so I obliged. They asked me if I had been drinking I said yes I parked my truck and am walking back to hotel right there they said well Walmart said I drove there drunk and came in the store and ran out so now they are making me do a sobriety test and then breath test I said I am not driving so what is all this they said DUI we have you on video small town in Kansas big gas town pipeliner... Jury convicted me of DUI and I didn't even get to plead my case court appointed because for a lawyer to drive down was like selling an organ. Court appt lawy said I worked out something even though the jury convicted you 30 days in jail and 1 year interlock one year probation sign here or you do the jurys recommendation of one year in jail and 5 yr probation I wasn't even driving",
            "title_similarity": "0.7917963",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h3tefr4",
            "score": 1,
            "text": "Your friend sounds to me like it was an edge case that slipped through the cracks.\n\nIf he could actually prove that he had ordered an Uber I feel like a reasonable judge would have let him off the hook.",
            "title_similarity": "0.60510457",
            "sentiment_compound": 0.8158
        },
        {
            "id": "h3tein1",
            "score": 1,
            "text": "Two points: \nOne: The cops couldn't know for sure if that guy was telling the truth when they found him at the wheel (and for that matter neither can you). Everyone who commits a common crime has an explanation for why it was a reasonable, fair-intentioned thing to do in the moment. Fair intentions don't uncommit a crime, and even if they did it wouldn't matter because cops can't read minds. They have to judge situations by the facts of people's actions.\n\nTwo: Even if he was telling the truth, imagine the ride he called was relly dragging their feet and he ends up sitting there behind the wheel of his running car for like 15 minutes and he's like \"this is stupid, my place is right down the block.\" People who have been drinking have impaired judgment and reduced inhibitions. Making little compromises of convenience is how normally reasonable and conscientious people end up in these situations.",
            "title_similarity": "0.6532428",
            "sentiment_compound": 0.0808
        },
        {
            "id": "h3tf07o",
            "score": 1,
            "text": "I agree with everything you said and the actions the police should have taken instead of giving him a DUI. Your friend truly did the right and responsible thing. I think he just chose the wrong seat. Like some correct me if im wrong but would the friend still get a DUI if he was in the passenger seat instead?",
            "title_similarity": "0.6146538",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h3tfkgf",
            "score": 1,
            "text": "It is a murky area with a hard to define answer. I can tell you as it is leads to many unnecessary arrests. I had a friend who was sitting in his car too after smoking weed with the engine on. Just parked in a lot, the officer saw him light up and he got busted for it. Thing was he also got a dwi, as per my states law he was required to have a breathalyzer installed in his car...for weed lol.",
            "title_similarity": "0.8422556",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3tfq6q",
            "score": 1,
            "text": "We need a better way to solve problems than the police. If you go to state power to solve problems they will go ahead and use that power to increase the power of the state. No DUIs should be our shared responsibility if we want less police nonsense, tweaking the rules still results in a regime of enforcement of punishment rather than solutions. How many people actually drive drunk in spite of the legal consequences? Apparently quite a few, we need a better solution than police.",
            "title_similarity": "0.58297276",
            "sentiment_compound": -0.2782
        },
        {
            "id": "h3tgltj",
            "score": 1,
            "text": "Drunk driving is serious and the cause of a lot of innocent deaths so yes, sitting in the driver's seat of a car that's powered on is pretty sufficient for the cop to ticket your friend.",
            "title_similarity": "0.7449868",
            "sentiment_compound": 0.8439
        },
        {
            "id": "h3thop7",
            "score": 7,
            "text": "Reading through this thread I can see why sitting in drivers seat with car running should have some level of criminality. It's poor judgement and puts people at risk, because a drunk person behind the wheel of a running parked car can become a drunk person behind the wheel of a running moving car very quickly and easily.\n\nHowever, I also am of the opinion that the law should be changed to allow for a spectrum. Perhaps this is achieved in practice on a case by case basis by lowering the charge to a lesser one like reckless driving, but I would prefer that be encapsulated into the law itself. For example, operating while intoxicated could be a lower charge than operating and driving while intoxicated. Operating alone might result in a fine but not suspended license and permanent record, or something along those lines.\n\nThat leaves some work to do by cops or judge to determine which law fits a given case. Guy sitting in parking lot beside bar, whose friend shows up 15 minutes later to give him a ride home? Pretty obvious. Guy sitting on side of highway with front end of car smashed into a tree? Also pretty obvious. There will be some cases that are less clear. If the cop isn't sure which charge is correct, that's what courts are for.",
            "title_similarity": "0.7098808",
            "sentiment_compound": 0.9134
        },
        {
            "id": "h3ththj",
            "score": 1,
            "text": "What if you started the car but sat in the passenger seat?",
            "title_similarity": "0.471748",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3thzw9",
            "score": 1,
            "text": "The problem is. If you are in a car while intoxicated, a police office has no way to know if you are just sitting in the car at the bar waiting on a ride, or if you just arrived at the bar while already intoxicated and haven't gotten out of the car yet. They have to assume you have operated the vehicle while intoxicated and go from that position.",
            "title_similarity": "0.80225724",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h3tix06",
            "score": 1,
            "text": "The law I’m America is heavily weighted towards intent, you can be charged with intent without being actually guilty of the crime. For instance attempted murder. There is not attempted dui, why? Driving under the influence is the charged let’s dissect that. Under the influence is clear, your mental state is altered. Let’s move on to driving. Driving a car is where people want to split hairs, what is driving? Is it movement? Let’s go further and see if driving is the term used on the charged but maybe not the term used to explain the charge. Let’s go back to attempted murder, maybe the person ment to maim not murder, but we don’t have attempted maiming on charges in America. The reason why is that a standing term is used with the charge title that describes a variation of possible infractions. So for the dui issue, the law normally states any operation of a vehicle. Operation is normally any interaction, opening a door would count here. Sitting in the car is also operating it even if the intent was to sit in the back seat. DUI is only normally vacated as a charge if there is another sober driver with intent and ability to operate the vehicle in the drivers seat at time of stop. \n\nSo, I think your looking at the word drive which is the term used for common English, but the law looks at intent and that any intent while under the influence without safe measures such as another driver are to high of a risk to draw a line between.\n\nOh also I don’t think you want someone to changed your view if you get defensive after everyone else’s response, that just makes you a prick.",
            "title_similarity": "0.69107556",
            "sentiment_compound": -0.9471
        },
        {
            "id": "h3tjmpr",
            "score": 1,
            "text": "Hi ou can sit in your car, you can't sit in your car with the car running. That is called operating a vehicle while under the influence.",
            "title_similarity": "0.5696065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3tjq77",
            "score": 1,
            "text": "OP, can you clarify if he was in a parking lot or street parking? Because this would change how the cop interpreted the situation. If it’s the former, I can truly understand the outrage, since there is a presumption that he is “parked;” if it was the latter, there could have some behavioral cues that the cop interpreted as “driving.” I mean, perhaps he accidentally shifted into drive, and the cop saw this… it seems like there may be a handful of elements that have gone unmentioned because you do not have all of the information? Also, was the ticket specifically for DUI? Was there any public intoxication element to it?",
            "title_similarity": "0.64916337",
            "sentiment_compound": -0.3094
        },
        {
            "id": "h3tkgeb",
            "score": 1,
            "text": "This happened to an acquaintance of mine, someone who I socialized with, but was more of a friend of a friend.\n\nDude was shitfaced drunk, driving home from who knows where (this was maybe 15 years ago, I may have been told what he was doing before at the time, but I don’t recall the details). He’s driving erratically, and even does some damage to a parked vehicle as he is close to home in his neighborhood. He wasn’t being tailed or followed by police at this point, but his vehicle was identified by a bystander who called 911. \n\nThis detail I’m not sure of exactly, but a cop showed up at his house. I don’t know if the bystander recognized it because they were close enough neighbors and knew who the guy was, or followed him home or what, point being the cop showed up after he managed to make it home in one piece. \n\nThe (drunk) driver at this point had already popped open another beer and was sitting either outside or in his garage, on the front porch, something like that, to where when the first time the cop laid eyes on him, that’s what he was doing.\n\nDon’t recall how things transpired from there, but the story basically ends with the guy getting off because while he did blow above the legal limit, the cop never saw him driving or get out of the vehicle exhibiting signs of inebriation, and there wasn’t any “proof” that he didn’t get drunk hammering beers at home after the fact.\n\nLaws are dumb. I agree with OP. It’s overly harsh and presumptuous to convict for DUI/DWI in this kind of case. Maybe a citation for disorderly conduct or public intoxication but not DUI. Totally different scenarios.",
            "title_similarity": "0.82415926",
            "sentiment_compound": -0.7962
        },
        {
            "id": "h3tki30",
            "score": 1,
            "text": "I’m pretty sure if you’re sitting in a car with it powered off it cannot be considered a DUI",
            "title_similarity": "0.49237725",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h3tki3q",
            "score": 1,
            "text": "I don't think you actually want your view changed based on these comments, should have put this on unpopular opinions lol",
            "title_similarity": "0.3814155",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h3tl0bw",
            "score": 1,
            "text": "I knew a guy at my college that went out drinking and came back to his dorm only to find he lost his room key. He must have had a spare car key stashed so he went to sleep in his car for the night . A few hours later the police woke him up from his car and arrested him for and OWI - still to this day that story makes me furious .",
            "title_similarity": "0.87282866",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h3tlmv3",
            "score": 1,
            "text": "When I was a kid, a classmate of mine and his father were killed when they were T-boned by a drunk driver (the driver was also killed).\n\nIt came out later that a woman had phoned the cops an hour or so earlier, as this man had parked in her driveway, sleeping in his car and obviously drunk. \n\nBecause the engine wasn't on (though the keys were in the ignition), the cops told her there was nothing they could do, and to call back if he left (I'm not sure why he wasn't charged with trespass, but anyway).\n\nThe drunk drove off, she called the cops, and my classmate died while they were on their way.",
            "title_similarity": "0.86853755",
            "sentiment_compound": -0.944
        },
        {
            "id": "h3tnbb0",
            "score": 1,
            "text": "He should’ve sat in the passenger side instead of behind the wheel lol. Even if the car was running with the AC at least he wouldn’t have been behind the wheel",
            "title_similarity": "0.58298683",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3tnhye",
            "score": 7,
            "text": "First, it sucks your friend got screwed like that, I’m sorry.\n\nIn my opinion here, the main problem is really that the law is poorly communicated. People hear “don’t drink and drive!” but the law is actually “don’t be drunk with your engine on.”\n\nYou said in another comment that “people shouldn’t be able to accidentally commit a crime”, and although that’s obviously difficult to achieve, I agree with the spirit of it. If “don’t be drunk with your engine on” was widely known, you probably wouldn’t be making this post, because then your friend would have just been brazenly breaking a law everyone knows about, instead of getting picked up on a technicality.\n\nI do also agree that moving and not moving should be treated differently, as well as other circumstances (eg “I can prove I called a ride”, “I’m in a parking lot”)\n\nBut as other people have pointed out, there are many perfectly acceptable “pre-hurting-people”-crimes - for example, I can’t walk around LA with a rocket launcher, and no one would be surprised if I was charged for that, and no one would say “he wasn’t going to hurt anyone with it!” - it doesn’t matter, rocket launchers are banned and everyone knows that. I can’t even own one at home.\n\nObviously owning a rocket launcher and sitting in the driver’s seat of a running car while drunk aren’t the same thing, but they’re both “harmless” patterns of behaviour which government/society has decided to prevent, for the greater good.\n\nSo my question is: would you still completely oppose a law against sitting in the driving seat with the engine turned on while drunk, if “don’t even turn on a car while drunk” (or something like that) was widely and very well understood?",
            "title_similarity": "0.6502775",
            "sentiment_compound": 0.756
        },
        {
            "id": "h3to28j",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3to56g",
            "score": 1,
            "text": "A lot of law is about intent. If the keys are in the ignition, and the car is on, it’s very reasonable that they are intending to use the vehicle.",
            "title_similarity": "0.38918674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3tomyz",
            "score": 1,
            "text": "If you sit on the passenger side of the car, you can't get charged with anything.",
            "title_similarity": "0.38630548",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h3tp5yu",
            "score": 1,
            "text": "It could be possible someone was driving before hand while drunk and pulled over when they thought a cop was near by. It’s also very convenient and easy for people to make up that lie and given the risks the cop can’t assume the person was actually just sitting in the car.",
            "title_similarity": "0.63239765",
            "sentiment_compound": 0.4336
        },
        {
            "id": "h3tqa5m",
            "score": 1,
            "text": "Pro tip: if you're gonna sit in your car drunk, do it in the passenger seat.",
            "title_similarity": "0.65878785",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3trdpv",
            "score": 1,
            "text": "Some countries are like this, but the issue occurs when someone is drunk and pulled over realizing it wasn't safe driving, but that means they're in a spot that was impossible to get to without drinking and driving in the first place.",
            "title_similarity": "0.7266593",
            "sentiment_compound": -0.6661
        },
        {
            "id": "h3trrtr",
            "score": 1,
            "text": "a bit related, but when i was 16 i got a DUI for being high in my car (keys were in the ignition) and now I can't have any driving related jobs and my insurance is fucked until im 26. kinda fucked up to do that to punish a dumb 16 y/o for 10 years.",
            "title_similarity": "0.81811625",
            "sentiment_compound": -0.9745
        },
        {
            "id": "h3tsmlh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3tsydr",
            "score": 1,
            "text": "I was on a jury for something like this.  A guy and his fiancé in a car in a blizzard, the engine was on but no driving. They were waiting for someone to come get them. The officer never observed the car moving. \n\nMade for an interesting convo of when is a vehicle a vehicle and when does it become a shelter?  Is a vehicle always a vehicle or only when it is moving? Is it one when it has the ability to move (not broken)?\n\nEven the judge,  after the fact, admitted that there are gray areas for this kind of stuff which is why it went to trial.",
            "title_similarity": "0.770078",
            "sentiment_compound": 0.8727
        },
        {
            "id": "h3tsz9b",
            "score": 1,
            "text": "Anybody still defending charging someone with DUI just because the car is on, get real. There are parts of the U.S. west coast that are hotter than anytime in recorded history. AC isn't just a nice to have and it doesn't work if the car is off. Also, everything is recorded. The officer's car has cameras, the officer has a camera, there is zero chance that a car-in-motion would not be easily proven with evidence. This isn't the year 2005.",
            "title_similarity": "0.70226634",
            "sentiment_compound": -0.3331
        },
        {
            "id": "h3ttbb2",
            "score": 1,
            "text": "I was the intoxicated driver in a crash that caused serious injury, I hope I can change your view.\n\nI was in a similar situation where I was parked in my car sleeping it off and a cop pulled over to check out the parked car, I explained that I was too drunk to drive and was sleeping it off. I was on the side of the road, I had already driven half way home. The officer accepted my story and went on his way. I went on with my life.\n\nA few months later I was invited to a party at a friends house, I picked up my two friends and headed to the party. About 1:30 in the morning we decided to head home, everyone there, including me, thought I was ok to drive. We only made it a few miles before I went off the road, the car flipped and we were all thrown out. When my friends got up after the crash and were looking for me, they found me standing on the side of the road without my left arm. My arm was completely severed in the crash.\n\nThis happened to me 35 years ago, I have been living with the consequences of my actions for 35 years. I am very lucky I only injured myself, I could easily have killed one of my friends or myself. My life was put on hold for about 3 years while I recovered, no college and no work. My life has been impacted every day since, jobs are impacted, relationships are impacted, everything I do every day is impacted. I will be living with this and impacted by it every day for the rest of my life. I have many difficulties in my daily life, but one of the biggest impacts is the constant never ending pain. I am reminded all day every day about the voice I made that night.\n\nI am responsible for my actions, no one is to blame for what happened to me but myself. I am brining up the following point to argue that what happened to your friend was the right thing to do and quite possible saved him from going through what I have gone through.\n\nIf the first officer that found me asleep in my car arrested me, it could be argued that the subsequent crash would not have happened, or at least that the chances of it happening would have been significantly reduced. That arrest could have been the deterrent I needed, the message that choices have consequences.\n\nThe cop has no magic ability that allows them to see the future and know what you will or won't do, they have to make the best decision they can at that moment to protect and minimize risk. How would you feel differently if the cop let your friend stay there and your friend did change his mind and started to drive, and then injured and killed himself? Would you not then argue that the cop should have done something?\n\nUnless you live in a small town like Mayberry from the Andy Griffith show, there is no option to take him in and let him sleep it off. Even if this were an option, I would again argue that the right thing to do is to arrest. Taking someone in to sleep it off is condoning the irresponsible choice without any deterrent to making the same irresponsible choice in the future.\n\nBeing arrested for DWI is not a conviction, you have the chance to argue your case and defend yourself.  The cop is arresting you, not convicting you, they are removing the risk from the situation to protect the other citizens from the risk you present. I will argue that this IS the right thing to do, to remove the risk.\n\nA few years of hardship recovering from a DWI arrest is far better and far less of an impact than the lifetime of hardship that I am dealing with.",
            "title_similarity": "0.8680533",
            "sentiment_compound": -0.9855
        },
        {
            "id": "h3tthi7",
            "score": 1,
            "text": "I mean if you walk around with a loaded gun, in most places you'll be convicted with a crime. Did you shoot anybody? No. Did you intend to? Maybe not. \n\nThe goal of this kind of law, which allows an officer to arrest you before you actually committed the crime is there to protect the people. If the police has to wait for you to put the car in motion, all kinds of accidents could happen in the short window between \"I'm just sitting in my car with the engine on\" and \"I'm driving down the road drunk\". You could hit someone in the parking lot, not check before getting on the road and get hit, etc. \n\nThere's many laws which are out of place, but not tht one.",
            "title_similarity": "0.7985236",
            "sentiment_compound": -0.7882
        },
        {
            "id": "h3tu044",
            "score": 1,
            "text": "Big brain move what if he turns on the car puts on the a/c then sits in the backseat? Will he still be charged?",
            "title_similarity": "0.65720713",
            "sentiment_compound": -0.2869
        },
        {
            "id": "h3tud4w",
            "score": 1,
            "text": "If the engine is running, they are driving, even if they are not moving.\n\nWhile very annoying to be caught like that, the line has to be drawn somewhere. His engine was on, there's no way to know that he wasn't intending to actually drive the vehicle. If he was so bothered about the temperature why not roll down a window instead, or leave the door ajar?\n\nYour friend was technically in the wrong here by having the engine running to run the A/C, and there's no way around that. If you change the rule to allow situations like this to occur you introduce a lot of grey area for actual dangerous drivers to exploit.",
            "title_similarity": "0.70037496",
            "sentiment_compound": -0.7836
        },
        {
            "id": "h3tvfk5",
            "score": 1,
            "text": "Question, I am assuming the taxi/uber/ride service he called showed up during the DUI investigation?   They don't just cuff you, stuff you then go to jail.  So was a ride service actually called?\n\nWith modern technology (unsure these options were available when this happened), I would 100% agree that it should be an officers discretion to drive someone home instead of to jail if they can conclude reasonable intent.  Showing the officer you called an uber 10 minutes ago when you came out of the bar, sure drive the guy home.  While he DID break the law still, it is clear that there was no intent to drive, and while his impairment may still cause him to change his mind, i could see that being an opportunity to intervene and drive the person home to prevent that bad decision from happening.  \n\nSitting in a passenger seat or rear seat... I'm totally cool with a ride home too!\n\nBeyond the stated scenarios, who is to say the person is not just waiting for their head to stop spinning so they are comfortable driving less-drunk home?  \n\nThis is a scenario that you paint a very serious issue with a sympathetic brush.  And while I agree that maybe the enforcement of the law could be considered a little more grey from officers and less black and white.  Allowing people to get 100% of the way to moving the motor vehicle before punishing them would be a nightmare for enforcement and limit officers ability to be proactive, literally only allowing them to be reactive to an incredibly dangerous act.  If its made acceptable to do so, it is then an option and now drunk, thought impaired human beings are able to do all of the steps required to drive except shift into gear, so we leave officers to only find those that did that last step.  \n\nThese are the same people that when they do decide to drive home and they murder someone with their decision in a DUI crash, they get off easy BECAUSE they were impaired.  Taking innocent lives, and its 5 years for you because you were drunk.  I know you are not arguing the dangers of drunk driving, I'm simply pointing out that blurring clear lines does nothing but make it easier for people to make the wrong decision.  \n\nSo, instead of making it easier for people to get up to the point of driving impaired by changing decent laws, educate people on how to conduct themselves around a car.... and maybe that is simply making sure people know to NOT be in their car drunk are any costs unless its getting into a passenger seat so a sober driver can drive you home.  \n\nYour suggestion is that the police and community shoulder more responsibility and by doing so, you remove responsibility from the drunk person who broke the law in ignorance or otherwise.",
            "title_similarity": "0.79747474",
            "sentiment_compound": -0.6279
        },
        {
            "id": "h3tvnpt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3twwwv",
            "score": 1,
            "text": "I dont see anybody arguing where a line is drawn for a DUI accounting for the fact in many states you can even be in your car, with the keys in the vehicle (not ignition just in the vehicle) and sleep off alcohol without risking a dui. You can't make the safe decision of not driving home a sleeping off the alcohol, waiting our a drink or two playing on your phone or reading, or do anything inside you vehicle be it behind the wheel, in the back seat, in the passenger seat. Hell when I first learned of this I asked a cop in my family if I could sleep in the back and put the keys in the trunk and was told it wasn't good enough to prevent a DUI from a determined officer.",
            "title_similarity": "0.78729826",
            "sentiment_compound": -0.396
        },
        {
            "id": "h3ty1qf",
            "score": 1,
            "text": "I think it's a stupid law but to be honest, if you're drunk and want to sleep it off in your vehicle, just sit in the passenger seat, they would never convict you of that. Right?",
            "title_similarity": "0.69340146",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h3tzdfr",
            "score": 1,
            "text": "A person that is intoxicated doesn’t have much control over them selves. They can sit there with the car on just relaxing, and then accidentally hit the gas pedal and hurt themselves or others",
            "title_similarity": "0.6124501",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h3u0ovi",
            "score": 4,
            "text": "I got a dui for sleeping in my truck after a party out near this park. I was parked at the park so I walked back and passed out in my truck. Even threw the keys in my box because I thought no keys on me no way would I have issues. Nope cop wakes me up by tapping on the window, it’s an older truck so I roll down the windows manually and he proceeds to arrest me upon realizing I’ve had a few beers and he can smell it. Spent the night in jail and the next 13 months and 9 court dates fighting it paying like 8,000$ in lawyer fees. Finally won and have hated the legal system ever since. \n\nFuck this system so much this no injured party but someone still gets charged bullshit gets old real quick.",
            "title_similarity": "0.8803022",
            "sentiment_compound": -0.8894
        },
        {
            "id": "h3u0qs8",
            "score": 1,
            "text": "It should be a separate crime, something like \"Intention to drive intoxicated\" or \"operating stationary heavy machinery\".\n\nNo one is at risk for the crime committed as stated.\n\nIf the vehicle moves, then that is different, even if the car is off and in neutral.",
            "title_similarity": "0.53361464",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h3u0yho",
            "score": 1,
            "text": "Should everyone seen carrying a gun or knife be charged with attempted murder?",
            "title_similarity": "0.45815074",
            "sentiment_compound": -0.836
        },
        {
            "id": "h3u234a",
            "score": 1,
            "text": "Pretty sure in Canada if you are sitting in the car with access to the keys you are operating the car and, if you have been drinking, will be charged.",
            "title_similarity": "0.6069208",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h3u39im",
            "score": 1,
            "text": "So what if I'm in the back seat an I use the remote start. Would that still be considered a violation.",
            "title_similarity": "0.49784365",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h3u3jk7",
            "score": 1,
            "text": "Here's the thing: if the drunkee was in the driver's seat of a running parked car on a public street; he was operating a vehicle drunk on a public street. If the drunkee was on private property --that would include a property's parking lot --it should not be unlawful.",
            "title_similarity": "0.6829605",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3u4n9i",
            "score": 1,
            "text": "Thanks to this, I’ll make sure to tell people to sit in their passenger seat instead to avoid the legal battle. That works, right ?",
            "title_similarity": "0.49610648",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h3u4rsp",
            "score": 1,
            "text": "Idk if it's true but I was under the impression as long as you are not in the driver's seat and the car is off they can't do anything. I sat in the back seat of my car to sleep off some alcohol once before.",
            "title_similarity": "0.72877556",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h3u5fcs",
            "score": 1,
            "text": "Is drunk in charge of your car keys still a thing?",
            "title_similarity": "0.5863193",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3u5jh5",
            "score": 1,
            "text": "Someone I knew had an argument with his wife. He bought some beer and went to the rock quarry to drink. He was sitting in his car, ignition on so he could listen to the radio. Because the ignition was on, he received a DUI. I guess someone at the quarry called the police on him. I don’t know why he liked hanging out there.",
            "title_similarity": "0.8993268",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3u81rw",
            "score": 1,
            "text": "I had a similar situation in my early twenties. I spent the night at a friend house drinking then tried to drive to work the next morning at 5 am. About 10 minutes into the drive, I realized I was still drunk and pulled over into a Walmart parking lot to take a nap. Police knocked on my door and gave me a dui.\n\nI questioned many times how unfair this is and how it set me back, but now that I'm in my early 30's and have had time to reflect on the situation I'm glad it happened. I didn't want to suffer the crippling financial situation again of paying off a dui and ended up develop a much healthier relationship with alcohol. I then proceeded to lost almost 100 lbs now after cutting back on binge drinking and the poor dietary decisions that came along with it.\n\nMy advice is to tell your friend not to dwell on whether it was fair on unfair because we can't have a legal system that makes exceptions for \"he broke the law, but not really\". Should we focus on therapy and proactive measures instead of purely financial measures for discouragement (probably), but that's not the rules we currently live by. I hope he comes out of this in a better place as well.",
            "title_similarity": "0.8263569",
            "sentiment_compound": 0.6101
        },
        {
            "id": "h3u82th",
            "score": 1,
            "text": "A buddy of mine was at a house party and didn't want to crash there, so he started his car to turn the heat on and was going to sleep in the back seat until the morning. Woke up to cops banging on the window and charged him with DUI. Same thing, cost him 10grand to fight it and still fucked his life up for a while. Cops need to use common sense at some point.",
            "title_similarity": "0.87786585",
            "sentiment_compound": -0.6204
        },
        {
            "id": "h3u8xqd",
            "score": 1,
            "text": "I know a person who was drunk enough to call 911 thinking it was 411 to ask for the local pizza place (back in the day when we all did that)\n\nPolice responded to the location and she walked outside when they showed up and had her keys in her hand.  She was charged with a DUI for being in the general area of her vehicle and showing \"suspected intent to drive\" \n\nNow.... I don't know if she was actually intending to drive or not.  So I'm glad she was stopped from doing that is she was going to.  But being charged with a dui without actually even being in your car always seemed a bit minority report-ish to me.",
            "title_similarity": "0.8003881",
            "sentiment_compound": -0.605
        },
        {
            "id": "h3ua6hj",
            "score": 3,
            "text": "I got a dui while I walked out of a restaurant while waiting for my boyfriend to come pick me up simply because I had my keys in my hands. I was a mile away from the car and even walked the cops over to show them where the car was and the texts that I was having someone coming but the woman cop just slammed into me even though her male colleague said “well perhaps we can wait for her ride since she does have a receipt from the restaurant and the texts” a judge ended up removing the dui from my record AFTER I had completely all the classes, paid all the fines etc",
            "title_similarity": "0.8505454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ubfy2",
            "score": 1,
            "text": "The keys in the ignition is enough for the conviction in some states. The thought is that you intended to dri e because you started your car up. \n\nI agree that this shouldn't be the case. At the very least. You should have to be in the driver's seat (as a drunk person could accidentally disengage the parking break and shift into drive or neutral).\n\nIt should be in the name of safety, not punishment.",
            "title_similarity": "0.72093546",
            "sentiment_compound": 0.4815
        },
        {
            "id": "h3ubxxz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3udy4e",
            "score": 1,
            "text": "I think you’re confused about the purpose of the police in this country.  They aren’t here to protect anyone.  “Ruining lives” generates a lot of revenue to keep the massive criminal justice system alive and well.  \n\nThat being said, how sure are you about the story your roommate told you?  Are we absolutely positive he didn’t try to drive himself?",
            "title_similarity": "0.7160735",
            "sentiment_compound": 0.8898
        },
        {
            "id": "h3uebpv",
            "score": 1,
            "text": "ITT: no one with understanding of the rules of evidence. No clear statute to go off of and a bunch of non sense about things that aren't defined but really are.\n\nDon't really blame anyone for it though.",
            "title_similarity": "0.4214123",
            "sentiment_compound": 0.1747
        },
        {
            "id": "h3ufs6l",
            "score": 1,
            "text": "He probably should have sat in the back or passenger seat",
            "title_similarity": "0.3399363",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3uh6k3",
            "score": 1,
            "text": "I think what your situation illustrates is how arbitrary and money-motivated our justice system is. If he could provide evidence that he was just waiting for a ride I think proper discretion should have warranted that he didn’t deserve that kind of deal. But, at the same time, when do we ignore the words “operating a vehicle”?",
            "title_similarity": "0.62221336",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h3uluev",
            "score": 1,
            "text": "I think the rule is that if the key is in the ignition, it’s a dwi. You can be in your car, but the keys can’t be in the ignition. Am I wrong?",
            "title_similarity": "0.59416723",
            "sentiment_compound": -0.631
        },
        {
            "id": "h3umu0o",
            "score": 1,
            "text": "Might need more info on this like did The man's Ride show up? A taxi a friend someone he was waiting on to come drive him home? And if they did show up then The Cop should have correct the ticket and arrest to maybe under influence in public but Not all that drama and life ruination. Unfortunately  for every Law abiding citizen who is in his vehicle for the AC while waiting on a \"Drunk ride\" there have been hundreds of drunk driving after cooling off and feeling more \"sober enough to drive\" life altering moments that it kinda makes the officers stance more understanding",
            "title_similarity": "0.8339453",
            "sentiment_compound": -0.9122
        },
        {
            "id": "h3undml",
            "score": 1,
            "text": "OP fails to define what driving is or at least what operating a motor vehicle entails. The Texas version of a DWI is when an intoxicated person first enters the vehicle and puts the key into the ignition. The car doesn't even have to start. \n\nThe idea is because you began the driving process in operating the car while intoxicated, that an act of placing the key into the ignition is a substantial step towards a DWI. \n\nIf you are drunk and have to pull over and sleep in the car, toss your keys in the trunk.",
            "title_similarity": "0.81272125",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h3up0rc",
            "score": 1,
            "text": "I know 2 situations where this happened one I moderately agree with the other not so much.\n \nA friend of mines grandfather was hammered, passed out in his truck in his driveway because he didn’t have a tv and was listening to the radio. Keys in the ignition and all. He got his 3rd strike and sentenced to 10 years.\n\nAnother friend of mine was 4-wheeling, his truck  flipped and it was about 4 hours until the tow truck got there. While he was waiting he drank a 6 pack knowing he wouldn’t be driving for the rest of the night. Tow truck driver smelled alcohol and called highway patrol. Ended up failing the dui tests and arrested.\n\nI’ll let you guys think about which arrest I agree with.",
            "title_similarity": "0.8541149",
            "sentiment_compound": 0.3102
        },
        {
            "id": "h3upz1a",
            "score": 3,
            "text": "The officer's job is to keep people safe.  What they should have done is sat in the parking lot and monitored the sittuation and waited to see if they drove away.  Waited for them to have a ride come in or waited for them to move their car.  Problem solved.  Or come over and made it a life lesson and spoke with the kid, told them \"hey if you move your car you're getting locked up, consider this a warning, dont ruin your life\"\n\nProblem solved and potential future dangerous driving averted.  Especially if he ran his plates and saw no prior DUIs on record.",
            "title_similarity": "0.7154088",
            "sentiment_compound": -0.4986
        },
        {
            "id": "h3uqqbn",
            "score": 1,
            "text": "All you have to do in this situation is sit in the passenger seat and they don’t fuck with you I have done this multiple times with a cops blessing.",
            "title_similarity": "0.5165413",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h3uukex",
            "score": 1,
            "text": "INFO: How did the cop know he was drunk?",
            "title_similarity": "0.605688",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3uv7t2",
            "score": 1,
            "text": "I disagree, police has to leech of citizens in some way to justify their overrepresantation, otherwise some police officers would lose their jobs and you dont want that, do you?\n\nAre you some sort of lawless criminal? Because you sound like one. >:(\n\n**/S**",
            "title_similarity": "0.6665664",
            "sentiment_compound": -0.8951
        },
        {
            "id": "h3uvivw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009177733"
        },
        {
            "id": "h3uw5ru",
            "score": 2,
            "text": "Agreed, my mom got a DUI the same way and the keys weren't even in the ignition, they were in the backseat. Officers told her they would have to be OUT OF THE CAR for it to not be a DUI. What a joke.",
            "title_similarity": "0.71831477",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h3uxf87",
            "score": 1,
            "text": "As soon as the car is running, you're operating the vehicle. In a state where you're not thinking rationally, I'm ok with being charged like that",
            "title_similarity": "0.4594905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3uxh65",
            "score": 1,
            "text": "How does the officer know you didn't already drive the vehicle while intoxicated to the spot it's currently in?",
            "title_similarity": "0.6291723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3uxifk",
            "score": 1,
            "text": "This happened to one of my friends in college. I think if you were to sit in anything but the drivers seat while waiting, it wouldn’t be an issue.",
            "title_similarity": "0.5701418",
            "sentiment_compound": 0.2617
        }
    ]
}