{
    "CMV: Instagram has lost its edge and will die out eventually\nInstagram is on the decline, and will continue to do so for the next few years until they finally die out. Here are my reasons for believing that.\n\nOne - Instagram is losing its niche\n\nInstagram had a successful niche as a photo-sharing platform, and that is still ultimately what most creators and users use it for. Users use it because they want to see photos and engage with them. However, Instagram is now moving to attempt to compete with YouTube and TikTok, which will ultimately fail because those platforms are already occupying their respective niches, and doing a good job at it.\n\nTwo - Instagram isn't showing people what they want to see\n\nI believe that most casual users of Instagram are like myself - we follow pages that we want to use, which usually includes our friends and pages of interest that we are interested in. Instagram's attempt to push people to look at pages that they don't even follow at the expense of pages that they do is driving users away and lowering users' interest in the platform.\n\nFor these reasons, I think that Instagram will eventually die out, and pretty soon at that.": [
        {
            "id": "h3wwrik",
            "score": 1,
            "text": "/u/UncomfortablePrawn (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/ocx2ud/deltas_awarded_in_cmv_instagram_has_lost_its_edge/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.60689354",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3ww3d0",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.19310239"
        },
        {
            "id": "h3wsv5b",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.19310242"
        },
        {
            "id": "h3wrfdy",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.19310239"
        },
        {
            "id": "h3ws18o",
            "score": 0,
            "text": "You forgot the constant bugs on android, even on newer and decent phones like s20.\nThe fact that everyones cares so much for foloring ratios, that its just a competition everywhere.\nThe problems with spam and bots.\nAll that shit. Hope it dies really soon",
            "title_similarity": "0.69704205",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3wtgen",
            "score": 89,
            "text": "I’m only one data point but I completely disagree with both of your arguments. As far as the first one goes I appreciate everything Instagram has added in the past couple of years. Why? Because I hate having 70+ apps on my phone. I use to have Snapchat but then Instagram got stories and Snapchat became irrelevant. I was getting ready to download tiktok but then Instagram got reels and now I do it on Instagram. I used to be all about Facebook but there was too much other crap on there so now I primarily use Instagram. It literally shows me the only things I care about being photos and reels. I appreciate that they have branched into other venues because it’s like the one stop shop of social media apps. I can find whatever I want to look at without a lot of fluff \n\nAs far as your second point I also completely disagree with that. Yeah there’s ads on Instagram but a lot less than Facebook. They also don’t bombard me with suggested articles or political bullshit. Besides the occasional ad you have to seek out things you don’t want to see. If you stay on your feed it only shows you who you follow. It’s not sitting there constantly suggesting things you should follow and their associated photos or reels like Facebook. And you can always follow less people and you will get back to seeing what you care about. \n\nI’m a millennial and only one person but Instagram is my jam and I don’t see that changing",
            "title_similarity": "0.8307564",
            "sentiment_compound": 0.1207
        },
        {
            "id": "h3x09fk",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.19310239"
        },
        {
            "id": "h3wymu0",
            "score": 1,
            "text": "Instagram died years ago you’re just catching up.",
            "title_similarity": "0.7159312",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3ws61q",
            "score": 2,
            "text": "Social Media is never die, just changes.",
            "title_similarity": "0.27670115",
            "sentiment_compound": 0.4847
        },
        {
            "id": "h3wsmpk",
            "score": 10,
            "text": "it still has the best memes on private pages, and i get to see pictures of things i am interested in like cars.\n\nseems to be a place for small businesses to advertise on as well.",
            "title_similarity": "0.44925857",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h3wzocu",
            "score": 4,
            "text": "Former social media manager and still sometimes advertiser.\n\nIt isn't going away soon even considering everything I'm about to day. It is simply too big to fail for a long time and businesses dump a lot of money into advertising there.\n\nI hate Instagram, it is unfair and to succeed takes a lot of gaming a hostile system of ever changing algorithms and/or luck+talent.\n\nI used to really enjoy playing the system but with the rise of bots and so many people exploiting it. It's just more trouble than it's worth.\n\nI genuinely can't tell a client I can make them succeed anymore and people with products/ideas good enough to succeed probably don't need me.\n\nI'll still do advertising because I can show results and guarantee a certain level of results.\n\nEven clients with good posting material like a restaurant with a professional photographer can be in harsh competition.\n\nI even had one client get loaded with fake followers by competition and get banned. Which is happening a lot lately.\n\nJust too much effort, not enough pay, and too risk to my reputation.",
            "title_similarity": "0.7764421",
            "sentiment_compound": -0.2157
        },
        {
            "id": "h3xldi5",
            "score": 4,
            "text": "I agree, in theory, with almost everything you said, Instagram is going much much worse. Yet, I don't agree with this: \n\n>Instagram is on the decline, and will continue to do so for the next few years until they finally die out.\n\nThe rate of Instagram's growth is declining (i.e. lesser newer users), it's not stopped. It likely won't stop because of these features they're adding. Note that it may still die out (like MySpace) but my argument does not attribute the dying out to these baddd features and service they provide. \n\nPrimarily, it won't die out because people will continue to use it - even if tons of new people aren't joining. If nothing else, Facebook is good at making their apps addictive. The extent to which people are addicted to social media is really really extreme. A large amount of people won't be able to leave it. \n\nFurther, there are more minor contributing factors that people will have to stay on Instagram such as societal pressure to be present on social media, FOMO, or simple laziness. Elaborating on each of these three:\n\n1. Societal pressure to be on social media: can't comment on other demographics but as a teenage girl, I find it hard to not be on social media platform. \n2. FOMO: communication happens on Instagram. I'm going abroad for university and a ton of our group chats are on Instagram. I don't want to be missing out on that.\n3. Laziness: Instagram, in it's absolutely unethical and downright annoying approach of mixing a ton of social media platforms (namely, YouTube, TikTok and Snapchat --stories) makes a platform that combines those three. It is possible that we as a society become eventually accustomed to using just this one app. It may be unlikely, but depending on how Facebook approaches it, it's a possibility. By the current looks of it, it's a small possibility. \n\nThese factors are not as significant or may not be relevant to every case, but may also be contributing factors. \n\nNext, talking about your two points:\n\n>Instagram is losing its niche  \n>  \n>Instagram isn't showing people what they want to see\n\nNo, they are not losing it, they are choosing to give it up. Some of the most successful non-Facebook social media platforms are Twitter, YouTube and TikTok. 2/3rds of these are video based. Instagram sees it as a business move. Users no longer just want to see photos. That's in part because videos are inevitably more engaging and simultaneously because we *barely* have a choice in what we enjoy. I hated Reels, but now that I've been on it for a while, I'm addicted to mindlessly scrolling on it. They tell you what you like and feed it to you until you start liking it. You start with 1 or 2 and suddenly you're scrolling (notice the auto-continuous scroll? The next IGTV automatically plays once the first one is over).\n\nFinally, I used to love Instagram. I hate it now. I wish I stop using it, maybe I will when I'm more busy (quarantine 😬😅). I wish it dies, because Facebook as a corporation needs to die. I hate Facebook so much. We are the product, not the consumers.",
            "title_similarity": "0.9130569",
            "sentiment_compound": -0.8276
        },
        {
            "id": "h3wrhwq",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.19310242"
        },
        {
            "id": "h3ws09t",
            "score": 338,
            "text": "You lost at 1 because of the logical inconsistencies. You argue it’s losing its niche, its niche is photo-sharing and it is now moving to compete with YT and TikTok, which leans into what they have been doing with Reels.\n\nBut at no point in there have you argued why it has lost its niche. Point to any photo sharing platform that has gained even a semblance of traction as a social media photo sharing platform recently?",
            "title_similarity": "0.8492238",
            "sentiment_compound": -0.09
        },
        {
            "id": "h3wub0o",
            "score": 55,
            "text": "I think you’re wrong because Instagram has widespread generational appeal. Professional photographers and a lot of older people use it as their primary photo sharing platform and I can’t see that declining or dying out soon based on the current climate. \n\nMost of the people I’m talking about, including myself, don’t use Tik Tok and could barely even tell you what it is.",
            "title_similarity": "0.7871316",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h3wwsis",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.19310239"
        },
        {
            "id": "h3wwd5l",
            "score": 9,
            "text": "To address your first point, photo-sharing is *still* IG's strongest feature. Adding successful features from other social media apps doesn't dilute the experience to the point that the main feature is unrecognizable.\n\nTo address your second point:\n\nReels are a great way to show longer videos, such as behind the scenes vlips, animations, stop-motions, etc., which are all relevant to photography/art in some way, while also providing an opportunity to find similar content. It's also separated into its own little section so if you want to see exclusively those or dodge them altogether, you can. Sure, they pop up in the search/explore section, but if you're a casual user, you're probably only ever there to use the search bar anyway.\n\nThe \"infinite scroll\" and recommended content on your feed can be avoided and you can see older content by pressing a little button that literally says \"Older Posts.\" It's a very minor inconvenience at worst.\n\nThe shop feature, as with reels, is an out of the way thing that you can either go to if you want to use it or avoid if you don't.\n\nYou were a bit vague with the exact features that IG is imitating, so lmk if I missed anything.",
            "title_similarity": "0.59324265",
            "sentiment_compound": -0.7927
        },
        {
            "id": "h3x5yfw",
            "score": 10,
            "text": "Gen Zer here. Big no. \n\nOn your first point, you argue that Instagram isn’t competing with YouTube and TikTok. I would argue that people use Instagram and those two apps for different purposes. On Instagram, most people’s feeds are filled with friends photos. Yes, many people do follow influencers and informative pages, but overall most people use Instagram for personal reasons, similar to how old Gen X and Boomers use Facebook.\n\nMeanwhile, most people watch content creators and strangers work on TikTok and YouTube. Instead of looking into their friends and acquaintances lives, people use the two apps for pure entertainment, not to be social.\n\nI’m also not sure what you’re talking about number two. Are you talking about instagrams algorithm? People see posts about the pages they follow. Besides sponsored ads, I’ve never seen a post from someone I don’t follow.\n\nOverall, I think Instagram is thriving. For young people like myself, I think it’s the best form and popular of social media besides Snapchat",
            "title_similarity": "0.7603753",
            "sentiment_compound": 0.9687
        },
        {
            "id": "h3ws07e",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "0.19310242"
        },
        {
            "id": "h3wrpwi",
            "score": 1176,
            "text": "You're arguing that it's trying to catch up with other things, but that's different from failing at what it was started as.  \n\nIt started as a photo sharing platform, and as a very casual user of it, that's still all I see it as.  \n\nWhat app is surpassing it in the photo sharing market?  What photo sharing app do you see having a billion users \"pretty soon\"?",
            "title_similarity": "0.66326666",
            "sentiment_compound": 0.9177
        },
        {
            "id": "h3wse3i",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.19310239"
        },
        {
            "id": "h3wsqgk",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.19310239"
        },
        {
            "id": "h3wsxv7",
            "score": 2,
            "text": "How does another competitor emerge without Facebook acquiring it? They acquired Instagram, Whatsapp and anything else that competes.",
            "title_similarity": "0.6333847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3wv65b",
            "score": 2,
            "text": "I think viewing Instagram as a singular thing is a little foolhardy at this point. Maybe \"Instagram\" gets absorbed into the greater Facebook ecosystem but Facebook is not going anywhere because Facebook is so much more than what it started off as.",
            "title_similarity": "0.7508029",
            "sentiment_compound": 0.0507
        },
        {
            "id": "h3wwjyx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19310239"
        },
        {
            "id": "h3wwtpk",
            "score": 1,
            "text": "YouTube and Tiktok do not display photography. Instagram is by far the best platform for photographers, and there are a lot of us out there, especially now that basically everyone has access to a great camera right on their phone. Nobody else has taken the photography niche, and none of the other platforms you've listed here seem well-equipped to do so.",
            "title_similarity": "0.6257225",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h3wx38t",
            "score": 1,
            "text": "Can you clarify how something that has increased users by almost 23% in the last year is on the decline ?\n\nYour personal interest in an app doesn’t determine its success. \n\nIf you add “for me” to the end of points 1 and 2, then you’re correct. Instagram is losing its niche for YOU. And instagram isn’t showing YOU what you want to see. But the number of users indicate that’s not widely agreed.\n\nBesides, when instagram introduced stories we all thought it would die out because it was trying to be like Snapchat, but the opposite has ended up being true https://www.statista.com/chart/15034/worldwide-user-growth-of-instagram-and-snapchat/",
            "title_similarity": "0.84964764",
            "sentiment_compound": 0.473
        },
        {
            "id": "h3wxbkz",
            "score": 1,
            "text": "People said the same about Facebook like ten years ago. It's not going anywhere for at least another few decades. They might not have a monopoly but it was a strange time when such few sites had such real estate in social media. They will continue to be big hitters for a long time.\n\nIt's kind of comparable to McDonald's and the like. In the 60s McDonald's was the ONLY place to go but by the 90s there were many more options. McDonald's is still massive. So will Facebook and Instagram be. \n\nBebo and myspace came in during the early days and just couldnt compete with what Zuckerberg was doing in pushing the envelope in terms of marketing and expansion. Facebook and Instagram and all it's subsideries  have passed the test and will be able to keep their name and domain for many years to come.",
            "title_similarity": "0.74122083",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3wxkhb",
            "score": 1,
            "text": "Look at the story feature. Everyone comained about it and said they were trying to copy Snapchat. Now, it's one of the most popular features.",
            "title_similarity": "0.55888414",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h3wy1nn",
            "score": 1,
            "text": "I us d to be addicted to it but I have since deleted the app. Now it’s just ads and people in love with themselves.",
            "title_similarity": "0.83567894",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h3wyehx",
            "score": 1,
            "text": "Hope Facebook goes with it",
            "title_similarity": "0.30564255",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3wyfwv",
            "score": 1,
            "text": "The home page, the default staring page for Instagram is people you follow. Things from people you don't follow don't really show up on that page. I'd you see more content from people you don't follow it's because you're looking at the search page, which means you literally choosing to look at other people's content.",
            "title_similarity": "0.70387554",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3wyl1f",
            "score": 1,
            "text": "It’s all just people trying to sell you things now",
            "title_similarity": "0.41358173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3wylyy",
            "score": 1,
            "text": "I disagree personally. Not that it won't eventually be overthrown, but I don't think we're anywhere near that happening. A few thoughts.\n\na) I'm confused on how Instagram is pushing you to to check out pages that you don't want to. When I click the home page, I only see my feed which is just people I follow. It has the occasional ad, but that's expected on a free social media platform. And it's certainly just a very small fraction of my feed. If you use the explore page, that has other photos and videos but that's the point of it. Am I missing something here?\n\nb) Instagram has changed it's niche a bunch of times. In it's first year, I specifically remember, people posted photos way differently. It was almost like a more social Flickr, where people posted very beautiful, artistically done photos. Now it's way more blogging/vlogging, influencer stuff, etc. Yet it's only grown.\n\nc) The idea that because another platform is already doing a specific thing means that another can't isn't guaranteed. You're saying most people just use it for photos, but IG stories and reels are both gigantically popular. I think it's more surprising that Snapchat is still alive and doing relatively to be honest. Big companies constantly swallow up others by using their main features and incorporating them.\n\nd) Your forecast for it to eventually die...what does that mean exactly? It seems like you're saying within 5-7 years it'll be basically dead? What if it's still relatively popular but at a lower status? Because it's going to take a lot to bring it down. And it being under the Facebook umbrella only helps it's longevity with a ton of excess capital and connection to Facebook and WhatsApp. If you're saying it won't be \"the cool thing\" in terms of demographics or more trendy usage, that's fine too. But sometimes socials get big enough where they don't exactly need to be that. Facebook is very much not cool, but it's so entrenched in culture worldwide and has many important features that people still use (Facebook groups, all ages are on it to connect with family, Facebook invites, Messenger is a gigantic form of communication, login with Facebook is ubiquitous, etc).\n\ne) Last thing, our society is obsessed with social media, and we're all on it constantly. Most people use I'd guess five socials regularly or so (including YouTube and Reddit). You're saying YouTube and TikTok do what IG is trying to do, but people now that are using YouTube and TikTok are still using IG. At least many. Hell, I'd say IG is more likely to survive than TikTok since IG has something that TikTok doesn't seem to be at all in position to do with it's photos and UI for them, whereas IG seems to be setup to do something like TikTok.",
            "title_similarity": "0.73581123",
            "sentiment_compound": 0.9656
        },
        {
            "id": "h3wypuf",
            "score": 1,
            "text": "That day is far away, there is a lot of development to see on the platform. Like the Blog section on Instagram, In the future, you can monetize your Instagram business profile like any other website. With roughly one billion monthly active users, Instagram belongs to the most popular social networks worldwide. The social photo sharing app is especially popular in the United States and India , both of which have nearly 140 million million Instagram users each. This can be observed in the increase of advertisements shown on the application, which give them more money. \n\n[https://adespresso.com/blog/instagram-statistics/](https://adespresso.com/blog/instagram-statistics/)\n\nIt isn't exactly dying, but *\"transitioning\".*",
            "title_similarity": "0.58878577",
            "sentiment_compound": 0.8718
        },
        {
            "id": "h3wyvfz",
            "score": 1,
            "text": "While Facebook doesn’t break out its Instagram numbers (I couldn’t find them at least), independent research firms like eMarketer project consistent growth in Instagram, boosted by the pandemic: https://www.emarketer.com/content/global-instagram-users-2020\n\n“How has the pandemic changed our 2020 forecast for Instagram users globally?\n\nInstagram will add 186.3 million new users between 2019 and 2020, representing year-over-year (YoY) growth of 22.9%. That’s more than double the rate we predicted prior to the pandemic. (Our forecasts differ from Instagram’s figures as we factor out fake, duplicate, nonhuman, and business accounts.)”\n\nWhen you say Facebook is “losing its niche,” how do you quantify that? It’s true that it’s expanding beyond its core capability, but why does that mean it’s losing what it currently has?",
            "title_similarity": "0.6746203",
            "sentiment_compound": 0.2709
        },
        {
            "id": "h3wz11a",
            "score": 1,
            "text": "I hope it does die out. It's a heavily toxic place",
            "title_similarity": "0.51962614",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3x055g",
            "score": 1,
            "text": "I only use Instagram to promote my music and if you do that right there is still a use for it other than just posting repetitive pictures. It can be used as a tool to get more famous for attention.",
            "title_similarity": "0.66016006",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h3x0og4",
            "score": 1,
            "text": "Alot of platforms will die out eventually, when exactly is eventually ? Soon ? I dont see anything to suggest it will be anytime soon. They are adding new features as facebook, twitter, snapchat has but they are still instagram, not a tiktok, twitter etc mimic. \n\nSnapchat is still a thing with supposedly over 200M active users, with that said, instagram life is looking lengthy as of now.\n\nAlso i think you are wrong on #2.  instagram suggest me alot of content on the page with the magnifying glasses icon based off my interest and also when Im scrolling through my feed and theres no new post from the people i follow it starts showing me post based off who I follow.",
            "title_similarity": "0.8186188",
            "sentiment_compound": -0.2982
        },
        {
            "id": "h3x12de",
            "score": 2,
            "text": "“Lost its edge” and “is dying” are very different things.  For cryin’ out loud, [myspace](https://myspce.com) still exists, 22 years after its heyday.",
            "title_similarity": "0.65782195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3x1jyc",
            "score": 1,
            "text": "I think IG sealed their eventual fate when they placed in-feed ads and got fancy with the order posts are served. Call me old-fashioned, but I liked when it was done timeline-style",
            "title_similarity": "0.51953",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h3x1wwo",
            "score": 1,
            "text": "!RemindMe 3 years",
            "title_similarity": "0.22624087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3x24mc",
            "score": 2,
            "text": "My main thing is censorship of creators and material. Once covid rolled around and a lot of the smartest people I know had their voices de monetized and censored, while the dumbest and most compliant had their platforms bolstered. That was the beginning of the end for me.",
            "title_similarity": "0.7006227",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3x25l3",
            "score": 1,
            "text": "Instagram has more daily active users than Tik Tok. Tik Tok has better penetration among Zoomers, but Millennials are a much more loyal and financially stable cohort (they have far more disposable wealth that Instagram is doing a great job of tapping into). Tik Tok targets a financially shaky and generally disloyal cohort. It's just a matter of time until it's replaced another fad (remember how quickly people fell off the Snapchat bandwagon).\n\nOK onto personalized news feeds. Yes, a lot of power users don't like being recommended stuff. However, the vast majority of users actually really like recommendations. How do I know? I used to work on recommender systems (it's a whole field in data mining). Instagram is not going to be forthcoming about it, but they A/B test every tiny little change on live traffic. Their recommender systems are designed to maximize daily active users (known as DAUs). It may not feel like it, but that probably means that you are not like their overwhelmingly typical user. They are constantly working to improve their recommender systems though so before long I am sure you might also be satisfied if you give it a chance.",
            "title_similarity": "0.6690166",
            "sentiment_compound": 0.9919
        },
        {
            "id": "h3x40b3",
            "score": 1,
            "text": "Idk why people are being so chaotic with their responses. I agree with you and have had this same thought. \nThere are too many advertisements. Everyone is on there to sell something. Ads, “influencers”, giveaways, etc. It all feels like one big commercial. It’ll die soon for sure.",
            "title_similarity": "0.60654217",
            "sentiment_compound": -0.4795
        },
        {
            "id": "h3x49m6",
            "score": 1,
            "text": "In my case, everyone around me quits facebook and watches Instagram more and more.",
            "title_similarity": "0.65505576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3x4aa5",
            "score": 1,
            "text": "I saw you gave a delta, but also said in that same post that you have not changed your view.\n\nSo, what would it take at this point to change your view?\n\nYour first point has been wholly debunked. There is no other player in the photo sharing space. And photo sharing is a staple of social media. It isn’t going anywhere anytime soon. The ad revenue generated from the app will make sure of that.\n\nTo your second point, Instagram works *the exact same way* as TikTok. You can choose to scroll through accounts that you follow *or* you can choose to scroll through curated content that has been picked out for you by the algo. So, I don’t have any idea what you mean with “it isn’t showing people what they want to see.”",
            "title_similarity": "0.6648839",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h3x4fqf",
            "score": 1,
            "text": "I actually think that Instagram is doing a great job.\nMy friends are constantly sending reels either in their story or DMs and most of them use Tik Tok.\nSo it's doing their job as a photo sharing platform, plus Stories like Snapchat (which I personally feel like it's dying out since everyone just uses Instagram instead) and Tik Toks in form of reels.",
            "title_similarity": "0.6727369",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h3x4hx2",
            "score": 11,
            "text": "Maybe it's because I work in digital marketing, but there is so much wrong in your take man.\nIn the digital space, userbase is key. Instagram has such a huge critical mass of users that they can diverge from their core and still win. They copy features from tiktok and still win. Being first at something or to use your word being niche is not an indicator of perrenial success. \n\nAlso, Instagram's algorithm is constantly changing for worse, in your eyes, but all their decisions are based not on what you think is your intention for content, but what actually gets you addicted and makes you stay for longer on the platform based on behavioral data analyzed by their flock of marketing and data science teams. \nThey have million of users data tailoring the experience to make people stay longer and come more often. This is why they removed a while back chronological timeline.",
            "title_similarity": "0.7325197",
            "sentiment_compound": 0.8286
        },
        {
            "id": "h3x57lr",
            "score": 1,
            "text": "People are literally addicted to it, it may not be the top app but it ain’t going anywhere soon.",
            "title_similarity": "0.6950209",
            "sentiment_compound": -0.0762
        },
        {
            "id": "h3x5q2j",
            "score": 1,
            "text": "I know you said ‘the next few years’ but still, I think the claim being this vague means it’s by default 100% true. Of course it will ‘die out’, everything technically dies out. There’s nothing that’s 100% permanent.\n\nThat said, there’s no real way of objectively agreeing on what constitutes ‘dying out’. There’s a lot of people who would argue Facebook’s died out but that’s because their demographic doesn’t use it as much anymore.\n\nBoth Instagram and Facebook still have 100s of millions of users. Neither will likely reach a point where they have 0 users, unless the softwares literally end/are deleted off the face of the earth.\n\nSo unless there’s a specific frame of time within your claim that Instagram will die within, and until we can all agree on what ‘dying out’ means, the claim is silly.",
            "title_similarity": "0.7511555",
            "sentiment_compound": -0.8321
        },
        {
            "id": "h3x8fox",
            "score": 1,
            "text": "They also have what you could define as an “industry” around their “influencers” that harass society. They bring in ad dollars for themselves and instagram and that will always make them a significant player in the growing social media influence/entertainment industry. Instagram can be something of a linked-in for artists as well. I don’t personally like it much but you can’t deny the power they have and it only seems to be growing. At least intsa isn’t Chinese owned by tik tok if there are more chinese seizures of our social media we will have even more misinformation and privacy issues",
            "title_similarity": "0.7149831",
            "sentiment_compound": -0.5407
        },
        {
            "id": "h3x9w87",
            "score": 1,
            "text": "I agree but something would have to replace it and I see nothing even coming close, there is nothing similar to Instagram at the moment",
            "title_similarity": "0.54784846",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h3xac7w",
            "score": 1,
            "text": "And the sudden surge in ads and bots in the comments section of large accounts. It’s really put me off - I still use Instagram but I feel like I use it far less because of the self-advertising, especially when accounts (usually meme accounts) have one slide of their post being a diet/workout app or something concerning (like that ‘I found this new app where you’re a King and can do anything you want to the women of the village’ I mean???). I also feel that in the last year or two the comments of posts have become very toxic. So many comments seem to be sexist/misogynistic or use slurs. I get if I don’t like this comment I can block users but it’s not just a small minority, and when you report these comments or posts Instagram find nothing wrong with them",
            "title_similarity": "0.84296596",
            "sentiment_compound": 0.8812
        },
        {
            "id": "h3xahy1",
            "score": 1,
            "text": "Instagram is owned by Facebook and Zuckerberg isn't going to let something die that gives him the ability to track and sell information about its users.",
            "title_similarity": "0.5546992",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h3xaj6p",
            "score": 1,
            "text": "You're forgetting that just like how older populations are clinging to Facebook, millennials are probably going to keep Instagram afloat for a long time.",
            "title_similarity": "0.6617693",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3xakxv",
            "score": 1,
            "text": "As someone who makes a 6 figure living selling my art via Instagram, I’m pretty sure I disagree. Lol. It has enough brand loyalty and in today’s climate most cornerstone apps have pretty much claimed their position. Facebook, PayPal, Venmo, Reddit, google, Instagram, etc, have all become the equivalent of Fox News, CNN, Nickelodeon,  Cartoon Network, History Channel, etc. The only thing that may change is if a new device lessens their popularity. Like Tv did to radio, like computers did to TV, like cell phones did to computer.",
            "title_similarity": "0.70648307",
            "sentiment_compound": 0.9682
        },
        {
            "id": "h3xb0ps",
            "score": 1,
            "text": "Capitalist revelation time… there is a business cycle to all businesses and many exploit the fact its a niche that’s dying to maximize profits. To ultimately kill the product and sell the brand and intellectual property",
            "title_similarity": "0.6579504",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3xb46s",
            "score": 1,
            "text": "I believe the algorithm on Instagram is fucked for sure and ultimately really repetitive. It will become more Facebook like or more like Tik Tok. It will limp along adding features that are already on other platforms",
            "title_similarity": "0.8109455",
            "sentiment_compound": 0.046
        },
        {
            "id": "h3xcdzb",
            "score": 1,
            "text": "Every app dies out eventually.",
            "title_similarity": "0.5147325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3xcwd3",
            "score": 1,
            "text": "Eh. It also started with stories and story filters to compete with Snapchat several years ago and has held on tight. Putting features in place that other platforms have gives them and advantage, not a disadvantage. On stop shop social media, gives them an edge to tap into other successful platforms that don’t incorporate all features.",
            "title_similarity": "0.7368984",
            "sentiment_compound": 0.7124
        },
        {
            "id": "h3xd2w3",
            "score": 1,
            "text": "Dude are you kidding?! No way. It's gonna go huge. Especially after pandemic. \nPersonally, I hate Instagram. But it's become huge with small businesses and people just wanting to show their works.",
            "title_similarity": "0.7473844",
            "sentiment_compound": 0.2828
        },
        {
            "id": "h3xd3by",
            "score": 1,
            "text": "Instagram became a page for cheap fucking whores to promote their onlyfans page as the stupid cunts don't know what else to do in life but to exploit their bodies",
            "title_similarity": "0.72276914",
            "sentiment_compound": -0.7153
        },
        {
            "id": "h3xed21",
            "score": 1,
            "text": "I dont think it will go away soon.  unless soon is a decade.  but it will definitely rebrand at some point.  too much money behind it.  i have an old old old twitter handle and a facebook deactivated, but man I knew I wasn't cool enough, young enough or good looking enough to start an instagram.  I can say ill be happy when apps arent the most talked about thing.  Most used?  Sure. but discussed? fuuuuuuuuuck.  i hate.",
            "title_similarity": "0.82891494",
            "sentiment_compound": 0.7171
        },
        {
            "id": "h3xemaf",
            "score": 1,
            "text": "They’re even deleting editing accounts, and instagram is the one place editors go to to post and collaborate with other artists.",
            "title_similarity": "0.6051508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3xexe2",
            "score": 1,
            "text": "Agree. I am so tired of seeing men who think they are handsome trying on different clothes. I don't follow them, yet the constantly appear.",
            "title_similarity": "0.62631",
            "sentiment_compound": 0.2403
        },
        {
            "id": "h3xf1bl",
            "score": 1,
            "text": "and just like Snapchat, there's a android application problem too. \n\nBut it won't matter since everyone's taking and editing photos outside the application and later posting thru.",
            "title_similarity": "0.63287497",
            "sentiment_compound": -0.0544
        },
        {
            "id": "h3xfblu",
            "score": 1,
            "text": "Everything will die eventually. \nSo I guess your not wrong.",
            "title_similarity": "0.46788538",
            "sentiment_compound": -0.3283
        },
        {
            "id": "h3xffn6",
            "score": 1,
            "text": "Being sold to Facebook was when Instagram died, in my opinion",
            "title_similarity": "0.6807923",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3xfxp1",
            "score": 1,
            "text": "Instagram and tiktok are just gaining popularity in the developing countries. It wouldn’t just die out because one doesn’t use it anymore",
            "title_similarity": "0.7107848",
            "sentiment_compound": 0.25
        },
        {
            "id": "h3xfxwc",
            "score": 1,
            "text": "Instagram will continue on just like most other platforms. \n\nMost of them are nothing more than advertising for OF and the like, even Twitch allows (roundabout) linking to OF. As long as the traffic is generated it will continue.",
            "title_similarity": "0.5460566",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3xg5cc",
            "score": 1,
            "text": "Honestly I think the second it gets some real competition, it'll become like Facebook and start to \"die out\". As of right now, there's no real competition for insta.",
            "title_similarity": "0.77356046",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h3xg7e3",
            "score": 1,
            "text": "I mean, Facebook took it over. What do you expect?",
            "title_similarity": "0.43071738",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3xh4py",
            "score": 1,
            "text": "It's niche is photos. What other social media competes with photos? None.",
            "title_similarity": "0.5970669",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3xh7ua",
            "score": 1,
            "text": "I personally despise Instagram because there's nothing of interest for me, even though I do follow alot of interesting pages. Their algorithm has ruined the app for me.\n\nAlso because Instagram has become more about aesthetic than sharing photos, people are not posting like they used to. Nobody wants to post random photos from their gallery anymore. Everything that goes to the gram must be perfect.\n\nBut don't believe it will die out because it still offers a platform with particulars like no other does. It will probably lose out on a lot of active users. Just how FB became something that youngsters stopped using as much and it became more of an older generation thing, I believe something similar happening to Instagram. Most people are on it because they want to feel connected but barely anyone I know is posting photos. Stories yes, they are. I think that's the only thing that has been their saving grace. Reels also has not had much of an effect on diverting Tik Tok users towards the app. The only reason alot of influencers are using Reels is because Instagram is pushing for it and reels are hence getting more views.\n\nAll in all, Instagram has unfortunately ruined their own app. It already has lost its edge. But because it's providing all in one, it's a unique app. It basically drove Snapchat to the ground. Not to mention it also has given small business owners a way to sell their items and most people I know want to start their small business there because they do have most of their community and friends in one place. Which is why i dont think it'll die down.",
            "title_similarity": "0.8272498",
            "sentiment_compound": 0.032
        },
        {
            "id": "h3xhdv0",
            "score": 1,
            "text": "I freaking hope it does. It’s a cancer cluster.",
            "title_similarity": "0.4235223",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h3xhwru",
            "score": 1,
            "text": "Great example of consensus bias. Your assertion that Instagram is on the decline is demonstrably false. 22% user increase last year alone.",
            "title_similarity": "0.6938988",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3xi14r",
            "score": 1,
            "text": "As someone from a small country, having an Instagram account for something and actually gaining followers is comparatively easier than say a YouTube channel or setting up a website. That’s without even beginning to talk about Reddit which is very US-centric. \n\nAt least here in Denmark, Instagram is probably our most vibrant and diverse online community. I imagine it’s similar in many other smaller cultures.",
            "title_similarity": "0.5449941",
            "sentiment_compound": 0.8516
        },
        {
            "id": "h3xiy2b",
            "score": 2,
            "text": "I totally disagree with you!\n\nInstagram is one of the few classic-style social networking apps that are still strong today. Facebook is nowadays used only by old or less... fortunate... people.\n\nInstagram lets you see any kind of post while also allowing you to chat with friends.\n\nReels are a bit forced, but not bad or anything.\n\nI honestly think the social networking app of the 2020's will be Instagram. I hate the company tho. Frick Facebook and their other products.",
            "title_similarity": "0.8071738",
            "sentiment_compound": 0.6217
        },
        {
            "id": "h3xk4i8",
            "score": 1,
            "text": "I agree with your hypothesis just from observation, but I'm not sure about the rest. I don't think it's losing its niche, I just think people don't care as much about that niche. Five years ago I didn't have Insta and everyone was begging me to get it. I did. Now I don't know anyone who uses Insta for anything outside of work, and I haven't opened the app in a year. Also you have to remember social media comes and goes. Every generation is going to want their own platform that they tout as cooler or better than others, even though they're all largely the same. That's why Facebook is all older millenials now, Twitter is those in between, Insta is young millennials, and Tik Tok is filled with Gen Z. (And we'll leave MySpace alone for once)",
            "title_similarity": "0.7442821",
            "sentiment_compound": -0.1553
        },
        {
            "id": "h3xk5by",
            "score": 1,
            "text": "OK, Instagram is trying to do video but who's replaced Instagram's photo sharing niche? TikTok can't scratch the photo itch. Do you believe people just don't care that much about showing off photos anymore?\n\nGranted any new app that's just for photos will be better at it than Instagram, but where are they and who's using them?",
            "title_similarity": "0.77811766",
            "sentiment_compound": 0.7991
        },
        {
            "id": "h3xka4w",
            "score": 1,
            "text": "To be honest I don't think so. \n\nInstagram is attached to Facebook, which has 2.7 Billion users each month.\n\nTikTok has 689 Million. \n\nSo if only 25% of Facebook users are using Instagram, that's still 700 million. \n\nNot only that, but TikTok and Instagram do different things. They don't fit the same niche which is why they are both still around. It's not like MySpace and GeoCities and then Facebook. In that situation one solution was much better than the other and so it absorbed those users.\n\nIn this situation most people I know that use TikTok also have an Instagram AND a Snapchat.\n\nJust because it doesn't fit your niche doesn't mean it's dying. It means it's no longer serving your needs as well.",
            "title_similarity": "0.7180798",
            "sentiment_compound": 0.2035
        },
        {
            "id": "h3xkjby",
            "score": 1,
            "text": "Saying anything will die out eventually is not a prediction, it is a fact.",
            "title_similarity": "0.37629858",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h3xklw5",
            "score": 1,
            "text": "Their are no alternatives for Instagram. Thats why it can't die",
            "title_similarity": "0.5157542",
            "sentiment_compound": 0.2373
        },
        {
            "id": "h3xlpme",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19310242"
        },
        {
            "id": "h3xltz8",
            "score": 1,
            "text": "All social media does eventually. Instagram was slightly different so it lasted longer but it was inevitably going to end",
            "title_similarity": "0.7952604",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3xmepi",
            "score": 1,
            "text": "As long as hot women continue to show off on Instagram, it won’t die out.",
            "title_similarity": "0.5830351",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h3xnh3h",
            "score": 1,
            "text": "The fact that it tries to trick you into viewing things you don't follow did it for me. I hardly ever use it anymore. It took me a day or two to figure out why I was seeing no one on my feed. I am the type of person who will scroll and get side tracked. Close it out and want to come view it again later. Now I have to scroll until I find the \"view older posts\" instead of getting other crap shoved in my face.",
            "title_similarity": "0.76408166",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h3xnxgh",
            "score": 1,
            "text": "Also Instagram is dogshit",
            "title_similarity": "0.32223547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3xqa3u",
            "score": 1,
            "text": "I’m actually starting to agree and will add another issue: the algorithm from the content creators perspective. As a small business owner I have used IG for the last 6 years to promote my products. Over the last 1-2 years issues s/a shadow banning, canceling tags, and useless advertising for big wig corps (to your point regarding not showing people what they actually have interest in) is preventing many people from actually being seen, even if they’ve grown a significant following. YouTube has always been consistent, and tiktok (as much as I hate it) continues to grow in popularity to the point of it actually pouring over into IG feeds. IG is like the nose in the air cousin that thinks it’s better than everyone.",
            "title_similarity": "0.79201233",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h3xqe3t",
            "score": 1,
            "text": "Instagram is a cancer and deserves to be forgotten.",
            "title_similarity": "0.6761004",
            "sentiment_compound": -0.743
        },
        {
            "id": "h3xqj6l",
            "score": 1,
            "text": "I actually agree with a lot of your points especially users not seeing what they want. Instagram goofed when they made posts show up in random fashion as opposed to the time of the posts",
            "title_similarity": "0.70802",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3xqxkh",
            "score": 1,
            "text": "Absolutely.\n\nWhen pages I follow hexuswe they were hilarious at one point start just spamming porn and onlyfans I lose interest really quickly...\n\n\"Hey look, animated surgery clips! I'll follow\"\n\nA fucking day later\n\n\"...and her OF is free right now\"\n\nFuck right off.  Whores schilling their garbage.  I hope those massive pages get paid huge in exchange for losing whatever made them great.",
            "title_similarity": "0.7235668",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h3xrv39",
            "score": 1,
            "text": "I'm over it. I post on there because i own a business and needed to stay active and it's less involved than Facebook which is a toxic waste dump.",
            "title_similarity": "0.69235045",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3xrw5b",
            "score": 1,
            "text": "POS knew exactly what he was doing and figured what better way to retire then to go out with a bang",
            "title_similarity": "0.38766325",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3xv5yg",
            "score": 1,
            "text": "It’s been going downhill since Facebook bought them out. Sigh anything Facebook buys eventually goes downhill…",
            "title_similarity": "0.8108702",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3xxc7q",
            "score": 1,
            "text": "Now that I think about it, i just straight up stopped using mine. Which totally is a probably for a platform designed to be addictive.",
            "title_similarity": "0.638697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3xxefl",
            "score": 1,
            "text": "According to [this](https://www.omnicoreagency.com/instagram-statistics/#Instagram_Demographics) website, Instagram doesn’t really show any trends of it going away anytime soon. There are 1B+ active monthly users, 500M+ active daily users, 71% of young adults use it, and 72% of teens use it. These statistics just go to show that it’s not going to die out, especially because it’s mainly younger people using it so it’s a growing base, not a shrinking one.\n\nBeing a young person myself, Instagram is probably the most popular platform amongst people my age. Facebook died out for us between 2012-2014, most people don’t really use it anymore except to respond to birthday posts about yourself from family. Everyone has a Snapchat and TikTok, but those are completely different platforms. Instagram has a pedestal that I don’t think has a major competitor right now.",
            "title_similarity": "0.6636005",
            "sentiment_compound": 0.6125
        },
        {
            "id": "h3xxhfa",
            "score": 1,
            "text": "This whole comment section is like shareholders of Instagram coping.",
            "title_similarity": "0.5252212",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3xyla9",
            "score": 1,
            "text": "It'll fail, same way Twitter and Facebook did once they lost their edges.",
            "title_similarity": "0.7133669",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h3xyquo",
            "score": 1,
            "text": "They 100% silence and suppress small accounts as well.",
            "title_similarity": "0.4528394",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3xz5tx",
            "score": 1,
            "text": "What is this Instagram thing? Is it a rip off of imgur?",
            "title_similarity": "0.47489995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3y02i8",
            "score": 1,
            "text": "for some reason I'm on tbe native Hawaiian and asexual sides of instagram. i have never been to Hawaii and i am not asexual",
            "title_similarity": "0.50209683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3y04zz",
            "score": 1,
            "text": "I think this is an extremely weak argument.\n\nMaybe they are broadening out from their original niche, but they are not losing it. \n\nYou claim this is bad because YouTube and TikTok are already doing it well. I disagree. \n\nYouTube used to be a platform designed for freedom of expression from anyone and everyone, it is now a corporate sink hole designed to replace television. This has had a hugely negative impact on both content creators and viewers (I can go into more detail and provide references if you want). This leaves them in a vulnerable state where another app/company with an active user base could theoretically design a better algorithm and take their place. The only thing that keeps YouTube on top atm is the sheer volume of content and users.\n\nTikTok is a Chinese company, rampant with censorship, and I'd be willing to bet there's multiple privacy violations being committed by the CCP. I think Instagram is far superior to communism and abuse of power, but that's just my opinion.\n\nTo your second point, instagram absolutely shows you what you want to see. Only posts from your friends and pages you follow will come up on your feed, and if you reach the bottom of your feed (the \"you're all caught up\" part) it'll show you curated content based on what you and the people you follow interact with. If you don't like that part, you can simply go look at the older posts from your feed instead. (That option is provided immediately)\n\nIf you reach the bottom of your feed too frequently you either need to follow more pages, or use instagram less constantly/frequently. If the recommended content bothers you, either close the app completely or look at older posts from your feed.",
            "title_similarity": "0.8249816",
            "sentiment_compound": 0.2928
        },
        {
            "id": "h3y0ohl",
            "score": 1,
            "text": "I don't really believe that but point 2 needs some attention there.",
            "title_similarity": "0.3282392",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3y130l",
            "score": 1,
            "text": "Instagram has been trying to adapt and compete in spaces where it doesn't belong and then change to belong in those spaces.\n\nAs a picture platform, it's not as strong as some other platforms, but people use it as a social platform, like Facebook, which owns it, I think.\n\nIt's current form is a Snapchat competitor, from where I sit.\n\nThe only reason Instagram won't die is because it's part of Facebook.",
            "title_similarity": "0.80047345",
            "sentiment_compound": 0.7662
        },
        {
            "id": "h3y13uq",
            "score": 1,
            "text": "Stats would be good rather than feelings.",
            "title_similarity": "0.27038294",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3y1k4a",
            "score": 1,
            "text": "I hate Instagram i had 4k followers, erased it in November and haven’t looked back.",
            "title_similarity": "0.70444095",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h3y1oa5",
            "score": 1,
            "text": "i’ve been saying this for almost 2 years now!!!! thank u!!!!",
            "title_similarity": "0.37779754",
            "sentiment_compound": 0.5673
        },
        {
            "id": "h3y2iab",
            "score": 1,
            "text": "It's similar to facebook, younger people just dont use it as much now. The bots in comment sections makes it impossible to interact on big pages or see what people say. Just a shit app at this point",
            "title_similarity": "0.73160565",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3y2vuo",
            "score": 1,
            "text": "Intsagram doesnt share a niche with youtube or tiktok. Its a subbranch of facebook. Its not going anywhere.",
            "title_similarity": "0.5288651",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h3y37he",
            "score": 1,
            "text": "Y’all have been saying the same shit about facebook for 6+ years. The amount of casual users on IG is in the millions. The people that actively share stuff that most will deem fake and not worth their time. You underestimate the power of the lowest common denominator.",
            "title_similarity": "0.7386079",
            "sentiment_compound": -0.7981
        },
        {
            "id": "h3y3h9l",
            "score": 1,
            "text": "The great thing about this is that I told myself after IG I will not join any new social media platforms so once IG fails my social media days are done. Can’t wait.",
            "title_similarity": "0.7119148",
            "sentiment_compound": 0.0383
        },
        {
            "id": "h3y3n8q",
            "score": 1,
            "text": "IG is owned by Facebook. Facebook could lose a billion a year on IG and still keep it afloat for a long time. However they are not losing money. In fact i make media for advertising and we have trainings on IG and FB rules so that our ads comply.",
            "title_similarity": "0.69276273",
            "sentiment_compound": -0.1321
        },
        {
            "id": "h3y3nds",
            "score": 1,
            "text": "i think part two is what’s really starting to make instagram no fun for me. it’s still my favorite social media but i hate that it’s mostly ads and not my friends’ posts anymore",
            "title_similarity": "0.8290951",
            "sentiment_compound": -0.7097
        },
        {
            "id": "h3y3zbh",
            "score": 1,
            "text": "Instagram will not die out because it lost its niche the last 5 years. It just gained a hundred new niches. This means with its new shallow influencer content that there are even more users than just the original people posting artsy photos in like 2013.\n\nI think your argument is totally backwards. Now even middle aged moms have Instagram for their businesses or post Tick Tocks. It has drawn in a new demographic of users. It is becoming like Facebook. Everyone uses it, and not just for its original purpose.\n\nYour point is backwards. Instagram is becoming too influential. Almost every small business or restaurant has one. It’s not going away any time soon.",
            "title_similarity": "0.77946573",
            "sentiment_compound": 0.909
        },
        {
            "id": "h3y5ezx",
            "score": 1,
            "text": "Too many ads. Instagram is becoming like YouTube, and Youtube is becoming like Instagram.",
            "title_similarity": "0.6144999",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3y5x3d",
            "score": 1,
            "text": "What would it actually take to make a basic version of the original idea behind Instagram: sharing snapshots with friends?\n\nI mean; the raw cost of running it per user.",
            "title_similarity": "0.6354251",
            "sentiment_compound": 0.802
        },
        {
            "id": "h3y7nas",
            "score": 1,
            "text": "Anything bought by Facebook dies. The nunbers bear that out.",
            "title_similarity": "0.6248828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3y7nuo",
            "score": 1,
            "text": "Solid start to a five-paragraph essay. Please expand on key points make by including relevant details and quotes from reliable sources. Also, be sure to include a “Works Cited” page using MLA format. \n\nIf you have any questions, please review the rubric. I look forward to reading your next draft!",
            "title_similarity": "0.36277607",
            "sentiment_compound": 0.8439
        },
        {
            "id": "h3y7vnd",
            "score": 1,
            "text": "I’d argue that the influencer market is what it’s trying to appeal to and is a lot larger than you think it is. Instagram models, huge brand deals, engagements in the millions in forms of pictures or quick short vids, I don’t think that’s going away anytime soon as long as it’s photo sharing thing is what differentiates it from YouTube, tif tok, Snapchat and Twitter",
            "title_similarity": "0.60938656",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h3y90h3",
            "score": 1,
            "text": "That's why Facebook bought it.. to slowly squeeze the life out of it and prevent competition.",
            "title_similarity": "0.67876816",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3y94ra",
            "score": 1,
            "text": "Plus I can't even view the stories of the people I follow using the app on my phone, without there being ads after like what feels like nearly every story.",
            "title_similarity": "0.6195333",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3yafgo",
            "score": 1,
            "text": "I'd argue it's also going down a similar path to Facebook by creating a shopping page and a similar path to Twitter by having trending pages. \n\nI used to use it more than I do now so I'm not especially familiar with these newer functions. I am not their primary audience anymore so I can't comment on how these changes are viewed by frequent users. \n\nI personally am not a fan of these changes however and they led me away from the app.",
            "title_similarity": "0.82083464",
            "sentiment_compound": -0.2874
        },
        {
            "id": "h3yaq94",
            "score": 1,
            "text": "I think Instagram might be used less by Gen Z than it used to be, but I think it’ll end up being like millennial Facebook and Facebook is still going strong. Even though it may not be the most trendy social network anymore, I think it’ll keep a large portion of its millennial user base. Also, even though overall engagement has gone down, Instagram is still getting boatloads of money from ads",
            "title_similarity": "0.7495196",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h3yaxxh",
            "score": 1,
            "text": "500pix for the win.",
            "title_similarity": "0.25551695",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h3ycc7c",
            "score": 2,
            "text": "As an ex-IGartist who knows more artists, one of the things that I think IG it's gonna die is because IG doesn't recommend anything without paying and you only can grow being literaly a slave (stories, posting almost everyday, so IG only award los effort art), that's because I quit IG and most of my artist friends too. We moved to Twitter and is way more balanced and you can grow because Twitter recommend you well and you don't need to be a slave. And one of the strong niches of IG was the artists in general, but IG mistreats them. And it's not a NSFW problem, is a SFW too. Now is only a Friends/influencer photo sharing and it's noche is moved by fashions, so eventualy IG Will be forgot.",
            "title_similarity": "0.7589594",
            "sentiment_compound": 0.8876
        },
        {
            "id": "h3yfyyw",
            "score": 1,
            "text": "Everything dies",
            "title_similarity": "0.30910185",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3yhpxt",
            "score": 2,
            "text": "To your first point, Facebook (IG) is probably one of 2 companies that can put up the expense needed to compete with YT (the other being Amazon, but they’ve had twitch for a while and don’t seem to be straying too far from just streaming). If they can compensate creators better, you will likely see a fair amount of very popular youtubers shift platforms, or at least mirror, on IGTV. There is no shortage of creators looking for a better platform, but no ones had enough resources to properly compete with Google (YT). \n\nAssuming that happens, IG would actually grow. In fact, I would wager that the ONLY way forward for IG is expanding beyond its niche. Everyone that’s going to use IG for its niche purpose is likely already doing so, and if that’s all IG does, they will only lose users. This is currently Twitter’s problem, but Twitter is kind of niched into a corner, while IG can rebrand as a “media platform,” and grow with video sharing.",
            "title_similarity": "0.801175",
            "sentiment_compound": 0.9011
        },
        {
            "id": "h3yidjf",
            "score": 3,
            "text": "Can't you argue that most apps will die out eventually? Seems like you are trying to argue a given.",
            "title_similarity": "0.6600961",
            "sentiment_compound": -0.4638
        },
        {
            "id": "h3yj8gx",
            "score": 1,
            "text": "Couldn’t agree more I loved it for the photography side but now it’s constant adverts, meme pages and trying to force you to watch ‘reels’ their shitty tik tok copy. I’ve deleted it, used to love it to scroll through nice photos but it’s just not even close to what it was it needs to die. \n\nThat’s being said with an estimated 1 billion monthly active accounts a number that has increased year on year clearly it’s still very popular. \n\nIt sees the fifth highest usage of all social media apps (2 are Facebook, 1 is WhatsApp 1 is WeChat so I’d argue top 3). \n\nRevenue in 2018 was 6.84 billion, 2019 was 14 billion. With the increased revenue with an ever increasing user base I’d say as much as I hate it the changes are working and instagrams here to stay!",
            "title_similarity": "0.7225591",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h3ykqxu",
            "score": 1,
            "text": "It won't die out until we begin to see some sort of photo sharing app start to get adopted widely, and I really don't see that happening anytime soon. Our only hope now is some obscure Chinese instagram-like app that will eventually blow up globally 😂",
            "title_similarity": "0.672034",
            "sentiment_compound": 0.8873
        },
        {
            "id": "h3yl1sq",
            "score": 1,
            "text": "Instagram is currently, in my opinion, the best social media for keeping up with your friends. It is the one everyone I know uses and its easy to use and its messaging features and group chats are very commonly used.",
            "title_similarity": "0.4511782",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h3yl5vw",
            "score": 1,
            "text": "So as someone in the photo community (I shot for a fashion publication for a long time), it really put me in a bad spot. It was a easy to promote myself and then they changed the algorithm and didn’t get the exposure I once had.",
            "title_similarity": "0.81916237",
            "sentiment_compound": 0.25
        },
        {
            "id": "h3ylg94",
            "score": 1,
            "text": "Women still use it as the primary source of validation so no it's not going anywhere any time soon.",
            "title_similarity": "0.40315175",
            "sentiment_compound": -0.4341
        },
        {
            "id": "h3ymcpt",
            "score": 1,
            "text": "\"Instagram is the best way to promote some pussy\" - Kendrick Lamar",
            "title_similarity": "0.5217703",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h3yood5",
            "score": 1,
            "text": "Hope so..",
            "title_similarity": "-0.007885693",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3yr2o4",
            "score": 1,
            "text": "I still prefer IG over any other social media platform, although I really wish it would quit suggesting I follow young married Mormon couples with babies.  Not my demographic, at all.",
            "title_similarity": "0.66793287",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h3ys2k1",
            "score": 1,
            "text": "Instagram has now stated they favour video over photo. Its now trying to tackle Youtube and Tok Tok. Instagram will always be around. They'll just modify the content to what its users what to see.",
            "title_similarity": "0.6564801",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3ysn76",
            "score": 1,
            "text": "There’s rumors that they are trying to focus more on the shopping part. I don’t really understand why because I don’t know why people would use it just to shop, and I think people trying to monetize everything on there is what contributed to ruining it.",
            "title_similarity": "0.64347297",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3ytkoo",
            "score": 1,
            "text": "Instagram good. You’re wrong . That should settle the debate",
            "title_similarity": "0.6136223",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h3ytmrf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19310242"
        },
        {
            "id": "h3yu9p7",
            "score": 1,
            "text": "Instagram has Facebook money, as long as FB is around, IG will be around. At the very lease, it might be like Twitter where it is mostly a platform for famous people to interact with their followers. If anything, I don't see TikTok being around longer than Instagram. Vine and snapchat used to occupy that space, now it's TikTok. If not IG, something else will come along and will be the new short video app that everyone will jump on to.",
            "title_similarity": "0.7385647",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3yvfl7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.24683829"
        },
        {
            "id": "h3yyprt",
            "score": 1,
            "text": "Facebook is trash, Twitter is a microblog, Tik Tok is Vine propped up by the CCP. I'm on Diaspora, shoutout, because I'm a nerd but Instagram could hardly \"die out\" if there's really nowhere else to go. That's at least my thought.",
            "title_similarity": "0.7610286",
            "sentiment_compound": -0.7587
        },
        {
            "id": "h3yzec2",
            "score": 1,
            "text": "Really that applies to everything. I can’t change your mind cause it’s pretty much a universal inevitability that Instagram will cease to exist one day. So will America, and you, and Reddit. So you’re right.",
            "title_similarity": "0.6108376",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3z08v5",
            "score": 1,
            "text": "> Two - Instagram isn't showing people what they want to see\n\n> I believe that most casual users of Instagram are like myself - we follow pages that we want to use, which usually includes our friends and pages of interest that we are interested in. Instagram's attempt to push people to look at pages that they don't even follow at the expense of pages that they do is driving users away and lowering users' interest in the platform.\n\nI'm not sure if this counts as a challenge to your view or not, but:\n\nI had the exact same feelings about Facebook, then Tumblr, then Twitter. Each were social media's I used to follow specific accounts I was interested in, and then each, in turn, started trying to force me to consume content outside what I'd followed. I agree with you that, at least in my experience, this hindered my ability to see the content I actually did want to see, and it *is* the reason I stopped using Tumblr and Twitter. (I stopped using Facebook mostly for other reasons.)\n\nHowever, it seems most people don't have this reaction. None of these platforms (nor YouTube for that matter) seem to have found these policies to reduce use of their services in aggregate, or they'd have walked those changes back by now. Instead, they've accelerated them, and most (if not all) have only grown since. It seems to me, that once a platform has a critical mass of dedicated users, keeping those users glued to their screens and sharing content becomes more valuable than retaining however many users feel as you and I do. (And let's face it, users like us are probably below average in terms of activity.)",
            "title_similarity": "0.8180121",
            "sentiment_compound": 0.9797
        },
        {
            "id": "h3z16sn",
            "score": 1,
            "text": "Well this will suck for my photo business as it’s my main marketing and lead source. Oof 😅 it’s also how I stay connected with all of my friends…they do photos the best I don’t understand why change it.",
            "title_similarity": "0.72767985",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h3z45ws",
            "score": 1,
            "text": "This was a hot take five years ago.",
            "title_similarity": "0.27179486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3z61u4",
            "score": 1,
            "text": "Youtube needs a direct competitor, they don’t really have one, so if its done right, could be a win for the Zucks",
            "title_similarity": "0.6657951",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h3z9oan",
            "score": 1,
            "text": "Mate, I said this when insta was bought by Facebook.\n\nDon’t bet on it.",
            "title_similarity": "0.47624314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3za6bc",
            "score": 1,
            "text": "I have never understood why people use Instagram. It's just pictures like every platform has. One person told me filters? People like filters that much? No attraction to Instagram.",
            "title_similarity": "0.74306405",
            "sentiment_compound": 0.4367
        },
        {
            "id": "h3zb05g",
            "score": 1,
            "text": "Earlier today I might have disagreed but then I saw they now have pre-roll adds before IGTV so yeah it's the beginning of the end",
            "title_similarity": "0.62840664",
            "sentiment_compound": 0.4852
        },
        {
            "id": "h3zf8lh",
            "score": 1,
            "text": "Out of all of them--Snapchat, Twitter, TikTok, Facebook and Instagram--I definitely see Instagram going the way of My Space.  The reason being older people don't like Instagram.  Young people love TikTok and older people love Facebook.  I'm 43 and only keep my Instagram account because my 18 year old uses that more than anything else and I like keeping up with him.  My 21 year old doesn't use it anymore.  My 61 year old mom and 80 year old grandma have Facebook and use it daily.  There's just nothing overly special about Instagram that you can't get elsewhere.  I mean look at where we all are... definitely not spending the current moment on Instagram",
            "title_similarity": "0.71254975",
            "sentiment_compound": 0.9175
        },
        {
            "id": "h3zkqnt",
            "score": 1,
            "text": "TikTok employee*\n\nWhat about Reddit?",
            "title_similarity": "0.36695722",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3zlm9w",
            "score": 1,
            "text": "Instagram is evolving with features their users enjoy from other apps without them having to go through the trouble of downloading and making a profile for those other apps. You might not see the value of TikTok style content on Instagram, but there are people out there who enjoy TikTok style content but who also have a bad opinion of TikTok in general, so Instagram is saving them the trouble of having to make a profile for a whole different social media platform by giving them accessibility to it through their existing Instagram accounts.\n\nYour idea of fulfilling a niche is that a social media platform can only be good at one or two things, then leave the market open to others to innovate and surpass them as the next big social media platform, but you're ignoring the inconvenience of having all these different social media apps and profiles when so many people (especially older people) only want a single profile on a platform that does everything they like. Instagram is leading the pack in this regard. It's popular, accessible, it melds together content and messaging so you can easily share what you've seen with your friends, and perhaps most importantly it appeals to people's optical senses by showing them pictures and videos instead of large amounts of text like on Facebook, Reddit, and worst of all Twitter. Each of these other social media platforms have their flaws and limitations, and Instagram has them too, but Instagram is in the best position to integrate the innovations of other platforms into their all-in-one service. \n\nAs for what Instagram chooses to show people I kind of agree that they could use a bit of work because I have noticed ads popping up quite frequently, and I've even seen that some people can pay to promote their own personal, uninteresting pages as well, which is a little too desperate and pathetic for me. However Instagram's recommended section is a great feature that can introduce you to content related to things you liked or pages you follow that you never would have thought to look up on your own. Their hashtag system is a valuable asset too because you can find pretty much everything related to a topic that's been posted and tagged on the site, and the presentation is excellent as well, focusing on the visual senses with eye catching photos so that the accompanying text of the post is hidden until the photo is clicked on.\n\nI think your assessment that Instagram needs to remain what it was in order to stay relevant or remain successful is completely wrong, and that if every social media site only fulfilled their original niche they would be missing the biggest niche of all, which is to be a comprehensive all-in-one social media platform that does everything the other platforms do adequately enough for users to not need them.",
            "title_similarity": "0.7124515",
            "sentiment_compound": 0.9961
        },
        {
            "id": "h3zpmim",
            "score": 1,
            "text": "Facebook 100% ruined Instagram. At least for every photographer I know.",
            "title_similarity": "0.61179435",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h3zq0y3",
            "score": 1,
            "text": "I just made a video about this very thing, click like 3 times and follow the link in bio and then click on the picture that brought you there if you can remember.  Enjoy !",
            "title_similarity": "0.43735057",
            "sentiment_compound": 0.7396
        },
        {
            "id": "h3zqm07",
            "score": 1,
            "text": "I think also that instagram has a good branding, in the sense that instagram pages became something that is kind of an art to make look good. With the 3 square photos and the whole aesthetic as long as they don’t change that or diminish it, they should be good for a while.",
            "title_similarity": "0.5370361",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h3zrnup",
            "score": 1,
            "text": "The sign up process is horrendous.",
            "title_similarity": "0.34335646",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h3zwxr6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19310239"
        },
        {
            "id": "h40fui2",
            "score": 1,
            "text": "If at all instagram didn't try to compete with YouTube and TikTok rather than its own niche it would have already been dead by now.\nImprovise>adapt>overcome",
            "title_similarity": "0.78577596",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h414xa2",
            "score": 1,
            "text": "I think you should add \"Three - everything that made it special is long gone. Other social media has everything Instagram could offert. Instagram should start adding new and fresh features to it's plataform.",
            "title_similarity": "0.6740837",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h48nygz",
            "score": 1,
            "text": "I agree with your points about an over saturation of features but will go further to say that the true decline in Instagram’s value as a platform comes with its loss of equal opportunity for its users. \n\nI used to think that Instagram was a fabulous platform, particularly for artists and creatives to share their work, because it allowed for a one-to-one communication between the owner of an account and their followers - such that ones efforts in the distribution of their content held an immediate and visible effect on the reception of their work (this could perhaps be said about earlier-internet social media platforms in general, such as YouTube in the early 2000s).\n\nOf course this is no longer the case as, with the introduction of algorithmic content recommendations, a non-chronological feed and various other ‘invisible’ factors of content curation (something problematic about effectively all social media platforms at this point), users no longer have a transparent relationship with the platform - i.e. one cannot be fully aware of how the content they post will be presented to an audience.\n\nTLDW; Corporate buyouts ruined the internet. What was the Wild West is now a metropolitan strip mall.",
            "title_similarity": "0.7832941",
            "sentiment_compound": 0.7876
        },
        {
            "id": "h4dmrdu",
            "score": 1,
            "text": "I agree. But what app is going to replace them in regards to photo-sharing so we can push that more?",
            "title_similarity": "0.5572311",
            "sentiment_compound": 0.1901
        }
    ]
}