{
    "CMV: smoking weed everyday is not a healthy habit.\nI know I'm gonna get a lot of flack for this but I don't believe it's healthy to smoke weed everyday and would be open to changing my opinion on that as it is a contentious issue in my relationship. My partner believes smoking weed everyday is okay but I think marijuana and alcohol are similar in that, you shouldn't over use any substance, because at some point you begin using it to cope with life's daily challenges instead of learning to face your issues. I think if you're healthy and have no medical reason to smoke every day, that it's probably not a good habit. If anyone could provide research to the contrary that would help.": [
        {
            "id": "h42beut",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.\n\nThank you for understanding.",
            "title_similarity": "0.73343",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h40vpiw",
            "score": 8,
            "text": "I have borderline personality disorder, it causes me to have severe suicidal ideation.   \n\n\nIf I don't smoke weed every day I'd be dead, how is that healthy?",
            "title_similarity": "0.7537679",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h40vprg",
            "score": 1623,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h40qs3s",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h40v54i",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h40xcnk",
            "score": 15,
            "text": "It fucks your lungs and sets your endocannabinoid system all over the place, specially with today’s strains with such high THC, the tolerance builds up fast and makes a huge dent in your pocket. Without going into if it’s not legal where you are you’re probably smoking a lot of pesticides too. That being said I definitely know people that thrive thanks to be able to keep their anxiety at bay thanks to weed. I think most people shouldn’t be smoking it daily but to compare it to something as toxic as alcohol seems like a stretch. There’s tones of benefits from helping with appetite or simply winding down. No stoner ends up getting so high they get into a fist fight or cheat. Alcohol on the other hand.",
            "title_similarity": "0.8104196",
            "sentiment_compound": 0.748
        },
        {
            "id": "h40w2p4",
            "score": 23,
            "text": "You conflated two ideas.\n\nA healthy habit it is not, but it is okay. It’s not self-destructive behavior.",
            "title_similarity": "0.5414897",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h40qzse",
            "score": -1,
            "text": "compared to,  all substances are dangerous and can lead to unhealthy effects,  even water can kill you if you drink to much.\n\n1 joint a day won't significantly effect long term health, it will still effect it but compared to alcohol cigarettes and junkfood its relatively minor",
            "title_similarity": "0.7938757",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h40srxq",
            "score": 48,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h40zxjj",
            "score": 137,
            "text": "While it’s not “healthy”, because you are smoking a foreign substance, i wouldn’t compare it to alcohol. Everyday alcohol use can turn you into an alcoholic and could kill you. Marijuana is more difficult to become addicted to, but it cannot kill you since overdosing is virtually impossible. It’s also better than smoking cigarettes everyday, which will give you far worse effects like cancers or other diseases. \n\nBasically - while abstinence of any drug is the healthiest thing to do, marijuana is generally one of the safest and “healthiest” (it does have medicinal use after all) drugs you can do, there could be far worse things people could be doing instead.",
            "title_similarity": "0.8391993",
            "sentiment_compound": 0.5734
        },
        {
            "id": "h42act6",
            "score": 21,
            "text": "Who cares? Working 40 hours a week for 70% of your life isn’t a healthy habit either but everyone seems to look the other way. Do whatever gets you through the day and who gives a shit if it’s “healthy” or not",
            "title_similarity": "0.64889216",
            "sentiment_compound": -0.4678
        },
        {
            "id": "h41i8ut",
            "score": 5,
            "text": "> My partner believes smoking weed everyday is okay but I think marijuana and alcohol are similar in that, you shouldn't over use any substance, because at some point you begin using it to cope with life's daily challenges instead of learning to face your issues.\n\nCoping mentally and coping physically are two vastly different parts of the coping process. If this has been years and years of daily non-function then you really should have some form of intervention with your partner. They should be medicated with more than just marijuana as its only a band-aid solution to a gaping infected wound of a problem.\n\nAlcohol is used to cope similarly, however marijuana is nowhere near as destructive . You can drink yourself to death easily in a night, if I smoke too much I pass out. You physically CANNOT smoke yourself to death.\n\nOver indulgence in alcohol will lead to permanent internal damage to your liver, kidneys etc. Marijuana on the other hand is [less dangerous](https://jamanetwork.com/journals/jama/fullarticle/1104848) to smoke than Cigarettes, both do still cause permanent internal damage but this is the lesser of two evils.\n\n-------\n\n> My partner has borderline personality disorder and uses it to cope\n\n> I think if you're healthy and have no medical reason to smoke every day, that it's probably not a good habit.\n\nI agree, this is a blanket statement for a good many things alcohol, cigarettes, gambling, hell even ice cream are all bad habits to have.\n\nHowever your partner has Borderline Personality Disorder, they do have a medical need to smoke marijuana. They just haven't legally been prescribed it as an option.\n\nIn the same way that when I have a crippling anxiety attack a joint will take me down from that heart racing mind destroying emotional state.\n\n-------\n\nPersonally I think you made this post because you're upset with your partner not attempting other forms of therapy rather than them smoking marijuana.\n\nYou need to work out with them whatever is stopping them from going, if its financial, mental, physical, etc.\n\n-----\n\nI hope I changed your mind on at least a little bit of this. If so please award a delta, thanks!\n\nEdit: Typo thanks /u/Park-Lucky",
            "title_similarity": "0.90368783",
            "sentiment_compound": -0.9677
        },
        {
            "id": "h40tzbl",
            "score": 2,
            "text": "How old are they? Under the age of 25 can mess with brain development. That's a pretty well-known phenomenon.",
            "title_similarity": "0.35681248",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h411fi3",
            "score": 2,
            "text": "Don't you think that it potentially could be healthy depending on the individual all things considered? Perhaps the obvious outliers of people with chronic illness and those in constant pain with no other alternative? The definition of health resides on this notion but not everyone is the same. What is best for one is not for everyone necessarily. I think going down this line of thinking, you could potentially arrive to a changed mind on the concept.",
            "title_similarity": "0.6614934",
            "sentiment_compound": 0.6608
        },
        {
            "id": "h41l2ug",
            "score": 32,
            "text": "Daily cannabis smoker here. (All anecdotal “evidence” to follow.)\n\nWhen I started smoking (7-ish years ago), it was because I was struggling with (primarily mental) things in my life. Cannabis helped me deal with my anxiety while I was high. \n\nWhile high (and calmed), I was able to enhance my introspection and do deeper work on myself more effectively. After a few years of deliberate effort to help orient myself properly in life, I’m finally happy and healthy (at least over 95% of the time).\n\nToday, I’m golden almost all the time (even when momentary stressors/setbacks occur, I’m able to respond to them quickly and accordingly). I don’t “need” to smoke, though I never “needed” to, but it did help. \n\nI still smoke (though I switched to vaping a few months ago) everyday because I LOVE smoking, it’s another aspect of the human experience I enjoy fully (just like “delicious” food, “gratuitous” sex, and service for others—I don’t “need” any of these, but they sure do improve my already good life!)\n\nAnyway, it sounds to me like you believe daily weed smoking is fundamentally excessive. Why? Are there no other criteria that you are using to evaluate the rate  of consumption? (Certainly you don’t believe drinking 0.5oz of beer everyday is bad, simply because it’s daily—as that’s a minuscule amount of alcohol—right?)\n\nYou seem to be under the impression that a person who consumes a substance daily loses all abilities to cope with life’s daily challenges, regardless of whether they developed healthy coping skills in the past. (But even if they don’t already have the coping skills, substances, like cannabis, can help a person through the challenges in the moment, so they can address and adapt to them later on.)\n\nIt seems you have a black-and-white view of cannabis being purely a drug of abuse or medication, possessing no other valid use.",
            "title_similarity": "0.72544926",
            "sentiment_compound": 0.9905
        },
        {
            "id": "h41s0an",
            "score": 18,
            "text": "From an ex addict, in my opinion smoking weed every day is not healthy or efficient - life is much better outside of this bubble and a lot of people who say it’s okay are in denial and are scared of making a change. Most notably I think it’s fear of having to deal with life’s challenges without a crutch, it’s much easier to not think about your thoughts and smoke / eat weed than to face into the wind and deal with your issues. \n\nI’ll enjoy the downvotes on this but please remember, this is my Opinion",
            "title_similarity": "0.9157848",
            "sentiment_compound": 0.4862
        },
        {
            "id": "h41h3oq",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h40nid6",
            "score": 0,
            "text": "**Note:** Your thread has **not** been removed.\nYour post's topic seems to be fairly common on this subreddit. Similar posts can be found through our [DeltaLog search](https://www.reddit.com/r/DeltaLog/search?q=drugs+%7C+cannabis+%7C+weed+%7C+marijuana&restrict_sr=on&sort=relevance&t=all) or via the [CMV search function](http://www.reddit.com/r/changemyview/search?q=weed&amp;amp;restrict_sr=on).\n\nRegards, the mods of /r/changemyview.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/changemyview) if you have any questions or concerns.*",
            "title_similarity": "0.5441877",
            "sentiment_compound": 0.4291
        },
        {
            "id": "h4146mk",
            "score": 0,
            "text": "I think it depends on the individual and the strain of the weed. I used to smoke everyday and I was always tired, depressed, found it hard to wake up, found it hard to sleep, anxious, severe brain fog etc. But my partner never had any of those issues!",
            "title_similarity": "0.8134415",
            "sentiment_compound": -0.7345
        },
        {
            "id": "h414kpb",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h4259bt",
            "score": 0,
            "text": "When are they smoking?\n\nIf it’s all day throughout the day, maybe, but in the evening while getting ready to wrap up the day with a movie or some music or something, I think that’s fine. I personally smoke most nights and it helps a bit with soreness from working out.\n\nAlso, you know your partner’s situation better than random internet strangers, but I wouldn’t infer that they’re smoking to cope with life without knowing for sure that that’s the case. Like I said, it could be a nice way to relax at the end of the day or have a fun time with friends, but again, I don’t know what your partner’s relationship to weed is.",
            "title_similarity": "0.7507068",
            "sentiment_compound": 0.9844
        },
        {
            "id": "h40spvv",
            "score": 427,
            "text": "It depends on the individual, really, as what is \"healthy\" can be different. There are people out there who definitely should not be smoking weed everyday because it brings out their worst tendencies. Then there are people who smoke weed and it helps their productivity or can help relieve the anxious tension a lot of people feel before working out. Would I ever describe it as healthy? No. Would I ever try and describe as it a blanketly \"unhealthy habit\" though? Probably not.",
            "title_similarity": "0.90922385",
            "sentiment_compound": 0.5362
        },
        {
            "id": "h417qwl",
            "score": 290,
            "text": "I take 11 prescriptions a day, plus cannabis, and I consider my cannabis use to be medical.\n\nAll of the drugs I take have side effects. I still need all of them to live. Where do we draw the line on what is heathy?  I believe the benefits outweigh the costs, just the same as all my other prescriptions or I wouldn’t continue daily use.\n\nEdit: Grammar",
            "title_similarity": "0.6899343",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h411h4e",
            "score": 1,
            "text": "Don't you think that it potentially could be healthy depending on the individual all things considered? Perhaps the obvious outliers of people with chronic illness and those in constant pain with no other alternative? The definition of health resides on this notion but not everyone is the same. What is best for one is not for everyone necessarily. I think going down this line of thinking, you could potentially arrive to a changed mind on the concept.",
            "title_similarity": "0.6614934",
            "sentiment_compound": 0.6608
        },
        {
            "id": "h411zby",
            "score": 1,
            "text": "There are certainly ways to smoke weed that are unhealthy. That doesn't mean the practice itself is unhealthy. That doesn't mean that if your partner stops, that they will be the partner you want them to be.\n\nAll else being equal, smoking weed everyday probably is not a net gain.",
            "title_similarity": "0.83982444",
            "sentiment_compound": -0.8164
        },
        {
            "id": "h417vdd",
            "score": 1,
            "text": "Marijuana and alcohol are not similar. Despite alcohol being legal and culturally accepted, it is a hard drug whose addiction (when you get to the final stage, i.e. morbid alcoholism) has nothing to envy to heroin addiction, no matter if we're talking about social dangerousness, about body toxicity, about intensity of craving and withdrawals (delirium tremens can often be a fatal condition, while you can't die from heroin withdrawal).\n\nCannabis on the other hand has its body toxicity mostly rooted in the fact it is most often smoked (if you take it as a grown adult), has relatively low social dangerousness (I know more functional daily weed smokers than functional heroin addicts), and so on.\n\nBut the \"soft drug\" nature of cannabis should still not be overlooked in my opinion, and daily massive users (who will typically use a bong) are still greatly addicted and will experience cravings as do any drug user, if nothing from the fact their whole lives has been intermingled with their cannabis consumption.",
            "title_similarity": "0.7885627",
            "sentiment_compound": -0.5134
        },
        {
            "id": "h41bgag",
            "score": 1,
            "text": "Define unhealthy? I smoke weed pretty much everyday, I have a good job, healthy relationships, generally happy life. Sure, I may have a 'problem'. But what exactly is the unhealthy part?",
            "title_similarity": "0.7014717",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h41g86l",
            "score": 1,
            "text": "Might be a different cmv in itself. But: you’re comparing weed to alcohol as a potentially unconscious coping mechanism for daily stress. Unless the coping mechanism is objectively unhealthy (like daily alcohol probably would be), is a coping mechanism for daily life stress necessarily bad? I run or exercise almost daily, or spend time outdoors, which definitely serves as coping mechanisms for daily life stress. I feel so much better after those things. Is it bad that I have a stress relief/coping mechanism? I’d say no, as long as I don’t avoid dealing with things that need dealing with. If the mechanism has negative side effects, that’s a different story. But lots of people use weed daily their whole life and don’t have negative side effects. Maybe they’re slightly more unproductive or disconnected. but so am I when I go for a 30 minute walk through nature.",
            "title_similarity": "0.8441875",
            "sentiment_compound": -0.9873
        },
        {
            "id": "h41h9wy",
            "score": -1,
            "text": "I've been smoking fat for 8 years. I have a great job, stable relationship, and I got accepted into every university I applied to including UC Berkeley and UC Davis. I have no medical reason other than to get fucking high and to be honest I scoff at people like you. The science is there and people know smoking things isn't good for you. My girlfriend doesn't smoke and doesn't mind that I do at all. If you're using weed OR ANY SUBSTANCE to cope with life's daily issues then maybe it's time to reconsider using those drugs but if someone wants to smoke some weed because it helps them with a mental issue or eases pain, that is ok. If I wanna get fucking stoned off my ass after work and relax then that's ok too. Why the hell do people care so much about weed? Grow the fuck up ya panzies.",
            "title_similarity": "0.748448",
            "sentiment_compound": -0.1909
        },
        {
            "id": "h41jnqs",
            "score": 1,
            "text": "I think smoking/consuming marijuana everyday can be very beneficial for a lot of people.it helps combat depression, anxiety, insomnia, and even eating disorders. \n\nbut I also think moderation is key. it's not unhealthy to have a glas of wine everyday, or a little junk food everyday, but if you're getting blackout drunk or pigging out on McDonald's every night, you run into a problem. I think it should be the same with weed. if you have a little gummy thing or smoke a bit just for fun, that's no big deal. but if you're getting super high just to function everyday it might be time to stop.\n\nadditionally, people under 25 should really not make it a habit, as your brain is not gully developed up until that age. brain damage is not fun.\n\nand of course for medical reasons(ex. pain management, anxiety, depression, etc.) you should be consuming as much as your doctor tells you to, or as much as you're comfortable with. \n\nso no, I don't think its unhealthy to smoke weed everyday, under certain circumstances.",
            "title_similarity": "0.8156322",
            "sentiment_compound": -0.7374
        },
        {
            "id": "h41m24s",
            "score": 1,
            "text": "My gf and i smoke weed together every evening to settle down for the night. 5 years together. 4 years of daily smoking at night. \n\nDoesnt affect the next morning, we dont use it during the day(not appose i just dont want work to feel twice as long)\n\nHow do you want your view changed? Is inhaling smoke healthy? No...\n\nAre there heathier alternatives to use that time for? Sure\n\nBut its kept our schedules, patterns, and mood in lockstep, gives us something to look forward too after a long day, and makes whatever menial activity we do more enjoyable. Alternatives could include overeating, alcohol, ignoring each other on our gaming PCs.\n\nIdk it sounds like you have a person with more issues than a \"bad habit\" and you want to use a non harmful, non physically addictive substance to blame. \n\nI work everyday, cook dinner everynight, am putting together a small business, and take care of 7 pets with no qualms or issues. \n\nIk people who wont touch any drugs or alcohol and who go to church regulary who refuse to stop binge eating, are miserable about their life, and who blame everything around them. \n\nAnd lots of people who dont touch weed or alcohol who excell if all aspects of life. \n\nSeems like its 99% who a person is and 1% what vices they may use for the stress life throws at them. \n\nUnfortunately i cannot afford vacations so i take little mental vacations at the end of the day and chillax with the love of my life. And Lego. If i have any problems in life its that ill eventually dorwn in the Lego i continue to keep purchasing.",
            "title_similarity": "0.7806351",
            "sentiment_compound": -0.9553
        },
        {
            "id": "h41mxl0",
            "score": 1,
            "text": "I associate weed with loserdom and low-class behavior. The smell is awful too.",
            "title_similarity": "0.519699",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h425bqc",
            "score": -1,
            "text": "Bigot",
            "title_similarity": "0.04035785",
            "sentiment_compound": 0.0
        },
        {
            "id": "h427h7m",
            "score": -1,
            "text": "You should smoke more",
            "title_similarity": "0.2949791",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4288lu",
            "score": -1,
            "text": "Tell that to all the doctors prescribing it for daily use.  \n\nYour view is outdated.  \n\n\n>If anyone could provide research to the contrary that would help. \n\nSo what you're saying is that you refuse to do any research on your own, and want the information spoon fed to you? That's an incredibly lazy attitude, something I would expect from a stereotypical \"stoner\". \n\n\nIf your partner was using a \"normal\" prescription medication to deal with their mental health issues, would you still be calling it a crutch?   \n\n\nYou know how parents like to blame their kids' depression on \"you're always on that damn phone\", when in reality, the phone use is a **SYMPTOM** of the depression, not the root cause? That's you. You're doing that. But you're saying \"weed\" instead of \"phone\".  \n\nYour partner's medication is the business of two people: \n\n1) Your partner.  \n\n2) Their doctor.  \n\nUnless you have some sort of medical degree you haven't mentioned, I'd say sit down and stay quiet.",
            "title_similarity": "0.7969384",
            "sentiment_compound": -0.7605
        },
        {
            "id": "h40sr7w",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h4170hi",
            "score": 2,
            "text": "Alcohol and weed are very different, both in terms of what it does to your brain and body, and how the “high” works. Weed is hardly damaging of at all to any part of the body, only really showing any harm to teenagers who use excessively or people with schizophrenia or any other intense mental illness. Weed also is not physically addictive, which means addiction is far less common, achievable and harmful, as there is no symptoms of withdrawal. Alcohol on the other hand works by literally damaging your brain cells to create drunkenness, has the same health benefits to your organs as cleaning products, and has some of the most intense symptoms of addiction and withdrawal. Your partner only has a weed problem if they chose to put weed over anything and everything important.",
            "title_similarity": "0.72567534",
            "sentiment_compound": -0.7056
        },
        {
            "id": "h41dg8z",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h41lm6m",
            "score": 2,
            "text": "I've never heard anyone with no mental health or physical health issues say smoking weed everyday is a healthy habit for them. It sounds like even your partner says it's \"okay\" not healthy. By prefacing your point with \"I'm going to get a lot of flack for this\" you're also trying to make yourself a victim before anyone even responds. I don't think this is conducive to finding helpful information. \n\nThat said, there is evidence that some groups overestimate the medicinal qualities of marijuana despite incomplete research findings: https://www.theguardian.com/society/2018/jul/23/cannabis-health-benefits-american-attitudes-study\n\nThe article also points out that legalized medical Marijuana has reduced prescriptions for schedule 3 opioids so if it's being used as an alternative to more harmful drugs than it is absolutely healthier, but maybe not healthy. The answer is not going to be it's healthy or unhealthy and you should accept the nuances and avoid black and white statements.",
            "title_similarity": "0.9039414",
            "sentiment_compound": -0.2883
        },
        {
            "id": "h41v6uq",
            "score": 2,
            "text": "Ok maybe I can actually weight in. I am a daily marijuana user for the last 11 years who used to be a deadbeat. I floated from job to job, drank more over the years, never went to college even though I could have, and oftentimes, I felt it was cause I was smoking weed. However, I think the issue, like many people who do not do drugs maybe don't understand, is I also got better cause of drugs and therapy combined. Even though I smoked weed all these years, I also smoked it through my therapy, even switched to only vaping bud because I wanted to protect my lungs more. However, I have held down multiple jobs this last 6 years without any gaps, got into therapy, traveled, and reenrolled in school, achieving my community college degree and got accepted into a nice college I can afford to transfer to, also while nonstop smoking marijuana. I think maybe the combination of going to therapy for 5 years and even trying psychadelics (which i havent done in 2 years) contributed overall to my better well being, but that quitting marijuana wasn't necessarily what I needed. Motivation and direction in my life not only to take care of myself but to also better myself while resolving my past traumas, that was all that was necessary for me to become a self-motivated individual. You mentioned your partner has Bipolar Disorder, if i recall correctly. I am not a doctor, but there are plenty of people who convince themselves that weed is their medicine for their mental health, but for my experience, it really  just helps getting through things on the daily, but that can also manifest as putting things off too (something pot smokers are wont to do). Ultimately, i do not think your partner is addicted to weed or has a weed problem, but it does sound like marijuana is making it easier for them to ignore the deeper issues at hand that things like therapy can help resolve. I would also like to mention that it is noted that those with a predisposition to mental and emotional disabilities should avoid marijuana as it can expound those issues. Part of this problem is the good examples of marijuana users are quiet and hidden. Theyre coping in some way and their weed isn't the issue, so they don't say anything. However, someone already coping with some form of distress or trauma is looking for an outlet, so marijuana might make them more vocal and open about their disability without seeking out the necessary professionals. Honestly, some of my best therapy sessions happened while I was stoned out of my gourd! In fact, I am composing this transcription entirely while blitzed out of my mind, so take what I say here with as much gravity as you wish. Have a wonderful day!",
            "title_similarity": "0.7922249",
            "sentiment_compound": 0.9939
        },
        {
            "id": "h40vd66",
            "score": 65,
            "text": "I think it depends a lot on lifestyle.\nIve met a lot of surfer/laborer/hippy types over the years in hot countries like Australia, Thailand and Spain that smoke one or two joints a day without any or with very little tabacco and seem healthier than a lot of the office workers I know... I guess because they spend all day working/chilling in the sun and don't stress out too much (chronic stress can be a major health problem - google cortisol).\n\nOn the other hand I've met a large quantity of sit on my ass play video games/watch tv 8h a day while constantly smoking types in places like England where the drug appears to be stronger, theres more urban development and less of a culture of doing outdoorsy sports and manual labour.\n\nTLDR: I'd argue that in moderation combined with an active lifestyle its barely as damaging as eating cake. But with the wrong kind of attitude and environment it can be a baaad spiral.",
            "title_similarity": "0.6864772",
            "sentiment_compound": -0.5242
        },
        {
            "id": "h41k4wq",
            "score": 4,
            "text": "From your responses I think you have more of an axe to grind against weed than you do concern for his well being. You say you aren't seeing a change into a \"healthy and productive life\" but you also admitted he has BPD. IMO if you had any actual concern you wouldn't look for blame in weed you would look for blame in his illness. Read up BPD. Talk to him and let him know that you don't think he's doing better. Don't go to reddit to try and confirm your bias. BPD is a monster of a mental illness it can come with a multitude of problems and it's quite possible he is overusing weed. But I would say it's much more a result of his mental illness than the substance itself. In other words let's not blame alcohol because there is an abundance of alcoholism.",
            "title_similarity": "0.84587216",
            "sentiment_compound": -0.806
        },
        {
            "id": "h4203m5",
            "score": 2,
            "text": "It's interesting, you want someone to change your view when you don't even have a basic premise?  You just _think it's bad_?\n\nWhat if I take a puff every day after I get home from work?  How does this compare to smoking 2 joints?\n\n> I think if you're healthy and have no medical reason to smoke every day\n\nI think if you're _intellectually honest_ you'll see that you don't have don't have a view, you have an ideological position.\n\nFrom your other responses, you're clearly being intellectually dishonest because you've failed to disclose the basis of your opinion in that someone close to you has problems and is using, and then _you_ are transferring your frustration onto marijuana.\n\nYou literally have a full set of things to blame and consider but you take your partner's problem and then try to generalize it to one thing that ignores the rest of things.",
            "title_similarity": "0.89951634",
            "sentiment_compound": -0.8708
        },
        {
            "id": "h4152on",
            "score": 400,
            "text": "Any drug of any kind taken every day can be an unhealthy habit. Even ibuprofen. Taken in excess, it can cause stomach bleeding. \n\nBut, the line for everyone is different for how the advantages vs disadvantages work out. \n\nIf someone is gaining nothing but a high for literally no reason everyday, it’s probably not healthy. However, if someone suffers from crippling anxiety and they use moderated dosages to help them function, this is likely a more healthy lifestyle choice for them.\n\nEdit to add: I’m treating marijuana in this case as a medication. Lots of medications have side effects, but doctors recommend them because the positives outweigh the negatives.",
            "title_similarity": "0.8587583",
            "sentiment_compound": 0.878
        },
        {
            "id": "h41c4lg",
            "score": 48,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h41mfoi",
            "score": 5,
            "text": "Complete opposite story for me: my husband never had any drug, not even a sip of alcohol in his life until his 30s. When we moved to a legal state, he tried weed (edibles because he’s a health nut and wants to avoid smoking). It honestly changed our lives in ways I could never have expected. It’s similar to the way people talk about taking DMT. I never expected that weed could be that tool, I just saw it as recreational. But honestly I can believe the catalyst it became for growth and the improvement it has had on our marriage. It was the right tool for his mind.\n\nI can’t even go into the list of ways marijuana opened up his mind and heart in permanent ways. Ways I never could have conceived. It’s like there was a blockage and he has grown as a person and transformed tremendously. \n\nPersonally for me, it has also helped me cope through one of the the hardest years of my life. And it never became a crutch. In fact, this year has been a tremendous one of personal growth as I made it through these challenges. Weed never stopped me from confronting myself and my challenges.\n\nWe both also work tremendously hard as we own our own businesses.\n\nSo your experience with your partner is just that. There are many other issues your partner faces and weed is not to blame. It might be wrong for your partner, just like my meds aren’t right for some other random person. But there’s lots of people who do just fine using weed regularly.",
            "title_similarity": "0.83069545",
            "sentiment_compound": 0.9833
        },
        {
            "id": "h41fehs",
            "score": 6,
            "text": "I have been a daily smoker for 10 years and I’ve gone through many ups and downs and I can say for probably 7 of those ten years my daily smoking was unhealthy. However now my daily smoking is much healthier as I only have one or two small hits at the end of the day. Within “daily smoker” there are so many different levels of how much weed you’re smoking and that can make a huge difference in how healthy the habit is. If youre smoking first thing in the morning and smoking throughout the day it’s probably not super healthy. If you start smoking around 4:00 and take lots of hits in the evening it’s a little better but still probably unhealthy. If you are taking one small hit a day at the end of the day, I would compare that to a small glass of wine at the end of the day which isn’t really an unhealthy habit. \n\nThen there’s how functional you are when you’re high, is it impeding things in your life that you know you want to do, are you physically healthy… the list goes on.\n\nAt the end of the day I think it’s very different for everyone but Hamilton Morris, a wizard when it comes to drugs and your body, talks about taking a break just for the sake of taking a break and finding out how it effects you. I think it’s very telling to try that and see how it effects you.\n\nAs a side note does your husband work out? Eat healthy? Do any extracurricular activities? Sometimes weed is a small part in an unhealthy routine",
            "title_similarity": "0.7360269",
            "sentiment_compound": -0.924
        },
        {
            "id": "h40syhh",
            "score": 72,
            "text": "Is this specific to just consumption through smoke inhalation?\n\nWhat about vape or edible?  If one were to consume cannabis on a daily basis through different methods, would it still be bad in your opinion?\n\nWhile I agree with the idea and concept of over consumption, where do you draw the line?  I see you're trying to make the point it's about every day.  But, shouldn't it matter moreso if it negatively impacts ones life vs just frequency?  And, if it does not, is it still over consumption?",
            "title_similarity": "0.8609369",
            "sentiment_compound": -0.3759
        },
        {
            "id": "h40pk7o",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h415678",
            "score": 1,
            "text": "Everyone is different. Weed can help and hinder. It is the most healing and helpful natural plant/drug. It’s how we abuse it that’s bad. We all have our habits and ways of coping. I cannot drink alcohol, I use weed medicinally and to relax as it’s the only thing I enjoy and helps me feel better. I can go without it but have a lot more stress and pain without. Just as if I didn’t take my other medicines. I am ill but work part time from my home. I smoke then do work, as it’s art and creative. I smoke then do yoga as it eases my joints and hurts less. I wouldn’t smoke then go driving for example. There’s pros and cons to everything. Communicate and compromise on your wants/ needs/ worries with each other. ✌️",
            "title_similarity": "0.8204747",
            "sentiment_compound": -0.8794
        },
        {
            "id": "h415jk3",
            "score": 1,
            "text": "What you describe is classic drug abuse as apposed to recreational drug use.\n\nIf you use a drug to cope with personal issues, which lets face it are usually mental health related, you are abusing that substance. In that case it is most certainly not a healthy habit as the person should be dealing with those issues rather than using a drug to avoid dealing with them.\n\nIf you use a substance to relax or have fun and are otherwise a functional human being you are using the substance recreationally. Many people can do that on a daily basis without running into any issues (as long as we don't discuss possible long-term physical health issues).\n\nSo I would argue that wether or not a daily use of marijuana is a bad habit or just a habit depends entirely on the individual situation you're looking at and it is impossible to make a blanket statement without knowing the details of the individual case.\n\nIf you had framed the question: \"my so uses marijuana to cope with his mental health problems and I think this is an issue\" and then provided us the details you did in the comments, I would have been inclined to agree with you.",
            "title_similarity": "0.84644777",
            "sentiment_compound": -0.8454
        },
        {
            "id": "h416bd0",
            "score": 1,
            "text": "I found this interesting. How do you feel your belief is impacted by this resource?\n\nhttps://www.drugabuse.gov/download/1380/marijuana-research-report.pdf?v=d9e67cbd412ae5f340206c1a0d9c2bfd",
            "title_similarity": "0.5195395",
            "sentiment_compound": 0.54
        },
        {
            "id": "h417wis",
            "score": 1,
            "text": "I wouldn't say it's healthy for your lungs, smoking anything is not great for you. However, behaviors you're referencing in a comment about your SO are not caused by the substance. The reason behind the cannabis use is what matters - if you take care of your mental health, smoking every day isn't going to just cancel that out. If you don't take care of your mental health, using cannabis or alcohol or any other substance can give people a generally accepted excuse for their behavior.\n\nIt's easy to smoke weed, and it makes some people feel better for a while... but improving and maintaining mental health takes real work, not to mention there's the stigma and lack of awareness that still very much exists around mental health. It's understandable why people go straight to blaming the substance, but it has so much more to do with why a person believes they need to imbibe so often.",
            "title_similarity": "0.89859587",
            "sentiment_compound": -0.1381
        },
        {
            "id": "h418cgt",
            "score": 1,
            "text": "I vape a little bit, workout, stretch, drink water and head off to bed.  This is after all the things that need to be done that day are complete, the kids are safely in bed with lunches for tomorrow done and my i’s dotted and t’s crossed.  It’s different for everybody, but I feel it’s far less of a dangerous release than alcohol.",
            "title_similarity": "0.54905987",
            "sentiment_compound": -0.3928
        },
        {
            "id": "h418nd2",
            "score": 1,
            "text": "I smoke everyday and it doesn’t affect literaly any aspect. I have been employeed continually for 3+ years. I have a very healthy relationship and friendships. Also, people use weed as an anti depressant. It helps with anxiety, stress and depression so yes they are using it to cope but that’s because it HELPS. You sound very ignorant. Maybe your girlfriend has depression and it helps? Maybe she has other issues and it HELPS? Weed doesn’t ruin people’s lives police who arrest people for weed ruins peoples lives. People have literaly been smoking since the beginning of time. If it were really that bad we wouldn’t exist",
            "title_similarity": "0.8028773",
            "sentiment_compound": -0.9395
        },
        {
            "id": "h418vd2",
            "score": 1,
            "text": "I’ve smoke weed for years continuously and it never affected my job performance, in fact, it helped me get motivated to do a good job or to keep going.\n\nAlcohol in the other hand has affected to the point of me getting fired for it.\n\nI don’t smoke or drink anymore. I feel the same if I’m high or not. Same productivity levels.",
            "title_similarity": "0.7582466",
            "sentiment_compound": 0.6535
        },
        {
            "id": "h41957h",
            "score": 1,
            "text": "The issue is you’re using a blanket statement thinking it covers one thing but it covers multiple. Obviously ingesting combusted matter (smoke) is unhealthy. So we are left with consumption of THC. Is that bad? Surely it can be problematic if it interfered with your life, but is it genuinely causing your body harm? Maybe not. I haven’t seen any studies to suggest that THC consumption harms your body. We could take it a step further and say, the habit of enjoying THC can be a great stress reliever and this good for your overall life and health.",
            "title_similarity": "0.83027",
            "sentiment_compound": -0.7149
        },
        {
            "id": "h41987f",
            "score": 3,
            "text": "I think it would be hard to advocate for it being healthy. But I would argue in terms of coping strategies, you could do worse. Notably, I would rather see someone smoke pot daily than I would see them drink daily or smoke cigarettes or do other drugs. While long term research isn't entirely there, the consensus seems to be that chronic pot use does not seem to lead to increased cancer risk like cigarettes. In addition, a lot of the risks that may exist (research is inconclusive) seem to be in the developing brains of teenagers, not older adults. \n\nThere is little chance of it being \"healthy\", however, on a physical sense. There could be some minor physical or mental benefits, but there are also likely some risks and dangers, so I doubt healthy would ever be the outcome. But I would still argue it's definitely a healthier habit than many others. After all alcohol is very addictive, especially for people with mental illness, and it interferes with many psychiatric medications. The health consequences of chronic alcohol use are well known and severe. I would 100% rather see someone I care about smoking pot every day than getting drunk every day.",
            "title_similarity": "0.892558",
            "sentiment_compound": -0.9248
        },
        {
            "id": "h41a43x",
            "score": 1,
            "text": "I agree. I smoked way to often and it became my life lol. It's definitely something i stop recommending to ppl. It's fun but should be regulated with certain individual restrictions",
            "title_similarity": "0.7175813",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h41a57k",
            "score": 1,
            "text": "Just to be clear, in general terms, overusing anything is not a healthy habit, but if someoone has severe anxiety or other mental illnesses it may force them to form habits like self-harm or tantrums that are way more dangerous than weed. Smoking weed everyday can be healthy depending on the circumstances. Then it depends on the dosage and the cbd/thc ratio.\n\nWeed has medicinal properties beyond just getting high. If you don't believe me, take the word of Patrick Stewart himself - [Patrick Stewart admits using marijuana every day to battle illness](https://www.nme.com/news/film/patrick-stewart-admits-smoking-marijuana-every-day-battle-illness-2019305). He's almost 80 years old.",
            "title_similarity": "0.89361465",
            "sentiment_compound": -0.9046
        },
        {
            "id": "h41at9l",
            "score": 1,
            "text": "My ex partner smoked it as soon as he got back from work all evening every evening, all day on weekend. It made him stupid . I did it about once a month and I was fine.",
            "title_similarity": "0.5881549",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h41bfmm",
            "score": 1,
            "text": "I agree. But I think alcohol and cigs are worse so I pick my battles. Also there is a difference between smoking all day or having a little bit at night. I don’t think weed is much worse than caffeine",
            "title_similarity": "0.82303053",
            "sentiment_compound": -0.899
        },
        {
            "id": "h41bqb3",
            "score": 1,
            "text": "I think you might have a point if you narrow it down. Smoking anything is not good for the lungs and that’s indisputable. In California there are SO many alternative ways of investing thc or cbd products and safely. They have a drink company called CANN that have about 5mg thc all together (which is enough for a slight buzz, certainly doesn’t get you high) and that is nice for literally just taking the edge off. \n\nWhen I get migraines I take a b12 tablet and a cbd tablet together and something about those two I swear does the job for me. \n\nThere’s a lot of benefits to marijuana products but they aren’t all bad for you and provided you don’t get really high everyday it shouldn’t have bearing on your memory. \n\nAlso for migraines if you take a b12 with a cbd tablet it really does wonders.",
            "title_similarity": "0.7269909",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h41c9gn",
            "score": 1,
            "text": "Too much of anything is a bad habit but to each their own. Some people do just fine smoking weed daily and that's their business.\n\nIt's really that simple. If it isn't an addiction by definition of addiction then it isn't an issue.",
            "title_similarity": "0.8142124",
            "sentiment_compound": -0.0129
        },
        {
            "id": "h41cm4r",
            "score": 1,
            "text": "smoking weed everyday definitely may not be for everybody but personally, I smoke two or three times a day and a more productive and healthy minded throughout the day then I am if I don't. I've also always heading rather high tolerance for cannabis which I think is a part of why it doesn't hold me back in any way. but I know my fair share of people who are just lazy and unproductive after they smoke",
            "title_similarity": "0.8320868",
            "sentiment_compound": 0.8778
        },
        {
            "id": "h41d1wc",
            "score": 1,
            "text": "What was not healthy was the 15 pills i took daily prescribed by the VA. Was able to stop them all by smoking pot daily.",
            "title_similarity": "0.63395524",
            "sentiment_compound": -0.5358
        },
        {
            "id": "h41dhxe",
            "score": 1,
            "text": "I mean it really depends on the person for some people it can worsen their eating disorders due to the munchies for other it can worsen their anxiety due to the paranoia and for some it worsens their depression but if you have an eating disorder where you dont eat enough it can help and it can also be used as a over the counter anxiety and depression med for some people, another thing to think about is lung health weed smoke is MUCH better than cigarette smoke but it's still smoke and does weaken your lungs so if you genetically have a higher risk of lung disease you may want to smoke less and instead use oils or brownies, but it is very different from alcohol because it dosent directly completely destroy your stomach or liver or even your lungs it also isn't physically addictive and in terms of psychological addiction it's less addictive than high fructose corn syrup (common sugar substitute used in most sweets and fast foods)",
            "title_similarity": "0.7173058",
            "sentiment_compound": -0.9528
        },
        {
            "id": "h41dqkf",
            "score": 1,
            "text": "I mean it really depends on the person for some people it can worsen their eating disorders due to the munchies for other it can worsen their anxiety due to the paranoia and for some it worsens their depression but if you have an eating disorder where you dont eat enough it can help and it can also be used as a over the counter anxiety and depression med for some people, another thing to think about is lung health weed smoke is MUCH better than cigarette smoke but it's still smoke and does weaken your lungs so if you genetically have a higher risk of lung disease you may want to smoke less and instead use oils or brownies, but it is very different from alcohol because it dosent directly completely destroy your stomach or liver or even your lungs it also isn't physically addictive and in terms of psychological addiction it's less addictive than high fructose corn syrup (common sugar substitute used in most sweets and fast foods)",
            "title_similarity": "0.7173058",
            "sentiment_compound": -0.9528
        },
        {
            "id": "h41dsdh",
            "score": 1,
            "text": "Any type of smoking is bad for you and can negatively affect your heart; causing it to beat faster and also causing blood vessels to constrict.  Edibles would probably be a better choice for daily users.  Where cannabis becomes extremely unhealthy is when young adults chase that initial euphoria by smoking large quantities and fry their brains causing psychosis.",
            "title_similarity": "0.7715992",
            "sentiment_compound": 0.6378
        },
        {
            "id": "h41dsfn",
            "score": 3,
            "text": "In my opinion, I see it as the same as medicine for various mental/physical ailments, depending on how it’s done. But that is to say I don’t judge those who indulge in recreational smoking. In my case, I sometimes smoke a small pinch in the day to alleviate depression/increase mood and lack of hunger when I’m not working, or smoke a bigger pinch at night for insomnia and still hunger. I think it depends on the person, and if they can accomplish day to day life with it. But if you want documentation, [Drug Liberalization when it relates to Portugal](https://en.m.wikipedia.org/wiki/Drug_liberalization#Portugal) is proving that macrocosm wise it’s better off conjoining drugs with therapy until you’re better able to work yourself out of feeling like you need to self-medicate in the first place. You said your partner has BPD, ~~so think of it as a literal crutch for it.~~ EDIT: (depending on ‘how’ they smoke it, it could make a big difference, especially with BPD due to possible withdrawal symptoms, and other reasons I’m seeing. If it’s heavy smoking especially, that would [be considered unwise, and could impede therapy.](https://wayofleaf.com/cannabis/ailments/cannabis-and-borderline-personality-disorder). That’s a convo they should have with a therapist in the long run) I feel its better to go at the foundations when it comes to dealing with ones problems in my opinion, and if weed keeps someone relatively stable while those foundations are hopefully being demolished, than so be it. If they’re not doing those things though, that’s a different situation imo. And also of most recreational drugs, I feel it’s one of the tamer options out there, even if you don’t like the idea of smoke.",
            "title_similarity": "0.8220451",
            "sentiment_compound": 0.9753
        },
        {
            "id": "h41e218",
            "score": 2,
            "text": "I mean it really depends on the person for some people it can worsen their eating disorders due to the munchies for other it can worsen their anxiety due to the paranoia and for some it worsens their depression but if you have an eating disorder where you dont eat enough it can help and it can also be used as a over the counter anxiety and depression med for some people, another thing to think about is lung health weed smoke is MUCH better than cigarette smoke but it's still smoke and does weaken your lungs so if you genetically have a higher risk of lung disease you may want to smoke less and instead use oils or brownies, but it is very different from alcohol because it dosent directly completely destroy your stomach or liver or even your lungs it also isn't physically addictive and in terms of psychological addiction it's less addictive than high fructose corn syrup (common sugar substitute used in most sweets and fast foods)\nSo in conclusion I dont think smoking weed every warrants an intervention like drinking everyday would and if the person smoking isn't going broke over how much weed they are buying and says it helps then its prolly fine and if you are still worried have them switch to oils or edibles to cut out the smoke",
            "title_similarity": "0.7173058",
            "sentiment_compound": -0.8946
        },
        {
            "id": "h41ecfb",
            "score": 1,
            "text": "Depends on quantity, quality, strength and type. One good to high quality that is one of the weaker breeds a day isn't type",
            "title_similarity": "0.41292083",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h41edm4",
            "score": 1,
            "text": "Depends on quantity, quality, strength and type. One good to high quality that is one of the weaker breeds a day isn't bad",
            "title_similarity": "0.3941151",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h41ef7a",
            "score": 1,
            "text": "Depends on quantity, quality, strength and type. One good to high quality that is one of the weaker breeds a day isn't bad",
            "title_similarity": "0.3941151",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h41egjb",
            "score": 1,
            "text": "Depends on quantity, quality, strength and type. One good to high quality that is one of the weaker breeds a day isn't bad",
            "title_similarity": "0.3941151",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h41eieg",
            "score": 1,
            "text": "Depends on quantity, quality, strength and type. One good to high quality that is one of the weaker breeds a day isn't bad",
            "title_similarity": "0.3941151",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h41ekhv",
            "score": 3,
            "text": "Weed is one tool of many. I would never recommend someone to only take weed for their issue, I would also recommend they excersise, eat better, sleep regularly 6-8hrs, consult a doctor, talk to a therapist ect. All of the things you still need to do in order to do better at life and to feel better.\n\nThere definitely are some who romanticize and abuse weed, I think it's especially dangerous to young brains that haven't fully developed into who they are. Because weed does have consequences.\n\nI smoke daily and I've struggled with my relationship to weed, ive  been smoking for 7 years now. I've taken breaks, and I've thought deeply about quitting. But honestly I enjoy it, I am able to turn my mind off for a few hours instead of going crazy. I notice a huge difference between when I don't smoke and when I do.\n\nI think each situation needs to be addressed in its own way to see if there's any real benefit or if a break/quitting is nessisary",
            "title_similarity": "0.87936926",
            "sentiment_compound": 0.9377
        },
        {
            "id": "h41elhf",
            "score": 1,
            "text": "Weed is one tool of many. I would never recommend someone to only take weed for their issue, I would also recommend they excersise, eat better, sleep regularly 6-8hrs, consult a doctor, talk to a therapist ect. All of the things you still need to do in order to do better at life and to feel better.\n\nThere definitely are some who romanticize and abuse weed, I think it's especially dangerous to young brains that haven't fully developed into who they are. Because weed does have consequences.\n\nI smoke daily and I've struggled with my relationship to weed, ive  been smoking for 7 years now. I've taken breaks, and I've thought deeply about quitting. But honestly I enjoy it, I am able to turn my mind off for a few hours instead of going crazy. I notice a huge difference between when I don't smoke and when I do.\n\nI think each situation needs to be addressed in its own way to see if there's any real benefit or if a break/quitting is nessisary",
            "title_similarity": "0.87936926",
            "sentiment_compound": 0.9377
        },
        {
            "id": "h41evk0",
            "score": 1,
            "text": "It's technically not healthy to breathe in anything other than air - Including vaping, asthma inhalers, spiralised medicines, etc. So next time someone tries to tell you that smoking pure cannabis witjlut tobacco isn't bad for them, maybe remind them that they're still inhaling paper ash, which is carcinogenic.",
            "title_similarity": "0.797004",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h41fo6q",
            "score": 1,
            "text": "On the other hand though, never sleeping and having to force myself to choke down the tiniest bit of food without gagging isn't a healthy habit either. If I didn't have those issues I wouldn't be a regular weed smoker. That being said, the pros heavily outweigh the cons in my personal case. And I think that's how it should be looked at, a lot of people I know started smoking for similar reasons. I don't advocate for self medicating but I talked to my doctor, said it helped when I tried it, and she said if it works and I'm okay with the potential lung problems then so be it. I'm pretty active otherwise and try to keep myself in good shape contrary to the smoking weed",
            "title_similarity": "0.91067743",
            "sentiment_compound": 0.8664
        },
        {
            "id": "h41fxd9",
            "score": 1,
            "text": "NAH BRO I CAN QUIT ANYTIME I WANT TO",
            "title_similarity": "0.24857312",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h41g238",
            "score": 3,
            "text": "On the other hand though, never sleeping and having to force myself to choke down the tiniest bit of food without gagging isn't a healthy habit either. If I didn't have those issues I wouldn't be a regular weed smoker. That being said, the pros heavily outweigh the cons in my personal case. And a lot of people I know started smoking for similar reasons. I don't necessarily advocate for self medicating but I talked to my doctor, said it helped when I tried it, and she said if it works and I'm okay with the potential lung problems then so be it. I'm pretty active otherwise and try to keep myself in good shape contrary to the smoking weed and don't touch other drugs. I was 16 when I started smoking and struggled for about a year with eating issues and a couple years of severe insomnia from anxiety, I'm 19 now and overall smoking daily has shown more improvements than negative effects",
            "title_similarity": "0.9026766",
            "sentiment_compound": -0.2228
        },
        {
            "id": "h41gxna",
            "score": 1,
            "text": "smocking weed is never healthy, go vaporize or eat it.",
            "title_similarity": "0.6182817",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h41h1mm",
            "score": 1,
            "text": "You obviously don't smoke. I agree with you saying that if you use something a lot, you will begin to use it to void. However, your talking about cannabis, not coke. Cannabis won't make you forget your problems.  It will just make them less stressful",
            "title_similarity": "0.8062011",
            "sentiment_compound": -0.7312
        },
        {
            "id": "h41hc0r",
            "score": 1,
            "text": "My legs are in too much pain for me to talk properly without marijuana, and I'm allergic to the other medication alternative. It doesn't even get me high.\n\nAm I someone you would say shouldn't smoke weed daily?",
            "title_similarity": "0.828823",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h41hcxu",
            "score": 1,
            "text": "If you're arguing that you'd be healthier not smoking than smoking then obviously that's right.  \n\n\nBut if you're trying to make it sound like it's unhealthy to the point where one cannot sustain a productive, happy life, that's wrong. It it more life-friendly than drinking, and safe use primarily revolves around limited usage and ensuring usage doesn't get in the way of other aspects of life.",
            "title_similarity": "0.79417264",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h41hmo7",
            "score": 1,
            "text": "You might find this TED talk interesting, as it explains how the system in the body that responds to cannabis is a vital part of body and mind health.\nhttps://youtu.be/J42pmHV8ZEk\n\nBeing made to feel like you're doing something wrong by using cannabis can really effect your mental health, in itself. Especially if it's the only thing you find that helps with depression.\n\nMaybe your partner need to change the way or the type of cannabis they use, in order to avoid unwanted \"couch lock\".\n\nThere are many TED talks about it, from very well respected academics and doctors. Here's another;\nhttps://youtu.be/EBLmGBlEnMY",
            "title_similarity": "0.7685862",
            "sentiment_compound": 0.5956
        },
        {
            "id": "h41hnup",
            "score": 1,
            "text": "You might find this TED talk interesting, as it explains how the system in the body that responds to cannabis is a vital part of body and mind health.\nhttps://youtu.be/J42pmHV8ZEk\n\nBeing made to feel like you're doing something wrong by using cannabis can really effect your mental health, in itself. Especially if it's the only thing you find that helps with depression.\n\nMaybe your partner need to change the way or the type of cannabis they use, in order to avoid unwanted \"couch lock\".\n\nThere are many TED talks about it, from very well respected academics and doctors. Here's another;\nhttps://youtu.be/EBLmGBlEnMY",
            "title_similarity": "0.7685862",
            "sentiment_compound": 0.5956
        },
        {
            "id": "h41hvnb",
            "score": 1,
            "text": "How do you feel about zoloft for depression or ambien to sleep? I smoke (vape) every night before bed to simply shut my brain off and to stop thinking about random stuff that prevents me from sleeping. Not from stress, not from coping, for example, ill start writing entire movie scripts in my head at night, and weed lets my brain relax. I'd much rather do this than take an ambien and drive to random places in my sleep. \n\nIf you feel this way about mj, do you feel the same about any prescribed medications for mental health? If so, what's the difference?",
            "title_similarity": "0.80016625",
            "sentiment_compound": -0.573
        },
        {
            "id": "h41i1lo",
            "score": 1,
            "text": "I not only smoke every day, but many times per day. I have chronic illnesses and am 14 years clean from an opioid addiction. I smoke for pain relief and to stimulate my appetite. Without cannabis, I'd never get hungry and be back down to 100 pounds.",
            "title_similarity": "0.69816655",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h41i1ru",
            "score": 1,
            "text": "A good way i’ve seen it put is that weed makes you feel ok with being bored, and that’s nad for actually being productive with life, doing your hobbies and all that.",
            "title_similarity": "0.56061447",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h41i2hj",
            "score": 1,
            "text": "I not only smoke every day, but many times per day. I have chronic illnesses and am 14 years clean from an opioid addiction. I smoke for pain relief and to stimulate my appetite. Without cannabis, I'd never get hungry and be back down to 100 pounds.",
            "title_similarity": "0.69816655",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h41i3t4",
            "score": 1,
            "text": "I not only smoke every day, but many times per day. I have chronic illnesses and am 14 years clean from an opioid addiction. I smoke for pain relief and to stimulate my appetite. Without cannabis, I'd never get hungry and be back down to 100 pounds.",
            "title_similarity": "0.69816655",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h41ipgy",
            "score": 2,
            "text": "I smoke weed every day. Have been for many many years. \n\nI have a great job, beautiful and clean house, nice car, pay all the bills early and all that nonsense your top comment mentioned. \n\nI’m the first to say smoking marijuana daily is very unhealthy. It’s not good for the mind. It’s addictive, bad for your overall health and more. \n\nJust because you have your shit together doesn’t mean whatever your doing is right.",
            "title_similarity": "0.80653834",
            "sentiment_compound": -0.2498
        },
        {
            "id": "h41iskm",
            "score": 1,
            "text": "Yeah but it's cool 😎",
            "title_similarity": "-0.0039999243",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h41iszf",
            "score": 1,
            "text": "Well, I never asked to be born. But I was anyways, and life is ROUGH. There is nothing wrong with not being able to do it completely sober. And weed is natural. Using what nature gives us to make it through existence that we never asked for seems like a perfectly fine way to cope.",
            "title_similarity": "0.7098702",
            "sentiment_compound": 0.9606
        },
        {
            "id": "h41j2ff",
            "score": 1,
            "text": "I agree, weed and alcohol are the same. I drink everyday. Having a glass of wine with my diner is not abuse. Drinking everyday because of depression is. Going out on a weekend and having a few drinks is not abuse. Going out and getting shitfaced blackout drunk is. \n\nQuantity has little to do with abuse. I’m a smaller guy but can put a 6 pack away like nothing and be fine. Some people are toast after 2. \nI drink because I enjoy food and wine and pair accordingly. Others drink to get drunk.\n\nIn the end it’s all about how you respect it, and how it impacts your life and those around you. \nI’m not the biggest fan of people smoke everyday (I’m bias and know a lot of deadbeat stoners) but I acknowledge everyone is different. Some can smoke everyday and function 100%.",
            "title_similarity": "0.6822622",
            "sentiment_compound": 0.6294
        },
        {
            "id": "h41jf26",
            "score": 1,
            "text": "I think smoking/consuming marijuana everyday can be very beneficial for a lot of people.it helps combat depression, anxiety, insomnia, and even eating disorders. \n\nbut I also think moderation is key. it's not unhealthy to have a glas of wine everyday, or a little junk food everyday, but if you're getting blackout drunk or pigging out on McDonald's every night, you run into a problem. I think it should be the same with weed. if you have a little gummy thing or smoke a bit just for fun, that's no big deal. but if you're getting super high just to function everyday it might be time to stop.\n\nadditionally, people under 25 should really not make it a habit, as your brain is not gully developed up until that age. brain damage is not fun.\n\nand of course for medical reasons(ex. pain management, anxiety, depression, etc.) you should be consuming as much as your doctor tells you to, or as much as you're comfortable with. \n\nso no, I don't think its unhealthy to smoke weed everyday, under certain circumstances.",
            "title_similarity": "0.8156322",
            "sentiment_compound": -0.7374
        },
        {
            "id": "h41jpb8",
            "score": 1,
            "text": "Drinking too much coffee can be both a healthy and unhealthy habit. Spending hours on the internet a day can be either helpful or hurting (mindless scrolling/ video watching, compared to learning about something that enriches your life some way). Weed is kinda like these habits. Like most habits, it all depends on the context, purpose of use, management of use, and risk assessment. I suggest you both do research TOGETHER on a few of your top habits and find ways to balance what is helpful and what is hurting, then discuss together what level of those habits you want to stay within, where are your boundaries, where can you support one another? \n\nAlso,  as a child of recovering drug addicts and alcoholics, weed is NOTHING like daily alcohol use. NOTHING. drinking is so much worse for your body and brain.  Daily drinking is horrible for your liver, it makes you swollen and red all the time, and hard crashing points. Detoxing is terrible and  a painful process. If you smoke weed everyday you will have no major health concerns and if you suddenly stop smoking after a lot of daily use, you might just get a little cranky. I get worse symptoms when I miss a morning without my 1 small cup of coffee.",
            "title_similarity": "0.7219389",
            "sentiment_compound": -0.9611
        },
        {
            "id": "h41kb5f",
            "score": 1,
            "text": "I smoke just about every day, I'd say average 5.5x a week and imo its great in appropriate cases. For me, my brain wants to think about everything all the time so sometimes when I am stuck on a coding problem thats been giving me an issue, I smoke... chill out a little and come back to it and look at it again and normally figure it out or go with a different approach that I thought of while I'm thinking \"why was I even doing it this way in the beginning?\"\nGranted this isn't everyone but for me it works very well in moderation.",
            "title_similarity": "0.6540302",
            "sentiment_compound": 0.6694
        },
        {
            "id": "h41ldmd",
            "score": 1,
            "text": "I think it ultimately depends on the person. You're right that using any vice to cope with daily challenges isn't healthy. However, there are people who need it as a medicine. My partner was in an accident a few years ago and has been left with injuries and daily chronic pain. One of the only things that can even help him function is daily access to cannabis. On the other hand, you have someone like myself, who uses it in the way you've described and I definitely consider that abusing it. I think your perspective is just a bit narrow for how many different types of people and contexts that are out there.",
            "title_similarity": "0.85166955",
            "sentiment_compound": -0.0665
        },
        {
            "id": "h41lf8c",
            "score": 1,
            "text": "I mean it's a drug so it's obvious not healthy to consume daily but in contrast to Alkohol it's not a poison so it doesn't fuck your body nearly as much",
            "title_similarity": "0.77115786",
            "sentiment_compound": 0.8083
        },
        {
            "id": "h41lk60",
            "score": 1,
            "text": "I've never heard anyone with no mental health or physical health issues say smoking weed everyday is a healthy habit for them. It sounds like even your partner says it's \"okay\" not healthy. By prefacing your point with \"I'm going to get a lot of flack for this\" you're also trying to make yourself a victim before anyone even responds. I don't think this is conducive to finding helpful unformation. \n\nThat said, there is evidence that some groups overestimate the medicinal qualities of marijuana despite incomplete research findings: https://www.theguardian.com/society/2018/jul/23/cannabis-health-benefits-american-attitudes-study\n\nThe article also points out that legalized medical Marijuana has reduced prescriptions for schedule 3 opioids so if it's being used as an alternative to more harmful drugs than it is absolutely healthier, but maybe not healthy. The answer is not going to be it's healthy or unhealthy and you should accept the nuances and avoid black and white statements.",
            "title_similarity": "0.9037643",
            "sentiment_compound": -0.2883
        },
        {
            "id": "h41lsk9",
            "score": 2,
            "text": "What about lungs? That’s the thing I can’t get past. Inhaling smoke of any kind can’t be good for lungs. Edibles, though, I don’t think I would have a problem if someone had a trippy lil’ dessert every day.",
            "title_similarity": "0.7889919",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h41m8mw",
            "score": 2,
            "text": "Smoking anything everyday is not healthy. Smoking daily isn't for everyone and shouldn't be. It makes it very easy to fall into the trap OP described. It really helps some though. I have a medical condition that has wreaked havoc on my brain and body. It makes my day much less painful and cuts the anger I get from pain and meds. I worked in a dispensary for about 5 years and have watched this stuff change lives in both ways. We had some customers who received great great benefits because of it and it allowed them to live semi normal lives. Others just became lazy shut ins. It's different for everyone.",
            "title_similarity": "0.7564657",
            "sentiment_compound": -0.5596
        },
        {
            "id": "h41maeh",
            "score": 1,
            "text": "I'm a high functioning school teacher. My partner is a therapist. We smoke pot nightly to relax and it helps me sleep. I can go without it, no big deal but I won't sleep as well.",
            "title_similarity": "0.74489945",
            "sentiment_compound": 0.2437
        },
        {
            "id": "h41mbkx",
            "score": 1,
            "text": "I got right temporal lobe atrophy due to weed. It’s temporary but then, it’s a side effect alright. Haven’t touched it again and I used to stay high everyday before that. Weekends were literally entirely spent high.",
            "title_similarity": "0.71201974",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h41mzym",
            "score": 1,
            "text": "Both my girlfriend and I smoke weed every day. She smokes a bit more than I do but usually only before going to bed because it helps her sleep. I smoke less but usually start right after work. I've been smoking every day for 17 years, before that I had to take a break while I was in the military. Both my girlfriend and I hold good, steady jobs. We don't smoke weed to avoid our problems, I mean we aren't perfect but this is the healthiest relationship I've ever been in. For me, weed takes the edge off after a stressful work day. \n\nI started using marijuana to cope with major depression as a teenager. I had serious depression and tried to kill myself multiple times. I was hospitalized for depression/suicidal tendencies 6 times between the ages of 14-17. \n\nI'm not out curing cancer but i exercise regularly (always high), I contribute to charity, I have a network of friends and family that I care about and care about me. I now consider myself a happy person. If a little bit of weed (which is legal in my state) helps me feel good then the minor negative long term health effects are worth it.",
            "title_similarity": "0.76298404",
            "sentiment_compound": 0.6692
        },
        {
            "id": "h41n2rr",
            "score": 1,
            "text": "Yeah I’m with you. My husband and I used to smoke every day after dinner. Since it became legal in my state I have stopped because it just made me drowsy/foggy all the time. He is high every waking moment of his life. It’s gotten quite old talking to a stoned person every day who I can tell is slower than they are capable of due to it.",
            "title_similarity": "0.67443067",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h41n5wh",
            "score": 1,
            "text": "Yeah it can’t be good for your lungs.",
            "title_similarity": "0.29311645",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h41n6fd",
            "score": 1,
            "text": "Yeah it can’t be good for your lungs.",
            "title_similarity": "0.29311645",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h41n7uo",
            "score": 2,
            "text": "The world has many ideas of what it means to be \"normal,\" or baseline, or some standard of activity or habits or behaviors that mean you are in good shape. I see the brain as a constantly swirling vat of chemicals, controlling the even larger vat that is the rest of our bodies. \n\nDo we naturally produce THC? No. Do our brains have natural receptors for it? Sure. We have these for any drugs that actually stimulate us or cause an effect that otherwise wouldn't happen. My biggest counter-argument to the idea that \"smoking weed every day must indicate something bad\" is that some people may just prefer reality that way. Much like someone who \"needs\" to have coffee every morning, or someone who \"needs\" to go for their morning run before they can *really* start their day. \n\nWe choose what brain states we want to be in. The government attempts to regulate this in the realm of safety, like making drunk driving illegal, even though it's okay to get shit housed at home. \n\nSo, truly, I think most people have been conned. So what if Joe wants to get high every day? Joe isn't harming anyone, and any \"harm\" done to himself is a choice. That's the beauty of it. You can disagree with someone's choices, but I think marijuana has been scapegoated for YEARS to purport many different agendas, most of which revolve around marijuana users being less than, incompetent, or what capitalistic society would have you BELIEVE is the worst: unproductive. \n\nLastly, until Cheech and Chong get lung cancer or some other disease connected to their weed use, I'll wake and bake in peace. ✨",
            "title_similarity": "0.7531588",
            "sentiment_compound": -0.7789
        },
        {
            "id": "h41nnza",
            "score": 1,
            "text": "You’re exactly right op. The exact reason I stopped is because i realized it’s bad for you , it’ll give you lung cancer just like a cigarette will. It’s addicting and shouldn’t be used Dailey by anyone",
            "title_similarity": "0.768947",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h41nu8q",
            "score": 1,
            "text": "> because at some point you begin using it to cope with life's daily challenges\n\nThis is the point where you make an assumption that is false and your argument hinges on it. *Coping* in and of itself is not a negative behavior. On the contrary, it can be a positive. If I use weed to *successfully* navigate life’s daily challenges, then it’s the same as any other medication that helps people. I think there is overwhelming scientific evidence that marijuana can be used medically to cope with “life’s daily challenges”. That’s why medical use is legal in 36 states.\n\nThe fact that your spouse, who has a very specific medical condition that does not apply to the majority of the population, does not get the same benefit as many other do does not mean the substance or daily use of it is “unhealthy” for all people of all medical conditions.",
            "title_similarity": "0.77134436",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h41nxgf",
            "score": 1,
            "text": "This isn’t an argument that is right either way. It depends solely on the person that’s using it/why. It’s like any other thing in life.",
            "title_similarity": "0.49735677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h41nxzr",
            "score": 1,
            "text": "This isn’t an argument that is right either way. It depends solely on the person that’s using it/why. It’s like any other thing in life.",
            "title_similarity": "0.49735677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h41ogv8",
            "score": 1,
            "text": "Using cannabis to avoid things probably isn't the best use. But I would generally focus on preparing the partner to deal with issues rather than focusing on a cannabis habit, because one can do both. I don't think cannabis is even remotely like hard drugs or even alcohol, that you can use to truly avoid/cope/escape. I really do think it's just something that may make your partner feel a bit better about whatever troubles are present even though it seems like it's being used to avoid. Again, just focus on the problem. People can be stoned AND talk through things... not so much like being drunk or coked out and trying to talk through things, you know?\n\nI quit because I'm looking for a job but I do realize how I was probably overusing it during quarantine. I mean, it's great lol and I wish I could smoke. It helps me sleep. My problems started getting solved when I opened up (still smoking at that point).",
            "title_similarity": "0.8555807",
            "sentiment_compound": 0.8955
        },
        {
            "id": "h41opz7",
            "score": 1,
            "text": "Liquor and weed are no where close to the same when discussing daily use. You could smoke weed and not have many harmful things happen to your body vs alchohol that would lead to a physical addiction, to which could cause numerous health conditions, and even death.\n\nThe real issue is that anything without moderation can become unhealthy no matter the true physical affect.",
            "title_similarity": "0.8479327",
            "sentiment_compound": -0.7766
        },
        {
            "id": "h41ptt0",
            "score": 1,
            "text": "Nope, you’re %100 right but society ain’t gonna change.",
            "title_similarity": "0.38287407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h41pvoh",
            "score": 1,
            "text": "What is your view on daily caffeine intake?",
            "title_similarity": "0.35064608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h41pzmf",
            "score": 1,
            "text": "And where exactly did you get your medical degree @OP?",
            "title_similarity": "0.21344021",
            "sentiment_compound": 0.0
        },
        {
            "id": "h41qcbg",
            "score": 1,
            "text": "I agree with your view, but I'd like to modify it a bit. Weed, like any drug, should not be overused. However, you need to consume a very high amount of it for the substance itself to do serious damage to your body. The issue with *smoking* weed is mainly the particulates. Just like smoking tobacco, smoking weed releases burnt particulates into your lungs. These particulates coat your lungs, causing the mucous inside to become black and viscous. This leads, over a lifetime, to serious breathing complications and a much higher likelihood of lung cancer. Smoking weed is less likely to cause cancer than tobacco, but smoking literally anything actively damages your lungs. The only thing going through your lungs should be air. \n\nI wouldn't target cannabis itself in your argument, but rather the smoking aspect. People ususally smoke because it causes the effects to kick in quicker, and it is slightly easier to control how long the effects last. But that's not worth the damage the particulates do to your lungs. The reason most people disregard it is that because weed hasn't been legalized or common in most developed countries for very long (on the time scale of tobacco use, at least) there haven't been any long term studies on the effects, like with cigarettes. However, from the research that *has* been done, it's pretty clear that smoking weed, tobacco, or anything else is just terrible for your lungs and overall health.",
            "title_similarity": "0.77741265",
            "sentiment_compound": -0.6822
        },
        {
            "id": "h41qh07",
            "score": 1,
            "text": "When you smoke occasionally you get really high.  This can lead to anxiety.  If you smoke regularly you build a tolerance.  You'll never get as high as an occasional smoker but you also won't feel the anxiety.\n\nSource: I work on a farm",
            "title_similarity": "0.76244366",
            "sentiment_compound": 0.2563
        },
        {
            "id": "h41r28c",
            "score": 1,
            "text": "For me cbd weed is just something for my joints. It doesn’t get me high it makes my joints feel better though. \n\nAlso I know Advil or Aleve or other pain relievers exist. I’ve tried they don’t work. Pain creams work for 15 minutes and make me smell weird. It’s still undiagnosed because I am waiting to get into a rheumatologist.\n\nWeed isn’t bad if you work a high stress job cause it helps the mind to relax without making you feel nauseous like alcohol. Though both in moderation are not bad.",
            "title_similarity": "0.7971897",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h41r9wl",
            "score": 1,
            "text": "I agree with you OP. \n\nMy bf uses it daily and when he runs out he is irritable, grumpy, and depressed until I get him more.\n\nIt's a safer drug than most, and if used moderately there's no harm in it, but honestly I really do think people get addicted to it and let it take over their lives.",
            "title_similarity": "0.7590791",
            "sentiment_compound": 0.6712
        },
        {
            "id": "h41rjnn",
            "score": 1,
            "text": "For most people I think OPs belief is true, but he seems to fundamentally misunderstand cannabis and drugs in general based on his replies in this thread.\n\nThinking its identical to alcohol in this manner is woefully ignorant",
            "title_similarity": "0.75944626",
            "sentiment_compound": -0.8201
        },
        {
            "id": "h41rpad",
            "score": 1,
            "text": "Yeah it also can be bad for your lungs and cause premature aging, right?",
            "title_similarity": "0.53306556",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h41rzt7",
            "score": 1,
            "text": "Haha dude Reddit loves weed. You're not going to make ANY headway here suggesting any lifestyle with lots of healthy habits is better than weed every day. Good luck with that 🤣",
            "title_similarity": "0.7871035",
            "sentiment_compound": 0.9657
        },
        {
            "id": "h41sl2w",
            "score": 1,
            "text": "If we are talking strictly smoking as the consumption method then there is nothing to debate. Putting any smoke in your lungs isn't healthy",
            "title_similarity": "0.76248765",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h41sm9d",
            "score": 2,
            "text": "It really depends on the person, in my observation. \n\nI had an ex that was an all-day-every-day user, often even doing it before going to work in spite of the fact they could have drug tested and fired him. He had a lot of anger, anxiety, and insecurity issues that he refused to deal with in any other way except by numbing out with cannabis. It became one of the many points of contention in our breakup. At some point I told him I was not his therapist, and that if he continued to use cannabis every day, then I was no longer going to enable him with emotional labor, since he was running from his issues instead of dealing with them. At the time, I didn't use cannabis much. And yeah, that usage pattern is super unhealthy.\n\nNow, due to mental health issues exacerbated by the pandemic/protests and escalating chronic pain, I have become a daily user. I am seeking proper medical treatment, getting assessments for various conditions, and for the most part its actually keeping my anxiety down enough to do what I need to do. I tend to use it pretty late in the evening and not throughout the day unless I have a panic attack (pretty rare) or there's a special occasion. I wish I was comfortable using less frequently, and my actions come with that goal in mind, but right now while I get back on my feet it's keeping me sane.\n\nBut for any person who uses anything habitually, it comes down to their behavior and how their use impacts them and the people around them. Cannabis can be a drug of avoidance and abuse, it can also be amazing, life-saving medicine, or it can be a low-key way to enjoy your evening and unwind. All of that depends on the person using it.",
            "title_similarity": "0.8241337",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h41snsq",
            "score": 1,
            "text": "I think weed everyday is fine if it works for you. It's fine and accepted to rely on a substance, like coffee, everyday, and I see weed as similar. If it's getting in the way of your functioning or causing distress then it might be a problem, but that's possible with many daily indulgences (like video games, or exercise, or masturbation).\n\nSmoking it is really bad for the lungs and overall health, though. I wouldn't recommend doing that at all, honestly, and daily weed smokers will fight me on this but you are literally inhaling smoke. I would say get high through other means if possible. The problem isn't the weed itself, though.",
            "title_similarity": "0.8860363",
            "sentiment_compound": -0.8178
        },
        {
            "id": "h41suzc",
            "score": 1,
            "text": "Well smoking weed every day is not healthy, but neither is smoking cigarettes, drinking coffee or alcohol daily. Nor is consuming too much salt or sugar, which is often more detrimental physically (American food is hugely problematic in that regard from my knowledge).\n\nSmoking in general everyday isn't healthy no question there.\n\nHowever plenty of people have unhealthy habits and still live a good life and often long life. \n\nI have probably a mild sugar addiction, I drink almost only ice tea (green) (3.6g sugar per 100ml) but I barely/don't drink water however at least that way I drink enough which is already difficult for me, so preferably a slight sugar addiction then a lack of fluids and dehydration issues which make concentration deficient.\n\nI've also smoked weed daily, especially during covid when I had a lot of stress (studies that were only possible in the lab, family member passing away, someone close who was suicidal, some other stuff). It helped me sleep way more easily and took my mind off, in the end it was still better than many of the alternatives or heavy medication (which is also a drug). Some people use it as a coping mechanism and for some it works, others would be better off getting professional psychological guidance. However it entirely depends on the person and their personality, circumstances, etc.\n\nHowever the thing is that quitting weed is from my experience and knowledge way easier than the other things I mentioned, easier to quite than coffee (caffeine), cigarettes (nicotine), alcohol, and definitely sugar. If you have an addiction it's **MOSTLT** mental. The most difficult day when you when to take a break is the 2nd or 3rd generally, sometimes the 4th. After a week generally most physical issues should be completely gone. If you have the option go on a holiday for 7 to 14 days in a country were you can't easily get it, especially if you can relax and do fun things it shouldn't be an issue at all. Having it in house is a big temptation if you want a break.\n\nI've already several time taken breaks from 1 to 5 weeks, as a tolerance break because mine was and still is kinda stupidly high especially after the covid year.\n\nPoint is of course it's unhealthy but it might be the consequence of a bigger problem or a good coping mechanism for problems that might be trickier to deal with otherwise. However someone nagging you about it is generally not helpful at all. Also if someone tells me it's unhealthy than generally I don't care because they are more than 9/10 hypocrites, smokers, drinking more than 1 coffee every day, etc, etc, etc. Healthy or unhealthy is a complete package and more importantly someone needs to be happy and comfortable first.\n\nThe biggest negative impact specifically from THC that might take a few months to fully or almost fully restore is the reward system that sometimes uses the cannabinoid receptors in your brain, possibly reducing your motivation, but again person dependent. As it reduces the sensitivity and available receptors by them closing off, scientifically it's thought that they generally open again in adults (teenagers are a different story but research is lacking).\n\nhttps://www.nature.com/articles/mp201182\n\nThere's more research and now much more research being done now that it's more legal.",
            "title_similarity": "0.8171301",
            "sentiment_compound": 0.0317
        },
        {
            "id": "h41sygs",
            "score": 1,
            "text": "You better stop drinking coffee everyday too fucktard",
            "title_similarity": "0.6516824",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h41syud",
            "score": 1,
            "text": "Weed helped me with an eating disorder, chronic headaches, sleeping issues and a dependence on acetaminophen 10 years ago.\n\nIf it weren’t for weed, I would more than likely be dead right now due to starvation or a tylenol/painpill overdose.",
            "title_similarity": "0.6774853",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h41t03t",
            "score": 1,
            "text": "So many people here missing the point OP is trying to make.\n\nObviously if you’re using it medically then it is a risk/reward kind of situation that (hopefully) favors consuming weed in whatever way that person chooses.\n\nIf you’re healthy and you’re smoking weed every day recreationally, then yes biologically you are putting yourself at a greater risk of lung cancer. Smoking anything a lot will increase this risk.\n\nYour choices and their morality/practicality are not being debated here. It is whether or not it is an unhealthy habit.\n\nThis is the point that should be refuted. Not some imagined personal attack on your own choices.",
            "title_similarity": "0.87986934",
            "sentiment_compound": -0.5683
        },
        {
            "id": "h41t4g2",
            "score": 1,
            "text": "you're inhaling smoke into your lungs. of course it's not healthy. \nthe question is whether or not the pros of using the drug outweigh the cons, and at what cost. I'm sure over the next few years we will be able to see more detailed literature on the effects cannabis smoke has on the body! :)",
            "title_similarity": "0.7621417",
            "sentiment_compound": 0.5162
        },
        {
            "id": "h41th0f",
            "score": 1,
            "text": "Neither is taking Zoloft or Prozac but imma smoke errday because it’s 100% helps my depression, OCD, ADHD. I’m 43. I’ve been smoking almost everyday since I was 16. I’m a fully functioning member of society. I run a business with my wife. And I’m at peace with myself.",
            "title_similarity": "0.6473812",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h41th34",
            "score": 1,
            "text": "I had a previous partner whose entire personality was the fact that she smoked weed daily. Dead end job, no motivation to advance, typical burnout.\n\n$50 left in her checking account when rent is due? Weed is more important.\n\nOn the other hand, fast forward 10 years, my fiancé and I smoke regularly together in social settings, have careers, do well financially, we are both motivated, and it works great.\n\nI think it’s unique to each circumstance.",
            "title_similarity": "0.6893346",
            "sentiment_compound": 0.7996
        },
        {
            "id": "h41tj69",
            "score": 1,
            "text": "Smoking wee is bad if you’re inherently lazy to begin with but if you’re a productive person normally and disciplined those people usually are fine even if they smoke every day.",
            "title_similarity": "0.77217233",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h41to0o",
            "score": 1,
            "text": "Taking SSRIs every days is not a healthy habit, being stressed and anxious every day is not a healthy habit",
            "title_similarity": "0.6708611",
            "sentiment_compound": -0.7855
        },
        {
            "id": "h41u2l0",
            "score": 1,
            "text": "I've always been a very moderate person about drugs and alcohol because of people in my extended family. I don't even like drinking coffee or alcohol two days in a row because of this same logic. It would be so easy to, but then I'd be locked in. That being said, I'm open to trying weed; I just tried cigarettes and it wasn't for me.",
            "title_similarity": "0.84695005",
            "sentiment_compound": 0.2061
        },
        {
            "id": "h41ueem",
            "score": 1,
            "text": "When you smoke occasionally you get really high.  This can lead to anxiety.  If you smoke regularly you build a tolerance.  You'll never get as high as an occasional smoker but you also won't feel the anxiety.\n\nSource: I work on a farm",
            "title_similarity": "0.76244366",
            "sentiment_compound": 0.2563
        },
        {
            "id": "h41uh87",
            "score": 1,
            "text": "Smoking it? Sure unhealthy. Vaping it daily, no problem, very healthy.\n\nIts as if I said “people who shoot up antidepressants everyday is not a healthy lifestyle.”\n\nBut if instead of liquefying the antidepressants they would just drink it as directed by a doctor, then they would be in fact healthier than if they did not.",
            "title_similarity": "0.8175272",
            "sentiment_compound": -0.0653
        },
        {
            "id": "h41uqlu",
            "score": 1,
            "text": "Weed is cheaper than wellbutrin when you don't have insurance",
            "title_similarity": "0.59109056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h41uwta",
            "score": 1,
            "text": "I smoke weed pretty regularly, still manage to be productive. Most people I work with do so too (brewing industry). I've met people like your SO before. I think the laziness and excuse making came before the weed problem. In other words smoking is a symptom, not a cause. Everyone's got vices, and vices always carry the potential for abuse.",
            "title_similarity": "0.7567687",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h41v77n",
            "score": 1,
            "text": "You can have an unhealthy addiction to anything, even if it’s not addictive. Anything can be unhealthy, even over the counter medications when taken wrong.\n\nWhat I do understand here is that you seem kind of annoyed with how it’s treated like cigarettes used to be: “This is fun and there’s no downsides to it!”\n\nThere can be just like any other drug. Keyword is can, not that it IS. I know people who smoke everyday and they’re just fine and people who literally can’t eat or sleep without smoking first. Just depends",
            "title_similarity": "0.82278794",
            "sentiment_compound": -0.7339
        },
        {
            "id": "h41v7ww",
            "score": 1,
            "text": "You can have an unhealthy addiction to anything, even if it’s not addictive. Anything can be unhealthy, even over the counter medications when taken wrong.\n\nWhat I do understand here is that you seem kind of annoyed with how it’s treated like cigarettes used to be: “This is fun and there’s no downsides to it!”\n\nThere can be just like any other drug. Keyword is can, not that it IS. I know people who smoke everyday and they’re just fine and people who literally can’t eat or sleep without smoking first. Just depends",
            "title_similarity": "0.82278794",
            "sentiment_compound": -0.7339
        },
        {
            "id": "h41v88y",
            "score": 1,
            "text": "If you don’t like someone smoking weed everyday don’t let them fuck you. \n\nGo fuck someone else who doesn’t drink or smoke and then you’ll have to find something else to blame.",
            "title_similarity": "0.8677355",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h41vcvm",
            "score": 1,
            "text": "Alcohol is a poison and too much can actually kill you cannabis isn’t like that at all.",
            "title_similarity": "0.6414476",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h41veo5",
            "score": 1,
            "text": "I agree with OP but not for their reasons. I think that weed should be smoked infrequently because of how it mutes a person’s personality when they frequently smoke it. I’m not saying people who smoke are boring or that they aren’t good people but if you’re around someone who smokes a lot it’s hard to have a serious conversation or sometimes it’s just plain boring because they’re having a happy trip and you’re listening to the same song or watching a simple movie and they’re figuring out life’s wonders. I’ve been around many people that smoked and I had a great time I just think that smoking shouldn’t be your personality and if you’re around other people and smoking that they should either be high or you should be able to be more functional for your sober friends. \nAlso smoking less makes the few times you do smoke feel better (after the coughing goes away lol)",
            "title_similarity": "0.8848909",
            "sentiment_compound": 0.9721
        },
        {
            "id": "h41vfxd",
            "score": 1,
            "text": "\\>instead of learning to face your issues\n\nAh, yes, all issues can be fixed by \"facing\" them. Come on, tell a criple to \"face\" his disabilities, instead of \"coping\". Or tell it to a Soviet/Yugoslav/German/British patriot, who had his Motherland destroyed, his people genocided, and his history covered in dirt.",
            "title_similarity": "0.5696768",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h41vnj4",
            "score": 1,
            "text": "I don't feel comfortable convincing someone it is healthy to do drugs **literally every day, for the health benefits**.\n\nThis is a beyond ridiculous CMV. It's objectively not okay to do drugs everyday, if not prescribed by a medical professional.\n\nI know this comment is against the sub's rules. But this is straight up, an unhealthy conversation to have.",
            "title_similarity": "0.8801899",
            "sentiment_compound": -0.6325
        },
        {
            "id": "h41vogv",
            "score": 1,
            "text": "I smoked weed daily and I guarantee that after having quit for about 3 weeks now that alcohol is far worse and I don't even drink daily just like 2 drinks socially so about once or twice a week. \n\nOnly reason I stopped is because I'm market for a new job and some fuckers drug test for weed as well.\n\nMy behavior does not change much whether I'm smoking regularly smoking or not at all.\n\nI definitely thought it would be unhealthy to do it everyday, but now that I'm not smoking nothings change in my life.",
            "title_similarity": "0.8505313",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h41vqaj",
            "score": 1,
            "text": "Smoking anything daily is not healthy, but I found the positive aspects of marijuana use worth the trade off of lower lung capacity. I was daily smoker for many years; dealing with anxiety and depression as well as constant physical pain from a shoulder reconstruction surgery many years ago without the help of any sort of support system as I couldn't afford health insurance or any prescription drugs, let alone to talk to a doctor. Cannabis was this super cheap alternative that kept me going through the most rough, darkest part of my life in my early to mid twenties. I did eventually get to a point this point in my life where I rarely use it and only for a little bit of fun, but I do believe that without it I would have found a much worse coping mechanism, such as alcohol or I might have ended my own life.",
            "title_similarity": "0.81666994",
            "sentiment_compound": -0.6938
        },
        {
            "id": "h41w09o",
            "score": 1,
            "text": "Smoking anything every day is not healthy. Taking it in a form that doesn't damage your lungs is a different story. I agree with you, though. Pretty much any mind altering substance used daily can result in issues, but it also depends on the person.\n\nMy husband uses it daily and he is successful and happy. An ex of mine also used it everyday and all he did was get high, play video games, and do nothing with his life. It really depends on the individual.",
            "title_similarity": "0.85518813",
            "sentiment_compound": 0.9544
        },
        {
            "id": "h41w3e0",
            "score": 1,
            "text": "fucking foot doctor...",
            "title_similarity": "0.19892229",
            "sentiment_compound": 0.0
        },
        {
            "id": "h41wbpp",
            "score": 1,
            "text": "Telling people what to do is a less healthy one",
            "title_similarity": "0.44422114",
            "sentiment_compound": 0.3415
        },
        {
            "id": "h41wlqz",
            "score": 1,
            "text": "It depends on the person, i know for a fact my weed smoking habits are unhealthy but I've been smoking daily for like 7-8 years now and it feels really hard to stop.\n\nI don't think there's a cut and dry answer to this. I think everyone should know their limits and at the end of the day if it isn't hindering you in doing what you want than is it really that bad?",
            "title_similarity": "0.88030976",
            "sentiment_compound": -0.8898
        },
        {
            "id": "h41wnaq",
            "score": 1,
            "text": "i used to smoke daily for a long time but stopped almost a year ago. it sounds like you’re relating this to your partners mental health and i have done a lot better kn that respect since quitting. nobody should have a dependency on anything. have you asked him to stop for a month or two to see how he feels?",
            "title_similarity": "0.7342025",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h41wqdt",
            "score": 1,
            "text": "Smoking it? Why would I be smoking it? Just eat it. No damage to lungs.",
            "title_similarity": "0.543102",
            "sentiment_compound": 0.4567
        },
        {
            "id": "h41wqzj",
            "score": 1,
            "text": "Smoking it? Why would I be smoking it? Just eat it. No damage to lungs. got",
            "title_similarity": "0.5397042",
            "sentiment_compound": 0.4567
        },
        {
            "id": "h41wr41",
            "score": 1,
            "text": "Smoking it? Why would I be smoking it? Just eat it. No damage to lungs.",
            "title_similarity": "0.543102",
            "sentiment_compound": 0.4567
        },
        {
            "id": "h41x75i",
            "score": 1,
            "text": "It really depends on the person though tbh. I vape cannabis everyday (Dry Herb Vape) for severe back pain from an injury that never healed correctly. When I have weed, I do partake in it daily, and get my shit done to no ill effect. I also grow my own, so when I'm out, I just wait until my next harvest. Aside from wanting to be high for the first 2 days, I feel no physical downsides (aside from my pre-existing back pain being more noticeable).\n\nI highly advocate vaping over smoking. Of course, anything that's not air isn't exactly the best thing to put in your lungs, but many people don't understand the reason why vaping is healthier than smoking is because smoking (combustion) releases not only the compounds you DONT want in your body, but also every other byproduct that results from setting plant matter on fire. The bad things you don't want in your body are known as carcinogens, and they are, to varying degrees, present in any type of smoke, no matter what you are burning.\n\nVaporization is, thus far, the best (inhalation) method for limiting extraction to mostly only the compounds you want in your body.\n\nNo one has \"died from smoking weed\", but that doesn't change the fact that inhaling smoke is not good for your lungs.",
            "title_similarity": "0.8339498",
            "sentiment_compound": -0.97
        },
        {
            "id": "h41x7c1",
            "score": 1,
            "text": "Everyone has their addiction, whether it’s that cup of coffee in the morning or smoking a bowl.\n\nObviously too much of anything is bad, but we can’t really point at marijuana as something stunting your partner. Of course it’s bad to smoke anything. It damages your lungs whether it’s weed or cigarettes.\n\nBut the question here is whether they want to smoke weed or not. If they do, then you can’t do much to stop it, and accepting your partner is more important than trying to ‘fix’ them. If they agree that it’s really unhealthy and they want to stop, then you can help out as support.\n\nI was in a relationship where my S.O. would constantly assure me that it was fine that I smoked, and it didn’t bother them. At the same time, I could feel their discomfort and blatant disgust after I would smoke. Needless to say, I didn’t feel very comfortable or accepted and that relationship ended because they weren’t honest about how they felt.\n\nIf weed is a deal breaker for you, break up with them. If it’s not, then just accept them. If you’ve voiced your concern, they will do what they will with that and you shouldn’t push it more.\n\n(Your view that smoking every day is unhealthy is correct. Using it to justify changing your partner or wanting them to change their habit is where you’re wrong. I can tell you that caffeine is bad for you, and I would be right, but you’re still going to have that morning coffee.)",
            "title_similarity": "0.9074873",
            "sentiment_compound": -0.9512
        },
        {
            "id": "h41xfi1",
            "score": 1,
            "text": "So you believe this because of your significant other correct? \n\nCool, if not Lebron James and the other NBA players that smoke weed, Snoop dog and all the other successful rappers and celebrities, the people on this forum, then I myself will also give you a burst of reality.\n\nI who raised myself since I was 12, Gifted Honors Duo enrollment,I fought homelessness from 16-18 when I graduated , and at 19 I started smoking weed. At 20 i began teaching myself about stocks and option trading .\n\nDidnt have a family and lost my scholarships because of fighting off homelessness, I like many others struggled but maintained a job, paid bills and got by. \n\nFast forward to covid stuff and I'm suicidal from loss of employment and the ever so feeling of being \"stuck\" while watching my friends do everything I shouldve done if i had the real support system to help me get through what I went through. The fact they had a family , they had birthdays, they had christmas and vacations. I had nothing but grind . \n\nAt 25, the one thing I can honestly say that helped me stay focus was weed. \n\nSo here I am,  watching the stock market crash and thinking, I can buy this cheap and sell when it comes back up . A few trades here and there and low and fuckjng behold. \n\nI turned 2k, into 150k. \nChanged my whole life from this one single year, with this money I'm using it to go and study Mechanical engineering like I wanted to before and currently I'm holding a good 700 shares of GME so let's just say I could be a millionaire or billionaire real soon. \n\nThe point of the story was to remind you that not everyone is the same and you judging people for what they do makes you a hypocrite because lord knows you arent perfect .\n\nIf your significant other is giving you problems leave, all you, but to blame it on weed is stupid as fuck. Maybe your significant other is stupid as fuck , ever think of that? Go do better.",
            "title_similarity": "0.74861634",
            "sentiment_compound": -0.9139
        },
        {
            "id": "h41xgn4",
            "score": 1,
            "text": "So you believe this because of your significant other correct? \n\nCool, if not Lebron James and the other NBA players that smoke weed, Snoop dog and all the other successful rappers and celebrities, the people on this forum, then I myself will also give you a burst of reality.\n\nI who raised myself since I was 12, Gifted Honors Duo enrollment,I fought homelessness from 16-18 when I graduated , and at 19 I started smoking weed. At 20 i began teaching myself about stocks and option trading .\n\nDidnt have a family and lost my scholarships because of fighting off homelessness, I like many others struggled but maintained a job, paid bills and got by. \n\nFast forward to covid stuff and I'm suicidal from loss of employment and the ever so feeling of being \"stuck\" while watching my friends do everything I shouldve done if i had the real support system to help me get through what I went through. The fact they had a family , they had birthdays, they had christmas and vacations. I had nothing but grind . \n\nAt 25, the one thing I can honestly say that helped me stay focus was weed. \n\nSo here I am,  watching the stock market crash and thinking, I can buy this cheap and sell when it comes back up . A few trades here and there and low and fuckjng behold. \n\nI turned 2k, into 150k. \nChanged my whole life from this one single year, with this money I'm using it to go and study Mechanical engineering like I wanted to before and currently I'm holding a good 700 shares of GME so let's just say I could be a millionaire or billionaire real soon. \n\nThe point of the story was to remind you that not everyone is the same and you judging people for what they do makes you a hypocrite because lord knows you arent perfect .\n\nIf your significant other is giving you problems leave, all you, but to blame it on weed is stupid as fuck. Maybe your significant other is stupid as fuck , ever think of that? Go do better.",
            "title_similarity": "0.74861634",
            "sentiment_compound": -0.9139
        },
        {
            "id": "h41yacb",
            "score": 1,
            "text": "You sound like a difficult spouse",
            "title_similarity": "0.30058917",
            "sentiment_compound": 0.0
        },
        {
            "id": "h41ynt3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h41yq8h",
            "score": 1,
            "text": "Life is full of recreation time that we get to enjoy any way we please. If someone wants to watch TV for one hour compared to smoking weed and being high for an hour doing whatever idk it just seems kind of judgy since neither of those things are inheritantly \"healthy\"\n\nLife is about balance. If smoking weed is causing issues in a person's life, then sure it's bad. If it isn't, then power to em.",
            "title_similarity": "0.7918389",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h41z1rl",
            "score": 1,
            "text": "The way I see it, is we all just sort of popped up on this Earth for no other reason than to live and then die. The mere act of living is contributing to your inevitable death. Literally none of this matters. If I died today, my friends would still have their wedding in October, my mom would still go to her doctors appointment next week. \n\nMy point is that drugs get us through this life a lot easier than without. And by drugs I mean all of them. Caffeine, nicotine, alcohol, THC, etc. If you aren’t hurting anyone else and you are enjoying this life than so be it.",
            "title_similarity": "0.7002866",
            "sentiment_compound": -0.783
        },
        {
            "id": "h41z7m7",
            "score": 1,
            "text": "Hey, I know the point of this sub is to change your view, but I’ve come with advice of a different kind.\n\nYour opinion on weed sounds very similar to mine. I also once tried my very best to love and support a person with a lot of issues, mental and substance.\n\nYou need to sit down and seriously consider if your relationship is something you can live every day for the future. I only say this because I personally could not. There is no prize for being in a relationship that hurts you. I learned this a very hard way. Just something to think about\n\nI don’t honestly think the weed smoking is the issue here",
            "title_similarity": "0.83905756",
            "sentiment_compound": 0.9501
        },
        {
            "id": "h41zj1l",
            "score": 1,
            "text": "Maybe your partner smokes because they hate their life, hate their partner and need to be numb to the world to deal with it. \n\nYikes.",
            "title_similarity": "0.6807432",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h41zq4r",
            "score": 1,
            "text": "Ok",
            "title_similarity": "-0.21193342",
            "sentiment_compound": 0.296
        },
        {
            "id": "h41zytg",
            "score": 1,
            "text": "Look how our ancestors used it. It seems like they would use it more for therapy than to get high.\n\nIf you see it as a pep in your step, and not “let me smoke all day”, then I believe you can have a health relationship with weed. I don’t do drugs, but some times I understand why someone needs to smoke/drink to relax their tension from the daily stress",
            "title_similarity": "0.86606646",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h4208mb",
            "score": 1,
            "text": "Cant change your mind... I feel with the acceptance and legality of weed it will draw people away from alcohol to another form of addiction. Im not against alcohol but it has its problems when overused and I think weed will as well.",
            "title_similarity": "0.79963005",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h420qju",
            "score": 1,
            "text": "I smoked weed for 10 years straight all day every day. Quit this year and my quality of life, social and personal confidence massively improved. I don’t get all weird around people and eye contact isn’t super intense. Anxiety and depression are gone.\n\nIt’s not for everybody. Nothing is. There is no biological free lunch. No substance is consequence free if you abuse it.\n\nI still dabble on occasion but it isn’t the same as when I was younger.",
            "title_similarity": "0.74742556",
            "sentiment_compound": -0.0775
        },
        {
            "id": "h420xl5",
            "score": 1,
            "text": "I once hated weed. I figured it was a “gateway drug” like DARE taught me. \n\nBut then I tried it, and most of my anxiety and depression melted away. \n\nNow I smoke daily, not all day (as I agree too much of ANYTHING is a bad thing) but daily to me is not “too much” just like eating daily isnt too much, but eating all day every day is too much. \n\nJust like having sex everyday isn’t too much, having sex all day every day, is too much. \n\nJust like cleaning every day isn’t too much, but cleaning all day every day is too much. \n\nMaybe daily is too much for you, but for a lot of us, a nightly smoke is what keeps us mentally healthy.",
            "title_similarity": "0.8545569",
            "sentiment_compound": 0.3516
        },
        {
            "id": "h420z5i",
            "score": 1,
            "text": "Who would ever claim that it's healthy? Is it healthy to eat suger every day? All people saying is that's it should be legalized and that prohibition does way more damage to society than legal use including negative side effect like addiction.",
            "title_similarity": "0.7462476",
            "sentiment_compound": 0.1449
        },
        {
            "id": "h4214bo",
            "score": 1,
            "text": "Just like with any mind-altering substance, it depends on the individual person's psychological makeup. There are definitely people who, because of trauma, mental illness, or some other underlying factor, can experience negative effects from prolonged cannabis use.\n\nThen there are people for whom it offers positive outcomes: improved brain function, creativity, stress relief, etc. It's up to the individual to be responsible with it and to know their limits. If they are incapable of this or are clearly in denial, then perhaps it's time for an intervention. \n\nUltimately, it's like any other vice. If you can partake in it responsibly without causing detriment to your life, have at it. If not, maybe it's best you leave it alone.",
            "title_similarity": "0.69297063",
            "sentiment_compound": 0.6036
        },
        {
            "id": "h4215wl",
            "score": 1,
            "text": "Why do we have feelings .",
            "title_similarity": "0.07073043",
            "sentiment_compound": 0.0
        },
        {
            "id": "h421f83",
            "score": 1,
            "text": "I think it varies by the person. I don’t do it daily but at least 5x a week. It helped me focus, minimizes my back pain/issues and allows me to think thoughtful and clearly. I started to research different terpenes and the “affect” they have and started using them accordingly. \n\nHowever, my brother who smokes becomes more or less useless. He becomes super lazy, can’t think critically, and essentially amounts to a blob stuck to his chair. This happens no matter the strain for the most part. Some high stavia’s will actually perk him up.\n\nI have a law degree, BA in computer Information systems and am part of the C-suite for a multimillion dollar international tech company.",
            "title_similarity": "0.72738194",
            "sentiment_compound": 0.5397
        },
        {
            "id": "h422d7u",
            "score": 1,
            "text": "Anytime u inhale smoke, carcinogens from the burning, it's bad.    It's an unfiltered cigarette.\nIt's not the weed itself, perse...on the other hand the need to get high daily sounds like a problem.\nSounds like avoidance.",
            "title_similarity": "0.82305944",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h422i0b",
            "score": 1,
            "text": "There’s a difference between ‘healthy’ and ‘okay’\n\nIt’s definitely not healthy, but we’re all entitled to a few vices. Is it okay? Depends on the situation.",
            "title_similarity": "0.6122078",
            "sentiment_compound": 0.6394
        },
        {
            "id": "h422mlx",
            "score": 1,
            "text": "Neighbor starts hitting bond at 8am on back porch every day. Out there 5x a day. I don’t know if it’s feasible it’s medical?",
            "title_similarity": "0.41377747",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4239ys",
            "score": 1,
            "text": "Only bad thing about smoking weed everyday is your tolerance grows but if you don’t abuse the plant I don’t mind smoking 1-2 times a day but I go on tolerance breaks when I run out as a recreational user. I even go on short tolerance breaks like 3-5 days when a album is going to drop that I’m anticipating for so I can get stupid high",
            "title_similarity": "0.81472707",
            "sentiment_compound": -0.7814
        },
        {
            "id": "h423cq9",
            "score": 1,
            "text": "I don't have a study to link or anything, but this one is pretty simple to follow.\n\nSmoke is caused by combustion.\n\nThe combustion of any plant material releases carcinogens.\n\nInhaling carcinogens causes cancer.\n\nJust because weed doesn't have a million and one chemicals added to make it worse like a cigarette doesn't mean it doesn't still have the potential to give you cancer.",
            "title_similarity": "0.75721425",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h423dbf",
            "score": 2,
            "text": "*My partner believes smoking weed everyday is okay but I think marijuana and alcohol are similar in that, you shouldn't over use any substance,*\n\nI agree, but I'd argue that smoking one joint a day isn't \"over use\", any more than a glass of wine a day is over use.",
            "title_similarity": "0.85505545",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h423dty",
            "score": 1,
            "text": "This not a yes or no question with the details you’ve given. Smoking everyday is not universally healthy or unhealthy for all people. Why do they smoke? Does it affect their work, social life, relationship (outside of the fact that you don’t like it), health. I and many others have smoked daily for portions of life while also being healthy and successful both professionally and personally so it’s very possible but just depends on the person.",
            "title_similarity": "0.8524109",
            "sentiment_compound": -0.015
        },
        {
            "id": "h423gks",
            "score": 1,
            "text": "I know you can’t get addicted to the substance but I know many people who heavily rely on it to feel okay. I think everything in moderation is okay but it can definitely be very excessive in some cases",
            "title_similarity": "0.746454",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h423hai",
            "score": 1,
            "text": "I know you can’t get addicted to the substance but I know many people who heavily rely on it to feel okay. I think everything in moderation is okay but it can definitely be very excessive in some cases",
            "title_similarity": "0.746454",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h423hn2",
            "score": 1,
            "text": "This changed the way I see my ex. I couldn’t stand his marijuana use because I thought it was the reason he was abusive and lazy and had no job or ambition. And I always thought if he stopped smoking he would stop being those things. But this made me realise those things are who he is; cannabis use or no cannabis use. He’s the problem not the drug.",
            "title_similarity": "0.8500445",
            "sentiment_compound": -0.9072
        },
        {
            "id": "h4241my",
            "score": 1,
            "text": "You should have cited all the research addiction therapists show their patients when advising quitting weed. Such as it ability to cause depression and anxiety by depleting brain chemicals. There is enough info out there for you to win your argument every time. \n\nI smoked weed every day for 4 years and it made it so that Iost touch with what I enjoyed in life and who I was. It made me too anxious to go out in public and caused behaviour that was unhealthy. I could not eat food unless I smoked or else I would vomit. If i took a day off I would have intense withdrawal, crying, and body convulsions.",
            "title_similarity": "0.79622203",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h4243sx",
            "score": 1,
            "text": "Given I was a daily smoker for nearly 6 years, I agree. I worked a full time job, I paid my bills, I dealt with my responsibilities head on. Unfortunately, it did deplete my ambition to do bigger and better things. Whatever money I had left I spent on weed. \nI have been sober from marijuana for 12 years and I can say that since quitting, my ambition allowed me to go to college and start a family and be less selfish with where my money went.\n\nClearly, everybody has their own vision on what marijuana does for them (relax, pain management, etc.) but, personally, I know that it held me back.",
            "title_similarity": "0.70235735",
            "sentiment_compound": 0.3064
        },
        {
            "id": "h42480p",
            "score": 1,
            "text": "I’m with the other guy who talked about being so productive.  I smoke a small bowl before I shower in the morning and can’t wait to get home from to smoke another one BUT I have a great job, great benefits, and highly respected for the work I do. Some colleagues know what I do but always hit me up for hiking trails, mtn trails, best sunset views, and overall just productive life style that I love. Keeps me in shape and healthy but man nothing like a bowl after work to keep the day going!",
            "title_similarity": "0.7254572",
            "sentiment_compound": 0.9891
        },
        {
            "id": "h424n0k",
            "score": 1,
            "text": "Smoking weed everyday isn’t any worse then smoking cigarettes everyday.",
            "title_similarity": "0.6953198",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h4252cp",
            "score": 1,
            "text": "I use everyday a lot! For medical reasons mental. I have no negative effects I am also a runner. I just ran a marathon 2 weeks ago. I eat healthy, don’t drink, don’t use tobacco, don’t drink caffeine. last doctor check up I get them a lot. Was all good perfect health. I have had lung X-rays ect for reason not related to cannabis. Lungs are great. I would say the down side is finding what fits you. Strains ect. One negative I personally get is I can become very out of it if I use to much. I eat around 50-75 mg at a time or if I smoke around .75 to a gram each joint. Or dabs.\n\nWith all that said. I have also seen people who it’s just not meant for. I am no doctor so I don’t know why but mentally if messes with them a lot. \nSo I wouldn’t say it’s unhealthy, but I would say it is not compatible with everyone’s genetic makeup. I think you may have some negative stigma against it. Also it may not be a good match for your SO. Maybe ask others around him as well their opinion.",
            "title_similarity": "0.65310395",
            "sentiment_compound": -0.8048
        },
        {
            "id": "h42569n",
            "score": 1,
            "text": "I think it varies from person to person and also the weed you smoke. I smoked weed for 12 years every day and was reliant on it, I gave up last July because in the last couple if years I started to get really anxious, depressed and paranoid when I did and didn't smoke it and got sick of it, after a year of not smoking I'm much happier, a lot less anxious,  I can go out in public and have conversations with people and am a lot more confident in myself both in work and in my personal life. on the flip side I know people who have smoked it for just as long as I did and longer and didn't have those issues. It depends on the weed to and how often you smoke it because I found that when I went to Amsterdam the first bit of weed I bought was a strain that was really high in THC, I smoked a joint and started feeling really anxious and paranoid and after that only bought strains that were high in CBD with lower THC and felt much better, the problem with buying weed here (in the UK) is you never really know what the THC content is and people breed plants to have higher and higher amounts of THC as time goes on, if you smoke really high levels of THC every day - over time It causes mental health issues.",
            "title_similarity": "0.77134347",
            "sentiment_compound": -0.8733
        },
        {
            "id": "h4257xs",
            "score": 1,
            "text": "Cannabinoid Hyperemesis Syndrom https://youtu.be/_ZJgWww-sqI",
            "title_similarity": "0.30037248",
            "sentiment_compound": 0.0
        },
        {
            "id": "h42591m",
            "score": 1,
            "text": "OP, you have a problem with people who smoke weed, and you feel like people need to meet your standards in order for them to be making progress, full stop.  I've been reading through your comments, and a lot of people here are making excellent points, but your response is always some form of \"I see where you're coming from, but I know people who smoke weed and they aren't making the changes I think they need to make.\"\n\nYou aren't the arbiter of what is \"enough\" for anyone, get off your high horse and ask yourself why your standard is the standard that needs to be met.",
            "title_similarity": "0.87331903",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h425ejc",
            "score": 1,
            "text": "Anything can be bad for you when done in excess.\nAnd people have different levels of what excess is.",
            "title_similarity": "0.40919995",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h425mtp",
            "score": 1,
            "text": "I agree with you, just because it’s not addictive doesn’t mean you can’t become dependent",
            "title_similarity": "0.49704194",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h425sod",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h425v8b",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.04650814"
        },
        {
            "id": "h425vjh",
            "score": 1,
            "text": "No shit",
            "title_similarity": "0.080046155",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h426013",
            "score": 1,
            "text": "stop smoking weed you infadels",
            "title_similarity": "0.5025312",
            "sentiment_compound": -0.296
        },
        {
            "id": "h4267wp",
            "score": 1,
            "text": "It depends.  If you’re extremely depressed or suffering from chronic pain and it helps, why not?  It also isn’t really bad for you if you’re of age and not psychotic.\n\nI have worked with a number of people who perform and focus better with it than without, so if it works, use it.",
            "title_similarity": "0.60548186",
            "sentiment_compound": -0.85
        },
        {
            "id": "h426aqo",
            "score": 1,
            "text": "It's true but try telling that to my subconscious.",
            "title_similarity": "0.32174194",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h426b4n",
            "score": 1,
            "text": "It depends on how the substance is being used (like anything else). Sure, it's not healthy to be taking Xanax / opioids / etc to drown out life's problems, but they have their use. And as long as they aren't being used as an escape from reality it's (generally) no issue - and I believe pot to be the same.\n\nSo I don't smoke weed daily, so not sure if this applies. But I also spend around solid few days or more stoned per week, so it might. I smoke weed not as an escape, but because it makes me *more* productive - for example while high, these sorts of tasks become enjoyable instead of just feeling like a waste of time or like more energy than I can possibly make happen:\n\n- Spend a whole day focused on cleaning my apartment (and enjoying it even)\n- Learn new skills (e.g. I've taught myself to draw decently, only having the energy to practice while high)\n- Focus on productive projects (like assembling furniture, which is such a draining and hard-to-make-myself-do task while sober)\n- etc...\n\nIn effect, it essentially helps with executive function issues, and I've been told the same by a few others I'm close to. I'm a functional adult without it - by most anyone's definition I'm \"successful\", but I use pot as a way to improve my life outcomes over what I would accomplish without it",
            "title_similarity": "0.91414094",
            "sentiment_compound": 0.9888
        },
        {
            "id": "h426mrf",
            "score": 1,
            "text": "Weed consumption alone (volume and frequency) is not enough to determine if your consumption is problematic or not IMO.\n\nAre you doing good in your job?\nDo you work out?\nDo you sleep 8 hours a day? \nDo you have a healthy weight for your height?\nAre you eating healthy?\nDo you have healthy relationship with you SO and family?\n\nIn my experiencie you can be a daily weed smoker and doing good or great in almost every important aspect of your life.\n\nYou can be a mess in everything and not doing any drug never. \n\nOn top of that, there is not a direct correlation (as far as I know) between being a happy healthy member of the society and the amount of weed you smoke or vape.",
            "title_similarity": "0.7659732",
            "sentiment_compound": 0.9577
        },
        {
            "id": "h426qgt",
            "score": 1,
            "text": "What about coffee or tea? Many people can’t get through the day without these, with caffeine being physically addictive. Are they unhealthy if they use them daily? Weed is similar, but only habitually or mentally addictive. I smoke daily because I enjoy it, not to cope with life. Is it healthy? Probably not, but it’s also not unhealthy.",
            "title_similarity": "0.8487829",
            "sentiment_compound": 0.8969
        },
        {
            "id": "h426rd2",
            "score": 1,
            "text": "Nah prob not. But don't judge people for doing it. We all have freedom. Just like drinking coffee isn't healthy, eating sugar, fast food, tanning. Everyone has their vice. No one thinks that their vice is healthy",
            "title_similarity": "0.7887422",
            "sentiment_compound": 0.8277
        },
        {
            "id": "h426rpv",
            "score": 1,
            "text": "Weed consumption alone (volume and frequency) is not enough to determine if your consumption is problematic or not IMO.\n\n\nAre you doing good in your job?\nDo you work out?\nDo you sleep 8 hours a day? \nDo you have a healthy weight for your height?\nAre you eating healthy?\nDo you have healthy relationship with you SO and family?\n\n\nIn my experiencie you can be a daily weed smoker and doing good or great in almost every important aspect of your life.\n\nYou can be a mess in everything and not doing any drug never. \n\nOn top of that, there is not a direct correlation (as far as I know) between being a happy healthy member of the society and the amount of weed you smoke or vape, something very different compared with other \"hard drugs\" that have a very direct correlation with disease and criminality.",
            "title_similarity": "0.7659732",
            "sentiment_compound": 0.9551
        },
        {
            "id": "h426sc9",
            "score": 1,
            "text": "I smoke weed almost every night and have a six fig income as a manager at a big company, it helps me find creative ideas and meditate on things. As long as you’re not wasted on weed everyday I don’t think it’s an issue. Dependence on weed and not being able to function without it is definitely an issue though\n\nAlso I don’t think there’s something inherently wrong with using a safe substance (weed is way less harmful than alcohol) to relieve the stresses of life (assuming you can actually address the problems in front of you)",
            "title_similarity": "0.8355236",
            "sentiment_compound": 0.3549
        },
        {
            "id": "h426ukt",
            "score": 1,
            "text": "Hope that the pot heads who have children allow their kids to smoke :) its just weed after all!",
            "title_similarity": "0.6203706",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h426wbn",
            "score": 1,
            "text": "I think, for some ppl, it’s simply easier to face their issues high—nothing wrong with that. I also think, ppl should be allowed to do whatever they want to, with their own bodies.",
            "title_similarity": "0.5046679",
            "sentiment_compound": -0.0
        },
        {
            "id": "h42779g",
            "score": 1,
            "text": "I have crippling PTSD and panic disorder. It cost me my livelihood, my relationships, my joy. Then I discovered CBD oil, and then marijuana. I've been a daily consumer for a few years now, and believe me when I say it gave me my life back. I take no other psychotropic medications anymore. I am more personally and professionally successful than i have ever been. I was a teetotaler for most of my life, and i don't regret becoming a daily user. I'm grateful for it. If not for marijuana at bedtime, I would never sleep.",
            "title_similarity": "0.7387829",
            "sentiment_compound": 0.7602
        },
        {
            "id": "h4278aa",
            "score": 1,
            "text": "My cousin is a huge pothead. He started at like 13 smoking every single day. After trying to get him to stop 100x he finally did for about a month and I learned something I wish I didn't hes a shitty person and weed is the only thing that keeps him from being that way unfortunately. He got super violent he Already wasn't father of the year but after he was just terrible zero ability to stomach being around his kid. Got too know the police in my area on a 1st name basis cause of his stupidity. He needs mental help but it ain't gonna Happen he doesn't trust any form of doctors or anyone With power really so I forced him to smoke again just about shoved it down his throat. You may not like what you see from your partner once their sober",
            "title_similarity": "0.7683866",
            "sentiment_compound": -0.8914
        },
        {
            "id": "h42799h",
            "score": 1,
            "text": "Literally no body thinks that’s a healthy habit. Weed smokers who’ve smoked weed every day for months (aka myself) know that it’s not a healthy habit",
            "title_similarity": "0.7865086",
            "sentiment_compound": -0.1921
        },
        {
            "id": "h427bjz",
            "score": 1,
            "text": "My cousin is a huge pothead. He started at like 13 smoking every single day. After trying to get him to stop 100x he finally did for about a month and I learned something I wish I didn't hes a shitty person and weed is the only thing that keeps him from being that way unfortunately. He got super violent he Already wasn't father of the year but after he was just terrible zero ability to stomach being around his kid. Got too know the police in my area on a 1st name basis cause of his stupidity. He needs mental help but it ain't gonna Happen he doesn't trust any form of doctors or anyone With power really so I forced him to smoke again just about shoved it down his throat. You may not like what you see from your partner once their sober",
            "title_similarity": "0.7683866",
            "sentiment_compound": -0.8914
        },
        {
            "id": "h427bxy",
            "score": 1,
            "text": "no smoke in your lungs in healthy. your lungs don’t suddenly say “oh hell yeah” when you smoke. doesn’t mean someone should decide whether people can do it or not. plenty of things are unhealthy for us yet we love that shit",
            "title_similarity": "0.81910396",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h427d5z",
            "score": 1,
            "text": "Some people manage to smoke a lot and still get stuff done. This is black magic to me as I can barely operate a microwave whilst high but good luck to those people that can function whilst stoned.",
            "title_similarity": "0.6742232",
            "sentiment_compound": 0.8338
        },
        {
            "id": "h427vdi",
            "score": 1,
            "text": "Lol what a square",
            "title_similarity": "-0.06620049",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h427wjz",
            "score": 1,
            "text": "Lol what a square",
            "title_similarity": "-0.06620049",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h42887x",
            "score": 2,
            "text": "we’d👽👽👽👽👽",
            "title_similarity": "-0.07533966",
            "sentiment_compound": 0.0
        },
        {
            "id": "h428b2o",
            "score": 1,
            "text": "Do you have personal experience in this? But im sure you would rather see people taking prescriptions everyday.",
            "title_similarity": "0.7334883",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h428jnf",
            "score": 1,
            "text": "It's not healthy simply in the fact that you are inhaling smoke which is bad for your lungs. Mentally smoking Marijuana daily is probably better than taking some crazy FDA approved medication. The physical aspect of smoking the Marijuana is the only truly detrimental part that is likely bad for you. There is some science I'm sure as to the negative effects high quantities of THC can have on the brain ie. A kid at a local high school went into a comma after smoking 98% THC vape juice.\n\nEdit: I believe a person who smokes Marijuana daily is likely to be more healthy than someone who smokes cigarettes and drinks to much beer.",
            "title_similarity": "0.81528735",
            "sentiment_compound": -0.3538
        },
        {
            "id": "h428pbn",
            "score": 1,
            "text": "Deeply specific to each person. I’m almost a year sober after 15 years of alcoholism. And it’s because a friend convinced me to try smoking weed everyday for a week and not drink. Never went back since that week. I smoke two or three joints a day starting in early afternoon. It’s improved my mental health that I was trying to medicate with alcohol. I sleep regularly and on a good schedule. My relationship with my son has been repaired. My career has taken off because of my ability to produce far more and finish projects far more productively. And I spend time with things I enjoy like reading and biking. \n\nAnd I smoke weed everyday. That stuff saved my life. It gave me a life. I use to drink to blackout 6-7 days a week. Now, I have a happy marriage and for the first time, I get excited about tomorrow. \n\nWeed made it all possible.",
            "title_similarity": "0.769641",
            "sentiment_compound": 0.9794
        },
        {
            "id": "h429bcu",
            "score": 1,
            "text": "Do you drink coffee or soda daily?",
            "title_similarity": "0.4048456",
            "sentiment_compound": 0.0
        },
        {
            "id": "h429kbx",
            "score": 1,
            "text": "Neither is using tobacco or drinking alcohol or eating sugary processed foods but money exists and people can grow substantial amounts in their own homes without them getting a piece of our paychecks and the people who make the rules hate it when they don't get paid.",
            "title_similarity": "0.71753275",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h429l64",
            "score": 1,
            "text": "Neither is using tobacco or drinking alcohol or eating sugary processed foods but money exists and people can grow substantial amounts in their own homes without them getting a piece of our paychecks and the people who make the rules hate it when they don't get paid.",
            "title_similarity": "0.71753275",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h429pp3",
            "score": 2,
            "text": "Take it from someone who smokes weed everyday… it’s not healthy. Just remember moderation!",
            "title_similarity": "0.7715362",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h429y5n",
            "score": 1,
            "text": "Cannabinoid hyperemesis is the worst pain in my life.",
            "title_similarity": "0.52969784",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h42a70e",
            "score": 2,
            "text": "I am in constant pain from a couple health conditions weed takes the edge off and helps me manage pain. It makes it so I can mostly function. Reality is I am rarely blazed out of my mind or even very high, you build up a tolerance.",
            "title_similarity": "0.668932",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h42ahas",
            "score": 1,
            "text": "I won't argue with you that it is healthy. No amount of smoking anything is ever going to be good for you and overconsumption of anything is bad for your health too.\n\nThe question of whether it is unhealthy however, is a different one and not exactly the opposite issue.\n\nSomething can be not healthy for you while not necessarily being unhealthy for you. If you are already a smoker and would only smoke one blunt per day extra, it's not going to do you any good, but it probably won't have any significant impact on your physical health (putting aside issues like energy levels, memory and motivation)\n\nNow as you already briefly mentioned, there are definitely people who would benefit from smoking daily, like people with certain kinds of illnesses that give you chronic pain or some mental issues, but that's a separate matter",
            "title_similarity": "0.8465396",
            "sentiment_compound": 0.9089
        },
        {
            "id": "h42alwk",
            "score": 1,
            "text": "That's why I vape",
            "title_similarity": "0.014471348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h42aqnn",
            "score": 1,
            "text": "It really depends, as with most things. If someone is letting weed get in the way of daily activities, then it’s a problem. It’s less likely for people to develop a problem with weed than it is alcohol, and alcohol does do more internal damage if abused, but that doesn’t mean that weed can’t be bad. It’s only overusing if it gets in the way of your daily life, which it sounds like might be happening. I know people who smoke the second they wake up and are stellar employees with energetic social lives and actively pursue hobbies. I also know people who only smoke at night who then sleep all the next day and don’t get anything done, so it really just depends in my opinion.",
            "title_similarity": "0.8402767",
            "sentiment_compound": -0.1997
        },
        {
            "id": "h42b45v",
            "score": 1,
            "text": "Then why is medicinal allowed to be smoked daily?",
            "title_similarity": "0.5791264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h42b9de",
            "score": 1,
            "text": "Smoking anything is not best case scenario for lungs.they are made to breathe air not smoke",
            "title_similarity": "0.6303088",
            "sentiment_compound": -0.5216
        },
        {
            "id": "h42bewq",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.\n\nThank you for understanding.",
            "title_similarity": "0.73343",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h42bf3e",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.\n\nThank you for understanding.",
            "title_similarity": "0.73343",
            "sentiment_compound": 0.2066
        }
    ]
}