{
    "CMV: Gmail is streets ahead of Outlook in everyday usability\nI have worked in corporate environments that use both Outlook and Gmail (Google tailors it to the specific corporate with branding etc, but it’s Gmail through and through). Having used both in the same type of working environment, my take is that Gmail is not just marginally better, but far better. \n\nI am a non-technical user, so I’m not going to rattle off a feature list from some IT website. My needs are speed, user friendliness, integration with other applications (Gmail - google drive, Outlook - Office 365) and obviously a good calendar interface. Outlook might tick the boxes for these items, but Gmail just does it far better. Am I missing something here? CMV. \n\n(And no, I don’t work for a tech company or have some underlying marketing agenda.)": [
        {
            "id": "h45zrck",
            "score": 1,
            "text": "Hi /u/Chris_3213! You're not in trouble, don't worry. This is just a **Rules Reminder for All Users.** \n\n---\n\n**All users, (including mods, OP, and commenters) are required to follow the rules of this sub at all times.** If you see a user violate the rules of the sub, please report that comment/post and a human moderator will review it. We understand that some topics posted here may touch on sensitive or contentious issues. We ask that all users **remember the human** and **assume good faith**. \n\n**Notice to all users:**\n\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\n\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \n\n\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\n\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\n\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\n\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.55986786",
            "sentiment_compound": 0.8371
        },
        {
            "id": "h4552ju",
            "score": 0,
            "text": "Gmail sucks so bad compared to outlook smh",
            "title_similarity": "0.31607106",
            "sentiment_compound": -0.8516
        },
        {
            "id": "h44w45n",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h453lcm",
            "score": 0,
            "text": "Nahhhhhhhh Gmail is SHITTTTTTTTTT",
            "title_similarity": "0.32634518",
            "sentiment_compound": 0.0
        },
        {
            "id": "h44ii3q",
            "score": 28,
            "text": "Honestly I can't stand Gmail, Outlook is far better.",
            "title_similarity": "0.55773133",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h44uyus",
            "score": 1,
            "text": "I’m a teacher. Switched districts this year during virtual learning and went from google suite to office 365. I was constantly frustrated. I don’t think office is user friendly and just visually unpleasant. Don’t get me started about teams. Never had so many issues trying to meet with kids and so inconsistent. I see so many people like outlook which I find so surprising.",
            "title_similarity": "0.6217797",
            "sentiment_compound": 0.2971
        },
        {
            "id": "h44lymc",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45om1a",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h44ali1",
            "score": 1253,
            "text": "I'm am accountant and work for a company that moved over over Gmail about a year or two ago. Everyone hates it and I am included. Here are some things I can't stand.\n\nYou can't preview Excel files very easily. When you try if they have pivot tables the pivot tables don't display unless you download them. I found it a lot easier to preview and use received Excel files in Outlook.\n\nThe alternative to this would be to use Google sheets but google sheets is useless for any serious spreadsheet work... that is a separate topic though.\n\nWhen I receive emails with attachments and want to send them to someone else I now need to download them, save them to the computer somewhere and then attach them to a new email. This is slow and cumbersome. In Outlook I used to just drag a file from one email to the one I was drafting and BAM it was attached.\n\nIf I opened a file from Outlook I could edit it and then hit send. It Gmail it doesn't keep a temporary copy there so you have to save it back somewhere and reattach it. It is common I find something minor I want to change in a file when doing the final review. Another use of this in Outlook was deleting all links in my spreadsheets. In Outlook I would attach it with links, open it from the email, delete the links and hit send. That way the copy on my drive keeps the links and the copy sent has hard coded figures. Now we use Gmail I have to save two copies on on computers one with links and one hard coded.\n\nSearch functions on Gmail are a lot worse than Outlook. I find things like searching by unread or finding older emails a lot easier on Outlook than Gmail and everyone I talk to in my company agrees and complains about this constantly.\n\nThere are probably some advantages, and maybe it would be better if I didn't need to use Microsoft office programs and the rest of gsuite was adequate, but as it stands now it is a lot worse for work purposes.",
            "title_similarity": "0.7002833",
            "sentiment_compound": 0.9414
        },
        {
            "id": "h44qb1n",
            "score": 2,
            "text": "Google invested heavily in user experience (UX)\n\nMy company thinks UX is about consistent look and feel across multiple sites and addressed with a template. Journey maps? User Interviews?  Hell no",
            "title_similarity": "0.8108481",
            "sentiment_compound": -0.7998
        },
        {
            "id": "h45jp0l",
            "score": 2,
            "text": "I hate that you can’t sort alphabetically by name in G mail. I want to be able to start at the A’s and delete vast swaths of emails all through the alphabet as I clean up all my old stuff. I can do that in my yahoo email but not in Gmail. . I hate gmail. They don’t give a toss about what the customer actually wants or needs. JERKS.",
            "title_similarity": "0.54971564",
            "sentiment_compound": -0.8793
        },
        {
            "id": "h44ho7g",
            "score": 47,
            "text": "One word on why Outlook is better than Gmail\n\n**Tables**",
            "title_similarity": "0.6497507",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h44lzot",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h44fgsy",
            "score": 188,
            "text": "> My needs are speed, user friendliness, integration with other applications (Gmail - google drive, Outlook - Office 365) and obviously a good calendar interface. Outlook might tick the boxes for these items, but Gmail just does it far better. Am I missing something here?\n\nMost organizations that use Outlook, will use MS Office as well, and the integration there is better than Gmail's.\n\nThere are quite a few annoyances I have with Gmail:\n\n* E-mail threads are upside-down, beginning with the oldest message in the thread.\n* No e-mail sorting by title, date, sender etc.\n* Only up to 100 e-mails without pagination (left/right arrows to display more)\n* Only one e-mail signature, and Gmail recipients must click on three dots (...) to see your signature\n* No folders, only labels. In Outlook, I can *clear out* my inbox, so I know that I have taken action on each received e-mail.\n* Reduced formatting options: no tables, no images next to text paragraphs (only above/under), no horizontal lines etc. For newsletters, these formatting features allow much more legible and flexible lay-outs.\n\nAnd I haven't even started on the higher flexibility of rules and alerts, advanced find, Quick Steps and other more advanced features in Outlook.",
            "title_similarity": "0.85195065",
            "sentiment_compound": 0.9113
        },
        {
            "id": "h453dub",
            "score": 9,
            "text": "You can't have used outlook then google and said Google has better speed... it's literally impossible. You can internally sync outlook, Google is purely through internet connection. There is literally no way it's faster.",
            "title_similarity": "0.6309991",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h44hdx7",
            "score": 111,
            "text": "Not a very thorough analysis but having worked in an industry that is filled with IT companies and Managed Service Providers, Office 365 has certain benefits that G Suite does not:\n\n1. Superb interfacing with MS Office which is arguably better and more powerful than Google’s suite of tools. \n\n2. Customisable calendar: Outlook calendar is fabulous for its ability to customise events and the calendar itself, also allowing meetings to be kept private easily while offering strictly necessary descriptions to viewers. Google just says “busy” \n\n3. OneDrive does not require you to open a browser just to view a file. Google Drive is also a huge PITA on mobile phones while OneDrive arguably does the speed and user-friendliness better. \n\n4. Teams! : Google has no competitor to Teams that seamlessly integrates with Office tools and allows rapid sharing of files and even collaboration.",
            "title_similarity": "0.86106503",
            "sentiment_compound": 0.9555
        },
        {
            "id": "h44vwed",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h44u6q2",
            "score": 28,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h44dsv8",
            "score": 597,
            "text": "Gmail is simpler, faster, and more user friendly. This is because it has fewer features and customizability for large organizations like Outlook. It works best for individuals and small organizations. But if you have a huge company, Outlook connects everyone in a more streamlined way.\n\nOutlook integrates well with Word, Excel, and PowerPoint, which are the dominant apps in their space. Microsoft Windows is the main operating systems on computers, and Microsoft Azure is the main internal cloud computing system for companies (Amazon Web Services is the main one overall and for public facing websites like this one). For example, you can read attached files in Outlook without even opening the file, which is a big timesaver.\n\nThis matches the companies' business models. A decade or so ago, Microsoft tried to copy Apple and make hardware. But they failed horribly. The only parts of the business that made any money were Microsoft Office and Windows. But they couldn't sell more software since everyone already owned those programs. Then they figured out cloud computing. You can just store information on servers that are different from the individual computers. So they started selling subscriptions to their cloud service, which made a ton of money. And they integrated all their office programs into it. They made the head of the cloud computing division the CEO and the company became ultra-successful.\n\nGoogle makes most of its money from advertising via the Google Search engine. Pretty much everything including Youtube, Android, Gmail, etc. is geared towards making money via that search engine. It's insanely profitable. As a result, they basically ignored the corporate and institutional market until recently so they have a lot of catching up to do. \n\nUltimately, usability depends on what you're trying to do. The same person would likely prefer Gmail as an individual or worker in a small organization, and prefer Outlook as someone in a big organization.",
            "title_similarity": "0.824266",
            "sentiment_compound": 0.9397
        },
        {
            "id": "h44nld0",
            "score": 12,
            "text": "Gmail is a great email service for individuals and small businesses. However, there’s no competition for large corps, it’s Outlook by a mile. Rules integration is great, it’s remarkably good at filtering spam, the calendar integration with third party apps is simple, it’s easier to enforce security, I could go on and on. And I’ll also say, if you work in finance or healthcare, you really have to self-host your email server because of the amount of sensitive data that can flow through. \n\nTo be clear, I use Gmail for my personal stuff and would never consider Outlook for that. But for business, it’s the best product.",
            "title_similarity": "0.79094386",
            "sentiment_compound": 0.9423
        },
        {
            "id": "h44c1p7",
            "score": 46,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h44e2mc",
            "score": 20,
            "text": "> My needs are speed, user friendliness, integration with other applications (Gmail - google drive, Outlook - Office 365) and obviously a good calendar interface. Outlook might tick the boxes for these items, but Gmail just does it far better. \n\nI'd argue that Outlook ticks the important boxes much better than anything else, purely from its integration into the Office package. That is a common denominator used across industries by non-technical users, and it is miles better than Google's alternatives. No amount of extra speed or user-friendliness by Gmail beats that additional utility for Outlook.",
            "title_similarity": "0.87922823",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h44b8so",
            "score": 35,
            "text": "What I like about outlook is having multiple accounts open in the same page and being able to save something from one account in the folder of another one. I also hate how the delegated Gmail shows which user sent from another account.",
            "title_similarity": "0.6788663",
            "sentiment_compound": 0.25
        },
        {
            "id": "h44j2e7",
            "score": 42,
            "text": "It really depends on the use cases, but for most knowledge worker applications involving information processing, I would highly recommend Outlook over Gmail.  \n\nI’ve worked across Outlook, Gmail, and Notes (ugh) environments across my career.  Outlook is hands down the more efficient UI when you are using email and calendaring frequently for your work with others.\n\nEspecially if your corporate environment is using Office 365.  \n\nSome reasons why\n\n-\tOutlook provides helpful presence information including profile photos, free/busy, access to org chart, and out of office information.  Makes it much faster to get context about the person you are emailing.\n-\tOutlook provides robust desktop app, mobile app, and web based solutions.  Gmail solution to offline usage on a desktop using Chrome is less robust and loses many features when offline vs the Outlook desktop and mobile apps.\n-\tOutlook’s UI for sorting, filtering, and filing is incredibly intuitive vs Gmail.  Searching and sorting in Gmail requires advanced knowledge of search queries.  Outlook makes this tap and click for most users\n-\tOutlook is tightly integrated with Teams and the Office environment.  Makes previewing and editing documents quick.  Email ticklers from Teams dynamically update with the recent thread information right in the body of the email reminder.  These features are missing or less robust in Gmail\n-\tThe label and archiving experience to inbox management in Gmail is more technical than the folder structure in Outlook.  Filing email in Outlook is more akin to paper processing, and thus, more easy for non-pro users to understand and take advantage of.\n-\tMeeting scheduling is much more robust in Outlook especially when coordinating multiple participants.  The Outlook scheduling assistant UI makes it faster to schedule an event vs the Gmail scheduling UI which I find to be clunky.  \n-\tOutlook has very advanced delegate and access management with refined ways to share your inbox or your calendar with team members.\n\nOverall, I find the Outlook UI to be much more efficient when processing hundreds of daily emails vs the Gmail UI.  Gmail seems fine for personal use, but does not feel designed for collaborative use which is much more common in a corporate environment.",
            "title_similarity": "0.873901",
            "sentiment_compound": 0.9909
        },
        {
            "id": "h44x9pg",
            "score": 51,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h44kw5m",
            "score": 66,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h44hozs",
            "score": 18,
            "text": "I prefer Gmail for consumer use, but Outlook is amazing for a corporate environment. It has excellent integration with Cisco's suite of communication tools, like WebEx. WebEx meetings are set up just like regular meetings and push to everyone on the same platform. It also supports incredibly in-depth policy configuration from IT.",
            "title_similarity": "0.82979035",
            "sentiment_compound": 0.9682
        },
        {
            "id": "h44k2y6",
            "score": 4,
            "text": "Hmm, I don't understand, how is it better?   You just say it's better without explaining why.   I don't use gmail so I have no first hand experience with it, but outlook ticks all the boxes I need for work.  How is gmails calendar better than outlook?  How is integration with google drive better than office 365?",
            "title_similarity": "0.78947186",
            "sentiment_compound": 0.8623
        },
        {
            "id": "h44kou5",
            "score": 3,
            "text": "The only argument I would have is that it is personal preference in terms of usability.\n\nI don't know the ins and outs of gmail as I don't use it often, if ever. I use outlook because that is what my company uses so I am far more productive in terms of work quality and quantity when using a service I am more comfortable with.",
            "title_similarity": "0.7669662",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h44m9vq",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h44mw1e",
            "score": 12,
            "text": "[deleted]",
            "title_similarity": "0.014392354"
        },
        {
            "id": "h44oikp",
            "score": 5,
            "text": "/u/Chris_3213 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/oe83nx/deltas_awarded_in_cmv_gmail_is_streets_ahead_of/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.630607",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h44ot6d",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h44pzcq",
            "score": 2,
            "text": "I use both. Word, Excel, PowerPoint is still superior to Google's. I don't have a preference between Gmail and Outlook for work. SharePoint and the Power platform are fantastic, even on the cheapest plan. I haven't tried Google's AppSheet though.\n\nHowever, for my freelance business, I went with Google because I despise OneDrive!",
            "title_similarity": "0.7963095",
            "sentiment_compound": 0.8805
        },
        {
            "id": "h44pzmh",
            "score": 11,
            "text": "I have experienced the opposite, Outlook has fantastic integration with skype for business or teams and makes organising meeting great because you can see when people are available it so simple. I don't really need to integrate my email service with documents or data as we have private network storage service, which in my opinion is far better than google drive. \n\nEven if google may be better in that area, I really wouldn't want to switch from microsoft office  to google services as they are far more powerful and more usable. I would say google is convenient but I don't need convenience in my working software suite, I need functionality.",
            "title_similarity": "0.82186246",
            "sentiment_compound": 0.8199
        },
        {
            "id": "h44qh2g",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h44rbbu",
            "score": 17,
            "text": "26 years of IT support experience here, with corporates, SMEs and now private consulting and run an MSP. I've seen every single email issue that could possibly happen!!\n\nI use Gmail day to day - with around 10 various connected accounts, also Gsuite, and Outlook with office 365 for my corporate work, probably 10 profiles and 40 or so accounts connected. Yes its a PITA but its necessary. \n\nIt's all about the right tool for the job you're doing. Gmail is extremely quick and i use it all day. Outlook I use as and when. For my Microsoft heavy work, Outlook is incomparable - with Word, Excel, Sharepoint, teams then there's nothing else that you would even consider, its not a choice, You just use Outlook.\n\nFor my non MS work, its Gmail all day. \n\nThere's no definitive 'better'. You use what is right for you. There's an accountant in this thread whose company moved them to Gmail - I would seriously question who decided that (I can guarantee its an enthusiastic Gmail user & senior staff member who has \"seen the light\" with Gmail and decided everyone should use it without trialing properly with staff). I would never impose Gmail on a company like that unless all the users were very familiar with the limitations of Gmail, ands interoperability with excel. Gmail is *definitively* the wrong tool in that situation and Outlook absolutely is right. There might be a compelling business reason somewhere for it, or a political one but I doubt it. That absolutely smacks of forcing a product in for the sake of that product. That company made a poor business decision - or it was their intention to slow down their staff and introduce inefficiency, and frustration to their staff. If I owned a business where I was trying to demotivate staff, I'd do that sort of thing.\n\nOutlook with Office 365/Exchange online is absolutely the right tool for a corporation that relies on MS Office and 365. From a user point of view it might not seem always so, but your needs are not the full story. There is a huge background cost and effort to manage the data (including email) of a company, and your need to send and receive email is a relatively small part.\n\nEdit, I've just seen some of your other responses, in particular: \"...I think this is more relevant from the perspective of the back end IT administrators, rather than front end users, where user friendliness is key for everyone.\"... yeah... and as harsh as it sounds, you are not entitled to a user friendly front end. Of course you should have one, but its not always possible. Its a business decision, it always is. And your user friendliness is not my user friendliness. There a *huge* swathe of the working population who are used to Outlook - huge percentage. They dont see Gmail as a viable alternative, because they dont know about  it. \n\nTo them, Outlook is the messaging and calendaring tool they've used for decades. In exactly the same way, the stapler on their desk is the stapling tool they've used for decades. Its the same level of understanding and knowledge. They might have Gmail or Hotmail on their phone and at home, or whatever, but they don't see the crossover with that and Outlook. Outlook, to that huge swathe of people, is absolutely user friendly. I know MS products get bad rep, but they absolutely do work and keep businesses running.",
            "title_similarity": "0.7320441",
            "sentiment_compound": 0.9552
        },
        {
            "id": "h44ri7g",
            "score": 1,
            "text": "In outlook express I always found it much easier to set up all sorts of rules and filters.\n\nGmail as best as I can figure has the ability to do tags, but nothing near as nice as the rules system of outlook",
            "title_similarity": "0.7381272",
            "sentiment_compound": 0.2851
        },
        {
            "id": "h44rk3s",
            "score": 1,
            "text": "In a lot of ways, yes. But when I move emails between folders/labels in Gmail, they often mysteriously disappear.",
            "title_similarity": "0.5248028",
            "sentiment_compound": -0.128
        },
        {
            "id": "h44rvm4",
            "score": 8,
            "text": "I agree with the other comments that say if you aren't doing very much, Gmail is probably the better choice.\n\n\nPerspective:I use both tools every day, and even switched my former employer to Google apps for work (current one is an O365 shop)\n\n\n\nOutlook has so many more features. Wanna have multiple separate windows with each email? Outlook. Want to have an all-one view of your agenda, email, and tasks? Outlook.\n\n\nOutlook has the best task manager of any application short a dedicated project management software suite. Googles offering doesn't even come close \n\n\nCalendar I feel is the most similar, down to personal preference. Integrations with WebEx seem to be better in Outlook, but given my employer, this may be biased.\n\n\nEmail sorting, rules, rich text editing, file previews, all of it are just vastly superior in Outlook.\n\n\nBut here's the thing, do you need/want all those features? If at a company level, no, then go with Gmail. Now, if your company does but you as an end user don't, collapse the ribbons if too many buttons bother you. Change the views (pun intended) to a layout that is more friendly to you. On a personal level, I don't use outlook; I don't need all the features. Gmail is fine. But at work, outlook all day",
            "title_similarity": "0.85918415",
            "sentiment_compound": 0.9756
        },
        {
            "id": "h44sgkx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h44sjew",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h44sr6t",
            "score": 13,
            "text": "You can't pin emails at the top in Gmail. \"Starring\" is pretty useless because it doesn't highlight emails as prominently as Outlook does.\n\nThat's all I need to choose Outlook over Gmail.",
            "title_similarity": "0.5909479",
            "sentiment_compound": 0.0423
        },
        {
            "id": "h44wp0w",
            "score": 1,
            "text": "It definitely is, but I prefer yahoo just because they have a premium subscription that gives you ad-free access and vouchers for dollar general and Best Buy for only a couple dollars a month. Gmail would be my go to though if yahoo didn’t exist, their app is miles ahead of any other mail app I’ve come across",
            "title_similarity": "0.7047483",
            "sentiment_compound": 0.8248
        },
        {
            "id": "h44xcer",
            "score": 1,
            "text": "I cant use hyperlinks on icons (certificates) using gmail signatures (on web) they appear correctly when i compose the email but are sent as a broken mess.\nIf i use my same gmail account in outlook I can compose them just fine and they appear just fine when sent",
            "title_similarity": "0.73413706",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h44yzh3",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h44z4ka",
            "score": 1,
            "text": "For my personal account I went with Gmail mainly for it's prominence across the web. No longer must I remember a password, Google has it's email integrated into most log-in screens. It also is necesary to use YouTube, which I watch more than I should.\n\nHowever my school uses Microsoft (and thus Outlook) to run all it's email and file sharing services. This is actually pretty good, as I can write a document on my computer at home and have it autosave to OneDrive. If you use Office applications alot, you will find it far easier on Outlook.",
            "title_similarity": "0.7789371",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h4502os",
            "score": 2,
            "text": "There are also security/privacy concerns using gmail for corporate work",
            "title_similarity": "0.67446125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h450jz3",
            "score": 3,
            "text": "I use Gmail for my internship and outlook for my school. I prefer outlook just because I keep having important emails pop up in my spam or trash every day in Gmail.",
            "title_similarity": "0.72417283",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h451rnu",
            "score": 6,
            "text": "I think everyone has made good points here, one point I want to call out is how much worse Gmail notifications and alerts are.\n\nAt my old job, we had Outlook and I could always hear when I got an email and had set up an alert 5 min before a meeting and 0 minutes before a meeting.  The noise was really audible in addition to a pop up on my screen, it was pretty impossible to miss.\n\nSince starting a new job that uses Gmail I’ve missed a ton of meetings.  The alert sound is quiet and cannot be changed.  The notification shows up for a few seconds in the top right corner and can easily be missed even when I’m staring at the screen.\n\nI can’t even use a custom ringtone for Google calendar alerts on my phone.  Luckily, I discovered I can integrate it with Slack and get their notifications which are a lot less missable.\n\nNot as big of a deal, but I also don’t really get email notifications in real time.  Frequently, someone will tell me they sent me an email and it won’t show up until I refresh my browser.\n\nI use Gmail personally, but I find it unusable for work without a lot of extensions.",
            "title_similarity": "0.6141336",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h452wqy",
            "score": 2,
            "text": "I hate outlook but it's functionally better and it's not really fair to compare webmail to a piece of software that isn't browser based.",
            "title_similarity": "0.6392447",
            "sentiment_compound": -0.0691
        },
        {
            "id": "h452xpm",
            "score": 1,
            "text": "One word: Sweep\n\nMS got this right.  Gmail filters are cumbersome and managing and clearing the inbox is a lot more work with Gmail.",
            "title_similarity": "0.63299745",
            "sentiment_compound": 0.0
        },
        {
            "id": "h453nm4",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h454598",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h454pc5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h4555u3",
            "score": 2,
            "text": "I hate it\n\nHad gmail signed in through outlook \n\nYeah 2 factor might suck and suite is a bit more easily accessed",
            "title_similarity": "0.64039207",
            "sentiment_compound": -0.4033
        },
        {
            "id": "h455dba",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h4573y5",
            "score": 1,
            "text": "You're right that Gmail makes things a ton easier, but there is two things outlook has that's superior to Gmail. \n\nIn outlook, you can create folders of emails and set rules to have certain emails to into those particular folders. I have tried several times to do this on Gmail, but if the option does exist, I haven't found it. \nAlso, in my job i use the hell out of email templates. I send many emails daily to various departments and having the ability to use the same template makes my life a ton easier. Just drag the attachment and send. I haven't found the ability to do this in Gmail either.",
            "title_similarity": "0.8119935",
            "sentiment_compound": 0.8484
        },
        {
            "id": "h458us0",
            "score": 2,
            "text": "Recently switched companies and moved from Outlook to Gmail. While Gmail has its benefits, for *my specific use* I found Outlook to be much better. My biggest gripe is attachments. Being able to copy and paste attachments directly into/out of folders in outlook or copy and paste directly between emails is amazing. I hate having to download every attachment before categorizing or sending back out in a new email. Gmail has terrible thread arrangement and signature handling.\n\nAlso subject/recipient handling. In outlook you can take an inboxed email and then forward it to someone else and alter the text, recipients, and subject lines as much as you wanted. You can do most of this in Gmail but I find it’s way clunkier.\n\nPro for Gmail though is the seamless integration with Teams. That’s pretty neat.",
            "title_similarity": "0.74225366",
            "sentiment_compound": 0.9144
        },
        {
            "id": "h459nuz",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45a1p9",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45aijp",
            "score": 3,
            "text": "One major issue with gmail- pressing Tab while composing an email does not tab your cursor but rather tabs to the send button. Two keystrokes can send an email that you were not finished composing. This alone makes it a worse program.",
            "title_similarity": "0.5706447",
            "sentiment_compound": -0.792
        },
        {
            "id": "h45b283",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45c2pn",
            "score": 6,
            "text": "Outlook is pretty good, especially if you are a business person.\n\nIf not, there are still pros. \n\n[https://luxhosting.lu/blog/10-advantages-of-using-microsoft-outlook/](https://luxhosting.lu/blog/10-advantages-of-using-microsoft-outlook/)\n\nFor a small business, Gmail is fine; however, for larger businesses, Outlook is superior as a application and product. It interfaces with the server-based Microsoft Exchange to provide a robust infrastructure for email and calendaring. It also provides security by locking down access to corporate email. The exchange server also provides a specified business email address. This can be a pro for regular individuals as well. In addition, Outlook has a security advantage due to the ability users have to password protect specific files and encrypt individual emails. It's also software an email client use in many corporations in conjunction with MS Exchange server and Microsoft SharePoint server for employees to coordinate meeting, calendars and shared mailboxes.\n\n&#x200B;\n\nSo, this seems relative, Gmail is not necessarily ahead. \n\n[https://tryshift.com/blog/apps-hub/gmail-vs-outlook/#:\\~:text=Gmail%20vs%20Outlook%3A%20Conclusion&text=If%20you%20want%20a%20streamlined,is%20the%20way%20to%20go](https://tryshift.com/blog/apps-hub/gmail-vs-outlook/#:~:text=Gmail%20vs%20Outlook%3A%20Conclusion&text=If%20you%20want%20a%20streamlined,is%20the%20way%20to%20go).",
            "title_similarity": "0.81644905",
            "sentiment_compound": 0.9776
        },
        {
            "id": "h45cz2e",
            "score": 11,
            "text": "Gmail has no proper offline client. That kills it for me. I am on the go frequently, sometimes without internet connection. With outlook, I can still work through emails, sort them, reply, everything. Gets synced up when a connection is back.",
            "title_similarity": "0.58088565",
            "sentiment_compound": -0.652
        },
        {
            "id": "h45d2g7",
            "score": 3,
            "text": "For simple everyday users that don't need any major business features? Sure. \n\nOutlook integrates with active directory, which can integrate with your facilities for reserving rooms in meetings, viewing multiple overlapped schedules including team schedules, integration with office, azure, and azure dev ops, etc. just off the top of my head.",
            "title_similarity": "0.74421346",
            "sentiment_compound": 0.7239
        },
        {
            "id": "h45dk0u",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45ex1g",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45f69m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45fgv6",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45fxiw",
            "score": 1,
            "text": "Gmail doesn’t have rules. Outlook does.",
            "title_similarity": "0.4172601",
            "sentiment_compound": 0.0
        },
        {
            "id": "h45hg4h",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45jcvr",
            "score": 1,
            "text": "I’d say ProtonMail’s better than both",
            "title_similarity": "0.42863247",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h45jsh1",
            "score": 2,
            "text": "I manage a restaurant and currently use Outlook mainly for its VBA functions. Specifically, being able to identify when an order comes in and execute a script that opens Word + Excel to modify the contents and print is something Gmail can't do. \n\nI still use Gmail for email because it's accessible everywhere, doesn't need to be bought/activated, and can sync things like bookmarks, extensions, and passwords.",
            "title_similarity": "0.76101804",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h45o9vm",
            "score": 1,
            "text": "Can't change your mind unless you also frequent the Usenet, in that case you need to check out [Agent](https://www.forteinc.com/agent/). I used it for years and can't find it's equal.",
            "title_similarity": "0.63387203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h45oorv",
            "score": 2,
            "text": " I do not like the way Gmail stacks the emails in a thread. Outlook is simple and Gmail just seems to obfuscate the threads.",
            "title_similarity": "0.60915565",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h45p8rn",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45q7x5",
            "score": 1,
            "text": "For a home user gmail is sufficient. In a corporate environment it’s a shitshow with all the labels and crappy calendar when comparing it to Outlook",
            "title_similarity": "0.65185153",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h45qqj1",
            "score": 1,
            "text": "Labels in GMAIL are absolute GARBAGE in comparison to the folder features Outlook provides. That alone is enough for me to use outlook over gmail.",
            "title_similarity": "0.5818999",
            "sentiment_compound": -0.25
        },
        {
            "id": "h45r6xu",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45rlhb",
            "score": 3,
            "text": "Are you talking about Outlook the desktop program or the webmail view? To me, having a dedicated program handling email is just far superior to webmail. It's always sitting in the taskbar ready to go and loads instantly. And you get an instant pop up whenever an email comes in, if you want it, not to mention meeting reminder pop ups. And you can't accidentally close a tab and have the whole client disappear.",
            "title_similarity": "0.8112392",
            "sentiment_compound": 0.8568
        },
        {
            "id": "h45t6xp",
            "score": 1,
            "text": "You can't open in a new window in gmail without fighting with it.",
            "title_similarity": "0.50766903",
            "sentiment_compound": 0.2755
        },
        {
            "id": "h45uenc",
            "score": 2,
            "text": "Google is scarier than Microsoft with the data harvesting right now.",
            "title_similarity": "0.5299329",
            "sentiment_compound": 0.0
        },
        {
            "id": "h45ux6s",
            "score": 1,
            "text": "The outlook interface is so much more user friendly than Gmail.",
            "title_similarity": "0.65342295",
            "sentiment_compound": 0.539
        },
        {
            "id": "h45vgmq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45x985",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45xila",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45yidk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45ywyr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h45ze5f",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h460g9e",
            "score": 1,
            "text": "The main search thing I found useful in Excel was searching for an email by attachment name. I am not sure there is a way to do this exactly in gmail but I may be wrong. A lot of people have said that Gmail search is better so I may need to reassess this.\n\nIn regard to sheets vs Excel the main thing is manoeuvrability for large data and linking between spreadsheets.\n\nIn Excel I have hundreds of files that are all large and linked together through vlookups. I have tried to replicate some of my spreadsheets into google and it was pretty quick to tell me I had reached the data limit for a spreadsheet.\n\nIf there is a way to do large data lookups between Google sheets docs let me know as I would love to switch some more things over but it just doesn't seem possible at the moment.",
            "title_similarity": "0.7824509",
            "sentiment_compound": 0.9734
        },
        {
            "id": "h460v09",
            "score": 1,
            "text": "The company I previously worked at used the full Google suite. My current one uses outlook.\n\nThere's a much better sense of connection between the apps on Outlook imo.",
            "title_similarity": "0.8369434",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h463hes",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h464af0",
            "score": 1,
            "text": "What about security?\n\nOutlook - you can host your own exchange server.\n\nCan you host your own GMail server or do you have to give Google access to your data?",
            "title_similarity": "0.680601",
            "sentiment_compound": 0.4137
        },
        {
            "id": "h464eg4",
            "score": 3,
            "text": "I don't think you can say \"streets ahead\" with out paying some royalties",
            "title_similarity": "0.38789588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h464lyg",
            "score": 1,
            "text": "I hate gmail. You can't mass delete messages easily. Used it for more than 20 years.\nUsed outlook since it came out, It is much easier to work with.",
            "title_similarity": "0.56555897",
            "sentiment_compound": 0.128
        },
        {
            "id": "h464s13",
            "score": 1,
            "text": "Gmail is great for personal use but I’ll take Outlook any day for serious business applications. Gmail seems like a lite version of a bigger app that doesn’t exist.",
            "title_similarity": "0.8372516",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h465gu8",
            "score": 2,
            "text": "This should be in /r/unpopularopinion, not here because a lot of people are giving you legitimate reasons why large corporations are and **should** be using an Office suite and your response is \"that's not something I deal with, to each their own.\"\n\nSecurity alone is a massive reason why no large corporation that handles confidential information will/should ever use any external email client.",
            "title_similarity": "0.6519456",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h466ncd",
            "score": 2,
            "text": "They seem similar to me now to be honest.",
            "title_similarity": "0.3332399",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h466off",
            "score": 9,
            "text": "Streets ahead is verbal wildfire",
            "title_similarity": "0.1631029",
            "sentiment_compound": 0.0
        },
        {
            "id": "h466vdq",
            "score": 1,
            "text": "I like that I get push notifications when a bill is due if it arrived in my email. The problem is it tells you the day before, so if you forgot to pay it you can't pay on time. Tried searching for a setting to make it remind me a week early, but search results just have people trying to turn the feature off. Ugh.",
            "title_similarity": "0.66386706",
            "sentiment_compound": -0.593
        },
        {
            "id": "h468016",
            "score": 3,
            "text": "If you have to ask what streets ahead means your streets behind",
            "title_similarity": "0.30204922",
            "sentiment_compound": 0.0
        },
        {
            "id": "h468252",
            "score": 18,
            "text": "Pierce stop trying to coin the phrase \"streets ahead\"",
            "title_similarity": "0.33410302",
            "sentiment_compound": -0.296
        },
        {
            "id": "h469yws",
            "score": 2,
            "text": "streets ahead huh",
            "title_similarity": "0.22859533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h46bi6y",
            "score": 7,
            "text": "Streets Ahead! It’s catching on like verbal wildfire!",
            "title_similarity": "0.19553563",
            "sentiment_compound": 0.4738
        },
        {
            "id": "h46bjm4",
            "score": 2,
            "text": "It doesn't really matter that much at the end of the day, most people use the email they get first, So I can see why Microsoft wouldn't invest much money into the development of Outlook.\n\nOkay now that I've officially added to the conversation in a meaningful manner not breaking any of the rules of the sub-reddit.\n\n**Did you use the phrase streets ahead like it's a normal thing people say or do you just implant a really subtle Community reference??**",
            "title_similarity": "0.78381366",
            "sentiment_compound": 0.6974
        },
        {
            "id": "h46c2oc",
            "score": 2,
            "text": "\"stop trying to coin the phrase 'streets ahead'\" - some sitcom I remember this phrase from.",
            "title_similarity": "0.3854181",
            "sentiment_compound": -0.296
        },
        {
            "id": "h46f117",
            "score": 1,
            "text": "My dentist uses outlook, my email confirmation will allow me to seamlessly add the appointment to my… outlook calendar, but forget any compatibility with Google or Apple.",
            "title_similarity": "0.7623936",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h46f19t",
            "score": 1,
            "text": "In this thread: a whole bunch of people that have probably never worked in the corporate world, receiving and handling 500+ emails per day, commenting on how Google mail is sooo much better than MS. \n\nGmail is not viable in an enterprise environment. The only people that will disagree do not work in the enterprise environment.",
            "title_similarity": "0.5965704",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h46f5i8",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h46hbso",
            "score": 1,
            "text": "[r/unexpectedcommunity](https://www.reddit.com/r/UnexpectedCommunity/)",
            "title_similarity": "0.31340045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h46i1pw",
            "score": 1,
            "text": "the spambutton is shit",
            "title_similarity": "0.1156481",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h46i8gc",
            "score": 1,
            "text": "I've used Outlook everyday for the last 20 years, and Gmail for about 15 years, Gmail isn't even close.  From Encryption to interoperability with the Office suite, it's not even close.",
            "title_similarity": "0.5097904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h46ik3j",
            "score": 4,
            "text": "Pierce Hawthorne is that you?",
            "title_similarity": "0.11361337",
            "sentiment_compound": 0.0
        },
        {
            "id": "h46ilqz",
            "score": 1,
            "text": "I don't think he meant forwarding.  He had a new email cooked up separately, likely not at all related to the other email Hillsong the attachment. I love Gmail for work but I can see that being a problem. \nI also think the search grievance is interesting. Gmail has more powerful search but it doesn't make it easy or obvious to do certain things quickly. Instead it relies on the user typing in weird tag commands and operators to do simple things that should have pre-canned buttons.",
            "title_similarity": "0.7393217",
            "sentiment_compound": 0.1731
        },
        {
            "id": "h46iwo1",
            "score": 3,
            "text": "I've worked in tech support for SaaS companies for over a decade now and Outlook has so many bugs.\nMy favorite is that, at random, Outlook will throw a random punctuation mark into the HTML of the received email. Sometimes it's in a URL and just breaks the link completely.\n\nBut we find this because a guy got a ! right in his signature\n\nJohn Smith\nAss! istant Director",
            "title_similarity": "0.5990044",
            "sentiment_compound": -0.5399
        },
        {
            "id": "h46l5f8",
            "score": 1,
            "text": "I hate that gmail doesn’t let me sort by sender.",
            "title_similarity": "0.41213113",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h46lbvl",
            "score": 1,
            "text": "It's not used by anyone that's worried about encryption and end-to-end security. Want to risk losing your IP? Go ahead, send it via gmail.",
            "title_similarity": "0.5457838",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h46lzqt",
            "score": 1,
            "text": "Gmail cannot sort mail by sender and that really sucks",
            "title_similarity": "0.2894153",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h46m6pi",
            "score": 3,
            "text": " Pierce, stop trying to coin the phrase “streets ahead”",
            "title_similarity": "0.2826578",
            "sentiment_compound": -0.296
        },
        {
            "id": "h46n3o9",
            "score": 1,
            "text": "Efficiency, which is a key metric for measuring productivity. I’ve used Microsoft Office apps for more than 20 years, so I’m accustomed to navigating using keystrokes. Web-based software slows me down because many keystrokes will invoke a browser function rather than something within an application. Plus, there is no comparison between the calendar in Outlook and Google Calendar for managing schedules within a complex organization.",
            "title_similarity": "0.74133193",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h46o12w",
            "score": 3,
            "text": "And if you dont think so, you're streets behind",
            "title_similarity": "0.2190679",
            "sentiment_compound": 0.0
        },
        {
            "id": "h46owl7",
            "score": 1,
            "text": "Outlook mobile is superior to Gmail mobile on iOS imho... Speed/look/readability/function",
            "title_similarity": "0.7014234",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h46ps0j",
            "score": 1,
            "text": "compare their spam filters and then see which one is better",
            "title_similarity": "0.45930833",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h46qoe6",
            "score": 1,
            "text": "From my understanding, Gmail uses the same storage for other Google related services (Drive etc) which eats into your storage.\n\nI remember that at one point I didn't have enough storage to receive an email which I thought was beyond stupid. Never had that issue with Outlook",
            "title_similarity": "0.70691365",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h46r7a0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.018584382"
        },
        {
            "id": "h46rg8m",
            "score": 1,
            "text": "I will preface this by saying I am not a tech, nor do I use Gmail for businesses. I find outlook to be better largely because it integrates with the Microsoft app universe, including things like Power BI, the 365 Office suite, Dynamics 365, etc. Power Automate likes Outlook because it's part of the Microsoft 'verse, and Power Automate is an incredibly useful tool for smashing small bits of work out. I'll admit that Power Automate itself is a bit clunky, but it's great for automating customer-focused businesses. For instance, if you have a properly formatted Flow, you could automate new leads for customers by automatically extracting customer details from an email, putting them straight into Dynamics 365, and then automatically sending them an email letting them know you'll get back to them. I don't think Gmail has an equivalent level of capability purely because it's not inherently part of the Microsoft 'verse.",
            "title_similarity": "0.8455515",
            "sentiment_compound": 0.9468
        },
        {
            "id": "h46rjd3",
            "score": 1,
            "text": "I actually prefer the full desktop Outlook client to almost anything.\n\nMobile Outlook and the associated calendar are unusable tire fires.",
            "title_similarity": "0.61319786",
            "sentiment_compound": 0.0
        },
        {
            "id": "h46tflp",
            "score": 5,
            "text": "Your use of the phrase \"streets ahead\" is pretty streets ahead.",
            "title_similarity": "0.4593047",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h46tw6g",
            "score": 1,
            "text": "For simple email and calendar uses. Sure. But you mentioned the word \"corporate environment\". Outlook is far better.",
            "title_similarity": "0.79247224",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h46wj3s",
            "score": 3,
            "text": "Outlook is definitely streets behind",
            "title_similarity": "0.20707633",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h46wofx",
            "score": 1,
            "text": "I use gmail and outlook regularly.  I prefer outlook because gmail is just annoying to use for me and I don't really know why.  I'm only talking about web mail, think the outlook app you have to pay for is pretty shit.  I think it's entirely down to personal preference tbh.  They both pretty much accomplish the same thing.  \n\n(I do work in IT)",
            "title_similarity": "0.69879436",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h46y8tx",
            "score": 1,
            "text": "I use whatever the team uses. I don't care what suite we use, I am confident in learning tools. What I don't like is having a whole project being held back by legacy software that is no longer supported.",
            "title_similarity": "0.6936015",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h46yvrm",
            "score": 1,
            "text": "Was on Gmail for work - then we got switched to outlook … total disaster. I will say outlook online is 1mil times better than the app, it’s search functionality mirrors gmail. \n\nI didn’t really cyv",
            "title_similarity": "0.7070804",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h46z55f",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.01858439"
        },
        {
            "id": "h46z7sq",
            "score": 1,
            "text": "What specifically do you think makes it better? I prefer outlook because it syncs the calendar and email on my phone easily and for scheduling meetings I can see everyone’s availability easily as well.",
            "title_similarity": "0.7641438",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h470kzv",
            "score": 1,
            "text": "Try deleting an email and closing the tab the moment you click on delete on Gmail.\n\nIt's shit. Having using Outlook for 10+ years, it's only got better with functions like Snooze, Sweep, Doc preview, In email doc edits etc.",
            "title_similarity": "0.6412145",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h471u3k",
            "score": 2,
            "text": "I'm more inclined to outlook and Microsoft ecosystem because I've been using word excel and PowerPoint through my hole life, i know where are the tools and got  much experience with it. I prefer outlook folder kind of organizing rather than gsuite tags. But it's a personal preference (like having your personal knife for cooking)\n\nI use gsuite in some cases at work (have 1 outlook email and 1 Gmail) and is really good, u can do pretty much all you can do with office 365 but it's tales time to get used to as a power office 365 user.\n\nLuckily I am a fast learner and I can get used to any tool with time.",
            "title_similarity": "0.80847013",
            "sentiment_compound": 0.9601
        },
        {
            "id": "h4723el",
            "score": 3,
            "text": "I get points for using Bing and use those points for REI gifts at holidays. That is the only reason I use Microsoft Outlook/Bing.",
            "title_similarity": "0.66007143",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h472k92",
            "score": 1,
            "text": "No, it’s not.",
            "title_similarity": "-0.035083823",
            "sentiment_compound": 0.0
        },
        {
            "id": "h473nud",
            "score": 1,
            "text": "I just hate Microsoft edge",
            "title_similarity": "0.25970888",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h473pcu",
            "score": 1,
            "text": "I dunno..I personally love Outlook and onenote...",
            "title_similarity": "0.41005376",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h476vij",
            "score": 2,
            "text": "Unless you do get into the nitty gritty of how you’re weighting specific features, how can we really change your view since it’s based very vaguely on how you feel?",
            "title_similarity": "0.35708398",
            "sentiment_compound": 0.0
        },
        {
            "id": "h476vr2",
            "score": 1,
            "text": "I work in insurance. The main thing I want is more ability to back up emails and share them around, as well as better long term organisation of emails.\n\n\nIn terms of user friendliness, off the top of my head I find Outlook superior for the following features I can't do in Gmail without additional add-ons:\n\n-Mail merging (for firing off multiple but personalised emails)\n-Editable email templates (for repeated content)\n-Archive organisation (for \"just in case\" usage you don't want deleted in any inbox purges)\n-Multiple inbox organisation on desktop: I prefer Outlook's ability to highlight specific inboxes and their unread messages in one page \n\nAnd the following more clunky in Gmail:\n-Saving email or email chains to file: in Outlook this is a drag and drop feature. I can't backup said email to my own drive, for example.\n\n\n-Opening a saved email from file: You need your own desktop email application to open a .eml file, unless you're saving those emails in PDF form via \"print to PDF\".\n\n\n-Forwarding multiple emails to a third party -again, drag and droppable in outlook, vs saving the emails as individual files which needs to be uploaded to a new email to be viewed in a desktop email application. I can't conveniently send in a single email \"Hi, all these enquires came in for you in the last hour\" or \"Per previous conversations with x y z,(attached)\" etc.",
            "title_similarity": "0.7966623",
            "sentiment_compound": 0.9276
        },
        {
            "id": "h47clj9",
            "score": 2,
            "text": "Street ahead lol",
            "title_similarity": "0.22145796",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h47iohc",
            "score": 3,
            "text": "I see streets ahead and all I can think of is Pierce Hawthorne",
            "title_similarity": "0.344083",
            "sentiment_compound": 0.0
        },
        {
            "id": "h47lagw",
            "score": 2,
            "text": "Google's gmail search is light years ahead of Outlook's search. I've literally typed in the exact name of the person who sent an email and gotten no results, so I have to scroll manually through 6 months of emails to find what I need.\n\nOutlook Searching and Apple's Siri deserve a special place in hell",
            "title_similarity": "0.6491729",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h47n6lk",
            "score": 1,
            "text": "I’m a student, and we have the choice of either because in outlook you can link Gmail in. I must say after having used it (because I switched from a Mac to PC) the ability to schedule Emails and to delete them as well after sending has been a godsend. Sometimes I’ll look for a doc and after an hour can’t find it so I’ll shoot a teacher an email and then find it and so I’ll just delete the email and never look clueless!",
            "title_similarity": "0.7062067",
            "sentiment_compound": 0.786
        },
        {
            "id": "h47ncte",
            "score": 1,
            "text": "I am glad you have found your evil mega corp of choice :)",
            "title_similarity": "0.46968332",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h47pnul",
            "score": 2,
            "text": "I won't chance your mind because you're absolutely right.\nGmail is so good that even my technologically hopeless boomer dad can navigate it without any help.",
            "title_similarity": "0.66347116",
            "sentiment_compound": -0.3086
        },
        {
            "id": "h47w7os",
            "score": 1,
            "text": "Mail merge",
            "title_similarity": "0.21376106",
            "sentiment_compound": 0.0
        },
        {
            "id": "h47xan1",
            "score": 1,
            "text": "I have not found this feature on gmail so if someone knows if it exists, let me know but on outlook you’re able to resend/recall/replace emails in case you sent it to the wrong person or if it bounced or need to bump it up or add an attachment you forgot or whatever else. i know gmail has the feature to undo a sent message within 30 seconds or something but haven’t seen this particular feature on google.",
            "title_similarity": "0.652516",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h4b9i2c",
            "score": 1,
            "text": "I’ve worked in consulting for over 20 years, and MS is the standard for all of our client work and correspondence.  I have never had a Google doc sent to me from either a client or colleague, with the exception of recruiting (i.e., candidates are more likely to use a Gmail).\n\nI use Gmail / Google apps for my personal stuff and it’s nowhere near as user friendly or functional IMO… perhaps I’m simply an old dog struggling to learn new tricks, but I’ve yet to find a single advantage that Google holds over MS.",
            "title_similarity": "0.6380893",
            "sentiment_compound": 0.3506
        },
        {
            "id": "h4bcm1y",
            "score": 1,
            "text": "The Microsoft Office suite has been the gold standard for the business world for decades now.\n\nThe fact that Gmail has even created a program that can compete in that space with a juggernaut is huge. For most offices I am sure Gmail would be more than sufficient for day to day use.\n\nBut also consider older less tech savvy folks that learned Office and Outlook decades ago. How much of a task would it be to teach them a entirely new ecosystem that at this time isn’t as developed as Microsoft.\n\nHowever, as these people exit the workforce and Gsuite is further developed I can see it easily becoming more of a competitive battle. How many kids are growing up using google applications in the classroom for assignments. When they enter the workforce what do you think they are going to choose?\n\nFor right now Office is still the dominant choice but I do not see their reign lasting another decade.",
            "title_similarity": "0.74867857",
            "sentiment_compound": 0.718
        },
        {
            "id": "h4nnq3f",
            "score": 1,
            "text": "Outlook on the Web or Outlook Desktop?",
            "title_similarity": "0.46322733",
            "sentiment_compound": 0.0
        },
        {
            "id": "himz5yf",
            "score": 1,
            "text": "To sum up: Microsoft 365 vs Google Workspace is like KDE vs Gnome, both have its users and fans.",
            "title_similarity": "0.7346544",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmg98h8",
            "score": 1,
            "text": "Gmail is a breath of fresh air. Sure, outlook is feature packed but it's very clunky and is riddled with bugs, most of which prevent you from doing the most simplest of tasks. I.e. being able to reliably check your email. With outlook you will regular be dealing with mail server synchronisation errors, corrupt local storage folders and sometimes emails will just not get through at all due to unknown errors.\n\nGoogle is 100% cloud based and works all the time and perfectly.\n\nThe only reason you might hang on to Microsoft is for Word and Excel. But Google sheets and Docs provides basic functionality. \n\nI'd recommend opting for the paid Google suite, it removes the ads, gives you double the space plus you can also create additional users and use your own  .com domain.\n\nI'm currently looking to see if Google sheets and docs will allow us to do all the admin tasks we need. If it can, I'll be ditching office 365.",
            "title_similarity": "0.7259588",
            "sentiment_compound": 0.9403
        }
    ]
}