{
    "CMV: Obtaining a College Degree today is an investment with no guarantee of return\nI'm a 22yr old college student who serves full-time in a restaurant to afford my education. College education used to be an investment where you'd see a return in the form of a job/career. I think qualifications for private sector careers are drastically changing. \n\nI read a tweet this morning regarding how Addison Rae had been hired and fired for becoming a UFC correspondent. I can't imagine the hundreds if not thousands of other applicants who studied years to get into a position like that. To go even further, the Tik-Tok influencer shared a bitter statement on twitter saying that she studied hard for three months to get that position. \n\nThree months??? Are you kidding me?!\n\nThat's not even a full semester of college. Plus, this 20-year old girl already has a generated net worth of 2 million. It proves to show that landing the career you want is a who-you-know game, rather than what-you-know. I'm happy to see another young kid becoming successful, but seeing news like this makes me feel like obtaining certain careers are impossible. If qualifications for careers aren't based on a defined set of knowledge, than what is my degree really going towards?\n\nEdit 1: \nI just wanted to say thank you all for the input. This was my first reddit post that generated a large reddit-community conversation and who would've thought it was made while sitting on the toilet waking up this morning. \n\nAfter reviewing a lot of comments, I found an abundance of insightful information on why college is still relevant today. While I still feel that college holds less value than it once did, it still gives us important knowledge and networking options. When I pay too much attention to social media outlets, it tends to blur the line on how I perceive the definition of success. With that being said, I think success is truly up to ourselves regardless of a college degree or social media clout.": [
        {
            "id": "h4tsz43",
            "score": 1,
            "text": "/u/rythaguy_uno_y (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/oi8qs5/deltas_awarded_in_cmv_obtaining_a_college_degree/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.53499633",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h4tdmv8",
            "score": 52,
            "text": "The return is education. I feel sorry for USA and another countries where have to be  the return something another :/ College should be for personal grow, not, at least just, for getting a good job.\n\nEDIT: OK, I think I hinted that enough but I KNOW the situation in USA and the situation is wrong, that is reason for the note that I feel sorry for USA. Education should be free.",
            "title_similarity": "0.54191583",
            "sentiment_compound": -0.0129
        },
        {
            "id": "h4tp386",
            "score": 0,
            "text": "You can always travel to France, Germany & some other countries and get education almost for free. All you need is money for living expenses.\nI know some people from ex-USSR countries that would come to US to do odd jobs for the summer, get around ~$10k and use it to for living and studying for the rest of the year in Europe.\nIt depends on your interests, obviously some careers require local education and certification(law, medicine & etc).",
            "title_similarity": "0.6897428",
            "sentiment_compound": 0.4062
        },
        {
            "id": "h4to800",
            "score": 74,
            "text": "I hate this framing that the value of education is to better your position in capitalism. College is the only time in adult life when people have a chance to step out of the rat race and focus their energies on understanding how the world works. \n\nThe world would be better off if more Americans had collegiate skills like media literacy, research methods, or even just a basic understanding of the scientific method. \n\nIt's through the graduate-level research in college that a huge portion of the advances we have in technology, philosophy, medicine, etc. \n\nI don't disagree that college is overpriced. I don't disagree that it's ridiculous that so many jobs ask for a college degree. But I think your framing of the college experience as a career program is letting their assumptions slip by you. College makes you a better person and prepares you for the world. I wouldn't trade my college experience for anything. And I feel sorry for people who didn't get that opportunity, regardless of their careers.",
            "title_similarity": "0.7464369",
            "sentiment_compound": 0.7533
        },
        {
            "id": "h4tox10",
            "score": 1,
            "text": "Some college degrees are personal enrichment degrees that's ok, however they're not gonna do anything other than get you a pat on the back. Colleges need to drop certain majors and turn them into minors. Art majors, you have no job. English majors you have no job. Computer science majors, easy to get a job. Biology majors ex to get a job. Chemistry majors ex to get a job. Engineers easy to get a job. Your major determines how easy or hard it is for you to get a job. A college degree isn't the issue what you major in is the issue.",
            "title_similarity": "0.6818092",
            "sentiment_compound": 0.6326
        },
        {
            "id": "h4tok3u",
            "score": 4,
            "text": "\"It proves to show that landing the career you want is a who-you-know game, rather than what-you-know.\"\n\nThis all day.\n\nHowever, that is how most jobs happen (who you know), but for those jobs where you DON'T know someone? Absolutely a BA/BS/Degree is the ONLY way into the door. If you don't have one, you aren't even admitted to TRY for the job.",
            "title_similarity": "0.71140194",
            "sentiment_compound": -0.0757
        },
        {
            "id": "h4trpnz",
            "score": 0,
            "text": "College is a scam at this point, outside of having a job pay for your education that will directly lead to a promotion and more pay. Otherwise, no one should attend college, the crippling debt related to it and the abysmal job market that thinks entry level should require 2-5 years experience and pay $15/hr make it a lose-lose situation. There’s absolutely no reason to attend college and I hope more people are waking up to that fact",
            "title_similarity": "0.78451324",
            "sentiment_compound": -0.8674
        },
        {
            "id": "h4tu8uc",
            "score": 0,
            "text": "It just depends on the degree. Becoming and RN or an Engineer well you need a degree. Want to start a business? Maybe you would be better off taking the 80,000 dollars you were gonna spend on classes and start a dry cleaners. I am sure you would business pretty quick doing that as well.",
            "title_similarity": "0.7714867",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h4u7023",
            "score": 0,
            "text": "the world has generated an oversupply of academic universitaries (out of post wwii people frustration with lack of education) the market is not demanding them, if you want to have a nice life become a skilled worker in something heavily needed and well paid, live an ordered life and make sure you work for yourself as an independent... the state will fry you with taxes, but it is still eons better than being the money-making-monkey-employee (also very taxed) of people always too ready to remind you how well they made it with lower qualifications and never thanking you for making them rich",
            "title_similarity": "0.70411956",
            "sentiment_compound": 0.9291
        },
        {
            "id": "h4u70dk",
            "score": 0,
            "text": "the world has generated an oversupply of academic universitaries (out of post wwii people frustration with lack of education) the market is not demanding them, if you want to have a nice life become a skilled worker in something heavily needed and well paid, live an ordered life and make sure you work for yourself as an independent... the state will fry you with taxes, but it is still eons better than being the money-making-monkey-employee (also very taxed) of people always too ready to remind you how well they made it with lower qualifications and never thanking you for making them rich",
            "title_similarity": "0.70411956",
            "sentiment_compound": 0.9291
        },
        {
            "id": "h4u8f6d",
            "score": 0,
            "text": "Nah fam, you got lied to over and over and over again by capital about what college was for, and so now through no fault of your own you've arrived at crunching the numbers and finding that they don't add up.\n\nIt's *not job training* and it's *not an investment on which you expect a fiduciary return*, it's an experience that will turn you into a bigger, better person.  Forever.  Even if it never gets you a single job, which is frankly an unlikely case!",
            "title_similarity": "0.7073425",
            "sentiment_compound": 0.4046
        },
        {
            "id": "h4tp3sq",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.07026405"
        },
        {
            "id": "h4tscl8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07026405"
        },
        {
            "id": "h4torzb",
            "score": 8,
            "text": "Generally, no - as long as you pick a field that people are willing to pay for, your odds of success improve *vastly* over those with no degree.  I'm talking about STEM fields, IT, medicine, that sort of thing, not stupid shit like underwater basket weaving with a minor in 14th century French poetry.\n\nFor the *specific* example you've given here, sports commentator, I've never heard of her and know literally nothing about her, but based on that alone I can guarantee you she was chosen because of her looks and nothing else.",
            "title_similarity": "0.6051674",
            "sentiment_compound": 0.4931
        },
        {
            "id": "h4tqe4r",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.024029333"
        },
        {
            "id": "h4u3kjf",
            "score": 5,
            "text": "I'm going to chime in here, as a philosophy major, and dispute a major premise in your post which seems to be going unnoticed by most in the comments: that a college degree is an investment that should have a *financial* ROI. This language and framing of higher-education as \"career investment\" has become increasinly common in the US, and other places, in the past 50 years, and it is one of the major reasons that schools in the US are able to price gouge the shit out their populace. I was recently looking at an admissions website that compared financing higher-education with buying a house, as one of the \"major financial committments\" of one's life. From this perspective, given the mountains of debt implied therein, people are forced to weight the value of the degree in dollars and cents, which, obviously takes the form of career expectations etc. What I want to call attention to is that your (and much of the world's) framing of college as purely *financial* investment fails to take into account other forms of value produced by attending a college program, such as critical thinking, communication skills, tangential knowlege, socialization with other intelligent and interested people. \n\nOur world's problems, and thus the major *problem spaces* are becoming increasinly interdisciplinary and I believe this is also the case for high-paying career opportunities. Often employers are looking for people with strong communication and flexible thinking, all of which are the intangible \"ROIS\" of good higher education. Unlike a trade school, they don't follow a linear \"degree to job\" logic, but this non-linearity is actually a positve feature in training people for an increasingly complex world. A couple final points: First, this does not mean that *everyone* should go to university. The world needs all sorts of people with all sorts of education. Second, much of the anxiety about the \"value\" of a university degree, particularly humanities degree, is because of the lack of direct job opportunities. I think it's likely that this is deeply aggravated by the price-gouging mentioned earlier. Learning to think is nice, but its not as nice as not being in hundreds of thousands of dollars of debt. This is why places like Germany, where higher-education is free to most citizens, is an importan sanity check for the way the US treats higher education. \n\n\\*I treated this post as coming from a US context, given the references to UFC and Addison Rae, but I think this argument applies anywhere that people are forced to choose between higher-education and financial distress.",
            "title_similarity": "0.77452874",
            "sentiment_compound": -0.8614
        },
        {
            "id": "h4tqrwb",
            "score": 36,
            "text": "In a broad sense, you're correct because all investments have no guaranteed return.  For example, even the safest US Treasury Bond would be worthless given the .0001% chance that a meteor large enough to end all human life could strike within the next year.\n\nBut in a more real sense, you're very wrong.  [The US Bureau of Labor Statistics (BLS)](https://www.bls.gov/careeroutlook/2018/data-on-display/education-pays.htm) studies these kinds of things.  A person with a High School Degree makes more on average than one without.  A person who attended some college but never graduated makes more than one who didn't go to college at all.  A person with a college degree makes more than dropouts.  A person with a Master's makes more than someone with a Bachelor's.  A person with a Professional degree or Doctoral degree makes more than a Master's.\n\n[On average, a person with a Bachelor's degree makes $24K more per year](https://www.indeed.com/career-advice/pay-salary/average-salary-with-college-degree-vs-without) than someone who was only a HS graduate.\n\n|Age|HS Diploma Cumulative Earnings|Bach. Degree Cum. Earnings|\n|:-|:-|:-|\n|18|$37K|\\-$10K|\n|19|$74K|\\-$20K|\n|20|$111K|\\-$30K|\n|21|$148K|\\-$40K|\n|22|$185K|$20K|\n|23|$222K|$80K|\n|24|$259K|$140K|\n|25|$296K|$200K|\n|26|$333K|$260K|\n|27|$370K|$320K|\n|28|$407K|$380K|\n|29|$444K|$440K|\n|30|$481K|**$500K**|\n|31-65|$34K/year|$60K/year|\n\nSo on average, yes.  There's a clear return on investment for these degrees.",
            "title_similarity": "0.67356014",
            "sentiment_compound": 0.4031
        },
        {
            "id": "h4tfb0i",
            "score": 1161,
            "text": "People don't study for years to become a UFC Correspondent, and there is no college major named UFC Correspondent Studies. Your argument is based on a college degree. The college degree for this would be journalism, and if your journalism degree doesn't get you into the UFC, then you have thousands of other jobs you can explore with your degree.\n\nNext, you're basing your argument on a bad example. UFC is for famous people and it's on TV. No matter what you're degree is, no matter who you are, the odds of you becoming famous and being on TV is less than 1%. So you can't argue that college degrees are useless because they won't get you on TV. \n\nNext, I can tell you don't like influencers that gain money by basically doing nothing. I think you're giving influencers more credit than is due. This world has 8 billion people on it, and most people can only name a handful of influencers. In the social media age, it's easy to believe that all you have to do to get rich is do stupid shit on camera. That is not the case. A lot of social media influencers aren't actually rich; they use rentals and take pictures with things they do not own to project the image of wealth. So you think all these influencers are rich as fuck, when only 0.01% of them are. Of course there are millionaires like Addison Rae and Logan Paul, but they are outliers. It is not common, probably as rare as winning the lottery. \n\nWhat you are correct about is that certain careers are all about who you know. Anything that will land you in the public spot light is most likely a who-you-know career. But that doesn't make college degrees worthless. Just because I can't get a degree to become a world famous rapper doesn't mean degrees are worthless. \n\nYou are using the most rare outliers, famous people, to argue against something that the average person needs. College degrees are for the average person, not the rare cases. Addison Rae isn't going to get hired to be an accountant for a big company. Logan Paul can't magically become a Dentist. James Charles will never be an architect or a nuclear engineer.",
            "title_similarity": "0.8618524",
            "sentiment_compound": -0.7465
        },
        {
            "id": "h4teja0",
            "score": 42,
            "text": "[deleted]",
            "title_similarity": "-0.024029333"
        },
        {
            "id": "h4tq55u",
            "score": 33,
            "text": "Saying a college degree is far too broad a statement in this context.\n\nWhile I think you are right in SOME faculties/specific degrees, this does not hold true for everything.\n\nExample:\nI am an engineering major currently, I have been on inter ship for a year and will go back to finish my engineering degree this year. I have 1-2 places that have expressed interest in me working there immediately after graduation. This is not uncommon (at least among my friends in engineering).\n\nHowever if you get a bachelor of arts and humanities (this isn't STEM bashing arts so calm down), that doesn't (at least to my knowledge) give you a specific advantage in a field of employment or business. You may struggle to attract employers and earn a return on your investment.\n\nThe same can be said with something like an MBA because they are becoming so common place and realistically most entry level jobs don't require one to do the job.",
            "title_similarity": "0.76834583",
            "sentiment_compound": 0.8875
        },
        {
            "id": "h4tjp3v",
            "score": 27,
            "text": "Your title and your post seem to be about two different things entirely. How does one celebrity using high-up connections to land a gig prove that *across the board*, a college degree isn't a good investment?",
            "title_similarity": "0.6583984",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h4tfj1l",
            "score": 418,
            "text": "Any kind of investment, at any point in time, has no guarantee of return. In other words, all investments carries risks. Education is no different.\n\n> It proves to show that landing the career you want is a who-you-know game, rather than what-you-know.\n\nReally kinda depends on the career. Many career needs certifications. You can't become a doctor, an engineer, an lawyer, an accountant, electricians, plumber, etc2, without knowing what you know.\n\nOf course, knowing the right people also helps a lot, and education is no substitute for that.\n\nAnd depending on the jobs, if you want to be an actor or model for examples, stuff like your looks, or your height, also matters. If you want to be athlete, your genetics kinda matters a lot.\n\nMy whole point, is you are presenting a binary view of who-you-know vs what-you-know. Instead, there are many ways that leads to a job, and it is not one or the other, but multiple stuff working together. And depending on the job, education might matters more or less.",
            "title_similarity": "0.6460338",
            "sentiment_compound": -0.0043
        },
        {
            "id": "h4tfeum",
            "score": 211,
            "text": "Don't go by hearsay and individual paths, just look at the stats. E.g. https://www.statista.com/statistics/233301/median-household-income-in-the-united-states-by-education/\n\nOf course some people will become rich/wise/whatever without higher education, but the vast majority will not. How lucky/confident do you feel?",
            "title_similarity": "0.5857561",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4tek15",
            "score": 18,
            "text": "I mean this seems to depend on what you calculating as a return. The return would be an education and increased chance of receiving a high-paying job, as well as more societal respect.",
            "title_similarity": "0.37690735",
            "sentiment_compound": 0.8214
        },
        {
            "id": "h4tffbd",
            "score": 13,
            "text": "A college degree is just one tool in your toolkit. A very important one of course, but just one. All those years of education will get you your first job, but you will need to show you are special to differentiate yourself from the hundreds of others who want to \"land the career you want\". So don't treat the degree as an entitlement to a career, but one step on the ladder to your goal",
            "title_similarity": "0.7567731",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h4tpz2i",
            "score": 5,
            "text": "Truth is you knew how much you were going to get paid.  It’s no guarantee but statistics and odds are important factors to consider.  For example studying linguistics and getting an MA in it can be quite lucrative, but only for the upper 1%-5% of students from reputable universities.  Meanwhile, studying in the STEM fields leads to a much higher percentage (maybe around 2/3) of having a job lined up before graduation or soon thereafter, even for extremely average or below average students (C’s get degrees). \n\nSo in short, you’re correct there is not guarantee of success but the odds very greatly based on pursuit of degree, level of performance, and work ethic.",
            "title_similarity": "0.7047821",
            "sentiment_compound": -0.5613
        },
        {
            "id": "h4tqack",
            "score": 1,
            "text": "I guess your statement is limited to the US only. Because I can't work as a teacher in my country without a degree.",
            "title_similarity": "0.6360769",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h4tqqfe",
            "score": 1,
            "text": "It really does depend on the field you want to go in to. Remember that while people are of course rewarded in money for having a job, they are also rewarded mentally and emotionally for having the RIGHT job. Take me for instance. I could very easily go into videography and media and make quite a bit of money with no college required. However, I've aspired to work at NASA since I was a little kid, and as such, am willing to invest an obscene amount of resources into obtaining a bachelor's degree in engineering.\n\nNASA pays well for their research engineers, don't get me wrong. But the fulfillment of seeing a project I worked on go to space will be worth it all on its own.",
            "title_similarity": "0.67688096",
            "sentiment_compound": 0.7072
        },
        {
            "id": "h4tqyb9",
            "score": 5,
            "text": "No investment has a guaranteed return. The thing is, there are degrees which have less risk associated to them. If you get a degree in a very niche field, be prepared to take on that risk. The degree does not guarantee the job and in a niche field, it will be much more competitive. Now if you were to get a degree in a much more marketable skill (engineering, tech, stem, ect) there is much less risk in landing that job and having a successful career.\n\nThere is also value risk involved in education. A degree from a small affordable school \"usually\" (except for a few careers paths and a few elite schools, like law) Will have the same chance at landing jobs (don't over spend on your degree)\n\nHigh school students and early college students are not taught this. The are actually taught the opposite.  To \"shoot for the stars, get into the big name school. Have the college experience.\"\n\nIt also REALLY does help to know people and to be \"likeable\" when you start your career. Networking is huge \n\nBuilding a career is multifaceted and actually very complex. A degree is usually just step 1 of 100. (If a degree is even required at all)",
            "title_similarity": "0.5376407",
            "sentiment_compound": 0.8863
        },
        {
            "id": "h4tqz81",
            "score": 9,
            "text": "If you really want to see value in education and a ROI that is guaranteed, do STEM. Any engineering field will rake in a good income. Same with if you grind and become a doctor (or even just became an RN). Of course there is more risk in your job when you’re choosing majors that aren’t really in demand. I don’t know what major OP is, but it doesn’t sound like STEM, and typically non-STEM majors and not as highly sought after in the job market. Just how it is.\n\nOP also mentioned their brother having a business degree, which tbh is known for being a very basic degree as an undergrad. In college, it’s known as a party school degree. At larger colleges, maybe it’ll get you networking connections. But at a relatively unknown/low ranked college, you aren’t going to get many of that either.\n\nAt the end of the day, a degree for most jobs is a show of capability, showing you can do the work. It gets you in the door. However, based on the degree you hold, it can either get you in the door for maybe higher-paying slightly more specialized jobs, or it’ll maybe get you in the door for pretty ubiquitous, not necessarily super lucrative jobs. At a minimum, degrees offer a chance for networking and a minimum demonstration for capability to employers, both of which are invaluable to the job market.",
            "title_similarity": "0.7029748",
            "sentiment_compound": 0.8966
        },
        {
            "id": "h4tr71y",
            "score": 29,
            "text": "*No* investment has a *guarantee* of return. That's misunderstanding what \"investment\" means. \n\nHowever, a college education is one of the closest things we have to a guaranteed return. The mean (and median) salary of people with college degrees are *still* well above those with only a high school education. \n\nIf all you're saying is that there alternatives to a college degree for getting a good job, that of course is true. Trade schools and apprenticeships are also quite a good investment. \n\nIf all you're saying is that a college degree is not an absolute necessity to get a good job, that's *also* true. There are other ways that hard work and talent can lead to a good job.\n\nIf all you're saying is that some colleges and some degrees are worse investments than others, that's *also* definitely true. \n\nEducation degrees, for example, don't lead to a huge amount of profit, they lead to what some people consider to be a fulfilling and socially necessary career that they want and can't get any other way. But they still have positive return on investment over the long term. \n\nThe statistics are *very* clear: over your lifetime you will make considerably more with a college degree than without one, with very high probability. \n\n[This study by Georgetown University](https://1gyhoq479ufd3yna29x7ubjn-wpengine.netdna-ssl.com/wp-content/uploads/College_ROI.pdf) shows that *even the very worst accredited colleges* have a net-present value over 40 years *well* in excess of their cost. Which means they *do* have a positive ROI. \n\nIf all you're saying is that there are *other* better investments... \n\nSure, that's possible too, but only with much higher *risk*. Putting the same money you spend on college into an index fund might (for a few schools and some degrees) produce a higher return on investment... that is hard to predict, because the economy can be risky when looking at any particular decade compared to a career. \n\nBut the college degree very nearly *does* guarantee an eventual return on investment. \n\nThe few people that don't get a return are probably not going to do well with any *other* path. It requires quite a lot of fecklessness to not get any return on investment... and such people are relatively unlikely to actually *achieve* their college degree. People that wash out from college after spending a lot of money... mostly wasted that money.\n\nBut that's not your thesis.",
            "title_similarity": "0.66396326",
            "sentiment_compound": 0.9816
        },
        {
            "id": "h4traas",
            "score": 1,
            "text": "Just to point out the obvious - a college degree has never guaranteed a return on investment.",
            "title_similarity": "0.51542103",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4trb3r",
            "score": 1,
            "text": "No matter how you slice it, education seems to equate to a return on investment that is worth it. Maybe not in all situations for all individuals, but the overall numbers show that some college is better than none and having a degree is better than not. \n\nLong-term over a lifetime, this shows education is almost always worth it. \n\n>Bachelor’s degree holders will earn an average of $18,772 more each year than associate degree holders. Over the course of a 40-year career, this equates to more than $750,000 in additional income. \n\nhttps://www.northeastern.edu/bachelors-completion/news/average-salary-by-education-level/",
            "title_similarity": "0.65472436",
            "sentiment_compound": 0.8763
        },
        {
            "id": "h4tsqg5",
            "score": 2,
            "text": "It depends on your major. If you major in Drama, English Lit, Communications, well, that's just your parents money in the toilet. These are degrees that provide extension of a childhood for rich people's kids.\n\nIf you major in CompSci or Medicine,  top 10% of people with these degrees will be more successful than 99.9% of the people without a college degree.",
            "title_similarity": "0.6958345",
            "sentiment_compound": 0.8908
        },
        {
            "id": "h4tsvi9",
            "score": 15,
            "text": "Your entire stance is predicated upon survivorship bias. In other words, because x got a job without a college degree, college degree's are no longer needed. This is based on your field of vision and the jobs that you are focusing on. No doubt, if you are working in entertainment, a college degree is often not required. However, if you want to get a decent office job, the qualifications will require (in most instances) a college degree and if it does not require it having it will increase your chances drastically. \n\nSure there are downsides to going to college, but the stance that you are taking is not really discussing those downsides (debt and highjob competition despite achieving a certain educational level). However, economists have studied and answered the question that you have implicitly posed (is it worth it to go to college?). Many economists discuss how the *educational premium* in the US (and the rest of the world) is increasing. This means that having a degree will increase both your job opportunities and wages. This much is undeniable as it is an empirical fact. Of course there is no *guarantee of return*, but the kind of guarantee you are talking about pertains to everything .... For instance, there is no guarantee that I will lose weight if I got to the gym, however, if I go often enough, I will eventually lose weight. The likelyhood of that happening is very high even if that is not certain.",
            "title_similarity": "0.741659",
            "sentiment_compound": -0.6306
        },
        {
            "id": "h4tt485",
            "score": 6,
            "text": "Depends on your degree. Majoring in art definitely does not guarantee a good career after college, but majoring in something like engineering is much closer. \n\nAccording to this source, about 93% of engineering graduates get a job that either closely relates or somewhat relates to their major. \n\nhttps://ira.asee.org/survey-most-engineers-work-in-jobs-related-to-their-degree/\n\nNot guaranteed, but pretty damn close.",
            "title_similarity": "0.70358753",
            "sentiment_compound": -0.6079
        },
        {
            "id": "h4ttpd1",
            "score": 2,
            "text": "There are two issues here: the one in your title, and the one relating to the specific example you shared.\n\nCollege degrees do vary widely in how long it will take to pay back what they cost.  But as long as you pick something that has realistic job prospects for all graduates, you're generally okay.  Not everyone can get these super rare, coveted, competitive jobs.  If that's your benchmark for success, I think you're setting yourself up for disappointment.  Most people who major in journalism don't work for NYT, most people who program don't work at Google, etc.\n\nRegarding Addison Rae, who's to say she doesn't have the skills that are necessary for that kind of job?  It's not like that job requires a college degree, and surely there's some overlap in her skills and what that job needs.  Her reaction was probably tone-deaf, but nothing about this story indicates that college degrees are broadly a bad investment.",
            "title_similarity": "0.7560037",
            "sentiment_compound": 0.855
        },
        {
            "id": "h4ttro2",
            "score": 2,
            "text": "these are outliers that don’t really have anything to do with the usefulness of a college degree. Yes, anyone can luck out and become famous. No, this does not make a college degree a worthless investment because most people are not willing to rely on that kind of luck.\n\nAny influencer/famous person who says they trained for the position is lying to your fucking face. It is all luck and natural charisma, in the same way that becoming a famous athlete is all about luck and natural athleticism, and becoming a famous singer is all about luck and natural talent. These outliers do not undermine the value of education/training for people who lack these natural abilities.",
            "title_similarity": "0.6372031",
            "sentiment_compound": 0.9707
        },
        {
            "id": "h4ttsu8",
            "score": 1,
            "text": "I think you need to add a qualifier that this only applies to the us (I assume that's where you're from) other counties it's far cheaper or free. Even the uk which has got more expensive you only pay back your loans slowly and if not repaid something like 20 years or so after you graduate it is written off, even if nothing's repaid.",
            "title_similarity": "0.6415022",
            "sentiment_compound": 0.1999
        },
        {
            "id": "h4tty0w",
            "score": 1,
            "text": "There is one thing that I didn't mention in my previous response. After I got my Masters and looked back at what I had really gained after all those years in good schools, it dawned on me that it was never about specific knowledge, but more about two things:\n- Learning how to learn. Mostly critical thinking skills, but not only, I can discover possible  answers to questions much faster than peers with lower quality formal education.\n- Problem solving skills. Perhaps this was because my degrees were in STEM.\n\nThese are skills that you can definitely gain on your own as well, but only if you are very dedicated and constantly challenge yourself. Their applicability is much wider than just money making. In general, they make you a more stable, reliable individual.",
            "title_similarity": "0.64968693",
            "sentiment_compound": 0.9487
        },
        {
            "id": "h4tuau9",
            "score": 1,
            "text": "It is absolutely a what you know scenario forst, and who tou know helps you skip some steps. However, you can get the same knowledge and training for what amounts to $1.25 in late fees at the public library, and a broadband connection. What it does take is belief in yourself, drive, and ambition. School is essentially buying drive and ambition at super high costs, because you are buying into a competitive environment that fosters intense competition. If you know your field and obsess over it already, thats what it should take to get into the room. Sometimes there is a school requirement barrier for positions, so go south of them and work your way up. School can be a very costly distraction.",
            "title_similarity": "0.6711644",
            "sentiment_compound": 0.3461
        },
        {
            "id": "h4tubem",
            "score": 1,
            "text": "'Guarantee' is a bit of a stretch (we all know there are no guarantees in this world), but I take your point that the prosperity and security expected is not as rosy as it's sometimes portrayed to be. At the same time, come on, I've been hearing scattered anecdotes about the proverbial jobless art student with 100k in debt for at least 20 years. That the job market can be challenging for some degrees is no secret and should not be a surprise to anyone paying any attention at all.\n\nSo I think the position outlined in the OP needs to be strongly qualified by considering WHAT KIND of degree we're talking about. The Bureau of Labor Statistics Occupational Outlook Handbook is a really useful source here. Some degrees don't quite *guarantee* prosperity, but... they come awfully close to it. Here are some very promising professions that require degrees or at least some post-high school training.\n\n[Nursing](https://www.bls.gov/ooh/healthcare/registered-nurses.htm) is a well-known BOOMING area.\n\n4-year and graduate degrees in statistics and mathematics (or related quantitative social sciences) easily pay for themselves and then some (see career outlook for [statisticians](https://www.bls.gov/ooh/math/mathematicians-and-statisticians.htm) in particular). Google around on 'data science'. Demand for varying combinations of computer science and statistics expertise is through the roof.\n\nA lot of two-year technical degrees are in-demand and offer very promising wages, for instance, to become an [electrician](https://www.bls.gov/ooh/construction-and-extraction/electricians.htm), [plumber](https://www.bls.gov/ooh/construction-and-extraction/plumbers-pipefitters-and-steamfitters.htm), [dental hygienist](https://www.bls.gov/ooh/healthcare/dental-hygienists.htm), etc.\n\nSo sure, not all degrees guarantee prosperity, but frankly, some come as close to it as you can reasonably expect.\n\nEDIT: grammar and flow between paragraphs",
            "title_similarity": "0.7396696",
            "sentiment_compound": 0.9292
        },
        {
            "id": "h4tumut",
            "score": 1,
            "text": "The size of the gamble depends on what sort of degree. Good luck with your gender studies degree.",
            "title_similarity": "0.3905809",
            "sentiment_compound": 0.6815
        },
        {
            "id": "h4tv7v9",
            "score": 1,
            "text": "Why can't you prepare, get good grades on exams, and study for free, instead of all this \"work to study\"?",
            "title_similarity": "0.5539739",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h4tvjwq",
            "score": 11,
            "text": "I did it both ways. Worked a long time without a degree. Worked a long time with a degree. This I can tell you: Without the degree, I never had health insurance, retirement plans, or paid vacation. I was never able to afford reliable transportation. I was never able to buy my own house. \n\nIt doesn't even matter what your degree is in. For a lot of very good, stable careers, all the employer wants to see is that you started and followed through to get the degree. Unless you're talking about Harvard, Stanford or any other super-prestigious school, it doesn't even really matter where the degree is from. There are very good, middle-tier and relatively affordable state universities. \n\nYou want guaranteed return? There is literally no such thing anywhere. You want to give yourself a better shot at a better life, get the degree.",
            "title_similarity": "0.7893673",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h4tw5ek",
            "score": 2,
            "text": "She was joking. She never got a job with the UFC. https://news.yahoo.com/addison-rae-responded-backlash-over-162852777.html",
            "title_similarity": "0.564808",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h4twvuu",
            "score": 1,
            "text": "The important part is investing your education time wisely. I studied for 8 months for a sought after qualification in IT and afterwards had employers calling me instead of me calling them.",
            "title_similarity": "0.6974212",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h4txdmj",
            "score": 1,
            "text": "You’re studying for years to get a degree that someone else might or might not value.\n\nVery little (outside of technical fields) of what you learn in college is directly applied to your job. Even if you get a job in your major’s field.\n\nA degree is just a rite of passage that some respect and others don’t.\n\nAgain depending on your field. Obviously to be an MD or an engineer or any of the hard sciences there is foundational knowledge you will need. But you’ll learn more in your first year in the job than you did in school. Like the reality versus the theoretical way of doing things.\n\nTo me the best bet for future success and well being is creating your own job. Start your own business.\n\n\nOne thought to consider is I believe Walter Cronkite, arguably the most famous journalist ever didn’t have a degree at all. I bring up Cronkite because you made mention of journalists.",
            "title_similarity": "0.7643281",
            "sentiment_compound": 0.9606
        },
        {
            "id": "h4txvsr",
            "score": 1,
            "text": "Nothing is guaranteed, however I'd argue some college degrees are way more promising in matter of investment returns, BUT! you have to ensure that what you are studying is something that will be relevant in the future work market.\n\nYou know people who trade? They read the market and buys the shares they think will be valuable.\n\nThat's what you have to do when you decide you want to study. You have to look at the work market and see where there is the most demand and what kind of skills/degree that can fill that demand, and then you have to go study and get that degree that will meet that demand, and that's how you invest responsibly.",
            "title_similarity": "0.6767007",
            "sentiment_compound": 0.8352
        },
        {
            "id": "h4ty36w",
            "score": 1,
            "text": "I don’t think anyone can refute that a college degree today is an investment with no guarantee of return, but that’s always been the case. It’s meant to increase the likelihood of being successful. The degree of that likelihood depends on a number of things: school rankings, GPA, major, timing (it would suck to graduate during a major recession), etc. \n\nYou need to decide for yourself whether investing into an education is worth it for you. Nothing is guaranteed. Nothing ever has been.",
            "title_similarity": "0.69872093",
            "sentiment_compound": 0.3799
        },
        {
            "id": "h4ty838",
            "score": 1,
            "text": "The concept of college as vocational training makes sense for careers that require extensive schooling like medicine or law. But for most liberal arts majors it often simply does not work that way. \n\nI majored in broadcast communications and still work in broadcasting many years after graduation. The first few jobs I got were directly tied to internships and contacts made while in college. For me the degree itself is not where the value was in my education but instead had more to do with the social capitol I was able to build during that time.",
            "title_similarity": "0.7662487",
            "sentiment_compound": -0.2033
        },
        {
            "id": "h4ty8tx",
            "score": 1,
            "text": "The data still clearly shows that someone with a college degree earns a much higher median income compared to someone with just a high school diploma. [$27,248/year more](https://www.bls.gov/emp/chart-unemployment-earnings-education.htm)\n\nAlso you can see that unemployment is much lower for those with college degrees vs high school diplomas",
            "title_similarity": "0.58979356",
            "sentiment_compound": -0.34
        },
        {
            "id": "h4tyttm",
            "score": 1,
            "text": "It's not what you know or who you know, it's who you blow",
            "title_similarity": "0.088292345",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4tztgn",
            "score": 1,
            "text": "Just like any major investment it pays to do your research.  Look up what fields are facing a labour shortage and go into that area of study or training.  If you really want a guaranteed job, go into the trades. Shorter programs and you can start working usually after a couple months of class time to start building up your hours towards professional certification.",
            "title_similarity": "0.70507604",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h4u0bsm",
            "score": 1,
            "text": "So let’s go with your idea that getting the career of your dreams all depends on who you know. How are you going to meet people in the field you want to be in? A good place to start is in college where you will meet academics in your field, as well as so many peers also pursuing that career. This network will become very important, not only while you’re in college, but after you graduate (or drop out) and pursue job opportunities. I always notice people harping on Arts degrees, and that’s because they themselves are not artists and do not understand how critical networking is to the profession. There are other ways to network, but  the college route is a method that does at least provide you with something tangible in return - an education.\n\nIf you grew up with wealthy socialite parents then no, you do not necessarily need a college education to find success because of the extensive network you already have. But if that isn’t your reality, college is much more critical.\n\nFor many, attending college is a “way out” early in life - it’s very hard and requires a lot of money to move cities/states/countries, and college provides many young adults with a path to leave their hometown and expand their world.\n\nCollege teaches critical thinking skills - it’s where young adults learn to form their own viewpoints and not just regurgitate what their parents have taught them all their lives.\n\nYes, Logan Paul is self-made rich, but his entire career is based on him being a prankster asshat. That may work well in pursuing a television career, but his well-established personality would be a huge deterrent for many employers. He’s known for being a joke, not for being intelligent.",
            "title_similarity": "0.71588",
            "sentiment_compound": 0.9762
        },
        {
            "id": "h4u0htm",
            "score": 1,
            "text": "I would disagree. I was only making $65k and recently decided to go back to school. After getting my MBA I got a new job within a week and got bumped up to $100k. On the opposite, my step-dad worked for the same company for 50 years and he topped out of promotions because he never got that paper. He retired only making $63k, even though he was the best in his field.\n\n *1st you get the degree, then you get the money, then you get the power, then you get the women.*",
            "title_similarity": "0.8136659",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h4u0qqu",
            "score": 1,
            "text": "It is not what you know, it is who you know.\n\nTo that end, a College Degree may not be a good investment, but I have a hard time imagining doing something better than four-ish years than hanging out with people your age at a College type setting to network and influence.  \n\n\nSame goes for high school and before, which is how I suspect in the OP the TikToker made her bones - learning how to be the popular kid.",
            "title_similarity": "0.6916082",
            "sentiment_compound": 0.5341
        },
        {
            "id": "h4u0yro",
            "score": 1,
            "text": "Everything you said seems extremely false what do you determine as a good investment for a college degree? becoming a millionaire which isn't even 2% of the entire word. Addison Rae is a case of a pretty girl getting pretty girl privilege. That how life works you might be the best worker but if you don't network then you don't move up in life. You might be the best cashier but if you can put Addison Rae at the register they're doing so in a heartbeat. A College degree might not be needed since Coding and trade schools. But it's needed for most careers paying 6 figures.",
            "title_similarity": "0.72578955",
            "sentiment_compound": 0.936
        },
        {
            "id": "h4u1u4i",
            "score": 1,
            "text": "But do you know where you get to know people who will help you in your career ? Yup, for the most part, college",
            "title_similarity": "0.5289786",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h4u1wgk",
            "score": 1,
            "text": "It is only a bad investment if you get a bad degree such as art, philosophy, etc",
            "title_similarity": "0.27613226",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h4u230q",
            "score": 1,
            "text": "These days, I think degrees are something that don't necessarily give you an advantage, but put you at a disadvantage if you don't have one. I like to think of it as insurance rather than an investment.  \n\n\nFrom our perspective, it can act as something to fall back on if your dream pursuits don't go as expected. You'll at least have a foothold in an entry-level position relevant to the degree (no matter how bad the job is or how hard the job hunt is, you have an advantage over someone without a degree), or you can even go back to school for a masters.  \n\nFrom the employers' perspective, the degree acts as a sort of minimum guarantee of the applicant. With the sheer amount of resumes companies go through, they don't have the time to gauge the full potential of an applicant. The presence of a degree shows your commitment towards something for a set amount of time and the fact that you got through an application or transfer process.  \n\nSo people can definitely see success without a degree if they are extraordinary by themselves. But the overwhelming majority of \"ordinary\" people need their quality backed up by things like degrees.\n\nEdit: I looked into the specific example you gave, but it seems like it was only going to be a one-time thing anyways. She was probably brought on from the engagement she brings which is something that doesn't require a degree.",
            "title_similarity": "0.55874157",
            "sentiment_compound": 0.9749
        },
        {
            "id": "h4u2msg",
            "score": 1,
            "text": "I was 22 when I left college for a community college pharmacy technician program. My sis made fun of me for that. She was starting her master's/graduate in some biochemistry research at that time. \n\n4 years later we both make the same amount of money, but sis is 50k in debt. At least she has a degree :((((",
            "title_similarity": "0.7741188",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h4u2y94",
            "score": 4,
            "text": "The undergrad of today is nothing more than the high school diploma of the boomer generation. Obtaining a degree at this point is not even about the degree, it’s a check in the hiring box to make sure you don’t get filtered out at the very first round of cuts.",
            "title_similarity": "0.715766",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h4u35iq",
            "score": 1,
            "text": "Exception I can see is my nursing degree. I chose it specifically FOR near guarantee of return. You can always get a job, and at least for me it paid way more than my previous gig of bar tending, both in fiscal and symbolic ways",
            "title_similarity": "0.65739805",
            "sentiment_compound": 0.25
        },
        {
            "id": "h4u3h8t",
            "score": 1,
            "text": "It isn’t when you don’t live in the United States",
            "title_similarity": "0.16637278",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h4u4bzm",
            "score": 2,
            "text": "Some fields don't require a degree. To start a successful business, you only need luck and money. To become a famous entertainer, you only need looks, talent and luck. Connections help, too.\n\nThe trades and certain medical professions, such as radiology tech and respiratory tech, require a shorter time investment in school, plus certification.\n\nIf you want to work for a \"mom and pop\" business, a couple years of college may be enough, and you might not even need that.\n\nBut if you want to work in a white-collar job in an office, a 4-year degree is expected. Read the ads on the job websites if you don't believe me. Where I work, a degree is required for even entry-level jobs. You can't advance if you can't get in the door.\n\nI dropped out of college during a tough market, thinking it was useless because I was waiting tables with degreed people who were out of work. I got along for a while, but with no health insurance, no retirement plan, and no significant advancement except to move to another job where people might treat me better. Some did, some didn't. I learned a lot in these jobs, but every time I tried for a nice office job with regular hours and benefits, I was ignored. Then one recruiter took pity on me and said I had all the experience they were looking for except, \"We only hire degreed professionals.\"\n\nI went back to college. I got a job, advanced very rapidly because of all of my previous experience, then got a Master's so no one could tell me again that I didn't have sufficient education credentials. \n\nAnd as an aside, my undergraduate degree has nothing whatsoever to do with my job. I'm sure if it had, I would've advanced even faster.",
            "title_similarity": "0.7734599",
            "sentiment_compound": 0.8427
        },
        {
            "id": "h4u4dia",
            "score": 1,
            "text": "The way you’re approaching this subject is as if your pulling a major out of a hat but that’s not investing works. Smart investors do their homework so I would assume you would do the same for the major and your eventual career. \n\nCareers in highly technical fields (accounting, technology, medical, engineering) rely heavily on their course of study and they’re paid for it… other technical fields (non-college) such as carpentry, electrical, plumbing are also high in demand (and are paid well). \n\nMy suggestion to you is to balance your priorities between something that is gratifying and something that pays well; however, it takes time to move up the ladder. It’s a marathon not a sprint.",
            "title_similarity": "0.64918935",
            "sentiment_compound": 0.728
        },
        {
            "id": "h4u4gje",
            "score": 1,
            "text": "Depends on the degree.\n\nLesbian Dance Theory- yea better skimp on tuition for that one.\n\nA medical, engineering or science degree - much better",
            "title_similarity": "0.5055673",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h4u5sd7",
            "score": 1,
            "text": "All education, of any type or level, is an investment with no guarantee of return... No one is going to pay for your education alone",
            "title_similarity": "0.45008874",
            "sentiment_compound": -0.6531
        },
        {
            "id": "h4u720d",
            "score": 1,
            "text": "No investment has ever guaranteed a return.  If you've been told that I'm sorry",
            "title_similarity": "0.37699828",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h4u75li",
            "score": 1,
            "text": "It’s an investment that’s outcome and return is solely based on YOU and your efforts. Period.",
            "title_similarity": "0.27423424",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u7fjq",
            "score": 1,
            "text": "A college degree has at least some return. It may not be as lucrative or as much money as celebrities get, but the degree opens doors to careers regardless of what you actually want to do. There are several jobs that require a bachelor's degree, even if they aren't they aren't job you want or the career you want.\n\nAlso if you generalize it to associate degrees or trade school certifications, you can benefit from having that when you apply to jobs.",
            "title_similarity": "0.65295243",
            "sentiment_compound": 0.6775
        },
        {
            "id": "h4u7hi6",
            "score": 1,
            "text": "The return on investment is that you have an education.  If you want mere job training, then trade school is probably more up your alley.\n\n**edit** I think the problem stems from the private sector's refusal to fund their own on the job training like many companies used to do in the 80s and before.  And the real problem with public higher ed is that it's been getting de-funded more and more over the last 5 decades so that now, the student has to pay a significantly larger portion of the operating costs.",
            "title_similarity": "0.7963375",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h4u7if8",
            "score": 1,
            "text": "I think a degree is suppose to show youre qualified, but another piece is experience: internships, the specific college, how well you picked your major; colleges are there to teach not employ you.\n\nMost colleges have specific classes that make you think of the job youd want and the classes you take prepare you to choose what you want to do. I got an english degree to be a tech writer and now im a tech writer. Almost everyone else in my classes took english to become lawyers or teachers, and the ones that didnt know why they were there dont work in the field. \n\nA school cant teach ambition.",
            "title_similarity": "0.7233696",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h4u7won",
            "score": 1,
            "text": "CmV : working is an investment with no guarantee of return. A lot of rich people don't work and gambling is a better investment as every lottery winner became rich by gambling instead of working.",
            "title_similarity": "0.6371964",
            "sentiment_compound": 0.9211
        },
        {
            "id": "h4u81j5",
            "score": 1,
            "text": "There is not a single investment with a guarantee of return, that's literally the point of investing",
            "title_similarity": "0.35264763",
            "sentiment_compound": 0.25
        },
        {
            "id": "h4u8bkd",
            "score": 1,
            "text": "I'll keep it short but basicly just like any investment you have to do your market research. So check the average salary and time from graduation to first job. There are a lot of studies that indeed lead no where. This can depend on where you want to live.\n\nBut there are college degrees that will set you up for life, you just have to look for them. Just like investing in stocks you don't just pick 1 just because you like it (except wsb ofc) and stuff all your money and time in it. Treat a college degree the same way.\n\n(So yes it is a worthwhile investment)",
            "title_similarity": "0.77429307",
            "sentiment_compound": 0.9559
        },
        {
            "id": "h4u9f24",
            "score": 1,
            "text": "That was the biggest draw to me for pledging for a fraternity. To meet people and alumni who went on to have good careers. Networking is one of the most important things you need to do in college now a days.",
            "title_similarity": "0.6601535",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h4uaupk",
            "score": 2,
            "text": "I think you are talking about two totally different things. College is absolutely an investment with no guarantee return and people need to stop thinking of it like that. What you get from college is the opportunity to gain knowledge you can use to further your career. The piece of paper at the end isn’t what matters. If you take bullshit classes and don’t learn anything useful you just wasted that money. You still have to start at the bottom where ever you go, but if you are knowledgeable and hard working you can advance. College absolutely helps with this if you do it right. It also helps you meet people who go in to your field who you can use as connections later on which is important. In my opinion, it is totally worth it to go to college. You just can’t think you are owed something for doing it.",
            "title_similarity": "0.7110748",
            "sentiment_compound": 0.9003
        },
        {
            "id": "h4ub59d",
            "score": 1,
            "text": "Depends on the degree. Get a degree in the medical field, law, engineering, a myriad of STEM fields, and you’re highly likely to get a job with a comfortable salary. Get a degree in liberal arts or business or something that isn’t in high demand, and yeah, you’re taking a risk of not getting a return in your investment.",
            "title_similarity": "0.6285013",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4ubcv6",
            "score": 1,
            "text": "Investing in a college degree is like investing in a gym membership. \n\nYou don't need a gym membership to lose weight, nor is it a guarantee that you'll lose weight, but if you are motivated and willing to put in the work, it definitely makes it easier.",
            "title_similarity": "0.6053728",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h4ublnj",
            "score": 1,
            "text": "Got my undergrad degree in applied physics, got an engineering job that paid off my loans in 4 years \n\nHad a quarter life crisis realizing I don’t care about engineering, going back this fall for MS in medical physics. Not particularly worried about securing income afterwords\n\nHate to be yet another “it depends on the degree” answer but that’s my experience\n\nHaving said that, college definitely isn’t for everyone and definitely isn’t needed for many career paths, and if you don’t need it, I’d advise to stay away because you’re right it probably isn’t worth",
            "title_similarity": "0.7585258",
            "sentiment_compound": 0.8395
        },
        {
            "id": "h4uc0o4",
            "score": 1,
            "text": "There never was a guarantee of a return on the investment in a college degree. No college anywhere will guarantee a job let alone one that gives a substantial return on investment.",
            "title_similarity": "0.5921979",
            "sentiment_compound": -0.2824
        },
        {
            "id": "h4ucmr6",
            "score": 1,
            "text": "I personally think the biggest problem is people not researching their career path before jumping into it. A lot of degrees can be highly competitive due to low position volume, or flat out useless, but people chase these careers thinking they will be the exception and then fall on their face after graduating. Have you ever heard someone in finance say their degree wasn’t worth it? No.",
            "title_similarity": "0.6972655",
            "sentiment_compound": -0.1163
        },
        {
            "id": "h4ud5a5",
            "score": 1,
            "text": "1. No (or very few) investments will guarantee you a return. Those that do are probably going to give very low returns.\n\n2. The data show that college degrees are good investments in general and that having a college degree is one of the best predictors of lifetime income. Your average 40 year return on a college degree is between 500-800k. The median ten year return is 100k. \n\nhttps://www.insidehighered.com/news/2019/11/14/differences-college-roi-vary-institution-type-and-time-frame-measured-report-says",
            "title_similarity": "0.6449053",
            "sentiment_compound": 0.6712
        },
        {
            "id": "h4udhkm",
            "score": 1,
            "text": "I would like to know what university has a degree promising a career in UFC correspondence.\n\nIn all seriousness, your comparing two completely separate things.  I am of the opinion that college degrees are over valued in our social culture, but the idea that someone compares a career promised by education to a \"correspondent\" for UFC is utterly rediculous.  Throughout all of economic history, there have always been people that have achieved success due to luck and talent that matched the unconventional needs of the time and this fits that.  There will never be a degree or certificate that will make you charasmatic or lucky enough to stumble into success in a world with needs and demands that are constantly changing.\n\nEducation is definitely misunderstood.  But when it comes to the rare high wealth jobs, the nature of them is, was, and always will be involving stumbling upon something that is luck and skill no one knows is even needed yet.  If it was established enough that it could be quantified into a classroom/degree, it wouldn't pay higher wages than 99% of the population.",
            "title_similarity": "0.76594514",
            "sentiment_compound": 0.9896
        },
        {
            "id": "h4udrfu",
            "score": 1,
            "text": "Some college degrees do guarantee a job and some don’t.  I would say most types of engineering will get you some sort of decent paying job.  \n\nI also don’t think you understand what a college degree says to employers.  It isn’t as much about the knowledge you gain, it’s about learning to work in teams, delaying gratification, sticking with a project and finishing it, working on a larger goal by dividing it into small chunks.",
            "title_similarity": "0.6838509",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h4uelwk",
            "score": 1,
            "text": "Addison Rae was never hired by the UFC. It was a joke...",
            "title_similarity": "0.43402666",
            "sentiment_compound": 0.296
        },
        {
            "id": "h4uetoa",
            "score": 1,
            "text": "So is literally everything else in life",
            "title_similarity": "0.15565921",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uf9rj",
            "score": 1,
            "text": "Personally I think something like getting a trade (plumber/electrician etc is the better investment as even if you don't go into that field you'll save a fuck load of money by doing expensive work yourself",
            "title_similarity": "0.51409006",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h4ufbxe",
            "score": 1,
            "text": "No, a college degree has never ensured graduates a job or a solid career path.  Same can be said of a certificate of completion in a trade program. And it seems that placement rates reported have always been rather exaggerated.",
            "title_similarity": "0.69504577",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h4uftic",
            "score": 1,
            "text": "It entirely depends on the degree. In nursing school, classmates were getting jobs before they graduated.",
            "title_similarity": "0.6816721",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ugqmp",
            "score": 1,
            "text": "You’re basic premise is correct: a college degree doesn’t guarantee a return on your investment. That’s not really saying a lot, though.\n\nYour example of an “influencer” is absurd, though. You might as well pick a lottery winner. \n\nThe important thing is to research the job field you’re getting into. Some degrees really are worthless, despite what some redditers will argue*, and some trades are absolutely worth getting into as a potential career path. It’s about what you feel you  would be content doing that is also a profitable career path. \n\n*the “degree holders vs non-degree holders” study is retarded, yeah no shit “non-degree holders” as a whole do worse than degree holders, that includes the guy working at Walmart for 12k a year and the electrician making six figures. Clearly it’s about having a marketable skill, regardless of whether it comes from a college or a trades school.",
            "title_similarity": "0.5815078",
            "sentiment_compound": 0.8041
        },
        {
            "id": "h4uh3qo",
            "score": 1,
            "text": "On the average college grads make more.\n\nThat's just fact.\n\nCollege is not for everyone, some people have natural abilities and will be successful without higher Ed.  \n\nCollege was not for me, I knew that 1 semester in, finding my path was more difficult then most.  Ended up in business operations sales oriented, but only because of incredible amounts of self study.\n\nIf you don't go to college and still want to make bank, you will be studying harder and longer then any college grad, but you can be more focused about it, you won't be as well rounded but you can be very good at what you do.",
            "title_similarity": "0.7468722",
            "sentiment_compound": 0.8782
        },
        {
            "id": "h4uhgw0",
            "score": 1,
            "text": "It’s all about what you get a degree in, be realistic.",
            "title_similarity": "0.2571452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uih6o",
            "score": 1,
            "text": "While there is something to be said for education/knowledge inflation, a college education is still valuable.\n\nCollege is a system where you get introduced to the academic world and get the change to be at the forefront of science and human progress. People who are supposed to be some of the best in their field hand you some of the tools you will need to become one such excellence.\n\nNot everybody is able to use those tools and there are people who can strike it big without them. \n\nMake a note of the survivor bias. For every one influencer that's a millionnaire there's probably a million kids whose follower count doesn't break 100. \n\nI'd be willing to bet that while only a minority of well-connected journalism graduates make it to UFC (whatever that is, am not american), your average graduate will probably land a quiet job within a year of two with some career prospects and the potential to maintain a comfortable middle class standard of living.",
            "title_similarity": "0.6792335",
            "sentiment_compound": 0.9735
        },
        {
            "id": "h4uikne",
            "score": 1,
            "text": "Depends heavily on your degree",
            "title_similarity": "0.27570757",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uirkk",
            "score": 1,
            "text": "When has it ever come with a guaranteed return? Nothing had really changed. You are you what you make of yoruself.",
            "title_similarity": "0.35698855",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ukv9h",
            "score": 1,
            "text": "No investment has a guaranteed return.",
            "title_similarity": "0.22812131",
            "sentiment_compound": -0.296
        },
        {
            "id": "h4ulfj1",
            "score": 1,
            "text": "An investment is generally defined as \"...to allocate money with the expectation of a positive benefit/return in the future.\"\n\nThe key word there is 'expectation', not 'guarantee'.\n\nMost investments don't have a 100% guarantee of return, especially when it comes to something a little more nebulous like a degree.\n\n> It proves to show that landing the career you want is a who-you-know game, rather than what-you-know.\n\nThere is some truth to this, but isn't the fact that Rae got fired basically immediately proof against that?  She clearly didn't land the career she wanted.\n\nAnd some careers do require degrees or qualifications regardless of who you know.  A law firm is basically never going to hire someone who didn't go to Law school or pass the bar exam, a hospital is basically never going to hire a Doctor who didn't graduate from med school.  There is no major for \"UFC commentator\".\n\nAnd look, we can talk all day about how dumb \"influencers\" are, but the truth is that very, very few people who try to become influencers on social media actually become successful, let alone millionaires.  If everyone who tried to become an influencer made millions, everyone would do it.",
            "title_similarity": "0.5722877",
            "sentiment_compound": -0.0677
        },
        {
            "id": "h4umidh",
            "score": 2,
            "text": "Okay, I’m going to go with an answer a little different than anything you talked about. Getting a degree is a good idea because it seems like jobs are going in a direction that you are going to need a higher education even for lower jobs. And that’s just the thing. So having one is just a good idea at this point or else even for a job like Walmart or something you might not be able to get higher up without an education and that’s just life now",
            "title_similarity": "0.5968993",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h4untfk",
            "score": 2,
            "text": "The key words are \"today\" and \"no guarantee\".....a degree never carried a guarantee of anything.  University administrators and advertisers may like to imply things, but getting your job and keeping it are up to you, sunshine.  You're not owed anything.",
            "title_similarity": "0.57372653",
            "sentiment_compound": 0.6888
        },
        {
            "id": "h4uo922",
            "score": 2,
            "text": "Not sure if this has been said, but I’d argue obtaining a college degree has literally never been what you describe.\n\nPeople take this statement:\n\n“Getting a college degree will increase your chances of getting a career in a field that you enjoy or is more profitable”\n\nAnd they twist it into two statements that seem the same but are different.\n\nMisconception 1:\n\n“A college degree will land you in a more profitable career”.\n\nA college degree does not do this. It might change your chances for getting the job of your choice from 20% to 80%. Maybe even from 5% to 95%. But by no means has it ever been a guarantee that you get a sure thing - 95% still means that 1 in 20 people don’t get a job post graduation.\n\nMisconception 2:\n\n“A college degree will land you in a career that is more profitable”.\n\nIt’s not a guarantee that this will automatically more profitable than any other position. Again, similar case as above - you have a higher chance of making more money in some cases, in others you won’t even, it’ll just give you more opportunity to enter the field than you had previous.",
            "title_similarity": "0.741817",
            "sentiment_compound": 0.9745
        },
        {
            "id": "h4uqlc6",
            "score": 1,
            "text": "Virtually no investment is a \"guarantee of return\". The statement is inherently flawed.",
            "title_similarity": "0.26836652",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h4uqprn",
            "score": 1,
            "text": "It is who you know, which is why i would suggest business school. You’ll meet a bunch of ppl that will later start business or know people with businesses.",
            "title_similarity": "0.566187",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4usbs7",
            "score": 1,
            "text": "It depends on the degree. \n\nSome degrees, such as Accounting, Education, and Computer Science are practically (not absolutely, but very very VERY likely) to have a return because the world consistently needs more accountants, teachers, and coders/debuggers/tech support. \n\nFor most degrees, you're right. There was a time when just having a degree was enough to mark you out and put your first in line for some entry-level cubicle job with a corporation, making good enough money with decent enough benefits to support yourself, and, in time, a family. Those days are no more. People want others who have specific skills. So, the degrees that prove you have desired skills (such as those I listed above) are a nigh guaranteed return.",
            "title_similarity": "0.74283767",
            "sentiment_compound": 0.9439
        },
        {
            "id": "h4usplt",
            "score": 1,
            "text": "In some careers it’s entirely true. My pay scale has two factors: how many years I’ve worked for them, and my level of education. My degrees will make more than a million dollars difference over the course of my career. So, yeah.",
            "title_similarity": "0.6791779",
            "sentiment_compound": 0.5617
        },
        {
            "id": "h4utdv6",
            "score": 1,
            "text": "It depends.....\n....Is the degree in a field for which there is demand and positions are well compensated? Things like engineering, medicine/nursing, computer science.\n...Is the cost of the degree reasonable or from a university with unjustified ridiculous tuition?",
            "title_similarity": "0.5280146",
            "sentiment_compound": 0.2406
        },
        {
            "id": "h4uuuvo",
            "score": 1,
            "text": "NO investment has a guarantee of return. Very few I can think of anyway. I will concede that, with the extensively vast varieties of careers that have opened up this millennia, yes a college degree isn’t that guaranteed marker of potential success as it once was. It STILL will get returns though. Guaranteed. Just not as much, and definitely dependent on what you want to do. \n\nFor instance, I wanted to teach. That requires certification, which requires a bachelors from an accredited institution. Sure there are Emergency Certifications and Long Term Sub positions out there with teacher “shortages”, but they get paid the least, and a degree is still, eventually, required to stay employed as a contracted teacher. Some districts in the southwest start off at 30 k if you have a bachelors, then there’s a step process as you continue to teach, and if you get a masters that increases those steps. I was fortunate enough to have my board of regents scholarship pay for my master’s, but I would have paid 13k for it at the time. The pay difference from having on,y a bachelors is about 4K per year, so in a little over three years my masters paid for itself and I had 11 more years to go and counting. There’s no guarantee of a specific amount of “returns” in terms of money, but it definitely increases your chances for success. \n\nAlso, you cant put a price on walking the hallowed halls of Lot 59 at Arizona State University side by side with an identical Gold shirt as NFL champion and Hall of Famer Terrell Suggs as he heads to the Chuckbox. Go Devils!",
            "title_similarity": "0.73930526",
            "sentiment_compound": 0.9478
        },
        {
            "id": "h4uv4pt",
            "score": 1,
            "text": "This sounds like a problem privileged people have.",
            "title_similarity": "0.08604589",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h4uvk9j",
            "score": 1,
            "text": "A bachelors degree is basically the key to get invited for a corporate job. If that's what want, then a degree is almost necessary. If you can do something outside corporate world for a career (which is more a nd more viable) then a degree is useless in many cases, but not all.",
            "title_similarity": "0.69294715",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h4uwruz",
            "score": 1,
            "text": "IMO it's important to pay attention to the fact that being a scholar was traditionally a pastime for the independently wealthy. Those who could afford to spend years soaking up knowledge instead of earning money. \n\nThere's still a legacy of this in majors like history, political science, music, gender studies, philosophy, etc. You *can* get a job with all those degrees, but you won't get a job in your field without pursuing the \"scholar\" route. \n\nOther majors have taken a more \"vocation school\" approach. You can still take the scholar path, but the default is directly into labs, into offices, etc. Things like accounting, chemistry, engineering, etc. \n\nObtaining a college degree isn't a guarantee in the sense that nothing is a guarantee...but if you don't want to work retail, cook, or work a trade, then your options mostly require college. It's important for kids to realize their economic position and choose their options accordingly. A college student from a dirt-poor background shouldn't major in history because odds are they won't go get a PhD and won't get a living wage from work in that field. By contrast a kid with parents who can support them should pursue their passion whatever that might be.",
            "title_similarity": "0.71720815",
            "sentiment_compound": 0.9225
        },
        {
            "id": "h4uxvkm",
            "score": 1,
            "text": "Stoppppp. You’re right but I don’t like it",
            "title_similarity": "0.1024833",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h4uzuyz",
            "score": 1,
            "text": "Definitely true for most majors. I have a BS in Computer Science from 2015 though and my salary has nearly doubled annually. Pick the right major",
            "title_similarity": "0.62437534",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h4uzzro",
            "score": 1,
            "text": "100% agree with most degrees. There are a few exceptions.",
            "title_similarity": "0.20459878",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h4v04u7",
            "score": 1,
            "text": "A college degree was never a free ticket to a job. That's a myth that people like to talk about, but it just wasn't true. People say that in the 60s, you were practically guaranteed a job just because you had a piece of paper. But what they overlook is the fact that the 60s was a time of great economic growth in the US generally. Sure, people with a college degree got jobs easily. But there were lots of jobs! People without degrees were getting jobs pretty easily, too.\n\nYou're railing against the memory of a myth.",
            "title_similarity": "0.7620574",
            "sentiment_compound": 0.967
        },
        {
            "id": "h4v0rnw",
            "score": 1,
            "text": "To the OP,\n\nAs others are saying, you’ve kind of picked the outliers but I understand what you’re saying. Just for context, I’m in the healthcare industry and had to go through 8 years of schooling (4 yrs of undergrad) and another 4 on my profession. I can 100% say that undergraduate degrees will not land you a job nowadays, and I studied pre-med. They’re more like a stepping stone for professional degrees, which is a huge risk for most young people without financial support, imo. \n\nIf I can change society, I would say that University is just stupid on how it’s setup. Forced to take electives and complete it in 4-5 years (some people take longer). In reality, I would say that had we not needed to take useless courses or courses that we’d not use for our majors (who needs to learn about integrals in healthcare?!), I would have been able to complete my undergrad in 1-2 years.\n\nIt makes me feel sad that I recently went to a Barber and on our conversation he told me he had an undergrad. Honestly, he could have saved himself the money and just went straight to becoming a barber/trade school rather than going through those 4 years\n\nTLDR- undergraduate degrees are more like stepping stone to professional schools or regulated professions. If you don’t intend becoming one, just don’t get it. Saves yourself the time and stress.",
            "title_similarity": "0.7949496",
            "sentiment_compound": -0.765
        },
        {
            "id": "h4v10lh",
            "score": 1,
            "text": "Depends on your major and if you're an American being scammed or not. Get a master in tech or the financial sector and you're guaranteed a high paying \\*\\*starting\\*\\* job and even get to be picky. If it costs you 6 years and 300k to get that degree though... perhaps you're better off learning on the job.",
            "title_similarity": "0.7279141",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4v1d1b",
            "score": 1,
            "text": "Everyone needs to develop a skill with further education. However, just “getting a degree in something” may not be worth the money. \n\nConsider college, tech school, military, trade school, etc. there are lots of options, but get skilled at something to be valuable in the market.",
            "title_similarity": "0.5896522",
            "sentiment_compound": 0.5882
        },
        {
            "id": "h4v2qod",
            "score": 1,
            "text": "That’s not really true for a lot of careers ie law,medecine,dentistry if u got a degree u have a job",
            "title_similarity": "0.58081776",
            "sentiment_compound": -0.3713
        },
        {
            "id": "h4v2rx1",
            "score": 1,
            "text": "There are no guarantees for anyyhing.  Death and taxes I guess.  I saw a lady on the news with a mathematics degree and homeless.  I know a guy that can barely spell that is almost a millionaire selling cars.  Its up to you how it all works out.",
            "title_similarity": "0.71144074",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h4v2xsz",
            "score": 1,
            "text": "It’s a giant government run racket. Nowhere (with maybe the exception of healthcare) is it more obvious that the government pumping unlimited amounts of money into something causes inflation.   \n\nCollege is useful in many areas but for the vast majority of people a degree is a waste.",
            "title_similarity": "0.6768196",
            "sentiment_compound": -0.4118
        },
        {
            "id": "h4v4jg3",
            "score": 1,
            "text": "I despise this economic view of education. It’s not an “investment” that needs “return”. It’s purpose is to help you acquire knowledge and develop certain skills. Although, obviously, I understand that the private education system does force people to think of it in those terms…",
            "title_similarity": "0.48963714",
            "sentiment_compound": 0.34
        },
        {
            "id": "h4v4xxd",
            "score": 1,
            "text": "There is not a single investment in the history of the world that has had a guaranteed return.",
            "title_similarity": "0.31607574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v53em",
            "score": 1,
            "text": "That is called risk...ever decision we make has some.",
            "title_similarity": "0.093171",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v56od",
            "score": 1,
            "text": "Let me guess. USA?",
            "title_similarity": "0.06813777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v5osl",
            "score": 1,
            "text": "But a lot of jobs high paying and not require degrees and most would rather not pick up a trade so there really is no way tovwin",
            "title_similarity": "0.5866839",
            "sentiment_compound": -0.4969
        },
        {
            "id": "h4v6lpl",
            "score": 2,
            "text": "I think it depends on your definition of success. My sister makes a bit more money than me. The difference is she doesn’t have a degree, has worked the same job for 12 years to make that amount, and is required to work about 50\nHours a week almost entirely on her feet for it. I on the other hand have been in my “field” for about 3 years max and work from home with a flexible schedule. I also have a liberal arts degree. This expensive piece of paper didn’t guarantee a job in my field (or any field) but does allow me to qualify for positions that my sister would be immediately be rejected for, and honestly will always be less labor intensive. I don’t have to worry about the physical affects of my job on my body (aside from possibly blood clots/sedentary lifestyle stuff). I am not constantly on call even though I’m salaried. She feels successful but had to work much harder to reach the level my degree started me at career wise.",
            "title_similarity": "0.7845371",
            "sentiment_compound": 0.9178
        },
        {
            "id": "h4v755b",
            "score": 1,
            "text": "#APPRENTICESHIP",
            "title_similarity": "0.09099986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v7go3",
            "score": 1,
            "text": "I dunno, man.   I got an engineering degree and am now an engineer.  My wife has a degree and wouldn't have gotten her recent promotion without it.  It's never been a guarantee for a job, but it certainly puts you ahead more than someone without one",
            "title_similarity": "0.6874026",
            "sentiment_compound": 0.4078
        },
        {
            "id": "h4v8gui",
            "score": 1,
            "text": "Even trade college is fucked. The first job I applied for out of automotive training offered me minimum wage.  Bitch, I didn't spend 7 months and $5000 to make minimum wage.",
            "title_similarity": "0.7856266",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h4v8lt0",
            "score": 1,
            "text": ">It proves to show that landing the career you want is a who-you-know game, rather than what-you-know\n\nIt's always been this way and it's pretty well-known that the big schools are just as important for networking and the lineage they have as they are for education (if not more so). It's pretty obvious that advancing in your career even once you get in it is STILL more about who you know and how likeable you are than what you know.\n\nBesides all that, how many people become a Tiktok influencer worth 2 mil? The best argument you can make against college now is that it's the bare minimum. Yes, getting a college education basically gets you a job, nothing fancy, it's just a job. The return on investment is becoming less and less, but what alternatives are there unless you're extremely motivated and creative and lucky? Not much",
            "title_similarity": "0.6292253",
            "sentiment_compound": 0.9712
        },
        {
            "id": "h4vaf4n",
            "score": 1,
            "text": "Education has intrinsic value. Don't worry about ROI or the wider context of anything, really. The privilege of being able to indulge in a subject you love, even if you never use that knowledge for a practical purpose, is a rare joy. You'll have plenty of time to learn vocational stuff down the line, don't worry about that",
            "title_similarity": "0.3995511",
            "sentiment_compound": 0.9516
        },
        {
            "id": "h4vcj27",
            "score": 1,
            "text": "So gambling. That's called gambling.",
            "title_similarity": "0.074591815",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vd6ny",
            "score": 1,
            "text": "I wish on-the-job training was more of a thing, as it once was. You knew your training wouldn't be wasted because you were already employed in your chosen profession and could find out if you were suited to it before wasting years of your life and accumulating massive debt.",
            "title_similarity": "0.66730094",
            "sentiment_compound": 0.033
        },
        {
            "id": "h4vdwbn",
            "score": 1,
            "text": "This discussion is the worst. No investment is guaranteed and, if statistics are anything to go by, college degree holders are far more successful over all. Stop looking at social media as a benchmark for success. Successful now seems to be blowing up online and making millions in your early twenties and if you work a normal 9-5, you’re a loser... People need to come back down to earth, it’s so incredibly unlikely. \n\nThe reason why people think degrees aren’t worth what they used to be, is that we are constantly bombarded by incredibly young, fortunate people who have had everything fall into their hands, and think the only way to reach those heights, is by following in their footsteps. What you don’t see is the thousands who dropped out of college to pursue being an influencer, or people who devote all their time to building an online following but never make it.\n\nTheir is no clearcut path to being extremely wealthy, otherwise there would be many more multi-millionaires. It is all luck, nothing else. There are things you can do, like getting a degree, improving social skills and being consistent, that will improve your chances of being “successful”, however slight, but at the end of the day, it’s luck. \n\nHard work does not make a person successful. It can help, sure, but its a tiny part. Its just not a good metric of measuring success, though it is so engrained into us. Think of any position you want, your boss, their boss, the owner of a massive company, an influencer, any position at all. You really think there isn’t someone out their who has worked harder, smarter and is more competent than that person, though in every other measurable way, they are worse off? Of course there is, there is always someone better suited to the role, but they never make it.",
            "title_similarity": "0.75274295",
            "sentiment_compound": 0.994
        },
        {
            "id": "h4vfqf5",
            "score": 1,
            "text": "Depends on your degree.\n\nIf you graduate with something in STEM, odds are you’ll be able to do something more than something like film studies.",
            "title_similarity": "0.48770106",
            "sentiment_compound": 0.4144
        },
        {
            "id": "h4vg8pt",
            "score": 1,
            "text": "College does guarantee a return if you pick the right field of study.",
            "title_similarity": "0.38766515",
            "sentiment_compound": 0.25
        },
        {
            "id": "h4vgkqb",
            "score": 1,
            "text": "Degrees are a way to “get your foot in the door” and without them you decrease your chances of actually doing that unless your family/close friends are already well connected in the industry you’re trying to break in to. This especially applies for what you’re trying to do with UFC. Even if you don’t get your dream job straight out of college you’ll find an entry level job in your area (sports casting or sports news) and you can work your way towards your dream job on the inside of your industry and expand your network in your industry on the way.\n\nIf you’re looking at college degrees solely as an “investment” then I would choose a degree that gives you the best ROI like something in engineering or applied maths. \n\nJust like all investments there is risk involved and you have to decide if the possible rewards outweigh the risk (this is something each person answers for themselves). Another thing about college is that if you do it right you gain an invaluable network of new friends and peers from all over which is how I got my job.\n\nMe personally I majored in business statistics and I am 23 working at a large corporation and managed to pay off all my student debts the first year of work due to my salary (great ROI for my degree). The way I balanced this out was through choosing a college where I’d minimize loan debt and maximize my chances of securing a great well paying job out of college that I wouldn’t have gotten without my degree.",
            "title_similarity": "0.7551883",
            "sentiment_compound": 0.9893
        },
        {
            "id": "h4vi1cp",
            "score": 1,
            "text": "Just wanted to give my 2cents on this.\n\nI remember reading a book on investing years ago and I cant remember which it was but it basically talked about how less than 1% of people can become CEO's or famous movie stars etc. and this is a bit of that situation for every Addison Rae there will be 10,000 people who get no where with Tiktok.\n\nWith a University degree you can have a fairly high chance of getting a good paying job its not the 1% of people. In saying that though you need to do a degree in the right fields, medicine, law, engineering, architecture, maths, IT etc and not things like history, language, art etc.",
            "title_similarity": "0.7740114",
            "sentiment_compound": 0.2228
        },
        {
            "id": "h4vi5i8",
            "score": 1,
            "text": "Disagree, a certificate / degree will always pay!\nIt might not pay itself off but it will always pay.",
            "title_similarity": "0.46755868",
            "sentiment_compound": -0.4106
        },
        {
            "id": "h4vj6lt",
            "score": 1,
            "text": "Guarantee?  Probably not.  But much higher odds of success.\n\nIn aggregate, people with a bachelor's degree will earn double what people with only a high school diploma or GED earn.  \n\n\n[Source](https://www.brookings.edu/blog/up-front/2020/10/08/major-decisions-what-graduates-earn-over-their-lifetimes/)",
            "title_similarity": "0.6397068",
            "sentiment_compound": 0.7615
        },
        {
            "id": "h4vl2ul",
            "score": 2,
            "text": "Are you guaranteed a immediate entrance into a career with a 4 year degree? No, not any more. Are your odds better than someone with just a high school diploma? Very much yes.\n\nYou want a job in a STEM field? Your odds of getting it without a Bachelor’s is comically small. This is true of a variety of career paths.\n\nStill want a cheaper option? Go to community college to better figure out your strengths. Skip expensive private schools and go for more affordable 4 year schools. \n\nWant a place in a more secure industry? Go to trade school to work in healthcare, on cars, or be a mortician. Those fields won’t be going anywhere in your lifetime.",
            "title_similarity": "0.72425336",
            "sentiment_compound": 0.9573
        },
        {
            "id": "h4vlfpx",
            "score": 1,
            "text": "I know right? It's a place for rich parents kids to network. Other poor students ain't got time for networking.",
            "title_similarity": "0.5607392",
            "sentiment_compound": 0.128
        },
        {
            "id": "h4vmt4i",
            "score": 1,
            "text": "Gotta find the really niche areas of your major.\n\nA general degree won’t get you anywhere.",
            "title_similarity": "0.43861595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vn00l",
            "score": 1,
            "text": "The problem today is that people choose degrees that cost tens of thousands of dollars when the career path with the degree doesn't have the appropriate financial return to make it worthwhile. As long as you can make your debt back and you would be happy with the career finish college.",
            "title_similarity": "0.73533165",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h4vn69i",
            "score": 1,
            "text": "When you're choosing your major check mechanical engineering instead of history of Belgian composers and your degrees value goes up considerably",
            "title_similarity": "0.5481983",
            "sentiment_compound": 0.34
        },
        {
            "id": "h4vnb07",
            "score": 1,
            "text": "The cash me ousside girl revealed to me that this world we live in rewards the worst people for acting like trash. Might as well not even try",
            "title_similarity": "0.4428421",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h4vo9en",
            "score": 1,
            "text": "Just a heads up, no investment had a guarantee return on investment.",
            "title_similarity": "0.32314926",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h4vonf0",
            "score": 1,
            "text": "Nothing in life is guaranteed but the [data](https://www.northeastern.edu/bachelors-completion/news/average-salary-by-education-level/) pretty clearly shows that on average people with a degree earn more than people without one.",
            "title_similarity": "0.64811635",
            "sentiment_compound": 0.8338
        },
        {
            "id": "h4vplj8",
            "score": 1,
            "text": "Like any investment, there are wise ones and foolish ones. If you get a degree in a demanding high paying field, that's a wise investment. If you get a degree in film, don't expect to make your money back.",
            "title_similarity": "0.52372855",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h4vq9yd",
            "score": 1,
            "text": "Get one targeted to a healthcare career. It nets you a guaranteed baseline of middle class.",
            "title_similarity": "0.38573503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vqdkd",
            "score": 2,
            "text": "There's always a guarantee of return.  Any degree you choose to study can be of value, it all depends on what your cost to acquire that degree is.  Once you factor in the tangibles (cost, exposure to technology, minor experience) you can begin counting intangibles (career referrals, campus sponsored hiring events, alumni networking events, access to philanthropic clubs), you will realize it's multidimensional.\n\nI would agree that it's an investment, and no guarantee of a POSITIVE return, but that is really because many students overpay, and don't take full advantage of the resources their tuition gets them access to.\n\nI know I sure as hell skipped a few classes and wasted a lot of time when I was there.  Fortunately my graduating salary put me at 6 figures in 4 years of work experience.\n\nI'm an advocate for delaying the college experience by a year or two, especially if the person doesn't have a passionate career in mind.  Taking a few general electives at a local community college would go a long way to reducing the investment.",
            "title_similarity": "0.6825073",
            "sentiment_compound": -0.8828
        },
        {
            "id": "h4vqebk",
            "score": 2,
            "text": "There is position I haven't seen anywhere in the comments so far that I believe deserves exploration.\n\nI argue that a college education is valuable in and of itself. It has intrinsic value, and one unquantifiable by economic metrics.\n\nWhat would you pay to grow as a person? What is the monetary value of a broadened perspective, increased knowledge, expanded horizons, training in formal reasoning, and so much more.\n\nThere is more in life than what job one has, and how much money one makes. In fact, money is merely a means to an end in all practical senses. Why not consider education an end itself?",
            "title_similarity": "0.6382141",
            "sentiment_compound": 0.8156
        },
        {
            "id": "h4vrwr4",
            "score": 1,
            "text": "Trade schools and certifications instead of colleges and degrees. There are plenty of in demand jobs in these fields that will place you after becoming certified or completing the program. It's definitely an investment though. I know quite a few people who paid around 100k to become linemen and get paid very well. \n\nStandard College doesn't seem like the route to success.",
            "title_similarity": "0.7520404",
            "sentiment_compound": 0.7338
        },
        {
            "id": "h4vsri7",
            "score": 1,
            "text": "All investments have no guarantee of return.\n\nThe stocks of my chosen company could go out of business, and I could have no return whatsoever,\n\nIt‘s just how risky it is, and whether or not the risk is worth the potential benefit. This is debatable.",
            "title_similarity": "0.5691614",
            "sentiment_compound": 0.2439
        },
        {
            "id": "h4vszvz",
            "score": 1,
            "text": "College isn't needed to be successful, but I'm pretty sure she was just trolling and there was no UFC job.",
            "title_similarity": "0.5471374",
            "sentiment_compound": 0.7814
        },
        {
            "id": "h4vtont",
            "score": 1,
            "text": "I agree. But it is still a necessity for some fields and does increase the odds of making a living wage. Although with a lot of those fields, you should probably get a master’s these days. It isn’t a game of guarantees, it is a game of probability. \n\nTo decrease how much you spend, go somewhere where you get in-state tuition. And consider going to a community college if you are really worried about money. Some even guarantee getting into solid state schools if you have a good GPA.",
            "title_similarity": "0.6774821",
            "sentiment_compound": 0.8276
        },
        {
            "id": "h4vtq8o",
            "score": 1,
            "text": "Depends on what you study",
            "title_similarity": "0.09420572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vu8mq",
            "score": 2,
            "text": "My income prior to completing under grad was $31,000. Two years after, $75,000. Two years after completing MS, $84,000. Seven years after that, six figures plus a bonus that's above the poverty level by itself. I just started my MBA. We'll see.",
            "title_similarity": "0.67180556",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h4vuai6",
            "score": 1,
            "text": "No investment can guarantee return. Except Bernie’s of course.",
            "title_similarity": "0.3863513",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h4vx96m",
            "score": 1,
            "text": "I think there is value in a college degree, but I also agree that the rate of return is less than what it once was.\n\nIn the \"good old days\" having a college degree essentially garunteed a high paying job, at least enough to afford a house and family.\n\n4ish years and you're set almost for life, a small and manageable amount of debt.  Many people got out of college debt free because of lower prices, etc.\n\nNowadays having a college degree does not garunteed anything.  In some fields, such as engineering, it is almost a requirement for entry level positions.\n\n4ish years of college + ??years of debt for an entry level job.  Can't afford a house or family.\n\n\nBeing educated and learning new skills is always a good thing imo.  College itself isn't really the problem, it's a mixture of the job market, housing market, economic issues, etc.  I agree with your opinion that the return is worse, but I disagree that college is really the issue.",
            "title_similarity": "0.7079038",
            "sentiment_compound": 0.5867
        },
        {
            "id": "h4vxa3a",
            "score": 1,
            "text": "That's most investments. There's always a \"risk\" that you won't get anything in return. Owning a business doesn't guarantee profit. Owning bitcoin doesn't guarantee profit.",
            "title_similarity": "0.52047086",
            "sentiment_compound": -0.8122
        },
        {
            "id": "h4vxcd8",
            "score": 1,
            "text": "Uhhh, getting a college degree 20 years ago was an investment with no guaranteed return.",
            "title_similarity": "0.65446883",
            "sentiment_compound": -0.296
        },
        {
            "id": "h4vxcif",
            "score": 2,
            "text": "Hard disagree, people need to stop pursuing useless liberal arts degrees which have absolutely no career prospects. I majored in chemistry, spent 120k. I am now a 25 year old who makes 80k a year. It would be extremely difficult to be even close to this without a degree.",
            "title_similarity": "0.72592056",
            "sentiment_compound": -0.9251
        },
        {
            "id": "h4vyt29",
            "score": 1,
            "text": "Hasan Minhaj covered this topic (\"Is College Still Worth It?\") on the *Patriot Act* a while back. As he says, there are penalties for not having a degree. However, there is definitely a problem within higher education. The issue is not that the world in changing in such a way that degrees are becoming worthless; rather, the issue is that academia is becoming more commodified in a way that exploits adjunct instructors and diminishes the quality of the students' experiences as a result. As an adjunct professor, this topic is important to me, so I actually transcribed a lot of what Hasan said:\n\n>There are real facts in favor of college: over their careers, women with a college degree earn about $450,000 more than high school grads. For men, it’s $660,000 more. **For low-income students, a college degree may be the single best engine for social mobility.** If you grow up poor and graduate from college, you have a 90% chance of getting out of poverty… So the benefits of having a college degree are obvious. **What you might not realize is that the downside of not having a degree is getting worse.** In the 90s, jobs that paid at least $35,000 were held by college grads 40% of the time. Today it’s 55%... Working class life is now more grueling than ever. Look at the number of white people who died from deaths of despair. Do you see what’s happening here? College used to be aspirational; it was your shot at a better life. But these days, you’re not really rewarded for getting a degree. It’s kind of expected. **But you are definitely penalized for not getting one.**  \n>  \n>We all know college is expensive. But what you might not know is that the product is getting worse. Just look at what’s happening to tenured professors. Tenure is when a university gives a professor lifelong job security to do research and teach… Good professors are necessary… But tenured professors are being replaced with a cheaper option… Adjuncts are the gig workers of higher education. And they are now teaching a lot of classes. Since 1975, the percentage of tenure or tenure-track professors has dropped – but non-tenured teachers has shot up. **I’m not saying adjuncts are bad. It’s just that they’re expected to do the same work as tenured professors while getting treated like shit. If your professor is running from college to college, working through pneumonia, and living in their car, it’ll probably impact the quality of your education.**  \n>  \n>Adjuncts have it bad, but there’s one group that has it even worse: teaching assistants, grad students who are also paid to teach undergrads… At Purdue, 26% of grad students are the primary teach for at least one course. TAs average less than $14,000 a year.  \n>  \n>Grad students have been protesting at Harvard, Yale, and the University of Chicago. So if you’re an incoming freshman, think about what this means. You’re paying a lot of money for school, but only a fraction of it is going to your education. So you’re probably wondering, “Where is my money going?” … **While colleges were losing tenured professors, they were beefing up administrators at an insane rate.** In over 30 years, the number of administrators at private schools shot up 135%. … High-level administrators are raking it in. In less than 10 years, the number of presidents and chancellors making over a mil went from 28 to 76. That is an exponential spike. But presidents aren’t even the highest-paid administrators. If you want to see who’s really making bank, don’t look at who runs the school. Look at who runs the endowment… **The people who manage that endowment often get paid more than anyone on campus.** In 2014, Yale spent $400 million on investment managers – nearly three times when they spent on tuition assistance. Which is odd because these funds are massive.  \n>  \n>Bottom line: **When you donate to a university, you’re basically donating to a hedge fund with the same name as a university**. And clearly endowment managers have a lot of responsibility. But the question is, does it benefit your education?  \n>  \n>Most schools only spend about 5% of their endowments every year. And Harvard admits that 30% of what they do spend is flexible – that’s $600 million flexible dollars a year… So when you see schools relying on gig workers, firing employees who strike, boosting president pay, and dumping money into hedge funds, this isn’t the playbook of an academic institution. **This is the playbook of a corporate institution. And that’s a shift that’s been going on for a long time.** Tuition used to make up a third of \\[public school\\] funding. Today it’s almost half, which might not seem like a big deal, but it comes with a huge shift in priorities. If schools live or die by tuition, what do you think priority number one is going to be? Chasing down kids who come from money… Before COVID, colleges were transforming into playgrounds for rich kids.  \n>  \n>What is going on? We are turning universities, one of our best tools for social mobility, into a Carnival Cruise that caters to the rich. And that inequity is only going to get worse… So while we’re figuring out what college will even look like in the future, now would be a good time to ask: **What value are you even getting out of these schools? We’ve clearly shown college is a business, which means you’re the customer.**  \n>  \n>From [The Patriot Act](https://www.youtube.com/watch?v=YytF2v7Vvw0&t=6s)",
            "title_similarity": "0.6635094",
            "sentiment_compound": 0.9172
        },
        {
            "id": "h4vz30c",
            "score": 1,
            "text": "I use all 4 of my degree's as mousepads. \n\nI use the least scratched up one to do my work. \n\n&#x200B;\n\nCan't say I'd recommend college, and its kind of a rip off.",
            "title_similarity": "0.58853483",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h4w06ai",
            "score": 1,
            "text": "This isn’t new or unusual. A degree has never, ever, been a sure bet to a lifetime of lucrative, meaningful, employment. What is new, is all the whining about it, as though it should be guaranteed and free.",
            "title_similarity": "0.5041572",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h4w3jj0",
            "score": 2,
            "text": "All investments come with risk. College, considering you choose a good major is pretty good risk-reward imo.",
            "title_similarity": "0.45508316",
            "sentiment_compound": 0.8147
        },
        {
            "id": "h4w3o3k",
            "score": 1,
            "text": "That all depends if you go to college for an education or go to college to meet the qualifications of. Jobs you're hoping to get. Go for an education and it's perfectly achievable to get one.",
            "title_similarity": "0.55866957",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h4w9g5z",
            "score": 1,
            "text": "Here is an anecdotal story, if you're willing to accept that as an argument. I come from a lower-middle-class family, my mom is a nurse, my dad is a laborer. I got my degree almost 4 years ago at the age of 30. I went from working place to place to place over a 10-year time span.  I got my degree in Philosophy, to this day I acknowledge is a worthless degree, at least in terms of my current field I work in and plus I didn't pay much attention in class about the relevant information, but that's another story....but I don't regret getting it. Because getting this open a door for me, it gave me an opportunity to work abroad as an English teacher. I'm not that great, I'm average at best. But getting that piece of paper was probably the best investment I've gotten. It has open the door for me where I now enjoy a higher quality of living, higher pay than if I was to be without it or if was still living in my home country (USA) I would not be enjoying what I have now in my host country.\n\nI don't dismiss there have been successful people in the world without a degree such as Mark Zuckerburg for example.\n\nHowever, there are some place that YES, do require you to get a degree, take foe example lawyer, Surgeon, Teacher (I think requires one) and depending on where you would like to work perhaps even a computer scientist or engineer where they do look for people who have a the necessary college qualifications to work in.",
            "title_similarity": "0.77320486",
            "sentiment_compound": 0.9761
        },
        {
            "id": "h4w9v1w",
            "score": 1,
            "text": "What about joining the military as a way of getting a degree at a much lower cost? On the surface it sounds like a good idea, but I have no idea on the specifics.",
            "title_similarity": "0.51165444",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h4wa30a",
            "score": 1,
            "text": "There was never a guarantee but competition has gone up with more graduates all the time.  If unsure I encourage you to research Trade school as a viable and often better paid alternative.",
            "title_similarity": "0.7051029",
            "sentiment_compound": 0.7529
        },
        {
            "id": "h4waomj",
            "score": 1,
            "text": "A college degree is useful for making money working for someone else.   So it can be useful for that.    As shown by quite a few entrepreneur billionaires who dropped out of college, obviously it is irrelevant if you want to make money based on your own work and ideas.  However, the latter are probably in the minority.",
            "title_similarity": "0.7193695",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h4wbx5u",
            "score": 1,
            "text": "Sure, if you don’t have a plan, then you’re planning to fail. Some degrees offer limited or no career prospects. Others offer very lucrative opportunities. So if you want to make a lot of money choose a career which you think you will be good at, study if necessary and reel in the cash. If you don’t want cash, then go for your passion if you like. No one is telling you an arts degree will be a net positive financial decision.",
            "title_similarity": "0.59453917",
            "sentiment_compound": 0.8102
        },
        {
            "id": "h4wef68",
            "score": 1,
            "text": "I think you need to reassess what you mean by ‘success’. Do you mean ‘get rich’? Or ‘have my dream job’? Or ‘survive comfortably’?\nI’m any case, it’s about what you want to do. You want to be a dentist, aerospace engineer, lawyer, zoologist? You need a degree or you can’t be those things (for example). Want to be a sales executive, musician, illustrator, small business owner? Then you’re right, those careers are more about craft, personality and network, no degree needed. It’s super subjective.",
            "title_similarity": "0.6589256",
            "sentiment_compound": 0.7622
        },
        {
            "id": "h4wf410",
            "score": 1,
            "text": "I'm basically copying these lines from a video I watched, college acts as a security net. Even if you fail at art music media sports or your passion you always have some staple job to fall back on. While people without a degree would be rendered jobless if they fail and without money",
            "title_similarity": "0.71576655",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h4wg1x0",
            "score": 1,
            "text": "Two points:\n\n1. As others have touched on, the investment is you being educated.\n\n2. I realise how America-centric maybe your outlook is, but if you ever want to travel or live abroad the degree will allow you to do this. Speaking plainly if you don't have a degree for some countries, you will be considered persona non-grata - they don't want you working there. If you ever marry a foreign guy/gal you may think 'Thank f***, I got that degree'.",
            "title_similarity": "0.6260797",
            "sentiment_compound": 0.6924
        },
        {
            "id": "h4whnoe",
            "score": 1,
            "text": "Well, not sure this will change your stance at all but it never has been. I don't think that \"today\" is any real change, although matters may well be exacerbated.\n\nI got my first degree in the early '90s, my second in the early '00s and while I worked in my field for a bit, I certainly never made enough to pay for my tuition + opportunity costs by any measure.\n\nI don't regret a moment of it, nor even the cost, but I know *plenty* of people that went the degree route and ended up doing other things that certainly were not directly facilitated by their studies. From a purely financial standpoint there is no way that they provided a reasonable return for many, many people even back then.",
            "title_similarity": "0.69559246",
            "sentiment_compound": 0.9075
        },
        {
            "id": "h4wik0s",
            "score": 1,
            "text": "I firmly believe in education. And the anti-college rhetoric we keep seeing peddled online saddens me. \nAs a university grad myself I have a few things to say about this:\n\n(1) some of the more famous people who push this anti-college rhetoric themselves like Elon Musk and even Jordan Peterson; are themselves highly educated men. I find it very disingenuous that a highly successful person with formal education would turn back and tell aspiring youth that formal education through college is useless.\n\n(2) the investment of college is your education. Your education is never a waste of time. That's like saying eating healthy and exercising is a waste of time if you don't  become an athlete.\n\n(3) picking *useless degrees* is more reflective of a bad personal choice than of the  college itself being useless. You need to understand the job market before choosing subjects. In school I was always taught that choosing subjects is a combination of \"following your dreams\" and **being realistic**\n\nFor example. I personally chose to study hard sciences, in college, which I then used as a springboard to get into med-school. You absolutely  CANNOT get into med school or nursing school without a science degree.\n\nWhat frustrates many young Americans now is that they choose subjects as passion projects instead of being practical. If you don't  see a clear path into how you are going to turn a literature degree into a job, then for Christ's sake don't  waste your money on a literature degree just because you like Shakespeare.\n\n(4) As has been said many times over drooling over the few exceptional people as examples of how you can make money without formal education is a recipe for failure ! Bill Gates did not become  successful *because* he dropped out ofcollege.....he became successful in spite of it.\n\nYou cannot take the example of a tech genius as evidence that everyone can drop out of college and learn to code and become successes.\n\nThere are things that Bill Gates can understand intiuitively, that the average person needs a whole class to understand.\n\n(5) confirmation bias. business success is very fickle and hjghly based on luck. For every American Idol winner who quit school to follow his dream, there are 1000s of others who are still busking their way in the subways looking to be famous. \n\nStatistically speaking you are more likely to get a job with a college education than without. Do not fall for the hype.\n\nBoth Ray Charles and Stevie Wonder are world famous black blind musicians....does that mean  blindness helps you play music ? Of course not.\n\nAll the street musicians who quit school would probably be better off with a music degree. The music degree might not get you on stage like Michael Jackson, but it could get you in the studio as a producer or sound engineer etc ....not as glamourous as being on stage, but certainly better than sleeping in your car.",
            "title_similarity": "0.688895",
            "sentiment_compound": 0.8771
        },
        {
            "id": "h4wjnrn",
            "score": 1,
            "text": "Why don't you study abroad USA? OR move away from that shithole.",
            "title_similarity": "0.4126475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4wjqji",
            "score": 1,
            "text": "Journalism? I agree. Business/engineering? Absolutely not.",
            "title_similarity": "0.33862686",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h4wkw29",
            "score": 1,
            "text": "More of a liability from an accounting standpoint, if you take on debt that is.",
            "title_similarity": "0.26060268",
            "sentiment_compound": -0.552
        },
        {
            "id": "h4wnd3w",
            "score": 1,
            "text": "Laughs in non-USA",
            "title_similarity": "0.018237758",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h4wnvv7",
            "score": 1,
            "text": "It literally depends on what you are learning in college. Some degrees are really only for rich people these days. Either because they can afford to lose an investment or they have the right connections to make their art degree (example) profitable.\n\nBut when was it different? Getting an unprofitable degree in the 70s was still unprofitable, only difference was it was cheaper to live. College didn’t change, the jobs the economy wants didn’t change that much, the main difference is the cost of living.\n\nBtw comparing yourself to a tiktoker is a waste of time. Were you jealous of Justin Bieber back in primary school?\n\n“Why should I even finish primary school when this bieber guy is walking around with his guitar making millions”",
            "title_similarity": "0.6947425",
            "sentiment_compound": -0.7599
        },
        {
            "id": "h4ww7vs",
            "score": 2,
            "text": "And? What exactly is there to change in your view? It’s been like that since the beginning of time. Nothing is ever guaranteed especially under capitalism. This is just a poor premise. Oh… You’re 22. Carry-on.\n\nThis should be removed . \n\nCollege is obviously an investment. But if you’re not willing to do the work and you’re not willing to try, you will have wasted your investment. Not unlike a farmer who doesn’t Milk his cows. Once again this is just a dumb premise.",
            "title_similarity": "0.6821984",
            "sentiment_compound": -0.8862
        },
        {
            "id": "h4wx48q",
            "score": 1,
            "text": "Alternative view.\n\nIf you feel like you gained nothing from your undergrad then you wasted it. You spent 4 years doing highly specialised work you had to have developed some skill you wouldnt otherwise have if you bothered at all.\n\nI did chemistry theres generally no issue I've come into contact with since graduating that I cant breakdown and assess. Thats because of the critical thinking skills I got from for years in STEM.\n\nFair enough if you dont think thats worth paying the prices you pay in somewhere like the states but as far as Im concerned Im sorted to work in any field now because I know how to look at things from a detached and logical POV something that I've noticed people who dont come from my science background lack alot of the time.",
            "title_similarity": "0.7551813",
            "sentiment_compound": -0.6466
        },
        {
            "id": "h4wxjrs",
            "score": 1,
            "text": "I'm going to put it simple, you are betting on a 100 years old model to still working despite all the world changes; in my case, I entered the university basically due it being \"the right thing to do\", luckily, and also give that I was already good with computers, landed my first IT job when I was at 3rd semester, and from there, month after month I learned how disconnected are academy and real world, and how, at best, a 20% of what we where though was actually useful, and the reason? Almost no professor had jobs on practical fields, all of them were researchers, but had no idea of the real craft, the last straw came around 6th semester, when my project management teacher, was my actual PM at my job, yet, what she used for class, was million light years away from reality, and when I asked about the reason, she just shrugged and said \" that's the university curriculum, and I have no say on it\", knowing that I was in a \"top 5 university\", busting my ass off to pay for it, I just never came back.\n\nNowdays it's been almost 17 years since I made that choice, and I had a great career, and my only regret is not making that choice sooner. Just be sure to be always educating yourself (college isn't the only way), and find something that you love, and you're good at. Cheers",
            "title_similarity": "0.7661029",
            "sentiment_compound": 0.9527
        },
        {
            "id": "h4x0zti",
            "score": 1,
            "text": "That is true in the USA. I live in a country where every public university's tuition fee is 697€ per year, which is almost symbolic. There are even countries where university is free. If you live in such a country, the price of getting a degree is pretty much just the cost of living for 5 years. It is still an investment, since you probably aren't going to be working and earning money in those years, but it carries much less risk.",
            "title_similarity": "0.69498014",
            "sentiment_compound": 0.4478
        },
        {
            "id": "h4x59xj",
            "score": 1,
            "text": "Not just today ... it’s been that way for almost thirty years. In the late 90s when the US government started federally finding student loans which allowed universities to increase (hyperinflate) tuition, the value of college education began to narrow.",
            "title_similarity": "0.72398597",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h4x66u3",
            "score": 1,
            "text": "First off, I am a huge supporter of college education being available for EVERYONE - affordably. I think an associates and bachelors degree can offer insight and critical thinking that your mind isn't quite ready for in College. That does not mean that a college education is needed for everyone - some are bright and have the critical thinking capabilities beyond many of the graduates I know without having even obtained a high school education. \n\nHowever - it all depends on the degree chosen, in my opinion. I am a registered nurse. I have my Bachelors degree (not required - I could have just obtained my associates and stopped there). I graduated in 2014, and I've always been offered the job I applied and interviewed for. :) Research is always important - and having a backup plan just in case things don't work out.",
            "title_similarity": "0.6906949",
            "sentiment_compound": 0.5062
        },
        {
            "id": "h4x94hr",
            "score": 1,
            "text": "Dictators and autocrats rule by keeping populaces stupid and keeping as many people poor as possible. The two work hand in hand. So it is no wonder that Black people and poor rural Whites are intentionally kept from 4-year college in various ways in the USA. Black people do more crimes? Um, no, they just have less opportunities to succeed in school. This is especially highlighted by Biden's recent 2-years free of community college. That is worthless. That is a band-aid on a hemophiliac with ebola. The \"community-college\" education is inferior and almost worthless. It has no guiding principles to help students choose career paths, and it will harm more than help, reinforcing that poor people get 2-year, others get 4.\n\nSo if you love class division, and a barrier that prevents 99.99% of poor or lower middle-class to get a 4-year degree, keep thinking what you are thinking. Boot-strapping yourself out of poverty and overnight success is an almost-mythic event that is less possible than winning the lottery. As the rich get richer in the USA, it will get harder and harder for folks that aren't rich to get a 4-year degree. 10 years ago Pell Grants covered 80% of a paid-college tuition, and now they cover about 30%. Meanwhile we spend almost 40% of our entire budget on the military.\n\nPaid college is a racket meant to make certain people rich, help the rich get richer, and keep the poor uneducated and more likely to follow along. You are right that college is a scam, but a different kind of scam than you suggest. 4-year college is absolutely necessary to survive today, and it needs to be 100% free.",
            "title_similarity": "0.6468956",
            "sentiment_compound": 0.5063
        },
        {
            "id": "h4xdx1f",
            "score": 1,
            "text": "Here's my pitch that has nothing to do with what you'll learn, the network you'll grow, etc.:  \n\nNot having a college degree will limit your opportunities because people use your education as a shortcut for your potential. \n\nIn every job you take for the rest of your life, it will make it harder to advance to a management position if you don't have a college degree. It'll make it harder to get an analytical position at any organization, no matter your skills/background. Not having a degree excludes you from the majority of well-paying jobs, which is why degree-holders [make so much more](https://www.bls.gov/emp/chart-unemployment-earnings-education.htm) than non-degree holders. Imagine two job applicants who are similar in every way, but one has a degree. Most of the time, the one with the degree gets the job.\n\nYou might be able to overcome those challenges, but it will be more difficult. People will judge you for what you don't have, not what you can do. \n\nIt will [impede](https://www.theguardian.com/lifeandstyle/2015/nov/10/dating-gap-hook-up-culture-female-graduates) your relationships. Your education shouldn't matter to people, but it does. It's a heuristic that people use for your aptitude and potential. There are lots of people who probably don't know that they wouldn't consider dating someone w/out a college degree, but in practice they don't. \n\nMaybe you think that's unfair, and you want to go it alone. If you want to start a small business, having a degree makes it easier to get a [loan](https://www.forbes.com/sites/dereknewton/2020/01/25/a-college-degree-can-now-help-you-get-a-loan/?sh=31f64cc71f9a), and because we live in a world with finite money, by extension, harder for those without a degree to get a loan. \n\nI think most of this is unfair, but it's also a good reason to get an education. There are ways to succeed without a degree, but there's a reason why so many adults who never went to college urge their kids so fervently to go: they want those kids to avoid a lifetime of having to work harder than their peers for little reward and few opportunities.",
            "title_similarity": "0.7367341",
            "sentiment_compound": 0.7919
        },
        {
            "id": "h4xklom",
            "score": 1,
            "text": "When I was a junior in HS, I told my Mom and Dad that I wanted to change from college prep to auto-mechanics.  My Dad went over the top.....  so I went to college, etc, etc.....  \n\nNow I own and run a small company that employs Millwrights and other field mechanics.  As you can imagine, I do all the things necessary to keep it all together with little time off.\n\n At the end of the day, my millwrights earn $46 per hour with company truck and full benefits + vacation.  They can work overtime as they wish  and many of them end up making $130-145 k per year.  They have little or no college training but still make almost as much as me without the stress and heartburn.\n\nUnless you want to be a doctor or engineer,  go get some practical field training and forget college.  By the way, none of my workers have a student loan to pay back.",
            "title_similarity": "0.8069977",
            "sentiment_compound": 0.4744
        },
        {
            "id": "h4xvydy",
            "score": 1,
            "text": "I wonder if it ever was an investment. The rich people, send their rich kids to the best schools to interact with other future ceo, politicians, etc. So they have a huge advantage. \n\nBut middle class people, with a couple off exception, they hold jobs that shouldn't even require a bachelors degree. But school was cheap for them decades ago so they weren't really losing out on much.",
            "title_similarity": "0.67304647",
            "sentiment_compound": 0.8873
        },
        {
            "id": "h4xyund",
            "score": 1,
            "text": "I'd like to repeat, I'd rather go to. Community College and earn my degree at a Reasonable and Affordable price than Pay extra for the University Dean to get a higher pay raise. \n\nThis is an excellent article written by a USC professor on Corruption in Universities. This lists things from accepting Donations bribes, and appointing and Overpaying for Business Men to run school boards and to act as Deans. \n\nYou can reform these universities by simply Boycotting them. Go to a State technical college, pay off the tuition with your 4k Pell Grant, and start working debt free in a field with a high demand for workers. All within a year. \n\nIf you REALLY want a higher education, then go to a community college. \n\nI don't care if you disagree, it's not my job to change your mind. I'm giving valuable insight to those who will listen and want a better future. \n\nhttps://www.google.com/amp/s/www.washingtonpost.com/outlook/2019/03/19/college-admissions-are-corrupt-because-universities-are-heres-how-fix-them/%3foutputType=amp",
            "title_similarity": "0.7692126",
            "sentiment_compound": 0.91
        },
        {
            "id": "h4y4n7n",
            "score": 1,
            "text": "We should not make general statements based on rare cases. The vast majority of opportunities come _only_ after completing a college degree. Just because Bill Gates and Mark Zuckerberg did not finish college does not mean CS majors should quit pursuing degrees.\n\nFor Addison Rae's case, her assignment stems more from having an established following more than journalism credentials. Her professional success does not directly relate to her education. Someone without such a social media presence would need to rely on education more than Rae.\n\nSomeone without a formal education might end up in a similar situation by luck, persistence, personality, etc. Not many of the A-list Hollywood stars have extensive actor training nor performing arts degrees. Charisma and sex appeal sell more tickets than years of studying theater.",
            "title_similarity": "0.6452073",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h4zsywk",
            "score": 1,
            "text": "Lek'trician Here...\n\nYou, in the same amount of time, can join a trade, make more money without incurring any debt, and become financially independent, as you can from a degree(s)\n\nI make double what the Electrical Engineers make that hire me, at first blush they see a rag tag crew of miscreants logging into their PLC's and fixing their muti-million dollar equipment, and think... *\"at least I'm not that guy...\"* dirty, sweaty, and unshorn...until they see the invoice for $450k after 12 days of work... then they know, then they realize what we are and what we can do...\n\nThe only reason I would go back and finish my masters degree would be for my own personal benefit, but at this point I am reminded of the *\"how do you like them apples\"* scene from *Good Will Hunting* where the education I seek, I can readily attain for $2 in late fees at a library...",
            "title_similarity": "0.71437585",
            "sentiment_compound": 0.8992
        },
        {
            "id": "h52l857",
            "score": 1,
            "text": "Here is the thing though, no investment gives you a guaranteed return. Even things that seem like they're pretty guaranteed, for example treasury bonds, are still relying on the fact that the government of the United States of America will still be around in 30 years, and I got to say it's not looking great.\n\n>I think success is truly up to ourselves regardless of a college degree\n\nI mean, that's tautologically true. But having a college degree does in fact make you more marketable, provided you got a degree worth having and not a gender studies or English literature or art history or underwater basket weaving degree.\n\n>While I still feel that college holds less value than it once did\n\nThe kinds of jobs where a college degree was only required to show that you could handle certain kinds of work are going away. But stem jobs are exploding, and you definitely need specialized training to be able to do those jobs well. So at best you can say that the value of college is becoming much more dependent upon what degree you get, as stem degrees are still enormously valuable to your lifetime earning potentials.",
            "title_similarity": "0.71191627",
            "sentiment_compound": 0.9853
        }
    ]
}