{
    "CMV: The US media frequently uses propaganda to turn lower and middle class groups of people against themselves\nThe powers that be are terrified of what a unified lower and middle class focused on bettering their communities are capable of. They fracture communities by making the groups of people within them believe that they are fundamentally different and have reason to hate each other with identity politics and Omni-channel propaganda. You can’t look something up on google without getting targeted clickbait designed to make you angry shoved in your face. They know that a common purpose is what communities need to see past each other’s differences that and once we do, they won’t be able to play us anymore.\n\nEdit: grammar": [
        {
            "id": "h57skyp",
            "score": 1,
            "text": "/u/Dabstronaut77 (OP) has awarded 5 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/okh3do/deltas_awarded_in_cmv_the_us_media_frequently/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.37871283",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h55suu9",
            "score": 159,
            "text": "[removed]",
            "title_similarity": "0.17341743"
        },
        {
            "id": "h56vcry",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341743"
        },
        {
            "id": "h55lisp",
            "score": 124,
            "text": "Occam's razor - the simplest answer is usually correct. Can you prove that divisiveness is explicitly used to subjugate the poor in terms of content strategy?  \n\nThe simplest answer is that the US media will air whatever gets the most attention. It just so happens that most content that gets a lot of attention is highly graphic, divisive, or drives conflict.",
            "title_similarity": "0.70351106",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h56ymqk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341742"
        },
        {
            "id": "h57fbk6",
            "score": 1,
            "text": "That's not just the US. That's a standard method for elites to reinforce their own social class and power, and has been for a very long time.\n\nThe methods may change based on tech, but the goal and results are basically a constant in almost all societies.\n\nIf you look into what International Relations courses teach,, you'll find this in many places, regardless of the type of government.\n\nEdit: Article from Pew Research with many SMEs discussing how technology and communications are affecting democracy and government, among other things: https://www.pewresearch.org/internet/2020/02/21/concerns-about-democracy-in-the-digital-age/",
            "title_similarity": "0.5896627",
            "sentiment_compound": 0.0
        },
        {
            "id": "h569clz",
            "score": -3,
            "text": "Not US media.\n\nRIGHT WING media.\n\nLeft wing media turns us on The Institutions of Racism and on Oligarchs, not each other.",
            "title_similarity": "0.7378247",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h55n293",
            "score": 15,
            "text": "Do you believe there is an unbroken chain of \"the powers that be\" which have governed across the entire world for all of human history, all with the seemingly singular purpose of making societies less stable and less productive via infighting?",
            "title_similarity": "0.64671767",
            "sentiment_compound": 0.228
        },
        {
            "id": "h55wljs",
            "score": 48,
            "text": "You have the right idea, but are looking at it from the wrong end. \n\nFirst, any network’s goal is to be the only network anyone watches. \n\nSecond, the mass division in the country is coming from the political parties themselves. There is a reason they can’t solve race/guns/abortion, as those three big ticket items will keep voters apart. Why do they want this, because if you take out those three issues, most lower and middle income people will find they have the same general problems - not enough time/money, rising costs, retirement concerns, etc.. Why they do this, rampant speculation, but both sides are guilty of this type of demonization, and notice they do it on the same issues. \n\nThird, while the media does play their role in entrenching this in our national zeitgeist, they are merely reacting to what ads their viewers are willing to watch. The ad companies know that people who watch Fox News don’t want a pro-“liberal concept” ad, and those that watch MSNBC don’t want a pro-“conservative concept” one. \n\nIn summation, yes, the powers that be are terrified of a unified lower and middle class, however the political entities are the ones furthering this, and media outlets are just willing participants and passive mouthpieces.",
            "title_similarity": "0.84551495",
            "sentiment_compound": -0.6798
        },
        {
            "id": "h55ly6b",
            "score": 1006,
            "text": "Let's apply Occam's razor here. Which of the following has the fewest assumptions?\n\n1. These powers at be are purposefully manipulating the public through news outlets; focusing on driving communities apart through fear based propaganda.\n2. Media News outlets need viewership so advertisers pay to show their ads; and they've found keeping their viewership fearing things keeps them coming back to them for more.\n\nIMO, 2 has fewer assumptions than 1.",
            "title_similarity": "0.8693368",
            "sentiment_compound": -0.9017
        },
        {
            "id": "h5789wk",
            "score": 6,
            "text": "Where do I start? First, your statement is so vague that is almost meaningless. Which media? Propaganda about what? Who are those \"powers at be\"? \n\nSecond, will you please give any examples? A specific media, using specific propaganda tool to specific class groups against themselves?\n\nThird, what makes you believe that \"we\" (whoever that it) are capable of \"see past each other’s differences\"? Will you please give example in history where that has happened? \n\nIMO (and others have expressed similar sentiment), a lot of what you see in US media has the intention to raise advertising revenue by gluing it to the television (or computer). Serious journalism such as the one we had in the early nineties no longer sells. Instead of discussing serious and impactful issues, the media is bombarding us with scandal. And of course, Fox News discovered that when you target someone who is even slightly leaning to the right, you can scandalize them with all kinds of stuff about the left. Universal healthcare will turn us into Venezuela (and not Norway) has been one common team. That was so successful that the other media followed suit and started targeting those leaning to the left. Trump gave them ample opportunities to scandalize their target audience and they took it. It is not a coincidence that CNN viewership fell so dramatically after Biden took office. All of this was dug by the political parties which rake more donations than ever. It is all about getting attention and money. Splitting the society is just a collateral.",
            "title_similarity": "0.744826",
            "sentiment_compound": 0.7313
        },
        {
            "id": "h5658f3",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.17341743"
        },
        {
            "id": "h5796kq",
            "score": 3,
            "text": "Love your idea, not really trying to change your view but shift it.\n\nIn order for Democracy and capitalism to flourish the population must be educated and engaged. \nA certain party or politician is not acting within their constituency’s best interests, we vote them out.\nA certain business is employing near or actual slave labor or causing extreme harm to the environment, we band together and boycott their products. \nSame goes for media, the media doesn’t really drive the narrative as much as they follow what their target segment of the population is wanting to watch.\nWe’ve lost the idea that we have to act as a cohesive unit a d impact someone’s bottom line in order to get anything done in this country, it’s a sad fact. \nTo be fair, 🧐, it does seem that people are starting to realize the power of the voter/consumer and we have to continue to develop these skills in order to progress and protect our civic and economic liberties.\nGreat post, mate!",
            "title_similarity": "0.7943276",
            "sentiment_compound": 0.9796
        },
        {
            "id": "h55nef7",
            "score": 11,
            "text": "You would see it that way if your goal is to encourage the organization of class-based identity politics, where the lower and middle class  organizes to defeat the interests of the upper class.\n\nBut then again, anyone else who cares more about other issues than class, would see it the opposite way.\n\nAn ethno-nationalist might say that the US media is using woke propaganda and class warfare, to make sure that the white working class and the white elites don't fulfill their purpose as a volk and unite to expel those who are not like them.\n\nI figure you wouldn't enjoy the rhetoric of that, but it isn't strictly peaking *untrue*. The media does in fact tell people of different races to see each other as allies, it attempts to appeal to upper class white people's desire for multicultural pluralism all the time, and less so, but also for working class people's soldidarity with other workers. \n\nOnce you have a plolitical goal, and a perspective of who are your allies and your enemies, it is easy to say that the media not always seeing everything through that lense, is manipulative propaganda.",
            "title_similarity": "0.84018314",
            "sentiment_compound": -0.8301
        },
        {
            "id": "h56mzhh",
            "score": 0,
            "text": "This is everything. 100%  spot on",
            "title_similarity": "-0.023288231",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57swoh",
            "score": 4,
            "text": "For one, they differentiate between the lower, middle, and upper classes. In reality there are only two. Those who trade their labor for a wage, the labor class, and those who use their capital to generate income, the capital class.",
            "title_similarity": "0.40228924",
            "sentiment_compound": -0.296
        },
        {
            "id": "h57woov",
            "score": 0,
            "text": "You're getting targeted ads that pit you against other economic class? I get targeted ads for nail care products. Maybe you are searching topics that are likely to raise your hackles. I suggest worrying about your cuticles instead.",
            "title_similarity": "0.7585452",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h58yaau",
            "score": 0,
            "text": "No argument here.",
            "title_similarity": "0.028912727",
            "sentiment_compound": 0.2755
        },
        {
            "id": "h55wjv4",
            "score": 26,
            "text": "I think people do this all on their own. I think somewhere deep in our DNA, there's what you could call an otherising instinct. \n\nI also think the people who say what you say always have some program that they'd like to be made law, but they don't have the votes. \n\nIt seems like what your saying is kind of like, \"you stupid poor people, you don't know  what's best for you, but I do.\" \n\nI don't know what your class status is. But it's always interesting how people who think what you think are smart enough to see through the propaganda, unlike the sheep, who fall for it every time. \n\nIt's like, right now, the poorest people have the easiest access to the most information for the lowest cost than ever before. Can you name me a subject you couldn't give yourself a crash course in because of the internet? \n\nStupid people are going to do what stupid people do. And I think one of those things is hating other people for bad reasons.",
            "title_similarity": "0.7549287",
            "sentiment_compound": -0.9818
        },
        {
            "id": "h55n9ac",
            "score": 24,
            "text": "What are you considering to be \"the US media\" here?  The only example you give is Google - which I would argue isn't media at all.  Can you point to examples of NBC News, The New York Times or NPR \"using propganda to turn lower and middle class groups of people against themselves\"?\n\n> The powers at be are terrified of what a unified lower and middle class focused on bettering their communities are capable of.\n\nWho are the \"powers at be\" and what potential capabilities is it that terrify them?",
            "title_similarity": "0.82552385",
            "sentiment_compound": -0.7808
        },
        {
            "id": "h55vz1z",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.20496668"
        },
        {
            "id": "h56m7db",
            "score": -2,
            "text": "Don't forget brainwashing them into being clasist and turning them against the rich as well.",
            "title_similarity": "0.72939646",
            "sentiment_compound": 0.8164
        },
        {
            "id": "h5750jl",
            "score": 2,
            "text": "There’s some possible truth to your theory, but I think that’s a little too “conspiracy thinking”.\n\nAt the end of the day is this: \n\nMedia companies are businesses. And they are selling what their customers want. \n\nIt makes more logical sense that new outlets are keeping up the outrage because that draws in more viewers which means more money in their pockets.\n\nI don’t believe there’s some National cabal of media executives getting together discussing how to pin the average man against each other. That just sounds way too Hollywood for real life. \n\nCould it be true? Sure. \n\nBut the most logical reason why they play up the outrage is to get more dough.",
            "title_similarity": "0.7110401",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h586loz",
            "score": 2,
            "text": "TL;DR: You are hypothesizing a central cause, but the problem is actually the product of mostly distributed dynamics.\n\n(Sorry this is so long...)\n\nFirst, I think that a lot of what you say about the function of the media - what it does, in practice - is broadly accurate. So we agree on that.\n\nThe place where I think your analysis goes wrong is in assuming that there is such a thing as 'the media' and 'the powers that be' that can act in a unitary way. We can look at media at multiple levels to see what I mean. At the broadest possible level, there are a lot of media outlets in the United States focused on a myriad of things. Surely some of them don't function in the way you describe and surely you would concede that. (Think of independent newspapers or local newspapers in some area where you think the political discourse is more to your liking.)\n\nSo right there, we have to qualify your statement by only applying it to a subset of the media. Perhaps this is a dominant and hegemonic subset. Fine...\n\nSo let's look just at the mainstream media. Are you arguing that Rachel Maddow at MSNBC somehow has her show coordinated with Tucker Carlson at FoxNews? How would that work? Do you think they're both in on it...you take this side, I'll take that one, and we'll divide and conquer? When they go and hire staff...do they bring this up in the interview? \"Just so you know...\"\n\nI don't think that's very credible. But, you could argue that they are co-ordinated in another way. The could be hierarchically coordinated...each of these organizations is part of conglomerates and those conglomerates have elites at the top of the organization. It is isn't unreasonable that these people know each other, have common interests, etc. The question then becomes: is there any evidence of that? If these coordinated efforts were going on, wouldn't instructions have to be communicated down the organization? Why aren't there leaks about that? Memos? Exposés? How do these organizations make sure that they only hire people who will keep up the conspiracy?\n\nAnother way in which an organization might be coordinated hierarchically is through incentives...we punish you if you get out line and we reward you if you do the things we want you to do. It's almost definitionally true that this happens. So, the questions now become: (i) is there evidence of this sort of coordination leading to that kind of messaging, (ii) how purposeful could coordination in a system like this be? I encourage you to look at the work of John Dickerson. He's hosted Face The Nation and he's done some other projects. He's a mainstream media guy. He doesn't match the sort of propaganda you're describing. What about David Brooks? He's pretty kumbaya...if a bit tedious. So why would the mainstream media tolerate guys like that if they're set up to do the sort of thing you're describing?\n\nSo, to recap: the media isn't ONE thing, so it can't do ONE thing purposefully, there is no credible evidence of a mainstream media conspiracy and we haven't identified any mechanisms through which the folks at the top could have the sort of control over their organizations that your argument requires.\n\nOk....but your argument does FEEL right, so what gives? There are two other forms of coordination...they just aren't purposeful. \n\nThe first is incentives-based and other people have brought this up....every commercial media outlet has an incentive to drive up viewership and the most reliable way to do that is to scare that audience and engage their negative partisanship. THIS IS A REAL PROBLEM. But it has a distributed cause, not a central one. (Mind you, someone else argued that media outlets have as a goal to establish complete marketshare...that doesn't actually explain the situation you're describing, though. We know what a more concentrated media environment looks like from the mid-20th century: it's pretty vanilla because if you want a lot of viewers, then you can't afford to offend anyone. Once an audience that big is no longer an option, though....then you need a very committed audience. The reasons for this shift are regulatory and technological.)\n\nThe second form of coordination is idealogical. Everyone says the same sort of thing because they believe the same sorts of things because they were socialized in similar settings and share similar experiences. THIS IS ALSO A PROBLEM and it is clearly SYSTEMIC. This is where the sort of playground-elite background of a lot of people in the media is a real issue. But we don't need conspiracies to understand how elite institutions replicate privilege and how elite media institutions tend to bring in people from an elite background. That's a pretty standard dynamic.",
            "title_similarity": "0.56003237",
            "sentiment_compound": 0.9837
        },
        {
            "id": "h55rvlu",
            "score": 5,
            "text": "OP could you give some examples of specific outlets and the propaganda they use?",
            "title_similarity": "0.3494168",
            "sentiment_compound": -0.25
        },
        {
            "id": "h576fi5",
            "score": 21,
            "text": "The media isn't the culprit, people are. Many people *seek out* reasons to be against others, to establish themself as victim and another as oppressor. They find \"identities\" toward certain groups and then become reactionary to outsiders who disagree or don't \"accept them\". The \"common purpose\" is what people think they find in their subgroups, and react to all others as being hateful or wrong.\n\nThe default is much more exclusionary, and it's a learned behavior that requires thought to be inclusive. Seeing past others differences is difficult for many when such differences go against strongly held beliefs. It's why different tribes, countries, etc. exist. It's why there are strong disagreements even within the confines of those societies. \n\nYou're making the argument that there is some \"power at be\" controlling people that \"we\" need to fight against. That's the same rhetoric you are trying to argue against. You yourself are trying to divide people into groups by class. That they are apparently victims rather than free of thought. Why are you free to make this conclusion and not them?\n\n\"I can't go on reddit without political posts designed to make me angry shoved in my face.\" You're post being an example. It's not \"the media\".\n\nYes, the incentive exists and the media does partake. But it's not the exclusive thing you are presenting it to be. It's a function of what people actually desire.",
            "title_similarity": "0.83483344",
            "sentiment_compound": -0.6281
        },
        {
            "id": "h57na3s",
            "score": 7,
            "text": "To /u/Dabstronaut77, **your post is under consideration for removal under our post rules.** \n\n* You are required to **demonstrate that you're open to changing your mind** (by awarding deltas where appropriate), per [Rule B](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_b). \n\n---\n\n**Notice to all users:**\n\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\n\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \n\n\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\n\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\n\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\n\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.6301141",
            "sentiment_compound": 0.6452
        },
        {
            "id": "h55lez1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341742"
        },
        {
            "id": "h55oqyh",
            "score": 1,
            "text": "Let's suppose, for a moment, that you're right and that there's been some kind of deliberate propaganda use to turn lower and middle people against each other in order to keep them down.  If that's true, then how long has it been happening, and how successful has it been?  With a history of successful manipulation like that, the \"powers that be\" have no more reason to be terrified than people that live downstream of a dam or ones that are driving across a bridge do.\n\nIt's also naive to think that the mass media manipulation needs to get people to focus on \"each other's differences\" in order to manipulate them.\n\n\"... Voice or no voice, the people can always be brought to the bidding of the leaders. That is easy. All you have to do is to tell them they are being attacked, and denounce the pacifists for lack of patriotism and exposing the country to danger. It works the same in every country.\"\n-- Herman Göring",
            "title_similarity": "0.809165",
            "sentiment_compound": -0.91
        },
        {
            "id": "h5611wn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341742"
        },
        {
            "id": "h561vw3",
            "score": 1,
            "text": "I wouldn't necessarily say the media directly does that. Its a matter of who trust what from who. The divide largely comes from those foolish enough to trust corporate/activist media at their word and those who don't. The fighting is merely a bi product of getting people to click their articles and watch their shows.",
            "title_similarity": "0.82231784",
            "sentiment_compound": 0.7724
        },
        {
            "id": "h56339f",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341742"
        },
        {
            "id": "h565xr4",
            "score": 1,
            "text": "Don't think we are see it only on lower and middleclass, it's easier to get more views when there's conflict of any kind. You start off by 'afraid of unified lower and middle class', as if them being against the upperclass is the default or as if that could mean anything. But then we see an upper class pointing finders at eachother, but not themselves. Any reaction from anybody is good, but it is easier to find the angry in a crowd.",
            "title_similarity": "0.73076904",
            "sentiment_compound": 0.631
        },
        {
            "id": "h5694gm",
            "score": 2,
            "text": "I mean that's just essentially what politics is now lol people turning against one another cause they heard this dude did this and they don't agree with that",
            "title_similarity": "0.836157",
            "sentiment_compound": 0.1754
        },
        {
            "id": "h56iku6",
            "score": 2,
            "text": "I think you're right that in general, it's in the interest of people in power to keep everyone else divided. But I think it's assuming too much to think that specific ads and news articles were designed for that purpose. It's possible for different groups of people (the media, advertisers, and rich people) to have interests that align with one another without there needing to be any intentional collusion between them.",
            "title_similarity": "0.6712742",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h56ociq",
            "score": 1,
            "text": "Yes, the US media does.",
            "title_similarity": "0.081072085",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h56pk0h",
            "score": 1,
            "text": "That's literally how racial separations initially solidified as equally or more important than class in the United States. Bacon's Rebellion threatened the land-owning societal elites because both black and white laborers came together for a common cause.",
            "title_similarity": "0.7078085",
            "sentiment_compound": 0.101
        },
        {
            "id": "h56x22u",
            "score": 1,
            "text": "Let's be real though, would you really sit there and read an entire newsfeed dedicated to only happy things all the time?",
            "title_similarity": "0.42934853",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h56xce0",
            "score": 1,
            "text": "You're obviously referring to Fox \"News\".  It's just an amoral business model.  Nothing more, nothing less.",
            "title_similarity": "0.5375136",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h56zdw6",
            "score": 1,
            "text": "I would argue this isn't a simple matter of media companies coming together and planning such a thing, and instead the divided media is a symptom, and not the cause, of polarization among political parties.  \n\nThe cause is the desire for profits, because *a for-profit media outlet makes more money if it specifically tells people what they want to hear.*\n\nThere have been studies on this. But it links back to an older conflict than the media one.  \n\nBack in the 1980s, a high-ranking intelligence officer named Yuri Bezmenov defected to Canada and warned that powerful countries tend to attract opposition efforts that infiltrate those nations by painting extreme left-and-right strawmen -- literally groups of people that are meant to stir fears in opposing ideologies. \n\nThis event is noticeable after the collapse of the Soviet Union, but became far more influencial with the advent of social media, where groups of foreign operatives can pose as left-and-right extremists just to push the opposing side of the spectrum into *thinking the opposite political party is completely evil.*\n\nIn short: this did not start with the media. The media is simply one of many institutions profitting off of division caused elsewhere.",
            "title_similarity": "0.7198291",
            "sentiment_compound": -0.7892
        },
        {
            "id": "h570bmp",
            "score": 1,
            "text": "I literally mapped the system dynamics of this potential a few days ago.. yeah it feels possible. As far as proof, well the potential to find honesty from the supposed perpetrators. Cause like was said intent does play a role. And well billionaires are often more lucky than actual masterminds",
            "title_similarity": "0.511211",
            "sentiment_compound": 0.9402
        },
        {
            "id": "h570wda",
            "score": 1,
            "text": "What media? Are you saying NPR, PBS, NYTimes, CNN, Fox News, MSNBC, Washington Times, Google, Facebook, Twitter, etc are all in cahoots with each other?",
            "title_similarity": "0.40900835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5715xd",
            "score": 2,
            "text": "I think we need to classify which file as news stations and which file as entertainment. The heavy hitters like Fox News and msnbc are entertainment industries and not news companies even though they call themselves as such. ABC, NPR, and the New York Times are filed as news companies.\n\nAt the end of the day it’s all about the money. \n\nIt is dangerous when you are filed as an entertainment company, while acting like a news company. News companies have to follow stricter rules. Entertainment companies do not have to follow the same strict rules.",
            "title_similarity": "0.706544",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h57209n",
            "score": 1,
            "text": "Can you expand on what you mean by lower and middle class?\n\nCan you name specific examples of what you're talking about?",
            "title_similarity": "0.35301042",
            "sentiment_compound": 0.1179
        },
        {
            "id": "h573iza",
            "score": 2,
            "text": "I don't think turning people against each other is their goal. They realized that starting/ feeding controversy generates more clicks/ viewers and thus more ad revenue. It's all about profit.",
            "title_similarity": "0.5611582",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h574k35",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341742"
        },
        {
            "id": "h5779n8",
            "score": 1,
            "text": "[Here's a good article that talks about this.](https://hbr.org/1995/05/why-the-news-is-not-the-truth)",
            "title_similarity": "0.5328897",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h577z40",
            "score": 1,
            "text": "I'm going to assume by \"The powers at be\" you mean the leaders of the media outlets. In that case, they aren't primarily \"terrified of what a unified lower and middle class\" as their primary thought process.\n\nThe are primarily motivated to make profits, driven by shareholders.\n\nIf the best way to do that was to preach unity and class consciousness, they'd air that kind of programming.\n\nFrom a tactical standpoint, we agree what's happening. But from a strategic perspective...they're not sinister, they're boring.",
            "title_similarity": "0.6115868",
            "sentiment_compound": 0.9357
        },
        {
            "id": "h578wth",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341743"
        },
        {
            "id": "h578zjx",
            "score": 1,
            "text": ">The powers at be are terrified of what a unified lower and middle class focused on bettering their communities are capable of.\n\nWhat are the lower and middle class capable of that is so terrifying?\n\nWhat is your evidence that middle and lower classes are against each other?  \n\nDoes clickbait make you angry at other socioeconomic classes?  Is there a more likely explanation for clickbait than to keep people fighting each other?",
            "title_similarity": "0.9236784",
            "sentiment_compound": -0.9136
        },
        {
            "id": "h579i1q",
            "score": 1,
            "text": " The middle class is trying to define their place as better than those guys.  It is simple human nature to band together in opposition to those outside your group and is driven mostly by fear of falling into poverty. Poor people do not fight anyone but themselves. The powers that be are trying to generate money. They just need to sell products to reduce the already rampant fear and don't need to manipulate anyone much at all. If clickbait was creating fear and anger instead of using it, you would ignore it.",
            "title_similarity": "0.73534393",
            "sentiment_compound": -0.9593
        },
        {
            "id": "h579koa",
            "score": 1,
            "text": "Why would we want to change your view on that",
            "title_similarity": "0.37688142",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h57a0ce",
            "score": 1,
            "text": "Well all of media is owned by like 5 people/companies who have a very strong desire to keep the peasants at each other's throats than aiming their rage at the elites destroying the planet",
            "title_similarity": "0.64486134",
            "sentiment_compound": 0.4536
        },
        {
            "id": "h57dnp5",
            "score": 1,
            "text": "this is actual a quality of language and human culture that the media outlets are victim to/a part of. this habit is several thousand years older than media companies.",
            "title_similarity": "0.64897484",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h57dsl0",
            "score": 1,
            "text": ">The powers at be are terrified of what a unified lower and middle class focused on bettering their communities are capable of.\n\nThey really aren't. Their afraid of losing power. They are only *mildly* concerned that an organized middle and working class could remove their power.\n\nEven then, the working class and middle class don't have hegemonous interests. They are very divided in his they think the world should be run. Even hardcore Marxists have given up on a class basis for \"the revolution\" and moved on to other types of identity instead.",
            "title_similarity": "0.8222392",
            "sentiment_compound": -0.4098
        },
        {
            "id": "h57ed8o",
            "score": 1,
            "text": "Would love to share this on Parler , anyone here familiar with Mark Levine? He he screaming Marxism, the bourgeois are scared to death. Just another word to try and instill fear.",
            "title_similarity": "0.7806904",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h57hiu5",
            "score": 1,
            "text": "Just search the Sinclair video. I completely stopped watching the news after I saw it. I barely watched it before anyways, but the 24/7 news cycle is pathetic.",
            "title_similarity": "0.61370754",
            "sentiment_compound": -0.7681
        },
        {
            "id": "h57hmkj",
            "score": 1,
            "text": "More than just that, the media is wholly Propaganda.",
            "title_similarity": "0.5451534",
            "sentiment_compound": -0.25
        },
        {
            "id": "h57ib4n",
            "score": 2,
            "text": "Why fight the lower lower middle class, when you can pay to convince them to fight each other?",
            "title_similarity": "0.71977407",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h57j6q9",
            "score": 1,
            "text": "“Powers at be”",
            "title_similarity": "0.016609702",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57j900",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341743"
        },
        {
            "id": "h57job2",
            "score": 1,
            "text": "You, at the moment of posting this topic, became a part of “The Media” which not a monolith.",
            "title_similarity": "0.23304965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57n7iy",
            "score": 1,
            "text": "No, you’re right.",
            "title_similarity": "-0.038556226",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57o4ec",
            "score": 1,
            "text": "This isn't an unpopular opinion this is just the reality we live in",
            "title_similarity": "0.1519628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57pbh7",
            "score": 2,
            "text": "Precisely.",
            "title_similarity": "-0.13906425",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57qtfe",
            "score": 2,
            "text": "Your view is spot on. Sensational headlines",
            "title_similarity": "0.23395236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57rqe0",
            "score": 1,
            "text": "The wealthy do this.",
            "title_similarity": "0.123093925",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h57u1z3",
            "score": 1,
            "text": "I've seen a few people say \"it's more like X than Y\". There are multiple factors driving the messages that media outlets choose to push and the angle they take.\n\nHave a look at \"Manufacturing Consent: The Political Economy of the Mass Media\", where the \"Propaganda Model\" is defined. I.e. \"what are the things that drive media propaganda in Western Capitalist societies?\"\n\n1. Ownership\n2. Advertising\n3. Sourcing\n4. Flak\n5. Anti Communism (aka Ideology)\n\nWhen evaluating any given media, you can use these perspectives to support an in-depth analysis.\n\nHaving said that Ownership is far too concentrated and aligned to Corporate interests (think Bezos or Murdoch) and the pressure to conform to Ideology (think of the toxicity of being branded a \"socialist\" and somehow anti-American for suggesting that healthcare should be a human right in the US).\n\nTL:DR There is no grand conspiracy. Different media are influenced by different factors. There are major issues with media ownership and government, media, corporations utilising Ideological arguments to further their interests.",
            "title_similarity": "0.6839547",
            "sentiment_compound": 0.1253
        },
        {
            "id": "h57wt0z",
            "score": 1,
            "text": "I’m not sure any government has its shit together enough to organize something that grand",
            "title_similarity": "0.28397912",
            "sentiment_compound": -0.374
        },
        {
            "id": "h57z9ef",
            "score": 1,
            "text": "October Strike",
            "title_similarity": "0.22412275",
            "sentiment_compound": -0.128
        },
        {
            "id": "h5832p2",
            "score": 1,
            "text": "This argument might be correct but is incomplete.\n\nThere are social problems. Everyone does feel like the other “classes” are out to get them.\n\nThe middle class feels the poor lives off their taxes. The poor think the middle class has all the power.\n\nListen. Own your capital. I’m not trying to be a socialist or any other ist. I was raised working class. Was homeless for  awhile. Back to working class. Then I decided to start my own business. It was successful and I started another. And another. Now I own or am partners in four different businesses and I’m starting another now. Three more ideas in the pipeline.\n\nI think that’s the thing they don’t tell you.\n\nYou can call me bourgeois or whatever. \n\nI might lose everything. I might not.\n\nRight now, I’m doing very well. And I give most of the credit for that to not being political or worrying what someone else had or has or does.",
            "title_similarity": "0.67528856",
            "sentiment_compound": -0.6013
        },
        {
            "id": "h5850tv",
            "score": 1,
            "text": "George Carlin was talking about this years ago. \n\n[the owners of this country ](https://www.youtube.com/watch?v=h7yzi1I_Zsk)",
            "title_similarity": "0.2710959",
            "sentiment_compound": 0.0
        },
        {
            "id": "h586f04",
            "score": 1,
            "text": "You've lost a lot of people here by taking a great point (media is feeding the fracturing of the lower and middle classes and turning us on each other) then undermining it by using conspiratorial language like \"the powers that be\" and \"propoganda\".\n\nYou don't need to attribute to conspiracy what can be explained by self-interest and market forces.\n\nI very much second your primary point: Let's stop pretending that someone who votes differently, or is a different age or race or sex or whatever is some sort of weird inimical alien being. We're all human beings in this together dealing with the same stuff, and we're stronger when we realise that.",
            "title_similarity": "0.8473214",
            "sentiment_compound": -0.4576
        },
        {
            "id": "h586f0c",
            "score": 1,
            "text": "Question: Since you believe that those in power want to divide us, does that mean that you believe BLM is one of those tools used for division? Since it was endorsed by tons of major and powerful corporations and media outlets and all.",
            "title_similarity": "0.7108439",
            "sentiment_compound": 0.6573
        },
        {
            "id": "h587x96",
            "score": 1,
            "text": "Who really runs the media tho?",
            "title_similarity": "0.3257744",
            "sentiment_compound": 0.0
        },
        {
            "id": "h588pre",
            "score": 1,
            "text": "This is a classic “theory” where you state ideas that technically can’t be proven false but have no evidence at all. It feels good to believe stuff like this because it vilifies a lot of peoples current position and sets you above all the other “sheeple” who can’t see the truth.\n\nOf course I can’t prove it wrong, but let’s go through what you’re suggesting. There must be a secret society of super rich people that are actually scared of this conspiracy theory that middle and lower class people will revolt and take “what they deserve” from the more well off people, even though every single time this has happened in history has resulted terrible and eventually reverts back to capitalism. \n\nIt assumes this secret society of the super rich have been in cahoots for a long time, atleast a century now. And every single time the hands are changed over or a company is bought by someone else or is passed to someone else this new person is perfectly fine with the secret society and agrees with the idea of oppressing over half of all Americans. Inb4 they’re forced to do it! Inb4 the billions of dollars that warren buffers Elon musk Jeff bezos bill gates etc is all just for show to convince the people that they actually care! It’s just too hard to believe there has never been one whistleblower before his death bed and all this philanthropy and all the money  these people have given and the charities they’ve created is just for show and it’s all really just in agreeance with the super rich secret society who has a master plan to continue to trick the sheeple. Yet countless of these billionaires were apart of the sheeple middle lower class for half their lifetime. \n\nHow did all these majors news stations get power in the first place? They literally are at the will of the people. If their ratings go down they will lose all of their power. The stock holders of literally own the companies and all they care about is profits. Do you think cnn wanted to play Donald Trump every other second in the 2016 primaries? They had to because he was always the big story that got people to turn it on. Big inb4 they did it because all the news stations are in cahoots and they wanted trump to win because that’s how they can tear the middle and lower class apart because all the rich people are in a secret society that foresaw the lower class of people rising up so they knew exactly how to buy/ make all the major popular news outlets so they could brain wash them. It actually sounds funny when you say it.\n\nThe middle class is light years away from revolting, there’s no so reason for the rich to be scared of this at all. The US has the fourth highest wage in the world. Yes that’s above all the beloved Scandinavian countries! https://en.wikipedia.org/wiki/List_of_countries_by_average_wage?wprov=sfti1 and is number 6 in highest median income https://worldpopulationreview.com/country-rankings/median-income-by-country \n\nThe boring truth is that the US is a very good country economically for even average people and below average people ( or else people wouldn’t be trying to come here in droves ) compared to other countries. Most people in the United States are happy with where they are and they’re odds of their life getting better compared to other countries.",
            "title_similarity": "0.7728286",
            "sentiment_compound": 0.998
        },
        {
            "id": "h588tst",
            "score": 1,
            "text": "Wait, I thought it was all fair and balanced..",
            "title_similarity": "0.009428203",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h58aibd",
            "score": 1,
            "text": "Always has been...",
            "title_similarity": "-0.10179635",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58f0di",
            "score": 1,
            "text": "Agree - divide an conquer. It's not about race at all actually. It's about the haves and have nots.",
            "title_similarity": "0.4410622",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h58lm4m",
            "score": 1,
            "text": "No need to change your view, this is absolutely correct.",
            "title_similarity": "0.045428",
            "sentiment_compound": -0.296
        },
        {
            "id": "h58loo3",
            "score": 1,
            "text": "ITT: Everyone in this thread using Occalm's Razor, but there's literally mountains of evidence that US media purposefully lied in order for the government to enact the actions it wanted, especially in the media sphere. \n\nSee Chomsky's Manufacturing Consent.",
            "title_similarity": "0.75891376",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h58mw7t",
            "score": 1,
            "text": "Agreed.",
            "title_similarity": "-0.14518493",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h58nvvf",
            "score": 1,
            "text": "It's really just the middle class technically but yeah",
            "title_similarity": "0.2939859",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h58ofxm",
            "score": 1,
            "text": "This is 100% true. Don't listen to any of the clowns here that may try to convince you otherwise.",
            "title_similarity": "0.41354215",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h58oqta",
            "score": 1,
            "text": "Then they sit back and enjoy all the chaos they've created.",
            "title_similarity": "0.44200352",
            "sentiment_compound": 0.128
        },
        {
            "id": "h58oqzi",
            "score": 1,
            "text": "The media isn't a monolith.  It's made up of corporations.  ALL corporations are a group of people getting together for a purpose.  All of them need to make money to continue their existence.  Some exist to make money, others have a more noble purpose.  Media is no exception.  The difficulty is in discerning the agenda.",
            "title_similarity": "0.5242342",
            "sentiment_compound": -0.079
        },
        {
            "id": "h58qguu",
            "score": 1,
            "text": "*Basically, Basically*",
            "title_similarity": "-0.065741606",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58spwy",
            "score": 1,
            "text": "I think it's the *conservative media* you have to watch out.\n\nThe Conservative Media sell their viewers absolutely batshit crazy lies and insanity and peddle pure disinformation and deliberately manipulative junk.\n\nI think the media is normal, I don't think they have this agenda.\n\nI think the people trying to break trust in media are themselves contributing to the Republican Party's paranoia and conspiracies.\n\nNo, the media important. It's worth listening too.\n\nI agree they got some problems, but look at what conservative media are doing. Selling total fucking garbage to radicalize people into QAnon cultists.",
            "title_similarity": "0.83979124",
            "sentiment_compound": -0.4255
        },
        {
            "id": "h58tm5l",
            "score": 1,
            "text": "I agree entirely",
            "title_similarity": "-0.08759457",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h58u1gl",
            "score": 1,
            "text": "Culture War distractions",
            "title_similarity": "0.5747011",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h58u5cm",
            "score": 1,
            "text": "the issue is that a lot of lower class people defend billionaires and blatantly ignore class division lol",
            "title_similarity": "0.73708975",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h58wo6f",
            "score": 1,
            "text": "Exactly HALF of the media does that.  Guess which half.",
            "title_similarity": "0.206035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58xqb7",
            "score": 1,
            "text": "Which media? Some are targets of effective strategic comms efforts to get them to frame things a certain way — they’re being played (in ways that align with their ratings interests). Others however are partners in a strategy to do what you’re suggesting. To those saying it’s not intentional: there is a lot you can do behind the scenes with money. To see how it works, see this relevant post in Popular Information about the money behind the Critical Race Theory mania.\nhttps://popular.info/p/the-obscure-foundation-funding-critical",
            "title_similarity": "0.64142936",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h592jis",
            "score": 1,
            "text": "If we are fighting one another….. we cannot possibly fight the real enemy",
            "title_similarity": "0.54375005",
            "sentiment_compound": -0.5881
        },
        {
            "id": "h593d00",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17341743"
        },
        {
            "id": "h59b5ko",
            "score": 1,
            "text": "It's a feedback loop for sure.",
            "title_similarity": "0.20938261",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h59c6rm",
            "score": 1,
            "text": "Its not usa media itself. The media is somehow being puppeted or pulled onto by russia and china. This strategy is being heavily used in uk and eu members too. Division of population based on beliefs, the weaker side being more feelings based, keen on physical punishment as opposed to discussion.",
            "title_similarity": "0.6740165",
            "sentiment_compound": -0.5165
        },
        {
            "id": "h59oksh",
            "score": 1,
            "text": "[This is all I could think of at the moment. I need coffee](https://youtu.be/zDhjUIvDIpg)",
            "title_similarity": "0.3337317",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59pobh",
            "score": 1,
            "text": "https://en.m.wikipedia.org/wiki/Operation_Mockingbird\n\nhttps://en.m.wikipedia.org/wiki/Disposition_Matrix\n\nUS Media has been a State propaganda arm via the CIA for decades\n\nWhen MKULTRA, our government PSY OPS project, was shut down, it was broken up into dozens of different parts named: \n\nSCANATE, STAR GATE, GRILL FLAME, CENTER LANE, SUN STREAK, STUNT PILOT and PHOENIX\n\nWe already have heavily redacted but released documents FOIA’d on these programs that gets very interesting but if you were to find anything more on the subject of US involvement in media as part of a psyops, this is where I would look to\n\nI have no real change, just throwing in something people can dive into. I can post some of the redacted CIA archives about their psyops research if anyone is curious",
            "title_similarity": "0.6174397",
            "sentiment_compound": 0.3797
        },
        {
            "id": "h59rd25",
            "score": 2,
            "text": "I agree. I believe this is why they like to feed racism. I don't know if they're racist, they probably don't see any of us as human.",
            "title_similarity": "0.73823243",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h59uqf3",
            "score": 1,
            "text": "They use divide & conquer & the Hegelian dialect.",
            "title_similarity": "0.34889278",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59vpz8",
            "score": 1,
            "text": "can’t change your view because you’re right",
            "title_similarity": "0.20226677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59wwrx",
            "score": 1,
            "text": "The media acts like they aren't politically biased but are for sure. They'll also do whatever they can to get the most views possible... even though it hasn't been working out for networks like CNN all that well. They need Trump to keep the numbers high.",
            "title_similarity": "0.6158861",
            "sentiment_compound": 0.8752
        }
    ]
}