{
    "CMV: Every fine should be income based, no exceptions should occur\nThis is the only fair way to financially punish someone, whether you should do that in the first place is a topic for another day.\n\nThe only way you can make sure rich people won't just shrug and metaphorically throw a moneybag at every policeman who wants justice is to make them pay a percentage of their monthly salary. Likewise this ensures everyone can pay their fine. This isn't more different than getting the same amount of years in prison irregardless of things like race and gender.\n\n\nWhy rich people should be above the law buggles my mind.\n\n\nEdit:\n\nTo address the \"how\" question I get all the time. What I'm asking is implementation of [Day fines](https://en.wikipedia.org/wiki/Day-fine) on every fine. This is already happening in some nations especially for speeding tickets and I see no reason not to expand it to everything.\n\n\nEdit: Since I can't keep giving out deltas for the same argument. I admit there might need a minimum amount of a fine.\n\nEdit: The idea of choosing between a fine and community service has been brought up. I like that suggestion very much since it's an option for those too poor to lose even a percentage of their monthly salary.\n\n\nUpdate: Today I realized how little I know about the rich. It probably won't come to many in here's surprise to learn I have no friends in the upper class. The more you know and all.\n\nUpdate 2:\n\nFirst off, it seems the biggest problem of my suggestion is how to target the very rich. On the other hand I get many suggestions besides income as a way of measurement of riches. The two biggest ones I noticed are \"net worth\" and \"expenditures\".\n\n\n2nd of all a comment which is now buried (I really tried to find it, please respond if you read this) was for me to react to [this](https://youtu.be/Jtxuy-GJwCo) video or just as likely giving out deltas for the contents. Here's my 2 cents: I believe Steve Jobs made millions off stealing Bill Gates and Samsung's ideas except making even worse products that breaks or get obsolete within a year, so the first myth is lost on me although it makes me feel nostalgic for the day where currency didn't exist. I'm an advocate for \"equality of outcome\" and thus day fines are the way to go. It's like pushing the tall guy to the left off a box he doesn't deserve. I'll say Steve Jobs is plundering. Side-comment: Why am I looking at Mr. Burns? I don't see why the last myths are relevant for this post but let me know if you want my opinion on those too.": [
        {
            "id": "h5nr65v",
            "score": 1,
            "text": "/u/zeanobia (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/omw7cs/deltas_awarded_in_cmv_every_fine_should_be_income/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5929835",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5nn3y4",
            "score": 21,
            "text": "The rich literally aren’t above the law though. It’s equal punishment for the same crime.",
            "title_similarity": "0.76973355",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5nmdx5",
            "score": 546,
            "text": "I hear what you're saying. That being said, we shouldn't be determining a person's punishment based on their wealth. Imagine if we handled prison sentences like that: should someone who is wealthy get a longer sentence just because they're wealthy? Linking fines to wealth makes plenty of sense until you realize that you're then directly linking a crime's punishment to something that has *nothing to do with the crime itself.*",
            "title_similarity": "0.8351574",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h5nrlvm",
            "score": 140,
            "text": "Is it worse when a rich person litters than when a poor person litters? Does a gum wrapper thrown on the ground by Elon Musk do more damage to the environment than one thrown by you or me? Assuming you agree the answer is no, why should Musk face a larger fine than I do?\n\nYou seem to think that everyone getting the same amount of prison time somehow supports your case? How can that be, when your proposal calls for personalizing the fine from person to person? The equivalent to your proposal would be to estimate how much each person \"cares\" about going to prison, and then giving the people who care less longer sentences.",
            "title_similarity": "0.8141226",
            "sentiment_compound": 0.5249
        },
        {
            "id": "h5nq3mv",
            "score": 1,
            "text": "So rich people that don’t work don’t have to pay fines?\n\nSo if I make 3k/ month and my wife makes 4K, is it dependent on which of us gets the fine, or do we both pay as if we make 3.5K?",
            "title_similarity": "0.66455084",
            "sentiment_compound": 0.6432
        },
        {
            "id": "h5nmapx",
            "score": 159,
            "text": "Even fining someone by their income isn't fair.\n\nLet's say, as a random example, the fine will be 10% of income.\n\nIf your income is 1,000, that's 100.  \nIf your income is 1,000,000, that's 100,000.\n\nOne leaves you with 900 left, and the other leaves you with 900,000 left.\n\nThe lower-income person would _still_ be hit harder, because they might have to reconsider their spending plan in the near future, but for the millionaire, it leaves them with enough margin left that they don't need to worry about it.",
            "title_similarity": "0.74486005",
            "sentiment_compound": 0.4639
        },
        {
            "id": "h5no2pq",
            "score": 2,
            "text": "The majority of very rich people aren't rich because of their income, they are rich because of their net worth which is likely illiquid.\n\nBy your logic, you would fine someone working a minimum wage job more than you would fine a billionaire who takes no salary.",
            "title_similarity": "0.7236887",
            "sentiment_compound": 0.7826
        },
        {
            "id": "h5np599",
            "score": 43,
            "text": "Two points, if you make your fines punitive enough many wealthy people will leave your jurisdiction and more harm will occur than if you hadn't imposed the fines. On the other hand if you make the penalty fairly low, then you will be reducing the value of what fines are for, to deter people from committing the behavior. Since there are a lot more people that aren't rich you will see an increase in this behavior that is bad also harming people that aren't rich. Likely your policy would be more harmful than not. \n\nRich people are not above the law because they are more capable of paying fines. That would be like saying old people are above the law because their life sentence for murder will not be that long. Yeah, that's not what that means.",
            "title_similarity": "0.73032117",
            "sentiment_compound": -0.9446
        },
        {
            "id": "h5nw1jt",
            "score": 2,
            "text": "This isn't a good idea because you get into the sticky area of trying to determine what someone's income is. \n\nSomeone could own billions of dollars in assets and have no income, they could even have negative income based on expenses they itemize. \n\nSo you say, let's include all assets including non-liquid. Ok, how do you determine the value of these assets? Whose job is it to determine the value? Whose job is it to report it? Not the IRS, not the person writing the fine, so create an entirely new dept just for this? \n\nBuilding off the first point, let's say fines are income based, and someone has no income, so that would mean they have no fine. So the unemployed son of a hedge fund manager can park the lamborgini his dad bought for him in the handicap spot with no issues. \n\nI get where this is coming from, but you're making a lot of assumptions on how people access money.\n\nMost lower to middle class people make their money from working jobs or owning businesses, so they do have income to report, but I'm assuming you're proposing this income-based fine specifically to target the rich and make them pay an amount which they can 'feel'.\n\nMost of these people don't make money the conventional way. They might own stocks, options, or real estate, which can be used as collateral for low interest loans/cash which doesn't count as income and when the time comes, the asset can be traded as collateral with no actual transaction being made for cash. \n\nThe real way to even the playing field is to change tax law, and make the rich pay their fair share, to reduce the wealth gap by closing the loopholes that the wealthy and businesses use to avoid paying the same % in taxes as the rest of us, not trying to change laws for traffic tickets. Most of them would just circumvent it by hiring drivers.",
            "title_similarity": "0.755766",
            "sentiment_compound": 0.9738
        },
        {
            "id": "h5ntzgr",
            "score": 14,
            "text": "There is no fair way to financially punish someone because there is no fair way to punish someone. The idea that someone would deserve punishment is sadistic and not in the fun way. Focus should be on changing the things that cause people to act in anti social ways instead of increasing punishment for people who do. Towards that end do we have evidence that punishment is the most effective way to prevent anti social behavior?",
            "title_similarity": "0.6599648",
            "sentiment_compound": -0.9688
        },
        {
            "id": "h5nn5im",
            "score": 48,
            "text": "There's a reason you don't see rich people commit crimes 24/7 because there is usually more at stake than just a fee. \n\nFor starters it depends on the crime, some fees may also have jail time / community service you MUST complete regardless if your mega rich. You also get a criminal record. As well as the more repeat offences you have the higher the punishment goes.\n\nAND THEN you have the issue of many rich people are known to the public, so something like this can really tarnish your business / reputation in a big way. \n\nPlus how would this work mechanically? lets say a rich dude (for some reason) does a petty theft, and the fine is $100, should they be obligated to pay what? a million dollars for a candy bar? it just seems silly really.",
            "title_similarity": "0.7843028",
            "sentiment_compound": 0.3434
        },
        {
            "id": "h5npuvb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5nqnv1",
            "score": 6,
            "text": "Not all fines are punishments, many are more like an amount that makes up for the social harm caused by an action - if someone pays it then society has been recompensed and it isn't a bad thing.\n\nAlso most fines are for things that don't get much in the way of evidence, just \"cop said it happened, we fine you\".  So we should be keeping them as low as possible.",
            "title_similarity": "0.75097096",
            "sentiment_compound": -0.2399
        },
        {
            "id": "h5nvvgz",
            "score": 45,
            "text": "It would only benefit the poor and harm the middle class. The rich will be left untouched.\n\nWhy?\n\nJust take a look at Bezos or Musk: if you ask them to pay 99% (just to throw a ridiculous number) of their monthly salary in a speeding fine they will just laugh, pat you in your head and write you a check.\n\nThe wealth of the ultra-rich is **not** in their monthly salary but rather in capital gain via stocks and other assets.\n\nAnd how about a person that is unemployed (or, if you prefer, employed in the black market therefore there is no record of their income)?\n\nCan they just speed whenever they want, pay a symbolic 1 USD fine and call it a day?\n\nThis proposed law will:\n\n\\-Increase the number of reckless driving amongst lower-income populations.\n\n\\-Disproportionally affect the middle class whose income depends solely on salary and who have no other means of gaining wealth.\n\n\\-Still unaffect the Bezos of the world.",
            "title_similarity": "0.83721805",
            "sentiment_compound": 0.9215
        },
        {
            "id": "h5nu50y",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5noa43",
            "score": 11,
            "text": "How do you propose the government goes about determining income/wealth whatever it is you have in mind?",
            "title_similarity": "0.46811563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nz7zo",
            "score": 12,
            "text": "I’m surprised nobody else has brought this up yet: this just gives the police and authorities incentives to only scrutinize rich/middle-class people. \n\nThe police/mayors are going to target wealthier people because the city gets more money. Why bother preventing 1 million cases of serious littering in a poor neighborhood when you can just stakeout a rich neighborhood and fine them for some petty littering? \n\nThis means the people living in poorer neighborhoods are being punished more because they have to face the consequences of living in a dump. And the rich have to face the consequences of getting harshly scrutinized for jaywalking or other petty laws that would otherwise not get enforced.",
            "title_similarity": "0.8274719",
            "sentiment_compound": -0.1189
        },
        {
            "id": "h5nmber",
            "score": 497,
            "text": "This would not really work because most of the liquid incone for the millionaires are pretty small. Their net worths are in form of stock or their company value. This would mostly hurt the middle class.",
            "title_similarity": "0.65319175",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5ntid9",
            "score": 0,
            "text": "Simply consider a month salary punishment for a poor person vs a rich person.  For the poor person, it'd be absolutely life ending as they are usually living paycheck to paycheck vs a rich person who has decades of wealth in reserve.\n\nThis would still be the case even if you wanted to consider total wealth or anything else.\n\nIf you disproportionately punish the wealthy, they wouldn't be a citizen of your jurisdiction anymore.  And everybody hurts. Even if they remained, they would just tax the poor through the increased prices of their products that everybody uses.",
            "title_similarity": "0.8219311",
            "sentiment_compound": -0.1298
        },
        {
            "id": "h5nyjwt",
            "score": 0,
            "text": "This is absurd as the poorer you are the more likely you are to commit a crime. The lowest income group is the one that needs the most discouragement from doing bad things.",
            "title_similarity": "0.6506815",
            "sentiment_compound": -0.9216
        },
        {
            "id": "h5o1hpg",
            "score": 0,
            "text": "That's clasist.",
            "title_similarity": "-0.027746636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5o4re8",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5o6rgt",
            "score": 0,
            "text": "This is just setting up a crap ton of lawsuits for trivial things like speeding and jaywalking. If you charged me $100k for going 75mph on the freeway I’m going to lawyer up, every time.\n\nI just imagine rich people would get really snarky and find ways to screw over others even more to spite this.\n\nAnd this request is really just a request to further fill the pockets of lawyers. Why does helping lawyers make the system better?",
            "title_similarity": "0.7692376",
            "sentiment_compound": 0.3008
        },
        {
            "id": "h5ocvow",
            "score": 0,
            "text": "I’d recommend looking into the Constitutional aspects of this argument. The countries that have day fines don’t have to same Constitutional protections as people who live in the US.",
            "title_similarity": "0.5894258",
            "sentiment_compound": -0.0964
        },
        {
            "id": "h5oe5qb",
            "score": 0,
            "text": "Tfw you commit tax fraud, but get reduced time because your income level is 0.\n\nIt does sound really cool to punish people more entirely because their income is above a specific point on a graph rather than their behavior in the context of the circumstance",
            "title_similarity": "0.78855336",
            "sentiment_compound": -0.5277
        },
        {
            "id": "h5oidq8",
            "score": 0,
            "text": "I do in a sense agree with this concept, but how do you fine someone who has an income criminally?\n\nThere are many people where I live who receive social welfare, yet they have mass amounts of funds due to their criminal activity. If this system was to be introduced, and lets say the fine for speeding was 5% of your monthly income, once, and they were receivinf €800 monthly from social welfare, they would be fined only €40, even though their actual income is much more than €800.",
            "title_similarity": "0.7442695",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h5ojfbu",
            "score": 0,
            "text": "Personally I think having a fixed fine is better because it's the same for everybody. Why is this good? It's good because: say for example, 2 people have a net salary of £25,000, they both get a fine of £500 (2% of net salary). That £500 could mean different things to those 2 people. One might care, one might not. But if it's a fixed fine of £2500, not relevant to net salary, that's going to hit the same to both.",
            "title_similarity": "0.74353486",
            "sentiment_compound": 0.8476
        },
        {
            "id": "h5ojzhi",
            "score": 0,
            "text": "So a drug dealer making thousands upon thousands of untaxed dollars, often more than most people make, can now also have tiny fines if they’re on welfare, which most of them are. Very cool. As for the rich, you will have to target capital gains which is easy to manipulate.",
            "title_similarity": "0.6965432",
            "sentiment_compound": 0.8883
        },
        {
            "id": "h5os21f",
            "score": 0,
            "text": "Read the first 50 comments, surprised I didnt see this mentioned. But wouldnt this create incentive to target wealthy people? The local government is going to go over budget this month, target some of the wealthy citizens to make up for the budget deficit.\n\n\n\nJustice is never present when the laws incentivize treating some people differently than others (whether its for the better or worse)",
            "title_similarity": "0.7444331",
            "sentiment_compound": 0.5437
        },
        {
            "id": "h5oyf1v",
            "score": 0,
            "text": "Then there is no incentive to uphold laws against poor people. A speeding ticket isn’t worth the paperwork and potential court date if it generates 2$ in revenue.\n\nNot to mention you are talking about a huge incentive to discriminate against wealthy individuals and enforce fines. Like it or not it’s still discrimination and the exact opposite of equality.",
            "title_similarity": "0.7727394",
            "sentiment_compound": 0.6694
        },
        {
            "id": "h5ozzog",
            "score": 0,
            "text": "Most of the truely wealthy don't really have much of an income (cause that would leave them open to taxes or in this case fines.) You'd need a more complex system of determining wealth than just looking at people's on paper income. If you just look at that most of the individuals for whom a fine is inconsequential would end up paying smaller fines not larger ones.",
            "title_similarity": "0.67093956",
            "sentiment_compound": 0.743
        },
        {
            "id": "h5pbpka",
            "score": 0,
            "text": "This is a perfect example of too simple of an idea. Same as, oh, we should death sentence that guy who raped a girl. Then what, the guy probably would just kill the victim to eliminate a witness. Because either way when he gets caught he will be sentenced to death. Fining the rich based on income is not that simple. Even with the system now, you don’t see rich people ignoring the laws. Because they are probably rich for a reason.",
            "title_similarity": "0.79834425",
            "sentiment_compound": -0.802
        },
        {
            "id": "h5pjjuc",
            "score": 0,
            "text": "What a terrible concept. I’m not personally wealthy. I’m a commercial fisherman 4 months a year. Then I work at a family friends restaurant 2 months. Normal pay just because my parents are very well off and I will inherit that should I pay larger fines? I bought my first car and have payed my own rent and everything but education. That was a waste anyways I’m a drunk fisherman and always will be love it.",
            "title_similarity": "0.680088",
            "sentiment_compound": -0.0666
        },
        {
            "id": "h5pm2pb",
            "score": 0,
            "text": "Imagine going into a store and buying a can of peas for a dollar.  Then Jeff Bezos walks into the same store and buys another of the same peas... and has to pay $100.  makes no sense- they both got the same thing, they should pay the same.\n\nFines are the 'price' you pay for breaking the law. \n\nIf two people break the same law, they should pay the same price.\n\nAnything else is unfair.",
            "title_similarity": "0.76189107",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h5q4cau",
            "score": 0,
            "text": "This is a quite stupid approach until certain changes are carried out. \n\nFirst, what is income? Is it everything that falls under income tax? If so, the wealthiest people on the planet would stop paying fines altogether or pay ridiculously low fines. \n\nThen imagine if it wasn’t just income tax and I happened to sell a house despite working a minimum wage job or just retired… the house value would make my fine disproportionate to my true earnings.",
            "title_similarity": "0.8112333",
            "sentiment_compound": 0.2185
        },
        {
            "id": "h5nz3rx",
            "score": 12,
            "text": "The downside is that you're now making entire categories of infractions basically free or worth it!\n\nLet's say I'm not buying a train ticket and the fine is now 50 bucks. But with the new system, if I'm poor enough (or I can appear that way via some shady tactics), I'll have to pay 20 instead.\n\nSo now I'm getting a huge incentive in breaking minor laws, and, in the example, not purchasing a ticket could be profitable in the long run.\n\nBut if I'm a regular guy or relatively well off, I'm paying 100, 200 or more, which isn't really fair.",
            "title_similarity": "0.7689607",
            "sentiment_compound": 0.789
        },
        {
            "id": "h5nropx",
            "score": 1,
            "text": "Fines related to *accidental* damage should be for replacement cost only. \n\nIf the damage is unintentional then there should be no punitive aspect to the fine and it should be strictly limited to actual repair/replacement costs.",
            "title_similarity": "0.6994713",
            "sentiment_compound": -0.6246
        },
        {
            "id": "h5o19ep",
            "score": 1,
            "text": "I know people who have an utter fuckton of money, and yet very little income.\n\nThey have their own companies, and then pay themselves a salary of just about what they need. If they want something, they give themselves a \"bonus\". all entirely legal, but this construction leads to them having very little actual \"income\", so their fines would be waaaaay too small. How do you propose to fix that?",
            "title_similarity": "0.7564919",
            "sentiment_compound": 0.3811
        },
        {
            "id": "h5ns7tp",
            "score": 6,
            "text": "Some forward thinking countries do something that I feel is really fair.  Say you are caught speeding.  Instead of paying a fine which is vastly different for people based on wealth, they make you pull into a holding area and force you to sit there for like 2 hours.   So if you are a wage employee now you're going to be late for work and it's it's big problem.  And if you're a CEO millionaire you can't get to the office for that important meaning.  Peoples' time seem to be a more fair metric when you think about it.",
            "title_similarity": "0.786403",
            "sentiment_compound": 0.8685
        },
        {
            "id": "h5noer6",
            "score": 33,
            "text": "Fining people for infractions is idiotic anyways. Speeding should just get you a point on your license, littering should get you community service, etc. Clearing you of your crimes because you can afford to pay for it is immoral af to me.",
            "title_similarity": "0.7675838",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h5nshex",
            "score": 108,
            "text": "One problem with this is law enforcement might start excessively targeting rich people.  If you can get a fine from a millionaire that will net your department a lot more cash than getting a fine from an unemployed person.\n\nEdit: To clarify, the big part of the problem I see is a potential for wasted effort.  I could see police spending time and resources into tailing, survielling, ect... rich people in the hopes of getting a million dollar ticket.  This time and energy could otherwise be spent doing their job less descriminently, such as helping look for missing people or something else actually helpful.",
            "title_similarity": "0.76886696",
            "sentiment_compound": 0.836
        },
        {
            "id": "h5np5kv",
            "score": -2,
            "text": "The most common fines are speeding. The reality is that rich people in general pose far far less danger by speeding than others. They have cars meant for higher speeds - newer, better maintained, better tires, safety system that avoid collisions. There is zero reason a $100000 sports car is bound to the same speeds as a $1000 clunker.",
            "title_similarity": "0.69018555",
            "sentiment_compound": 0.6997
        },
        {
            "id": "h5obxea",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.0058547184"
        },
        {
            "id": "h5nsugr",
            "score": 2,
            "text": "Awesome.   So I can buy a car and register it to my unemployed aunt with $0 in her wells Fargo and account and just pay the $1 traffic tickets that she incurs.  This is much cheaper than paying $36 per day to park at UCSF.",
            "title_similarity": "0.6550749",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h5o3kts",
            "score": 3,
            "text": "right but if you take 50% of $2 million they still have $1 million but if you take 50% of $50,000 then they might not be able to afford rent anymore or support their children. i feel like the amount in the fine needs to be taken in relation to the total value of their assets AND the amount of financial commitments they have? then that gets super messy with trying to calculate their financial commitments which can always be fudged",
            "title_similarity": "0.6503584",
            "sentiment_compound": 0.9595
        },
        {
            "id": "h5o0dji",
            "score": 12,
            "text": "One thing I haven't seen brought up is how this might affect enforcement policies.\n\nIf you get a lot more money by catching the rich folks litter then you're going to go to the rich area, that would bring police away from the areas that need them the most.\n\nIf you don't want police in your poor area, that could be seen as a positive, but personally I feel like it would be a negative to have less police in the poor areas",
            "title_similarity": "0.7594045",
            "sentiment_compound": -0.4958
        },
        {
            "id": "h5nlqg2",
            "score": 24,
            "text": "What is someone is incredibly wealthy but has no income and is just living off previously acquired wealth?",
            "title_similarity": "0.540787",
            "sentiment_compound": 0.5262
        },
        {
            "id": "h5noclg",
            "score": 46,
            "text": "Income is a poor measure of what you seem to actually want to adjust for, which is disposable income. A person making less money but with fewer responsibilities will be able to absorb that cost much more easily than, for example, someone who needs to support a family or has medical expenses.",
            "title_similarity": "0.5763813",
            "sentiment_compound": 0.7343
        },
        {
            "id": "h5o2yag",
            "score": 9,
            "text": "Income-based fines will sometimes overdeter the rich. According to this argument, not all crimes are the kind that we want to eliminate entirely, such as mass murder.  Rather, some rulebreaking results in more benefit to society than harm—in law and economics terms, “some criminal acts actually are wealth-maximizing”—and we are happy to tolerate noncompliance with the rule if the rulebreaker is willing to pay the price.  \n\nConsider commercial delivery vehicles that routinely park illegally and see occasional tickets as the cost of doing business. If illegal parking were a capital offense, commerce might slow and we all might be worse off. From this perspective, fixed fines have a valuable purpose: if set at a level that reflects the costs to society of noncompliance, they will deter only undesirable law breaking while allowing those who will benefit society by breaking the law to do so.\n\nBecause, however, income-based fines reflect not only the costs of rulebreaking but the finances of the rulebreaker, fines imposed on the wealthy will sometimes exceed those costs and thus deter otherwise desirable behavior—making society, as a whole, worse off.  It follows that income-based fines may be less appropriate when society can set tariffs at a socially optimal price.\n\nhttps://lawreview.uchicago.edu/publication/constitutionality-income-based-fines#footnote56_9xroswc",
            "title_similarity": "0.7818863",
            "sentiment_compound": 0.1923
        },
        {
            "id": "h5oi27i",
            "score": 15,
            "text": "This cmv comes up every 6 months, ok so if there is a fine sure, however I'm going to try and change your view on fines being a punishment at all.\n\nOk so someone did something bad and you want to punish them to deter others from doing something, you choose a fine as you don't want to be too harsh.\n\nThe problem is a fixed fine disproportionately hurts those who have low income, so we change it to income based. However this actually doesn't fix the issue, nothing can.\n\nThe issue is that the wealthier you are the lower proportion of your income you \"need\" to survive/live. So even with a proportional fine based on income say at 10%, that 10% is desperately needed by the poorer person to pay rent, but that 10% is used for luxury or investing by the richer person.\n\nSo let's say we want it to scale upwards with amount of income. 10% for the poorer person 30% for the richer person. Now you are harming both people's ability to survive as the richer person, although richer still has to pay their mortgage or their kids private schooling or any form of reccuring payment. Sure it deters them but now the whole you don't want them to punish them so badly goes out the window.\n\nSo why not something else, like community service, let's turn this low level crime into a benefit for society, mandate that the person spends 3 hours volunteering at a food bank a week for 3 weeks. Some real good has come of this and it has impacted both people equally (although I do recognize that the poorer person may need those hours to work that's a fundamental flaw with our society not one that can be fixed through punishment).",
            "title_similarity": "0.82703936",
            "sentiment_compound": -0.8863
        },
        {
            "id": "h5nvsd6",
            "score": 49,
            "text": "I’m ok with that if you could also offer your time instead of paying the fine, that way everyone has an equal payment method(their time). Instead of a parking fine being 1000s and 1000s of dollar, they could do an hour of community service etc",
            "title_similarity": "0.6813749",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5nma4n",
            "score": 1,
            "text": "If someone will a billion dollars looses 99.9% of their money they still have a million, I'm not sure there's a percentage that's equivilently punative to everyone.",
            "title_similarity": "0.5690082",
            "sentiment_compound": -0.374
        },
        {
            "id": "h5nqhc5",
            "score": 1,
            "text": ">The only way you can make sure rich people won't just shrug and metaphorically throw a moneybag at every policeman who wants justice is to make them pay a percentage of their monthly salary.\n\nPaying a percentage of income would make rich people more likely to pay off law enforcement to get out of it because fines would be more expensive.",
            "title_similarity": "0.88911355",
            "sentiment_compound": 0.8965
        },
        {
            "id": "h5nqk1f",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.026273165"
        },
        {
            "id": "h5nrn21",
            "score": 1,
            "text": "They do this in Finland I believe",
            "title_similarity": "0.19889027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nrrva",
            "score": 1,
            "text": "The biggest problem is that monthly salary doesn't tell you much about wealth.  It tells you a lot, but not enough for what you're asking.",
            "title_similarity": "0.62634575",
            "sentiment_compound": 0.0644
        },
        {
            "id": "h5nsggo",
            "score": 1,
            "text": "Suppose there is a person who has zero income. They can then just break any law that is punishable by a certain amount of fine without any consequences according to your proposal?",
            "title_similarity": "0.7639788",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nsw86",
            "score": 30,
            "text": "There still needs to be a minimum penalty. It's also hard to determine a persons wealth, a rich kid may have nothing to their name officially but still have access to billions.",
            "title_similarity": "0.6910758",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5ntfmb",
            "score": 1,
            "text": "This is kind of splitting hairs, but it'd be more accurate to say throw money bags at the court, not policeman. At least in the US, the money gets spent on lawyers in court, the police don't get squat",
            "title_similarity": "0.7775957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nuv2s",
            "score": 2,
            "text": "What about perpetrators who don't show much income but have a lot of assets? Those that hide income from taxation would certainly hide it from fine collection as well.",
            "title_similarity": "0.67372394",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h5nvjjl",
            "score": 2,
            "text": "I think doing stuff like tax evasion, fraud etc. should be payed in what is owed. If you can afford to to evasion for $100.000 then you can afford to pay $100.000",
            "title_similarity": "0.6833905",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5nwr78",
            "score": 1,
            "text": "The wealthy often go multiple years without taking income of any kinds, including capital gains. Do they just not get fined?",
            "title_similarity": "0.58634686",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5nwy0o",
            "score": 1,
            "text": "Community service. Nobody has unlimited time.",
            "title_similarity": "0.285236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nxvzs",
            "score": 1,
            "text": "many billionaires have near 0 income",
            "title_similarity": "0.31229648",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nxxfb",
            "score": 2,
            "text": "Income based or net worth based?\n\nMany billionaires don’t have incomes or only have small incomes. Their money is tied up in business, other investments, etc. \n\nA lot of them may have a become less than what you make.",
            "title_similarity": "0.47653168",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5ny4ch",
            "score": 1,
            "text": "Some billionaires make little to no salary, with everything in stocks, etc. Mark Zuckerberg has a salary of $1.",
            "title_similarity": "0.51127815",
            "sentiment_compound": -0.2315
        },
        {
            "id": "h5ny9fz",
            "score": 1,
            "text": "Rich people ... monthly salary ... lmao you really don’t get how rich rich people are",
            "title_similarity": "0.6085682",
            "sentiment_compound": 0.9403
        },
        {
            "id": "h5nyme6",
            "score": 1,
            "text": "What happens if Bill Gates chauffeur gets a speeding ticket while driving Bill Gates around town?  Who gets the ticket?",
            "title_similarity": "0.5210073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nzbsj",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5nzce4",
            "score": 1,
            "text": "I think the problem more comes into the logistics of it that you are missing.\n\n&#x200B;\n\nSuppose person x is a rich person. Lets suppose he earns about 50 million dollars per year on average due to how he grows his assets.\n\n&#x200B;\n\nThe problem is that anyone making somewhere in that massive range, 99% of that income *is not money*. Its stocks, property, many assets that aren't liquidated. And while it is \"income\", that income won't even be taxed until they liquidate said assets. \n\n&#x200B;\n\nSo we get into this weird tricky middle grown. Person x has made 50 million in assets, but hes only liquidated 500,000 dollars each year. Does the ticket come from what he generally liquidates, which naturally is what he physically gets in terms of cash? But its still not going to hurt person x - he can just liquidate a little more of his assets than he usually does. \n\n&#x200B;\n\nBut you CANNOT force him to liquidate some of that 50 million he made in assets. Otherwise, people will use that to force people to liquidate their assets at a smaller scale, which would only serve to further the gap between the rich and the poor. People on the cusp of building their assets would be heavily punished in an unfair way to spite rich people for these fines.\n\n&#x200B;\n\nAll in all, I agree that flat fine rates are kinda bm. Its just incredibly challenging to create rules that work the way you describe. You can't just drop a percentage of someones yearly income, because all the people you are describing essentially don't play by the same rules as the average person does.",
            "title_similarity": "0.64897525",
            "sentiment_compound": 0.9067
        },
        {
            "id": "h5nzy3h",
            "score": 1,
            "text": "How about moving away from fines for many crimes entirely? \n\nIf you litter, you have to spend two hours of community service picking up trash. If you speed, you have to spend time as a crossing guard or something similar. If someone gets caught doing graffiti, they have to spend time cleaning up graffiti. If people are forced to spend their time doing something related to their crime, both to help make up for it to society and to see the direct impact of what they did, they would likely think twice about doing it in the future. \n\nAs long as there is leniency in scheduling so people who are paid hourly don’t lose income, it seems like a very fair solution that would affect everyone roughly equally.",
            "title_similarity": "0.7651815",
            "sentiment_compound": 0.0442
        },
        {
            "id": "h5o050d",
            "score": 1,
            "text": "I think we should abolish a financial based punishment and we go back to capital punishment so that it’s even across the board.",
            "title_similarity": "0.67676127",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h5o05u7",
            "score": 1,
            "text": "Not income based. Net worth based.",
            "title_similarity": "0.20450106",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5o0ay1",
            "score": 1,
            "text": "What do you do with a person who has zero income? Like a jobless teen",
            "title_similarity": "0.38181353",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5o11o4",
            "score": 1,
            "text": "There is no good way to perform this in regard to capital gains, imo, which is a/the signifcant source of income for rich people.",
            "title_similarity": "0.5976423",
            "sentiment_compound": 0.5565
        },
        {
            "id": "h5o178n",
            "score": 1,
            "text": "One of the lads from Ant and Dec got a fine a few years back and it was done the way you suggested. A few years before Wayne Rooney was fined a few hundred quid but then the law came in and Ant and Dec dude got fined  almost £90k\n\n&#x200B;\n\nhttps://www.bbc.com/news/entertainment-arts-43786771",
            "title_similarity": "0.67392474",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h5o1d5u",
            "score": 3,
            "text": "The biggest issue would be with people who have incomes that fluctuate wildly like freelancers or people who work on commission. Even someone who just sold their house would report massive one year income that does not represent what they normally make.\n\nIn addition, the legal costs would be tremendous because not only does the court need to hire people to verify income/assets or whatever, but rich people will fight like hell in court. This policy would certainly create many occasions where the cost to collect the fine exceeds the actual fine.",
            "title_similarity": "0.72140217",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h5o1dj8",
            "score": 1,
            "text": ">This is the only fair way to financially punish someone, whether you should do that in the first place is a topic for another day.\n\nCan you tell me why it's a topic for another day? If the premise of \"fine is here to financially punis\" is wrong, then wouldn't all discussion be moot?  \n\n\nAll in all, fine main goal should not be financial punishment, as it will fail in that matter no matter how you would overcomplicate calculation of it.",
            "title_similarity": "0.81573796",
            "sentiment_compound": -0.5867
        },
        {
            "id": "h5o1xoi",
            "score": 1,
            "text": "The wealthiest of wealthy have little or no taxable income. What they do have are assets. How far do you want to go down this idea? Should people be audited? Wealthy people seem to be masters of delay and distract in courts.",
            "title_similarity": "0.66995466",
            "sentiment_compound": 0.6296
        },
        {
            "id": "h5o2r76",
            "score": 1,
            "text": "I like this idea, keeps it fair while handing out justice. But also I still believe that all fines should be doubled exponentially each time someone repeats that offense.",
            "title_similarity": "0.65827835",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5o2vqf",
            "score": 1,
            "text": "Make the fine x% of their reported networth, easy money. Also politicians are subject to severe fine since they should be put out as example to the people. Not like acting that they are all above the law.",
            "title_similarity": "0.85623497",
            "sentiment_compound": 0.1999
        },
        {
            "id": "h5o3bi1",
            "score": 1,
            "text": "Fines have become how a lot of government departments fund themselves especially in smaller towns and cities. It’s abused quite regularly. I don’t know what the alternative is maybe all fines have to be paid in the form of community service?",
            "title_similarity": "0.6524638",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h5o3wbh",
            "score": 1,
            "text": "What defines \"rich\"? And why is it always assumed that those who bring home more money aren't paycheck to paycheck as well? If it was all about take home pay I'm sure Elon music wouldn't be making $24,000 a year salary in 2019 and I'm sure bezos wouldn't be only taking his $81,000 a year salary. I've been blessed to see many sides of this personally. yes a traffic ticket or a medical bill can set back those who are impoverished. Yes a medical bill can force those with multimillion dollar homes and cars to sell or foreclose their properties. Yes there are \"rich\" people swimming to their eyebrows in debt that they cannot pay back. And while this happens those that are truly wealthy will never see this problem, and no these are not just bezos or Elon types. There are local business owners and workers who something like this will never affect because of where they are positioned in life. Are they considered middle or lower middle class? Sure but the free cash they have due to properly money management allows them to absorb the what if's.",
            "title_similarity": "0.76866716",
            "sentiment_compound": 0.955
        },
        {
            "id": "h5o49al",
            "score": 1,
            "text": "Some spouses are at-home spouses, so do we penalize based on a division of two? Do we count children? Other dependents?\n\nSome people don’t have income per say. They pull out pension savings, inheritance and the like. How do you account for this? Cuz the goal of the rich is to already make it look like they have no income. This would only make things worse tbh",
            "title_similarity": "0.70899653",
            "sentiment_compound": 0.644
        },
        {
            "id": "h5o49h7",
            "score": 1,
            "text": "People keep bringing this up. Why should a single mother of 3 kids should have to pay more for speeding than someone with no expenses that has a retail job? Just because she makes 20% more than minimum wage?",
            "title_similarity": "0.6544199",
            "sentiment_compound": -0.4515
        },
        {
            "id": "h5o678c",
            "score": 1,
            "text": "So should younger people have longer jail sentences too?  Seems unfair to take more years from someone who has less of them in their pocket?  I mean sure they've already used lots of them, but someone with less money could also be rich a few years later so sounds like we're talking about their present state?",
            "title_similarity": "0.6832676",
            "sentiment_compound": 0.8692
        },
        {
            "id": "h5o6vtr",
            "score": 1,
            "text": "What if it encourages the antisocial among the poor to commit crimes knowing their fines will be low?",
            "title_similarity": "0.6403363",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h5o6wmn",
            "score": 3,
            "text": "So you think 1) that rich people are able to ignore the law bc they don’t care about the consequences 2) fines are designed as consequences to committing crimes and 3) increasing fines would make rich people care about the fines, and thus care about the law. \n\nI find all 3 of those assumptions to be incorrect. \n\n1) Rich people and poor people both break the law. If your assertion is that rich people avoid all consequences, and that encourages these people to commit crimes, we would see something statistically significant. In real statistics we see that the lower your income the more likely you are to commit crimes. So if your assumption is that raising rich people fines will lower their crime rates, we should see that the opposite is true too, that with our current low rich people fines they’re committing a lot of crime. We don’t. Why is that? I’d guess it’s bc fines are rarely the only form of punishment, and the non-monetary consequences (jail time, license points, legal record) will have a disproportionate monetary effect. 1 year of jail for a non earner vs a heavy earner have 2 very different opportunity costs. \n\n2) Fines are presented to be punitive but they’re all about revenue. Charging a flat rate is simply easier. The government is not an effective pricing agent and giving them the power to do so would likely be mismanaged. \n\n3) if we acknowledge fines are usually a tandem consequence, then we also acknowledge that rich people do pay for their crimes. If you see any truth to what I posited earlier about opportunity cost, looking at the legal consequences in their entirety and not one aspect, then poor people are paying less in some forms of punishment and rich people are paying less in fines. Making fines variable based on the person’s income would require the variability of other forms of punishment too. What if you were jailed for the amount of time it would take you to generate X income?? Bezos would spend 30 min and a homeless guy would spend his whole life for the same crime. Do you think that’s fair? Do you see the slippery slope your CMV implies?",
            "title_similarity": "0.8175927",
            "sentiment_compound": 0.8324
        },
        {
            "id": "h5o7qdx",
            "score": 1,
            "text": "What if someone making 100k is working twice as hard in manual labor as the person making 60k (who is working a desk job)\n\nThen, if you fine based on income, you are taking more of the 100k dude's hard work.",
            "title_similarity": "0.5590633",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5o9ouw",
            "score": 1,
            "text": "I saw this beforehand, gut couldn't this end up negatively effecting less wealthy individuals because of nature of profession? (This is mainly for ticket and driving fines) - \n\nAny person who is wealthy enough, they can hire a personal  driver, so they become immune to these fees. The same is for someone with an accountant or someone who can compensate for a profession that is associated with possibility of fines. This implementation can be abused through this loophole, no?",
            "title_similarity": "0.7744786",
            "sentiment_compound": 0.4991
        },
        {
            "id": "h5o9vjs",
            "score": 1,
            "text": "I swear to god I've seen a similar post recently",
            "title_similarity": "0.13510463",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5o9zck",
            "score": 1,
            "text": "This also just means police will only patrol wealthy neighborhoods, looking for any minor infraction since they can make more money that way.\n\nI would imagine there is little incentive to even be near an impoverished area, to help or otherwise.",
            "title_similarity": "0.7898811",
            "sentiment_compound": 0.7512
        },
        {
            "id": "h5oa0lh",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.02627311"
        },
        {
            "id": "h5oc6om",
            "score": 1,
            "text": "Im pretty sure that at this point corporations consider fines when doing illegal shit.  10 million profit for 100k fines?  K",
            "title_similarity": "0.6859052",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h5oca6s",
            "score": 1,
            "text": "I agree with you but this ultimately comes down to an argument of equity vs equality. Would you rather everyone pay the exact same amount or would you rather it have the same effect? I personally agree with the latter but some people could make a fairly convincing argument for the opposite",
            "title_similarity": "0.6273914",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h5od92r",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5odeov",
            "score": 1,
            "text": "A 50 year old early retired guy has an income of $0. Does he pay no fines?",
            "title_similarity": "0.46494502",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h5odx5w",
            "score": 1,
            "text": "Percentage of monthly salary is stupid. CEOs can have a monthly salary of $1 but still get $50 million in stock options.\n\nI'm not rich at all, but my salary is about 1/3 of my annual income.\n\nThere is also a world of difference between a healthy 23 year-old making $100k and 39 year old with a sick spouse and four children who also makes $100k.\n\nThere is also a world of difference between someone making $100k and living in LA and someone making $100k living the middle of Iowa.\n\nMonthly income doesn't reflect someone's ability to pay a fine.",
            "title_similarity": "0.64966935",
            "sentiment_compound": -0.8329
        },
        {
            "id": "h5odxbe",
            "score": 1,
            "text": "How about this instead, because I already take issue with fines being used as a way to generate revenue.  Every fine/punishment should be volunteer time based.",
            "title_similarity": "0.74346673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5oe05j",
            "score": 1,
            "text": "I think the problem with this view is that you are viewing fines exclusively as deterrents. Fines should be tied in some way to correcting harm. If you back your truck into your neighbors lawn, it makes sense that you pay what it will cost to hire a landscaper or something to correct the problem. If your neighbor is a millionaire it doesn't make sense that he pays 10 times as much for the same mistake.",
            "title_similarity": "0.8009648",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h5oewha",
            "score": 1,
            "text": "Bill gates: Wow I stole a water bottle time to pay 15M!  Or what about the unemployed",
            "title_similarity": "0.55448616",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h5ofs2m",
            "score": 1,
            "text": ">What I'm asking is implementation of Day fines on every fine.\n\nI agree with you in principle, but this is not the way to do it. For a person making minimum wage losing a day of income could mean not eating that day. For a wealthy person it means losing an annoying amount of money. Personally, I think fines should scale up with tax brackets.",
            "title_similarity": "0.84977376",
            "sentiment_compound": -0.714
        },
        {
            "id": "h5ogdzw",
            "score": 1,
            "text": "So no 14th amendment?",
            "title_similarity": "0.12282966",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h5oh7yi",
            "score": 1,
            "text": "Same crime, same punishment \n\nIf I run a red light, and the Ferrari behind me runs the same red light, why should they pay more? Because they can?",
            "title_similarity": "0.670056",
            "sentiment_compound": -0.8156
        },
        {
            "id": "h5oizcs",
            "score": 1,
            "text": "Should be based on wealth and income. The wealthy are experts at hiding income so if you just base it on that some billionaires would have an effective income of $0.",
            "title_similarity": "0.7088371",
            "sentiment_compound": 0.765
        },
        {
            "id": "h5oka8u",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5okk20",
            "score": 1,
            "text": "If it’s drunk driving they should lose their car , no exceptions. Give the proceeds to victims of drunk drivers.",
            "title_similarity": "0.65445554",
            "sentiment_compound": -0.875
        },
        {
            "id": "h5oks5c",
            "score": 1,
            "text": "I think fines should be time based personally. Speeding 120 down a 65? That’ll be 8 hours in a courthouse.",
            "title_similarity": "0.6773822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ol9i7",
            "score": 1,
            "text": "Horrible idea.  \n\nPoor people with no income immune to fines?  \nJust keep doing the shit over and over again.  \n\nA flat fine is always needed to avoid loopholes.  \n\nAlso rich people can and will declare no income to avoid paying shit",
            "title_similarity": "0.8201945",
            "sentiment_compound": -0.8586
        },
        {
            "id": "h5oljap",
            "score": 1,
            "text": "One point made last time someone suggested this (and haven't found ITT yet) is that this would be abused by shady authorities who would see wealthy people as an easy target, maybe even to the point that fining poor people wouldn't even be profitable.",
            "title_similarity": "0.6709154",
            "sentiment_compound": -0.5277
        },
        {
            "id": "h5olt8m",
            "score": 1,
            "text": "The idea sounds great in theory, but I think we’d run into the same frustrations people have regarding the tax liabilities of millionaires/billionaires. The system would be taken advantage of. Would you be even more frustrated if someone richer than you actually pulled the right levers to pay less for a fine than you? \n\nMy largest concern is the cost of resources to support this idea. I would be very opposed to increasing the federal/local government budget to support this.",
            "title_similarity": "0.7642316",
            "sentiment_compound": 0.6922
        },
        {
            "id": "h5oluc6",
            "score": 2,
            "text": "I can tell you for sure that for people with money things like speeding tickets and civil fines are little more than an annoyance. I have a friend who, even before he was making real good money, simply referred to speeding tickets as a \"go fast tax\".\n\nYou're idea has merit but the system will never be willing to put people on even footing.",
            "title_similarity": "0.7834018",
            "sentiment_compound": 0.6776
        },
        {
            "id": "h5ommix",
            "score": 1,
            "text": "Someone can make very little money but have no debt or other liabilities to take tare of. For that person 10% of their income going to a fine one month is OK. A second hypothetical person has a ton of debt to pay of. Let's also assume that it's medical debt for the sake of my argument. This second hypothetical person lives paycheck to paycheck to manage all their debt and to provide for their family. The same fine of 10% percent can financially ruin them and send them into bankruptcy. A system of direct percentage punishes hardship the hardest. A way of measuring the fine should be based on net worth and not income. Of cource common sense should apply and not give away money to people with negative net worths that break the law and not take 1 million dollars from a billionaire if they park illegally.",
            "title_similarity": "0.78009397",
            "sentiment_compound": -0.9765
        },
        {
            "id": "h5omtrk",
            "score": 1,
            "text": "Jail time should be based on how much free time people have-I can’t go to jail for murder, I have to take care of my mom on the weekends!",
            "title_similarity": "0.7466544",
            "sentiment_compound": 0.2714
        },
        {
            "id": "h5omwt6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5on58b",
            "score": 1,
            "text": "Rich people have multiple sources of income. How would you calculate it? It can be a challenge especially considering rich ppl have a variety of assets such as properties, stocks, and collectibles that make income for them",
            "title_similarity": "0.4554208",
            "sentiment_compound": 0.8583
        },
        {
            "id": "h5on61y",
            "score": 1,
            "text": "So a jaywalking ticket should net the city tens of thousands of dollars because it was a professional athlete or jeff bezos? Open season on rich people! Fill the coffers!",
            "title_similarity": "0.6007355",
            "sentiment_compound": 0.6351
        },
        {
            "id": "h5ondp7",
            "score": 1,
            "text": "A fine may be insignificant in terms of a wealthy person's wealth - but I guarantee you nobody wants a day in court no matter how rich they are (including all the surrounding stuff like documents, arranging legal representation, travel, accommodation, time off work e.t.c). The act of going through a legal process is not fun, and I think for many \"fine worthy\" offenses the legal process itself is more of the punishment than the fine. As long as the fine generally covers the court costs this is probably fine honestly.\n\nA lot people can afford a $500 fine, most of them are not particularly rich. I bet that a *very* significant proportion of \"average\" people would rather immediately pay $1000 and that's the end of the matter instead of have to go through the whole court process. However nobody has that option, including the super wealthy.",
            "title_similarity": "0.80152833",
            "sentiment_compound": 0.9804
        },
        {
            "id": "h5oni3o",
            "score": 2,
            "text": "Just to throw smthng out there:\nMake fines for people above a certain income (tax classes could be used 4 example) to be paid in community service with no other option than jail.",
            "title_similarity": "0.8211043",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h5onmt1",
            "score": 1,
            "text": "While a fine based on income is a great idea, there are some issues with just looking at someone's daily/monthly/yearly income to determine the fine.\n\nOne thing I have not seen anyone else mention is overtime or the amount of hours worked. If someone chooses to work 20 hours of overtime per week (assuming a 40-hour work week), their fine would increase by 75% if it is proportional to their income. It seems wrong to punish someone more harshly just for putting in more time at work.\n\nAdditionally, it can actually punish less-advantaged people who work long hours at multiple jobs more than people with just one full-time job. Imagine Abby makes $10/hr working 60 hrs/week split between two jobs, and Beth makes $14/hr working 40 hrs/week at just one job. Abby would have a larger fine than Beth since Abby makes $600/wk and Beth makes $560/wk. It seems like an incredibly *regressive* outcome for Abby to pay more than Beth does, especially in the United States where it's more likely Beth has things like vacation time and health insurance when Abby likely does not.\n\nI think that a \"fair\" calculation should be based on more than just raw income stats, as these examples show.",
            "title_similarity": "0.736516",
            "sentiment_compound": 0.8646
        },
        {
            "id": "h5oo9x5",
            "score": 1,
            "text": "Then poor people would be able to commit crimes with no fines",
            "title_similarity": "0.6523899",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5ooxia",
            "score": 1,
            "text": "It’s a great idea if you assume everyone works a 9-5 full time job, and have steady incomes, but people working in contracting (like myself) or other jobs that vary in pay will potentially get screwed.\n\nFor example, if I declare $120,000 in income on my taxes for 2021, that would mean I made about $10k per month that year. Then, at the end of 2021, that contract ends and The next year is slow for contracts, so I take a $65,000 contract for 2022. The government doesn’t know this obviously, and base my fines off of last year’s income. That’s a problem.\n\nNot to mention people who get laid off and can’t find work. Fines based on last years taxes would hurt them pretty bad. (At the moment, the only way the government can tell how much each person makes is off of last years taxes, so unless we have to declare every paycheck we get to the government each month, they’ll just use tax info from the previous year)",
            "title_similarity": "0.73426336",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h5op0y9",
            "score": 1,
            "text": "Looking through a lot of these comments, I’m noticing most people are talking about how it’s nearly impossible to calculate wealth to base a fine on. Which I agree with.   \nMy thought is that fining people in this way is no different than making a rich person pay more for goods in a store because they can afford it.  \nIf a person making $3000 a month buys a 52” TV, it’s a huge purchase which will affect how they spend for a short time. (No eating out this month, honey.) Whereas a millionaire can easily buy a massive TV like it’s nothing.  \nIt sucks that wealthy people can buy their way out of a lot of problems, but that’s part of what having money does for you. Whether it’s a crime or just everyday life, the less money you have, the more things are going to affect you. The more money you have, the easier you’ll be able to do things.",
            "title_similarity": "0.7349229",
            "sentiment_compound": 0.7395
        },
        {
            "id": "h5ophom",
            "score": 1,
            "text": "If we did that the poor would get heavier fines and the rich would get ridiculously low fines.  Wait....",
            "title_similarity": "0.6728147",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h5opj6p",
            "score": 1,
            "text": "But make it NET income pls",
            "title_similarity": "0.23237294",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h5oplz9",
            "score": 1,
            "text": "Buggles",
            "title_similarity": "-0.055619303",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5oprdz",
            "score": 1,
            "text": "I agree and understand that it is likely impossible to implement. However it would be easier to do for corporations. Corporations commit crimes all the time knowing if they are fined they will still make a profit.",
            "title_similarity": "0.81098986",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h5oq0gf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5oqbth",
            "score": 1,
            "text": "OP reminds me of the [Big Mac guy](https://youtu.be/DJKf9wKSbZ4) who thought his idea was so good that he tried pitching it to Noam Chomsky only to realize he hadn’t thought it through whatsoever.",
            "title_similarity": "0.51648337",
            "sentiment_compound": 0.5777
        },
        {
            "id": "h5oqcfq",
            "score": 1,
            "text": "Removed",
            "title_similarity": "0.0061346292",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5oqzpb",
            "score": 1,
            "text": "If I were rich I’d just hire poor people to take the fall for me and then be able to commit crime all day and pay minimal fines.",
            "title_similarity": "0.8233593",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5orr40",
            "score": 1,
            "text": "Fines aren't the only way of punishment. At least when you are talking about cars.\nIn my country (and probably every country) they attribute a number of points to someone's license for everything they do wrong, with speeding, for example it's 7 points and if you get over 20 points in a year you lose your license. THAT'S the real punishment. Most of the fines are symbolical anyway, since losing your license causes much more trouble than a fine would for most people.",
            "title_similarity": "0.7429069",
            "sentiment_compound": -0.9402
        },
        {
            "id": "h5os5wr",
            "score": 1,
            "text": "**Perhaps fines themselves should be abolished!** Since a monetary fine will almost always punish poor people proportionally more than rich people (especially given your acceptance of a minimum fine), perhaps we should consider different deterrent methods.\n\nThe most common case for fines that I know are driving code violations, but those already come with a point system in most jurisdictions. Punishment can be kept to just points and warnings. We also have technology now that can be imposed if you have too many points, like breathalysers tied to the ignition, or GPS speed monitoring. And of course your license is taken if you surpass some point threshold, then it becomes a crime to drive.\n\nSecond case is taxes, and since it's all about income, perhaps this is the only place where fines can be imposed perfectly proportional to income. A percent fine per day of skipped taxes seems like a fair fine; it's basically interest to discourage artificially borrowing by paying taxes late. Also there's no minimum fine requirement because someone earning 0 cash needs to pay 0 taxes. Avoiding taxes altogether can also be followed up by the criminal code; either there are extenuating circumstances like a person selling all his stock portfolio to pay for cancer treatment and going bankrupt or it's a rich dude dodging taxes and the criminal code already handles that.\n\nThere are of course civil cases, where the aim is to make the victim whole. I don't know how this can be solved equitably because a poor person can damage a rich person's property. It would be an unfair burden to make the poor person pay the rich guy for all the damage caused, but it's also unfair for the rich guy to just have to eat the damage. Perhaps insurance (on the rich person's property) can handle accidents, and the criminal code can handle intentional damage.\n\nOverall I stand by the principle that all interactions with the government should be free (except taxes...). There shouldn't be any monetary fines, nor any monetary fees for any services. This removes the conflict of interest for petty crimes (cough asset forfeiture, speed traps, etc.); and for the fees side it should also encourage efficiencies in the bureaucratic process because now the government has to eat the cost of issuing IDs, licenses... I think it's fair since the government itself imposed an obligation on people to obtain those licenses. My principle extends beyond fines to also patents, medical licenses, building permits and so on; any fee is a barrier to entry or an unfair burden imposed by the government and they all affect the poor more than the rich.",
            "title_similarity": "0.7997385",
            "sentiment_compound": -0.9865
        },
        {
            "id": "h5osqz8",
            "score": 1,
            "text": "This is literally the 10th time I've read this CMV",
            "title_similarity": "0.26938304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ot4tt",
            "score": 1,
            "text": "Fines are generally for pretty minor infractions. Half these crimes are insignificant like speeding, jaywalking, parking in the wrong spot, etc and can easily be done unintentionally or with zero harm to anyone.  Fining someone $100k for parking for 2.5 hrs when the meter caps out at 2 hrs  just \"cause they can afford it\" is a punishment that far exceeds the crime. \n\nFurther, these petty rules are usually subjectively enforced- like things cops often give warnings over or just not care about at all-  so this would greatly increase the impact of police bias, which is a pretty obvious issue by now. If this money goes to the police department it'd also encourage them to target anyone making above a certain amount which would be just as unfair as any other sort of police bias, esp since itd just be a way for cops to get rich. The potential for abuse is absurdly high here\n\nFrom a cost and labor perspective you'd also have to determine every persons income to issue a simple fine...good luck with that. People already think its a waste of government resources to go after crimes this petty; imagine trying to convince the community that trying to figure out incomes for everyone getting a speeding ticket is a worthwhile use of tax money",
            "title_similarity": "0.8054004",
            "sentiment_compound": -0.5759
        },
        {
            "id": "h5oteq3",
            "score": 1,
            "text": ">Update: Today I realized how little I know about the rich. It probably won't come to many in here's surprise to learn I have no friends in the upper class. The more you know and all.\n\nYou probably do know at least one, as they hide it.  Read a summary of the book The Millionaire Next Door to get an idea.",
            "title_similarity": "0.6485168",
            "sentiment_compound": 0.3498
        },
        {
            "id": "h5otjin",
            "score": 1,
            "text": "That's just to much effort for a speeding or parking ticket etc. Not feasible. It's not worth it to overload the government with tasks like that.\n\nFor actual crimes I completely agree but implementing this for every small petty fine as well is insane",
            "title_similarity": "0.745157",
            "sentiment_compound": -0.0866
        },
        {
            "id": "h5oue6i",
            "score": 1,
            "text": "Monetary fines shouldn’t even be a thing",
            "title_similarity": "0.39253104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ouhg8",
            "score": 1,
            "text": "Just add some community service to some fines and they’ll hurt “rich” people really hard.\n\nDriving really fast? (Fixed) Fine + few hours community service. That way you don’t have to bother with determining someone’s income",
            "title_similarity": "0.8139248",
            "sentiment_compound": -0.6629
        },
        {
            "id": "h5ounib",
            "score": 1,
            "text": "Should fines be as complicated as filing a tax return? Should the revenue for a single mother of 5 be measured the same as a 20 year old without kids?  What should the punishment be for people who calculated adjusted revenue incorrectly?\n\nIt very quickly becomes more punitive for the people who are more poor, similar to taxes.",
            "title_similarity": "0.6820755",
            "sentiment_compound": -0.894
        },
        {
            "id": "h5ousvc",
            "score": 1,
            "text": "Bezos = no federal income. Mind changed yet?",
            "title_similarity": "0.35332626",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5owek1",
            "score": 1,
            "text": "A point that works off of a tangent to the community service one: a rich person is in a much better position to be able to pay a day's worth of pay/some percentage of their income than a poor person. Someone who makes $1 million a year can afford even a $10k fine much better than someone who makes $30k a year can afford a $300 fine despite them both paying 1% of their income. The person making 30k a year might only be just scraping by as it is and a $300 fine could be the difference between having heat/AC/power vs not being able to pay that bill that month whereas the other person would still be netting $990k a year.\n\nIf your goal is financial fairness, I'd say a straight percentage wouldn't accomplish that. You'd need some sort of tiered scale of percentages similar to the tax rates to actually achieve some semblance of a fair impact. That said, fining the $1 million/year person $900k  while fining the $30k/year person $100 seems kinda fucked up.",
            "title_similarity": "0.67817616",
            "sentiment_compound": 0.7623
        },
        {
            "id": "h5owkk9",
            "score": 1,
            "text": "Just like taxes.....yeah that won't get abused or loop holed.",
            "title_similarity": "0.43599215",
            "sentiment_compound": 0.6372
        },
        {
            "id": "h5ox13t",
            "score": 1,
            "text": "Except wasn't Jeff Bezos technically only paid $0 for his \"Job\" and given stock benefits instead? Or did I miss hear that?",
            "title_similarity": "0.67732155",
            "sentiment_compound": 0.3313
        },
        {
            "id": "h5oxea3",
            "score": 1,
            "text": "Then we have to even up justice with the exorbitant amount of money some people pay to escape justice where those with no money have to suffer the power imbalance associated with not being able to make bail etc. They say the door you come through entering court has a direct effect on the outcome of your court case, you come in the front door you will likely leave by the front door to freedom and if you come from jail (with your jump suit on and handcuffed in some cases) you will leave as you are immediately seen as a greater threat to the community even though you just didn't have the funds to service/ grease the palms of the authorities. Look at the O.J. Simpson case for example.",
            "title_similarity": "0.7695569",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h5oxgku",
            "score": 1,
            "text": "More often than not, court costs are more expensive than the damn ticket. And no matter what, you have to pay court costs.",
            "title_similarity": "0.5984765",
            "sentiment_compound": -0.4895
        },
        {
            "id": "h5oy699",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.026273165"
        },
        {
            "id": "h5oybsm",
            "score": 1,
            "text": "If they're such a danger to society, why don't you think they should go to jail instead of get a fine?",
            "title_similarity": "0.65784836",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h5oyibh",
            "score": 1,
            "text": "I would agree that your Income should factor in. But it should also take into account your household. As 100,000 a year and single is alot different then if you have 3 kids and your s/o is home taking care of them.",
            "title_similarity": "0.5172825",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h5oyt4m",
            "score": 1,
            "text": "This already works so well with taxes.",
            "title_similarity": "0.38849625",
            "sentiment_compound": 0.4101
        },
        {
            "id": "h5oyyrl",
            "score": 1,
            "text": "Make the fines the same. The poor people hopefully will the learn there lesson and repeat offenders get jail time.",
            "title_similarity": "0.6756561",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5oz75p",
            "score": 1,
            "text": "\"If the penalty for a crime is a fine, then that law only exist for the lower class.\" \n\n\n~ Some game character's name that I can't remember",
            "title_similarity": "0.697472",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h5ozl4a",
            "score": 1,
            "text": "ITT:  \n  \n> hurr durr ur punishing people for success \n  \nNo you dumb fuck, they're being punished for committing crimes.",
            "title_similarity": "0.6035337",
            "sentiment_compound": -0.6806
        },
        {
            "id": "h5ozmjj",
            "score": 1,
            "text": "You really think rich people earn a “monthly salary”?",
            "title_similarity": "0.514367",
            "sentiment_compound": 0.5965
        },
        {
            "id": "h5p01jt",
            "score": 1,
            "text": "Many wealthy people have no \"income\" that is even measurable. So basing something on salary would just mean the wealthiest people would be able to whatever they want without paying anything at all!\n\nYou can earn \"wealth\" without having an income. A simple example would be owning real estate that increases in value, but does not produce any \"income\" because the rents received are canceled by maintenance, management, and advertising costs.  \n\n\nAnd when the real estate is sold to produce a profit, it's considered \"capital gains\" and not \"ordinary income.\" And capital gains can be offset by losses or other various business tax shenanigans that you're probably not familiar with.  \n\n\nSo your idea is hopelessly naive and the tax lawyers who already allow the likes of Jeff Bezos to not pay any taxes would now have a side gig getting wealthy people off of paying any fines as well.",
            "title_similarity": "0.7542983",
            "sentiment_compound": 0.9364
        },
        {
            "id": "h5p0gbq",
            "score": 1,
            "text": "This comical the ultra rich don’t have income",
            "title_similarity": "0.43172157",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5p11cs",
            "score": 1,
            "text": "I haven’t seen this argument here yet: the strain on the legal system. If I got a €200 fine it would not be worth it for me to appeal it all the way to court. But, if it was €20 000 I would definitely explore that option. Everyone hit by exorbitant fines would do well to go to court over it. This would lead to a strained system.",
            "title_similarity": "0.7836971",
            "sentiment_compound": 0.2334
        },
        {
            "id": "h5p1k0d",
            "score": 1,
            "text": "\"rich\" people have disposable incomes that are 5 or hundreds of times your disposable income. (That is your \"disposable income\", total minus living expenses and medical, tuition, etc.)\n\nIt is a joke to think you can hurt them with a multiplier.",
            "title_similarity": "0.6064965",
            "sentiment_compound": 0.34
        },
        {
            "id": "h5p2751",
            "score": 1,
            "text": "So there's been a lot of arguments for how the rich aren't actually liquid, so it would be hard to implement for them.  What about the actual poor or homeless with no provable income?  Would they be free to commit minor crimes since the fine on 0 income would be 0?",
            "title_similarity": "0.7608409",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h5p3l7g",
            "score": 1,
            "text": "This is honestly a terrible idea. You now base punishment based on your class and what you’re worth. Talk about having a very disgruntled populace across the board. For a middle class person, a parking ticket for say $100 is now $200 because they make more than your average Lower class income worker, who now just pays $50. You will now cause much greater resentment in society, while increasing potential fines for the average American. The punishment cannot be different for all. It has ranges based on severity and discretion of the authority on scene or the court/jury. It’s a very bad idea and immoral. What you suggest just further divides us, rather than allowing justice to be fished out equally no matter your wealth or status (for the average American), you want it to now to divide your punishment based on your class. All you present is another way to divide and conquer a population, especially in a time of political divide in the US.",
            "title_similarity": "0.7605226",
            "sentiment_compound": -0.8769
        },
        {
            "id": "h5p44yc",
            "score": 1,
            "text": "Fines and fees exist soley to squeeze the poor for every drop of income we make.",
            "title_similarity": "0.729507",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h5p4o2c",
            "score": 1,
            "text": "I’m glad you’re not a politician.",
            "title_similarity": "0.36039373",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h5p4ude",
            "score": 1,
            "text": "Jeff Bezos makes $81,000 a year. Under your system, he would be fined by that figure.\n\nThe current system works just fine - not to mention that your system is in violation of the 14th amendment",
            "title_similarity": "0.7347857",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5p51v5",
            "score": 1,
            "text": "Why the fuck should we change your view you narcissistic fucking juvenile?",
            "title_similarity": "0.41272274",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5p5fta",
            "score": 1,
            "text": "It should be wealth based, not income based.",
            "title_similarity": "0.3743453",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h5p61lv",
            "score": 1,
            "text": "Even if it's income based, it would still disproportionately affect poorer people more because there is a minimum living cost.",
            "title_similarity": "0.67600393",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h5p66tx",
            "score": 1,
            "text": "The rich would just skirt regulations by getting poor people to violate the law for them; e.g. they need to dump shit, so pay some bum $5 to drop your waste off the side of the road and not deal with the fine while the fine for the rich guy might be $10000.",
            "title_similarity": "0.78743345",
            "sentiment_compound": -0.807
        },
        {
            "id": "h5p6asb",
            "score": 1,
            "text": "This would imply that the justice system was made to be just.",
            "title_similarity": "0.38727254",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5p6o5w",
            "score": 1,
            "text": "It should be based on net worth.",
            "title_similarity": "0.23740664",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5p6ucx",
            "score": 1,
            "text": "Wouldn't that mean that businesses that pay no income because they show no income on paper would pay no fines?",
            "title_similarity": "0.6487725",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h5p7d88",
            "score": 1,
            "text": "I'm currently jobless. Does this mean I get carte blanche to commit crimes? (I'm in, btw)",
            "title_similarity": "0.5992043",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5p7sqq",
            "score": 1,
            "text": "Income based would mean that the middle class could be fined more than the upper class.  Investment income can be massaged so losses offset gains.",
            "title_similarity": "0.66671836",
            "sentiment_compound": -0.209
        },
        {
            "id": "h5p86ia",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5p88o9",
            "score": 1,
            "text": "Person A makes $1000 a month.  A fine of  $500 would be half his salary, and almost certainly impact his budget.  Person B makes $10,000 a month.  That same fine in all probability would not cause any undue hardship or inconvenience to him at all.  While the fine is theoretically fair, as it applies the same penalty to both individuals, the measurable deterrence that either individual would feel towards committing the offense later is vastly skewed.  If Person A committed the same offense twice in a month, his salary would be 0.  Person B could do the same thing 20 times before he was in a similiar position.  Person A is effectively deterred, but Person B may not be.\n\nIn the interest of parity, income based percentage is the lowest common denominator.  It should hurt Bezos the same as it hurts me to commit a traffic offense.",
            "title_similarity": "0.7823006",
            "sentiment_compound": -0.7349
        },
        {
            "id": "h5p8b2c",
            "score": 1,
            "text": "Then poor people would just break the  law more. If you have no job and no income basically you can break whatever law you want ?",
            "title_similarity": "0.7316373",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h5p9sjq",
            "score": 1,
            "text": "How about instead of fining people money, that will go to the government, and then likely eventually end up in some piece of shit politician’s pocket, we do this - if the penalty would be a fine instead of jail time, some dude punches you in the face. The rich would be just as discouraged from committing crimes, and there wouldn’t be any incentive for the police to target people with more money. Unless that’s your actual goal, punishing people with more money.",
            "title_similarity": "0.83792025",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h5p9t5q",
            "score": 1,
            "text": "Gonna get buried, but:\n\nImagine a rich kid. Zero income, but drives a supercar and lives rent-free in a penthouse their parents bought.\n\nThis kid would pay zero/minimum fines.",
            "title_similarity": "0.6334497",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h5pb0rs",
            "score": 1,
            "text": "I agree for fines only. prison time not so much. prison time should be based on life expectancy and precedent since wealth doesn't matter in jail",
            "title_similarity": "0.72981167",
            "sentiment_compound": 0.6409
        },
        {
            "id": "h5pbap4",
            "score": 1,
            "text": "Wouldn’t proposing taxes that reflect % of income make it all but impossible for the most wealthy to perform most tasks like driving a car? It becomes far too much of a liability if your taillight can go out and you can be fined $60m. I imagine every corporation which involved wealthy individuals in places of their infrastructure (since wealthy individuals are often shareholders) would have mandatory restrictions on normal and everyday actions they would otherwise be free to perform, like walking down a city street, but could result in catastrophic losses for the company if the shareholder were forced to sell a massive position. Imagine if Elon Musk jaywalked and was fined 10% of his worth… Tesla would be hugely impacted.\n\nFining people arbitrary sums for the same crime sounds like placing restrictions on the wealthy, which I imagine you already feel exist for the poor, where the fines are more steep relative to income, and puts you in the same moral position as before, where there is inequity in the system again. What stops an insanely poor person from jaywalking in this scenario? Nothing. Etc. etc etc",
            "title_similarity": "0.7511211",
            "sentiment_compound": -0.2151
        },
        {
            "id": "h5pbezl",
            "score": 1,
            "text": "Every fine should be wealth-based, not income-based.\n\nYou're welcome.",
            "title_similarity": "0.5799589",
            "sentiment_compound": -0.1729
        },
        {
            "id": "h5pc3c5",
            "score": 1,
            "text": "This is just the same problem as taxes. You’re suggesting that Bezos and Trump never have to pay any fines.",
            "title_similarity": "0.7146566",
            "sentiment_compound": -0.3408
        },
        {
            "id": "h5pcdb9",
            "score": 1,
            "text": "That would require the government to know people's incomes. A lot of people believe that that's an invasion of privacy (And before you ask, we also believe it's an invasion of privacy to have income tax and other similar things that involve government knowing people's income).",
            "title_similarity": "0.6406505",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5pcocl",
            "score": 1,
            "text": "What about retired people with no income but a decent amount a wealth.  Do they pay the same minimum fine as a poor retired person with no income?  That doesn’t seem fair!",
            "title_similarity": "0.69864213",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h5pcu6f",
            "score": 1,
            "text": "So if I only have a dollar I can get away with anything then find another dollar >:)",
            "title_similarity": "0.5766339",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h5pcz2r",
            "score": 1,
            "text": "Wealth, not income.  Truly wealthy people do not have a need for income.",
            "title_similarity": "0.4746292",
            "sentiment_compound": -0.0813
        },
        {
            "id": "h5pczep",
            "score": 1,
            "text": "So if a billionaire gets a speeding ticket they should pay 10,000 x as much as a person that makes 100K?  Seems really stupid if you ask me",
            "title_similarity": "0.6848775",
            "sentiment_compound": -0.624
        },
        {
            "id": "h5pd4pu",
            "score": 1,
            "text": "LAPD wouldn't patrol south LA, they'd just patrol Bel-Air.",
            "title_similarity": "0.4360191",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5pdvqk",
            "score": 1,
            "text": "It gives an incentive for poor people to commit crimes.",
            "title_similarity": "0.46548796",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h5pdzyc",
            "score": 1,
            "text": "Can we just fine all the billionaires 2 trillion and be done with it?",
            "title_similarity": "0.65652245",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h5pekxs",
            "score": 1,
            "text": "If I am massively in debt will you pay me to do crime since I have negative income?",
            "title_similarity": "0.6499435",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h5pepb3",
            "score": 1,
            "text": "I wrote a thing for a similar question about a month back, but I don't know how to link it, so I'm just gonna copy/paste:\n\n\"\nYou either intentionally or unintentionally just identified a really cool appendage of the Law&Economics approach to punishment. I'll try and lay out the L&E argument for non-proportional (and therefore nominal) punishments. I'll use the example of speeding, especially because the Finnish have implemented a system of proportional payments in relation to speeding fines which might help you envision the efficiency discrepancy: https://www.weforum.org/agenda/2018/06/in-finland-speeding-tickets-are-linked-to-your-income/#:~:text=In%20Finland%2C%20speeding%20fines%20are,day%20fines%20they%20will%20receive.\n\nAssumptions:\n1) There is a \"right amount\" of speeding, e.g. where the social cost of one more person speeding (in health, money, damages, etc.) is equal to the benefit of one more person speeding (speeding a woman in labor to a hospital is a net good).\n2) A traffic fine is nothing more than an excise tax. It might be better to think of it as an 'expected cost' of speeding.\n3) without speeding tickets, speeding-related injuries would constitute an externality, where the victim has no say in whether the speeder speeds.\n\nEconomic efficiency is achieved when all costs of a transaction are internalized by the agents in an interaction. Econ 101 teaches us that taxes (or subsidies) can be used to internalize externalities. Gas taxes would be a great example of this, where each person would pay for both the carbon and the damage they do to the environment (through the tax). Similarly, by 'taxing' speeding with a discreet amount, we ensure that damages caused by speeding are internalized in the decision to speed while maximizing the utility gained from speeding. If we hook the cost of speeding to income, then we don't achieve the optimal amount of speeding because people then speed based upon their income rather than the actual cost of speeding.\n\"",
            "title_similarity": "0.7134546",
            "sentiment_compound": 0.8327
        },
        {
            "id": "h5pettk",
            "score": 1,
            "text": "Oh look it's me, a naughty billionaire. I technically have an income of $0. Sure I'll pay the fine",
            "title_similarity": "0.682123",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5pfiss",
            "score": 1,
            "text": "Income and repeat offender based no exceptions*",
            "title_similarity": "0.4630165",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h5pfpat",
            "score": 1,
            "text": "So students who have no income pay nothing. Seems fair.",
            "title_similarity": "0.43649915",
            "sentiment_compound": -0.434
        },
        {
            "id": "h5pfxem",
            "score": 1,
            "text": "Wow this makes so much sense",
            "title_similarity": "-0.031621024",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5pg933",
            "score": 1,
            "text": "Okay so to break the law I should quit my job. I have no income",
            "title_similarity": "0.50562656",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5pgopk",
            "score": 1,
            "text": "Change it to WEALTH and we got a deal.",
            "title_similarity": "0.3348701",
            "sentiment_compound": 0.6037
        },
        {
            "id": "h5ph15e",
            "score": 1,
            "text": "I'm just going to sell my stocks at a capital loss, declare a business loss on my tax and not even pay a fine. All of my liquidity is basically zero, because my income is zero. Even though my assets are worth millions of dollars. \n\nAdditionally, who is going to take care of the admin work involved in actually determining the value of this fine? The police won't, the government won't, another external body maybe?",
            "title_similarity": "0.8092809",
            "sentiment_compound": 0.7818
        },
        {
            "id": "h5phb78",
            "score": 1,
            "text": "\"If the penalty for a crime is a fine, then that law only applies to the lower class\" - Final Fantasy Tactics 1997, before \"games got too political\"",
            "title_similarity": "0.76598406",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h5phc63",
            "score": 1,
            "text": "Actually, no fines should cost money. Some people get fined and can't afford it. Solve the problem by making people do community service for every violation.",
            "title_similarity": "0.7635704",
            "sentiment_compound": -0.8268
        },
        {
            "id": "h5phmdt",
            "score": 1,
            "text": "then we'd end up with what's happening in SF and LA, where the poor commit massive amounts of crime with no repurcussion",
            "title_similarity": "0.67157125",
            "sentiment_compound": -0.765
        },
        {
            "id": "h5pia63",
            "score": 1,
            "text": "One of the best arguments I saw last time this was posted was that rich people will just pay low income individuals to break the law for them. Parking tickets for example would result in a much lower fine if the rich person is not the one driving the car",
            "title_similarity": "0.8232843",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h5pj3ax",
            "score": 1,
            "text": "The problem is, if you charge someone with a hundred dollars 99 dollars, they're completely broke, and if you charge someone with a hundred million dollars 99 million, they still have enough money to live the rest of their lives off of.",
            "title_similarity": "0.7246508",
            "sentiment_compound": -0.6997
        },
        {
            "id": "h5pjhjc",
            "score": 1,
            "text": "You're required to pay a fine as to detour you from initiating or repeating and offense....kinda defeats the purpose wouldn't you say?",
            "title_similarity": "0.61294514",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h5pjzhj",
            "score": 1,
            "text": "It’s not fair to fine someone more for doing the same thing someone else did because one makes more money and is more successful than the other. That’s essentially rewarding one party for being less successful and punishing successful people for being successful. This could also apply the 8th amendment if you’re in the US Due to excessive fines. A seat belt ticket in my jurisdiction is 25 dollars, if I get cited a 25 dollar ticket and you make 10x more than me and have to pay 250 dollars for the same infraction, you’ll think it’s cruel. My 25 dollars is worth the same as your 25 dollars and we did the same thing why should you pay more?",
            "title_similarity": "0.7431006",
            "sentiment_compound": 0.9137
        },
        {
            "id": "h5pk5v9",
            "score": 1,
            "text": "> Update: Today I realized how little I know about the rich. It probably won't come to many in here's surprise to learn I have no friends in the upper class. The more you know and all.\n\nWhat did you learn about the rich? Mind editing your OP, so all of us can learn more about the rich as well?",
            "title_similarity": "0.69279766",
            "sentiment_compound": 0.9197
        },
        {
            "id": "h5pl547",
            "score": 1,
            "text": "You mean fines proportional to income or net worth? Because both are different. A high net worth individual can still show loss through accounting magic. Also dirt poor people with no job/income can do crimes with zero/negligible fines?",
            "title_similarity": "0.7834481",
            "sentiment_compound": -0.7622
        },
        {
            "id": "h5pl5xb",
            "score": 1,
            "text": "Like when Nokia board member got a 116.000€ speeding ticket for going 75kph in a 50kph zone (46/31mph).\n\nhttps://www.google.com/amp/s/www.irishtimes.com/news/nokia-boss-gets-116-000-speeding-ticket-1.410276%3fmode=amp",
            "title_similarity": "0.5931304",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5plgrg",
            "score": 1,
            "text": "Classic liberalism was based on equality of the individual (law, property ownership, etc.). So, you're violating that, which kind of goes against the fabric/principles of the West now, in my opinion.",
            "title_similarity": "0.6330961",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5plwiw",
            "score": 1,
            "text": "In general I like the idea of tying fines to how wealthy someone is, as fines have different impacts based on income level.  However, I think you can go too far.   \n\nFor people that have no income how do you discourage them from lawlessness or have consequences after the fact?  There needs to be a floor for the fines, and then the ability to convert fine dollars to hours of community service if there really is no ability to pay.\n\nSecond, there gets to be a miscarriages of justice if fines are drastically different.  If 3 individuals all toss cigarette butts on the ground, 1 gets fined zero because they are destitute, 1 gets fined $100 because they are making a median wage, and 1 gets fined $1 million dollars because they are a billionaire? \n\nAnd that last example cuts both ways  - on one hand, the idea of paying a million dollars for tossing a cigarette butt is just ridiculous.  Punishment should fit the crime, and that doesn't fit.  Second, if that actually happens, they stlll have $999 million of income for that year - every reasonable want is still at their disposal.  So at a certain point it either doesn't affect them OR the absurd size of the fine alters the situation.  Does a $100,000 bribe to someone else close by mean that an innocent person claims it was their cigarette butt after all?\n\nSo there needs to be an upper limit on a fine to keep the crime and punishment in line, and then there needs to  be a non-fine part for repeat offenders - something like 3rd time means you pay a fine but also spend 10 hours cleaning the roadways.",
            "title_similarity": "0.8182547",
            "sentiment_compound": -0.3791
        },
        {
            "id": "h5plyyf",
            "score": 1,
            "text": "How about just NOT breaking the law??? 😂",
            "title_similarity": "0.32094702",
            "sentiment_compound": 0.533
        },
        {
            "id": "h5pn80v",
            "score": 1,
            "text": "The problem with that is...rich people have good accountants. Accountants who know how to write things off, make corporations or holding companies and make it look like they make less than they do. They  would/could end up paying much less if they wanted to.\n\nFor example, if a person owns a company and has a ton of write offs, they can make the business pay for a ton of personal expenses and write them off as business expenses. They would then give themselves a small salary. Their fine would be based on that small salary, not the actual amount they would make. So they'd end up paying a lot less.",
            "title_similarity": "0.7533232",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h5pna4c",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5pngr2",
            "score": 1,
            "text": "They are income based. The less you have, the more you pay",
            "title_similarity": "0.5333569",
            "sentiment_compound": -0.1725
        },
        {
            "id": "h5po23x",
            "score": 1,
            "text": "I don't know what Reddit has against rich people so much. It's probably because you're all students and don't realise you will be rich one day yourselves. Just because you're poor doesn't mean a fine will hit you harder... You're actually more likely to do risky stuff like speed, or take drugs, or bootlegging something, or skip rent to pay for a truck or cable TV if you are poor because you have low brain function, make disastrous choices and that keeps you poor. These guys willingly pay a fine equivalent every month by buying lottery tickets or buying cigarettes. What makes you think a fine will do anything as punishment?",
            "title_similarity": "0.7760908",
            "sentiment_compound": -0.8553
        },
        {
            "id": "h5poog9",
            "score": 1,
            "text": "Income based and a minimum amount",
            "title_similarity": "0.12708703",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5pot9t",
            "score": 1,
            "text": "Do I have to submit a W-2 every time I get pulled over?",
            "title_similarity": "0.42686763",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ppcs2",
            "score": 1,
            "text": "There's two types of fines: Damages and Punitive (simplification)\n\nDamages is just fixing what you broke. It's not about punishment or discouragement, it's just being fair. You broke something, you pay for it. These should be flat. If there's a repeat offender, punitive fines might start stacking up in addition to this.\n\nPunitive fines are there to discourage future issues. They tend to be based on not just how egregious the crime is, but how easy it is to detect. If a certain crime goes unpunished often, like speeding, the ticket will be higher to compensate. Imagine getting a $100+ ticket every time you went 5 over. There'd be riots. The fine is accepted since it doesn't happen often.\n\nArguably, thirdly, fines are there for things that are *technically* illegal/wrong, but nobody really gives a shit. It's just a way to squeeze money out of folks without feeling too morally bad about it since they were technically in the wrong. Stuff like smoking where you aren't supposed to, drinking in a public place, etc. It doesn't really matter if rich folk do it repeatedly and keep paying the fine as long as they're not *actually* hurting anyone, since that money does come in and contribute to the govt funding of public utilities/services.\n\nIMO what you said is true only for crimes that are serious and could hurt someone. Stuff like HOA violations, laws like no skateboarding or stuff like that which nobody really cares about, flat fines are good. It's important to consider that if you do have a sliding income-based fine, it'll be a LOT harder to implement that law, so it'll probably only be reserved for things like reckless driving, assault, etc.",
            "title_similarity": "0.75605434",
            "sentiment_compound": -0.7863
        },
        {
            "id": "h5pqznb",
            "score": 1,
            "text": "The amount of people defending millionaires here is outstanding",
            "title_similarity": "0.48064888",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5pr1u4",
            "score": 1,
            "text": "This sounds nice and all but there's no way this would ever work when it comes to American justice because American justice doesn't concern itself with  ridiculous notions of fairness and equity..hell punishment for wrongdoing isn't even the primary motivator, punishment for being poor is-- and your idea feels like an attack on our values. As an American, I must ask, if we don't make fines unpayable by poor people, how will we eventually get them in jail  which is the ultimate goal---since inmates make us more money than fines anyway.",
            "title_similarity": "0.8195715",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h5pr9pl",
            "score": 1,
            "text": "Implementing a system you describe would create a perverse incentive for those with no/little income. \n\nTaking your speeding ticket example - if the fine for a minimum wage worker speeding is $20, but for a millionaire is $20,000, then sure you’d likely see no more speeding by millionaires. However, I think you’d be likely to see a massive increase in minimum wage workers speeding, due to the newly lowered fines. \n\nEven more extreme, those who make no income or rely on government income, may be even further emboldened than the min wage workers. If their fines are even less, or possibly $0, they have no reason to follow a law that has virtually no consequence at all.",
            "title_similarity": "0.7593547",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h5progq",
            "score": 1,
            "text": "\"If a punishment for a crime is a fine, then that punishment only exists for the lower class\"",
            "title_similarity": "0.684838",
            "sentiment_compound": -0.8834
        },
        {
            "id": "h5pshq4",
            "score": 1,
            "text": "Yeah, no. After all the shens I’ve seen police departments pull with traffic cams and civil asset forfeiture, I would not trust them with an easy fundraising method like this. \n\nYou are operating under the assumption that the people assessing these fines would be paragons of justice, utterly incorruptible, and no beholden to politics of some nature. \n\nIt’d be like trying to instill a Marxist government in Russia, and scratching your head in confusion when it collapses into a Stalinist regime.",
            "title_similarity": "0.7785325",
            "sentiment_compound": 0.7532
        },
        {
            "id": "h5psl7m",
            "score": 1,
            "text": "I'd go one further. All taxes and fines should be wealth based, and there should be zero tax breaks.",
            "title_similarity": "0.7280896",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h5psql8",
            "score": 1,
            "text": "Someone literally made this same exact post like two weeks ago here.",
            "title_similarity": "0.2799406",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5psxqg",
            "score": 1,
            "text": "I don’t think this is a terrible idea, but there are some kinks. What about someone who is unemployed? Do they just get off scott-free?",
            "title_similarity": "0.5560272",
            "sentiment_compound": -0.3421
        },
        {
            "id": "h5ptd9f",
            "score": 1,
            "text": "Justice should be blind. Just like we should try and create a world without knowing who you’d be in it, we should have laws and punishments based on the action and not one’s status, wealth, religion, gender or race. \n\nIn addition I would argue your method would have the opposite effect. If I get a $100 speeding ticket, sucks but I’ll just pay the ticket. If it’s $1000, I have a pretty good traffic lawyer. $100 bucks and I can get out of just about anything under a misdemeanor no question. \n\nIn addition does this mean young kids with $100 to their name can drive recklessly, speed to their hearts content without fear of punishment?",
            "title_similarity": "0.8309641",
            "sentiment_compound": 0.9522
        },
        {
            "id": "h5ptqu0",
            "score": 1,
            "text": "In China they have a system called the social credit system where you start with a certain number of points (I think it’s 1,000) regardless of who you are and you lose certain numbers for certain crimes, but you can also gain them back with things like community service.  Too low of a social credit score can make it harder to get into certain schools and jobs and if it really gets low enough you’re essentially on probation with a PO checking in on you.  Would you consider a system like this that offers an alternative to monetary fines that emulates their effects, but affects rich and poor equally?",
            "title_similarity": "0.7464779",
            "sentiment_compound": 0.8374
        },
        {
            "id": "h5ptvuq",
            "score": 1,
            "text": "First things first, paid representation is a hell of a lot better than public provided counsel. That’s where the judicial punishment levying problems start. Wealth won’t erase a crime but it will give it a good shave. This isn’t hypothetical, I’m the psychopath that chose this field as a profession. \n\nA proportional fine system would balance the deterrent effect of monetary fines, assuming such a deterrent exists. Reminds me of a guy in the UK that parked his vehicle in the no parking zone in front of his office for an entire year. They city had a policy of not booting one’s vehicle, they just racked up the tickets. The guy paid 40k over the course of a year to not walk a block. \n\nIt’s only people that start to accumulate money, but not “F*** You” money that view this as a problem. $25 means a world difference depending on who you ask. \n\nWhat’s this linking crime to money is nonsensical. American society runs on money. I wish it were nonsensical to punish someone’s wallet because they lack the care to follow the simplest of traffic signs. But that’s not this America. Hypothetically, it’s fun to debate the reasons we punish and the most effective way to do it, but the system is in place. Petty crimes are easier to catch and easier to prove to a jury. If there are drug and violence charges, you should seriously consider a plea deal. If you can post bail, pay for appeals and get time served for embezzling 10 mil, then you embezzle the ten and still keep a chunk, pay restitution and be on your merry way.\n\nHere’s some food for thought, the death penalty should only be available as a punishment for white collar crime. See how many venture capitalists stick their neck out. But it ain’t deterring jack from S** as is.",
            "title_similarity": "0.8353853",
            "sentiment_compound": -0.9685
        },
        {
            "id": "h5ptxv1",
            "score": 1,
            "text": "Even more reasons for tax evasion and offshore bank accounts.\n\nGuarantee this would hit upper middle class professionals harder than any multi-millionaires and billionaires.",
            "title_similarity": "0.6873635",
            "sentiment_compound": 0.25
        },
        {
            "id": "h5pu68j",
            "score": 1,
            "text": "There are good and bad points to this. I kind of agree to it though. People who say about stocks/shares are rich people income, do it by taxes. You get the fine at tax time. Yes, you could not sell shares etc etc, but that'll still be inconvenient and you'd pay the fine on dividends.\n\nIt would depend on th crime though I guess, and what %s would go with it. If a speeding fine is €50, then would you make minimum wage people would pay 6 hours work or something, 160 hours per month is about full time. That's 0.0375 or 3.75%.... obviously just stats for my country, yours may differ.\n\nSo, minimum wage paying 50, and someone on 100k paying 312 ish. Nothing to \"scheme\" about if you are rich. It would have no real impact on that person either. The money could be used for good though.",
            "title_similarity": "0.8186761",
            "sentiment_compound": 0.5732
        },
        {
            "id": "h5pvdl2",
            "score": 1,
            "text": "In order for this to work, you'd have to give police departments an absurd amount of access to your private information.  Police officers have the ability to determine (within a range) the value of certain fines, and if your system were to be implemented, police would need to have access to your tax profile from the IRS.  They'd also need to have access to your bank accounts, all of them, to determine your current liquid asset value.  If you have a stock portfolio, they'd need access to that as well, to see what sort of non-liquid assets you have, as well as all your real estate records to see the value of properties you own.\n\nWealth encompasses a LARGE amount of different areas, and giving police, or even the courts for that matter, full, unimpeded access to all your personal financial data like that is an incredibly bad idea.\n\nAlso, if you say just base it off I come then, keep in mind (as others have said) that there are plenty of very rich people that don't make a significant traditional income.",
            "title_similarity": "0.7554278",
            "sentiment_compound": 0.9699
        },
        {
            "id": "h5pvq1e",
            "score": 1,
            "text": "I would like to look at this concept from the other end. Yes, with the current forms of fines, the rich sometimes disregard the possibility of a fine due to it being such a small amount. Now that same argument comes into play when the fine is income based. An individual who lives on the street and has nothing would end up paying nothing for their infraction. If you have no income, you pay no fine. As much as you would want them to, society in an income based fine setup would for the votes majority argue and the lawyer would go to court to argue that very point! Why should my client pay, he makes nothing!!! As a result, you have only traded which person does and doesn’t pay or care for what laws they bend or break.",
            "title_similarity": "0.8428804",
            "sentiment_compound": 0.783
        },
        {
            "id": "h5px77k",
            "score": 1,
            "text": "Yup being wealthy has some power to it. A 500 dollar fine to a millionaire isn’t a big deal. If they have to eat it for convenience or whatever, then they may. A poor person won’t have that luxury. \n\nIt’s still a 500 dollar fine, because the crime was 500 dollars. Yes, the more money you have the easiest it is, and the less impactful the punishment is. \n\nThat doesn’t matter though. A crime is a crime. It shouldn’t be greater based on someone income.\n\nShould bezo pay 500 million for jay walking?",
            "title_similarity": "0.7701771",
            "sentiment_compound": -0.6943
        },
        {
            "id": "h5px7gt",
            "score": 1,
            "text": "The reality is that even a percentage isn't fair.  If you have millions stored away.  Losing hundreds of thousands doesn't really matter.  We should replace all fines with mandatory community service.  Billionaires still only have one life.",
            "title_similarity": "0.78820145",
            "sentiment_compound": -0.5503
        },
        {
            "id": "h5px9wb",
            "score": 1,
            "text": "I agree with this and wanted to share a real life story to maybe sway some people. My partner and I were basically homeless (I'm talking like $120 paychecks and a bitchy family member who threatened to throw us out every ten minutes because she didn't like us. Go figure why she took us in) and my partner got a speeding ticket and it was like $500. That's not a lot if you're making good money but that was legit five of our paychecks and the bitch we lived with already wouldn't buy us food or give us a ride anywhere. So we had to pick between food and paying it off and my partner almost got arrested because we would rather have been alive that debt free. They also raised the price of the ticket which we were saving up for as best we could. The whole system is BS. Yes the ticket was deserved but I was already almost 85 lbs and I'm 5'4\" which is NOT good. As far as I can tell the system is designed to fuck over the poor",
            "title_similarity": "0.70922744",
            "sentiment_compound": -0.7092
        },
        {
            "id": "h5py0uq",
            "score": 1,
            "text": "If the punishment for a crime is a fine, then it is only illegal for the working class.",
            "title_similarity": "0.777737",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h5py5cv",
            "score": 1,
            "text": "So you think it would be a BETTER system to tie up government employees for weeks trying to sort out the net and gross worth and fair market value of the assets available to every individual every time someone is accused of any crime at any level? Many people and their businesses have assets across different areas, take minimum payments now resulting in lower personal wealth/income, (llc's and s-corps etc. are different entities and aren't legally the person accused), they own valuable items that can't easily be valuated, many run cash-based businesses (already hiding tons of assets) and won't know their annual income for 18+ months (accountants are applying for  extensions to put off valuations annually already), and many have everything tied up in markets that change minute to minute while taking a low or no salary at all or own properties that may or may not have depreciating assets based on deferred maintenance or changing market conditions, etc. \n\nYou're basically making everything less fair, easier to manipulate and extremely more complicated which will almost certainly result  the opposite of your intended effect. There's no way in Hell it would be workable, and people with those kinds of resources would EASILY be able to manipulate it based on whatever new definitions you try to come up with. Frankly it seems like you're trying to take something that's already as fair as it can be and pretty straightforward and turn it into a sisyphean task that will only make everything worse across the board, push penalties further down the road (for years), tie up courts with additional problems to consider for each individual case, and create new ways for people to game the system and encourage breaking of laws and loopholes for getting out of things much easier.",
            "title_similarity": "0.7920491",
            "sentiment_compound": 0.7393
        },
        {
            "id": "h5pyjxk",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5pym2j",
            "score": 1,
            "text": "How would you scale the fines? Linear? Progressive? Would minimum wage get taxed (I'm assuming minimally)?\n\nGiven that, what you end up doing is screwing the middle class. The lower class would have small fines and the upper class would use all kinds of legal tricks to hide their wealth: cut their wage down and funnel funds through offshore accounts / other companies , put their posessions in peoples' names that live in another country etc.\n\nI assume this is indended for the top 1%. But it won't affect them in the way you assume.",
            "title_similarity": "0.84142184",
            "sentiment_compound": -0.3313
        },
        {
            "id": "h5pz9qf",
            "score": 1,
            "text": "The problem is that income is just a small portion of a rich person's wealth. In fact, most wealthy individuals have no income. They increase their wealth through ownership of assets, which is not considered income.\n\nThis idea you present also assumes that we know for certain how much money all people make. The IRS already struggles with that. It's relatively easy to cheat if one knows his ways.\n\nFinally, take a look at it from a \"psychological incentives\" point of view. If you fine less money for having less wealth, you would be helping hardcore criminals, since probably all they do is crime and have no legal money, no income, no nothing, so they would get the smallest of all fines/sentences and be incentivized to keep violating the law.",
            "title_similarity": "0.8056874",
            "sentiment_compound": 0.7366
        },
        {
            "id": "h5pzjeo",
            "score": 1,
            "text": "Let's learn about income!\n\n- Wealthy Guy™ owns a company worth $2 billion.\n- The company earns 500 million, so the company is now worth $2.5bn\n- Wealthy Guy™ needs to pay bills, so he gives himself a salary from the company of $400k.\n- Wealthy Guy™ buys a plane for $100m. This is a business expense, and counts as negative income.\n- Wealthy Guy™ ends the year with a new plane, $500m in asset appreciation, and -99.6m income. He pays no income tax, and can now drive at any speed without a fine...",
            "title_similarity": "0.5861472",
            "sentiment_compound": 0.875
        },
        {
            "id": "h5pzxo9",
            "score": 1,
            "text": "Super large problem there is that wealthy people don’t have large incomes. They have wealth, which generates more wealth. In 2008 I was in high school working part-time and looked up how much Mitt Romney paid in income taxes. It was less than I did. Yet Mitt Romney’s a millionaire. If we both had committed a traffic violation would it make sense for me, a poor high school student, to pay more than him, a millionaire politician-businessman? Fines should be based on wealth, not income. But then you have the very difficult problem of how to measure wealth. It’s in everyone’s personal financial interest to hide their on-paper assets because no one likes paying taxes. I’ll concede though that tying fines to incomes would at least punish the upper middle class. It’s just annoying that the wealthy would escape same as they always do.",
            "title_similarity": "0.7408546",
            "sentiment_compound": -0.6135
        },
        {
            "id": "h5q01e2",
            "score": 1,
            "text": "Crime meta: Stay poor on paper.",
            "title_similarity": "0.35930938",
            "sentiment_compound": -0.765
        },
        {
            "id": "h5q04zz",
            "score": 1,
            "text": "As an unemployed person with $3 in my bank account: “It’s crime time baby!”",
            "title_similarity": "0.48680216",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h5q05ys",
            "score": 1,
            "text": "does that mean its the poors time to get away with anythhung wooohooo ny time to shine",
            "title_similarity": "0.4808585",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5q10nu",
            "score": 1,
            "text": "\"but my wealth is tied up in the company I own and I only pay myself 25,000 a year...\". Net worth is over 4 billion.",
            "title_similarity": "0.4361771",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h5q118s",
            "score": 1,
            "text": "There is an exception. Most of the super rich hide the majority their income to avoid paying tax. So you need to make it leveveraged against total wealth as well.",
            "title_similarity": "0.7151083",
            "sentiment_compound": 0.8938
        },
        {
            "id": "h5q12gq",
            "score": 1,
            "text": "have no income and do what you want HELL YEAH",
            "title_similarity": "0.34537598",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h5q1krb",
            "score": 1,
            "text": "Often, rich people make $1/year.",
            "title_similarity": "0.41383028",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5q246g",
            "score": 1,
            "text": "100% agree with the sentiment, the rich and powerful should always face harsher consequences for their actions since their position enables them. But proportional punishments are still ineffective, at least financially. Imagine someone has to pay a 10% income fine. If they're making $30,000, thats pretty heavy, maybe even crippling. If someone is making $1,000,000, losing $100,000 is still a lot but they still have $900,000 so its still not an even punishment. Better to even the playing field  entirely than to try to make a broken system fair, unfortunate as it is.",
            "title_similarity": "0.82759285",
            "sentiment_compound": 0.2244
        },
        {
            "id": "h5q2hd6",
            "score": 1,
            "text": "Is the justice system designed to keep everyone “equal” or to keep the rich feeling safe? I’d argue it’s the latter, as they appear to me more equal than others under the law. The penalty for someone rich, if the crime is egregious enough, is that a chunk of their wealth is syphoned off to their lawyer(s), and it seems that if the lawyer is good enough at twisting circumstances, that’s the only effect. \n\nEveryone keeps treating the justice system like a vending machine. Put defendants in and “justice” pops out. For the rich, especially the super-wealthy, they have to have a lawyer on retainer anyhow to deal with nuisance lawsuits, tax law, estate law, etc. so why should something as inconsequential as a speeding ticket matter? So the original proposition, that fines be issued, perhaps based on a percentage of annual income, and especially according to one’s means, both makes an incredible amount of sense and provides a huge hurdle to implementation. One guess who fights that percentage-penalty proposal. \n\nAs for deterrence vs punishment, we often omit rehabilitation, which is difficult to prove (as one cannot prove a negative), as well as more difficult to implement. Will those be the only options then? The easy ones? Unfortunately, odds are good.",
            "title_similarity": "0.82694274",
            "sentiment_compound": 0.9731
        },
        {
            "id": "h5q2tqh",
            "score": 1,
            "text": "so you are saying if i make no money, i pay no fines? then, a lot of people won't have to go to jail, rot in prison, pay speeding tickets. if i can do practically everything and anything i want without having to face the consequences, why would i bother getting a job to make money when i can just steal and get it for free.",
            "title_similarity": "0.79797006",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h5q2xjk",
            "score": 1,
            "text": "So a poor drunk driver should be fined 50 dollars and a rich drunk driver 5000? Wtf",
            "title_similarity": "0.5612387",
            "sentiment_compound": -0.8244
        },
        {
            "id": "h5q3c8i",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5q3j5n",
            "score": 1,
            "text": "Yet another symptom of the real problem.  Capitalism.",
            "title_similarity": "0.42213786",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5q59n0",
            "score": 1,
            "text": "Wouldn't your model mean that we are saying that when a more wealthy person commits an offence we, as a society, consider it more serious than if a less wealthy person committed the same offence.  That would then operate to  maintain the same type of unfairness you are trying to avoid.  And many wealthy people arrange their tax affairs so they have limited income, so it's impossible to really use percentage of salary any any fair way also.",
            "title_similarity": "0.7750894",
            "sentiment_compound": 0.3906
        },
        {
            "id": "h5q5gjw",
            "score": 1,
            "text": "Maybe, but there should definitelyly be a cap. Imagine a 1M dollar fine for speeding lol.",
            "title_similarity": "0.6294304",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5q6ljq",
            "score": 1,
            "text": "Fines based on salary may not be the way to go - the ultra rich have a lot of their wealth in stocks, which they don't pay income tax on since it not classed as income. They pay a lower percentage of tax because stocks are classed as capital gains, not income. This is how to rich get away with paying less tax than someone struggling, living pay cheque to pay cheque.",
            "title_similarity": "0.73658025",
            "sentiment_compound": 0.7843
        },
        {
            "id": "h5q6td5",
            "score": 1,
            "text": "The uber rich actually have little to no income. It's almost exclusively in loans and stock options. This is how many avoid taxes.\n\nI agree with the idea btw, I am just trying to change your view enough to make room for alternate solutions. If it was income based for that lot, they wouldn't pay nearly enough. Net worth I think is a much more useful replacement.",
            "title_similarity": "0.73138016",
            "sentiment_compound": 0.8541
        },
        {
            "id": "h5q6v14",
            "score": 1,
            "text": "The basis for this idea is that the fine should \"hurt\" every individual equally. Not sure if people truly believe that this shouldn't apply to the wealthy or are playing devils' advocate. The beauty to this idea is that you make the basis for the fine percentage on the lowest income bracket. The wealthy will want this as well. Why? Because when you base the system from the bottom up you will inadvertently make the fines less for that income bracket. And the smaller a percentage there will equivocate to a smaller percentage for the wealthy.\n\nBy merely announcing this system, you will turn the wealthy into lobbyists for the poor.",
            "title_similarity": "0.8070934",
            "sentiment_compound": 0.7742
        },
        {
            "id": "h5q6xrr",
            "score": 1,
            "text": "Not fair in several ways. \n\nPeople with officially no income but wealthy due to family or trusts will get off with minimal fines while self made hard working people will be much more harshly penalized.\n\nAdditionally, there will be loopholes in the system, where for example wealthy people will get employees or poor family /friends to admit to being responsible for the infractions, after which the wealthy will pay peanuts on their behalf.\n\nYou will also have horrible situations where income is calculated based on wrong or out of context information, and the person burdened with a heavy fine even though they are practically broke.\n\nAbove all, you will have a serious problem with \"policing for profit\" skyrocketing, as police officers will start doing everything in their power to target and entrap wealthy looking individuals, practically harassing people with luxury cars or placing road blocks at every upscale neighborhood street.",
            "title_similarity": "0.8112918",
            "sentiment_compound": -0.6347
        },
        {
            "id": "h5q72nd",
            "score": 1,
            "text": "It's nothing to do with hate. \nA fine is a monetary punishment, for not following some law, for minimum wage 200 dollar it is around 1% of monthly income . But for 100k per year it's .2% punishment. \nIt does not have the same impact. They can drive 49km over speed limit endanger everybody and for the minimum wage it means no utilities for a month. For the 100k person it's a bit less spending money for the same month.\nMake fines a percentage of income, and it will be a monetary punishment for whoever receives it.",
            "title_similarity": "0.7821147",
            "sentiment_compound": -0.9377
        },
        {
            "id": "h5q8o7p",
            "score": 1,
            "text": "I’m going to try and change your view slightly, by suggesting a different approach to this. With a flat fee, we all know it essentially hits poor people the hardest. If it’s percentage based, it still hits poor people the hardest. Now the wealthy have to pay a little bit more. They’re still going to be wealthy afterwards though. \n\nThis could potentially be solved logarithmically. If the percentage of a person’s income was increased the more wealthy they were, this potentially makes a difference.  \n\nExtremely poor people would get a fined that wouldn’t potentially cost them their house, even if it’s just $100. A wealthy person on the other hand, would face a very high penalty. This would take into account that the same small percentage of, say 10% of someone’s income just isn’t going to impact a rich person the same. But 40% might.",
            "title_similarity": "0.76119876",
            "sentiment_compound": 0.4608
        },
        {
            "id": "h5q8qg4",
            "score": 1,
            "text": "Rich people don't even have to have jobs.",
            "title_similarity": "0.4043541",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5q8xz1",
            "score": 1,
            "text": "A lot of rich people are rich in assets and report poverty level actual income. Too much room for loopholes.",
            "title_similarity": "0.54587424",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h5q92fk",
            "score": 1,
            "text": "not saying you’re wrong, but how would this work for people with seasonal incomes? if someone gets a significant fine during their “off season”, but the fine is based on their annual income, that could really screw them over.",
            "title_similarity": "0.71157813",
            "sentiment_compound": 0.6528
        },
        {
            "id": "h5qaijs",
            "score": 1,
            "text": "not all percents are equal 10% of 100 is much more significant than 10% of 10,000 although equal if all you have is 100 that's most of your money where if your raking in 100,000 lol 10%? so what I've got 90,000 left",
            "title_similarity": "0.5102231",
            "sentiment_compound": 0.5984
        },
        {
            "id": "h5qbar2",
            "score": 1,
            "text": "Are you talking about the more simple speeding tickets here, or fines/economic sanctions that are imposed on you by a court? Because these are two way different things. \n\nA speeding ticket is a quick and easy economic sanction that is settled at the road side.  If you want this to be a certain % of your income, then you need to find a rather complex system that runs smoothly without creating a massive beurocracy. What is the income you base it on? Last year's total income? Then you may be extremely lucky if you were unemployed most of last year and had almost no income but now you have a good job. Or if you had a good job last yera, but you got sick and lost the job and now upon all those trouble you got a hugely unfair high ticket to pay which you have no hope to pay. So eventually you create a system that punishes those that don't have stability and rich people still won't suffer as much as we want them to, because as stated 10% of your income is a whole lot more for a poor person than for a rich person. \n\nUnless you want that automatic and unfair system, you need to have a massive beurocracy and maybe even court hearings for settling a fine for someone that was speeding. So instead of the cop looking at the table and deciding the fine based on the law, you need to have a heavy system that will also make fairly unjust decisions in the end. And it gets even worse if you have to show up to the court date. Half a day or a day away from work is much worse for a poor person than a rich person. \n\nOutside of a larger crime where you already have a court session in place due to the severity of the matter, like drunk driving or whatever, you can't make a \"fair\" system because rich people will always come up on top. \n\nWhat could help against speeding at least would be to implement a point based system. Speeding X-amount over Y limit gives you 2 points on your licence + fine. Driving Z amount over Y limit gives you 3 points + fine etc. After a set number of points you lose your licence regardless of income. Again it will be more hard on a poor person losing their licence than a rich, but at least you make it so the rich guy can't continue to break the law and having no consequence.",
            "title_similarity": "0.7955202",
            "sentiment_compound": -0.9017
        },
        {
            "id": "h5qbkjg",
            "score": 1,
            "text": "“Why rich people should be above the law buggles my mind”.\n\nIn what sense? They’re getting the same fine any other person would get for a similar offense. Offering different fines for people with different backgrounds goes entirely against the principle of giving the same punishment for the same crime. In that sense you would actually be putting poorer people above richer people.",
            "title_similarity": "0.8427681",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5qbvvw",
            "score": 1,
            "text": "\nHere in Australia at least, we have a demerit system in which you might get fined, but you also have a certain amount of merits which you could lose. If you loose them all I’m pretty sure you lose your license.",
            "title_similarity": "0.5896256",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5qc2r9",
            "score": 1,
            "text": "Yeah but didn't you hear? The rich do not have \"incomes\".",
            "title_similarity": "0.44194412",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h5qc3kq",
            "score": 1,
            "text": "In Sweden we have something called dagsböter which means day-fine. If you get 20 dagsböter, you have to pay a fine which is as much as you earn for 20 days. That way, millionares can't do whatever becuase the fines are nothing to them.",
            "title_similarity": "0.7263447",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h5qce7e",
            "score": 1,
            "text": "Why income and not net worth? If someone has inherited millions and doesn't work a day in their life, by your logic shouldn't be fined anything at all.\n\nMe, earning a decent salary as a programmer but severely in debt due to a difficult time earlier in life, would be fined far more than I can afford.",
            "title_similarity": "0.79008466",
            "sentiment_compound": -0.8964
        },
        {
            "id": "h5qdl3l",
            "score": 1,
            "text": "Or profit based in the case of Corporations",
            "title_similarity": "0.38147163",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5qdzp2",
            "score": 1,
            "text": "No, traffic fines should be vehicle weight based. The heavier the vehicle, the more damage it does when it.\n\nIf someone can just 'throw money' at it, that is a problem with the rest of the legal system. Does a rich person not care about the money the fine costs.... what about loss of licence or having their car impounded for repeated offences. In fact, in most countries, this already happens.",
            "title_similarity": "0.751246",
            "sentiment_compound": -0.7664
        },
        {
            "id": "h5qfp11",
            "score": 1,
            "text": "I agree in principle. That being said it would be very expensive to implement. Currently writing a parking ticket can be done in an instant. Imagine the complexity involved trying to determine how much a parking ticket should have based on wealth. You would need to be able to connect the license plate to the person's identity, then the identity to their yearly income tax office, plus a range of other income sources like capital gains, checking if the person owns any business. That gets even more complex in America where you have to perform the same checks between federal taxes and state taxes. Having to connect all of this data between various levels of government between different departments, just to write fairer tickets would be pretty expensive",
            "title_similarity": "0.73227024",
            "sentiment_compound": 0.9153
        },
        {
            "id": "h5qfqq9",
            "score": 1,
            "text": "Nice. Am currently looking for a job. I can just break a bunch of rules and get off free.",
            "title_similarity": "0.55182093",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h5qg3pk",
            "score": 1,
            "text": "Is this unpopular? I know of two countries (Finland, germany) who have already implemented this type of salary based fines.",
            "title_similarity": "0.58226633",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5qh7xa",
            "score": 1,
            "text": "I agree with you but not all the way. What about people who just inherited a large sum of money ? If they only have inactive assets they would get normal fines and be ... fine with it.\n\nAs you said in another comment, cutting an arm was a fair (although hefty and barbaric) price because it would impact everyone the same... or was it ? What if the thief was a blacksmith ? A diplomat doesn't need two hands to work. There are loads of consequences to think about.\n\nI totally agree with the idea behind the concept : everyone should be punished equitably but it's not as easy as that to reach true equity.",
            "title_similarity": "0.8776436",
            "sentiment_compound": 0.3758
        },
        {
            "id": "h5qhgl4",
            "score": 1,
            "text": "In some 'socialist' countries after too many parking or traffic tickets the very rich have to pay thousands, up to hundreds of thousands in fines.",
            "title_similarity": "0.59757113",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h5qi4h1",
            "score": 1,
            "text": "My income varies a lot monthly and yearly. I am a freelance contract worker.\n\nYou could use some kind of long term average but that doesn’t mean it wont sting more or less when the payment is due.",
            "title_similarity": "0.61673725",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h5qi4x9",
            "score": 1,
            "text": "Yes, and the percentage should increase with their salary as well, like taxes. For someone making $500 a month $50 can determine their survival. For someone making $5 000, a fine of $500 is still painful, but not crippling. And someone who makes $50 000 a month will only be annoyed from paying $5 000.",
            "title_similarity": "0.7097032",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h5qiihz",
            "score": 1,
            "text": "I like this idea in theory, though it's difficult to tell how to do it fairly. A percentage of your income? 5% of your income in fines for a poor person could mean missing rent or going without food. 5% of a rich persons income probably wouldn't effect them very much, if at all. Then, if you wanted to have a similar impact from the fine, you could suggest a larger percentage from richer people, but that is then an unbalanced punishment the other way, and how can you assess the impact on two people who are not living comparable lifestyles? Fine the rich person until he's also on the cusp of losing his house?\n\nThere isn't really a scenario where poor and rich people can be equally and fairly fined, so fining everyone the same amount is the simplest way to avoid an impossible decision.",
            "title_similarity": "0.6941272",
            "sentiment_compound": -0.2359
        },
        {
            "id": "h5qijcl",
            "score": 1,
            "text": "How do you view crime and justice? Is it retributive, or restorative?\n\nA lot of folks like to say they want rehabilitative and restorative justice and then spout off something like this. This idea is pure retribution, the idea that if someone breaks the law, they should be hurt until some arbitrary point is reached. I prefer a system where its about repairing damage dealt. If I break a school window, shouldn’t I be fined the price of the window regardless of my income?",
            "title_similarity": "0.7483209",
            "sentiment_compound": 0.4479
        },
        {
            "id": "h5qjel9",
            "score": 1,
            "text": "I've already seen the arguments in the comment section and while I overall mostly disagree with the idea that fines should be income based, I just wanted to pop in and ask about the idea of choosing between taking a fine and doing community service, as from where I'm sitting that idea is very, very flawed. If everyone got to choose between a fine and community service, the only people who could really afford to do community service are people with a lot of money, as if income is already a struggle for you, you should be working instead of doing community service which will net you no pay, right?",
            "title_similarity": "0.7777779",
            "sentiment_compound": -0.8113
        },
        {
            "id": "h5qkvrs",
            "score": 1,
            "text": "You analogy with prison isn’t the same though. \n\nIf your analogy is to fit, old people should get less jail time. Because they only have less time to live. 1 year in prison of 90 years old man is more percentage of their remaining life than 1 year in prison of a young person. \n\nYour analogy aside I agree with you that rich people could afford bigger fine.",
            "title_similarity": "0.7383281",
            "sentiment_compound": -0.128
        },
        {
            "id": "h5qkwa9",
            "score": 1,
            "text": "I agree, fuck the rich",
            "title_similarity": "0.38816226",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5qlfgm",
            "score": 1,
            "text": "At least in the US, means-tested fines are unconstitutional as they impose unequal penalties for the same crime. If it was legal to punish the rich more then it would be legal to punish the poor more (it punish the rich less). I agree with the idea but, at least in the US, a lot more groundwork would be necessary.",
            "title_similarity": "0.8050819",
            "sentiment_compound": -0.6837
        },
        {
            "id": "h5qlho7",
            "score": 1,
            "text": "Aren't taxes income based? I live paycheck to paycheck but still may more in taxes than rich people because all their wealth is in stocks and God forbid.",
            "title_similarity": "0.730271",
            "sentiment_compound": 0.872
        },
        {
            "id": "h5qlox2",
            "score": 1,
            "text": "I'm surprised so many oppose this idea on all levels. If you fine a millionaire 50 bucks for littering he won't give two shits about the fine and might as well litter again 10 minutes later.",
            "title_similarity": "0.7346276",
            "sentiment_compound": 0.7994
        },
        {
            "id": "h5qnb5c",
            "score": 1,
            "text": "IMO this would work for lower or middle class but would not for people below the poverty line or the uppermiddle/ wealthy. Just using a yearly wage rather than networth. (44k is the average personal income in canada, let's say the crime was small and a 2% income hit was the penalty. The average person would see a 880 dollar fine)\n1- people below the poverty line getting a fine worth 2% of their annual income(canada) could be anywhere from 400 dollars to 0 dollars. Meaning homeless or unemployed would face no real penalties. Yes smaller sums of money is more detrimental to their household below this line someone who works part time minimum wage would see around a 100-200 dollar fine making it a slap on the wrist (the standard speeding ticket is more than that).\n2 - the wealthy, are the opposite, a ceo who makes 500k-1M a year would see fines of 10k-20k for the same infraction. It is a crazy amount of money but in the same token it isn't for the wealthy. It would barely cause issues and would be a slap on the wrist still.\n\nIn summary if you set an annual income percentage as a fine your extremes aren't seeing the same punishment as the median person (which is already the case). And to make it effect everyone equally it would have to be a sliding percentage based on wealth. And that again makes it unfair and unjust. \n\nThe only fair way to adjust the issue is to make larger ranges a person could get fined for an infraction. But this also is a double edge sword as the higher end of the bracket, which was set to affect the wealthy, could and would be used against people of lesser means.\n\nThe justice system is hard to set up and modify as it is supposed to be a system that brings everyone on equal footing. But how the world is set up there is now just way to bring everyone on equal footing.",
            "title_similarity": "0.75381404",
            "sentiment_compound": -0.7364
        },
        {
            "id": "h5qnf4j",
            "score": 1,
            "text": "Regarding your EDIT about community service. For poor people it’s no different than fine, and may be even worse. \n\nPoor people who  works fixed shift and get paid per day can’t effort to have personal leave to do community service. They might even get fired for it. \n\nOnly rich people can effort to have a day off to perform community service.",
            "title_similarity": "0.7706424",
            "sentiment_compound": -0.872
        },
        {
            "id": "h5qorck",
            "score": 1,
            "text": "It shouldn't be salary based, but based on their (or their immediate family's) net worth. Billionaires will just give themselves a tiny salary for the CEO position while their real income comes from investments, flipping properties, etc. Not too different than Trump accepting something like $1/year salary. If their net worth conveniently goes down (significantly) the year they commit a crime, then make them prove that it did. If an audit is required, have it come out of their fine.",
            "title_similarity": "0.80680215",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h5qou2w",
            "score": 1,
            "text": "Especially large corporations",
            "title_similarity": "0.20261073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5qoz6d",
            "score": 1,
            "text": "i feel  like fines should be flat ammounts, and also taxes",
            "title_similarity": "0.5850661",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5qpd9x",
            "score": 1,
            "text": "Ok. How does this work when people or co claim no income or revenue using financial strategies? You'd go back to the lower brackets paying the bulk of the fines.",
            "title_similarity": "0.7275198",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5qpdxe",
            "score": 1,
            "text": "They should be based on wealth not income. Two very different things.",
            "title_similarity": "0.3686282",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h5qphwb",
            "score": 1,
            "text": "police don't even follow the rules, they're just going to focus on fining the rich guys so they get more money.",
            "title_similarity": "0.73111933",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5qpky5",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5qq2m5",
            "score": 1,
            "text": "Apart from what others are saying, this would be quite confusing to put on road signs and such.",
            "title_similarity": "0.29289925",
            "sentiment_compound": -0.2944
        },
        {
            "id": "h5qqlbk",
            "score": 1,
            "text": "All this would really do is hurt the middle/lower class more.\n\nPaying, for example a 1,000,000 fine over an annual income of  10,000,000 would still leave you with 9,000,000. It's a lot different if you only have an annual income of 10,000 and you have to pay 10% of *that*.\n\nSecondly basing your fines on your income is *incredibly* easy to manipulate, most of the actual wealth of rich people is in stocks, so they'll just take a salary of 1$ and just take a massive loan with stocks as collateral.\n\nThirdly this would fail to punish people who are likely to commit crimes, drug dealers for example, on paper make no or very  little legal income, but are way more likely to commit crimes than the average person, should they be fined less than for example Elon Musk?\n\ntl;dr:\n\nthe ultra rich have  very little monthly salary, their wealth is mostly in stocks, i.e. they'd be effected very little, this absolutely benefits the people most likely to commit crimes, namely poor people, this outright harms the middle class, since their wealth absolutely is in monthly salary.",
            "title_similarity": "0.7719394",
            "sentiment_compound": 0.9427
        },
        {
            "id": "h5qqnhc",
            "score": 1,
            "text": "\"Rich people\" are above the law, they can afford better lawyers and those lawyers can afford to buy lunch, drinks, golfing fees, etc. for the judges and the district attorney office personnel. Thereby making them \"friends\" that discuss things..",
            "title_similarity": "0.6307819",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h5qqtuk",
            "score": 1,
            "text": "Some rich people have technically zero income.",
            "title_similarity": "0.41751677",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5qqvis",
            "score": 1,
            "text": "Because it ain't a fix. People are already 'blind' their taxes to make themselves seem poorer. This would only make it worse",
            "title_similarity": "0.63629323",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h5qrwtg",
            "score": 1,
            "text": "Cue poor people driving like crazy because the fine is miniscule",
            "title_similarity": "0.55120385",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5qs6nm",
            "score": 1,
            "text": "A point I haven’t seen yet, is does that mean someone with no income should not be fined for anything that they do?",
            "title_similarity": "0.53266734",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5qs8uz",
            "score": 1,
            "text": "A crime that is only punished by a fine is only a crime for the poor.",
            "title_similarity": "0.7066822",
            "sentiment_compound": -0.9062
        },
        {
            "id": "h5qshp4",
            "score": 1,
            "text": "That would just incentivize the police to fine rich people disproportionately and to pull over nicer cars more often.",
            "title_similarity": "0.7060577",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h5qsmy2",
            "score": 1,
            "text": "When considering the creation of laws, one must take a look at the pillars of justice: rehabilitation, isolation, retribution and deterrence. \n\nTherefore, judges have discretion to mete out the severity of punishments dependent on the context of the defendant. In your case, you’re setting a dangerous precedent of making a blanket canvas of reducing fines into simply %. \n\nFor example, what if the rich is able to absorb the punishment but the poor isn’t? A man losing 10% of his salary while living paycheck to paycheck will instantly put him on the streets. \n\nYou can argue don’t do crimes then, but it goes back to rehabilitation and how can we better reform these criminals. \n\nIt is also important to consider two parts: the ethicality and pragmatism of a policy. \n\nEthically speaking, it sounds fine. You’re punishing people fairly. But not really true. As your comment pointed out, 20 years to someone is 20 years to everyone. $1000 to someone is $1000 to everyone. By using relativity, you punish people more than expected. If I inherit wealth passed down to me, I am being punished more so than someone else who commits the same crime. The same principle MUST be established equally across multiple scenarios in order for it to be a fair principle. If it is not applicable to say, prison sentence based on youth, then it is essentially a flawed principle. That’s on the ethics of it. \n\nPragmatically speaking, the policy is also extremely dangerous. Assuming you genuinely take 1% of Bezos wealth, there will be massive fluctuations of the economy. I don’t think you seem to understand that billionaires are basically the cornerstone of the economy. There’s a reason why countries bail out banks despite their fuck ups. We look at the pragmatic approach rather than sticking to what is fair and right, but what is better. If you look at bank earnings, majority of their earnings come from the richest clients. 20/80 rule right? By going up the ladder, the instability caused towards the economy starts to show itself. Again, countries bail out banks because we CANT afford for a shift of billions of dollars from Mr Bezos to the United States. \n\nLastly, this policy also opens up to plenty of abuse. Because of the 20/80 rule, it is more beneficial to focus efforts on maximising gains rather than rehabilitation. Chances are, that’s the case. There’s so far no check and balances to that either. \n\nI’ll provide you a counter policy instead. How about abolishing the idea of fines and replacing it with purely prison sentence or community services? Status quo fines are absorbed easily by wealth individuals while overwhelmingly punishing for poorer individuals. Fines itself is the problem. Cracking down on tax loopholes is a much better and pragmatic approach to bridging wealth gap, and thus overall reduce crime rates and improve quality of life.",
            "title_similarity": "0.839597",
            "sentiment_compound": -0.9688
        },
        {
            "id": "h5qssyy",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5qszl7",
            "score": 1,
            "text": "Income =/= wealth or assets. There are plenty of rich people with no income. Likewise there are plenty of poor people with a super high income. It comes down to a lot of things like where they live, the means which they live with, debt, etc. There are plenty of people who make lots of money but put a majority towards student loans. On paper they look like they have money and could support this fine but in reality, they are eating ramen for dinner.",
            "title_similarity": "0.5941131",
            "sentiment_compound": 0.9161
        },
        {
            "id": "h5qt20h",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.005854748"
        },
        {
            "id": "h5qt7dc",
            "score": 1,
            "text": "Have you seen their tax returns though? Most of the super rich don’t have much “personal income”.  \n  \nWhilst a “nice idea”, implementing it would push the most banal and basic offences into arbitration to determine what the offender’s “personal income” actually is. It defeats the primary purpose of fines, which is to have a simplistic method for dealing with minor offences.  \n  \nAs with any change to the law, you’ve got to look at the behaviours that it would create/encourage. Most rich people are stingy AF and will fight to the death to keep *their* money in *their* pockets. You’ve only got to take a look at what they do to avoid tax, to know this is true.",
            "title_similarity": "0.8271907",
            "sentiment_compound": -0.2366
        },
        {
            "id": "h5qt9so",
            "score": 1,
            "text": "Fines shouldn't exist. They're the most bizarre and pathetic form of punishment. Which group of people has the legal right to tell me I'm working a day or two completely without pay? \n\nWhy is this even a thing? How did this start? 🤔",
            "title_similarity": "0.70360947",
            "sentiment_compound": -0.849
        },
        {
            "id": "h5qtlfp",
            "score": 1,
            "text": "This is why demerit points are used in Australia as well.\n\nA fine can cause varying levels of financial distress, however demerit points accrue and once you hit a certain level (usually 12) your licence is suspended.\n\nThere are still some drawbacks. Of course a rich jackass can hire a lawyer to get them off an offence on a technicality where an i has not been dotted where as someone of limited means might not be able to.\n\nIn many facets of law in Australia hardship can play a significant part of sentencing. You’re more likely to get a reduced fine at court or easier access to a payment plan if you are under financial hardship.\n\nI have seen many matters go to court where the offence is proven and dismissed with no fine but you still cop the demerits. And trust me most police here would rather impound some rich idiots Ferrari and take his licence for high speed than knock Grandma off for three over.",
            "title_similarity": "0.71920156",
            "sentiment_compound": 0.8361
        },
        {
            "id": "h5qtnfv",
            "score": 1,
            "text": "Too poor to pay a fine? Welcome to forced labor!",
            "title_similarity": "0.6182351",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h5qu47y",
            "score": 1,
            "text": "What happens when someone is in bankruptcy. All findable offenses pay them back?",
            "title_similarity": "0.6137263",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5quc7o",
            "score": 1,
            "text": "This is an example of a good idea that will never happen.",
            "title_similarity": "0.29705337",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5qun5q",
            "score": 1,
            "text": "Scenario: A 20 year old wins several hundreds of millions in a lottery, taxes are paid and the money is his. He never works a day for the rest of his life and therefore has no income. Every fine he would pay would he $0. \n\nAnd if you want to try to consider interest or capital gain income then he doesn't keep the money in a bank or invest it so he makes no money off the money he already has.",
            "title_similarity": "0.6586461",
            "sentiment_compound": 0.7984
        },
        {
            "id": "h5quq8h",
            "score": 1,
            "text": "Someone who floats by paycheck to paycheck is going to suffer more from losing a % of pay than someone who is amassing billions a day.  And as we've seen with the IRS, the super rich act like they make $0 anyway.",
            "title_similarity": "0.67598945",
            "sentiment_compound": 0.4976
        },
        {
            "id": "h5qv2xk",
            "score": 1,
            "text": "I didn't read the other commenters before commenting so my apologies if it's already been said, but income can be really hard to determine in some cases. Like the richest 1% have most of their money in stocks which, outside of being variable, couldn't be outright sold for their current value. If Jeff Bezos decided to sell his 55 million shares (worth 3300 or so a piece) he wouldn't get the full value of every share because if he sold that many shares the value would likely decrease since people would assume something was happening to Amazon so determining the wealth he has would be difficult, just as an example. People also don't report everything anyways or have cash-only setups where taxing them proportionally wouldn't make much sense because they make \"0 dollars\" on paper.",
            "title_similarity": "0.67305815",
            "sentiment_compound": 0.9824
        },
        {
            "id": "h5qvb4s",
            "score": 1,
            "text": "I agree with the sentiment. However, imagine you are a police department and this is the policy and you are setting up where you are going to patrol for the day. Do you think the fact that tickets you write in rich communities give you 10-20x the return as the ones you write in poor communities will contribute to how the police do thier job? My bet would be that police would just stay out of poor communities because there is no money in those places.  \n\nSetting up the system this way would just make it so the police give even less of a fuck about the poor.",
            "title_similarity": "0.82066584",
            "sentiment_compound": -0.8242
        },
        {
            "id": "h5qvn7n",
            "score": 1,
            "text": "Homeless people be getting away scot free",
            "title_similarity": "0.50097084",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5qvnzb",
            "score": 1,
            "text": "How would you deal with couples where one partner says home and has no income? Would the fine be based on the joint income? That seems unfair to the partner who works, who didn’t do anything wrong, but if we based on the non-working partner then there is no fine?",
            "title_similarity": "0.6802892",
            "sentiment_compound": -0.6935
        },
        {
            "id": "h5qwnnp",
            "score": 1,
            "text": "This is a solution looking for a problem.",
            "title_similarity": "0.11573823",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5qx6we",
            "score": 1,
            "text": "Just make it a percent of their net worth. If you have to sell a company or stock or a home to do it I don’t care. Fuck the 1%",
            "title_similarity": "0.7047477",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h5qxjbt",
            "score": 1,
            "text": "Fines shouldnt exist period its extortion. And if fines were income based the rich would be screwed.",
            "title_similarity": "0.6753532",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h5qyx2n",
            "score": 1,
            "text": "Then the extremely poor would have the ability to do pretty much anything that wouldn’t get them thrown in jail on account of the fines being payable by finding a nickel on the ground",
            "title_similarity": "0.8168531",
            "sentiment_compound": 0.2748
        },
        {
            "id": "h5r0lat",
            "score": 1,
            "text": "There should be no fines.",
            "title_similarity": "0.31080204",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5r0lu0",
            "score": 1,
            "text": "So, what’s the point of become rich? Everybody knows rich have power, everybody want power",
            "title_similarity": "0.5496976",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h5r11wk",
            "score": 1,
            "text": "The problem is that an income can be unstable, but you're right, it's a real issue!",
            "title_similarity": "0.48763862",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h5r15ua",
            "score": 1,
            "text": "A fine for a percentage of income instead of a set amount seems logical and reasonable to me, but then they would have to punish rich people and the US is not about to do that",
            "title_similarity": "0.7746937",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5r1fi5",
            "score": 1,
            "text": "I'm with you in intention and sentiment. Rich folks sometimes can evade reporting income (akin to how Amazon exploiting tax exemptions to pay $0 in tax) so figure out how to make sure there's no loophole that comes with how wealthy people do finance and I think the idea would be effective.",
            "title_similarity": "0.7550807",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h5r1nvj",
            "score": 1,
            "text": "If someone has so much money they can just keep hurting people over and over then give them a scarlet letter punishment \n\nCut to Larry David holding a sign that says \"I STEAL FORKS\" \n\nMake guys like Bill O'Rielly stand in public and hold signs that say \"I SNIFF WOMEN IN ELEVATORS\"",
            "title_similarity": "0.6196525",
            "sentiment_compound": -0.8567
        },
        {
            "id": "h5r1qvt",
            "score": 1,
            "text": "Everyone is equal before the law. Just because I earn more than you, doesn’t mean I pay more than you",
            "title_similarity": "0.6859584",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5r1w9g",
            "score": 1,
            "text": "This is insane. That’s the sort of leftist nonsense we have to put up with",
            "title_similarity": "0.3897133",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h5r2065",
            "score": 1,
            "text": "This is really stupid - so some rich kid who has $0 income can speed all he wants… while his daddy still can buys him everything. Time to adopt more african kids to take the fall for everything. Loop holes galore",
            "title_similarity": "0.7132317",
            "sentiment_compound": 0.2228
        },
        {
            "id": "h5r2nob",
            "score": 1,
            "text": "People issuing the fines will then be incentivized to go after the wealthy. I work parking enforcement so technically I could just seek out luxury vehicles and collect way more money per vehicle. There’s just no easy answer to this problem.",
            "title_similarity": "0.754606",
            "sentiment_compound": -0.4644
        },
        {
            "id": "h5r2qdi",
            "score": 1,
            "text": "A Premier league football player had his wage slip leaked about ten years ago, and it turns out they are also fined by the football association the same I would be on a Sunday league amateur game.",
            "title_similarity": "0.6289859",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5r2tl1",
            "score": 1,
            "text": "dude, ceo's can officially pay themselves $1/year\n\nrun for fucking legislation, if you wanna change things\n\ncame to reddit to make laws. i cant stop laughing",
            "title_similarity": "0.69685036",
            "sentiment_compound": -0.2824
        },
        {
            "id": "h5r2y4u",
            "score": 1,
            "text": "Unconstitutional. The 14th amendment ensures equal protection under the law. For the same reason you can’t give someone more years in prison because they’re black, you can’t give them a larger fine because they’re rich. It’s important to have a legal system that doesn’t discriminate.",
            "title_similarity": "0.8280174",
            "sentiment_compound": 0.483
        },
        {
            "id": "h5r43lj",
            "score": 1,
            "text": "Only the Sith deal in absolutes.\n\nWhile a no-exception system is ideal for simplicity of enforcements, a no exception policy is, itself, a bad idea.\n\nNot to mention, the basic pretense of \"income based\" does not enforce _reasonableness_ of the basis.  If we do income based fines that are _inversely proportional_ to income (rich not paying taxes), or do not consider net worth (CEO's paid in stock and holdings), nothing has been solved.\n\nIt's _theoretically_ fine, but I don't think that a lack of nuance ensures \"fairness\".\n\nAlso, it leads to some strange situations of fairness:  How do you do percentage income based fine for mass pollution and damages to communities?  Is there an income equivalent that wouldn't destroy a person that would also meaningfully impact a large company?\n\n> Today I realized how little I know about the rich. It probably won't come to many in here's surprise to learn I have no friends in the upper class\n\nYou weren't aware that almost all struggles are fundamentally class struggle?  You're not going to make friends with people saying they should be treated like those they see as inferiors.",
            "title_similarity": "0.7283378",
            "sentiment_compound": 0.6009
        },
        {
            "id": "h5r43uw",
            "score": 1,
            "text": "Sounds good in theory but its still a bad system.\nLets say you get fined 10% of your monthly income if you do X bad thing. Someone who earns 1500$ would striggle with losing 150$ while someone who earns 20k still has 18k left. Still way more money anyone needs. You cant fine rich people enough to really hurt them without becoming a communist imo.",
            "title_similarity": "0.73959863",
            "sentiment_compound": -0.9743
        },
        {
            "id": "h5r4v36",
            "score": 1,
            "text": "i argue that fines as punishment are always bad. in fact all punishment is unjustified and bad. legal systems should be about protecting the people and getting recompense for losses. the legal systems should not be used for inflicting pain or getting revenge on those who misbehave.\n\nif a person breaks my toe, i deserve recompense for the opportunity loss incurred by the broken toe. that opportunity loss has no relationship to the wealth of the perpitrator. if a person is driving recklessly, they must be removed from the roads for the safety of the community regardless of the income of the perpetrator. if a person litters or abuses public resources they should be responsible for the cleanup or reparations respectively no matter how rich they are.\n\nusing the justice system to punish people for being rich is quite disgusting. allowing poor people to abuse the public because they don't have money is equally disgusting.\n\nhaving said all that, i would like to address the root of your desire for equal outcomes (a.k.a equity). there is an idea that has permeated every level of our society that is communist in origin: the idea that the rich owe society for making them rich. in a purely free-market system, the cash-rich only get rich by providing stuff and service of real value to people in exchange for i.o.u notes called money that can be used at a later date to buy things they value. the more cash-rich a person is (in a free market) the more society owes them, not the other way around.\n\nto say that a rich person should pay more for a speeding fine than a poor person is to say that people who provide more value to society should have to pay more money if they do something bad. it makes no sense, and if anything it should be the other way around.\n\ninsofar as a person can become rich via abuse of the government, fraud, or corruption, the goal should be to remove those bad practices not punish all rich people more. in the cases where people become rich by providing society with the stuff it wants/needs we should respect those rich people a great deal more than we do the poor people who do not (for whatever reason) provide society with the stuff it needs.\n\ni would suggest watching [this video concerning equality](https://www.youtube.com/watch?v=Jtxuy-GJwCo) (19 min) to dispel some of your bad ideas.",
            "title_similarity": "0.7812706",
            "sentiment_compound": -0.9285
        },
        {
            "id": "h5r578g",
            "score": 1,
            "text": "When it comes to fines and tickets I think it should be the same for everyone. Not saying people will, but there is a little more incentive for people with lower incomes to break the law knowing they have a lowered punishment waiting for them. Also there's countless rich people who claim nothing on their taxes.",
            "title_similarity": "0.8620572",
            "sentiment_compound": 0.0828
        },
        {
            "id": "h5r5c4s",
            "score": 1,
            "text": "Large amounts of wealth are tricky to measure.",
            "title_similarity": "0.2877027",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5r5s1l",
            "score": 2,
            "text": "I feel like the only arguments I'm seeing against this in the comments are how it would be hard to enforce on rich people or edge cases.\n\nNobody has really addressed the soul of the argument, which is that fines should attempt to be equally effective regardless of wealth.",
            "title_similarity": "0.7930651",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h5r5v80",
            "score": 1,
            "text": "Agree.....but I really like not having to give a shit about a speeding ticket...  I just consider it the cost of driving fast.",
            "title_similarity": "0.57411635",
            "sentiment_compound": -0.204
        },
        {
            "id": "h5r6qa0",
            "score": 1,
            "text": "I think this works to some extent, but it still depends on certain circumstances. If someone is retired and living off of state/private pension, but has no outgoings as they have no mortgage etc the fine would be fairly low yet they could feasibly afford it.\nHowever someone earning a decent living, lets say 100k, may live in a decent size house with a large mortgage. They may be supporting a family, potentially medical expenses and be the sole provider leaving very little at the end of the month. They would be fined more but it would have a larger proportional impact on them.\n\nI like the idea of community service rather than finance as no one knows how much time they get and until the mega rich figure out immortality, it should be a more fair punishment.\n\nHowever one must consider if someone is on a low wage working multiple jobs, community service would disproportionately effect someone working one job with the possibility of using up leave.\n\nI don't think these punishments can be adjusted equitably, but perhaps the mega rich are the ones who need different rule?\n\nI'm also going to suggest the reasoning of 'well don't commit the crime' being a poor one, as we are talking about low level offences that can usually be forgiven by fines. This could be someone accidentally running a red light or speeding for example. I don't think you should risk losing your house or health for such offences...",
            "title_similarity": "0.7242595",
            "sentiment_compound": -0.5002
        },
        {
            "id": "h5r6uzv",
            "score": 1,
            "text": "In many cases, it costs the governments money to fix the thing so.eone is being fined for. For example, towing an untaxed car. In this case, they've lost money from the owner not paying tax, and spent money on towing the car. Therefore, just because the owner is poor, does not mean they should be fined less, as the government as lost quite a bit of money. However, fines should be fairer. \n\nOn the other hand, I can admit that some fines exist where there is no loss for the government, in those cases your point is valid",
            "title_similarity": "0.7598769",
            "sentiment_compound": -0.1872
        },
        {
            "id": "h5r73z5",
            "score": 1,
            "text": "Hell yeah. Last year I had to move due to a trump loving Karen that moved in. She kept accusing us of breaking into her apartment and constant noise complaints. Sometimes while she was at work or somewhere else entirely. It seems all you need to do to fine someone in a noise complaint is to say they are being loud. It got to the point I received a noise complaint for yelling at the police for peeking in my windows. Part of why I was freaking out is the police don't have a good reputation, I'm not the whitest person in the world and it was pretty obvious the neighbor was making it all up. So having someone with Trump and blue lives matter signs constantly sending the cops to me scared the hell out of me. I started getting nervous and scared of every car door shutting or sounds out the window...\n\nBut yeah. Easily paid 600 in fines. Fell behind on rent, landlord started trying to evict is during the pandemic while the crazy Trump lover started sending her kids to harass us. (I finally got a decent phone that could quickly record video and caught her pounding on her floor and another time one of her adult kids screamed to move the F Out then running to his mom's place. \n\nIt was hell. I nearly forgot how scary everyday was getting. My mom who was 70 and yet to be diagnosed with lung cancer was even pulled from her bed to be questioned about running up and slamming on the neighbors door. I wasn't home but came home to it and my mom could barely walk, let alone run up a flight of stairs. The cops even told us we should move, preferably out of state. Said California sounds like a nice place to go for people like us. I'm not sure if that was a jab at us being native American? My tribe is in this state! Hell, they uncovered an Indian burial ground under the University of Wisconsin in Stevens point. Grrrr.....\n\nOnce we moved it all stopped but we're still paying for it. In fact I've got court today from an incident there. I'm looking forward to catching up and getting all this crazy in the past. Not a fan of police. They can certainly strike terror into you. And don't ask them to put on a mask when entering your home because you're trying to keep your elderly mom safe. They don't care, one said the pandemic isn't even will. And you can't call the police on the police. I wish they had cops that patrol cops.",
            "title_similarity": "0.6452303",
            "sentiment_compound": -0.9882
        },
        {
            "id": "h5r74e0",
            "score": 2,
            "text": "So a family of 4 making 110k a year should pay more than a single person making 50k? Theres so many pit falls to this logic it's crazy. Most of the people you're trying to target have low salaries that are supplemented by stocks or bonuses. Are you going to somehow fine an unrealized asset like their house/stocks? Are you going to wait for the end of year tax documents since they really only made 150k salary but bonuses 800k at the end of the year? If poor people are still getting speeding tickets and driving drunk even knowing it may destroy them financially then how will that deter rich people when they have better attorneys anyway?",
            "title_similarity": "0.7264626",
            "sentiment_compound": 0.7476
        },
        {
            "id": "h5r7gse",
            "score": 1,
            "text": "I once worked with an ER physician who said he felt like his speeding tickets were just a fee he paid to be able to go faster than everyone else...",
            "title_similarity": "0.69205916",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5r7x1x",
            "score": 1,
            "text": "It should be based on earning power, not net worth, since many people are persistently broke and rich people don’t just leave their money in directly assessable forms.",
            "title_similarity": "0.75345457",
            "sentiment_compound": -0.017
        },
        {
            "id": "h5r7ygw",
            "score": 1,
            "text": "Makes no sense. Just because you are worked hard doesnt mean you should be punished more for jaywalking.",
            "title_similarity": "0.5950804",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h5r86jh",
            "score": 1,
            "text": "That’s not really equal application of the law, it’s punishes people differently for same crime. That opens very ugly doors",
            "title_similarity": "0.58449876",
            "sentiment_compound": -0.8805
        },
        {
            "id": "h5r8b1w",
            "score": 1,
            "text": "Oh you don’t have any money? Well my fault sir go on about your day & don’t worry about what speed your going..",
            "title_similarity": "0.52861637",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5r8huv",
            "score": 1,
            "text": "Should that be total wealth or income? Bill Gates is worth 80 billion but only got paid $1(in salary) when he was CEO. Also, someone who is dirt poor can break any law that is a fineable offense because they have no money?",
            "title_similarity": "0.7232078",
            "sentiment_compound": -0.881
        },
        {
            "id": "h5r8kqx",
            "score": 1,
            "text": "So how are you going to determine income for people whose income wildly fluctuates, like a small business owner?   Do small fines for something relatively benign like a parking ticket suddenly require auditing of finances?  \n\nI agree that fines disproportionately impact the working class and I totally agree that it is unfair that some people and businesses are so wealthy that fines mean little to them but there will still be people that are harmed.  I’d rather see everyone treated the same under the law and taxing people with money to buy super yachts cash up front.",
            "title_similarity": "0.82052404",
            "sentiment_compound": 0.814
        },
        {
            "id": "h5r8se0",
            "score": 1,
            "text": ">The idea of choosing between a fine and community service has been brought up. I like that suggestion very much since it's an option for those too poor to lose even a percentage of their monthly salary.\n\n\"Community service\" isn't just great because it's an option for poorer people; community service -- and continuing education classes -- give offenders the opportunity to directly give back to their community, and/or better themselves.\n\nA few years back I got a speeding ticket, and was given the option to take a driving course. Not only do I actually feel like I learned and improved as a result, but I genuinely appreciated the opportunity to \"get better.\"\n\nI think we'd all be much better off if -- instead of nebulous (and seemingly arbitrary, especially for the wealthy) financial punishment -- people were offered opportunities for self-improvement when they make mistakes.",
            "title_similarity": "0.7397057",
            "sentiment_compound": 0.9485
        },
        {
            "id": "h5r9crq",
            "score": 1,
            "text": "Poor people commit more crime.\n\nYour idea targets rich people because you're resentful of them but they are statistically less likely to be criminals.\n\nYou're not going to be giving homeless an incentive to be criminals right?",
            "title_similarity": "0.7440648",
            "sentiment_compound": -0.8098
        },
        {
            "id": "h5rbkbr",
            "score": 1,
            "text": "Every fine? I got a $42 fine for parking on the street during street sweeping day. They had stopped sweeping for a year during pandemic and just started back up. Let’s say that $42 scales with income or net wealth and I happen to have 10x net wealth than average. Would it be ethical to fine $420 for the said infraction? \n\nBut I do get your point. So many penalties are actual convenience charges. The couple who bulldozed a dozen Joshua trees for their house who got fined 18k. That should easily be a 100k+ fine.",
            "title_similarity": "0.7010634",
            "sentiment_compound": 0.8446
        },
        {
            "id": "h5rbzs4",
            "score": 1,
            "text": "More money towards corruption doesnt sound good. Especially as this money is generally used for abusive policing.",
            "title_similarity": "0.62685144",
            "sentiment_compound": -0.7654
        },
        {
            "id": "h5rd05i",
            "score": 1,
            "text": "The goal of fines is not always to punish people. It’s also to recoup the losses you will incur fixing their mistake. In this context, fining rich people more doesn’t make sense.",
            "title_similarity": "0.674554",
            "sentiment_compound": 0.3129
        },
        {
            "id": "h5rdy06",
            "score": 1,
            "text": "So someone in debt and no income could do anything?",
            "title_similarity": "0.355891",
            "sentiment_compound": -0.6077
        },
        {
            "id": "h5rfeir",
            "score": 1,
            "text": "I completely disagree, the punishment should be related to the crime and not the background of a person or other unrelated attributes. You cannot possible talk that straight. Let’s take my country the Netherlands which has one of the best income equalities of the world. \r  \n\r  \nI am from the Netherlands and in several places, such as Amsterdam, unemployed have a higher living standard and more raw income to spend that people living on a minimal wage at 40 hours per week. (Yes this desensitizes people from going back to work, but not the topic)\r  \nHow do you measure wealth? If by income than in my country one guy would be punished harder while the other would not, while one might be more welathy. If you want to fully regulate along these lines you end up with China 2.0.  And it does not matter if you set a minimum bar for a crime. \r  \n\r  \nCriminal organizations would love this as well, as they would have plenty of thugs to commit all sorts of crime, with no or low income and as a result relative low punishments? Even the maffia bosses wouldn’t be hurt, since their wealth is mostly hidden. Again if you work with a minimum what would be a reasonable maxed ceiling?\n\n\r  \nWhat is the wealth fomr one father of faily compared to a single, who is more wealthy? It would be insanely complex to engineer this and make it fair. I would wager it is impossible to make right as the very premise was wrong (not relating the punishment to the crime). Also the premise of a flawed monetary system, makes it wrong. If monetary punishments are now unfair to the poor, it might be very well be cause of the monetary system and using that as a means of punishment!\n\n\r  \nThere is a theoretical fair playing field though and that is **time**. We all have the same amount of time. Perhaps not the same amount of time over a life-span, but we get the same time. Bill Gates cleaning a toilet for an hour would be the exact same punishment as me cleaning a toilet for an hour (one of those public toilets that servce a community). That seems fair to me? Jack Vance used this as currency in his science fiction books. The currency was represented by what 1 standard hour of work could produce. How much would a facebook platform be worth compared to a Wikipedia in such a world? How much can a CEO truly be worth more in time than his employees? It think it would shed a light on a lot of stupid things in our current economy, but probably also create its own (hey I didn't study this stuff).\r  \n\r  \nThe biggest contributors to charity are often the volunteers and not the bil/ milionaires making a donation (I say often, because some do make big donations that represent **their time**, but in a world where money creates money and is cause of growing income inequality, most of their donations are trivial. In the end lower class people are the ones really working for the time some rich spend on charity, it is not their time they are spending at all!!!) Pretty much add every singel hollywood actor to this list. \r  \n\r  \nYou want equal punishment in our current monetary system, look at community service instead of paying in $ for a speeding ticket. Make it all about time!!!\r  \n\r  \nAnother great thing about using time as currency? Jobs such as firefighters who risk time over a lifetime, would probably get a better reward than they get out of the current monetary system.",
            "title_similarity": "0.8143879",
            "sentiment_compound": 0.8603
        },
        {
            "id": "h5rfgko",
            "score": 1,
            "text": "If a crime can be paid for it’s not illegal to do.  Get rid of all fines.  One should not be able to buy their way out of trouble.",
            "title_similarity": "0.74970925",
            "sentiment_compound": -0.5067
        },
        {
            "id": "h5rfr38",
            "score": 1,
            "text": "Yes yes yes! I talk to my partner all the time about how having the same fine for everyone just doesn't make sense. $100 to one person might be a mild inconvenience or even mean absolutely nothing to them, while $100 to another might be the difference between making their rent that month, or being able to feed their kids that week.",
            "title_similarity": "0.75341004",
            "sentiment_compound": 0.7712
        },
        {
            "id": "h5rgvik",
            "score": 1,
            "text": "Someone earning hundreds of thousands per year pays for someone earning almost nothing to take the blame for their crimes. Low earner pays the low fine and gets paid more for taking the blame. Congrats, you just created a black market for taking the fall on crimes.",
            "title_similarity": "0.78663164",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5rhxu0",
            "score": 1,
            "text": "So give more worthless people the right to be more worthless ?",
            "title_similarity": "0.4812015",
            "sentiment_compound": -0.7684
        },
        {
            "id": "h5riv5w",
            "score": 1,
            "text": "Your problem is defining rich. \n\nSome people make a high income but have high outgoing.\n\nSome people make low income but have even lower outgoing.\n\nI imagine we can agree this is common. If you make more money it’s likely you have higher bills. More expensive mortgage, education costs, expensive cars, etc.\n\nA wealthier person may actually have the same or less disposable in come as a person with lower income.\n\nNot even to begin to discuss small business owners who typically pay higher insurance rates and other “necessary” things.",
            "title_similarity": "0.6323125",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h5rixl1",
            "score": 1,
            "text": "Thing is that fines aren't meant as punishment, they exist to restore justice - i.e. if you throw a chocolate wrapper on the street and it costs the city 5$ to remove it, then provided you pay those 5$ you've paid your debt to the city and and can go on your merry way. If fines were meant as punishment though, I could agree with you",
            "title_similarity": "0.72911155",
            "sentiment_compound": 0.798
        },
        {
            "id": "h5rj73l",
            "score": 1,
            "text": "Corporation can kill someone by shit equipment, they get slap on the wrist and fine of 0,001 of their profit. Kill someone and you get years in jail as private person. Same with taxes, ever heard of CEO going to jaill for tax evasion?",
            "title_similarity": "0.6949878",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h5rk8o5",
            "score": 1,
            "text": "But is there really \"an upper class\"?",
            "title_similarity": "0.20720868",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5rkw4e",
            "score": 1,
            "text": "What if someone has no income? No fine?",
            "title_similarity": "0.24295536",
            "sentiment_compound": -0.3103
        },
        {
            "id": "h5rlj2p",
            "score": 1,
            "text": "I’m surprised that nobody has mentioned that this would essentially lead to a system that bolsters autocracy. Raising fines on the rich proportionally would make it much easier for the state to extract large quantities of money from the rich. On the face of it, that doesn’t sound bad at all, but because rich people are also powerful people, the end result is going to probably be rich people jockeying for influence with the state in order to harm their rivals. Didn’t donate to the right candidate? Guess what, your competitor did, and they want you out of the picture, and now every sheriff deputy in the county knows what your vehicle looks like and will pull you over for going 2 over and fine you half a million dollars.  The only solution is to pay the politician in charge of the law enforcement something to get them off your back.  \n\nEven if there isn’t political targeting you can bet your ass the local sheriff is going to zero in on rich people and solicit some bribes to make the pain stop.",
            "title_similarity": "0.8256913",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h5ro3c6",
            "score": 1,
            "text": "One issue I see here is that provides yet more incentive for some folks to hide what they earn (tax evasion)\n\nSince determination of income will almost certainly be based on tax returns",
            "title_similarity": "0.6531",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5rqvly",
            "score": 1,
            "text": "I think day fines aren't a bad solution, but they're still not going to be equitable.  Rich people don't make all their money from their daily salary, while most poor people do.  Rich people can afford to lose a day's salary much more easily than a poor person.  \n\nFor a person making $35k a year is a day-fine is going to make an impact on their budget.  A person making $350k probably wouldn't even notice a day-fine missing from their bank account.  A person making $3.5M probably loses more than that in the stock market before lunch and then makes it all back the next day.",
            "title_similarity": "0.7348732",
            "sentiment_compound": -0.5033
        },
        {
            "id": "h5rqyhr",
            "score": 1,
            "text": "Sure. Steve Jobs salary was $1/year.",
            "title_similarity": "0.4025522",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5rr2rb",
            "score": 1,
            "text": "So, I disagree. The poor would be able to speed carelessly, litter and conduct business unfairly just because they are poor and cause damage to lives, property or generally accepted public trust. So, by that regard, speed around putting peoples lives in danger, litter up the ocean or grounds with whatever toxic crap I want and not be fined much. Your argument also loses when I can shield my income in creative corporate structures or shelters and just “call myself poor”.",
            "title_similarity": "0.7468986",
            "sentiment_compound": -0.9349
        },
        {
            "id": "h5rsrs9",
            "score": 1,
            "text": "Regardless of income, wouldn't it make sense for the fine to at least exceed the amount of profit gained in commission of the crime?",
            "title_similarity": "0.6888877",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5rx5lo",
            "score": 1,
            "text": "Some countries do use this kind of system, and mostly it probably works fine. One problem I could imagine is that in certain situations it could be unfair. Even if you have big income you can have big expenses. Now you could say that they should just lower their spending for a while, but lifes not always that simple. One could imagine a doctor making a bank, but spending huge part of her money towards her child who need  very expensive treatments for a rare disease. Why should she pay more than someone with lower income who, after expenses, has similar amount of money to spend/save? \n\nObviously she should not, at least in my moral view. Then should a person spending his big pay check on fast cars pay bigger fine? We're more likely to say yes, but now we are making moral judgements and basing the fine on our arbitary definition of what is \"good\" spending and what is \"bad\" spending. So in the end equal fine treats everyone equally. You also need to remember that high income people already pay more for our society in form of taxes than poorer ones (if you feel the need to mention how this or that billionaire paid so and so little tax you need to take a breath and remember these are single cases. If you look at the big picture the higher income quantiles pay much larger share of taxes than lower ones), and in fact benefit less since eg. healthcare is mostly demanded by sick and poor. So perhaps this makes up for the flat fines.",
            "title_similarity": "0.7137219",
            "sentiment_compound": -0.8661
        },
        {
            "id": "h5rz22o",
            "score": 1,
            "text": "I can be homeless and commit crimes!!!",
            "title_similarity": "0.46508795",
            "sentiment_compound": 0.4724
        },
        {
            "id": "h5s5p6y",
            "score": 1,
            "text": ">whether you should do that in the first place is a topic for another day.\n\nIs it though? Shouldn't that be the question? If the purpose of fines for civil infractions is not to punish you but to help pay for the societal damages and extra work to government organizations, then why should the amount of pain even factor into the equation? It's pretty fucking Central to the entire debate.\n\nThe reason we can't use Day fines in the United States is that they are unconstitutional. Yes, I am aware that they have been used before in the united states, but both times that they were used, the programs were shut down before the courts could rule on them, and the courts punted. But it is pretty obvious bite any objective standard that charging two different people two different amounts of money for the same infraction is not equal under the law.\n\n>Why rich people should be above the law buggles my mind\n\nThey're not above the law. They pay just as much fine as everyone else. What you're actually upset about is is that life is just easier for rich people in general, and no shit. Of course it is. That doesn't mean we should violate the basic principles of our constitution to make life more difficult for rich people, just because you think that's unfair. It will still be unfair, even with your program.\n\nFurthermore, I realize you didn't do this, but it's off in the case when these sorts of things come up, that everyone always pretends to be a bleeding heart and think about the poor poor people. Raising fines on rich people won't make backbreaking fines on poor people any less backbreaking. Which just goes to show that, as you admitted outright, this has nothing to do with helping poor people and everything to do with punishing Rich people. There are better ways to punish rich people that are not unconstitutional, like raising taxes.",
            "title_similarity": "0.80724853",
            "sentiment_compound": 0.9666
        },
        {
            "id": "h5s8s2p",
            "score": 1,
            "text": "It sounds like you're just suggesting they pay taxes, and we know that already isn't happening.",
            "title_similarity": "0.5873182",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5slqhc",
            "score": 1,
            "text": "So if you are committing a crime, they should accommodate you based on your wealth? \n\nThat sounds dumb as hell for many reasons just 2 are though:\n\n1.\tpeople commit crimes because they don’t have anything.\n2.\tyou’re committing an illegal activity that most likely you know is wrong, there is consequences to that and they should be harsh.\n\n\nHow about he grateful you live somewhere that doesn’t chop off your hands for steeling, if much rather be in debt or jail than loose a hand, or my life.",
            "title_similarity": "0.81548893",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h5tfyb5",
            "score": 1,
            "text": "Why don’t you just eliminate fines for crimes you don’t want rich people to finesse their way out of and either make the punishment community service (minor infractions) or face jail time (financial and environmental crimes committed by the rich).",
            "title_similarity": "0.81384516",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h5uyjmo",
            "score": 1,
            "text": "The punishment ought to be based on the crime, not on who did it or their characteristics, for that would be unequal treatment.  I don't think those day fines would satisfy the 14th amendment, for that reason, so it might require a constitutional change.  \n\nI also don't think that's a good idea, because it will enshrine a principle of unequal treatment, of justice that is no longer blind.  It will be justice that picks favorites.  Once we allow for differing punishment based on income, why not other characteristics, like IQ or race or even ancestral wealth (punish blue bloods more than others)?  If \"punching up\" is OK in one dimension, what limiting principle prevents it from being used elsewhere?  \n\nWhen we pick favorites, then we create resentment and disunity, and greater political instability.  There needs to be a sense that we're all in this together, that the same rules apply equally for everyone.\n\nIf it truly is the case that the rich are running roughshod over the law, then presumably they repeatedly violate the law.  Let's focus on the felonies like theft, rape, physical assault, and murder.  Since it's so cheap for them, then presumably they do it more per capita.  Maybe ensure that repeat offenders have stiffer sentences, that way it'll hit the rich more, if they're doing it more often?  At least that way everyone is treated the same; we just ramp up the punishment more severely with more frequent violations.\n\nOr maybe the fines for lesser violations are too great, because they often apply to the poor, and they're too little to the rich to matter anyway.\n\nFinally, I think that the reputational loss to the rich may be far more significant than the fine or even jail time.  There is very little tolerance of any criminal behavior among the rich, IMO.  Certainly the institutions that the rich tend to inhabit have essentially zero tolerance.  So the fine itself is not the disincentive, but the record.",
            "title_similarity": "0.78696",
            "sentiment_compound": 0.541
        },
        {
            "id": "h5xdhmb",
            "score": 1,
            "text": "I agree it should definitely be based on income",
            "title_similarity": "0.36793673",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h68aew6",
            "score": 1,
            "text": "The rich aren’t “above the law”.  Fines apply to everyone equally.  The difference is they can afford to lose that money.  Don’t do the crime if you can’t afford the fine.  Fines are supposed to be a deterrent.  For everyone who can just throw that kind of money there are substantially more who can’t and shouldn’t",
            "title_similarity": "0.8762443",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h6u4v66",
            "score": 1,
            "text": "I believe that all fines related to endangering humans should be income scaled because those fines are designed to deter the behaviors, and rich people breaking the rules and paying the fines will cause real damage. But what about fines solely based on repairing damage to something? If you get fined for water damage to a hotel room and pay it then they will just fix it and might even make a little more money than if the damage didn't happen if the fine is high enough, if all rich people broke those rules and paid the fines completely then society wouldn't be any worse off because the damage will be resolved every time. Charging Jeff Bezos a billion dollars for water damage on a hotel room when it only costed $10k to fix because of scaling with income might make some people happy, but I'd argue it's unjustified",
            "title_similarity": "0.8661024",
            "sentiment_compound": -0.9212
        },
        {
            "id": "h877m2x",
            "score": 1,
            "text": "The protests against “mass incarceration” resulting in a shift toward doling out fines for criminal offenses. An increasingly large number of those who receive fines fail to pay them and face jail for contempt. For a significant number of law breakers, there’s no fine small enough,  no installment payment terms extended enough that they won’t breach the agreement.",
            "title_similarity": "0.7830264",
            "sentiment_compound": -0.9134
        }
    ]
}