{
    "CMV: Parents who refuse to take their screaming child out of an event/restaurant/whatever, secretly want others to suffer the way they have to.\nI posted this in another sub but that may have been a biased audience so I want to put this out to CMV for a broader sample.\n\nIt just seems as though the parent lacks empathy for others and general courtesy. I would be willing to bet if you said anything to them or looked at them, you would get a very angered look/comment in return. If the child has been screaming for quite some time and shows no sign of stopping, why would you want to make others miserable unless you have the standpoint of Misery Loves Company? I don't think anyone is that oblivious to think that noise is not bothersome to others and I would be willing to bet these same people are annoyed at loud parties, early morning lawn mowers, ground shaking car stereos and other loud noises such as that that infringe on their piece and quiet.": [
        {
            "id": "h5v2c2d",
            "score": 1,
            "text": "/u/BusyLight32 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/onl9z9/deltas_awarded_in_cmv_parents_who_refuse_to_take/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.4960733",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5rsbo3",
            "score": 103,
            "text": "\" If the child has been screaming for quite some time and shows no sign of stopping, why would you want to make others miserable unless you have the standpoint of Misery Loves Company? \"\n\nIt's not that we *want* to make others miserable. But if my child learns that throwing a screaming fit is going to get them what they want, then they're going to throw a lot more screaming fits.\n\nSo, and I'm very sorry, you're just going to have to deal with it sometimes. This is the price to pay to raise a person who acts appropriately.",
            "title_similarity": "0.87126786",
            "sentiment_compound": -0.8977
        },
        {
            "id": "h5rqzsr",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5rtcbs",
            "score": 6,
            "text": "I think this makes sense for certain events, but not for restaurants. How do you take your child out of the restaurant if you haven't paid the bill? What if it's raining outside? What if you're still eating? It's definitely way more practical than spiteful.",
            "title_similarity": "0.6869632",
            "sentiment_compound": -0.1743
        },
        {
            "id": "h5sk9ye",
            "score": 0,
            "text": "As a parent, I never want to inflict the ear damage inducing screams of my daughter onto others. I clean the floor up of anything she might drop or might throw, and we bring toys or videos for her to stay occupied. However, there are two points I want to make:\n\n\nJust because my child may get a little loud or a bit messy, doesn't mean myself or any other parents are less entitled to a night out. \n\n\nAnd also, children need to be introduced to these kind of social situations so they can grow and learn and observe what behavior is acceptable otherwise they will never act accordingly, and will have social ineptitude.\n\n\nThis is only speaking for myself and wife as parents but we do not have childcare and don't have anyone who can babysit. We almost always take our daughter to dinner and lunch or wherever with us and as much as you expect her to behave so do we. We do our best to make sure she is occupied and behaving and bring anything and everything we can to assure that she won't disturb other people during whatever event. However as much as you expect her to behave is as much as can be expected that a little child hood rambunctiousness is to be tolerated. \n\n\nI don't want anyone to suffer. But I think parents should be able to enjoy time out just as much as a child free party should",
            "title_similarity": "0.8227747",
            "sentiment_compound": 0.9678
        },
        {
            "id": "h5s8q4f",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5saodj",
            "score": -2,
            "text": "No. They just want to enjoy a meal out just like you do. Finding a babysitter can be difficult, expensive and it’s stressful to leave your baby with a stranger. Babies don’t cry constantly, I would be willing to bet most parents are hoping and praying that the baby will sleep/ behave. You’ll find many respectful parents will take the baby outside after a couple minutes.",
            "title_similarity": "0.8090886",
            "sentiment_compound": 0.6666
        },
        {
            "id": "h5sd4pd",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5s8c9g",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5rqphd",
            "score": 0,
            "text": "I can think of two alternative reasons. The first is lack of care for other people (this can be caused by distress or exhaustion) and the other is preservation of benefits regarding their stagnation (assuming they cannot just leave the child outside and continue to enjoy the benefits). Neither of these necessarily equate to the desire for other people to suffer because of optimization of perceived benefits regarding staying there and lack of care.",
            "title_similarity": "0.75814664",
            "sentiment_compound": 0.8337
        },
        {
            "id": "h5tpj6j",
            "score": 0,
            "text": "You went into the public world, kids exist in that space. I believed this way before I became a father. I'm not saying let your kids dance on tables or anything, but if you have an infant or a toddler, you need to get out sometimes, everyone else's opinions be damned. I feel the child averse are either overly entitled or have their own problems.",
            "title_similarity": "0.81647897",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h5scztw",
            "score": 1,
            "text": "I think the fact that OP needs a CMV here is symbolic of how we as a society have abdicated our responsibility to raise the new generation.",
            "title_similarity": "0.50153273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5s9vto",
            "score": 34,
            "text": "What's the alternative? Always give in to the child's tantrum because it's annoying some of the people around? That's going to teach the child that throwing a tantrum will get them what the want. That isn't something most parents want their children to learn. Giving in to a child's every whim is raising a spoilt brat who will get used to the world obeying their orders, which isn't a world anyone wants.\n\nSocialisation is a really important part of a child's growth, so staying home is unrealistic, and more importantly, extremely detrimental to a child's growth. \n\nWe're coming out of a pandemic right now, and there's children who are more that a year old and they've only seen a handful of people in their whole life. Of course they're going to be scared/surprised when suddenly they're seeing hundreds of people around them. Of course they're going to throw tantrums. Sending them back home isn't going to do them any good. All you're going to have is a generation of children who don't know how to deal with other people and don't understand that mummy and daddy can't make the world go your way. How's that going to work moving forward? They won't be able to function logically because they're used to their every whim being obeyed.... because a few adults couldn't deal with a child crying in the same room with them?\n\n\n>It just seems as though the parent lacks empathy for others and general courtesy.\n\nArguably you lack empathy towards parents because you're saying they're cruel, when you've never been in their situation. And general courtesy... like not judging people's parenting choices because it isn't your place?\n\n>that infringe on their piece and quiet.\n\nWhen you're in public space, you dont get to dictate who does what. In your own home you have the right to make those demands, but in public people are free to exist. Children exist as a part of society, and I think a lot of people seem to see their existence as a nuisance, ignoring the fact that if they didn't exist, humans would lutrally go extinct. Also ignoring the fact that they don't have the level of understanding that adults do, and in order for them to gain that level of understanding, they have to go through these experiences, that teach them how to grow.",
            "title_similarity": "0.8593038",
            "sentiment_compound": 0.636
        },
        {
            "id": "h5sl0z4",
            "score": 3,
            "text": "Having a crying baby creates an stimulus in the room. Commonly, people are bothered. The mother, let's say, has her values, which might include not bothering others and likely include getting things done etc. You have your values, which include experiencing the environment the way you intended and exercising reasonable patience for others. She has a math for when this was too much and she should leave. You have a math for when it was too much and she should leave. Your thresholds don't match.\n\nAll this is given.\n\nAs a parent, she has values and desires that are invisible to you. You could call it your failure of compassion but it's just that you're not a parent. If any of those values are more important than your desire to eat in peace, then you can imagine a situation where her math says it's still right to stay and yours says it's right for her to leave and according to universal math you're wrong.\n\nThat's not to say that some parents aren't rude. Some super are. But many will seem rude because they've taken on a tremendously difficult and all-consuming and vitally important task and she literally doesn't have time for you and you can deal. Not always, but probably more than you think. In fact, parents who care about the convenience of others over the needs of their kids end up raising the worst kids that you end up having to work with or deal with later. \"Your emotions are shameful\" is a message that can cut deep.\n\nCan't emphasize this enough: plenty of parents suck and are super rude in a way that is harmful to their kids and inconsiderate to others.\n\nSince you're not a parent, trust that there are sensors and values not really installed for you. Look around at the room next time a kid is crying. You might see a varied response. Lots of people who have had kids completely ignore the noise. Others show compassion to a family having a hard day.\n\nAgain, sometimes parents really did bring their kids to the wrong place and they should go. But I humbly request that you explore the idea that you aren't as in tune with what's right for kids or what's appropriate for parents if you haven't parented.\n\nLots of parents get the line wrong, but if you imagine that parents carry a secret desire for you to suffer, I have to say: that's just so far out of the realm of what most of us have time to think about.",
            "title_similarity": "0.8292261",
            "sentiment_compound": -0.9743
        },
        {
            "id": "h5ry5tp",
            "score": -7,
            "text": "People who care that much about crying kids in a restaurant are already suffering and it has nothing to do with that kids parents. The normal reaction is feeling bad for the parents and knowing they are probably embarrassed and trying to figure out what to do. Walking out without paying is not an option. Neither is leaving food when the whole point in going to eat is usually that you don't have groceries or time but you do have kids to feed.",
            "title_similarity": "0.83811617",
            "sentiment_compound": -0.5789
        },
        {
            "id": "h5sdi46",
            "score": 0,
            "text": "I'd argue modern parents do not have access to tools to change the situation as much as you might think. Think of the news reports we read -- kid having a tantrum gets the cops called because someone though the kid was being kidnapped. A parent who leaves a fussy kid in a safe car loses custody of their child. There's no naughty stair or wall in a store, but god forbid you pick your child up and appear at all as you might provide physical discipline for the issue.  When you remove any avenue of addressing the problem, I'm not sure what we expect other than apathy.",
            "title_similarity": "0.80826586",
            "sentiment_compound": -0.8999
        },
        {
            "id": "h5si4zh",
            "score": 0,
            "text": "I'm assuming you do not have children as I also had a similar believe prior to becoming a parent. \nI always felt bad for the crying child or even when the parents seemed in distress of it all. \nI always said to myself \"can't this parent get their child under control!?\", because I myself was a very well behaved child at that. \nNow I am certainly aware of why or how it can be very difficult to \"get their child under control\". \nAlthough it was/is not the easiest to do,but one thing I realized had to happen, was the children needed exposed to the store, restaurant, and/or events in order to learn how to behave properly. \nExposure is necessary and because I take my children shopping, restaurants and events, they know how to act but it took a few tough and exhausting trips to teach them. \n\nSo maybe there are parents who intentionally do not remove their child to \"make you suffer\" or maybe they themselves are simply just trying to do what they have to do with no actual ill intentions. \nFor myself with 3 children who are in elementary school and are well behaved for the majority of our outings, my days of that \"suffering\" are over but it was NEVER intended to bring misery to others when they were smaller and learning. \nYou can't just flip a switch on a child lol",
            "title_similarity": "0.8466665",
            "sentiment_compound": -0.9539
        },
        {
            "id": "h5swenx",
            "score": 0,
            "text": "Tell me you don’t  have a kid without telling me you don’t have a kid",
            "title_similarity": "0.45470876",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5syw0r",
            "score": 0,
            "text": "Here you think that you're pointing out how somebody else is practically selfish, but I see it the other way around too. \n\nKids are not toys you can turn on and off - parents in a restaurant with a kid that is going through some issues would rather resolve those issues than ignore them and just leave something that could turn out to be a pleasant experience in just 5 min. \n\nYou on the other hand don't care about their problems or the kid's - you just want them gone. \n\nI get it though. Everybody has their own issues, you're not there to solve other people's problems, nor having to put your enjoyment to pause just so that some random couple could sort things out. \n\nBut bare in mind that sometimes that couple just needs some time and understanding. Yes, sometimes they just ignore everybody and indeed are selfish, but you should know that they are usually tired and would really like to eat that dinner they didn't have in ages.\n\nPersonally, being a father of one, I never had issues like this. We always explain and agree the behavior and what people do in there, and having honest talk with your kid, even a toddler, goes a long way in these situations because they really listen. It's a strange and unfamiliar surrounding for them. Parents often tend to forget to give them security, and then kids go nuts.\n\nA little understanding goes a long way.",
            "title_similarity": "0.7933769",
            "sentiment_compound": 0.0244
        },
        {
            "id": "h5tmhco",
            "score": 0,
            "text": "Have you considered your comment in the context of kids with autism or other special behavioral needs? Dont these families have the right to exist in public? Some families would not be able to go anywhere or do anything by your standards. For someone who is criticizing others for a lack empathy, your post comes off as having a shocking lack of empathy for the range of challenges that exist for some children.",
            "title_similarity": "0.8133457",
            "sentiment_compound": -0.7319
        },
        {
            "id": "h5tvjya",
            "score": 0,
            "text": "Op at a public restaurant looking for peace and quiet.  Get real dude.  There is a thing called take out i suggest you do that.",
            "title_similarity": "0.40219808",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h5rpz3h",
            "score": 30,
            "text": "Lacking empathy and wanting people to suffer are 2 different things. Most are just selfish and don’t care but that doesn’t mean they secretly want others to suffer.",
            "title_similarity": "0.77986085",
            "sentiment_compound": -0.7672
        },
        {
            "id": "h5sh5bi",
            "score": 1,
            "text": "\"It just seems as though the parent lacks empathy for others\"\n\nIt seems as though you lack empathy for parents.",
            "title_similarity": "0.7064936",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5sl140",
            "score": 4,
            "text": "Kids scream, its what they do.  You did it, I did it, everyone did it, it happens.  99% of parents dont have the random people around them on their mind, theyre busy as it is,  trying to make random strangers \"miserable\" isnt a thing theyre concerned with.\n\nSometimes they cant just leave with the kid they had to go out for a reason... sometimes they can. Sometimes theyre stuck on a bus or train or plane and kids dont come with off switches.\n\nI will agree however that if you say something to me while im dealing with my kid losing her shit, you will not get the friendliest of responses back. \n\nSimple solution, worry about yourself the kid will shut up eventually",
            "title_similarity": "0.8094509",
            "sentiment_compound": -0.9322
        },
        {
            "id": "h5rsb4d",
            "score": 182,
            "text": "All little kids are loud sometimes. Parents can't just keep their kids secluded away from all other people 100% of the time just in case they cry and it annoys someone. I'm a parent and I know many parents, and I promise you we would much rather they be screaming at home than in public. That isn't how it works, though.",
            "title_similarity": "0.8566419",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h5s2vk5",
            "score": 3,
            "text": "I think that a probably numerous reasons people don't remove annoying children from events, but I'd guess your suggestion is one of the least common. It presumes malice (and misery) when indifference, laziness, selfishness or ignorance are perfectly adequate explanations. \n\nPeople who are used to having noisy children around probably do have a different threshold for the point at which noise becomes disruptive to them, than do people who have little to do with children. And since this is a reality of their daily lives they're probably more willing to ignore it, since they'd never get to do anything fun otherwise.\n\nEven when the child is causing more disruption than anyone could reasonably dismiss, I don't see why the fact that they are inconsiderate should be attributed to them being parents or wanting to upset others. These are probably the same people who use their phones in cinemas and rant at service staff, and did so before they were parents. Such people, generally, don't behave this way because they want to upset other people. They behave this way to get what they want and to feel good. The harm they do to others is incidental.",
            "title_similarity": "0.8376895",
            "sentiment_compound": -0.975
        },
        {
            "id": "h5s0fc1",
            "score": 93,
            "text": "I'm a parent, and a part of raising any child is teaching them how to adjust to new environments, such as a restaurant. When a kid is outside of their comfort zone, they may act out. Also, something that may be important to note is parents understand is the difference in their child's cries. If I'm in a restaurant with my daughter and she starts to whine or *fake* cry, I'm not immediately going to take her outside because I'm going to try to first work her through the situation so that in the future she knows what to expect when we go out to eat. I might go for crayons, or take her for a walk around the restaurant to distract her and calm her down so we can enjoy dinner. On the other hand, if my child is extremely distressed, or is actually crying, I will immediately remove her from the situation (aka restaurant) to calm her down. \n\nSo in response to your argument, I'm not trying to make others at a restaurant suffer when my child cries because I'm not even focused on what other people are doing. I'm focused on helping my child through the situation. I'm also a person who has zero expectations of others when I go to a restaurant. I don't expect drunk people to not shout at the bar, or large families at a table to not to talk loudly, or a baby crying at a table to be removed because I anticipate those things to happen at a restaurant.",
            "title_similarity": "0.7473736",
            "sentiment_compound": -0.9077
        },
        {
            "id": "h5say9t",
            "score": 1,
            "text": "No, they're just exhausted and reach the point of not giving a fuck anymore. Parenting is tough in today's society. As much as I find small kids annoying, my heart actually goes out to the parents first. You can see many times on planes that they feel terrible that their kid is being awful. I just want to say \"It. Gets. Better\"",
            "title_similarity": "0.80734366",
            "sentiment_compound": -0.3582
        },
        {
            "id": "h5sdbp9",
            "score": 1,
            "text": "As a parent of a child who enjoys the odd Public scream, I’ll admit there’s a certain amount of “kids are people too.” thinking going on.",
            "title_similarity": "0.66423774",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5sift0",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5rr934",
            "score": 40,
            "text": "Sometimes there are multiple kids involved. My gf has a niece and nephew being raised by her mother (their grandmother). Since there’s only one of her, and the kids are both under 6, she has to take them both everywhere. This women is surviving on disability checks, so paying for a babysitter is not a thing. She’s had whole anxiety fits over this, because the youngest will *not* stop crying once she starts, and the oldest has had to leave a *lot* of fun places before the fun even starts just because of her crying. At a certain point, she said fuck it. Now, if the youngest is going to cry the whole time they’re at the zoo, she’s just going to cry for a couple of hours (of course she tries to console her, but it doesn’t work). It’s not fair that the oldest, who’s only 6, has had all the birthdays, Halloweens, zoo trips, and amusement park trips he’s able to remember in his entire life ruined by his sister.",
            "title_similarity": "0.7333919",
            "sentiment_compound": -0.5457
        },
        {
            "id": "h5saang",
            "score": 18,
            "text": "My wife would get upset when I would take our daughter outside immediately at public places if she starting acting out. Her reasoning was how else was she going to learn how to be in a public place. I kept saying hell no. I don’t want to sit there with some kid screaming as I try to enjoy a meal. Why would I do that with mine?",
            "title_similarity": "0.8671976",
            "sentiment_compound": -0.743
        },
        {
            "id": "h5s69me",
            "score": 77,
            "text": "Your framing is a little off due to some lost nuance. It's not exactly that parents want you to be miserable. That makes is sound like parents are sitting there thinking, \"Fuck you, too. You can be just as miserable as I am, because I think parenthood needs to be inflicted on all people.\"\n\nThat's not really correct.\n\nWhat's closer to correct is that parents think that children need to learn social skills, and they simply don't do that when they're constantly being \"taken away\". The child doesn't actually learn social skills because they're not practicing social skills. In order to practice those skills, you need to be in those environments.\n\nNow, are children going to struggle sometimes, and fail sometimes? Absolutely, yes. That is to say, they're children.\n\nTBH to say that parents want others to suffer is a bit narcissistic. Parents aren't secretly hoping you suffer. They don't give a shit about you. They're just living their lives, and teaching their kids to become responsible, well-socialized adults. You're responsible for your own suffering. If you're not having a good time at a restaurant, ask to be seated in the bar where children aren't allowed.\n\nEquating this to early morning lawn mowers or loud parties next door doesn't really work. Both of those things annoy me when I'm in my own home, not in public. Okay, if a parent brings their screaming kid to your house and says, \"Hey, my kid is having a tantrum so I packed them into the car and drove here before it blew over,\" then yes, they want you to suffer and that's uncalled for. But out at a park or a restaurant? They're just living their lives.",
            "title_similarity": "0.8913579",
            "sentiment_compound": -0.9239
        },
        {
            "id": "h5sfgiq",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5rs8kr",
            "score": 46,
            "text": "> Parents who refuse to take their screaming child out of an event/restaurant/whatever, secretly want others to suffer the way they have to.\n\nHow do we prove that these parents are keeping their screaming child specifically because they want everyone else to suffer with them? This is an intense accusation, so you'd have to supply some studies or something to prove this. \n\nYou could argue that these parents are lazy, have no regard for those around them, but to say that they are doing it *specifically because* they want others to suffer with them seems a stretch, and I don't believe you'd find any good evidence on this, meaning that it can't be argued well.",
            "title_similarity": "0.96976554",
            "sentiment_compound": -0.8691
        },
        {
            "id": "h5sc90n",
            "score": 14,
            "text": "1, Once somebody has kids they become accustomed to tuning out the kids noises. Before I had children I couldn't stand children, and now I am more adept at tuning it out. I still can see how annoying it is from other peoples perspectives and try to accommodate but at the same time;\n\n2, Children are learning how to behave properly in public. They process emotions differently to (most) adults, and have to learn how to process them better. By removing them from public every time they misbehave, or have a temper tantrum, or whatever it is, you're reacting to and reinforcing their behavior by giving it attention. I am very sure, based on my exprience and the experience of my peers, that most parents would prefer not to be 'those parents' who have a crying baby on the plane, or a screaming toddler in the cereal aisle, but that's life. We make accommodations and give-and-take in society.\n\n3, This is an unverifiable premise anyway. There's no way to really know if people (let's say, the majority) are letting their children scream in public out of spite, and that is putting motivations on many people without any evidence. This is a prejudice at best which doesn't make it incorrect, but it's unverifiable unless you accept the testimony of parents on the topic as true of the majority of parents.",
            "title_similarity": "0.7749126",
            "sentiment_compound": -0.9155
        },
        {
            "id": "h5sl6lc",
            "score": 0,
            "text": "If they're in the grocery store with a cart full of stuff, do you really want them to drop everything that second and leave with the kid, leaving the cart behind for workers to put back? If they're in a restaurant and have already paid for their food and are just waiting for it to appear, do you want them to leave immediately and let the food go to waste? I mean, sometimes parents just  need to go out in the world and get food and other shit and they can't afford to have a babysitter for every. little. thing. \n\nI have NEVER seen anyone just sit there and do nothing while a kid screams for no reason, if they can leave. The only time I've seen a screaming baby and the parents didn't leave was when they were on a plane. And the parents were clearly trying everything they could to calm the child and nothing was working and they were exhausted. Do you want them to just jump out the plane?",
            "title_similarity": "0.7247221",
            "sentiment_compound": -0.8956
        },
        {
            "id": "h5snt9l",
            "score": 0,
            "text": "CMV: People who are upset with parents about stuff like this don't have kids of their own.\n\nJokes aside though, it really depends on the situation. I think loads of parents will take kids out to a more private place in situations like this, which just really makes you notice the times that they dont. There could be a lot of reasons for not taking kids out, like needing to be there, or physical/mental health, parents ability to block out the noise in a way that only parents of young kids can do. All sorts of stuff.",
            "title_similarity": "0.87557656",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h5so112",
            "score": 4,
            "text": "I am aware my child is screaming I am just as upset as you are. I'm trying to teach him that acting like a brat is not going to get you what you want. I apologize for disturbing you but I'm trying to make sure that my child learns to behave better in public by teaching him the right approach. Maybe he's a brat this time but in the future he'll be better behaved.",
            "title_similarity": "0.8347486",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h5srzcv",
            "score": 0,
            "text": "I'm going to go ahead and guess that you don't have any children yourself? ... Now, gas-powered leafblowers, can we outlaw those please?",
            "title_similarity": "0.6333126",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h5tf0ev",
            "score": 0,
            "text": "What if it was an adult with mental disabilities screaming? Would you feel the same way? You want that person to leave and hide away for your personal satisfaction?",
            "title_similarity": "0.75789666",
            "sentiment_compound": -0.212
        },
        {
            "id": "h5tkk7b",
            "score": 0,
            "text": "They have the kids scream their heads off in public and wear themselves out, so later at home they are quiet.",
            "title_similarity": "0.69553167",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5tlvfb",
            "score": 0,
            "text": "I was getting some food from one of my favorite take out places a few weeks ago, and when I walked in I immediately could hear a baby crying.  I look over and see a father, mother, and 3 kids.  All except the youngest (couldn't have been more than 2) were eating their meal and attempting to enjoy it together.  You could see the parents were embarassed and trying to quiet their youngest one, but the other two didn't seemed fazed in the slightest and were perfectly behaved.\n\nI have my own child and can understand the amount of stress from  trying to calm just one baby in a public place.  I can't imagine the stress they must feel knowing they are in a restaurant, outnumbered, and basically at the mercy of what looked like 4 year old twins who were thankfully being pretty chill.\n\nThose parents deserve a night to a meal and an attempt to enjoy some time out of the house, and it's not their fault that their youngest suddenly decided to have some strong feelings.  I didn't feel like I was suffering through it.  The opposite actually.  Dad and I made eye contact and mouthed the words \"I'm sorry\", while I just smiled and shook my head implying it was okay.  It was a very human moment.  It also matters that the place I was getting takeout from was a restaurant that was hit pretty hard by the pandemic, and this was one of 2 tables that afternoon.  Not only are they supporting the waitstaff here, they specifically picked a time to go when all of the kids would be awake enough to enjoy the meal while being well before the dinner rush.",
            "title_similarity": "0.6703074",
            "sentiment_compound": 0.9939
        },
        {
            "id": "h5tthmv",
            "score": 0,
            "text": "I have a 6 year old girl and a 3 year old boy. They get Loud and annoying, scream, throw first... It's thoroughly embarrassing to me and makes me angry. I seek to stop the bad behavior immediately.\n\nMy wife, she gets mildly embarrassed but let's the behavior go. She implores me not to get mad at the kids, thinks doing so is giving into the behavior and is convinced everyone around 'understands'.\nIt's a major source of my anxiety and causing a rift with her and I. \n\nI wish I could control every single thing my kids do. It's be so much easier. But I can't. My wife also has a good point about kids learning to deal with emotions and needing understanding while doing so. \n\nIt would seem by this post - at your age - you are still unable to deal with the emotion incited by screaming kids. If you still can't control your emotion, why do you believe a child should be in complete control of the big emotions in the huge world they're living in?\n\nIt's tough for me, that argument is so logical, but I was brought upon the authoritarian house it sounds like you were... I prefer no screaming/misbehaving, but sometimes patience is the way for parents and grace for onlookers. The latter has brought tears to my eyes once in a particularly stressful meltdown. \n\nI'm going to assume you're not a parent. I felt the same as you. You'll understand one day when your baby, 1/2 of your genetic material that looks like your younger self that adores you suddenly melts down because the top half of their banana fell off as they were eating it. Seems simple, but maybe they woke up early that morning because mommy has an early meeting. She snapped at baby accidently. And at daycare, baby scraped their knee. And nap was cut short. And on the way to dinner mommy and daddy were arguing about daddy's bad driving. The highlight of baby's day is that banana and suddenly it broke. Shit happens and kids DGAF about adults' social norms!\n\nBy the way, my wife is that person you described...she hates Morning mowers, loud thumpers and partiers. Drives me NUTS, the double-standard. I, on the other hand, don't care about loud parties, love the sound of mowers in summer and I had the subs in my truck you could hear it well over a mile away.\n\nTL;DR: loud doesn't annoy me, but I do my best to not be the loudest sound in the room",
            "title_similarity": "0.86728543",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h5twnbg",
            "score": 0,
            "text": "I have three thoughts on this, forgive me if someone else said this elsewhere:\n\nA) The could be trying to diffuse the situation or know/hope that it’s going to blow over. How many times have we all come across something that was supposed to be simple and ended up taking 3-4 times longer than it was supposed to. \n\nB) They might be in a situation where leaving is also problematic, like at a restaurant. You’re there because you’re hungry, you get seated and then the kid starts  melting down…if you just leave, the kids is still melting down and you’re still hungry. If it’s a grocery store, and you just leave you will still need groceries. This all brings me to my list thought:\n\nC) By leaving every time your child has a meltdown, you’re teaching them that crying and screaming is how to control the situation. It’s just like if you pick them up every time they scream, they scream until they are picked up…",
            "title_similarity": "0.6793738",
            "sentiment_compound": -0.792
        },
        {
            "id": "h5twte0",
            "score": 0,
            "text": "Bra those poor ppl are struggling beyond anything… the thin veil of sanity they have to keep a straight face while their kid goes mad is whats keeping them together. Just let them try and feel normal. Your not going to find screaming kids at every restaurant. Just ignore the kids and pray the parents get a better wrap on things.",
            "title_similarity": "0.85502857",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h5txq6o",
            "score": 0,
            "text": "Maybe we don’t want to leave the event or have another dinner ruined by our toddler. We were all screaming toddlers at one point, it’s just part of life. I wouldn’t ruin a wedding or an expensive romantic dinner but if it’s Red Robin, sorry you get what you pay for and sometimes that’s sitting next to a screaming kid.",
            "title_similarity": "0.84893525",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h5ty68o",
            "score": 0,
            "text": "I work in retail. Most of the parents that have screaming, obnoxious kids that throw tantrums, don't take them out of the store likely because if they do then whatever it is they were trying to achieve in the store can get forgotten and trying to calm the child. Especially if they have multiple children. If they just power through it, either the child will get distracted by a toy, distracted by a sibling, or eventually realize that they're not going to get their way and stop crying.\n\nIn my limited experience, they're too busy being miserable to want to make others miserable. That, there's always the chance that employee at this store will come by and try to do something nice to help/distract.",
            "title_similarity": "0.8769153",
            "sentiment_compound": -0.9584
        },
        {
            "id": "h5u1vyx",
            "score": 0,
            "text": "Honestly, now that I have kids, and they’re yelling all day, I’m not as sensitive to it. So when I’m out somewhere, I either don’t realize until I realize that hey, they might have been super loud in hindsight the last ten minutes (and then I tell them to quiet down). Or I forget what “normal” out door behavior is like and what being too loud actually is. Lol. Have patience with people with young kids. You don’t know what toddlers are like until you have them.  And it’s HARD. Its not all cut and dry like you think it is before you have them.",
            "title_similarity": "0.69931173",
            "sentiment_compound": 0.9323
        },
        {
            "id": "h5u74m4",
            "score": 0,
            "text": "On some occasions I think it might be good parenting to some degree to let these things happen in less crowded spaces in order to teach the child that their negative behavior won't change anything, especially if the parent is already busy shopping or something.",
            "title_similarity": "0.62874365",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5u84r3",
            "score": 0,
            "text": "Some folks in this thread keep asking “why is it my problem?” Well the answer is, you’re making it your problem quite simply. If you didn’t make it your problem, then in fact it isn’t your problem.",
            "title_similarity": "0.58900386",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h5u8emc",
            "score": 0,
            "text": "Honestly, that's not true. Usually it's that it's INCREDIBLY difficult to get the kid out away from food (usually causing a much bigger tantrum, involves cleaning the kid, removing bibs, replacing with drool bibs, unbuckling, then fighting the tantrum-y child all the way out of the place), and I first try to settle the kid before moving a screaming child around between every table in the joint, bothering everyone.\n\nSo while someone like you may interpret this as causing you to suffer, you're assuming my intent, which is false. I'm actually trying to get things back to quiet and calm faster for you.\n\nWith that said, extended screaming, or SUPER loud screaming and I'd GTFO with the kid.",
            "title_similarity": "0.84254014",
            "sentiment_compound": -0.885
        },
        {
            "id": "h5ufc4e",
            "score": 0,
            "text": "Lol this is one of those viewpoints you aren't going to have when you have children mate. Do you think I like when my child is having a meltdown? Do you think I have any energy? I try my best to handle it in a way which is respectful to others around me but sometimes my tank is just on empty and I gotta drag him out with me.",
            "title_similarity": "0.8699795",
            "sentiment_compound": 0.5588
        },
        {
            "id": "h5uk6yt",
            "score": 0,
            "text": "Nah dawg. We’re not tryina reinforce that bad behavior. If we carry them out, they get a distraction and a change of scenery... and we’ve cemented in that bad behavior with a reward.",
            "title_similarity": "0.5813135",
            "sentiment_compound": -0.743
        },
        {
            "id": "h5umc83",
            "score": 0,
            "text": "Obviously it’s not every kid every time; however, some kids have autism or other sensory issues. Groceries need to be bought, bills paid etc. When my kid was little anything could set him off. A loud noise, the lights flickering wrong, etc etc. If I left my cart every single time to take him out of the store, we’d have starved. (This was before you could order everywhere; but some can’t afford delivery.) I’m not saying all, mind you, but some of those angry looks are because parents get overwhelmed too. They are embarrassed. They know their kid is being disruptive and loud, but they need milk (bread, medicine, diapers etc.)and can’t just leave (again.) I’m not excusing the behavior, I’m just explaining why it happens to some kids. When an autistic child has a meltdown they aren’t in control of their emotions at all. Even adults on the spectrum can be quite embarrassed by a meltdown and yet can not stop it. I understand how you feel about not wanting to hear the screaming, and from my personal point of view, I don’t want to hear it either. Angry faces my be expressions that aren’t even meant for you. I want my kid to be quiet too, but reasoning with a 3 year old during a meltdown because there is a buzzing coming from the speaker (you can’t even hear,) isn’t even possible. I don’t want to make anyone miserable but we can’t stay home forever and a meltdown can happen anywhere/ anytime especially when a child that is on the spectrum is young. \n\nAgain, I’m not speaking for every parent or child that screams in a public place. And I agree if it’s a restaurant and you could wait outside for your meals and take them to go, you should. But what if it’s raining or cold? Instead of commenting or making a frustrated face, it would be nice to have some empathy, maybe a smile of understanding. We’re doing the best we can.  And since you don’t know which kid is on the spectrum, maybe have some empathy for all of them. Being a kid is hard. Sometimes it’s because the parents suck and they’re just brats. Sometimes it’s a scared kid, feeling immensely overwhelmed and out of control.",
            "title_similarity": "0.8291441",
            "sentiment_compound": -0.9736
        },
        {
            "id": "h5umvva",
            "score": 0,
            "text": "Interesting approach... \n\nSome thoughts:   \nGenerally speaking, having children is a game where you were already paid the curtesy by others when you were a child. They \"endured\" you but you don´t remember. Seemingly, you want to opt out without paying your fair share (according to other comments about not wanting to have kids and more importantly your statement about not wanting to hear children). Will everybody always \"pay the same\"? No. But I hope you get the gist.  \nIf you start from an \"individualistic\" point of view, where everyone fends for themselves and never had any help from others this might be hard to grasp. But this view is very unrealistic and simply ignores everything you got from others without noticing. \n\nAlways assuming the worst from people does not make you a healthy person. Some other commenters already put that nicely.\n\nExpectations: Do you want a child to behave like a small grown up? How much noise are they allowed to make? Is a hungry 2-year-old who has their mind set on taking someones sharp knife during eating out of line?  \nI do get the feeling (which can be wrong, of course) that a silent kid is a good kid to you. This seems unrealistic to me. Should children cry and shout all the time? Of course not. But allowing them to feel their emotions and helping them get trough it will help them a great deal more than distracting or removing them from these situations. Doing this for the first time in a restaurant or other confined setting is however not how I would do it...\n\nIf you feel you should not want children but at some point might change your position or have a partner who wants children I would suggest the following:  \nYou know you had bad experiences as a child (as you said in comments). Work with that. What didn´t you like, what should never be done?   \nRead about parenting. There are many books but getting a general view and then concentrating on certain aspects might help you. Ask parents whose children behave like you feel they should.   \nReflect on yourself as a person and a parent. Does what you do right now help your kid becoming the person you want it to become? Are you micro-managing your child? How does the society you live in shape your views of childhood and parenthood? Are there different examples? What can you learn from them? Do you have support from your parents or other persons to help you with parenting? And, of course, spend some time with small kids.",
            "title_similarity": "0.81901085",
            "sentiment_compound": 0.9865
        },
        {
            "id": "h5uubex",
            "score": 0,
            "text": "Haha. When my infant is freaking out I'm totally not trying to fix it. I'm thinking about you and the kinda day you are having.\n\nWhat a fool.",
            "title_similarity": "0.76011926",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5uulzs",
            "score": 0,
            "text": "Well, I can agree, parents who deal with exhausting children likely ARE suffering. That part is right. \n\nBut isn't it true that suffering people are often not likely to make good decisions? If a person is exhausted, are they not likely to find an issue to be something they simply can't handle at the moment? This would especially be true with a screaming child, because many parents are (I would say rightly) reluctant to manhandle their children in a public place. \n\nIndeed, when you say they are 'refusing' to remove the child, it kind of matters remove HOW and remove to WHERE. Because I'm speaking as a teacher who's dealt with some problematic kids in his time, and moving them won't always be as easy as it sounds. \n\nLet's say I'm at a grocery store, and my kid has a tantrum. Okay, so, I need to 'remove' the kid, but... How? Am I going to... Physically grab a kid in the middle of the floor? Potentially injuring them as I end up wrestling with an 8-year-old, and, assuming I've managed to avoid injuring them AND being mistaken for an abusive parent, AND I successfully wrangle them (less easy than you think if the kid's determined, I'll tell you) then I... What. Well, either I force them into the car, strap them into the seat, turn on the AC and hope the battery doesn't die while I finish my shopping, and also hope the kid screaming and strapped into a car doesn't attract the attention of someone who thinks the kid is being neglected and calls the police on me. \n\nOr maybe I force them into the car, drive them home, and then also... Drag them into the house? And then I leave a kid alone in the house while I RETURN to the store because, you know, I need to get my groceries and having a kid who is having a tantrum alone at home is a GREAT idea.\n\nOr, well, you suggested an event or a restaurant. Well, let's start with the restaurant (because 'event' is a pretty broad category.) So, I'm at a restaurant and my kid starts screaming. So, I... Grab my struggling child and drag him/her out of the restaurant without paying? And then again, either drag him/her home, or strap him into the car while I go back in adn try to pay?\n\n(And of course all this would be a lot harder if the kid was with a babysitter, an au pair, an aunt/uncle/older sibling (I had one friend who is older than his own uncle by several years, so weird stuff can happen) or someone else who might not, legally speaking, even be ALLOWED to grab the kid and force them to move. \n\nAnd let's not forget that again, many parents are exhausted. Or stressed. Or may have all sorts of things going on that make them make bad decisions because 'Holy fuck I CANNOT deal with this right now.' \n\nNow, that doesn't mean that the parents CAN'T have anything to do with it. Many parents are overindulgent or something similar. But there are also times where, practically speaking, there's very little you CAN do.",
            "title_similarity": "0.8677565",
            "sentiment_compound": -0.9853
        },
        {
            "id": "h5uvbdm",
            "score": 0,
            "text": "Behavior analyst here. Some kids have disabilities that cannot be seen. For some kids crying in the store may be doing well for that particular kid.  Some of the fun I have personally experienced - running away with a stranger, dropping in the middle of the parking lot and refusing to move, smacking a baby in the face, punching me in the face, peeing on the floor, knocking over a 10 foot battery display with a cart, and pulling every item off of the rack within reach. So yeah that parent might actually be able to get some shopping done, or eat out or whatever if all their kid is doing is crying.",
            "title_similarity": "0.7278615",
            "sentiment_compound": -0.1365
        },
        {
            "id": "h5v53c0",
            "score": 0,
            "text": "They just wanna eat some food they didn’t cook lol what a fucking idiot delete this",
            "title_similarity": "0.6885322",
            "sentiment_compound": -0.2006
        },
        {
            "id": "h5sv112",
            "score": 4,
            "text": "If my child is screaming, as he often does (disabilities), my stress levels are already sky high.\n\nI *don't* want anyone else to suffer but I do want to get him and myself fed, that is all.\n\nAlso, he has an older brother who needs to do things for himself. I feel like a complete piece of shit when I need to drag him out of something he was enjoying because James has had enough. \n\nOther things that I feel like people are judging me on:\n\n-The way he grabs and throws or eats everything he can reach.\n\n-The amount of food in the ground under his chair.\n\n-Needing to change nappies in the back of the car because I can't find a change table\n\nPlease have some compassion.",
            "title_similarity": "0.8172939",
            "sentiment_compound": 0.8496
        },
        {
            "id": "h5sp6vb",
            "score": 12,
            "text": "I know this has already been delta'd, but I wanted to add something:\n\nNot everything is being done *to* you. In fact, most stuff is just happening and you happen to be there. \n\nAn exhausted parent may be at a restaurant and quietly thinking to themselves \"I'm too tired to care about how loud my kid is being right now,\" but they're not saying \"Man, look at that person over there. *Fuck* that person. I'm going to ruin their day so hard by letting my kid scream.\" \n\nMost people do inconsiderate things because they just don't have the mental or physical energy to do better. For whatever reason, today wasn't the day for taking the extra step. Maybe every other day of the week they do their best, but today just wasn't that day. It's not about you, it's about them and what they're going through.",
            "title_similarity": "0.8564422",
            "sentiment_compound": -0.8896
        },
        {
            "id": "h5sbvxd",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5scoou",
            "score": 1,
            "text": "If kids don’t learn how to control themselves in public then we’d just have a bunch of misbehaving adults.\n\nIt sucks some kids make scene but in the end they are learning how to be in public, some kids just take longer.",
            "title_similarity": "0.7900791",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h5shg0a",
            "score": 1,
            "text": "I have worked in a nursing home for two years at this point. At the nurses’s station, there is a broken fire panel constantly screeching, call lights beeping, and a million other loud, obtrusive noises. Nurses and CNAs carry on working like they don’t even notice.\n\nOnce you have been exposed to a loud irritating noise for long enough enough, it almost completely ceases to exist.",
            "title_similarity": "0.5856731",
            "sentiment_compound": -0.743
        },
        {
            "id": "h5snkly",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5srtz4",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5svcb5",
            "score": 1,
            "text": "There's tantrums, and there's Tantrums. The first time my kid had an actual Tantrum it was fucking terrifying. I lost my mind. I was at home as the only parent and I ended up calling the fucking emergency services. Yes I panicked but it was crazy. It was like the exorcist.  At one point, his little body wracked with seemingly agonising pain and convulsing in what i thought were fits, he stopped making a noise suddenly and stared me the eye as I tried to hold him - his entire expression was dedicated to the one thought he so desperately tried to convey - \"WHAT IS HAPPENING TO ME YOU HAVE TO MAKE IT STOP\". He was terrified of what was happening. I called the emergency services and could hardly hear what they said. They calmed me down, he was sobbing and sobbing and shaking and absolutely, 100% uncontrollable. He couldnt control what was happening. After he calmed down he hugged me so tight, sobbing almost violently, like he was desperately trying to gulp down air. He slowly returned to normal and fell in to the deepest sleep I'd ever seen.\n\nMy wife didnt believe me, then it happened again a few weeks later. I told her it was the same thing. She believed me after that. He had five more over a year or so and then they stopped.  He was fine. I realised they were triggered usually by something inane about food. One day it was because I gave him raspberrries when he really wanted banana. The next time it would have been because I gave him bananas when he wanted raspberries. Something would just click in his brain and it would just blow up.\n\nThat was a Tantrum. The other type, tantrums are much more behavioural and eventually you deal with them. Kids are genius manipulators and you cant really use adult logic with them (If you dont stop doing that we'll never come back here again. Kid - fuck you I dont care). I never got anywhere by punishing tantrums \n\nParents can filter out kids screaming, I can sit on planes quite happily with a screaming kid and it doesnt bother me that much. I can probably sleep through it, I just feel for the parents. They dont want it to happen.  In a place where you can walk out, or change something - the best thing is probably massive distraction. Dont give in to them, dont ignore them. Do something ridiculous or silly and it will jolt them out of it, sometimes. YMMV.\n\nParents dont want to go out of their way to make others suffer. Its not about you, its about them and their child.  I remember a few times and I promise you I'm thinking about him, me and then everyone else in that order of priority. I dont care if I inconvenience you for a while, it wont hurt.  I would never let it drag on. Patronising as it sounds, you'll find out one day. Its not a particularly mature point you're making.\n\nAnd for all those who are young and say they will never have kids because of this, yeah yeah, I was absolutely one of you. 90% of you probably will. You cant conceive of it but you will. History proves it.",
            "title_similarity": "0.7579924",
            "sentiment_compound": -0.9963
        },
        {
            "id": "h5t3zwy",
            "score": 1,
            "text": "People who punish others because of their own regrets and decisions are some of the worst kind.",
            "title_similarity": "0.68467206",
            "sentiment_compound": -0.765
        },
        {
            "id": "h5th5ow",
            "score": 1,
            "text": "I’ve let my daughter scream in a supermarket because I needed groceries. She has screamed in a pharmacy because I needed to wait in line for medicine.\n\nI mean I see the arguement but as a single mother there are things I simply need to get done and I have a child with me basically whenever I’m not working. This happened more when she was in her terrible threes but quite frankly if I took her out every time she threw a fit I would never accomplish anything that was a necessity to get done, I ignored her tantrums too not because I’m an awful mother or wanted to make everyone around me suffer but because if I acknowledged them it made them worse.",
            "title_similarity": "0.7970104",
            "sentiment_compound": -0.9788
        },
        {
            "id": "h5tjfh7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5tk1nh",
            "score": 1,
            "text": "Mandatory kids meals that cost $75/kid ought to do the trick.",
            "title_similarity": "0.35124072",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h5tqnf8",
            "score": -1,
            "text": "There's no way you've got children.\n\nIt's just a part of life dude. It sucks it's annoying but it happens.",
            "title_similarity": "0.66749257",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h5tt23m",
            "score": -1,
            "text": "Been the parent in this situation so many times. Of *course* I'm aware of the disruption to other people, and am embarrassed by it. I am however going to parent my kid the way I see fit. I am hoping I can calm them quickly and the family can carry on enjoying whatever it is. I will obviously remove them if this isn't possible, but it's quite likely my tolerance for how long that could be is a bit higher than the average childless person who starts having a hissy fit immediately a child starts expressing upset, who apparently has zero empathy for them or me, and lacks the realization that children's feelings are equally important as adults'.",
            "title_similarity": "0.8914597",
            "sentiment_compound": 0.8045
        },
        {
            "id": "h5ttvd9",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5scntt",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5sm1pu",
            "score": 8,
            "text": "Nah, they've become desensitized to it and are probably just grateful to sit down, stick the kid in some type of restraint chair, and eat something that they didn't have to cook. I have a fussy kid, last night I got 4 hours and 5 minutes of sleep and the night before was 3 hrs and 50 minutes, according to my apple watch. The days are essentially being a CNA for two dementia patients but instead of being old and slow they're fast, incredibly curious, and aggressively demand their primary fuel, which is parental attention. This is 24x7x365.25 for like 5 years and during that time everyone from the mail lady to the target cashier has an opinion on how you should be raising them so the parents are also desensitized to the judgement of non-breeders. Which makes sense when you consider the fact that no one, who isn't a parent themselves, knows what it's like. There's some really interesting research around how kids re-wire your brain to make their behavior tolerable.",
            "title_similarity": "0.6288469",
            "sentiment_compound": 0.8309
        },
        {
            "id": "h5sj9br",
            "score": 2,
            "text": "Depends on the degree/intensity, but there are times when if my kid is throwing a fit or whatever in public then no I don't immediately remove them. I'm of the mindset all behavior is intentional and/or goal-oriented whether it's conscious or not. In many of those instances, the kid has to see there isn't a big reaction to not getting what they want. Otherwise, you reinforce the behavior to remove them anytime they're uncomfortable or don't get what they want in public. \n\nSecondly,  kids have to learn to de-escalate and that their behavior is not appropriate in some settings. Most kids will behave much better out in public than at home. Home is a safe space where they can let their guard down and that often means more behaviors. If a kid is throwing a fit in public, consider that home behavior is worse and every now and again you gotta out even when you don't have a sitter. Ya can't just leave them at home or in the car. \n\nIt makes my skin crawl when kids flip out in public, but if I don't remove them it's because there's a lesson there or I'm trying to avoid reinforcing the wrong behavior. And ultimately, I care more about my kids development than someone else's meal. Even when it makes me super uncomfortable and I feel awful about it. \n\nAll that being said, we didn't eat out for a good year with my son when he was 1 years old because it seemed he couldn't make it a whole meal without a meltdown. Most parents will act responsibly. The few you're referencing that might want to make others miserable would certainly be in the minority.",
            "title_similarity": "0.774814",
            "sentiment_compound": 0.6566
        },
        {
            "id": "h5st9xu",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1414799"
        },
        {
            "id": "h5szjkj",
            "score": 2,
            "text": "A lot of people suck as parents. When my child as an infant started crying uncontrollably I left. When my child as a toddler pitched a fit. We left and had a hard chat. If you want to be able to go anywhere you must behave. Now do you want to leave or go back inside?  Always back inside always behaving. All I had to do was give the look. Parents should put there foot down. The look worked even through the teenage years. Because I followed through.",
            "title_similarity": "0.81016135",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h5rqx6q",
            "score": 499,
            "text": "Sometimes a parent \\*has\\* to run an errand, and the only time they can run that errand is with their child, and no other person is available to watch the kid.\n\nFor instance, say an overworked parent needs to pick up food and medicine from the supermarket, their baby is crying, but they only have 20 minutes between now and needing to pick up their older child from school and then make dinner. They could either leave until the baby calms down, losing precious time on their errand and possibly not being able to get everything that they need, or they could just power through with their errand while the child screams and finish up as fast as they can. Sometimes, powering through is the best option.\n\nFurthermore, children scream because they are trying to communicate, and sometimes they are trying to push boundaries. Sometimes if a kid is repeatedly pushing boundaries by being a nuisance in a public space, because they know that screaming in a public space means that they can interrupt their parent's day and get back to their toys as soon as possible, leaving when the kid is loud just affirms to the kid that screaming gets what they want. Basically, sometimes you need to let the kid be loud during a 20 minute errand, so that the kid doesn't learn to be loud on all future boring errands.\n\nNow, there are definitely other situations when the polite thing to do would be remove the child--like theaters and fancy restaurants--but generally I try to give parents the benefit of the doubt with how they try to manage their young kids.",
            "title_similarity": "0.7128475",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h5t4xm9",
            "score": 3,
            "text": "I’d like to assume the worst out of such annoying parents too, but I’ve started to realize how shitty parents with a bunch of kids have grown numb and desensitized to their chaotic lifestyle. It’s not that they want to punish others, it’s that they’re just so accustomed to noise and bullshit that they’re straight up out of touch with peaceful, civilized people. Whether it comes from malice or ignorance, they’re a wretched group of assholes regardless.",
            "title_similarity": "0.885899",
            "sentiment_compound": -0.9832
        },
        {
            "id": "h5u2yst",
            "score": 3,
            "text": "I actually agree with you. I don't believe in this \"takes a village\" crap. I pay my property tax so your kids can go to school and my involvement stops there. I don't get the good parts of having a kid. Stop pushing the bad parts on me.\nI've had enough of your kids running dirt bikes in front of my house and your dog attacking the UPS guy",
            "title_similarity": "0.73338217",
            "sentiment_compound": -0.9275
        },
        {
            "id": "h5s0118",
            "score": 315,
            "text": "I once took an airplane with a screaming child, this was a business trip so there was another guy on the plane that I knew. After we got off I said, “wow that baby was loud.”  His response was, “what baby?”  See, he had small children and I didn’t, so children that sounded loud to me didn’t sound that way to him.  I think this could refute your premise.",
            "title_similarity": "0.6660466",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h5sgogp",
            "score": 30,
            "text": "My son has Aspergers, he's almost 12 now but when he was little he would have a stage 4 meltdown literally every single time we would go to the store. I would take him outside to wait in the car if someone was with me or just walk out of the store when I could, with him literally screaming at the top of his lungs. Sometimes though I HAD to get whatever it was I was there to get. I'm a single mom and was usually on my own in these situations. This experience was a complete nightmare for both of us and was made ten thousand times worse when other people felt the need to shame me for it. You have no idea the amount of stress, anxiety, and tears I went through in those years. I cried every day. The thing is you have no idea what anyone's situation is. Yes, they could be asshole parents but just as easily they could be just trying to survive. My son is the complete opposite now, compared to then but it took years of hard work to get us here. I guess I'm just trying to say things may not always be what they appear to be, not so black and white. I'm sure the majority of people who witnessed those times with us thought my kid was just a brat and why didn't I take him out. I try to err on the side of compassion now after my own experiences.",
            "title_similarity": "0.7471879",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h5sh25d",
            "score": 7,
            "text": "I would just remind you of how what noise level bothers a person is so subjective. If someone is whispering in the room I'm trying to nap, I can't fall asleep... I need it to be quiet. Other people can nap with people talking okay. Others also just think its not a bother. I think its rude to play music or videos out loud in a common space, my roommate in college disagreed",
            "title_similarity": "0.722572",
            "sentiment_compound": -0.1935
        },
        {
            "id": "h5sq9g9",
            "score": 8,
            "text": "As a parent who occasionally had a screaming child: You were the last thing on my mind during these moments. ( I say that a little flippantly out of amusement, but truthfully, I did worry about all of the people that heard my kiddo, but I worried about EVERYTHING else too. )\n\nI was busy trying to figure out why my child was screaming, kind of trying to not resent the fact that my life is under the control of a chaotic little toddler that is an absolute angel almost all of the time, but now and then without warning she'll suddenly turn into a ball of fuss.\n\nI had to gauge \"will she settle down in a few minutes if I give her some crackers?  Or how about some juice?  Does she need to be changed?  What does she need?!\"\n\nNo, I'm pretty sure it's not a lack of empathy I felt, but an exhausted attempt to have a life while trying to also get my kiddo used to the idea of being in public. (Especially since she was so good the rest of the time, when she started to scream, it generally had a cause and I wanted to find that cause ASAP.)\n\nBut I will also add: some kids were not quite as calm as my daughter was, and those parents had to find a place in public to get their kiddo used to the idea of being in public. As a little one, you might find the idea of a restaurant unbearable, but they have to learn how to be able to handle things like this eventually, and somewhere gets to be the lucky place to handle a fussy kid for some time. The problem with taking your kid out in public is that it's ... in public. There's no \"public simulation mode,\" you know?\n\nThat might be why you see the occasional parent ignoring their kid, as they're teaching them that a tantrum won't cause the parent to give in and take the kid where the kids want to go. I'm granting the benefit of the doubt here, because as a parent, I would have picked a place that was mostly appropriate for exposing my kid to what I want them to become used to, that it wouldn't be out of place.\n\nI took our kiddo to Denny's and Big Boy's and other family eateries that usually had other kids, we went to kid's movies and got her used to that, we definitely went shopping in the grocery store and the mall with her, and with that she became used to being in public and learning how to behave in public. We didn't go to a late night bar (which would have been bad for her too, but it's not the right place for that), we didn't go to a movie that wasn't already filled with kids, and generally when my kid was more fussy than just a little bit of whining, I did take my kid out of those locations to figure out what was up.\n\nBut some kids ... They do just need to learn \"I need to accept that I will spend some time in a grocery store for the rest of my life.\" You need to ignore their fussiness and do what you can to get your groceries and teach your kid how to be a human.",
            "title_similarity": "0.846796",
            "sentiment_compound": -0.8546
        },
        {
            "id": "h5sf8aa",
            "score": 11,
            "text": "I actually had this thought the other day as a child was screaming in the restaurant I was in. At first I felt annoyed at them for not taking their child outside (I would do this as much as possible when my kids were toddler-aged and nothing calmed them down like going outside), but then I just felt bad for this poor dad over there with his kid having a meltdown. He looked exasperated. Sometimes parents just need to sit and chill, too.",
            "title_similarity": "0.8540323",
            "sentiment_compound": -0.9436
        },
        {
            "id": "h5rr33m",
            "score": 3043,
            "text": "You should look into [Hanlon's Razor](https://en.wikipedia.org/wiki/Hanlon's_razor).  \n\n>> never attribute to malice that which is adequately explained by stupidity\n\nHonestly Hanlon's razor is stated with a little too much misanthropy. People do bad things not only out of stupidity, but also out of laziness, exhaustion, or complacency. \n\nA parent of a fussy child is exhausted.  All the time.  They get so used to a child screaming that it almost becomes background noise to them.  You aren't surrounded by this noise all the time, so you notice it much more.\n\n\nIn general it's good to look for the kindest explanation for other people's bad behavior.  It doesn't do you any good to assign evil motives to others you don't know anything about.  It just makes you a less trusting and more bitter person, and doesn't actually change anything about the situation that annoys you.",
            "title_similarity": "0.8697012",
            "sentiment_compound": -0.9717
        },
        {
            "id": "h5sj1iv",
            "score": 20,
            "text": "Okay, I never did this.  I was the mom that dragged the kid out to the car when they acted up, but I totally get how people do this.  I think it's one of two scenarios - the parents come from families with a lot of kids, and their threshold for acting up is different than someone who is child-free.  Or they are just burnt out and want one night to eat a nice meal and have been looking forward to it for weeks, so they just tune out what their kid is doing.  I am not excusing it, but I can see how someone could get to that place.",
            "title_similarity": "0.82377505",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h5sjwn0",
            "score": 1,
            "text": "After 4 kids you just can't hear screams anymore. It's like being a coffee addict: Initially it's a jolt, eventually it barely gets you off your couch. I can't hear their screams anymore. I hope they're ok.",
            "title_similarity": "0.65202343",
            "sentiment_compound": 0.8007
        },
        {
            "id": "h5sp6lm",
            "score": 1,
            "text": "So do those parents want others to suffer with them or do they just lack empathy and general courtesy? These things aren’t the same",
            "title_similarity": "0.7713289",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h5sqg2i",
            "score": 1,
            "text": "A lot of them have become immune to the screaming and do not see it as that annoying. \n\nOthers are currently teaching their kids that screaming do not give them anything (for example if the kid is screaming to leave the place going it out with the kid only teach the kid that screaming actually works)",
            "title_similarity": "0.7935916",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h5sqjxa",
            "score": 1,
            "text": "My kid hasn't done the screaming yet but has acted up in public and honestly you're just torn between losing your shit and throwing them off a bridge. \nThe problem is ignoring them doesn't stop them being little shits and reacting gives them the attention they want so they'll keep acting up.",
            "title_similarity": "0.80882734",
            "sentiment_compound": -0.9353
        },
        {
            "id": "h5ssay7",
            "score": 1,
            "text": "Some quick thoughts where some or all might be true:\n\n\\- Having to deal with these types of children has put them at wits end and this current outing is their last attempt to cling on to some type of normalcy.  This will be the last time they'll be trying this for the next year.\n\n\\- They don't have the same sensitivity to the crying as others do.  Other parents have partial immunization and a non-parent may have zero immunization.  The cries of children are nuanced and certain cries don't trigger a visceral response anymore once you internalize them.\n\n\\- The persistent and pro-longed lack of sleep is impairing their judgement.  When you go without quality sleep for days, months, or perhaps even years the world becomes a bit dream-like.\n\n\\- The parents could just be self-centered assholes who couldn't care less about you and your feelings.\n\nNone of these things involve wanting to inflict pain on others.",
            "title_similarity": "0.76447344",
            "sentiment_compound": -0.9396
        },
        {
            "id": "h5sstki",
            "score": 1,
            "text": "There can be times when it’s too much, but oftentimes parents don’t want to reward bad behavior with attention. If you never make a kid cry it out and always address the situation, the kid learns that crying is a lever they can pull to make their parents do what they want. If a parent is letting their kid cry because they’re trying to teach them that crying is not behavior that gets rewarded, then it really has nothing to do with making anyone around them suffer.",
            "title_similarity": "0.86614037",
            "sentiment_compound": -0.9505
        },
        {
            "id": "h5svoke",
            "score": 6,
            "text": "And this is why we don’t take our special needs daughter to restaurants, parties, etc. We used to, but looks from people when you really can’t help it fucking hurt your soul. So I don’t eat out anymore and I stay at home with her while the wife takes the other kids.",
            "title_similarity": "0.7897215",
            "sentiment_compound": 0.1601
        },
        {
            "id": "h5swgbg",
            "score": 1,
            "text": "They dont *want* others to suffer, they just dont care enough to stop it.\n\n>the parent lacks empathy for others\n\nYeah, thats what it is.  They simply dont care very much about others.",
            "title_similarity": "0.76782334",
            "sentiment_compound": -0.8393
        },
        {
            "id": "h5swkcq",
            "score": 2,
            "text": "I feel lucky my kids were great list listeners as babies, toddlers, children and now teens. Communication, patience and pickinging your battles  is what I did differently then my parents who basically just fed us and kept us alive and strict punishments when we were “misbehaving”.    But I do notice that more little kids are becoming too spoiled where it becomes a “me culture”. I can only assume that bc the cost of living has risen, meaning both parents have to work. So you have tired overworked parents who's only break comes from letting the kids be entertained by tv.  And then you have to consider that you can be doing everything right and the kids are just kids. We can all practice patience",
            "title_similarity": "0.7079549",
            "sentiment_compound": 0.2154
        },
        {
            "id": "h5sxcng",
            "score": 1,
            "text": "It’s not that we want others to suffer. It is that we are suffering ourselves. Every single thing I do is riddled with anxiety awaiting a meltdown. We already feel like a failure. Going to these events with our child is a way for us to try and feel normal, to give ourselves some small modicum of normalcy. Not leaving when the meltdown happens is us desperately clinging to the hope that this will pass, and that this won’t be yet another failure.",
            "title_similarity": "0.847241",
            "sentiment_compound": -0.9066
        },
        {
            "id": "h5szxjr",
            "score": 1,
            "text": "I know this could be looked at as terrible but I wouldn't go to a public restaurant with my 1st daughter until she was like 18+ months. I was always petrified of being that parent.",
            "title_similarity": "0.77514976",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h5t0d84",
            "score": 6,
            "text": "I am the parent of a screaming child. While we haven't taken her to any events ever for obvious reasons, I can already tell you that when we do it will be a kind of quiet desperation at work if she starts crying inconsolably and we *don't* leave. \n\nWe're ordinary people, no different than anyone else, and especially as new parents, we are *utterly overwhelmed* at times. \n\nWe will just be hoping she will settle so we can do *one* marginally normal thing. Because we miss being able to participate in society. \n\nIt's probably a little deluded. But it's not malicious. Even a very small kindness in a moment like that will likely go further than you can possibly realize.",
            "title_similarity": "0.86819863",
            "sentiment_compound": 0.6295
        },
        {
            "id": "h5t1nkk",
            "score": 1,
            "text": "Kids need to learn how to behave. They can't do that alone.",
            "title_similarity": "0.4678351",
            "sentiment_compound": 0.1877
        },
        {
            "id": "h5t20aj",
            "score": 1,
            "text": "I think it's much simpler than that.  I think they're so use to their kid screaming & crying that they have grown immune to the sound of it.  Just like the kids who have grown immune to their parent's screaming at them to be quiet.\n\nHubby had a boss who had 3 bad ass kids.  All he ever did was hollar at & threaten the kids; the wife too.  I watched them one day for a few hours & actually sat down with them & interacted with them, set guidelines & boundaries up front.  They behave s the entire time, no outbursts, no nothing.  Boss & his wife came to pick them up & were surprised that the kids were calm & quiet.",
            "title_similarity": "0.76358306",
            "sentiment_compound": 0.4382
        },
        {
            "id": "h5t2sc5",
            "score": 1,
            "text": "Well they're hungry for better food but this parasite monster is legally bound to their care. Nothing wrong with being a little selfish and enjoying a meal.",
            "title_similarity": "0.68740225",
            "sentiment_compound": 0.9047
        },
        {
            "id": "h5t3jjf",
            "score": 1,
            "text": "I think most people don't want others to suffer but likely, they expect others to be understanding.",
            "title_similarity": "0.66388065",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h5t3mac",
            "score": 1,
            "text": "As a parent - there are several scenarios here…\n\n1) Irate child learns a lesson by being forced to leave a (perceived) fun place because of their behavior.\n\n2) Irate child is embarrassed by their shitty behavior, reinforced by refusing to reward them after dinner (you don’t get ice cream) \n\n3) Parents don’t give a fuck and/or have no social awareness. \n\n4) Parent wants everyone else to feel their pain. \n\n5) maybe it’s their first time being out ever, or in a while, with their difficult child and have no idea how to deal with it. \n\nBe patient with people, including parents with shifty kids. Also remember that it’s a kid - they aren’t necessarily shitty all the time.  You might just be catching them at a cool moment.  We’re all just humans trying to figure this shit out…including that kid.",
            "title_similarity": "0.8698653",
            "sentiment_compound": -0.9849
        },
        {
            "id": "h5t43wn",
            "score": 1,
            "text": "Absolutely not in all cases. I wouldn't do that with my daughter typically and that is only because I have a behavior background and know ii an reinforcing that screaming = escape/leaving the undesirable situation. I would try to avoid doing it for negative behaviors and teach appropriate ways to leave. \n\nAlso, I have worked with many parents with children on the spectrum and their children have numerous reasons why they could be screaming (I had clients that were just bothered by the quiet music playing in a restaurant or were sensitive to the lighting). The parents deserve to go out to eat and try to teach their kids how to be out in public too. This is important to get the children acclimated to these new environments. I actually went with one family out in public every weekend to work on these behaviors in public because it made the parents anxious to go out. \n\nBe careful placing wide judgments like this on groups of people.",
            "title_similarity": "0.89694524",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h5t46yj",
            "score": 1,
            "text": "So, firstly think about the parent.\n\nThey’ve probably been dealing with this all day, even longer most likely. They’re exhausted, irritable and have been listening to this for so long, they probably don’t pay as much attention to it anymore. \n\nThis inaction so to speak might not have to do with lack of empathy, but rather, trying to do me some semblance of normal.",
            "title_similarity": "0.7085253",
            "sentiment_compound": -0.6605
        },
        {
            "id": "h5t4aaq",
            "score": 2,
            "text": "There could be various reasons as to why parents allow their children to act out in a public setting where it is inappropriate. What I find as the usually reason to this is that it is much worse at home. Certain parents are used to such worse behavior at home that to them, the bad behavior in public is not that bad.\n\nFor everyone else, it appears really bad because such a behavior from their own children or a lack of children is not present in their lives. It's all relative. Another part to this is some of those kids are only acting up because of their parents. My wife and I raised our niece for my SIL. When our niece is around us, she is pretty well behaved. She understands the boundaries and expectations that are set upon her. When she is around her mother, she just acts up. She does so because her mother didnt seem to take an active role in our niece's life. She was sort of young and really was not ready to be responsible for another life outside of her own.\n\nIf you want to determine if a parent cares or not, you don't have to say anything when their child is acting up. Just make eye contact with them. If they do care, they will be embarrassed and try to correct the situation. If they don't care, they'll pretend they don't see you or will become hostile. At that point you have to feel sorry for that child. That child just had a bad roll of the dice in terms of the parents they ended up with.",
            "title_similarity": "0.8549874",
            "sentiment_compound": -0.7749
        },
        {
            "id": "h5t6eq4",
            "score": 1,
            "text": "I mean i wouldn’t day they want others to suffer, just that they’re a tad incompetent",
            "title_similarity": "0.73332626",
            "sentiment_compound": -0.743
        },
        {
            "id": "h5t8zz1",
            "score": 1,
            "text": "My personal view is that people like that are still growing up while they're raising their children!! Not that raising a child is easy, but there does seem to be a transfer of trauma between parent and child where the parents want their child to suffer like they're perceiving that they are. \n\nThis behavior seems to be a breakdown on the parents side, they were never taught how to be patient and understanding in a crisis, so the stress gets to them and they start acting irrational!!",
            "title_similarity": "0.86121404",
            "sentiment_compound": -0.9567
        },
        {
            "id": "h5t98vb",
            "score": 1,
            "text": "I’ve been this guy. I wasn’t thinking about you at all. I was just tired and oblivious. Sorry everybody!",
            "title_similarity": "0.51575243",
            "sentiment_compound": -0.5411
        },
        {
            "id": "h5tb55q",
            "score": 1,
            "text": "It’s not that they want others to suffer, they just lack empathy, they had to listen to the child scream for so long they forgot that it’s not a normal thing. \n\nIn a super fucked up way it’s not even malicious",
            "title_similarity": "0.79326695",
            "sentiment_compound": -0.849
        },
        {
            "id": "h5tcawe",
            "score": 1,
            "text": "I get what you’re saying, and there are some dumb parents out there. But, some of us have ulterior motives. I’ve been that parent. I was not trying to be malicious towards other patrons. I was trying to teach my child that they were not going to get what they wanted (to leave) by yelling about it. If we give in all the time to our children, the unwanted behaviors will continue. Granted, there are points when a parent must realize when to take a break.  But it only took my kid a few minutes a few different times to learn he wasn’t going to win.  He would eventually settle down and the meal would be fine.  And I knew he was better off since we were not rewarding bad behavior \n\nChildren need to learn how to act in public. But they can only do so by being in public.",
            "title_similarity": "0.82067454",
            "sentiment_compound": 0.8768
        },
        {
            "id": "h5tdgnr",
            "score": 1,
            "text": "I agree with you in principal that it would be more courteous to leave. However, as A child screaming that can’t be calmed should not be the basis for denying the adults the opportunity to do adult things like going out to eat. Assuming it’s not a parenting issue, kids sometimes just cry and scream and go ham without much reason at all. Should an adult who is hardworking, tired, and just wants to have some fun deny themself the opportunity because the kid might scream at the Applebee’s?\n\nFor me it’s in the same ballpark as a person with a tic disorder who shouts expletives being shamed for being out at a restaurant. Yes, it’s not ideal, and maybe if that’s what you’re dealing with you should plan, but it’s not selfish to want to go out and enjoy life like everyone else. \n\nI",
            "title_similarity": "0.84608036",
            "sentiment_compound": 0.8305
        },
        {
            "id": "h5tdxdv",
            "score": 1,
            "text": "I had a baby that cried 90% of the time they were awake and 70% on a good day. It lasted 10 months. That’s not the norm (thankfully). It kept us from wanting to go out in public. On the few times we did go out we got dirty looks. I felt terrible the whole time, but there was nothing I could do to make it stop. Sometimes that happens and the parents need a cup of coffee or to get out of the house too. It’s not always possible to get a babysitter. Some parents are crappy and should pay more attention to their kids/ discipline them. However, I’ve learned that you can be an excellent parent but there’s no way you can MAKE kids do what you want. You can only influence them. Also, like others have said- you never know their situation",
            "title_similarity": "0.7316624",
            "sentiment_compound": -0.7065
        },
        {
            "id": "h5te00x",
            "score": 1,
            "text": "its not an intent to hurt others, its just a resignation that this kid is never going to stop crying and if I take them out every time they cry I am never going to eat a hot meal again. I think most parents like this are just praying that everyone else isnt too bothered by it. I am not a parent, thank god, and I would probably take my kids out if they were crying in public every single time, so Im not saying that what these parents do is right, just saying they might not have such bad intentions.",
            "title_similarity": "0.86189467",
            "sentiment_compound": -0.6035
        },
        {
            "id": "h5temkb",
            "score": 2,
            "text": "I think it’s about time and place. In a movie theatre, in a restaurant or diner, etc, it’s rude. People go to those places to relax, like like that parent. So why go out of your way to ruin people’s relaxing fun time for YOUR relaxing fun time. It’s selfish in some scenarios, and normal in others like Walmart lol",
            "title_similarity": "0.7735635",
            "sentiment_compound": 0.936
        },
        {
            "id": "h5tf0f7",
            "score": 1,
            "text": "Or they are just shitty parents.",
            "title_similarity": "0.56270343",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5tgpys",
            "score": 1,
            "text": "Yo I felt this too",
            "title_similarity": "0.03136803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ti6ts",
            "score": 2,
            "text": "As someone who generally dislikes screaming, public crying, and other loud and disruptive nuisances, I think it’s important to consider the context. If the parent brings the child into the situation and the child is making a scene from the get-go, it’s clear the parent should make efforts to avoid that or at least calm the child. \n\nBut let’s take it further. One of my personal favorites - zooming through the air in a giant metal tube crammed with 100 other of the great unwashed. Yup, flying. Nothing makes a flight better than a screaming child on a plane…/s. But what is the parent to do if the child came on the plane calmly and has no history of such behavior on a plane? Eject him/her from the plane? Of course not. You bought the tickets and now you’ll all take the ride. I agree it sucks. I just don’t think that generally speaking, parents of screaming kids are so malicious. Kids can be brats to even the best of parents, I know I was.",
            "title_similarity": "0.7679994",
            "sentiment_compound": 0.912
        },
        {
            "id": "h5tkzff",
            "score": 1,
            "text": "facts! I’m not even a mother and I get second hand embarrassment from a screaming kid in public places. I’m not judging your child I’m judging you shut that baby up or leave temporarily till he calms down. Scolding everyone who stares won’t make him be quiet so just be courteous.",
            "title_similarity": "0.8984282",
            "sentiment_compound": 0.5655
        },
        {
            "id": "h5tlcuw",
            "score": 1,
            "text": "I have just let a baby cry in a restaurant exactly one time. And admittedly, it was to make someone miserable. But they kind of asked for it. It wasn’t a misery loves company thing as much as it was a malicious compliance thing. \n\nEvery other time, I have removed the screaming baby/toddler/child if I could not calm them down within a minute or two.\n\nBut, I have been very disappointed when I could not calm them down and wished it could just be ignored so I could eat. Or watch the movie. Or do whatever. It’s hard having to exclude yourself from social things because of an upset child. It’s not the kid’s fault, and it’s not fair to everyone around me, but I kind of get just wanting to participate as an adult. I would attribute it more to desperation than malice.",
            "title_similarity": "0.8773424",
            "sentiment_compound": -0.9823
        },
        {
            "id": "h5tlnjx",
            "score": 5,
            "text": "This is why I bring my child to places where I know people are already suffering. i.e. Dennys, Applebee's, etc",
            "title_similarity": "0.59931594",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5tlo3q",
            "score": 1,
            "text": "Yep. I have a toddler and a 2month old. Even a peep and it’s outside to enjoy some time in the parking lot. People sit down at a restaurant to enjoy a meal out, and that usually doesn’t involve a screaming child in the background.",
            "title_similarity": "0.33818954",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h5tpqhy",
            "score": 1,
            "text": "ABSOFUCKINGLUTELY",
            "title_similarity": "0.20607015",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5trnyn",
            "score": 1,
            "text": "I think it could also stem from having to miss out on things because their kid is misbehaving. They could be tired of missing out and just stay with their child because of it. It still feels like a selfish choice, though. When you have kids your social life gets cut way back. Most are aware this will happen, but not to the extent of which it will happen. They could be so tired of not getting to do stuff that they just decide they are going to stay and hang out and don't give af anymore. Just a thought.",
            "title_similarity": "0.8340504",
            "sentiment_compound": -0.8925
        },
        {
            "id": "h5tta68",
            "score": 2,
            "text": "This is true, you aren't wrong\nSources: my mom",
            "title_similarity": "0.27657747",
            "sentiment_compound": 0.6546
        },
        {
            "id": "h5tthx4",
            "score": 1,
            "text": "Not always the case for example sometimes the kid doesn’t want to sit and eat his meal even though their hungry so instead of taking them out we will let them cry it out and realize we are paying no mind so they aren’t getting the attention they are seeking and the behavior will eventually stop. They will usually 75% of the time realize the ruse isn’t working and it’s time to throw in the towel and start behaving. At least with my twin boys who are 2 1/2 currently. However if it’s teething pain etc and it’s nonstop I happily take them out to calm down and distract themselves while the medicine kicks in if needed.",
            "title_similarity": "0.83349025",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5u2aqj",
            "score": 2,
            "text": "A lot of parents want so badly to just be able to get out and do the same things they used to enjoy. Things they pictured being able to do with their child for 9 months plus. That combined with the fact that a lot of parents are in over their head x100 when it comes to child raising creates the perfect storm. That being said, as a parent myself, I still get pissed when people let the child stay screaming at the table.",
            "title_similarity": "0.8136598",
            "sentiment_compound": -0.3593
        },
        {
            "id": "h5u4alo",
            "score": 2,
            "text": "I just think there should be more childfree places and parents shouldn't bitch about it.",
            "title_similarity": "0.55664027",
            "sentiment_compound": 0.4717
        },
        {
            "id": "h5u6zfc",
            "score": 2,
            "text": "They selfishly assume that everyone wants to tolerate their kid too.  Our neighbours have a 4 yr old who I’m year to hear utter a single word when asked to speak, her brother speaks well but she just makes whinging noises about everything!  If she wants to play with my sons toys “uuuuurrrghhhh!!!!” I’ve told him she isn’t allowed to play with them unless she asks for them, she’s has to use her words and her manners, she then storms off.  The other day she was sat on our stoop on her own looking in at my partner and I and making weird noises and stamping her feet for attention, my son was outside with an ice cream before she came out and she wanted one, she decided to treat us how she treats her parents but it didn’t work and she didn’t realise we could she her she stood up and said “ok FINE!” And stormed off.\n\nI’m not saying all kids are like this but some parents have a LOT to answer for, just because they don’t mind bad behaviour doesn’t mean the rest of us do.",
            "title_similarity": "0.81061924",
            "sentiment_compound": 0.8367
        },
        {
            "id": "h5u9jsr",
            "score": 2,
            "text": "i see it as a cry for help, so i try to help out by slapping the kids",
            "title_similarity": "0.69241524",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5uav0q",
            "score": 2,
            "text": "There’s only one time that we went out to eat with our toddler when she was baby and she got upset about something so my husband finished packing up our food and paying while I took her out to the car. We have been out to eat with her a handful of times when she was a baby and there were a few times our server or a nearby server complimented us on how good and quiet she was. She is about to be 3, she does NOT act up in stores or anywhere else, if she did we would take her out to the car or outside and then take her home. But yeah if you’re somewhere essential and you don’t have any other options then yeah just do your thing but if you’re at a restaurant, theatre, Etc and your child is throwing a huge temper tantrum then you’re the asshole for keeping them there.",
            "title_similarity": "0.6159464",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5uczmc",
            "score": 1,
            "text": "Honestly, they may not be fully aware of it. During certain phases it seems near constant fussiness is the norm. The parent may simply have tuned it out.",
            "title_similarity": "0.69183886",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5uerp9",
            "score": 1,
            "text": "Kids suck and we all must suffer because of it.",
            "title_similarity": "0.60791767",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h5ufo1o",
            "score": 1,
            "text": "It takes a village\n\n🤷‍♀️🤷‍♀️",
            "title_similarity": "0.04711771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ug7po",
            "score": 1,
            "text": "No need to change your view, this sort of stupidity serves as a red flag to normal people. Carry on.",
            "title_similarity": "0.5815324",
            "sentiment_compound": -0.659
        },
        {
            "id": "h5ui6lk",
            "score": 2,
            "text": "The last three times I've gone out to eat there has been a screaming child in the restaurant. I was at a spoken word poetry slam and the performer had us all engrossed in their performance... and then it got ruined because someone brought an infant!!! One time I went to a casino restaurant at 2a.m and there were two moms with children there and yup the kids were screaming!!! You can't avoid them!!!",
            "title_similarity": "0.59834677",
            "sentiment_compound": -0.8618
        },
        {
            "id": "h5uid8v",
            "score": 2,
            "text": "Gonna 100 percent agree. I have a newborn myself and a 5 year old. If they start to lose their shit and I can't get them to calm down its time to go outside. My SO thinks I'm being ridiculous, but I'm not gonna let my child ruin someone's dinner. I'll take that shit to go.",
            "title_similarity": "0.7158217",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h5ujibq",
            "score": 2,
            "text": "You think self-absorbed people care how their actions affect you? They don’t care or think about you at all.",
            "title_similarity": "0.64636576",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h5uk0eu",
            "score": 2,
            "text": "It's not a secret.",
            "title_similarity": "-0.033569288",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ukjtm",
            "score": 2,
            "text": "what you said could be the one of the reasons why parents donot do anything when kids crying in public which is the parents want other people to suffer they way the have to, but highly unlikely. people with or without kids are busy. they have things to do. a parent might want to be a awful person and to prank people via using their crying kids to annoy people, but i believe this kind of bad person are very few.\n\n i dont have kids, but i have many siblings and they have kids, and i have spend a lot of time with them. my guess that parents allow their kids to cry in public is that:\n\n1. they dont know how to behave kids. they are just terrible parents who do not deserve to be a parent.\n2. they do know how to make their kids stop crying, be it a nice reasonanle way or terrible way such as yelling, they just dont care, they have been hearing this crying all day every day, it doesnt mean anything to them now. so they are just not going to do anything about it. \n3. they are avoiding resposibility, they are waiting for someone else to do it. as in wife waiting for husband to do it, or husband waiting for wife to do it or both waiting for their idiot sibling who tagged along to handle it.\n\nfrom my personal experence, kids come from a emotionally stable family tend to be more polite, behave better in public space. kids from less stable(as in the parents got emotional issues, their kids will be more handful)",
            "title_similarity": "0.9040687",
            "sentiment_compound": -0.9924
        },
        {
            "id": "h5ukkj5",
            "score": 2,
            "text": "I would say they lack empathy for their child as well, if they're willing to just let their child suffer without helping at all",
            "title_similarity": "0.8273923",
            "sentiment_compound": -0.6796
        },
        {
            "id": "h5ul1r3",
            "score": 2,
            "text": "I work in the restaurant industry as a Busser. I have to say I quite enjoy it, reason being I walk by said family while working and while laughing put my horns up and say \"Yeah, practicing for lead vocals in a metal band!\" 95% of the time I get a baffled wide eyed look from the parents yet they almost immediately tend to the child lol. Problem solved and I can't be reprimanded because I'm being friendly and polite.",
            "title_similarity": "0.5552422",
            "sentiment_compound": 0.9272
        },
        {
            "id": "h5uloht",
            "score": 2,
            "text": "When l hear a child crying my first thought is why is the parent not pasifying that child because my only interest if my child was unhappy would be to change its mind and make him/ her happy.",
            "title_similarity": "0.8552581",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5umh76",
            "score": 2,
            "text": "My kid used to cry in any store that sold toys or candy.  His grandma used to buy him anything he wanted,  everytime they left the house \n\n\nI had to deal with tantrums.  What I'm not seeing as a response is people teaching their child why we don't throw tantrums. \n\nThe second my kid cried,  I would drop whatever I had near a worker,  apologize and leave.  Then I'd sit in the car face to face with cranky child and ask what was wrong. I would talk to my child, and say it's not ok to scream like that in public,  because no one else is screaming,  it's very loud, it hurts, etc.\n\n\nI would sit face to face and explain why we don't need a toy or a treat every time we go somewhere. Its expensive,  whatever.\n\nI'd also tell my kid we'd be somewhere for 3 minutes, and explain how long 1 minute was.  We used a song that lasted 1 minute.\n\n\nExplaining things to your kids, even when they don't understand,  can help them and you so much. \n\nMy son rarely cried.  He only had a couple tantrums.  I can only assume it's because I explained things face to face instead of saying because I said so.",
            "title_similarity": "0.8137508",
            "sentiment_compound": -0.9355
        },
        {
            "id": "h5uplmd",
            "score": 2,
            "text": "Agree completely, and I'm a parent.\n\nMost people don't seem to understand empathy.. which is the reason I take my children out of such places to address such issues.",
            "title_similarity": "0.7650565",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5uqarc",
            "score": 2,
            "text": "This probably won’t CYV but one of the problems is people don’t teach their kids how to behave at the table at home first- if at home they are rewarded with sweet desserts for refusing to eat dinner, or sit on the sofa watching tv / gaming with finger food, or eat alone and unsocialised in their room how are they going to be magically model children at a restaurant? They just won’t have the skills to cope.",
            "title_similarity": "0.734551",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5uqlsa",
            "score": 2,
            "text": "People like that should not be allowed to have children.",
            "title_similarity": "0.6067563",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5uybcr",
            "score": 2,
            "text": "Daycare teacher here. I'm going to be honest with you, even with the loudest, highest-pitched, most obnoxious screams from a small child... You tune them out after a while. If the child screams all the time, you can't stop them. And other children are screaming because they want food, need to be changed, are fighting over a toy, or any number of situations that you /can/ help. You learn pretty quickly to ignore the child who is always upset (unless they start screaming in a different \"tone\", indicating the actually need something), and before long you don't even notice it any more. I will bet that it's the same for most parents with screaming children. They're so busy looking after their other kids or themselves that the perpetually loud child becomes background noise.",
            "title_similarity": "0.80495405",
            "sentiment_compound": -0.8734
        },
        {
            "id": "h5uz8ji",
            "score": 2,
            "text": ">If the child has been screaming for quite some time and shows no sign of stopping, why would you want to make others miserable unless you have the standpoint of Misery Loves Company?\n\n**Scream**\n\n10\n\n9\n\n8\n\n7\n\n6\n\n5\n\n4\n\n3\n\n2\n\n1\n\n**Screaming continues**\n\nMe: *\"OMFG, they're ignoring it.\"*\n\n*Thanos snaps*\n\nScreaming stops, child to dust.\n\nMe to parents: *\"Next time check for defects.\"*",
            "title_similarity": "0.8552606",
            "sentiment_compound": -0.9648
        },
        {
            "id": "h5v08jh",
            "score": 1,
            "text": "I think your view is more biased and that you lack empathy more then they do. You literaly just chose the worst explanation there is, as if assuming that parents of \"bad\" children and also \"bad\" people.\n\nChildcare has been a group effort for many thousands of years, why should a parent of a child  try so hard to avoid \"misery\" others might feel for a few minutes?\n\nWhen these others get children, they will do the same, and it all evens out.\n\n&#x200B;\n\nMy child is not such, so far he has been suspiciously angelic. But if it does happen, I will for sure ignore it, as I don't mind crying, because by giving in to crying, bad habits for life might develop.",
            "title_similarity": "0.8478529",
            "sentiment_compound": -0.948
        },
        {
            "id": "h5v0xgg",
            "score": 1,
            "text": "Probably been said already but i imagine it's something akin to dog deafness ( dog owners just don't hear the barking the same way as their neighbours do).",
            "title_similarity": "0.6866026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5v15zw",
            "score": 1,
            "text": "Alot of parents have a \"we're all in this together\" attitude where, subconsciously at least, they view child bearing as fulfilling an obligation to society to maintain the population. In short, a good deed for the betterment of the species. Therefore, the larger group is expected to accept the inconveiences of small children. Which we do, most of us.",
            "title_similarity": "0.6952665",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h5v1a31",
            "score": 1,
            "text": "If I’m going out to a place I really want to be I have just as much a right to be there even if my kids being an ass. What I hate is parents that take absolutely zero care of said child and let him/her keep screaming. The fancy restaurant is not the place to let your kid “ cry it out” or the other bullshit excuses that parents use to defer their lack of care or experience with kids.",
            "title_similarity": "0.87445843",
            "sentiment_compound": -0.9174
        },
        {
            "id": "h5v1j7p",
            "score": 1,
            "text": "If you alleviate the child's boredom by moving them every time they make a ruckus, they will make a ruckus every time they are bored.  If you ignore the ruckus,they will learn it has no effect and move on to other strategies for dealing with their boredom.",
            "title_similarity": "0.77092993",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h5v32lx",
            "score": 2,
            "text": "I agree with you, most of the time they’re miserable that they have a kid in the first place and you know what they say misery loves company. It’s way better to live a PEACEFUL life and not have kids. nice bonus is that you’ll always have money and free time which is something people with kids never have.",
            "title_similarity": "0.7007963",
            "sentiment_compound": 0.891
        },
        {
            "id": "h5v4xa6",
            "score": 1,
            "text": "If parents left every time that happened, they’d never get anything done, bc it happens constantly, so there are times when they just have to finish their errand, even if the kid ain’t havin’ it.",
            "title_similarity": "0.75691473",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5v4xgn",
            "score": 1,
            "text": "Assuming you know what someone else is “secretly” thinking is generally a bad idea. You don’t know anyone’s thoughts but your own.",
            "title_similarity": "0.69028103",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h5v565n",
            "score": 1,
            "text": "Parent here. Did you ever think we are taking kids to restaurants so they can learn how they’re expected to behave in public? If they never go then how will they learn? I’ve never pulled my kid from a restaurant. I’m not sure when it would be appropriate. If they get loud? Bang their toy on a table? Like where are you out eating that this disturbs you so much? It’s not like people are taking  their kids to a fine dining joint. I think maybe OP might be the one that needs to stay home.",
            "title_similarity": "0.74087906",
            "sentiment_compound": -0.6258
        },
        {
            "id": "h5v5jr5",
            "score": 1,
            "text": "Or they are just hungry.",
            "title_similarity": "0.36881712",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5v6g3s",
            "score": 1,
            "text": "Nah they just dgaf.",
            "title_similarity": "0.082913354",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5v6zvq",
            "score": 1,
            "text": "Yea we (parents) don’t do it because we want others to suffer. We go out to restaurants to try and feel like normal adults again. Then when our kids start acting up we try what we can to calm them down but we can’t fully control them. \nEarly parenthood is not very fun. So we try everything we can (most of the time) to help keep them happy and “in-line”, but at the end of the day that little person gonna do whatever the f*** they want to anyways",
            "title_similarity": "0.8600849",
            "sentiment_compound": 0.7559
        },
        {
            "id": "h5v8dyr",
            "score": 1,
            "text": "I think it’s probably the parent crossing their fingers hoping the child will stop crying because the parent is tired or just not feeling like getting up lol",
            "title_similarity": "0.8270979",
            "sentiment_compound": -0.6224
        },
        {
            "id": "h5v9rx6",
            "score": 1,
            "text": "All I can say is, until you have a child, you will never quite understand. The things I have had to do for my son would have thrown my past self into a coma. Especially if the child has some sort of disability ( Autism, ADHD, etc.) But you sit in that concert while your child does their best to ruin it for everybody. At least I do. I take a redirection approach with my own child, but early on, I had no clue what to do. But neither did my son. You don’t come out of the womb knowing social cues. I have to force myself to take him into public, so I can teach him coping mechanisms for his autism, and teach him what is acceptable or not. And as with learning anything, it takes a lot of practice. So when the single woman behind me scoffs when my son yells at me that I am a “Stupid jerk”, I often do just let it happen. I’m still not going to buy him the toy car those bastards put next to the cash register. But I am also showing that I will not communicate with a belligerent attitude. And later when he has calmed down, I will break the situation down in a way that he can process. I don’t owe the woman behind me anything for her small moment of discomfort. I deal with it all day, every day. But my family still has to eat. And my son still needs his father to show him how to live and function in society. And I’m not going to give my son the reaction he wants in a public place for the comfort of people  around me. You get to walk away. I’m going to teach “MY” child in whatever way I can manage. If you feel I am wrong, maybe I can suggest having your own child. After years of lost sleep, worry, pride, and love, I would be interested in revisiting your opinion and discussing it further. If not, then please assess the parent as they are with empathy if possible. You have no idea the struggles they go through for their family, or what that person has to go through just to do a simple task with their child. Obviously my own experience is not a blanket statement for all parents. Bad parents exist. And maybe that screaming child has more going on in their life than what is immediately apparent. Life is not always so black and white. Anyways, that’s my shitty opinion. I hope it made some sort of sense. Take care.",
            "title_similarity": "0.800486",
            "sentiment_compound": -0.9286
        },
        {
            "id": "h5vafy2",
            "score": 1,
            "text": "I can 100% guarantee you that when a kid is acting like an asshole in a restaurant you are the last thing on that parents mind. Most kids start losing their shit mid meal, and they’re never going to learn how to act in public if you don’t teach them. And you can’t teach them by leaving them home. If you’re not exposing your kid to public situations they’ll never learn how to act and therefore act like assholes their whole childhood, possibly until they’re in their teens. \n\nI’d you don’t like it don’t go to family themed restaurants. \n\nLikewise in target, wal mart whatever. Sometimes it’s unavoidable. So you get your shit and get out as fast as you can.  We don’t all act perfect in publicly adults, we can’t expect kids to be perfect humans all the time.",
            "title_similarity": "0.80187136",
            "sentiment_compound": 0.4311
        },
        {
            "id": "h5vbnnx",
            "score": 1,
            "text": "As a parent, I got into the situation you described once. I was out shopping alone with my then 2yo for the first time. We got hungry and went to this little restaurant I‘ve been to so often (nothing fancy, just a quick homemade meal). And my toddler threw the most awful tantrum. Because there was only one radish in the salad we were sharing. I could have stopped it by asking for more radish, but that would just reward bad behavior. So I felt I had to sit it out, although I was dying of embarrassment.  \n\nWhen it happens the first time, you don’t have a strategy ready.  The situation is stressful for everyone.  \nYou can’t tell if a toddler is acting up for the first time, you just assumed the parents knew what they were getting into and are inconveniencing you on purpose.",
            "title_similarity": "0.6783855",
            "sentiment_compound": -0.8396
        },
        {
            "id": "h5vh5py",
            "score": 1,
            "text": "I once witnessed someone saying something to the mother of a long-term screaming child (maybe a year old) in a restaurant (all the rest of us were just keeping our heads down, pretending it wasn't happening). A bloke approached her and asked if she could do something about the noise, because he wanted to eat his lunch in peace.\nThe woman said something like this:\n\" I can't believe that you have the gall to complain, when you've only had this for an hour at most! I GET THIS FOR HOURS AND HOURS! I have this in THE MIDDLE OF THE NIGHT! Have you ANY IDEA what it's like for me? NO ONE asks if I mind about it! I didn't ask for this! Fuck off! FUCK RIGHT OFF!\"",
            "title_similarity": "0.6950289",
            "sentiment_compound": -0.8644
        },
        {
            "id": "h5vrmsp",
            "score": 1,
            "text": "I hope this isn't a view you got on the other sub, but its honest. Hopefully, I don't get evicirated for seeing both sides. I waited tables all through school and was more than annoyed at the messy, loud kids, and the parents who allowed the behavior. I have since gotten (a lot) older and raised my own kids. At least 10% of these parents are exhausted. Lost their fight for that day possibly. Have you ever felt exasperated? Defeated? Exhausted? I very much see how this annoyed you. What I don't understand is how you want compassion, but exhibit none. You speak of empathy, but lack it yourself. Everything isn't a malicious and planned out emotional attack. Give people the break that you may need, or have needed, one day. Just be kind. They may be going through a lot. We all know how that feels. ✌",
            "title_similarity": "0.8129502",
            "sentiment_compound": -0.935
        },
        {
            "id": "h5vslkm",
            "score": 1,
            "text": "Consider that the child has learned that screaming will get them out of a situation they don't want to be in. And now the parent has to unteach that. I hate that my kids behave like that in public, but they won't learn otherwise if I just drag them out of the situation every time they start screaming. They need to learn that it doesn't change anything.\n\n\"You're really upset that we can't go to the park, and right now we have to finish the grocery shopping.\"\n\nFor what it's worth. I'm sorry.",
            "title_similarity": "0.8849929",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h5vtmmd",
            "score": 1,
            "text": "Tell me you’re not a parent without telling me you’re not a parent.",
            "title_similarity": "0.53586876",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5vxblu",
            "score": 1,
            "text": "If you take a kid to a place and they scream, and you take them out... you will never get to go anywhere. You have to teach the kid that this is happening and they might as well shut up and find a way to enjoy it.\n\nThis has NOTHING to do with you as surprising as that might be.",
            "title_similarity": "0.7985349",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h5w0an2",
            "score": 1,
            "text": "I don’t WANT parents to take their child out.\n\nHaving a child is what changed my view on this. I was always so embarrassed when my kids started making a scene and tried to rush them\nout at first.\n\nBut after dealing with it and getting through that stage, I look at it completely differently. When I hear a baby screaming in a restaurant, I feel empathy. I feel bad for the baby and I feel bad for the parents. I don’t want them to feel embarrassed about it like I did.\n\nFurthermore… it’s not the right decision as a *parent* to take the kid out. You are teaching them that a tantrum gets them out of a situation that they don’t want to be in. That’s the opposite lesson you want them to learn.",
            "title_similarity": "0.9109439",
            "sentiment_compound": -0.9506
        },
        {
            "id": "h5w0hdu",
            "score": 1,
            "text": "Most parents I know would try to handle the situation there, then if it was not going to resolve itself, they would remove themselves.  I would argue that a lot of people with the OP's viewpoint, lack empathy and courtesy towards the children and parents.  At some point, we were all little kids, and I am sure caused some sort of a scene that others would rather not have dealt with.  Without the exposure to such situations, kids will not learn how to act and react in public.  It is not that the parents do not care, it is the fact that at times, we must all have to deal with it (to a certain extent) because kids do not arrive mature, and accustomed to social norms.",
            "title_similarity": "0.8725812",
            "sentiment_compound": -0.6052
        },
        {
            "id": "h5w4soi",
            "score": 1,
            "text": "Maybe off subject, idk but a few months ago my 2 year old was teething and we were in a restaurant. I took her outside and just walked around with her to help her calm down and find something to help. My wife apologized for the disruption to the couple at the next table and they bought our dinner as a surprise. What I’m getting at is as a parent it’s sometimes not reasonable to get up and leave a meal, in our case we were waiting for our food. As a parent who used to be annoyed as hell by yelling kids I did my part within reason to help resolve the situation short of some unrealistic expectation that I walk away from a $70 dinner to not inconvenience other people.",
            "title_similarity": "0.71491015",
            "sentiment_compound": 0.8725
        },
        {
            "id": "h5wcr2w",
            "score": 2,
            "text": "Maybee get a goddamn babysitter???",
            "title_similarity": "0.44593298",
            "sentiment_compound": -0.5632
        },
        {
            "id": "h5x1x0b",
            "score": 1,
            "text": "I think sometimes its hard to cope with kids and parents just try their best and cant always leave an area just because their kid may be having a bad day/moment. I wouldn't say its totally far for parents to have to leave a situation because of their children's actions. Sometimes there really is no other choice for the parents",
            "title_similarity": "0.8113557",
            "sentiment_compound": -0.3028
        },
        {
            "id": "h5x8483",
            "score": 1,
            "text": "I have to travel on a plane with a two year old next week. It might be brutal, but I don’t have an option. Also in the course of that trip I will have to take my child everywhere with me. Again, no option.",
            "title_similarity": "0.5716373",
            "sentiment_compound": -0.6542
        }
    ]
}