{
    "CMV: Penalizing an athlete for their natural-born advantages is highly unjust.\nI made the title pretty broad, but I am specifically referring to the cases where namibian athletes were [banned](https://www.cnn.com/2021/07/06/us/black-women-athletes-treatment-olympics-spt/index.html) from certain races because their naturally high testosterone levels. \n\nI've been mulling it over in my mind, but I just can't seem to find a reason why this would be fair. Athletics already are about natural physical advantages as much as it is about effort, and calling those advantages \"unfair\" for other athletes seems illogical and unfair. For comparison, [Michael Phelps](https://www.liveabout.com/michael-phelps-body-proportions-and-swimming-1206744#:~:text=Phelps%20Produces%20Less%20Lactic%20Acid&text=Most%20athletes%20need%20recovery%20time,a%20much%20faster%20recovery%20time.) has a near perfect body proportions for swimming and also produces less lactic acid, allowing faster recovery, but he isn't banned from certain competitions because it's unfair for other athletes. \n\nIt's just boggling my mind that any committee can think this is right. Am I missing something here?\n\nEdit: thanks for the responses everyone, and sorry I couldnt get to all of you. This was one issue that I didn't know would be so insightful and generate so much discussion.": [
        {
            "id": "h5xj2ki",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.\n\nThank you for understanding.",
            "title_similarity": "0.670082",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h5vzz3b",
            "score": -8,
            "text": "Unfortunately you have to set a limit, especially with women. It's nothing personal, they simply went over that limit",
            "title_similarity": "0.4919905",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5w9ycc",
            "score": 2,
            "text": "Not very familiar with the case you mentioned but I believe your base argument could be used to push for allowing men into women’s sports. \n\n“Why am I being banned from competing in the women’s division just cause I was born with the advantage of being a man?”\n\nBanning men from women’s events isn’t really fair either (to men) but the intention isn’t to be fair. It’s to foster a community and industry around these games. That means people want to compete in them and people want to watch them. In the extreme application of your argument (my understanding of it) men wouldn’t be banned from any sporting division and they’d outcompete women at every competition. That doesn’t sound very good for the community and industry. So we have an arbitrary rule for some competitions, no men, and now we’ve expanded the sporting community by a lot. \n\nTo take this back to banning athletes for more subtle natural advantages like high test, to me it links back to the original goal. Is it good for the sport as a whole? To be honest idk. It seems test limits were introduced in an attempt to improve the sport by applying a concrete standard that accounts for non cis women that want to compete while trying to limit abuse or something. It’s an arbitrary standard with probably good intentions, but perhaps some negative outcomes worth reviewing. If it bothers enough people it can always be changed for the future. After all the point of sporting rules is to create compelling competitions that keep people invested, not rigid fairness. \n\nYou can’t always please everyone.",
            "title_similarity": "0.82174104",
            "sentiment_compound": 0.9728
        },
        {
            "id": "h5xiiwm",
            "score": 4,
            "text": "Yikes what a pile of dog shit of a comments section.",
            "title_similarity": "0.4212365",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5w0l5n",
            "score": -7,
            "text": "Well, it's just fake news. \n\nIt has nothing to do with them being black. It has to do with their testosterone level being too high. \n\nAs far as the actual question, which is if women with testosterone levels that high should be allowed to compete in that competition, well, I believe they should, if that's how high their testosterone naturally is.\n\nThat's probably what the Olympics thinks too, they just didn't realize that women could have T levels that high when they made the rule about T levels for women. \n\nMen's T levels can't be that high in men's sports. It's because a certain level is considered impossible to obtain without cheating.",
            "title_similarity": "0.85811865",
            "sentiment_compound": 0.6278
        },
        {
            "id": "h5xi98d",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09334617"
        },
        {
            "id": "h5x9law",
            "score": 0,
            "text": "You are making the “natural advantages” argument. The problem with this argument is its’ internal consistency. Obviously sex is not a clean line, given the talented trans athletes who are competing. Any sex distinction is therefore arbitrary.\n\nSo the “natural advantages” argument would invite the conclusion that there should be one open division. This simply shuts out almost all women, though.\n\nWhere’s the line?",
            "title_similarity": "0.84792054",
            "sentiment_compound": -0.762
        },
        {
            "id": "h5w92ib",
            "score": 5,
            "text": "> naturally high testosterone levels\n\nWhere's the limit for what counts as \"naturally high\" and how would we be able to tell if someone was doping testosterone to come up right against that limit?\n\nAlso going from left to right- \n\nI recognize the lipstick, wasn't Gwen's controversy that she did a BLM thing and became more famous than the two women who beat her?  Feels like she did an action to draw scrutiny rather than caught shit for the passive trait of being black.\n\nI don't know who these other people are but going based on the pictures, they're transgender right?",
            "title_similarity": "0.81104696",
            "sentiment_compound": -0.1754
        },
        {
            "id": "h5vzml5",
            "score": -4,
            "text": "Penalizing athletes for using steroids because of the lack of natural born advantages is unjust.",
            "title_similarity": "0.7923855",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h5wgp7f",
            "score": 33,
            "text": "Michael Phelps is a bad comparison because he's competing in the category of \"be the best you can be without performance enhancing drugs or tools\". The women are competing in the category of \"be the best you can be without performance enhancing drugs or tools AND with a testosterone level below some value\". This category is commonly known as \"womens\" but that name isn't perfect because you can mentally identify as a woman with a testosterone level that would have you outcompete basically all women, and you would not belong to that category.\n\nYou could define \"women\" as XX chromosome, but that restricts XY women who took testosterone blockers from a young enough age, who should probably compete in the same bracket. And also XXY or various other intersex cases I know little about.\n\nYou could define \"women\" by their current genital setup, but that feels a bit arbitrary.\n\nYou could define \"women\" by giving them a survey of who they identify with and what gender they relate to in the culture they were raised in. That has tons of problems.\n\nSo it comes down to your definition of \"women\". The fairest one for competition seemed to be testosterone level, which sucks for these Namibian women who don't count as \"women\" by that metric.\n\nMaybe the whole idea of having a gender based or hormone level based category is flawed, but it seems important to a lot of people so there's no great option. I guess for these people it's like being just too heavy for a weight class in boxing. It sucks but there's not really a better solution.",
            "title_similarity": "0.8081398",
            "sentiment_compound": -0.9375
        },
        {
            "id": "h5whvwl",
            "score": 1,
            "text": "Are you against weight classes aswell?",
            "title_similarity": "0.39458203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5xhp9j",
            "score": -1,
            "text": "Western countries need to win all the medals /s",
            "title_similarity": "0.506623",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5wb01j",
            "score": -3,
            "text": "I believe that if women are born with a higher than average testosterone level, like in the case of these namibian women, they should be allowed to participate as women, because it is natural. However, if a trans women wanted to participate in women’s sports, it would be then fair to have a T-level cap for them. Trans women are women.",
            "title_similarity": "0.67560035",
            "sentiment_compound": 0.743
        },
        {
            "id": "h5wfcz2",
            "score": 39,
            "text": "This is a side effect of wanting to allow transgender athletes to compete with cisgendered opponents. If the delineation isn’t gender, it has to be something else. \n\nThe IOC has chosen testosterone to be that boundary, as it is the most important hormone in regards to strength development. And as a result you get stuff like this where natural born women with naturally high testosterone levels are deemed to have an unnatural advantage, even if common sense tells us that’s not the case.\n\nNow to be fair, they do have a solution, which is to allow the women to take medication to reduce their testosterone levels, but in any case, it’s damn near impossible to please everyone. Look at the flip side, if the IOC said “they were born women, so they can have a higher testosterone level” then the transgender athletes would question why they have to limit themselves to 5 nmol/L when it’s apparent that women can naturally have higher test levels.\n\nBut there has to be divisions, or else no woman, cis or trans, would be able to compete with men in athletic events. And if that division is not based on sex, it has to be based on something else that would allow women to compete on an equal playing field.",
            "title_similarity": "0.8259171",
            "sentiment_compound": 0.84
        },
        {
            "id": "h5war9h",
            "score": 2,
            "text": "It would be nice if we could separate naturally high testosterone from people who are simply cheating, but it's very difficult to do that. Furthermore, this is much more of a concern when it comes to women's sports, because at some point we have to make a distinction about where the cutoff for women's sports is and why it's important for women's sports to even exist in the first place. Allowing a genetic man to participate in women's sports because his penis never formed due to his androgen resistance is kind of sketchy in my opinion.",
            "title_similarity": "0.85008353",
            "sentiment_compound": -0.4385
        },
        {
            "id": "h5x8jgb",
            "score": 1,
            "text": "The whole point of having women's competitions in the first place is to penalize competitors with natural-born advantages (i.e. men) by excluding them. And if you're going to have women's competitions, then you have to draw the line between who is a man and who is a woman. For 99.9% of people this is clear cut, but there are certain people who blur the line between who is a man and who is a woman. Trans people occupy this space, but this issue is really entirely separate from the \"should transwomen be allowed to compete in women's sports\" debate.\n\nTake Caster Semenya as an example. She is biologically XY (male) with all the hormones and natural-born advantages associated with being male. But she was born with (what looks like) a vagina, so she was raised as a girl and nobody ever really thought about the issue until she started developing in a masculine direction. Through the benefit of her male physiology, she was able to dominate the women's competitions that she entered.\n\nWhen you get down to it, there are many methods which could be theoretically used to define who is eligible for women's sporting events, which each have their pros and cons:\n\n* Female genitalia\n* Self-identity\n* Whether the individual was raised as a woman\n* Female genetics (i.e. XX)\n* Hormone levels\n\nCaster Semenya would qualify as a woman under the first three checks and not under the last two. I think most people initially gravitate towards the 4th check (genetics) - which, again, would disqualify Semenya - but I feel the 5th one (hormones) is superior. First of all, there are many edge cases with testing genetics - there are XX and XY people yes, but there is also X0, XYY, XXY, etc. Yes you could go in and define these unusual chromosome make-ups as male or female (e.g. X0's count as female, XYY's count as male), but it's not always super clear which decision to make. With hormone levels you can make a clear distinction. And besides, imagine if Semenya were the same she is but had low male hormone levels - then she would have no advantage so the need to exclude her wouldn't exist. And finally, under the hormone system athletes like Semenya have a recourse - she can use medication to lower her male hormone levels - that wouldn't be available under a pure genetics system.\n\nAlternatively, if you used one of the first three systems (genitalia, self-identity, or birth identity) you'll end up having to do embarrassing inspections or having a system that is open to being gamed, or where \"ordinary\" women can't compete because they'll be in competitions that are dominated by competitors with male physiologies. Again - if you wanted to force women to compete against men then you could just abolish gender based divisions in sports, but obviously that would virtually eliminate any possibility for women to compete in sports at all.\n\nFinally, I think the Michael Phelps comparison is not the same. Male events are essentially open events - women may technically be barred but they wouldn't have been competitive anyway. When Phelps swam he was competing against the best swimmers in the world, period. The goal is to find the best swimmer overall, not the best swimmer who satisfies certain criteria.",
            "title_similarity": "0.85227704",
            "sentiment_compound": 0.9803
        },
        {
            "id": "h5w9mx6",
            "score": 111,
            "text": "I think what you're missing is that these athletes are intersex. These women were XY embryos that didn't develop correctly and their particular natural-born advantage is related to them having partially male biology.\n\nBeing male vs female is an actual regulation in the competitions, while body proportions or lactic acid production are not, which is why their advantage may be viewed as disqualifying, while Phelps' advantages would not be.",
            "title_similarity": "0.7800856",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5x65ic",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.09334617"
        },
        {
            "id": "h5w51zp",
            "score": 405,
            "text": "The separation between men and women in sport exist to allow half the humanity (give or take a few percent) to have a competition they can compete with opponent with roughly the same predispositions and champions they can identify this. So the first question is: do you understand why it exists and agree that it's required in sport?\n\nIf you understand and do agree that men and women needs separate categories, then a line must be drawn somewhere. Now I don't know if you have a better suggestions but a testosterone limit makes a lot of sense because testosterone is a hell of performance booster. \n\nFinally it's true that it might feel unfair for women with hyperandrogenism or different condition that boost testosterone but the comparison with Michael Phelps doesn't work because there's no risk of clone of Phelps dominate sports because: (a) he's more like a one in a billion exception (b) he's made for swimming and not for other sports. Women with higher testosterone level are (a) not one in a billion exceptions but more like 1% (b) testosterone boost performance in all sport and cannot be anticipated by competitors. In other words: high testosterone level is too frequent and powerful in all sports to be ignored.",
            "title_similarity": "0.72598135",
            "sentiment_compound": 0.9319
        },
        {
            "id": "h5wpadk",
            "score": 0,
            "text": "If their testosterone levels are natural, they have to allow them.  They are not controlling for other types of physical  advantages so they shouldn't control for this one. \n\nThe case for allowing trans athletes means, as I understand, that they have to comply for certain testosterone levels for a given period of time. I don't see why they have to set a maximum testosterone limit if it's natural.",
            "title_similarity": "0.69116056",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h5wrzrq",
            "score": 0,
            "text": "Its about policing women's body, the usual patriarchal by. You don't ban men for high levels of estrogen",
            "title_similarity": "0.6405443",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h5wtx22",
            "score": 0,
            "text": "I had this discussion/argument with a co-worker a while back. He believes the sanctioning body must do something about the \"unfairness\" of the high levels of testosterone giving female athletes an advantage. I collected some historical data of records set in global.competition. None were set in any competition they competed in. If I recall correctly the records were not in any danger of being broken. After doing a little more research it became obvious the only team/athletes/country complaining were from Europe, Britain I believe. This was just a few years ago so perhaps this is no longer true and these female athletes with high T are smashing records but I don't believe that to be true. I know the Trans issue is out there and is being debated but I believe if the high T is naturally occurring then there should be no issues.",
            "title_similarity": "0.7972523",
            "sentiment_compound": 0.0701
        },
        {
            "id": "h5wuck6",
            "score": 0,
            "text": "You could use the same argument to argue against sex divisions in sports.\n\nLike it's fine either way, just understand that the only reason to do it one way or another is because you want to. There is no \"correct\" way to do it.",
            "title_similarity": "0.7501349",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h5wxpoh",
            "score": 0,
            "text": "The largest natural born trait that we currently discriminate against in sporting competitions is sex. The logical consequence of your position is to say that it is unjust to have separate men's and women's sports leagues, and we should just have one league that anyone can compete in. \n\nIs that your position?",
            "title_similarity": "0.78646755",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5x0jlh",
            "score": 0,
            "text": "This is not necessarily an argument against you, but this applies to trans people as well, more especially post op and on estrogen. They didn’t control the fact that they’re trans, and there it’s not too large of an advantage especially considering how few trans people are in the world.",
            "title_similarity": "0.65758336",
            "sentiment_compound": 0.6913
        },
        {
            "id": "h5x4gfs",
            "score": 0,
            "text": "This reminds me of how Simone Biles gets penalized for being too good. It’s crazy",
            "title_similarity": "0.6771463",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5x6slf",
            "score": 0,
            "text": "On the flip slide, *rewarding* athletes for natural born advantages is also of no interest to me. Who cares if you were born with more testosterone? There’s a case to be made that banning steroids prevents those with more heart, intelligence and work ethic but less testosterone from competing.\n\nI’m not sure if I am really trying to change your view here, but I suppose I am questioning the premise of fairness to begin with.",
            "title_similarity": "0.80108595",
            "sentiment_compound": 0.7187
        },
        {
            "id": "h5x77ql",
            "score": 5,
            "text": "It’s such a tricky situation. Castor Semenya (who grew up wearing a boy’s uniform to school - is that true?) finding out that they are Male after all (internal testes) at the same time as the rest of the world must be so humiliating.\n\nWhat’s the fair thing to do?\nWe can’t have another Rio situation where all 3 athletes  on the women’s race podium are Male.\nThey are being given the opportunity to take the pill to drop their testosterone levels. Some refuse.\n\nIt wouldn’t happen to althletes from countries with better healthcare from birth. And the talent scouts/ agents etc do seek these individuals out to make money from them. And it’s an income for the families too\nSad all round.",
            "title_similarity": "0.8188343",
            "sentiment_compound": 0.4756
        },
        {
            "id": "h5x7fl8",
            "score": 0,
            "text": "It may be unfair to the women that are banned, but it would also be just as unfair to the women they would be competing against. \n\nCompare the 400m times done by the 18 year old Namibian athletes to an athlete of Allyson Felix’s caliber and you will immediately notice the competitive advantage. \n\nI personally think there should be an intersex category within all sports where these athletes are allowed to compete and aren’t excluded from their sport of choice.",
            "title_similarity": "0.7706449",
            "sentiment_compound": -0.775
        },
        {
            "id": "h5x8v73",
            "score": 0,
            "text": "It is unfair in terms of biology if I am understanding this correctly.",
            "title_similarity": "0.57670176",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5xghxy",
            "score": 0,
            "text": "This is a super difficult topic to find the correct solution too. At the same time to make sport fair for all and have good competition you can’t just have no rules in place to help facilitate that. If somebody’s genetic advantage makes enough of a difference that it crushes all other competition that I think it should at least be investigated.",
            "title_similarity": "0.79133576",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h5xiey6",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09334617"
        },
        {
            "id": "h5xigme",
            "score": -4,
            "text": "Those Namibians you are talking about. They are either biological males, or taking massive amounts of testosterone / steroids. No biological woman has those levels of testosterone naturally.\n\nTransgender women have a biological advantage athletically over real women. Different bone density, higher muscle tones, wider shoulders, better hips for running, like 10+ times the grip strength.\n\nAccording to transgender ideology any biological male who says \"I am a woman now.\" Is instantly a woman. This is entirely unfair for real women who work very hard for their place in athletics.\n\nYou could take any bench warmer in the NBA then stick a wig on them have them say \"I'm a woman now.\" And they would DESTROY all WNBA records and be the MVP dominating everyone more so than Micheal Jordan ever did.",
            "title_similarity": "0.78438705",
            "sentiment_compound": -0.2309
        },
        {
            "id": "h5wfvx1",
            "score": 13,
            "text": "The gender categories are defined by sex hormones in the Olympics. \n\n\n\nThere isn't an \"arm length\" or \"lactic acid production\" category in the Olympics",
            "title_similarity": "0.58535063",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5wdc1t",
            "score": 1,
            "text": "I think the limit for testosterone should be the natural women with highest levels of testosterone in their blood. That's probably how it's gonna work best.",
            "title_similarity": "0.5279039",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h5wh5ib",
            "score": 1,
            "text": "\"Naturally high testosterone\" is begging the question (i.e., circular logic).  There's a limit to catch cheaters who artificially raise their testosterone, & for no other reason. If she's been barred it's because they think she's cheating, based on her tested level exceeding what they decided-in-advance could plausibly be a natural level. What on earth does that have to do with being black?\n\nIf it truly is her natural level, then everyone would agree it's unfair to her. But there has to be a limit set somewhere, otherwise all the female athletes will be artificially raising it (as it is, they (meaning most top female Olympians in sports where it would make a big difference) surely are, but just doing their best to stay under the limit.  & this woman probably is only different-than-others in that she went slightly over).\n\nTo clarify, just like the Men's cycling tour-de-France nonsense, I don't think you can approach the top level in a women's strength sport without doing everything possible right-up-to-the-line-of-getting-caught to gain strength. So actually none of these athletes who have any chance of placing have \"natural\" levels of testosterone, unless raising testosterone is not part of the current doping state-of-the-art.",
            "title_similarity": "0.8444834",
            "sentiment_compound": 0.9866
        },
        {
            "id": "h5wjq71",
            "score": -1,
            "text": "It seems like testosterone levels are the only way to allow trans athletes to compete, since the male/female category is no longer based on being biologically male or female. Unless you know a better distinction between men and women (that's not biological sex) then testosterone seems to make sense if you want to include trans people.\n\nFrankly, I think that the solution to this would just be to have transgender people compete in their own category rather than making biological females be kicked out of their own class, but that perhaps wouldn't be as inclusive.",
            "title_similarity": "0.7499534",
            "sentiment_compound": 0.5187
        },
        {
            "id": "h5wmrsx",
            "score": -1,
            "text": "Think of it this way:\n\nIf there were a breath holding competition and people from an ethnic group that has lungs twice the size of everyone else wanted to compete, they'd win every time, so if you allow them to compete, you defeat the purpose of the competition. If the naturally testosterone laden Namibian women were allowed to compete, they would demolish everybody else in the competition, every time, and then it's no longer a competition.\n\nThis actually seems kind of like a no brainer to me tbh",
            "title_similarity": "0.7993281",
            "sentiment_compound": 0.1952
        },
        {
            "id": "h5wnfjg",
            "score": -1,
            "text": "With a more complicated definition of gender than we’ve had in the past, how do we separate male/female sports? \n\nThe only fair way is really to put a cutoff on testosterone level as it’s the male sex hormone.  \n\nThe cutoff they use is 114 ng/dL… most adult women’s T levels range from 8-60 ng/dL [[Source]](https://www.mayocliniclabs.com/test-catalog/Clinical+and+Interpretive/83686). That means the cutoff is nearly double the T level of even the highest 10th percentile of women. \n\nThey need to cap it somewhere, 114 ng/dL isn’t even on the spread for T levels in women so it’s honestly a very reasonable place to set the cutoff. \n\nThis high of a cutoff likely only excludes 0.0001% of XX chromosome women, and transgendered women who refuse to take medication to reduce testosterone. \n\nI’m not even going to argue performance advantages because it really doesn’t matter… *IF* we only have a male/female division, there needs to be some non-arbitrary value we use to separate them. \n\nEdit: took out performance argument. Also, the article you linked says 5 nmol/L, elsewhere I’ve seen 10 (288ng/dL), which is actually the level that a fair amount of men have.",
            "title_similarity": "0.7109865",
            "sentiment_compound": 0.6887
        },
        {
            "id": "h5x3zau",
            "score": 1,
            "text": "It's almost like sports are inherently a test of unfair advantages and disadvantages lol",
            "title_similarity": "0.55369365",
            "sentiment_compound": 0.1796
        },
        {
            "id": "h5xdluw",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09334617"
        },
        {
            "id": "h5xixiw",
            "score": 1,
            "text": "To be fair high Testosterone in men or women is a sign of juicing or steroid use…. This can easily be cleared up by keeping up on blood tests from your Doctor and should be done if your a serious athlete.",
            "title_similarity": "0.58464587",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5w6fh7",
            "score": 2609,
            "text": "This is an unintended consequence of the trans athlete debate.\n\nThere has to be some delineation between the competitors in the male and female divisions. If the limiting factor isn't going to be sex, then some other limit must be set.\n\nTestosterone was selected because it allowed for trans athletes to compete in their preferred divisions as testosterone can be medically adjusted.\n\nThat being said, I'd much rather see the Namibians compete than Laurel Hubbard.",
            "title_similarity": "0.7927308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5wqfoz",
            "score": -2,
            "text": "It makes sense for black people to be approved for better caps if some low level testing shows they provide no clear advantage. Such test of resistance through water should be relatively easy for the right lab. For reliable results no humans would be involved in the test.\n\nSport governing bodies should never penalize levels of natural human hormones, but I imagine because so many testing bodies have been fooled by so many athletes in the past they question all high readings, they should be skeptical, but also fair.\n\n\nThere is no doubt some of our most outstanding athletes naturally have had more testosterone production. \n\nLooking at the unusually pronounced jaw lines and brow lines of many on the various (pre-artificial steroids) 1950’s football All-American teams will make that clear.\n\n\nNote-It stood out to me on OP’s post that a link to CNN’s reporting, showed CNN’s agenda driven reporting is always present.\n\nIn the segment on a black British swimmer being denied the use of the swimming cap by an international organization, they questioned if it was racism or not. Fair enough.\n\nBut-\n\nThen to tie a history of racism and past history together they started discussing American swimming pools and black people. \n\nThis (Lame/ Brilliant) CNN reporter managed to cram the below bad America storyline in on a story about a dispute between a British swimmer and an international swimming committee.\n\n>Swimming pools have been historically linked to racial disparities in America. In the 1920s and 1930s, public pools in the United States were mostly segregated, leading to many Black Americans not learning how to swim.\n\n>The USA Swimming Foundation says nearly 64% of African American children don’t learn how to swim, compared to 40% of White children.\n\nAmazing.",
            "title_similarity": "0.8225291",
            "sentiment_compound": -0.7734
        },
        {
            "id": "h5x0cio",
            "score": 2,
            "text": "Like, I don't disagree, but taking your method to its natural conclusion is just one contest for everyone, and then no woman will ever win most competitions (some gymnastics aside), which would suck. Men are naturally bigger, stronger, faster... What we need is fairly equal contests with some arbitrary dividing lines that disadvantage the least people, not fully equal, undivided ones.",
            "title_similarity": "0.7492089",
            "sentiment_compound": 0.5916
        },
        {
            "id": "h5x51gk",
            "score": 2,
            "text": "The way I see it is if you are born a woman you should be able to have as much testosterone as you can naturally produce. If you are trans and want to compete in women’s events then you can limit the testosterone the are allowed yo have. This is like penalizing athletes for being too tall or having longer arms or legs or anything that allow them to have an advantage in their sport. If you are going to limit the testosterone of a woman to make things fair then why stop there lets limit height and other proportions which people have no control over so we have true fairness.",
            "title_similarity": "0.7665446",
            "sentiment_compound": 0.7693
        },
        {
            "id": "h5wxd2h",
            "score": 27,
            "text": "I think you are missing the point that many people have tried to put across. People with high testosterone are not banned from sport, they are denied entry into a special category of people with a low level of T. Tall basketballers, big lungs and Phelps are irrelevant. If society cannot agree sensible rules to define fair female only competition , the female only category will disappear completely and men will win everything. Compare your arguments to weight categories in all fighting sports: It’s not fair that this heavyweight competitor can’t enter the lightweight completion. It doesn’t give them an advantage, they aren’t heavy on purpose, it’s just who they are… it’s all nonsense.",
            "title_similarity": "0.8113363",
            "sentiment_compound": -0.6996
        },
        {
            "id": "h5w5f4o",
            "score": 11,
            "text": "The Olympic Committee sets down a range of T levels that it considers to be normal for human males amd females because it wants to level the playing field and discourage doping. But  testosterone levels can be manipulated by means other than getting injections. \n\nAs a gross example, if an athlete with a high t level lives in an area that has environmental conditions that promote production of testosterone (something in the water), and their identical twin with a low t level does not and who lives elsewhere it can be argued that the first athlete's t level is artificial.\n\nModern athletics are pushing up against the  theoretical limits of human performance. Runners are not going to get any faster. A baseline for what constitutes \"normal\" has to be set somewhere.",
            "title_similarity": "0.8048015",
            "sentiment_compound": -0.8898
        },
        {
            "id": "h5wh8me",
            "score": 295,
            "text": "One could argue the whole reason for having men's vs women's sports was to level the playing field for the anabolic and strength advantages of testosterone. \n\nPerhaps it is outdated to use gender and the two groups can be defined by T levels. If you have a natural advantage then it's fair to compete with others with the same advantage; so people born without the advantage have a shot. \n\nJust like most combat sports where weight is an advantage. You can only compete within your own weight class.",
            "title_similarity": "0.76303995",
            "sentiment_compound": 0.8994
        },
        {
            "id": "h5wnoz5",
            "score": -2,
            "text": "Every human being should be able to compete on the same field regardless of race, gender, or any other predisposition. That’s why the kiddie league for females is embarrassing.",
            "title_similarity": "0.61363304",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h5wioua",
            "score": 36,
            "text": "If you read the article you posted, or other more detailed sources like [this one](https://www.sportsintegrityinitiative.com/dsd-regulations-call-out-athletes-as-biologically-male/) you will see that the regulations that these two women are subject to is *only* for athletes with DSD, meaning differences of sexual development. That is to say that neither of the women you mentioned are XX females and their testosterone levels are only “naturally high” because they’re physiologically male. Specifically to be subject to these testosterone regulations they must have one of these 5 conditions: \n\n 5α-reductase type 2 deficiency;\n\n• partial androgen insensitivity syndrome (PAIS);\n\n• 17β-hydroxysteroid dehydrogenase type 3 (17β- HSD3) deficiency;\n\n• ovotesticular DSD; or\n\n• any other genetic disorder involving disordered gonadal steroidogenesis.\n\nFrom the author of the regulation\n“‘The DSD Regulations do not apply to 46 XX female athletes, none of whom (even those with polycystic ovary syndrome) would ever have testosterone levels above 5nmol/L’, wrote a World Athletics spokesperson in an email. ‘These 46 XY athletes have DSDs which mean that their testes are internal, and their lack of male external genitalia caused them to be assigned a female gender rather than male gender at birth. ‘From puberty onwards, their internal testes produce the same levels of testosterone (7.7 to 29.4 nmol/L) as are produced 46 XY males who do not have DSDs. And provided they have functioning androgen receptors, and so their bodies are able to utilise that testosterone (another condition that has to be met for the DSD Regulations to apply), those male testosterone levels give them exactly the same physiological advantages over 46 XX females as the 46 XY males without DSDs enjoy.’”",
            "title_similarity": "0.7835947",
            "sentiment_compound": -0.3687
        },
        {
            "id": "h5wasrg",
            "score": 3,
            "text": "/u/RedFanKr (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/oo6hna/deltas_awarded_in_cmv_penalizing_an_athlete_for/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5260507",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5w6z5o",
            "score": 737,
            "text": "Consider the case of Caster Semenya. She lived and was raised female and presents as female with external genetalia, but when the Olympics shifted from the \"pull down your pants\" method of sex testing for elligibility in female only competitions to DNA testing, she learned she was XXY, and had a gene that's associated with higher testosterone levels. She was subsequently suspended. At the moment, the testing process for testosterone is the ratio of testosterone to epitestosterone, and she failed that test. What determines a normal level of testosterone? How does one distinguish between a naturally high testosterone to epitestosterone ratio from an enhanced ratio? For natural competition, there must be a line somewhere, so how do you determine where that line is and the edge case of a natural athlete being past that line?",
            "title_similarity": "0.7863604",
            "sentiment_compound": -0.5632
        },
        {
            "id": "h5wkjre",
            "score": 232,
            "text": "I think that the verbiage \"naturally high testosterone levels\" is misleading. It leads people to think that these are typical women who simply have high-testosterone level. Women with PCOS for example, can have testosterone levels that are 5x that of a typical woman.\n\nHowever, the rule that is preventing the Nambian runners (and others) from competing in the Women's division only applies to athletes with differences of sex development (DSD). This is a wide category for people who do not have typical male/female development and/or gonads. In the case of Castor Semenya, she is a 46XY individual that has external female genitalia but also has internal testes. DSD individuals can have testosterone levels that are comparable to a typical man for their entire lives. Semenya's \"natural-born advantage\" isn't an anomaly like Phelps's, as every typical male has XY chromosomes and testicles. The \"advantage\" she has is from competing only with women who typically do not have testes and do not go through male puberty.\n\nIn a nutshell, the IAAF has been trying to construct regulations that respects athlete's gender identities, while reconciling the fact that they have XY chromosomes, and typical male development.\n\nCheck out the 800m final at the 2016 Olympics in Rio. Gold, Silver, and Bronze, went to individuals who have expressed either directly, or indirectly that they would be affected by the DSD rule.",
            "title_similarity": "0.76734596",
            "sentiment_compound": 0.358
        },
        {
            "id": "h5xg98m",
            "score": 19,
            "text": "I agree. But (and this is very big but)...\n\nThe uncomfortable and usually unstated truth about women's divisions in most sports is that they are a protected division. The same way we have age groups for youth and senior athletes, and we have weight classes in combat sports, and we have disability classes in parasports, we have women's divisions to account for the fact that female bodies have many physical disadvantages vis-à-vis males when it comes to sports, and women and girls are also at a sociological (and perhaps psychological) disadvantage much of the time. The men's division is de facto an open division. We don't cal it that out of an unspoken sense of gender equality, but the trans athlete controversies of recent years have made it clear that we need to start calling the open division what it is. \n\nWith that in mind, it is obvious that the whole point of women's divisions is not fairness--it is about unfairly excluding people for the benefit of a group who otherwise couldn't compete. It is about creating a space for women by excluding others. Exclusivity is *desirable*, in order to make competitive sports accessible and enjoyable for women. Trying to be inclusive by allowing \"edge cases\" (trans women and women with male-like bodies due to hormonal differences) undermines the whole point of having women's divisions. Those people should of course be allowed to compete in the \"open\" (men's) division, but should not have access to the exclusive-by-design women's division. Sure, most of them won't be able to compete at that level--but most men can't either, so what?",
            "title_similarity": "0.76083493",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h5xb40r",
            "score": 31,
            "text": "This is unique to women's sports.  Let's discuss what that means.\n\nAlmost all sports have an \"open\" division where anyone can compete.  This is often colloquially called \"mens\", but most sports don't actually have that rule.  It's just OPEN.  Now men compete in it almost all of the time, but it's rarely exclusive.  Elite female golfers, hockey players, and runners have come *close* to competing with men at top tiers of sport, but that's a pretty wild exception when it happens in most cases.\n\nMost sports then say .....  hmmm it's unfair to ask women to compete in the open competition, so we will create a special category called \"women\" to allow them to compete fairly.\n\nThis category needs a defining characteristic.  A definition of what allows someone to compete.  Easy, right?   Womanhood.  \n\nThat was no big deal until society realized there were blurry lines in that definition, so arbitrary rules have to be created.\n\nNo matter what you do, it IS ARBITRARY.  Obviously someone who changes their gender on a drivers license, but is physically, biologically and hormonally male is at an extreme advantage.  They will be prohibited by most reasonable arguments.   So the \"what's my gender on a passport\" line is probably out of the question.\n\nSo what's the line then?\n\nMany sporting organizations choose a testosterone level as that line.    It's the most reasonable and fair way to have a special competition category for women that's fair and equitable.  Some choose chromosomes (and in that case, people born XY like Caster Semoyna are excluded), but this also prohibits trans people and that's not popular... so then what?   After hormone therapy, right?  Some period of having sufficiently low hormonal levels?",
            "title_similarity": "0.627418",
            "sentiment_compound": 0.9506
        },
        {
            "id": "h5wjazi",
            "score": 1,
            "text": "Just saying, but there are also neuroendocrine tumors and other endocrinic conditions that can cause someone to have absurdly high levels of androgens e.g. women with higher levels of test than the top 1% of males etc.",
            "title_similarity": "0.5779989",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5wktsq",
            "score": 1,
            "text": "https://en.wikipedia.org/wiki/Harrison_Bergeron",
            "title_similarity": "0.15640864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5wl7mw",
            "score": 2,
            "text": "Creating categories to compete within, done well, generates better competition. I'd like to see wrestling style categories brought into more sports. I think it's an answer to creating fair competition with trans athletes that will benefit the sports by giving excellent competition that encourages athletes to compete based on technique at least as much as natural prowess.",
            "title_similarity": "0.6115869",
            "sentiment_compound": 0.9769
        },
        {
            "id": "h5wmhjh",
            "score": 3,
            "text": "Testosterone is a steroid. It is actually one of the most common doping strategies today specifically because it's hard to prove that it's not natural (or that you didn't get it from \"beer and sex\"). While I think the rule is miss guided, there is merit in saying you can artificially lower your natural testosterone levels",
            "title_similarity": "0.77410626",
            "sentiment_compound": -0.0026
        },
        {
            "id": "h5wmj2b",
            "score": 1,
            "text": "After reading OP and responses, should we not instead have something similar to weight classes in boxing/wrestling? \n\n&#x200B;\n\nThat solves a whole plethora of problems for them and genders actually interact. Testosterone ranges could be their own groups. Male/female divide would naturally occur for ***most*** men and women. This would also mean we could allow \"cheating\" brackets where people with high levels, unnatural or not, get to compete. Then, there's not penalization. Everyone gets to compete.",
            "title_similarity": "0.7518568",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h5wqd0f",
            "score": 1,
            "text": "The justification provided when the rule was enacted is comprehensive and based on evidence. If that doesn't change your view, I doubt anyone here can: https://www.worldathletics.org/news/press-release/eligibility-regulations-for-female-classifica",
            "title_similarity": "0.59041154",
            "sentiment_compound": -0.128
        },
        {
            "id": "h5wreq3",
            "score": 1,
            "text": "My comment is pointless since I just want to say I agree with you. Part of being an athlete is luck other than excercise. You can play basketball every day for 10 years but you'll never be better than Michael Jordan or Kobe Bryant if you are 5'4. The genetic lottery is part of what makes you a good athlete or a smart person",
            "title_similarity": "0.61315715",
            "sentiment_compound": 0.8356
        },
        {
            "id": "h5wst05",
            "score": 1,
            "text": "Competitive sports are never going to be completely equal. People should just grow up and stop competing in sports.",
            "title_similarity": "0.6271332",
            "sentiment_compound": -0.128
        },
        {
            "id": "h5wtbah",
            "score": 1,
            "text": "Isn’t one of the points of athletics to demonstrate what people can accomplish? If you tie this up with some bureaucratic nonsense your just forcing people to join you at the losers table. Everyone loses.",
            "title_similarity": "0.70734",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5wu0ah",
            "score": 1,
            "text": "Athletic competitions are stupid, and \"fairness\" in them is unattainable.",
            "title_similarity": "0.6412992",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5wvazi",
            "score": 1,
            "text": "The science of hormones basically dictates that the quantity of testosterone and anabolic compounds directly ties to recovery of athletic stress. Thus the quality of the average athlete is directly correlated to hormones and neurophysiology",
            "title_similarity": "0.6164027",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h5x12co",
            "score": 2,
            "text": "I see a lot of people comment here that there needs to be a line of what defines \"women's\" sports which is fair enough but in the case of athletics (track and field) it seems arbitrary at best and targeted at worst. The rule applies to distances 400m to 1600m if there's a line to be applied based on T levels shouldn't it be applied across the board? Furthermore in the case of the Namibian athletes and Caster Semenya their performances while significant in women's athletics would not even register at the high school boys level. So if these athletes under no limitations register performances consistent with what we see from elite female athletes and there's no reason to believe they've come by their performances through artificial means. It becomes difficult to take their bans at face value. Once again in the examples above not a single one of these athletes hold the world record in their respective events. Not one of them has performed anywhere near the men's level. Of course a decision needs to be made but as far as I can tell there's not really enough data to make the determination that IOC has unless they are willing to argue that all performances better than these hyper androgenous athletes were achieved either by other high in excess of \"normal\" testosterone athletes.",
            "title_similarity": "0.8261952",
            "sentiment_compound": 0.7391
        },
        {
            "id": "h5x1dux",
            "score": 1,
            "text": "It’s utter sexist bullshit",
            "title_similarity": "0.44168347",
            "sentiment_compound": -0.6222
        },
        {
            "id": "h5x3j62",
            "score": 3,
            "text": "In my view, the issue here is the difficulty of coming up with rules for athletes that can preserve fair competition that are evenly applied to everyone. The reason we traditionally had a differentiation between men and women’s sport is because men have different characteristics than women do that give them distinct physical advantages in many types of sport (e.g., higher bone density, different bone structure, muscle mass, etc.). If we didn’t differentiate between the two groups, then women would get dominated by men in most competitive sports and there would be little incentive for women to compete because they’d have no realistic chance of winning. Of course, these are all general statements and I’m not trying to say that some random dude off the street is capable of running a 100m sprint faster than the female gold medal winner at the Olympics, that’s obviously not true. But if you look at the performance of all of the male Olympic competitors in the 100m sprint, even the worst of those competitors will set a time that’s above or near the women’s world record time due to these inherent biological advantages. Obviously, we don’t want a situation where a female athlete trains for years to the peak of her abilities just to lose in a competition to someone who didn’t train as hard but wins simply due to an inherent biological advantage, so we segregated sports based on sex to preserve *fair competition*. This is the same reasoning behind banning athletes’ use of performance enhancing drugs. \n\nOk, that’s all well and good but what about trans and intersex athletes? Don’t we want them to be able to compete too? Yes, of course we do. But we also want to be inclusive in how we do so (I.e., by not using biological sex as the determining factor) and also come up with a set of rules that preserves fair competition for all competitors. So how do we do that? Well, rather than differentiating based on what we observe (men tend to perform better than women do), we instead look to the source of that differentiation. As it turns out, one of the main driving forces in the disparity is testosterone levels. People with higher T levels have much higher physical performance (due to a variety of things that T-levels affect), and men have way higher testosterone levels than women (it’s not even close, even a man with extremely low T has higher T than a woman with extremely high T), so it makes for a pretty good metric. The advantage of using T-levels to differentiate is that it looks to the source of the performance gap, so it allows us to differentiate between, for example, a M2F trans person who transitioned years ago and has been on hormone treatment for a long time (eliminating the biological advantages from once high T-levels) and an M2F person who was a top-level athlete per-transition who only transitioned two weeks ago (and so still retains many of the physical advantages from their pre-transition biology). It also allows us to differentiate between different types of intersex people (it’s far more complex than just Xs and Ys, there are an enormous variety with different characteristics out there) as well. And best of all, this means that everyone gets to compete against people with similar baseline physical advantages to themselves, so no one feels like they’ve trained for their entire life just to lose to someone whose inherent physical advantage is so strong that it’s impossible to overcome. \n\nUnfortunately, the T-level system has a few drawbacks, one of which is that a line has to be drawn somewhere. With any set of universally applied rules, there will be people that end up on what is arguably the “wrong” side of the line, as you noted with the Namibian athletes in your post. The problem is that if you start making case-by-case determinations, you’re going to end up with a bunch of athletes complaining about unfair treatment (why did you let X compete in Y category but not me?) and a bunch of competitors complaining about unfair treatment in the opposite direction (why did you put X in the Y category, it’s unfair to make me compete against X because X has an unfair advantage over the rest of the Y category competitors). And that’s saying nothing of the inevitable politicking and back room dealing that’s going to infect every one of these case by case determinations. That’s not to say that the precise spot the line is currently drawn at is the “right” place, this is a relatively new rule set and there’s always room for reevaluating and modifying the rules over time to try and create more fair results, but a line has to be drawn somewhere or we end up with a completely unfair competition (e.g., if every Olympic event was co-ed). \n\nNow to your final point about genetic differences between individuals. You’re right that Michael Phelps has a genetic advantage over basically everyone that’s not Michael Phelps because he has a body that’s essentially perfect for swimming. I think I can say with certainty that even if I trained every day from 5 years old, worked out perfectly, had Michael Phelps’ swimming coach, and even took some performance enhancing drugs to boot I still wouldn’t be able to beat him in any swimming event. I could say the same thing for: me vs. any NFL player, me vs. any UFC fighter, me vs. any NBA player, me vs. any Olympic gymnast, etc. I simply don’t have great genes for athletics (for reference I’m a pretty lanky 6’1” normal dude in my 20s who was never good at any sports) and that’s something I’ve learned to accept. So to a degree, you’re right that because of the genetic differences between individuals there is and will always be an element of “unfairness” in any competition between people. \n\nBut is there anything we can do about that? No, not really… or at least there’s nothing we can do that still allows for much meaningful competition of any kind. If we were to try to account for *all* of the individualized differences between people, we’d end up with an enormous number of categories where each person ends up with a tiny pool of potential competitors (“in other news, Michael Phelps won gold in the Swimming God, aka the “Phelps” category of the 100m freestyle today, marking his 75th consecutive gold medal in this event”). Obviously I’m taking this to a bit of a logical extreme here, but even if the categories were a bit broader, having something like 10+ different categories for the same event at the Olympics would be kindof ridiculous and defeat the point of having a competition in the first place (seeing who’s the best at a particular thing). Some genetic imbalance between competitors is something I think that we as a society have learned to accept and think of as “fair”, and I think it’s something the athletes in these competitions believe is fair as well, seeing as they still choose to compete (even when Michael Phelps is one of the people they’re competing against). We see this in all aspects of our daily lives as well, even though we don’t notice it. For example, people have varying levels of intelligence, which affects everything from our academic performance, to our career prospects and outcomes, to whether we win a chess game that we play with our friends (of course there are many other factors at play in all of these outcomes, but intelligence levels play a large role in our performance). All of these are forms of “competition”, even though we may not think of them as such, yet we don’t tend to think of them as “inherently unfair” and are still willing to compete. \n\n\n*TL;DR* and to conclude: there’s a balance to be struck here. Some differentiation in athletic competition based on natural genetic advantages is good because it allows for different groups of people to compete on a (relatively) fair playing field (e.g., the traditional separation of sport into ‘men’s’ and ‘women’s’ categories) and provides an incentive for people in those groups to strive for peak physical performance and participate in athleticism generally. We also want to be as inclusive as possible so that everyone has the ability to participate in competition if they want to compete. \n\nAt the same time and for the same reason that we traditionally differentiated between men’s and women’s sport, we want to make sure that everyone competes in a category that (generally) aligns with any inherent physical advantages they may or may not have as a result of their biological/genetic makeup so that no one is put at a distinct advantage or disadvantage relative to the other competitors. It turns out that measuring T-levels is a really great way to do this. Unfortunately, this also requires drawing a line somewhere for what T-level puts you into one category vs. another. There’s room for debate as to where that line should be drawn, but wherever it’s drawn there will invariably be some people who end up on one side of the line and think that they should be on the other side, and that’s unavoidable. But even though this may be somewhat unfair, the question is: unfair as compared to what? And here, the alternatives are either more unfair or eliminate meaningful competition entirely. No line looks like an Olympics where only men win medals. Too many lines and you end up competing with like 1 or 2 other people. And a case-by-case line invites back room dealing and politicking (which there’s already way too much of in the Olympics) and complaints from both sides about whatever result is reached. Thus, the T-level system is the best option. \n\n\nIf you’re interested in reading more on the subject by someone with actual expertise who sits on the Olympics’ anti-doping policy board, I would highly recommend reading some of the articles written by Doriane Lambelet Coleman. She did a series of articles on Reason that covers the science and the reasoning behind the current policy, and I think that you’ll find it very informative. [Here’s a link](https://reason.com/people/doriane-coleman/)",
            "title_similarity": "0.7856944",
            "sentiment_compound": 0.9995
        },
        {
            "id": "h5x95iy",
            "score": 1,
            "text": "Every day, we stray closer and closer to Harrison Bergeron",
            "title_similarity": "0.04461625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5x9ib8",
            "score": 1,
            "text": "Competitions are stupid. There's no such thing as a fair competition that ignores your body. \n\nFor fun they are ok. But for anything beyond that they're stupid.",
            "title_similarity": "0.71770227",
            "sentiment_compound": -0.7311
        },
        {
            "id": "h5xbose",
            "score": 1,
            "text": "Are they at the point where they can detect a difference between natural testosterone levels and chemically enhanced testosterone levels?",
            "title_similarity": "0.39985538",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5xfk5j",
            "score": 1,
            "text": "It's just a consequence of our current competitive system in sports. It might be unjust, just like the trans athlete debate is unjust but until sports all change to a system like weight class or similar there isn't a work around.",
            "title_similarity": "0.75827825",
            "sentiment_compound": 0.2617
        },
        {
            "id": "h5xhvcp",
            "score": 1,
            "text": "Omg has anyone read Gwen Berry’s tweets? The one on the left.",
            "title_similarity": "0.2534795",
            "sentiment_compound": 0.0
        }
    ]
}