{
    "CMV: People shouldn't lose their jobs, be socially outcast, or otherwise be reprimanded for long-historic (10 years+) comments or actions that come to light years later\nEdit : hi all, wasn't expecting quite so many responses. I will read through and respond accordingly in due course! Thanks! Great discussion so far. \n\nWe often say things like 'people change' , or 'everyone should be given a second chance' , and yet we see countless examples of celebrities or other public figures being criticised or even 'cancelled' or sacked for things they have said or done historically.\n\nIn my view, it should be recognised that there's a very good chance that the person in question would no longer say or do these things. How many of us have things we deeply regret from years gone by? How many of us would say we have changed significantly in ten years or more? \n\nSlight caveat: I can see why an apology might be necessary, particularly in cases such as hate speech, racism or other disgraceful language or action, but my main point is that this should be the end of it, and not the start of someone being attacked to the point of their reputation being destroyed.": [
        {
            "id": "h64j0s3",
            "score": 1,
            "text": "/u/ypash (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/ope0oo/deltas_awarded_in_cmv_people_shouldnt_lose_their/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5855713",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h64h6nz",
            "score": 1,
            "text": "Why should the employer keep them if their comments are losing their business money?",
            "title_similarity": "0.59784997",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h64jcsp",
            "score": 94,
            "text": "I don’t really think ‘cancel culture’ exists the way people present it; everyone who was allegedly ‘cancelled’ from Louis CK to Bill Cosby to Amber Heard, never actually seem to stay down. Are they criticized? Yes; people in the public eye are criticized for everything from outfits to hair to the way they smile. Have they been “cancelled” by a particular and new culture? No.",
            "title_similarity": "0.75593674",
            "sentiment_compound": 0.1431
        },
        {
            "id": "h64hp0k",
            "score": 1,
            "text": "Can you guarantee that an opinion that gave rise to a comment has changed? Why shouldn't an employer take the safest course of action and terminate their job (as long as it is legal to do so)?",
            "title_similarity": "0.5623634",
            "sentiment_compound": 0.6767
        },
        {
            "id": "h64igdi",
            "score": 21,
            "text": "Hypothetical: I am really fat, and I've been bullied all my life. Now a hero actor of mine who plays roles where they stand up for those who've been bullied, turned out to have quite the history with fat shaming people, but all of it was many years ago. Would I not be in the right to lose my respect for this actor because of this? While it was many years ago, still, this person could've have been my bully.\n\nI think this is the reaction we can definitely have as a society. I think that some examples of people being fired over comments they made in the past are ridiculous, because the comments were made in a different context and not that big of a deal. But there are also plenty of examples of people who have been ousted over really crazy comments about things like the holocaust etc.",
            "title_similarity": "0.7876513",
            "sentiment_compound": -0.8977
        },
        {
            "id": "h64h880",
            "score": 0,
            "text": "> we see countless examples of celebrities or other public figures being criticised or even 'cancelled' or sacked for things they have said or done historically\n\nCan you provide some examples?  I have not seen this happen.",
            "title_similarity": "0.794171",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h68k4ja",
            "score": 0,
            "text": "It's kind of funny since people will go to high lengths to ruin someone's career if someone disagrees with their politics. But if we show that with someone like Biden or Hilary people ignore it. Hilary literally has said that USA needs to build a wall between Mexico and America and a lot more things that trump would say but she was praised by the left so mutch. And biden has a ton of videos where he is touching children very inappropriately but he is still the president of the United States...",
            "title_similarity": "0.80793464",
            "sentiment_compound": 0.7753
        },
        {
            "id": "h64lf0q",
            "score": 118,
            "text": "> People shouldn't lose their jobs, be socially outcast, or otherwise be reprimanded for long-historic (10 years+) comments or actions that come to light \n\n> In my view, it should be recognised that there's a very good chance that the person in question would no longer say or do these things. How many of us have things we deeply regret from years gone by? How many of us would say we have changed significantly in ten years or more? \n\nWhat about new hires? E.g. if you're hiring someone to be in charge of equality policies, but they have a consistent history of *frequent* anti-minority comments in their past (10+ years ago), should you really take the risk of hiring them over other candidates who don't have such histories?\n\nSecondly: what if customers start to massively boycott the company as a result, leading to big losses in sales? Probably you would not expect an employer to continue to keep that person on their payroll?",
            "title_similarity": "0.89741087",
            "sentiment_compound": -0.8685
        },
        {
            "id": "h650ata",
            "score": 11,
            "text": "If you had racist or homophobic thoughts and feelings in the past, go delete your post history. Is it really that hard? I’ve been on Facebook since it first being around and I am 100% confident I never posted anything like that.",
            "title_similarity": "0.65672684",
            "sentiment_compound": -0.5556
        },
        {
            "id": "h64hjov",
            "score": 546,
            "text": "Ideally yes, but you can never say never right?  I think we can all come up with examples where the comments were innocuous enough that a big deal should not have been made over them.  However, that does not matter. Rather, it just shows that people disagree on what is worthy of that treatment.\n\nBut, can you say that your stance holds for any possible statements or actions?  All of them?  You could never imagine yourself supporting actions in any circumstance.  If you do, then you should also accept that other people's standards are different.",
            "title_similarity": "0.6511064",
            "sentiment_compound": 0.602
        },
        {
            "id": "h64h3ll",
            "score": 148,
            "text": "Can you provide an example of someone ostracized like you describe based on what they did 10+ years ago?",
            "title_similarity": "0.5564277",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h64k7kd",
            "score": 1,
            "text": "In some relative idealisic works, I guess. \n\nThe issue is you can't really expect individuals not to have some form of reaction, especially depending on the extent of the issue; for example, if a person did blackface and assault ten-fifteen years ago, when it was clear that it was wrong and further, thought it would be a good idea to document their past, so they could maintain such memories, it becomes a question of it they still have such feelings, how it represents the company values, why they actually decided to do it, etc. It is HIGHLY dependent on why the person did, so this should never be implemented in totality. You cannot always just let things go and go on. \n\nSecondly, why would a company do this if they would lose economic accumulation? It seems like a double negative.\n\nIn addition, currently, we have such political and societal division, that expectation regarding the idea individuals will just let something go when there were no repercussions for said action beforehand, especially if they do not feel remorseful, seems unrealistic to me. Nevertheless, even if such glaring division did not exist, it still seems a bit unrealistic, especially since numerous individuals may have been impacted in an inverse manner.",
            "title_similarity": "0.8076155",
            "sentiment_compound": -0.629
        },
        {
            "id": "h65bvhm",
            "score": -1,
            "text": "I'll paraphrase somebody **much** more qualified than me to answer that, especially in the professional sports realm: Brad Miller, in [this episode](https://podcast.app/the-morning-bagger-mitchell-miller-e120245015/) of *The Morning Bagger* podcast. Miller plays pro hockey in Germany, played at Univ North Dakota 2005-09, and had his say about the Mitchell Miller (no relation) matter.\n\nM. Miller got kicked off from both the Arizona Coyotes and (3 days after the podcast upload date) UND teams because of severe bullying against a developmentally disabled student at age 14 during his 8th grade year, he stuck a popcycle in a toilet and tricked the student into licking it. Further, he called the student (black) racial slurs. The disabled student's family said M. Miller never apologized to the family for his egregious behavior (but that last sentence is unprovable, maybe true but maybe not. It's just B. Miller's speculation, that's all).\n\n**Brad Miller's commentary (paraphrase)**: It'd be one thing were M. Miller 8 or 10 years old. But at 14, you're supposed to know basic right from wrong. A **14** year old who can't grasp the severe effects of that behavior for others, especially a disabled student, is unlikely to develop much empathy and compassion for others in general. This isn't like stealing another's lunch money or throwing a plastic bottle on the side of the road. This is a serious character issue.  The UND staff told B. Miller and his teammates they have to be of upstanding character to play on their team - to the point that they should reject a player with even the best stats and performance if he's going to treat people unfairly.\n\nPlaying on a hockey team isn't a right.  So his apologies in a letter to the Arizona franchise don't cut it, for B. Miller ***hopes*** M. Miller's sincere (hint, hint).  We should eliminate handwaving this kind of behavior away from hockey (pro or college).  M. Miller doesn't deserve banishment from society, but he doesn't deserve to play pro or college hockey.  M. Miller should continue his efforts to speak out against bullying, plus get an education, get a job outside professional sports, and live out the rest of his life like that.",
            "title_similarity": "0.60904807",
            "sentiment_compound": 0.9665
        },
        {
            "id": "h64h8e7",
            "score": 45,
            "text": ">Zuck: Yeah so if you ever need info about anyone at Harvard\nZuck: Just ask\nZuck: I have over 4,000 emails, pictures, addresses, SNS\n[Redacted Friend's Name]: What? How'd you manage that one?\nZuck: People just submitted it.\nZuck: I don't know why.\nZuck: They \"trust me\"\nZuck: Dumb fucks\n\n\nYou don't believe this quote should color your opinion about Facebook?",
            "title_similarity": "0.64390683",
            "sentiment_compound": -0.3485
        },
        {
            "id": "h64q641",
            "score": 14,
            "text": "It depends.\n\nPeople shouldn't lose their job or get mobbed on social media because of a stupid minor mistake when they were 16.\n\nHowever, if it's a particularly problematic situation, or something that may still have repercussions on their CURRENT job or personality, it's fair to distance oneself and to take actions.\n\nLike, a picture of a drunk 20 something is irrelevant. But if said 20-something is now working in a rehab facility and there are 20 different instances of them being a heavy drinker, it's clearly not as innocent.\n\nSame goes about more serious stuff like discriminatory remarks etc.",
            "title_similarity": "0.7864435",
            "sentiment_compound": 0.2697
        },
        {
            "id": "h64xyrs",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.03450355"
        },
        {
            "id": "h64nb3h",
            "score": 9,
            "text": "Really depends. Obviously you shouldn't fire a good employee from just some job. But if the job we're talking about is one where literally thousands apply (professional sports, Hollywood movies), I think it's fine to expect the one winner of that lottery to be damn near perfect. It's tough, but that's how the race to the very top works. \n\nAnd if you get too many complaints about some person for whatever reason, it's perfectly fine to say 'well, I got 200 people applying for that role everyday, why even bother with THAT guy?'",
            "title_similarity": "0.7642014",
            "sentiment_compound": 0.9393
        },
        {
            "id": "h65eovz",
            "score": 2,
            "text": "France (and other EU nations) have [the right to be forgotten ](https://en.m.wikipedia.org/wiki/Right_to_be_forgotten) for this very reason. \n\nSeriously, everyone would be fired. Millennials grew up with social media, came of age saying dumb shit that exists forever. \n\nThis culture got us Trump / Le Pen / Geert Wilders. If everything is offensive, nothing is offensive, and no will ever be held accountable for anything. Well done, snowflakes",
            "title_similarity": "0.7201309",
            "sentiment_compound": -0.9325
        },
        {
            "id": "h66b4i3",
            "score": 2,
            "text": "I'm so glad you posted this. I tried to post it earlier on a different sub but it got removed. \nIn light of the sacking of the Olympic games opening ceremony organizer I think it's shameful. \nShould we all really be held to account for things we said years ago !  As you say . I think not, in fact I think it's ludicrous. \nIt's gone to far and it's time to pull back on things like this.",
            "title_similarity": "0.79779696",
            "sentiment_compound": -0.5339
        },
        {
            "id": "h64hk9m",
            "score": 4,
            "text": "These views are difficult to contend with, for two main reasons. First, the premise - \"we see countless examples of celebrities or other public figures being criticised or even 'cancelled' or sacked for things they have said or done historically\" - is vague and undefined on basically all levels you can think of. Second, it's unclear what you think should happen or how your preferred state of affair ought to come about. Will you employ all these allegedly sacked celebrities yourself?",
            "title_similarity": "0.7838559",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h64ppoa",
            "score": 3,
            "text": "I think for me the distinction lies between crassly immature and racist/bigoted/homophobic etc.\n\nOllie robinson (cricketer) was recently almost cancelled because of tweets from when he was a teenager that contained stupid immature racist jokes. It's clear however that he's not a racist. Other people face backlash because 10 years ago they were a grown adult explicitly spreading views that people of some race or sexual orientation are disgusting to them and should be treated as an underclass to mainstream white society. Those people are dangerous and absolutely deserve to be ostracized. There's a difference between the 2 but i wouldn't say that anything from a long time ago is automatically irrelevant.",
            "title_similarity": "0.7877423",
            "sentiment_compound": -0.6997
        },
        {
            "id": "h64rcjj",
            "score": 5,
            "text": "We should strive to live by the phrase, \"Ye who is without sin, cast the first stone.\"  If more people considered the inherent wisdom of this aphorism before denouncing others the world would be a far better place.",
            "title_similarity": "0.5895087",
            "sentiment_compound": 0.849
        },
        {
            "id": "h654hrg",
            "score": 21,
            "text": "It depends, but I'll introduce a scenario that you may not have thought of, that being association with *PETA*, and various other similar organizations. Many laboratories in the biological sciences have and continue to filter out potential hires who have had a strong history with *PETA* or some other organization. Why?\n\nEquipment is expensive. Laboratory materials and files may be costly to replace, repair, or irreplaceable altogether. We are aware that people who are members of these sorts organizations aren't above the \"long con\", particularly if that organization has been involved with those who committed already acts of terrorism and sabotage.\n\nShould an abortion clinic, for example, hire someone who has expressed deeply violent, anti-abortion views, in light of what has been done against abortion clinic doctors? Should a research lab not consider that someone with a strong association with certain animal rights organizations (Not welfare, rights) or ecoterrorism cells for hire, or those who expressed such extreme views?\n\nThere's a bit more at stake, I imagine, to which I do not believe these types of employers are in the wrong for not considering views expressed some years ago if those views were extreme enough that they justified and thus advocated criminal conduct.",
            "title_similarity": "0.728858",
            "sentiment_compound": -0.9174
        },
        {
            "id": "h64jef3",
            "score": 14,
            "text": "I think it depends on the context - something said in your 50s (and socially unacceptable at the time) and revealed in your 60s (and still unacceptable) is a very different context than something said in your 20s (and commonplace / socially accepted then) and revealed in your 30s (and no longer acceptable or common).",
            "title_similarity": "0.49425328",
            "sentiment_compound": -0.7942
        },
        {
            "id": "h64nku2",
            "score": 71,
            "text": "I don’t have a strong opinion about what I think you are getting at (people being rude, thoughtless, offensive etc), but I want to point out your post is a little broad because “doing things” include things like murder (or other really bad actions), and I think murders 10+ years ago should still taken seriously and involved social ostracism (like Harvey Weinstein and bill cosby being social outcast for being a serial rapists - they were fired from their jobs among other things)",
            "title_similarity": "0.80143726",
            "sentiment_compound": -0.9835
        },
        {
            "id": "h652fxv",
            "score": 25,
            "text": "While it does make sense to give people another chance, it should also be important to see if there's any evidence that the person has changed their views. It's illogical to assume that people have changed their views on something just because time has passed, so a more evidence-based approach should be taken. If someone said something racist 10 years ago, even if they haven't said anything racist since then, if they also haven't shown a sense of racial equality, then there's no reason to assume that they changed their views. That being said, I still don't support cancel culture, and I believe that people should be given a second chance, but it should be evaluated logically",
            "title_similarity": "0.7784511",
            "sentiment_compound": 0.039
        },
        {
            "id": "h64nvbi",
            "score": 2,
            "text": "Absent of any evidence to the contrary, we generally don't assume people change just because time has passed, right?",
            "title_similarity": "0.51814497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64tz4q",
            "score": 5,
            "text": "I mean, where exactly do you draw the line? Yes you might say that that someone saying the n-word on their twitter 10 years ago is not a good reason to sack someone, but what if they said it a year ago, or six months ago, or yesterday?",
            "title_similarity": "0.740833",
            "sentiment_compound": 0.1298
        },
        {
            "id": "h64wjs8",
            "score": 3,
            "text": "To me personally this depends entirely in 2 things. The person's current behaviour and feeling towards the matter and the pain or injury inflicted on other because of that person's comments or actions based on prejudice. People should be held to account for the injuries they inflicted on others but some people have absolutely no remorse and still act in ways that will hurt others maliciously those are the people who should be socially ostracized and reprimanded because they are still hurting others with their words and actions. There are also those who speak on things in ignorance and hurt others unintentionally and those are the ones that need to be corrected and led back to the right path.",
            "title_similarity": "0.6538741",
            "sentiment_compound": -0.9573
        },
        {
            "id": "h651nbl",
            "score": 1,
            "text": "What about if someone like rapes and murders a child and there's like hard evidence of it happening?",
            "title_similarity": "0.3864291",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h652h9u",
            "score": 34,
            "text": "I would say there's another at least slight caveat: If the comments 10+ years ago point to a pattern or trend. I've known people who make a borderline, sort of grey-zone racist comment, and they say, \"You're reading into what I said.\" And then if I say, \"But you've said pretty much the same thing for the last 20 years. It's not ironic anymore. It's not a joke every time, or it's a bad one.\" Then he says, \"Pssh. The past is the past.\"\n\nAt some point that becomes disingenuous, and you need to be able to say, patterns can be detected over time that give more information than a single \"joke\" made \"one time\". When \"I make one joke one time and everybody gets pissed. Fucking snowflakes\" turns into, \"You make this joke every 1-2 months, for 20 years\" then it's fair to say I'm not just taking one statement and making a big deal about it.",
            "title_similarity": "0.75632894",
            "sentiment_compound": 0.0326
        },
        {
            "id": "h653jm4",
            "score": 2,
            "text": "I would normally be perfectly fine with this, though when those same people who rag on others for it, did the same thing in the past, the people that want to be hypocrites about it don’t deserve my sympathy, all those who can man up to their mistakes I can respect",
            "title_similarity": "0.73729426",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h656p7o",
            "score": 9,
            "text": "I think it depends a lot on what they did and how they respond to it. For example the Japanese Olympics composer and comedian did not apologise for what they said or did, just talking about it. Similarly, Cosby and many others never apologised. Compare it to artists that didn't get cancelled after they showed genuine remorse, even if what they did was recent and objectively horrifying (Louis CK, lily cade). Cancel culture only works to a certain extent, we have many examples of celebrities doing and keep doing these things without getting cancelled. You only hear of the few causes that made the news, and are probably thinking about the percentage of them that were for what one might consider insignificant reasons. \n\nAdditionally, trauma does last the victims a lifetime sometimes, and seeing someone publically displays brings it back. I also filed a harassment complaint once and lost (person got a verbal warning), and I would get frequent panic attacks going on campus; the fact that most people found the subject uncomfortable so just didn't talk about it or even ghosted me for making them uncomfortable gave me some deep trust issues that I am still addressing in therapy. It's a lot easier to empathise with the likeable abused than the unknown victim, but there are always two sides and two consequences to each story and usually we only know the abuser's in case of celebrities. What do they lose from getting cancelled, what did they win from not getting cancelled 10 years ago, and what did the victim lose from spending these 10 years unheard?\n\nAlso, I think it is important to wonder why someone said/did those things 10 years ago but never addressed it. I said some stupid things 10 years ago yeah, but I felt remorse once I outgrew them and where possible I apologised to those I had wronged. It would not have been an effort to make a new article called \"hey, that thing I said on TV? That was stupid and I'm sorry\". The fact that they only apologised (*if* they apologised) once their career was on the line says a lot, imo.",
            "title_similarity": "0.72513396",
            "sentiment_compound": -0.9829
        },
        {
            "id": "h657m53",
            "score": 1,
            "text": ">We often say things like 'people change' \n\nWhich doesn't mean that *do*. \n\nYes, *if* someone has actually changed, apologized for their comment and rejected it, and when necessary made amends... \n\n*Then* they shouldn't lose their jobs or be socially outcast. \n\nAnd that's *extraordinarily rare*. The *vast* majority of people ostracized for these things are because they *don't* do those things.\n\nAnd, of course, in cases where their actions actually harmed someone, there's really no social statute of limitations on that. Of course, the degree of ostracism should ideally be proportional to the harm that was done, but that's different from not doing it at all.",
            "title_similarity": "0.7820878",
            "sentiment_compound": -0.1072
        },
        {
            "id": "h657xcd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03450355"
        },
        {
            "id": "h657xwi",
            "score": 1,
            "text": "I agree that comments should not dictate how somebody is treated now. However I do think the individual should apologise and acknowledge that their previous comments were at fault and not double down or offer a fake \"I'm sorry if I offended you...\" type apology.\n\nIn cases where physical or mental harm was caused, it's a tad different. If somebody committed an act of crime, such as assault or murder or rape, whatever it may be, then their criminal act should still be treated as such.\n\nIf comments are more recent they should be treated differently. It's impossible to define how old something needs to be, perhaps.  \n\n\nEqually, I don't think somebodies past \"good\" actions can be used to defend somebody who does something \"bad\"",
            "title_similarity": "0.6369315",
            "sentiment_compound": -0.9796
        },
        {
            "id": "h6582t7",
            "score": 1,
            "text": "There is no statute of limitations for being an asshole",
            "title_similarity": "0.29270405",
            "sentiment_compound": -0.296
        },
        {
            "id": "h658b6r",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.03450355"
        },
        {
            "id": "h658ftb",
            "score": 1,
            "text": "time doesnt dilute racist/ sexist tendencies, otherwise boomers wouldn't be so racist even though outright racism hasn't been a social norm for a while now.",
            "title_similarity": "0.66636586",
            "sentiment_compound": -0.7903
        },
        {
            "id": "h65a0au",
            "score": 1,
            "text": "I think it should depend on how much damage the person's words or actions have caused on the victims. If the accused caused a victim to suffer permanent damage such as committing suicide or psychological trauma that continues for decades, then the accused should at least take some sort of reputational hit.\n\nI see people are talking about 2nd chances, and I agree that people will likely change over 10+ years. But this same argument can be used for criminals who commit murder, theft, etc. who receive punishment when they are caught. \n\nI'm not saying the accused person is a criminal that deserves legal action, but the punishment should fit the crime. This is why I think analyzing the amount of damage done to the victim(s) is a good measuring stick on whether the accused should be punished and how much the punishment should be.",
            "title_similarity": "0.80835307",
            "sentiment_compound": -0.9941
        },
        {
            "id": "h65ahie",
            "score": 3,
            "text": "See I don’t think any sane people want to ‘cancel’ celebrities/whoever because of that one thing they said ten years ago. They see the incident, and often the lack of any follow up at the time, and want to out a legitimately bad person.\n\nYou say an apology might be necessary, but I see it as absolutely essential in restoring public image at that point. A good apology would imply they no longer hold these shit views. Ignoring the fact people are upset about your previously stated views implies you have nothing to say, you still hold these views. It’s as simple as that.\n\nNow in a truly just world you’re right, not a single person would have to be cancelled for ancient history like that. But that’s only because they would have been outed at the time as a shit person. Now it’s become more acceptable and accessible to call famous people out for the shit things they do, so since stuff clearly fell between the cracks, this is the best we can do",
            "title_similarity": "0.8526845",
            "sentiment_compound": 0.8893
        },
        {
            "id": "h65bm3g",
            "score": 1,
            "text": "Depends on your job. The leader of my country wore blackface a shitload of times and groped a bunch of chicks. I don't want him leading my country. I wouldn't have voted for him if I had known he had a penchant for being a racist, hypocritical, pandering, misogynistic toolbag.",
            "title_similarity": "0.6869066",
            "sentiment_compound": -0.8032
        },
        {
            "id": "h65cgbe",
            "score": 1,
            "text": "Agreed.\n\nThe same people who plead for understanding for past criminals want to vilify successful people for long past transgressions. If you are poor/underprivileged everything in your past should be absolved. If you are privileged or not seen as ‘oppressed’ you should be held liable for everything done when younger.",
            "title_similarity": "0.69341993",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h65d07z",
            "score": 1,
            "text": "If it was far enough back that nobody cared, then it wouldn't matter because nobody would react.  If people are reacting now, it's because they feel it \\*isn't\\* too far back to still be noteworthy.\n\nCase in point: James Gunn (director of Guardians of the Galaxy) said some shit years ago that, when it resurfaced, caused his employer (Disney) to fire him.  The reaction of the public was that his words were not so damning, his response was contrite and genuine, and enough time had passed that he was buoyed by public opinion and his career is doing just fine now (well, he's doing Suicide Squad, we'll see how that turns out).\n\nOn the other hand, Mel Gibson does not appear to be entirely forgiven and he's still struggling. For a guy who used to be top billing in blockbusters he can't get work now.\n\nSo I think what we're looking at is a Free Market Response™.  The public decides what the public wants and reacts accordingly.",
            "title_similarity": "0.7677719",
            "sentiment_compound": 0.623
        },
        {
            "id": "h65dbtd",
            "score": 1,
            "text": "Liam neeson didn't get cancelled and he said he went hunting black people cause a black person raped his friend, he's the only one I've seen side step it and carry on making shitty action movies. I wish he did get cancelled id never have had to watch taken/ ice road truckers fkin movie he just brought out.",
            "title_similarity": "0.57828796",
            "sentiment_compound": -0.5514
        },
        {
            "id": "h65dgjs",
            "score": 1,
            "text": "First, we give employers very broad latitude for hiring and firing decisions. Restricting that may be an arguable solution to many problems but it would be a fundamental change. \n\nSecond, in most cases I'm aware of, the problem is compounded by the person lying about the past or trying to justify it. When someone comes out and says \"I did this, it was wrong, I recognize that now\" usually people are forgiving.",
            "title_similarity": "0.80408716",
            "sentiment_compound": -0.9127
        },
        {
            "id": "h65ease",
            "score": 1,
            "text": "Are you Boris Johnson?",
            "title_similarity": "0.0766124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65euh8",
            "score": 1,
            "text": "Depends. Former Democratic Senator Robert Byrd was a Grand Wizard of the KKK. You don't exactly change if you're in that deep, despite what his close friends Joe Biden and Hillary Clinton would have you believe.",
            "title_similarity": "0.5890635",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h65fhd1",
            "score": 1,
            "text": "Racists don’t need more protections, actions have consequences, those don’t go away just because you’ve avoided them for 10+ years, there will be consequences. If the person really has changed then good, but they probably are just covering their racist ass for getting exposed as such.",
            "title_similarity": "0.8200144",
            "sentiment_compound": -0.9287
        },
        {
            "id": "h65fhm5",
            "score": 1,
            "text": "I don't have a huge argument about this except to say that it truly depends fully on the comment, the context, and how the person feels about it now.\n\nThere's a lot of people who lose their jobs because of a 10+ y/o comment, then, asked about it recently, they DOUBLE DOWN and start crying about cAnCeL cUlTuRe\n\nA lot of times, if you walk back and say look, I know I said ABC in the past but I've grown from that viewpoint and no longer stand by it, you'll probably keep your job...but again that depends on what you said.\n\nIf you went around making racial slurs at the age of 30 you'll probably be using them at 40.\n\nThat said, I pretty much agree if the person was a minor they should be given at least one chance. I said so many dumb things when I was 16.",
            "title_similarity": "0.85821986",
            "sentiment_compound": -0.3179
        },
        {
            "id": "h65flvb",
            "score": 1,
            "text": "The punishment should fit the crime. In this case where words aren't a crime and no legal action can be taken, I would say the punishment should be commensurate to the damage inflicted upon the victim(s). \n\nIf the accused words or actions did extensive permanent damage to the victim(s), then the accused should be punished accordingly.\n\nIf the victim(s) suffered only superficial short term damage and no real harm was done, then perhaps the accused should be let off with a simple warning.",
            "title_similarity": "0.5895368",
            "sentiment_compound": -0.98
        },
        {
            "id": "h65g21d",
            "score": 1,
            "text": "No they shouldn't your right but the worlds become a toxic place and people have figured out they can group together and destroy someone's life for fun. What they said or did in the past is just the excuse.",
            "title_similarity": "0.659762",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h65h49b",
            "score": 1,
            "text": "What if someone said “We need to kill all the blacks.”, or any other racially charged statement towards blacks 10 years ago, and they now work for a black employer? Why should the employer have to retain that employee that they’re uncomfortable with? \n\nSecondly, how will we enforce this without taking any tyrannical measure? How do we force this employer to retain the employee and punish him for firing?",
            "title_similarity": "0.64174247",
            "sentiment_compound": -0.9419
        },
        {
            "id": "h65h6t4",
            "score": 1,
            "text": "Social media is very good at making it seem like a lot of people are angry. Whereas in reality, it is just a small vocal minority. The problem for businesses is a lot of marketing is done on social media nowadays. The small vocal minority will generate enough fuss to derail their marketing efforts. \n\nThe person's reputation isn't really destroyed as most people don't care IRL. They just aren't valuable enough for businesses to keep. This is why you rarely see board chairs and CEOs being canceled. You can cry all you want about Amazon workers peeing in bottles. Jeff isn't going anywhere, because he is so valuable losing some marketing efforts is negligible.",
            "title_similarity": "0.7773642",
            "sentiment_compound": -0.6243
        },
        {
            "id": "h65i0uj",
            "score": 2,
            "text": "I agree to some extent, and disagree to others.\n\nSpecifics over which I agree: (1) If the comments made were made while you were legally considered a minor, you should not be professionally culpable. We all say some dumb shit as teenagers and MOST of us grow past our more embarrassing and/or ignorant acts of teenage angst. (2) If you are in a position that cannot meaningfully impact the public nor large groups of people in general, and the comments were not made during work nor to customers. If my trash collector posts a racist tweet they're an asshole, but it doesn't warrant them losing their trash-collecting job. If that same trash collector refuses to pick up the trash from certain houses, families, or neighborhoods, or makes racist comments to customers? Fire the bastard!\n\nSpecifics over which I disagree: (1) If you are a \"public face,\" brand representative, etc - you're fired. Maybe your company/brand supports your awful views, past or present, but that doesn't matter; what matters is allowing you to enjoy success as a public face with bigoted viewpoints damages oppressed communities and empowers their oppressors, and that is Not OK. (2) If you have any power over the public or large groups of people, period. You may not think that a Department of Water & Sewer maintenance dispatcher has any real power over the public, but they *could* (hypothetically) delay dispatch of repair technicians and crews to neighborhoods known for populations they are prejudiced against. This position is not a public face, and arguably not even managerial - but the position has the power to affect entire communities with personal prejudice, so it should not be tolerated.",
            "title_similarity": "0.72927177",
            "sentiment_compound": -0.9893
        },
        {
            "id": "h65iwdq",
            "score": 1,
            "text": "What about if those people refuse to acknowledge that what they said was wrong, or refuse to even comment?\n\nDoes it depend on the Job? do you think a police officer, that made supportive comments of the KKK ten years ago still deserve to be a police officer?\n\nOf course it depends on how they apologize, there are former KKK and hate group people who break out of it, but they are often very vocal about their former brainwashing.\n\nThere's a world of difference between someone being forced to say sorry in a press conference and someone who actually is, and you can often tell from body language alone who truly is.",
            "title_similarity": "0.82664394",
            "sentiment_compound": -0.8931
        },
        {
            "id": "h65iyhc",
            "score": 1,
            "text": "I draw the line at tge apology. If you Cant simply say \"I know now that what i said is horrible and I have grown as a person.\" Your good.  If you say \"im sorry if what i said offended you\" im done with you. We all make mistakes. But if you dont see em as one than I dont have time for you.",
            "title_similarity": "0.6954121",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h65j1ai",
            "score": 1,
            "text": "Love how they avoided the term cancel culture since its auto removed for spam......",
            "title_similarity": "0.5609312",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h65j1tj",
            "score": 1,
            "text": "For what it's worth, I hope you don't change your mind. \n\nThe world is a better place if we can allow people to change.",
            "title_similarity": "0.54049003",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h65jnl0",
            "score": 1,
            "text": "People shouldn’t be locked up for years for minor possession either but here we are.",
            "title_similarity": "0.64190215",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65lf3r",
            "score": 1,
            "text": "It depends, for me, on whether or not they've shown an effort to be a better person.",
            "title_similarity": "0.41779947",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h65lqgq",
            "score": 5,
            "text": "I agree when it comes to using social media, and in \"real life\" social situations and interactions with people. I'm not the same person I was 16 years ago, or even 3, and I regret many of the things I've said and done to people, online and off. Let's not forget, when a person gains self-awareness at some point in their lives, viewing their past actions tends to hurt the person who said them just as much as their intended victim, and can really mentally cripple, condemning that person to relive their idiocy over and over to the point it affects their self-esteem. Getting \"canceled\" just adds to that. \n\nHowever, I don't think that victims should automatically have to forgive people just because their tormentor \"saw the light.\"  I think it's up to the individual that did wrong to just be aware of what they did and vow to be a better person going forward. Growing is always good. It really does build character.\n\nAs for anything beyond the mean act or careless phrase and goes into physical acts of violence dishonesty and extreme cruelty... I'd say Good on that person for changing their ways, but sorry, dude, your sentence is that people are always going to be wary of you, that's the price. But hey, good on you and no, you can't babysit my kids or manage my financial portfolio.",
            "title_similarity": "0.7716491",
            "sentiment_compound": 0.311
        },
        {
            "id": "h65mgbl",
            "score": 1,
            "text": "But what would all the unemployed busybodies on Twitter do in between their Starbucks® cold foam cold brews and totally non-ironically complaining about capitalism while constantly consuming corporate products???",
            "title_similarity": "0.59584206",
            "sentiment_compound": -0.4867
        },
        {
            "id": "h65mpm5",
            "score": 1,
            "text": "Why should people not face consequences for their past actions just because of the passage of time?",
            "title_similarity": "0.52972555",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65mwbl",
            "score": 1,
            "text": "Do you really want your view changed on this?  “Make me a vindictive conscienceless jerk, please!”",
            "title_similarity": "0.46173048",
            "sentiment_compound": -0.273
        },
        {
            "id": "h65myxv",
            "score": 1,
            "text": "They usually aren't. They're only punished if they double down or refuse to show they've grown or moved past those statements.\n\nMost of the time this happens in the media is because either it's some employee who literally writes a manifesto, or it's a celebrity who is then forced to go onto an apology tour or lay low for a few months. It's almost never someone who made a dumb social media post that they regret who is being punished.",
            "title_similarity": "0.8265028",
            "sentiment_compound": -0.9139
        },
        {
            "id": "h65nr8c",
            "score": 1,
            "text": "What if they used those comments or actions to benefit themselves  socially, materially, or employment wise-especially if it caused harm to others?",
            "title_similarity": "0.5211283",
            "sentiment_compound": -0.128
        },
        {
            "id": "h65pq1e",
            "score": 1,
            "text": "People you deal with personally, you can judge whether they've changed.\n\nFor celebrities, etc., it's fine to decide you don't want to buy their music, films, etc. because of their past actions and you don't owe them any reconsideration. This is not the same as not being able to make a living or being socially outcast, etc. They can have friends, employment, etc. Nobody is obliged to reinstate them as a public figure.",
            "title_similarity": "0.676846",
            "sentiment_compound": 0.5687
        },
        {
            "id": "h65txe8",
            "score": 1,
            "text": "My position on this is simple; is it an offhand comment, or even a small number of incidents? If so, and if they apologize, its fine. A simple apology, as long as it is even remotely genuine, will suffice.\n\nHowever, if they have a repeated history of multiple tweets, comments, posts, etc. exhibiting this behavior then that is a different story. At that point, in my view, in order to be redeemed they must actively work to repair their image. This can primarily be done by acknowledging their past remarks and beliefs, and by repeatedly and *proactively* apologizing for them. At an interview, THEY  should mention their past and how they've changed. If not, then they don't care and hence don't deserve my respect nor, in my view, the right to live comfortably in society.",
            "title_similarity": "0.66172326",
            "sentiment_compound": 0.56
        },
        {
            "id": "h65u0sz",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.03450355"
        },
        {
            "id": "h65umn0",
            "score": 1,
            "text": "I mean if I held a bad opinion 10 years ago that I've since changed, then yeah it would be a dumb thing. If I put a date online, promising a location of 50 corpses, then maybe not. If that happened while I was an edgy 13 year old kid, then maybe I'd get away with it, but young adults shouldn't get away with shit like that.",
            "title_similarity": "0.74651134",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h65v4fk",
            "score": 2,
            "text": "I agree with what you said, but I'd also throw in that it's very rare that people get truly cancelled unless they do something horrific or don't actually apologize. Sure, many will still insult them, bash others for liking them, etc. And often I can understand why they do this, but who's really been truly cancelled besides Cosby, Spacey, and Weinstein? \n\nMost others have found audiences still where they can still make a living. Mel Gibson, Aziz Ansari, James Gunn, and hundreds more have bounced back. I'm not saying they weren't emotionally and financially affected, some more than others and some more deserving than others. But I think we often say cancelled as if it was permanent when we really mean is more temporary (could be a few years). Obviously though, if these people haven't saved up a good amount of money this can be huge, but most of the people I've seen getting \"cancelled\" are generally famous enough where you expect they're well-off. \n\nThe flip side is like others mentioned, people have the right to not mess with someone or some company if they don't want to. And companies have the right to not want to employ someone because of bad PR. Ultimately it's on the fans/consumers to make that decision. But I think what you're hinting at is that it'd be great if people were more empathetic and open to growth and not as prone to social media mob mentality as they are. At the same time when I find something obnoxious or immoral, it turns me off from whoever does it.\n\nThe main thing for me is that I wish people were more self-reflective around how hard it is to stay consistent. People act like it's easy to either separate the art from the artist or to dismiss anyone who does anything evil or immoral. But the fact is we're messier than we'd like to be. But when someone gets mad at others for not cancelling XYZ, I always want to ask \"so do you cancel Miles Davis, Anthony Keidis, John Lennon, Iggy Pop, Ozzy Osbourne, etc.\" \n\nHell, I'm bisexual, Jewish and Latino. Do you know how many things that celebrities have done that were homophobic? or Anti-Semitic? Or racist? Even if only distasteful jokes, insults, stereotypes, etc.? You just hope people grow and try to get more compassionate.",
            "title_similarity": "0.83403647",
            "sentiment_compound": -0.9288
        },
        {
            "id": "h65x44a",
            "score": 1,
            "text": "Then again, people don’t change THAT much. If a celebrity was caught spitting on a homeless person or calling someone a racial slur, especially if they were doing that a lot back then, then they are obviously not a good person. They may only look like a good person now to gain fans. I’ll give the example of Justin Bieber, who peed on his adoring fans. He have may been trying to look like a good person is his last three albums, and he’s been going as far as being a slacktivist, but he’s obviously just trying to save his reputation and his money.",
            "title_similarity": "0.7941115",
            "sentiment_compound": 0.9099
        },
        {
            "id": "h65yje2",
            "score": 1,
            "text": "Well, as far as comments go, for the most part, I agree with you. However, in terms of actions, I would strongly disagree. What if someone committed murder 25 years ago and that just came to light? Should that person not be fired? \n\nAlso, are you making a moral or legal argument? Let me ask this, should a business legally be allowed to fire people for old comments and actions but you consider it morally wrong to do so, or should it be illegal for the company to fire them? If it is the former, I can mostly agree, if the latter, I completely disagree. I believe that an employer should be able to fire an employee for any reason they choose. If it is not a reasonable one, the employee would most likely qualify for unemployment benefits, and if it was extremely unreasonable, they could speak out and cause the public to boycott the company. Regardless, I believe in a truly free market. \n\nOne last point. I think the 10+ years number is completely arbitrary. I think instead there should be some sort of evaluation rather than just specific number of years. If you made the rule 10 or more years, and someone had one comment from 9 years ago but had completely changed since then, would their firing be justified? Also, people can have drastic life changes occur in months. If someone were to, for instance, get in a life threatening car accident, they could come out of it with a completely different outlook on life. If they did, why should they be punished for something they did 2 years ago but isn't who they are anymore, when someone who may not even have changed doesn't get punished because their comment happened 11 years ago.",
            "title_similarity": "0.72759414",
            "sentiment_compound": -0.9692
        },
        {
            "id": "h65z98i",
            "score": 1,
            "text": "If someone has apologised and shown growth for comments in the past, that's fine.  The problem is when people just get better at hiding bad things.\n\nAnd bad actions are a different matter.  People definitely need to be held accountable for raping or murdering someone, no matter how long ago.\n\nThe issue is that the consequence needs to be proportional to the action.",
            "title_similarity": "0.72298473",
            "sentiment_compound": -0.9113
        },
        {
            "id": "h65zqbk",
            "score": 1,
            "text": "Case by case.\n\nIf a guy is 65 years old and it turns out that 10 years ago, at 55, he says some horrific shit, then fuck'em.\n\nBut a 25 year old that said some shit at 15 is more understandable.",
            "title_similarity": "0.627995",
            "sentiment_compound": -0.872
        },
        {
            "id": "h660r3g",
            "score": 1,
            "text": "I guess my only counter is that people should have the foresight to not be shitty ?",
            "title_similarity": "0.39258915",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h663yck",
            "score": 1,
            "text": "Sure people can change, but it’s quite the assumption to assume they have",
            "title_similarity": "0.46930075",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h665oud",
            "score": 1,
            "text": "Yet another reason why we should have better employment laws and protections in the US!",
            "title_similarity": "0.51141465",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h665wpy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03450355"
        },
        {
            "id": "h669p43",
            "score": 1,
            "text": "You are responsible for your actions. Modern times- this includes bullshit your spout on social media. Time for some self accountability.",
            "title_similarity": "0.51145315",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h66a7hq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03450355"
        },
        {
            "id": "h66b30i",
            "score": 3,
            "text": "I think this thread is presenting instance based evidence to support one view or another, but judging another human is more nuanced than that. Namely, we use bodies of evidence to come to conclusions, not single episodes. \n\nI think what you're touching on is that news media jumps on single events and uses them to paint a broad picture of someone. If this is the case, I agree with you. See: Justin Trudeau blackface. You may not agree with his policies, but we know him to be a relatively progressive and racially aware leader. When the media attempted to skew that image with one historical picture, it seemed dishonest. (He apologised, of course).\n\nBut, as in your example used in another thread, you wouldn't forgive Adolf Hitler. This is because we have a body of evidence supporting the historical fact that he was a terrible person. If I was shown evidence of a very conservative, racially divisive politician (take your pick) wearing blackface 30 years ago, I would call for his removal from office. This is because it agrees with and helps prove a body of evidence that shows him to be racist.\n\nIn short, one comment or action that comes to light should hold power only if it is validated by a body of similar evidence proving poor moral substance.",
            "title_similarity": "0.6826392",
            "sentiment_compound": -0.8495
        },
        {
            "id": "h66bdqa",
            "score": 1,
            "text": "If made as an adolescent",
            "title_similarity": "0.048840005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h66be1c",
            "score": 1,
            "text": "I think they should be brought up, the person can show the public they’ve genuinely changed, then we should forgive them. If it looks like they’re just saying sorry so they don’t get shamed, then fuck em. Cancel their bigoted ass.",
            "title_similarity": "0.686751",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h66bkzh",
            "score": 1,
            "text": "I agree..people grow",
            "title_similarity": "0.093633056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h66czau",
            "score": 1,
            "text": "Sweet, only 10 years to go.",
            "title_similarity": "0.32062402",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h66fc55",
            "score": 1,
            "text": "Heres the thing. Using a passive voice like shouldn't isn't meaningful for discussing this viewpoint. It should probably be replaced by \"Companies shouldn't fire\" or \"People shouldn't boycott\" etc. \n\nThe decision to lose jobs in lot of cases is not taken by a single person, but by the market itself which cannot be controlled by anyone, generally speaking. Here's an example. If a popular actor says something controversial and people boycott the actor or the company, the company literally loses revenue. Hence forced to fire the actor as a PR to keep the company running. Who would you lay the blame on ? The people have the right to boycott movies. The company/stakeholders has the right to protect their value. \n\nSo noone really have a real choice in this matter. It's like saying people shouldn't get Covid. Theft shouldn't exist. Milk shouldn't go bad. It just happens and there's little anyone can do about it.",
            "title_similarity": "0.7343768",
            "sentiment_compound": -0.0471
        },
        {
            "id": "h66fhr7",
            "score": 1,
            "text": "Agreed. People change. People make mistakes.",
            "title_similarity": "0.39213765",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h66fksg",
            "score": 1,
            "text": "To be honest I kind of agree with tweets, but different methods of expression can b more concerning. An essay or speech is something someone spent some time thinking on so you can be pretty sure that at one point it was a well formed, intentional thought.\n\nWhile time passing can change people it isn't clear that this is always the case especially when they get into a new position where they cant realistically express these views. So in the cases where those prior views could impact the way they do their job and there's no sign of retribution or reversal of previous views, I think it can be called for. That said this is relatively rarely the case",
            "title_similarity": "0.7597438",
            "sentiment_compound": 0.7951
        },
        {
            "id": "h66fmbt",
            "score": 1,
            "text": "I think it greatly depends on what they gained by holding those views and making those comments until they are called out on it.\n\nI think a lot of people overlook that the people being called out (and losing opportunities) aren't average people. They are rich, famous, powerful and usually have been since their actions or remarks. And those behaviors don't happen in a vacuum. They occur because they help an individual to gain acceptance into a social ingroup.\n\nSo the question becomes can we forgive, not only the initial grievance, but also all that might have been profited from that initial grievance.\n\nI think people en masse are right to boycott, put pressure on brands, and exert this indirect pressure on these largely insulated targets. It's the only recourse left when the Justice system, Politicians, Leaders, Law Enforcement, shame, and all other meaningful social mechanisms have failed.",
            "title_similarity": "0.84075755",
            "sentiment_compound": -0.6757
        },
        {
            "id": "h66hwuw",
            "score": 1,
            "text": "When has that actually happened?",
            "title_similarity": "0.05407708",
            "sentiment_compound": 0.0
        },
        {
            "id": "h66lcvp",
            "score": 2,
            "text": "something I haven't seen discussed is often times it's how someone responds to these old ghosts coming to light that decides whether the general public forgive them or not. It's about whether they have already changed or not. For example, JennaMarbles was pretty much told by most of the community her past mistakes are clearly things she's since worked on and they could all move on from. She apologized genuinely and showed her viewers without trying to that she had changed. Now Shane Dawson posted a similar apology video but widely rejected because it was obvious his mistakes were not only more egregious but he hadn't learned from them. His apology came off to many as avoiding the fallout rather than taking accountability. Sure we all make mistakes, but what we do about them is whats important not just for ourselves but for others around us.",
            "title_similarity": "0.78914523",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h66mcu7",
            "score": 1,
            "text": "I said shit I don't agree with like a year ago.",
            "title_similarity": "0.4263714",
            "sentiment_compound": -0.7795
        },
        {
            "id": "h66migl",
            "score": 1,
            "text": "I think back on some of the racist comments heard in work or school and ask myself “Why did I not speak up every time?” Because I was SCARED!",
            "title_similarity": "0.68363047",
            "sentiment_compound": -0.837
        },
        {
            "id": "h66ml03",
            "score": 1,
            "text": "This heavily depends on how old the person was when the comments or actions occurred.\n\nIf the person was 15 and now is 25, I can totally buy that the person has matured a lot in the time since.  As long as the person has fully acknowledged the wrongness of what they did, I'd be inclined to give them a pass, given that everyone did and said stuff they really shouldn't have as an edgy teenager.\n\nOn the other hand, if the person was 65 and is now 75, they'd better have a pretty big life-changing event to be able to point to for why they're completely different now, because as a general rule, people quite simply do not change that much between the ages of 65 and 75.  If someone said or did something fantastically racist at age 65, odds are that they still believe the same thing to the exact same degree at age 75.",
            "title_similarity": "0.7280916",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h66nuv4",
            "score": 1,
            "text": "It's so short sighted as well. If you say something I don't like and then I get you fired, you still need to pay rent and eat so you have to get another job. If you can't, if the outrage mob follows you to the next place, then you go on welfare and now my tax dollars are funding your life.",
            "title_similarity": "0.64959335",
            "sentiment_compound": -0.32
        },
        {
            "id": "h66qy5v",
            "score": 1,
            "text": "I think it matters if their public view has changed since then. If the first apology they make is when the get found out then it's hard to feel sorry for these people. Then there are the extreme examples like Bill Cosby.",
            "title_similarity": "0.7325525",
            "sentiment_compound": 0.3353
        },
        {
            "id": "h66vt7c",
            "score": 1,
            "text": "Thank you for this. People need to be forgiven for youthful mistakes. We all mess up and we all grow up.",
            "title_similarity": "0.70548785",
            "sentiment_compound": 0.34
        },
        {
            "id": "h66wv1z",
            "score": 1,
            "text": "Once a horn 16 year old, always a horn 16 year old.",
            "title_similarity": "0.33834916",
            "sentiment_compound": 0.0
        },
        {
            "id": "h671dow",
            "score": 1,
            "text": "In general I agree. I think if you looked up any of our tweets from when we were in our early 20s you may find some crazy things. I was an edgelord in high school. \n\nThat being said, there could be examples of things that may be relevant. Let's say a 60 years old is running for office and we find something that they wrote about black people being subhuman and lazy when he was 48. \n\nThis person was old enough to know better and likely had a mature mind. It would be completely reasonable to question what kind of person they are. Could they have had a change of heart over the past 12 years? Sure. But it is just as likely that they hold the same beliefs.",
            "title_similarity": "0.7017748",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h672ub5",
            "score": 1,
            "text": "When you get older you’ll realize 10 years isn’t that long… people who murder or sexually assault people and only get caught 10 years later still need to be held accountable…",
            "title_similarity": "0.7346113",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h673xn4",
            "score": 1,
            "text": "Nah they should have been reprimanded to start with and cancelled 10+ years ago.",
            "title_similarity": "0.67273736",
            "sentiment_compound": -0.34
        },
        {
            "id": "h677iss",
            "score": 1,
            "text": "I think comments and actions of our past should be taken into account when considering who a person is or what they are like. But it can only be a part of your assessment, things can easily be taken out of context and people do change. People also stay the same though, so ignoring past words and actions is detrimental to your assessment.",
            "title_similarity": "0.6773752",
            "sentiment_compound": -0.2232
        },
        {
            "id": "h679cir",
            "score": 1,
            "text": "Cancel culture can be toxic. Though I do believe some people deserve it but only if they’ve done something horrible and illegal. Most things can be learning experiences and I believe most people mature and grow through life and most deserve a second chance. Now if they are repeat offenders? That’s a different story. Imagine being punished or canceled for every stupid thing you’ve done or said in your life; especially if you were young and dumb.",
            "title_similarity": "0.75881886",
            "sentiment_compound": -0.9714
        },
        {
            "id": "h679e5s",
            "score": 1,
            "text": "generic reddit audience\n(theresnoway)",
            "title_similarity": "0.28015995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h679k3h",
            "score": 1,
            "text": "For the most part I agree, however I think politicians should not flip flop whichever way the wind blows as most of them do around an election period.  The posturing they do is abhorrent to me.  If you hold political office you should be scrutinized in my opinion.  If you held certain views for the first 50 years of your life chances are that you aren't changing them by any appreciable amount (again, just my opinion).",
            "title_similarity": "0.74800897",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h679v6r",
            "score": 1,
            "text": "Agreed. However if used to establish a pattern of abusive behavior it is necessary. \n\nAlso certain things should never have a time limit for prosecution. Rape, assault on a minor, creating or distributing CP, animal abuse and murder.\n\nA tweet shouldn’t end your life if it’s from ten years ago. Unless you tweeted something similar two months ago and now we have a pattern for how long you’ve been like this. Certain things cannot be fixed with apologies. Denial of genocides and other “wrong side of history” quotes should count as hate speech and come with a social media ban. Maybe also a ban from public positions. \n\nLike a Holocaust denier cannot run for office or have any social media for a set period of time. Some less obvious things are people denying the history of native Americans and African slavery. Saying things like “slaves were treated well” or “there was no civilized people here until Europeans” should get you a nice social media ban for a year per each statement. This should also prevent you from running for public office for the same amount of time.\n\nSaying dumb evil or fucked is shit online shouldn’t mean you become homeless. But you should loose your phone and computer for a while.",
            "title_similarity": "0.75455916",
            "sentiment_compound": -0.9809
        },
        {
            "id": "h67bahp",
            "score": 1,
            "text": "I agree that how long ago should play a factor but it's also worth comparing what was acceptable at the time it was spoken. I feel like that is where a lot of the problematic ones stem from.",
            "title_similarity": "0.5944345",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h67dsg2",
            "score": 1,
            "text": "I somewhat agree with you but not fully. Sometimes people change, mature, grow and become better persons, granted but sometimes it's the exact opposite. \n\nAlso, it depends on what they did or said. If you are working at a Day Care and I find out you made some comments back then that suggest you're into children, I'm sorry but I'm going to fire you. \n\nI've lived long enough to know that for a person to change it takes a lot of work, time and effort but most importantly it takes people to recognize they are in the wrong and are willing to do all the hard work and this rarely happens and if it happens, then that person needs to prove said change happened and they've become a better human being. \n\nSomeone who was a complete pos racist needs to prove (s)he's not a racist anymore if he wants to keep on working in my full of diversity company, for example.",
            "title_similarity": "0.77918184",
            "sentiment_compound": 0.914
        },
        {
            "id": "h67f503",
            "score": 1,
            "text": "I think age (and really all forms of context, but anyway..) matters a lot. There’s a big difference of ‘ten years ago’ was 21 or 47",
            "title_similarity": "0.5667113",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h67g32y",
            "score": 1,
            "text": "Eh, it depends.",
            "title_similarity": "-0.0020997338",
            "sentiment_compound": 0.0
        },
        {
            "id": "h67gcto",
            "score": 1,
            "text": "Straight up, it depends on how they respond to it coming to light. \n\nHey yeah that was shitty of me, I've grown *and here's evidence of how*. Yeah alright we've all fixed some garbage in our pasts before. \n\nFuck you you don't have any right to look at my past? Ok so you're not disavowing any part of this and you are effectively making a tacit announcement that you endorse that attitude. Bye bye job.",
            "title_similarity": "0.7539002",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h67igqu",
            "score": 1,
            "text": "People shouldn't lose their jobs for their opinions today either. What good is freedom of speech (with respect to the law) if you can have your entire livelihood stripped away for not adhering to particular sociopolitical agenda?",
            "title_similarity": "0.7123476",
            "sentiment_compound": 0.9225
        },
        {
            "id": "h67kpjc",
            "score": 1,
            "text": "Generally, I would agree with you.\n\nHowever, there are some very crucial exemptions.\n\nIf you're a director hired to helm an LGBT filmed aimed at an LGBT audience and that very same audience sees that you posted anti-LGBT tweets years ago...\n\nIt makes business sense to fire you. Since you would harm the bottom line of the company that hired you.\n\nAt its core, \"cancel culture\" is not about ethics. It's about profit.",
            "title_similarity": "0.78636205",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h67kx89",
            "score": 1,
            "text": "So for example, you think Bill Cosby deserves no reprimand for any sexual assaults he committed between the ages of 18-74.  Correct?",
            "title_similarity": "0.57217324",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h67mimv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03450355"
        },
        {
            "id": "h67nl3j",
            "score": 1,
            "text": "People shouldn't lose their job at all for shit they post on social media unless it's on a work account \n\nWhat I post on social media is none of my boss's business",
            "title_similarity": "0.61894333",
            "sentiment_compound": -0.3274
        },
        {
            "id": "h67noo9",
            "score": 1,
            "text": "Have you seen Bojack Horseman? Sure, people can change, but like Bojack who eventually did change, you gotta answer for your wrongdoings sometime. If you never face consequences, I don't think you ever truly change. Sometimes consequences are brought by your own actions (like addiction and its consequences on Bojack's relationships being the consequences he faces) or they are legal and public consequences (like how he's eventually outted to the public for everything he committed). I think people should face some kind of consequences to their actions. 10 or 15 yo, no one batted an eye to hate speech on social media. The same things the public now frowns upon were widely accepted and protected behaviors. Now, you can face real legal and social repercussions for the same actions. To me, it seems fair that you can face those repercussions now for something so old considering societies are now evolving and holding people accountable more and more and individuals should be evolving as well. I believe people change sure, but for an employer, they can have no guarantee of that and if they don't, it's only fair to them and their reputation to fire the employee who has done something wrong years ago that is currently affecting the employer's business and reputation. Ofc, not all employers do fire employees in these situations and only do when the employee becomes a liability and firing them is less costly than keeping them. So consider that; employers rarely fire employees for ethical reasons, they do it to protect themselves and their revenue. When that's not in jeopardy, trust me no one is facing consequences for anything.",
            "title_similarity": "0.79712534",
            "sentiment_compound": 0.9276
        },
        {
            "id": "h67o6ov",
            "score": 1,
            "text": "Putting on \"black-face\" at a college party or posting bigoted comments on-line should not be the proverbial death sentence a decade later. BUT, hopefully that individual has a track record of human decency along the way. It's not a black or white issue, and many treat it like it is.",
            "title_similarity": "0.7106081",
            "sentiment_compound": 0.872
        },
        {
            "id": "h67ou9i",
            "score": 1,
            "text": "Ten years ago when you're 22 seems like a million years. But ten years when you're 40 or 50 doesn't seem that long ago.\n\nSo I would be more likely to say forgive someone for racist or sexist tweets if they made them when they were 22 vs when they were 42",
            "title_similarity": "0.74152994",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h67pm4g",
            "score": 1,
            "text": "It took the government 30 years to find the man that stabbed my uncle 13 times in his own bed and left him to bleed to death.",
            "title_similarity": "0.47365093",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h67q40z",
            "score": 1,
            "text": "Does this include things like judges being serial rapists?",
            "title_similarity": "0.44976485",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h67qd7y",
            "score": 1,
            "text": "I think as long as they’ve actually changed, they should be forgiven",
            "title_similarity": "0.40522352",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h67riju",
            "score": 1,
            "text": "Consider this: how many people come forward to say they’ve grown and apologize for their 10 year old comments *on their own*, rather than being “caught” or found out and only *then* apologizing? Should we treat them both equally? If someone doesn’t apologize for things they’ve said until they’re publicly criticized, should we give them as much credibility if they say they’ve changed? Are they really just apologizing to avoid criticism? Did they regret what they said, or do they *really* just regret that what they said was publicized?\n\nI certainly respect people that have grown, do some introspection, admit past mistakes, etc. Doesn’t it kind of devalue that hard work (and it *is* hard work) to say we should automatically ignore what people said ten years so, even if they’ve shown no remorse or regret until put on the spot?",
            "title_similarity": "0.88524073",
            "sentiment_compound": -0.8004
        },
        {
            "id": "h67sfz5",
            "score": 1,
            "text": "Billie Eilish got away with it:\n\nhttps://www.npr.org/2021/06/22/1009042029/billie-eilish-says-she-is-sorry-after-an-old-video-shows-her-mouthing-a-racist-s",
            "title_similarity": "0.5743482",
            "sentiment_compound": 0.0
        },
        {
            "id": "h67swju",
            "score": 1,
            "text": "I transformed from an ultra liberal to a jaded centrist for this reason. The right are insane and buy into fringe theories which have no basis in facts. The left are the same, but also spineless, and have to seek out anything they can in order to try and ruin someone else's life. I hope the USA calms the fuck down and everyone learns the glory of silence again or I'm gonna have to move somewhere where people aren't such dipshits and cowards. Maybe sweden",
            "title_similarity": "0.71784616",
            "sentiment_compound": -0.3919
        },
        {
            "id": "h67un39",
            "score": 1,
            "text": "Actions have consequences, some of them come late.",
            "title_similarity": "0.3419596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h67vb8b",
            "score": 1,
            "text": "Just because I was a self proclaimed sausage gobbler 10 years ago doesn't mean I am one now. My pallette is now refined. I currently gobble wiener schnitzel. A man of culture, if you will.",
            "title_similarity": "0.59173155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h67vplr",
            "score": 1,
            "text": "Oh, the modern times witch hunting. Your society hasn't changed that much since then.",
            "title_similarity": "0.47718564",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h67w27g",
            "score": 1,
            "text": "If you make overly broad rules to this, there will always be exceptions. \n\nHad Weinstein stopped molesting/raping/assaulting/abusing folks in 1999, should an apology just cover it and we move on?\n\nShould an apology mean that David Irving is forgiven for decades of anti-Semitism and Holocaust denial?\n\nSure, I agree that someone's old comment, joke, or faux pas that was a bit toxic shouldn't \"cancel\" them...assuming they do apologize, and refrain, we can all move on. \n\nBut I'm not in favor of letting, say, the Kevin Spaceys or the Holocaust deniers of the world offer an apology and move on with their public lives. \n\nThere have always been social, not to mention legal, costs to unpopular speech. Free speech doesn't mean consequence free speech. And when it comes to \"actions\", there are some seriously messed up actions people take that *should* ostracize you from society. \n\nLike grabbing people by their genitals, without their consent.",
            "title_similarity": "0.81205785",
            "sentiment_compound": -0.4997
        },
        {
            "id": "h67w2gl",
            "score": 1,
            "text": "Imo if it’s comments then no they shouldn’t be outcast for it. But actions on the other hand is different",
            "title_similarity": "0.44724023",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h67xxku",
            "score": 1,
            "text": "I think it depends on the situation. In my opinion if it was something severe like being a member of the KKK or sexually assaulting someone, they shouldn’t be so easily forgiven. \n\nBut with things like Billie Eilish ignorantly mouthing an anti asian slur when she was 12 and she literally cringes at the fact that she even did that, I think we should give leniency towards that. If you’re so ashamed of something that you wish you could take it back and express that in your apology that helps. After all, if we don’t look back on our younger selves and cringe, we’re not really growing or maturing.\n\nReally there’s probably a whole bunch of shit all of us would have to apologize for doing in the past if it was documented, but since it wasn’t we haven’t had to.",
            "title_similarity": "0.7843655",
            "sentiment_compound": -0.7871
        },
        {
            "id": "h681xit",
            "score": 1,
            "text": "The realistic best solution is to tell people to fuck off if you find yourself in this position, but people get nervous about it. If everyone stopped letting it happen and stopped apologizing for everything it would be over.",
            "title_similarity": "0.7392386",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h684kgc",
            "score": 1,
            "text": "Whatever you set the timeline to, rich people will use it to avoid consequences. Theranos was a DISASTER and a massive fraud. Elizabeth Holmes hasn't even STARTED her trial. She's most recently used a \"surprise pregnancy\" to avoid appearing in court.\n\nIn the rest of the world, \"right to be forgotten\" is a thing. \n\nIn America, you just have to hope you're rich, then there's no consequences (eg. Little Wayne was able to just pay trump for a pardon)",
            "title_similarity": "0.7231113",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h686s35",
            "score": 1,
            "text": "I think it depends on how long ago something happened. Like if a someone made a certain remark that was barely socially acceptable 30+ years ago but is now considered cancel worthy I think that person should get the chance to apologise and distance themselves from it without further repercussions. However, if someone's racist rant from 2 weeks ago gets leaked nobody is going to believe them if they say they've changed their views in such a short period of time.",
            "title_similarity": "0.7855041",
            "sentiment_compound": -0.3589
        },
        {
            "id": "h68795z",
            "score": 1,
            "text": "Ok two views on that:\n1. you are correct in a way that people change. \nThey can learn from mistakes and grow as a person. It should also be acceptable to make mistakes and learn from them - sometimes, the shame you felt is enough to let you overthink your values. \n\nBut then again - people don‘t change. They will just say sorry and for the rest of their lifes they will either never mention the topic again in public or finds people who liked the things you said before. \n\nIf I make fun of the holocaust 1998, as a citizen of a country that killed jews, I can‘t represent the olympics 23 years later.",
            "title_similarity": "0.7979232",
            "sentiment_compound": 0.0
        },
        {
            "id": "h68a8bn",
            "score": 1,
            "text": "The problem with this is that the issue is so politicized ....that you have one side which is hyperfocused on the issue (conservatives) whilst the otherside (democrats) will swear it doesn't exist, simply because being cancelled for liberal ideas is less frequent.\n\nBut the problem with this is .....society changes over time...so it is unfair....to for example judge somebody for 20yr-old homophobic comments, when we all know that **society itself**was way more homophobic 20 years ago.\n\nThat's  as ridiculous as looking into a person's childhood...and calling a 30yr old man immature, for things he did when he was 8yrs old.",
            "title_similarity": "0.7551612",
            "sentiment_compound": -0.85
        },
        {
            "id": "h68cm7e",
            "score": 1,
            "text": "I do agree with you in isolation. However, in most cases like this, the old \"evidence\" is mainly made relevant through ongoing issues. Few people get sacked for simple comments unless there is more reasons to let them go. When a leading figure in the food media company \"bon apetit\" got slammed for \"hispanic-face\" and dressing like a \"gangbanger\" at an old halloween, this was together with large discrimination cases in the company.",
            "title_similarity": "0.7912678",
            "sentiment_compound": 0.6222
        },
        {
            "id": "h68ddvc",
            "score": 2,
            "text": "Say racist comments made by an actor 10 years ago are revealed. Individuals may feel upset by their comments. If they have experienced or witnessed racism they may be particularly hurt or angered by the comments, especially if it is an actor they hold great respect for. They may not want to see the upcoming film the actor is in. These people express their feelings online. Reporters then write articles on the comments, and writers publish opinion pieces. The people behind the movie see the reaction and are afraid of losing potential proceeds. They decide to fire the actor to avoid an economic loss. \n\nIn which part of this scenario should things go differently? Should people not feel hurt or angered by the actor’s comments? Should they not want to boycott the movie? Should they not express those feeling online? Should the media not report and write on the situation? And, should the producers of the movie not make the decision they view is in their economic interests?  \n\nThe actor is free to respond. They can apologize, show how they have changed, maybe show support for an anti racism campaign. But, people may not find their apology sincere or believe that they have truly changed. These people may not want to support this person by watching their shows or movies anymore. They may not be hired because studios would view them as an economic risk. Personally, I don’t have an issue with this. I think people should be free to decide for themselves whether they think a person has truly changed and if they will support that person in the future, regardless of how much time has passed.",
            "title_similarity": "0.8189274",
            "sentiment_compound": 0.7784
        },
        {
            "id": "h68flxf",
            "score": 1,
            "text": "Depends on the action. \nI am not for forgiveness about pedophiles or such kind of crimes. \n\nBut having said some bullshit 20 years ago... could probably be ignored, especially since you changed your mind. \n\nWell, of course if you are promoted ar your city council to manage the budget and someone found 10 years ago you stole in the supermarket you were working in, I think it would be reasonable to fire you. \n\nIt's really a case by case.",
            "title_similarity": "0.76484495",
            "sentiment_compound": -0.7436
        },
        {
            "id": "h68jro0",
            "score": 1,
            "text": "It depends. If you did something that was not taboo in the past but now is, in my book it’s ridiculous to be crucified for that. Unless, of course you can’t see why it’s wrong.",
            "title_similarity": "0.6756613",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h68jub0",
            "score": 1,
            "text": "Also, not everyone changes, they just are sorry and embarrassed something came out",
            "title_similarity": "0.5753293",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h68v069",
            "score": 1,
            "text": "If someone was a pedophile but they hadn’t touched kids in 10 years, would you be comfortable with letting them around your family(kids included)?\n\nNot getting caught until 10 years later seems to indicate they’re capable of committing crimes and getting away with it, not that it’s just in the past.",
            "title_similarity": "0.70912695",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h68vew9",
            "score": 1,
            "text": "If modern phones had a breathalyser attached, we would all be getting along much better.",
            "title_similarity": "0.4946485",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h68xv6u",
            "score": 1,
            "text": "If they regretted it they would admit it themselves and apologise before they are trampled by the mob. However most never do\nAs they think it’s forgotten until someone looks it up.",
            "title_similarity": "0.73675793",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6aauqx",
            "score": 1,
            "text": "To say a socially unacceptable comment when you were younger and acknowledge its harm, sure move on as a better person. To expect no consequences to physical or sexual assault or any other immediate dangerous action that took place a few years ago? Keep dreaming.",
            "title_similarity": "0.68672836",
            "sentiment_compound": -0.886
        },
        {
            "id": "h6aq72e",
            "score": 1,
            "text": "I agree I feel like if you made a bad joke that you apologized for it isn’t to bad, but if like you committed a hate crime or sexually assaulted someone then I feel like it is valid, especially if you got convicted for it",
            "title_similarity": "0.62214565",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h6el9t7",
            "score": 1,
            "text": "Technically being a celebrity is a privilege. So is having a job. The capricious mob is allowed to cancel celebrities for whatever. There doesn't *have* to be a good reason or even a reason at all.",
            "title_similarity": "0.66091025",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h6g6d39",
            "score": 1,
            "text": "It's just easier to let people off the hook for something they said 10 years ago. We have all said or did something stupid. If they want to talk about it, or explain, then I think it should end with that. There is enough going on in the world TODAY to focus on.",
            "title_similarity": "0.7881108",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h6m66ar",
            "score": 1,
            "text": "For me it really depends on how it was said. Anything said as a joke is fair game",
            "title_similarity": "0.41278785",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h84uc2d",
            "score": 1,
            "text": "What about if it was two years ago instead? Do they deserve to loose their job then?",
            "title_similarity": "0.4614012",
            "sentiment_compound": -0.3939
        }
    ]
}