{
    "CMV: I'm reluctant to get an electric car because it doesn't feel safe for a woman to stay at a rest stop for 40 minutes to recharge the battery\nI try and spend as little time as possible at the gas station because it feels unsafe. I understand that a lot of men won't know what that's like or even give it a second thought. I like to drive across the country and it doesn't seem sensible for a petite woman to be sat in a $80k vehicle in the middle of nowhere while it charges. I know eventually I'll have to because they won't make gas cars anymore but it's a genuine concern right now while there isn't a huge amount of infrastructure and the charging times are so long. Can anyone relate or allay my fears?": [
        {
            "id": "h6ash5g",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.\n\nThank you for understanding.",
            "title_similarity": "0.6100621",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h68uszr",
            "score": 8,
            "text": "Statistically speaking men are more likely to be the victim of a violent crime than women are. We do know what it's like, arguably better than women do.",
            "title_similarity": "0.4549342",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h68o4p7",
            "score": 31,
            "text": "First off… men do know what it’s like. Men are the primary victims of almost all crimes. \n\nYou think rest stops are more dangerous than gas stations?\n\nI would venture to say more crime happens at gas stations than charging stations or rest stops… regardless of the amount of time you are there.\n\nOn top of that… how many times do you drive cross county’s\n\nAn alternative would be to get a hybrid, runs on cells and gas.",
            "title_similarity": "0.6583012",
            "sentiment_compound": -0.7774
        },
        {
            "id": "h696wy5",
            "score": 48,
            "text": "I assure you that men do experience this kind of fear, it's just that nobody cares. Men are essentially forced to learn how to be courageous, because they are only punished otherwise.\n\nUltimately, you should probably do what we men have to do - accept that your fear is almost certainly irrational. And I say this as someone who knows people who have been physically assaulted.\n\nConsider the following: gas stations have CCTV in case of robbery, be that fuel or convenience store items. They will typically have at least one member of staff there as well. They are also well lit as a rule. Finally, a gas station or equivalent is an obvious place for motor and foot traffic to congregate, increasing the odds of witnesses or potential aid should you find yourself in danger.\n\nAll of this makes them a terrible place for an attack of opportunity, so despite how exposed they may appear, they are actually much safer than many surrounding areas.",
            "title_similarity": "0.6606941",
            "sentiment_compound": -0.7203
        },
        {
            "id": "h68p2j6",
            "score": 11,
            "text": "I don’t know why you brought Sex into it it’s just stoping. It’s literally no different then a gas station. And it’s almost as if there are tools you can use to make yourself more dangerous",
            "title_similarity": "0.6538454",
            "sentiment_compound": -0.6801
        },
        {
            "id": "h68w9yy",
            "score": -2,
            "text": "Get a handgun",
            "title_similarity": "0.021237152",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69eado",
            "score": 2,
            "text": "You think men are perfectly fine pumping gas at 12 am in the middle of nowhere? Everyone is a bit aware, nobody is bullet proof. Doesn't help that men are the primary victim of almost every violent crime. Get a gun and go see a therapist. An electric care is the least of your problems. Also 80k is a bit nuts. Those are only for high end Teslas. Get a 50k Model 3 and you'll be fine. You can charge at home or very public spaces like a restaurant or mall.",
            "title_similarity": "0.7021821",
            "sentiment_compound": -0.593
        },
        {
            "id": "h68xdlq",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h68q41n",
            "score": -1,
            "text": "I understand the concern. I wouldn’t want my wife to be sitting in a strange unknown place for 40 mins without any way to defend herself. That being said I do think you could do a few things to limit your risk while traveling cross country. \n\nFirst, get a concealed carry permit and a handgun, and I can’t stress this second part enough LEARN TO USE IT AND PRACTICE REGULARLY! \n\nSecond, always park in well lit areas and read about the areas you will be passing through to pick the safest charging stations to stop at before you leave. \n\nThird, pick a store like Walmart or target that has charging and a safe place for you to go into while you charge. \n\nFourth, if you must charge somewhere that leaves you sitting in your car during charging stay alert! Don’t be on social media/cell phone. Pay attention to your surroundings and possibly stay on the phone with a trusted friend. \n\nHope this helps.",
            "title_similarity": "0.7956931",
            "sentiment_compound": 0.9391
        },
        {
            "id": "h69f58g",
            "score": 37,
            "text": "The problem isn’t even a gender rooted issue, it’s your fear that’s the issue. And like others have said, there are plenty of other places to charge your car. \nYou can either live your life running away and hiding from problems and situations that cause you fear or you can face them head on and learn that they aren’t problems at all and just something that you’ve created out of said fear.",
            "title_similarity": "0.66385823",
            "sentiment_compound": -0.9371
        },
        {
            "id": "h68o1jp",
            "score": 7,
            "text": "Charge at home?",
            "title_similarity": "0.041292075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h694jbk",
            "score": 42,
            "text": "I'm not sure who has been telling you that men don't have safety concerns when sat in a $80k vehicle in the middle of nowhere while it charges.",
            "title_similarity": "0.7063428",
            "sentiment_compound": -0.357
        },
        {
            "id": "h690uby",
            "score": -1,
            "text": "Invest in a firearm",
            "title_similarity": "0.048174314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h693xtq",
            "score": 30,
            "text": "If you're that worried at being at a rest stop/gas station, you're being a bit paranoid. Preemptively saying \"you wouldn't understand\" doesn't change that. Be smart (like everyone else) and you'll be fine with an electric car. I.e. don't go to a crappy part of town, don't charge your car in public late at night, etc.",
            "title_similarity": "0.7995927",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h68o38j",
            "score": 4,
            "text": "Charge at home.\n\nHow often do you drive cross country?  For those occasions rent a gas car.",
            "title_similarity": "0.53717875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h699mil",
            "score": 4,
            "text": "It's not like muscles or height would protect a man from a gun.  Since women live longer than men on average, I have to question whether your premise that you shouldn't be sitting in vehicle because you are female makes much sense.",
            "title_similarity": "0.7088608",
            "sentiment_compound": -0.2287
        },
        {
            "id": "h6984c6",
            "score": 13,
            "text": "Honestly usually I'm up to being a devil's advocate but don't do shit you don't feel safe doing, even if a bunch of redditors try to convince you otherwise. Don't let your boundaries get pushed. Maybe I'm biased because I follow a lot of true crime",
            "title_similarity": "0.6176268",
            "sentiment_compound": -0.1086
        },
        {
            "id": "h68nygw",
            "score": 6,
            "text": "1) There are chargers are more places than gas stations.  Find a restaurant to charge at; go inside and have a nice meal.\n\n2) If you're that afraid of being somewhere for 40 minutes, do something to help the situation.  Take self-defense classes.  Carry pepper spray.  Hell, get a gun if you want.  *I want to very clear in that the burden of feeling safe should not fall on the woman*, but I understand the reality that men aren't suddenly going to stop doing horrible things overnight, so I always suggest doing whatever is in your power to improve your confidence and your safety.",
            "title_similarity": "0.75846875",
            "sentiment_compound": 0.7349
        },
        {
            "id": "h68tzk0",
            "score": -6,
            "text": "Get a gun",
            "title_similarity": "-0.020536743",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69bthz",
            "score": 3,
            "text": "The amount of times I get chatted up when filling petrol I actually understand your point of view",
            "title_similarity": "0.21867651",
            "sentiment_compound": 0.0
        },
        {
            "id": "h68yyrp",
            "score": 72,
            "text": "I won’t argue that there is a risk, and I won’t argue that as a man, I can’t understand how women feel in situations that can make them vulnerable. \n\nAlthough I will argue that the chances of anything bad happening are still incredibly small and that a bit of planning on your part can drastically reduce that.\n\nIf you’re planning on charging in the most destitute neighbourhood around, then maybe you could rethink that.\n\nMost supermarkets, shopping centres etc have charging points. With a bit of forward planning, even on long trips.. you can ensure you avoid anywhere you don’t want to be.\n\nThat being said I think electric cars are incredibly impractical and will save you no money purely based on the premium you pay for the vehicle.. you can get a solid petrol car for 15-20k. You aren’t making savings anytime soon when you buy a 40-80k car",
            "title_similarity": "0.7439812",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h68ryea",
            "score": 10,
            "text": "This isn't going to be a thing, this is a temporary problem, there will be a fix.  You can't design a new car and then make people wait for an hour at gas stations.  Science and engineering will solve this problem, it's temporary.",
            "title_similarity": "0.756829",
            "sentiment_compound": -0.6155
        },
        {
            "id": "h694f49",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h695pcw",
            "score": 2,
            "text": "Nut up and get a gun.",
            "title_similarity": "0.054982606",
            "sentiment_compound": -0.34
        },
        {
            "id": "h695u3z",
            "score": 2,
            "text": "You could buy a gun.",
            "title_similarity": "0.1103843",
            "sentiment_compound": -0.34
        },
        {
            "id": "h699r4l",
            "score": 5,
            "text": "> it doesn't seem sensible for a petite woman to be sat in a $80k vehicle in the middle of nowhere while it charges.\n\n(If the price is an issue, why not buy a much cheaper car?  Why does the price of the car really enter into it at all?  But that's an aside.)\n\n\nYou've organized your life entirely around having a car and being a car driver and being able to do this one specific activity of \"driving across the country\" over and over again, and almost immediately (\"waiting a few years for a better charging network\" is clearly not on the cards from your other answers).\n\nSo you have set your conditions so tightly that no other solution is possible.\n\nTo change your view, you must give up some of this almost unlimited freedom and flexibility.  Whether you will do that or not depends on whether you value your freedom to consume over the future of our biosphere.\n\n----\n\nThis is a big picture decision that people make every day.\n\nPeople theoretically sorta kinda don't want the climate to be devastated, a million species extinguished, most of the tropics uninhabitable by humans, wide-spread decade-long droughts and devastating storms and wildfires and heat waves that scour the land, and all this dreary, boring stuff.  \n\nNo one wants that!, but avoiding these awkwardnesses is a very distinct secondary goal compared being allowed to _consume as much as one has the money to do so._\n\nEveryone's willing to pay a few cents more for a product with a green sticker on the label, but to avoid necrotizing the world's ecosystem would require people in developed countries to give up the majority of our consumption, to live more modestly and frugally to at least mitigate the incredible debt we have rung up for our children and their children all the way down the generations by devastating the world's environment and its climate.\n\nClearly our institutions are not stepping up to the plate.  Waiting for those \"100 corporations\" to act will see us all dead of old age.  Individuals must lead by example.  And if that example leads to nothing, well, we at least mitigated _our own_ guilt in this clusterfuck of unbelievable proportions.\n\n(Since everyone asks at this point, my wife and I have no kids, a plant-based diet, haven't flown in years, haven't ordered from Amazon in years! I have never owned an internal combustion engine of any type and go everywhere by bike or if it's too far, public transportation.  And I have a rich and to me luxurious life - I'm looking out at birds flying over a canal as I write this.  None of this should make a difference to my argument.)",
            "title_similarity": "0.8502433",
            "sentiment_compound": -0.9791
        },
        {
            "id": "h695q14",
            "score": 4,
            "text": "Get a gun.  Problem solved.  Better yet, get a taser.",
            "title_similarity": "0.19478917",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h69tkks",
            "score": 4,
            "text": "If it makes you feel better men are attacked more often than women in general",
            "title_similarity": "0.4100921",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6972y4",
            "score": 1,
            "text": "First of all, you can be inside the car with the doors locked. Secondly, technically men are four times as likely to be the victims of violent crime. None of us should have our guard down when alone, but the world isn’t as dangerous as you might think from how modern online news portrays it. Get a gun and take some courses if you’re worried, the great equaliser against a large attacker.",
            "title_similarity": "0.7092048",
            "sentiment_compound": -0.936
        },
        {
            "id": "h69g023",
            "score": 1,
            "text": "First, fuck creepy dudes, scum of earth.\n\nSecond, to answer that question, wear a really baggy hoodie and apply tinted windows to ur car.",
            "title_similarity": "0.48586714",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6a8th0",
            "score": 1,
            "text": "Some people seem to me missing the point here.  She is not talking about rolling between Tulsa and Oklahoma City. I also travel long miles across country and there are stretches in places like New Mexico where there is very little or nothing, including gas pumps, hotels, and 'public outlets'. Places you need to plan and pay attention. Saying she could stop somewhere and use a public outlet would also mean that she would have to know exactly where public outlets are,  hope there isn't a line of others who have just driven that long haul and further hope the charging outlet is not down. In the meantime it would be damn scary to be in the middle of nowhere knowing that your battery is running down. The technology and charging port availability needs to VASTLY IMPROVE before I would buy electric.",
            "title_similarity": "0.80134326",
            "sentiment_compound": 0.3034
        },
        {
            "id": "h6and0i",
            "score": 1,
            "text": "Whats not safe is the 40,000 people who are killed by cars in the USA every year.\n\nWhat's not safe is the million who are seriously injured by cars every single year.\n\nI guess  you don't really care about safety of other people.",
            "title_similarity": "0.76889765",
            "sentiment_compound": -0.9099
        },
        {
            "id": "h69a0iu",
            "score": 8,
            "text": "It's weird that so many commenters are trying to change your mind about how you feel about safety vs how you feel about the safety of electric cars during charging.\n\n\nThe bottom line as has been mentioned multiple times:\n\n1. You typically charge where you sleep (and during errands you'd already be doing regardless of the electric car). Level of danger is unchanged in those locations, and need to be waiting at a gas station or charging area at all will be less.\n\n2. Charging stations will be continuously improved and today's 30 min charge will be tomorrows 15 minute charge, and soon this will be halved again.\n\n3. You may want to consider other safety features such as a sentry guard that Tesla has as part of your decision making",
            "title_similarity": "0.80007434",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h694u5y",
            "score": -1,
            "text": "I agree with OP. I really don't understand the draw of electric cars, other than the cool factor and the fast acceleration. You can get a Prius prime that gets 100 mpg. If you are really worried about gas prices and the environment you can just get one of those and you can extend the range at a gas station with gas if you need it, can go electric for routine trips. Having to stop even for 20 minutes at a gas station just sounds awful. Trying to figure out how to build all that infrastructure just seems like a headache and a step back in terms of convience. If I had enough money for a spare car I would definitely get one for short trips, but it just seems like the range anxiety would suck and there is no way to really fix that.",
            "title_similarity": "0.8326782",
            "sentiment_compound": -0.5341
        },
        {
            "id": "h697745",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h68xsyb",
            "score": 6,
            "text": "Fyi 80k is way too expensive. My 3 year lease cost $7,000",
            "title_similarity": "0.54858726",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h690yw6",
            "score": 3,
            "text": "You stay locked inside your car",
            "title_similarity": "0.24274665",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69nz7h",
            "score": 3,
            "text": "It's weird how women always assume that background buzz of constant fear just doesn't exist for men.\n\nIt certainly does for me, when alone and even with others I'm constantly doing the math on whoever or whatever, perhaps even seemingly innocuous presence is there.\n\nIt's basic common sense.",
            "title_similarity": "0.695686",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h69e1pz",
            "score": 6,
            "text": "Mm, that's possible never thought about that as a guy. Just get a charger installed at your house & charge it full at night, you shouldn't have to go more than 200 miles in a day unless you're traveling out of state daily.",
            "title_similarity": "0.73152983",
            "sentiment_compound": 0.0
        },
        {
            "id": "h697mkh",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h68q708",
            "score": 660,
            "text": "You charge it every time you're home. You will leave every time with a full charge. How often do you drive 400+ miles in one trip? If you do long trips like that it is advisable to rent a car anyway.\n\nAlso for someone with a deep fear of being alone in the middle of nowhere for any amount of time longer than 30 minutes, why in the world do you like to drive across the country alone?",
            "title_similarity": "0.7872673",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h6934cb",
            "score": 4,
            "text": "You generally are not going to have that kind of charging for the kind of driving you want to do. You'll recharge at a hotel over night or maybe a restaurant or something. It's not going to be feasible to drive the kind of distances you want with only a 40 min charge if EVs ever become the majority. It simply isn't possible for battery cars to operate like gas cars at scale; gas stations serve hundreds of cars per day with a stopover of ten minutes or less.\n\nIf we get to  that point, more likely than not driving like you do will be changed to be  a lot less common, and people will just drive less distances over all. The cost of most cars is getting prohibitive as it is. \n\nAlso I second some of the commenters here. You sound like you have a lot of anxiety in general. If it's due to past trauma you may want to seek counseling.",
            "title_similarity": "0.8658291",
            "sentiment_compound": 0.0747
        },
        {
            "id": "h699hp4",
            "score": 0,
            "text": "So, you might have to change your travel behaviors. Take a train across the country. \n\nThere’s a degree of entitlement that comes with the assumption that driving by yourself across country is a reasonable expectation.\n\nAlso, being in public around other people is the safest place a woman can be. You can time your schedule snd charging location so that you aren’t charging in quiet, unsafe locations. \n\nLastly, charging times are shrinking. You can do a fast charge in 20 minutes.  I’m sure they will shrink further.",
            "title_similarity": "0.6993052",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h69e53k",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69j1ql",
            "score": 0,
            "text": "Carry pepperspray. Spend less of your energy obsessing over every tiny thing that could possibly go wrong. The vast majority of attacks on women come from someone she already knows anyway. You are probably more likely to crash and die while driving than to get attacked by a stranger at a gas station.",
            "title_similarity": "0.78543305",
            "sentiment_compound": -0.9471
        },
        {
            "id": "h69lqng",
            "score": 0,
            "text": "Where do you live that it's so dangerous for women to be outdoors alone?",
            "title_similarity": "0.58189785",
            "sentiment_compound": -0.7177
        },
        {
            "id": "h69n4ep",
            "score": 0,
            "text": "The bigger issue here is that there is an unwarranted amount of fear for some routine activity. Hard to find data on this, but gut reaction tells me you're more likely to be harmed when driving than to be harmed recharging/refueling. Risk assessment seems off.",
            "title_similarity": "0.6546732",
            "sentiment_compound": -0.9032
        },
        {
            "id": "h69nk9c",
            "score": 0,
            "text": "If you feel unsafe at a rest stop something is either really wrong with where you live and you should move or you should start working on yourself. I mean, just go there now and get used to sitting there for half an hour without your vehicle and get used to not being attacked.",
            "title_similarity": "0.7245523",
            "sentiment_compound": -0.4789
        },
        {
            "id": "h69o5s4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69y3nu",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69yj0b",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69zu46",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6ac1it",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6aerj6",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6ajnbf",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6akb8w",
            "score": 0,
            "text": "Omg I couldn’t imagine being this afraid daily. Kind of pathetic tbh.",
            "title_similarity": "0.528561",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h6amsjc",
            "score": 0,
            "text": "Im having trouble taking this seriously. Every 40 minutes? Man the fossil fuel industry’s propaganda definitely works.",
            "title_similarity": "0.61492467",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6an3il",
            "score": 0,
            "text": "Then move.",
            "title_similarity": "-0.1789667",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6anr7x",
            "score": 0,
            "text": "Wait in your car? Call someone? Only go to well lit ones if its at night? Or avoid going at night? Idk this sounds a bit dramatic, or hyperchondriactic, if that's even a word.",
            "title_similarity": "0.62024397",
            "sentiment_compound": -0.3527
        },
        {
            "id": "h6aogtv",
            "score": 0,
            "text": "Buy a gun\n\nDon’t live in a country where you can get one? \n\nGet a gasoline car",
            "title_similarity": "0.5734279",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6appgv",
            "score": 0,
            "text": "If you really feel that unsafe doing a mundane activity then get a CCW.\nIm dead serious, everyone should do absolutely anything within the law to feel safe anywhere they go, whether it's a street corner at 3 AM or the middle of the couger infested woods at 3 AM.\n\nDownvote me all you want, but a mundane activity being unsafe is extreme, and carrying isn't extreme.",
            "title_similarity": "0.6166533",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6bauus",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bb4au",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bj8k1",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bjta3",
            "score": 0,
            "text": "I'm sorry there's been so many haters and unsympathetic replies on here, especially given the trauma you experienced.  And I'm sorry that happened to you.  *virtual hug from a distance*  \n\nSo out of curiosity I looked up Tesla charging stations for my state - Missouri - and how it would impact my travel if I did my various semi regular trips to see family across the state - 200 miles and 250 miles depending on who I visit.  My family live in 2 areas of the state, and both a small distance from a town or city.  The only one that looked \"challenging\" was going to my grandparents a little ways NW of St Louis.  The nearest current chargers from them are 50 miles directly away from my home (Kansas City).  My other family it's only 15-20 miles to a supercharger in town.  But again - both destinations are family.  Even if I was only there for 6 hours, that's enough to get a good chunk of regular charging done, and even a few hours would get me to the next charging station.  \n\nLooking over the whole state, only the SE 1/4 seems empty of chargers, and I do sometimes camp and float down that way.  So my vacation camping plans would now include renting a car.  For the rest of my driving nothing would drastically change.  \n\nThe more common these cars become, the more common the chargers become.  As the market expands, the government will probably step in at some point to incentivize things - like making a universal electric charger and giving money to states to quickly put in a large number of stations.  The government stepped in to force the adoption of electricity in large portions of the US in the early 20th century, they stepped in and created standards for gas and gas stations - they'll do the same again at some point for electric vehicles and charging stations.  \n\nMy recommendation - rent an electric car and try it out for a full week.  Go to work for 5 days and charge it at night at home, and then look up the maps for that vehicle and plan a small weekend trip to see how difficult it is.  Grab a friend and just see how you like it.  Tell them you're just test driving the car but really you're just making yourself adapt to what the future will probably hold at some point for all of us.  How do we get to distant point and back while keeping the car charged?  For me, visiting my grandparents is the only one I'd have to be very certain to plug in while I was there, and maybe a charge at the halfway point of the drive just to be safe, otherwise not much would change.  Maybe most of your trips have lots of charging stations you don't know about.  I discovered there's one less than a mile from me... I had no clue it was there.  \n\nI wish you luck and good fortune whatever you decide to do, and am sending love and healing your way.",
            "title_similarity": "0.8245132",
            "sentiment_compound": 0.9886
        },
        {
            "id": "h69782a",
            "score": 1109,
            "text": "As a petite woman myself who enjoys long road trips.... just literally park your car, let it charge and go about your life. Whether you want to sit inside the locked car or go inside a restaurant while you wait. I don't know where you live, but life isn't as dangerous as your anxiety is making you think. Be aware, take normal precautions, but you cannot live your life afraid of everything. Driving a car is inherently more dangerous than charging a car, or filling up gas.",
            "title_similarity": "0.7768101",
            "sentiment_compound": -0.252
        },
        {
            "id": "h69dlrh",
            "score": 1,
            "text": "I'm not sure what country you are in, I assume UK or USA, but your chances of getting attacked at a rest station is very low in those countries. You might feel anxious now, but after going to rest stations for a while and seeing that nothing bad happened, you should feel a lot less anxious (exposure therapy).",
            "title_similarity": "0.6303312",
            "sentiment_compound": -0.7316
        },
        {
            "id": "h69dxnc",
            "score": 1,
            "text": "My first recommendation is to keep some sort of self defense weapon with you at all times. Not that I could ever truly get it but being a woman is scary. My wife always keeps a pepper spray on her key chain. You can do that and go as far extreme as a gun if you really want. I just recommend you always have 1 or 2 things to give you a chance to defend from an attacker.\n\nAnother recommendation, if you do have stop at some sketch place to charge the car make sure you're in light and near cameras if possible. Unfortunately there's no true way to guarantee your safety and this also applies to gas stations. If you feel more comfortable you could always have a friend willing to face time or call when you're somewhere sketch. My wife and her friends will call each other for company a lot when they are in those types of places (more her friends because I'm usually with her when we go anywhere).\n\nJust stay safe, I personally know far too many women who've been victims of sexual harassment and worse. Just make sure you can defend yourself and you have caring people willing to help you.",
            "title_similarity": "0.7461015",
            "sentiment_compound": 0.9451
        },
        {
            "id": "h69ijlp",
            "score": 1,
            "text": "Without getting into politics, I really encourage you to look into conceal carrying a firearm. Check out this list of gun organizations and guides for women https://futurefemaleleader.com/9-pro-gun-organizations-just-women/  Again set politics aside and view it as a tool to keep you safe. There’s a reason why they call a firearm the great equalizer, it puts everyone in the same playing field.",
            "title_similarity": "0.5796155",
            "sentiment_compound": 0.8748
        },
        {
            "id": "h69ijum",
            "score": 1,
            "text": "I’m a woman. A very small woman. But maybe a brave one? Idk. 40 min at the gas station or rest stop isn’t a big deal. I nap in the parking lot sometimes. Just carry a weapon if you fear living.",
            "title_similarity": "0.73926383",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h69j622",
            "score": 1,
            "text": "Safety is an illusion. If someone wants to harm you, they will. You're just biased by what you observe in the media and need to rethink your views on 'safety'. \n\nYour argument is like the one for meeting some random guy in a bar versus on a dating app. Good and bad people use both, it is just that one of them has been targeted by the media to trigger your fear and views/clicks.",
            "title_similarity": "0.6384218",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h69ktml",
            "score": 1,
            "text": "Get a permit to carry so you can defend yourself. Don’t act like there’s no option and you are always in danger because you are a woman.",
            "title_similarity": "0.522009",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6ag1ax",
            "score": -1,
            "text": "Don’t travel alone????",
            "title_similarity": "0.103553645",
            "sentiment_compound": -0.4515
        },
        {
            "id": "h6alaul",
            "score": 1,
            "text": "Purchase a weapon.",
            "title_similarity": "-0.07801333",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6alzjq",
            "score": 1,
            "text": "Carry a gun. This is America we sell them at Walmart m.",
            "title_similarity": "0.31863385",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6an04r",
            "score": 1,
            "text": "Buy a gun. Problem solved!",
            "title_similarity": "0.23566733",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h6anpa4",
            "score": 1,
            "text": "Buy a gun",
            "title_similarity": "0.13294211",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6antpk",
            "score": 1,
            "text": "Get a firearm for personal protection?",
            "title_similarity": "0.1289988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ao3e4",
            "score": 1,
            "text": "Get a small Glock, like a G43X.",
            "title_similarity": "0.1940146",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6ap47v",
            "score": 1,
            "text": "I mean learn to protect yourself? I’ve never understood this mindset. Every person on earth should learn at least basic self defense let alone as you said a petite woman. Especially if this is a fear of yours and yes it is a rational fear. Instead of doing something about it to make yourself safer which there are countless options to learn to protect yourself, you post about it complaining online? I just don’t get that. Get a gun learn to use if you don’t have time or the will to learn self defense, hell if you live in a backwards ass place that won’t allow you to legally own a gun get a dog. I’ve had dozens of dogs over my years and almost every single one would protect me with their life even the untrained ones.  It’s as simple as taking as many precautionary steps as possible to make you feel safer",
            "title_similarity": "0.73422813",
            "sentiment_compound": -0.6199
        },
        {
            "id": "h6apr65",
            "score": -1,
            "text": "You don't think men feel can be scared?",
            "title_similarity": "0.25823838",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h6apx1k",
            "score": 1,
            "text": "Can anybody explain why the fuck we can't have removable batteries for cars? Go to a station, swapped yours for a fully charged one for $30 and be on your way. The station charges the old one and gives it to the next customer. This shouldn't be difficult concept, yet here we are in 2021.",
            "title_similarity": "0.672299",
            "sentiment_compound": -0.6791
        },
        {
            "id": "h6apze9",
            "score": 1,
            "text": "Get over yourself",
            "title_similarity": "0.027955811",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6apzqe",
            "score": -1,
            "text": "Are you really gatekeeping fear?\n\nDo you really think a lot of men don’t also have this sort of fear or did you just throw that in to justify your view even more?\n\nI’m sorry if this seems hostile. I don’t mean it like that, just genuinely curious.",
            "title_similarity": "0.48959896",
            "sentiment_compound": -0.7724
        },
        {
            "id": "h68o5p6",
            "score": 14,
            "text": "How likely is it that you need to do this often?\n\nLots of people could get one of the electric charging poles at home. So you can charge over night. Then when you leave in the morning you should have most of the action radius available.\n\nSo do you drive that much in a day that it would become a problem?",
            "title_similarity": "0.63555837",
            "sentiment_compound": -0.504
        },
        {
            "id": "h69281q",
            "score": 2,
            "text": "Wait inside the car and lock your doors? https://www.bbc.co.uk/newsround/55717296 also i saw this article but its probably still not implemented..",
            "title_similarity": "0.6257287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h697688",
            "score": 2,
            "text": "Carry a gun.",
            "title_similarity": "-0.033023387",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69occq",
            "score": 2,
            "text": "Most people charge at home so this is a completely baseless fear but that's okay because it's important that women do consider their own safety. I've owned an EV for 3 years and charged at a charging station around 10 times. Every other time I just charge from home. They're actually SAFER than an ICE vehicle because normally you have to go to a gas station every week or every few weeks. I've used charging stations around 3 times a YEAR.   \n \nIf you're still worried then just sit in your car with the doors locked and read a book.",
            "title_similarity": "0.7923324",
            "sentiment_compound": 0.7789
        },
        {
            "id": "h69sqs9",
            "score": -2,
            "text": "Electric cars use more fossil fuels to produce than just riding in a fossil fuel vehicle, it's a scam.",
            "title_similarity": "0.5964781",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h69yz1q",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6adclu",
            "score": 2,
            "text": "These threads always kind of irk me because they seem to completely ignore the possibility of male victimhood. Does it ever occur to women that men might also be afraid to be alone in unfamiliar places? I know I am. \n\nThe root of the problem here, is fear, not electric vehicles. If you actually live somewhere unsafe, then the fears may be totally warranted. You can charge the car at home if you don't feel safe in public. But, most electric charging stations I've seen have been in open, public, safe places. The fear here doesn't seem totally justified.\n\nMy advice is to make yourself feel safe. I don't live in fear, but when I leave my house, I bring my flashlight, pepper spray, and pocket knife with me. The knife and flashlight are extremely useful outside of self defense as well, but all those items bring me peace of mind. They bring me peace of mind, as a man, who doesn't want to be a victim.",
            "title_similarity": "0.82927597",
            "sentiment_compound": 0.9133
        },
        {
            "id": "h68uuz9",
            "score": 9,
            "text": "/u/ExcellentAardvark211 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/oq2anz/deltas_awarded_in_cmv_im_reluctant_to_get_an/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.3119979",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h69ajpn",
            "score": 5,
            "text": "Get yourself a gun! I was nearly mugged at a 76 while traveling for work and knowing how to responsibly concealed carry may have saved my life.",
            "title_similarity": "0.61849004",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h69phw1",
            "score": 2,
            "text": "Get a gun. Other people are hell",
            "title_similarity": "0.30796057",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h69qqhm",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.022503646"
        },
        {
            "id": "h68oevy",
            "score": 4,
            "text": "Quick charge can only take 20 minutes (half what you claim) and you can do this in many populated locations. You don't have to be \"in middle of nowhere\". It requires little bit more planning but you can find some nice venues with EV quick chargers like restaurants, museums or malls.",
            "title_similarity": "0.5583663",
            "sentiment_compound": 0.7876
        },
        {
            "id": "h69d42x",
            "score": 4,
            "text": "Easy solution. Concealed carry if you are that scared",
            "title_similarity": "0.22868891",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h693f8b",
            "score": 145,
            "text": "You can just sit in the car with it locked whilst its charging. You're not at any increased risk. Its not like a petrol car were you have to stay outside to operate the fuel nozzel  you literally plug it in, press play, and off it goes.",
            "title_similarity": "0.58245695",
            "sentiment_compound": -0.3867
        },
        {
            "id": "h69q5lt",
            "score": 4,
            "text": "There’s a lot to unpack here. First off, $80k car? Where’d you get that idea? Most electric cars at this point are at least semi-affordable, between 30-50k, and few cost as much as 80k. Also, 40 minutes to recharge the battery? That is not necessary in almost any circumstance. At a Tesla supercharger, the widest available and most robust charging network at the moment, you’ll rarely ever need to charge for more than 15-25 minutes. Not sure where you heard 40 minutes but at *most* you’ll be there for something around ~20, and even then that’s almost exclusively for road trips. \n\nOne of the best and most overlooked aspects of electric cars are their ability to charge at home and start every day with 90-100% battery. Could you say the same about your gas vehicle? With an ICE you’ll most likely have to drive around, looking for a gas station, park your car there, enter your info and sit there for 5-10 minutes. What most people do with their electric vehicle is park it at their house/apartment/parking spot and charge it as much as they want every night without ever needing to find a charger. Obviously this may not be true for everyone, but this is a huge benefit for electric cars that is often overlooked. If for some reason this isn’t possible for you, I might recommend looking into a hybrid vehicle.\n\nYou did say that you like to road trip fairly often, and with that in mind the best and more robust charging network would be Tesla’s supercharger network. With a Tesla you have the option to charge at any EV charging station you wish, but the same cannot be said for non-Tesla vehicles. The supercharger network is limited to solely Tesla vehicles (at least for the time being). I’m not sure what your price range is, but you can get a Long Range Model 3 for ~50k, which might sound like a lot but you get up to 350 miles with 1 full charge and you’ll have insane gas savings after only a couple years and a couple road trips. Electric charging is generally 1/3-1/4 the price per mile that it would’ve cost in gas. \n\nIf your *only* concern is staying at a charging station too long, then yes you may have to say an extra 5-10 minutes in the rare cases that you’re on a long road trip and need to go in excess of 400-500 miles in a single day, but in every other situation an EV will fulfill any need you might have. Not to mention how indescribably nice it is to have the free included autopilot doing most of your driving on road trips. I could probably describe this in detail a bit more, but most of your concerns are way overblown and it won’t be anywhere near as bad as you might think it is. Don’t let this one aspect deter your from a more eco-friendly vehicle.",
            "title_similarity": "0.64355564",
            "sentiment_compound": 0.9917
        },
        {
            "id": "h69seag",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.022503646"
        },
        {
            "id": "h69bbl8",
            "score": 8,
            "text": "First of all you can charge in a lot of places including your home. You don't need to go to a gas station. Second you can have more than one battery charged up in case one runs out and you need to replace it but how often do you drive far enough for that to be necessary anyway? And three, you really seem to have an irrational fear of the world. Some gas stations are kind of sketchy at night I guess, but dangerous at all times? Absolutely not. There's a difference between necessary caution and flat out danger",
            "title_similarity": "0.78124785",
            "sentiment_compound": -0.9578
        },
        {
            "id": "h6988ja",
            "score": 41,
            "text": "I’ve had a tesla for the past 5 years (model S from 2016 to 2020 and a model x, now). I’ve only used a super charger about 6 times during that period and all of them were on “vacations” where I’d stop along the route to charge. The super chargers were all at shopping plazas where I plugged the car in, went in to use the rest room, got a coffee or a sandwich, and took a break while the car charged. Only one of those stops was more than 20 minutes because I was “filling up” from half to 3/4 charge. If you aren’t uncomfortable going to a Starbucks by yourself, there’s no reason to be apprehensive about using super chargers. \n \nMy high power wall charger cost around 750 dollars, installed. Every time we get in the car at home, we have a full charge. Every time we get home from being out, the car gets plugged in. It’s a total non-issue",
            "title_similarity": "0.6079447",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h68o81d",
            "score": 261,
            "text": "It really depends on how _much_ cross country driving you do.  For most of us, almost all of our driving is done around our cities/homes - you just charge your car at night, in you garage, and it is good to go for the next day.  No increase in danger.\n\nWhile I don't know _what_ car you are looking at getting, Tesla did announce their [new V3 Supercharging](https://www.tesla.com/blog/introducing-v3-supercharging) standard in March.  V3 charging will get your car to a 50% charge in about 15 minutes, which isn't _that_ much more time than a normal gas station stop.  You might need to stop twice as often, but the stops themselves aren't that much longer.\n\n\nYou would probably need to plan your route around these stations, but that doesn't have to to much with safety.",
            "title_similarity": "0.6911155",
            "sentiment_compound": 0.1202
        },
        {
            "id": "h68pu5t",
            "score": 3335,
            "text": "You can only get gas at a gas station.  You can charge you car at stores, restaurants and an airbnb with an outlet.  You can also use your own home.\n\nSo...total hours spent at gas stations should go WAY down with an electric car.  Even if you isolate to \"longer-than-range\" drives where you don't charge at home (no reason a near-home gas station is safer, but I can imagine it might feel that way) you have greater options to avoid gas stations with an electric car.",
            "title_similarity": "0.7456914",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h694h66",
            "score": 21,
            "text": "Placing the risk in context to the rest of the risks in your life might help. Yes--being a woman comes with increased danger in many circumstances. But everyone faces danger. Traveling in a car itself is one of the more dangerous things you can do--in fact I'd wager it is significantly more dangerous than the risk of someone harming or carjacking you while you charge--but you have become comfortable with that risk. It's not good to let fear rule your life too much.",
            "title_similarity": "0.6779992",
            "sentiment_compound": -0.9832
        },
        {
            "id": "h68sqbh",
            "score": 192,
            "text": "90% of the time you’ll charge at home. For long road trips, and in particular for Tesla, superchargers are co-located with gas stations, grocery stores, shopping centers, shopping malls, etc. no need to sit around at a rest stop. You can also use route planning software to decide where and when exactly to stop.\n\nTesla will be opening up charging to other vehicles in the future as well.",
            "title_similarity": "0.6111709",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h69euhe",
            "score": 208,
            "text": "As a fellow petite woman who owns an electric car, here are some suggestions:\n\n1) There are many electric car options that cost much less than $80k. I have a Nissan Leaf, which you can buy new for barely $30k (and the price goes down from there with various tax credits and incentives). I love my car, but it doesn't scream \"I'm rich and have a luxury vehicle that you should try to steal!\"\n\n2) I can fully charge my car overnight with a standard cord and electric outlet. If you invest a little money, you can get a fast charging setup in your home and charge it much faster than that. In a standard day of driving (including a long commute), I almost never need to charge it during the day.\n\n3) When I do road trips, I rent a gas powered car - you could do that, too.\n\n4) If you wanted or needed to keep using your electric car, you can map out your trip ahead of time using a map like this (just one example): https://www.electrifyamerica.com/locate-charger/ If you look carefully, you'll notice that most of these stations aren't at rest stops. I've charged my car at Walmarts, Whole Foods, and state parks - and often gone grocery shopping or on a short hike while I waited. With the kinds of worries you're describing, you might actually feel safer with this than with going to a gas station.\n\n5) If you plan your route in advance you can probably avoid having to charge your car anywhere you'd feel unsafe. Otherwise, you could take an Uber or a Lyft to somewhere where you did feel ok to wait - maybe a restaurant or a store you'd enjoy browsing. Unlike with gas cars, you don't need to be in or even near your electric car while it's charging. Leaving it is no less secure than any other time you'd park your car and go do something.",
            "title_similarity": "0.6945427",
            "sentiment_compound": 0.43
        },
        {
            "id": "h6949m5",
            "score": 8,
            "text": "That is very close to no longer being an issue:\n\nhttps://www.theguardian.com/environment/2021/jan/19/electric-car-batteries-race-ahead-with-five-minute-charging-times",
            "title_similarity": "0.4424681",
            "sentiment_compound": -0.3535
        },
        {
            "id": "h695cja",
            "score": 6,
            "text": "Typically these 40 minute car chargers are like at restaurants or Whole Foods where you leave it charging while you do a little shopping or eating to pass the time. Unless you're equally scared of doing errands for the few minutes you egress and then re enter your car, I don't exactly see what the concern is.\n\nAs another guy said, it's safer simply by not having to refuel at gas stations as often. Gas stations are pretty sketchy places.",
            "title_similarity": "0.79769313",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h69677j",
            "score": 3,
            "text": "You have to stay outside your car when you are pumping gas.  This is not the case when you are charging your car. This gives you a degree of security.",
            "title_similarity": "0.54248494",
            "sentiment_compound": 0.34
        },
        {
            "id": "h696qqo",
            "score": 1,
            "text": "The new infrastructure plan includes more charging stations across the continental US (if that’s where you are from). As technology progresses, charge times will decrease. Also, $80,000 is already starting to become an outdated price point with Tesla releasing their $35,000 model 3 and Ford releasing their F-150 Lightning starting at $40,000.",
            "title_similarity": "0.7099199",
            "sentiment_compound": 0.0
        },
        {
            "id": "h697dcc",
            "score": 1,
            "text": "There are electric car chargers nowadays. You can charge it at home, supermarkets, hotels, malls etc. If you need to charge your car in a station while you do long range driving, everyone around you would have the same car so idk why you think your status is somehow elevated by having one.",
            "title_similarity": "0.50512576",
            "sentiment_compound": -0.2183
        },
        {
            "id": "h697jjt",
            "score": 10,
            "text": "If it helps KIA/ Hyundai E-GMP platform offers some interesting numbers. The KIA EV-6 claims   \n\n\n Choice of multiple zero-emissions powertrain configurations; over 510 kilometers from a single charge  \n• 800V ultra-fast charging from 10 to 80 percent in just 18 minutes; 100 kilometers in less than 4.5 minutes\n\nSource: https://www.kia.ca/kia-news/411",
            "title_similarity": "0.54499257",
            "sentiment_compound": -0.7626
        },
        {
            "id": "h697zw1",
            "score": 2,
            "text": "If I am not doing road trips, I exclusively charge at home or sometimes at work. I haven't had to go to a charging station in months. On long road trips, I usually charge during the day at Tesla Superchargers, which are in relatively public locations (hotels, restaurants, etc.). I have done road trips through secluded national parks, etc.\n\nI think it's not as easy at going to the gas station at any hour of the day or night, but with a little bit of awareness, it's not that hard either.\n\nI love my Tesla. It's an awesome car. Every time I get into even a luxury gas powered car, it feels like a downgrade now.",
            "title_similarity": "0.7514863",
            "sentiment_compound": 0.9472
        },
        {
            "id": "h698uv5",
            "score": 8,
            "text": "My husband and I have a Tesla and have road tripped from Atlanta to different places in Florida. None of the charging stations that we stopped at were at remote, desolate locations. They were at malls, shopping centers, one was at a really busy rest stop/gas station, etc. The nice thing with the Tesla is that you can see in advance where the charging stations are that you'll need to stop during your drive, so you can research what's there before you go. \n\nI can't say that this is the case for all charging stations, and as a woman I certainly understand where you're coming from, but I don't think it's as unsafe as you think it is.",
            "title_similarity": "0.6680497",
            "sentiment_compound": 0.1406
        },
        {
            "id": "h698zow",
            "score": 3,
            "text": "In my gas car, when I drive 300+ miles in a day without going home, I rarely feel like sitting in my car for another 20 minutes when I take a break.  With a gas car I have to stand outside to actually fuel the vehicle...I can't wait in the car (due to spark risks) and I can't go inside the convenience store/rest stop and leave the fueling car unattended.  If I'm just commuting back and forth under 400 miles a day, I still have to leave my house and go to a gas station to fill up my vehicle. An electric car would mean I never have to \"fuel up\" if I'm doing under 400miles a day...it would just be ready to go every morning.  On road trips I could plan my route to stop at safe areas with something to do (like malls, tourist areas, restaurants) to charge up while taking a relaxing break from the road instead of asking for the keys to a gas station bathroom.\n\nAs a fit man driving a $10k car, I always have my head on a swivel, keep my phone and keys on me, and lock my car when I'm on the passenger side fueling my vehicle because of the high rates of concentrated property and violent crime at gas stations.\n\nI'm pretty anxiety prone and understand your concerns, but honestly an electric car should be easing those concerns.  I would love to be able to recharge my vehicle at home every night like I do with my phone, laptop, smartwatch, literally everything else in my life.  I can't imagine having to leave the house for heating gas or fetch water from the well, but that is how \"going to the gas station\" will feel in 20 years.",
            "title_similarity": "0.8706531",
            "sentiment_compound": 0.9524
        },
        {
            "id": "h699wq3",
            "score": 1,
            "text": "Do you have a garage where you live?\nIs your daily commute less than 300mi?\n\nIf you answered yes to these questions then an electric vehicle is for you. \n\nThe only time you’d ever be at a charging station is when going on long road trips. When you do, you’ll find charging stations in shopping centers so it’s the perfect time to go to a restaurant for a meal.",
            "title_similarity": "0.63337195",
            "sentiment_compound": 0.792
        },
        {
            "id": "h699ywq",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69a8wn",
            "score": 1,
            "text": "One of my friends regularly drives from one end of the country to the other to visit her mom. She doesn't stay at motels. She sleeps at rest stops for a few hours here and there. She will only stay at the rest stops that have highway patrol stations. She's done this so many times that she's got them all mapped out. She also usually has a dog with her. It's small and wouldn't be much of a protector or physical deterrent, but it will bark it's little head off and get attention. I'm also pretty sure she's got a loaded .38 with her too, since I've seen her carry that when we go hiking.",
            "title_similarity": "0.7984821",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h69ag19",
            "score": 3,
            "text": "Most people from most socioeconomic classes own a gas car, including poor people who commit most violent crimes. Owning an electric car is definitely something of a luxury as of now, so you'll be much less likely to encounter people from the same groups  at a Tesla supercharger than at the local gas station",
            "title_similarity": "0.7126144",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h69ajkr",
            "score": 2,
            "text": "Most people I know who have them just go about their daily lives. So if they need to go to target they will plug it in while they shop, go shop, and by the time they come out it’s done.\n\nAlso you can get a plug installed at your house.\n\nNever going to a gas station again would be way safer for a woman",
            "title_similarity": "0.68778193",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h69bqig",
            "score": 1,
            "text": "If you charge at home for your daily needs and only use the EV charging station on road trips >300 miles, you’ll probably spend less time in total at a charging station than you would have at gas stations",
            "title_similarity": "0.75173414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69bs4j",
            "score": 2,
            "text": "The whole point of electric is that you never need to go to supercharger or a charge station. You're supposed to charge the vehicle overnight and it would have 300-400 miles on it. Even if you forgot it for a few days it's very unlikely you would drain all 300+ miles off the vehicle. If you don't have the infrastructure like a charge station at your resident then electric cars aren't really being targeted to you to buy. The only reason you would have to charge your vehicle out of your residence is for long road trips which you most likely will not be a single woman doing alone. Even so charging stations are near public areas like malls that you can go to while you wait for your car to charge in an hour or so. Also you don't need to charge it all the way since it actually slows down the charge rate at higher charges so it's more time efficient to charge it to 80% which could be quicker than 40 mins.",
            "title_similarity": "0.78431",
            "sentiment_compound": 0.6096
        },
        {
            "id": "h69dzsj",
            "score": 3,
            "text": "You could bring a gun with you for protection",
            "title_similarity": "0.1523157",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69egpb",
            "score": 11,
            "text": "> I know eventually I'll have to because they won't make gas cars anymore\n\nIf people stop making gas cars, then everyone else will have to get an electric car too. All women will be in the same position as you. There will probably be much less sketchy places to charge your car than a gas station where so many people are coming and going.\n\nI see how it could feel unsafe for a woman to sit in an expensive car in the middle of nowhere. But if everyone's in the same boat in the future, you're not going to stand out when you do this, unless you're choosing an especially expensive car for some reason.",
            "title_similarity": "0.84074056",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h69ex0t",
            "score": 1,
            "text": "Just put a gas powered generator in the trunk lmao",
            "title_similarity": "0.24688011",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h69ex68",
            "score": 1,
            "text": "Visit your local gun stores and find the best price on a .44 Magnum. Good ones are around $800 most days and the brand ye' want starts with an \"R\". Test 'er out, get comfortable shootin' 'er, and as long as she's on ye' you'll never be afraid uh no man 'n no beast that walks on 'dis earth.",
            "title_similarity": "0.6298952",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h69fudn",
            "score": 3,
            "text": "For longer trips I understand your concern, but for just commuting, you may never have to go to a gas station again if you charge your car at home every day",
            "title_similarity": "0.78751016",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69gchl",
            "score": 1,
            "text": "Carry a handgun? No matter how petite you are you’ll be safe!",
            "title_similarity": "0.23383707",
            "sentiment_compound": 0.4798
        },
        {
            "id": "h69gd5l",
            "score": 1,
            "text": "The market should be able to handle this. As several people have pointed out — current charging stations are in malls or hotels / restaurants.\n\nAnd until they have charging times as fast as filling the car with gas, the captive market of the people recharging their cars will mean that there will be a coffee shop or some such next to it: that’s one opportunity that won’t go to waste. Or at least you will be able to find plenty of safe outlets. \n\nYou’ll probably be safer recharging than refilling with gas, in fact. \n\nAnd it’ll be a long time before they actually make fossil fuel cars illegal.",
            "title_similarity": "0.6723578",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h69gxbx",
            "score": 1,
            "text": "Big 2nd amendment person here, carry a gun.  And if you don't live in the US then there are other self defence alternatives.",
            "title_similarity": "0.4770088",
            "sentiment_compound": -0.25
        },
        {
            "id": "h69hei5",
            "score": 1,
            "text": "I think you'd be surprised how long a small break during a road trip can take. A simple gas fill-up, bathroom break can take ~20minutes. Add in food, even just fast food, and it can be 30 minutes before you're really back on the road. With an electric car. 20 minutes won't give you a full charge, but it will give you a significant amount at a super charger station. Do that every 2 hours and you now have an easy marker to switch drivers, go to the bathroom and just stretch your legs a little.",
            "title_similarity": "0.7097112",
            "sentiment_compound": 0.9161
        },
        {
            "id": "h69isg3",
            "score": 1,
            "text": "Don't get a fully electric car if you take long road trips and this is a concern. Get a plug in hybrid with long electric range like the Volt. For short distance daily travel, you'll use the battery and charge at home, rarely if ever needing to use gas. If you do want to take a long distance trip, you fill the car with gas normally. Less fill ups on a day to day basis and no sitting in the car for 40 min on road trips.",
            "title_similarity": "0.8353659",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h69jcgs",
            "score": 1,
            "text": "My GF has a second Gen Leaf with 150 miles of range.  We’ve taken it on a few longer trips and she typically plugs in at a supermarket, hotel, or near a restaurant to charge.  We’ll hop in and grab a few things for our trip or get a meal at a restaurant while it charges.  A 30-40 minute stop is usually welcome after about 2 hours of driving.",
            "title_similarity": "0.58759856",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h69jh7g",
            "score": 1,
            "text": "I'm not buying any electric vehicle. Gasoline engines are not going anywhere. But I will buy a hybrid. Like a Toyota Corolla Hybrid for 2022.",
            "title_similarity": "0.60284615",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h69jur5",
            "score": 1,
            "text": "What gas stations are you going to?",
            "title_similarity": "0.23845145",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69jz4o",
            "score": 1,
            "text": "If the world were a place with a majority of electric vehicles which take 40mins to charge, the thing we now know as a typical gas station might simply not commonly exist.\n\nI would assume that \"refuelling on the go\" would happen at a busy shopping mall. From the point of view of the \"gas station\" owner, your customers are a captive audience for 40 mins (assuming faster charging is not a mainstream thing). Might as well try to get them to spend as much money as possible doing other things while they wait.\n\nSo the shoddy, desolate, out in the middle of nowhere gas station will be the exception, and most people will probably take an off-ramp to the nearest shopping mall, and charge there instead. A more frequented, busier place, that also has customers that aren't just there \"for gas\" in the first place.",
            "title_similarity": "0.8208407",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h69jzpp",
            "score": 2,
            "text": "You will be mostly charging at home. When sitting charging to get mind off things we just turn on Netflix and wait. Though I can say even filling up from less than half charge it only took 15 to 20 minutes which isn't bad. It is possible to find place to charge near shopping centers so she can go window shopping while waiting. \n\nI also want to say everyone has those fears. Some just ignore them better or pretend they don't.",
            "title_similarity": "0.7096298",
            "sentiment_compound": 0.09
        },
        {
            "id": "h69kfzc",
            "score": 3,
            "text": "With all the gas money you save you can buy and gun! Problem solved.",
            "title_similarity": "0.40440714",
            "sentiment_compound": 0.126
        },
        {
            "id": "h69kmoh",
            "score": 1,
            "text": "Most chargers are not in the middle of nowhere. Many are in parking lots of stores. Also you will have a home charger that will suit your needs for literally all charging except for long road trips, so you will actually be \"getting gas\" at home for most of the year depending on how many road trips you take. \n\nIf you charge in daylight in a parking lot with lots of people around (think costco or Sam's club has some), then you should be very safe. Even if you do not feel safe, depending on where you need to go you will not need to be there for 40 minutes. That is for a full charge. In 15 minutes a supercharger can get you 200 miles of range. All the while you'll be locked inside your car with cameras all over the place, alarm systems, and a console that can call the police for you.",
            "title_similarity": "0.7067933",
            "sentiment_compound": -0.1563
        },
        {
            "id": "h69ktkm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69l0wq",
            "score": 3,
            "text": "Not a petite woman, but I also feel uncomfortable at gas stations. I hate when panhandlers approach me getting gas. \n\nI can tell you that is not an issue at Tesla chargers, for one simple reason. They cater exclusively to the upper middle class. Yes that is a classist statement, and yes rich people can do rape too, but nonetheless, everyone you run into there will absolutely be clean-cut and driving their own $50,000 car. \n\nAll that to say, I DO feel uncomfortable getting gas in certain neighborhoods, and I’ve never felt a single twinge of fear at a Tesla charger.",
            "title_similarity": "0.84318423",
            "sentiment_compound": -0.8765
        },
        {
            "id": "h69lf4v",
            "score": 1,
            "text": "I own an electric car, have driven nearly 90k km electric, and only visited a charging station maybe 10 times. I am convinced 90 percent of EV drivers rarely visit a charging station. \n\nThere is nearly always a restaurant or coffee shop nearby to hang out, or stay in your car, so no reason to be scared. \n\nAnd with current technology 20 mins is all you need (unless you insist charging to 100 percent which is not effective).",
            "title_similarity": "0.697077",
            "sentiment_compound": -0.6829
        },
        {
            "id": "h69lfbz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69lkh0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69lmtb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69lxxe",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69m2zd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69m9hy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69mak9",
            "score": 1,
            "text": "I think the trip planning aspect makes this a much more 'plannable' process. Electric cars have built-in programs, and also websites, to help you select which charging stations along the way you would want to stop at, vs just driving and pulling off to whatever gas station works for you.\n\nYou can pick which stations you want to stop at ahead of time, like picking the well lit and populated stop that has a restaurant that you can go get lunch, or a charger that's higher power, so you aren't there any longer than necessary.\n\nI feel like doing this with gas stations is more of a crap-shoot if they're even open vs what you find online, and there's not usually anything besides the station and the attached convenience store.\n\nOne of the points of the charging locations is that there's somewhere to go or something to do, because it doesn't take 5 minutes like refueling, so there's not often one in the middle of nowhere with literally nothing else around it.",
            "title_similarity": "0.6186658",
            "sentiment_compound": 0.743
        },
        {
            "id": "h69mebq",
            "score": 1,
            "text": "I can try to answer some of your concerns as an EV owner. First, you don't need to spend $80k on an EV. You can get them for 1/4 of that price fairly easily. \n\nIn my experience, EV fast chargers tend to be in pretty well lit and safe-feeling areas. Many fast chargers are near Walmart or Target, in a shopping center, at hotels, or near hospitals or universities. \n\nGenerally speaking you will primarily use fast charging for road trips. For the rest of the time, it is extremely convenient to charge at home. Some apartment complexes even have chargers. There may be chargers at your workplace. \n\nThere are a few good apps (PlugShare and ABRP) which can help plan routes and charging stations. You'll be able to see a charger's address, what it is located next to, and usually at least a few pictures. That can help you plan an optimal, safe route in advance.",
            "title_similarity": "0.6093154",
            "sentiment_compound": 0.9607
        },
        {
            "id": "h69mktd",
            "score": 3,
            "text": "Get a gun?",
            "title_similarity": "0.017038641",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69mpx8",
            "score": 2,
            "text": "Stash a gun in the glove box.",
            "title_similarity": "0.21930358",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69msth",
            "score": 1,
            "text": "You’re used to filling your tank all the way and that may not be necessary especially if you charge at home or work",
            "title_similarity": "0.5610493",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69mtmn",
            "score": 4,
            "text": "I can absolutely relate. I once had to sit for 2 hours at a charging station in an industrial park at night. Yes it shouldn't take that long but idk, I was only borrowing the car thank god",
            "title_similarity": "0.69854784",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h69n0h9",
            "score": 1,
            "text": "Do you live in India?",
            "title_similarity": "-0.0918099",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69npe1",
            "score": 1,
            "text": "All Tesla’s have a mile range of 300 at 60-65 mph. The reason electric vehicles are good is for daily intercity driving. You can get a 100% battery charge with a 240 volt charger at home overnight. The change to a electric car means you should never have to stop at a charging station on a normal day",
            "title_similarity": "0.6176814",
            "sentiment_compound": 0.5842
        },
        {
            "id": "h69odan",
            "score": 4,
            "text": "I feel like there would be less sketchy characters at a charging station than at a standard gas station",
            "title_similarity": "0.49243283",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h69oubc",
            "score": 1,
            "text": "I would never buy one because once the battery brakes the car is totaled. Doesn't even have to be the battery, it could just be a connecter. We live in a throw away society and these electric cars are going to make it worse imo. I still think hybrid or alternative fuel will be the future.",
            "title_similarity": "0.7666375",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h69pb9y",
            "score": 1,
            "text": "most parking garages i’ve been to have had chargers. you could sit in your car (especially in the back seat) and nobody would even know you were there. or head over to a coffee shop. this applies less on a road trip in the middle of nowhere, but could work great for a day trip. they’ve also added them to over a hundred of both targets and walmarts. they are also at many rest stops and campgrounds. there is a surprising number of chargers in the middle of nowhere for this exact reason. it’s pretty easy to find one that’s not at a gas station. however, this is all assuming you’re in the US. if not, i have very little info. right now it’s not super common for gas stations to have them, but in both england and colorado, legislators ARE working to have ev chargers installed in all gas stations. my guess is that they’ll honestly go up anywhere with a parking lot. it’s kind of just easy money for the person with the lot honestly.",
            "title_similarity": "0.72203505",
            "sentiment_compound": 0.9767
        },
        {
            "id": "h69pg6n",
            "score": 1,
            "text": "Also, it’s unsafe for not just women.",
            "title_similarity": "0.37657315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69pjf1",
            "score": 3,
            "text": "Fun fact that I only recently learned: with a Tesla supercharger, the car can get 200 miles of range in something like 15 minutes, so only slightly longer than pumping gas. If you ever felt particularly uncomfortable, it would be easy to unplug and drive away having put on at least 50 miles of range",
            "title_similarity": "0.5658716",
            "sentiment_compound": 0.701
        },
        {
            "id": "h69ptz7",
            "score": 1,
            "text": "You're not wrong. But I can change your mind. Battery swapping takes about the same time as filling a tank. It looks to be gaining traction in China where there are many other companies than just Tesla. This is important because right now only the early adopters and rich people are buying electric cars. In the future, as electric becomes more mainstream, not everyone will have access to a battery charger. However, every gas station can be converted to swap batteries. You can still charge those cars . So for lots of people there may be benefits to getting an electric car that they can charge when possible and swap the batteries when they need a quick charge. \n\nAlso, in theory with the battery swapping vehicles, you would lease the battery so car costs could be very low, making them more desirable than cars that have built in batteries that you own.",
            "title_similarity": "0.69607043",
            "sentiment_compound": 0.9458
        },
        {
            "id": "h69pvdh",
            "score": 1,
            "text": "A they make more electric cars and the tech gets better. The range will get better and the charge time less.",
            "title_similarity": "0.43534234",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h69pzqp",
            "score": 1,
            "text": "I have a Tesla for 5 years. In that 5 years maybe used Tesla chargers 10-15 times, 99% of the time u will charge at home. And each time there about 15mins…. They charge pretty fast atleast in CA.  We chargers charge 1000+ an hour. And it’s definitely safe you will have other Tesla owners there won’t be alone. And these chargers are always placed in busy places, like malls and Resturants and on freeway they are by fast food and Starbucks.",
            "title_similarity": "0.6173855",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h69qbim",
            "score": 1,
            "text": "I’m a woman and I drove from the states to Costa Rica. So through Mexico, Guatemala, El Salvador, Honduras, and Nicaragua. I never had any problems or danger and honestly I never really think about getting into danger or men hurting me. You have to be smart and use your intuition, but I’m sure you’ll be fine.",
            "title_similarity": "0.5429623",
            "sentiment_compound": 0.5234
        },
        {
            "id": "h69qi85",
            "score": 1,
            "text": "IMO, it only makes sense to get an electric car as a commuter car, and if you have a charging system at home. Infrastructure for chargers is not big enough to be convenient.",
            "title_similarity": "0.719579",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69qjqg",
            "score": 2,
            "text": "Buy a gun",
            "title_similarity": "0.13294211",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69quw0",
            "score": 2,
            "text": "Carry a gun.",
            "title_similarity": "-0.033023387",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69r7w9",
            "score": 1,
            "text": "Equip yourself with what you need to defend yourself. My choice would be a gun",
            "title_similarity": "0.24180168",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69rgc5",
            "score": 1,
            "text": "Charging ports are usually in middle of busy places. Plus you can charge at home or wherever there’s an outlet people let you use. And also for long trips for Tesla’s they have Tesla stops (most of the time) which are meant for only Tesla’s.",
            "title_similarity": "0.60566306",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h69rkhn",
            "score": 1,
            "text": "A Chinese company called NIO are trying to build an infrastructure where you lease your battery, you don't own it, then you go to their recharging station and they just swap the battery out for a new pre-charged one to eliminate the waiting. \n\nI'm sure it wouldn't be the cheapest compared to charging normally, but could allay your fears about waiting.",
            "title_similarity": "0.7151445",
            "sentiment_compound": -0.4678
        },
        {
            "id": "h69rpyi",
            "score": 1,
            "text": "I think there should be A LOT more charging stations. Car companies really want to start pushing out electric cars but IMO it’s really hard to find charging stations. I refuse to get an electric car until charging stations are everywhere and easily accessible.",
            "title_similarity": "0.7697609",
            "sentiment_compound": -0.1136
        },
        {
            "id": "h69s3bs",
            "score": 1,
            "text": "In short:\n\nI wholly agree for some areas. Many areas. It 100% depends on where you live. To change your view, you would need to live in a safe place. If you do, change. If you don't, you're right. IMO oc.",
            "title_similarity": "0.35970855",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h69s7bc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69sgeo",
            "score": 1,
            "text": "I just sit in the car with the doors locked and sentry mode on. Watch a bit of TV. Chill.",
            "title_similarity": "0.35955727",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69suit",
            "score": 1,
            "text": "P H E V",
            "title_similarity": "-0.14257252",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69sw8r",
            "score": 1,
            "text": "I drive a gas car, and work nights. I hate it when I’m low and get gas AFTER work. There’s nobody around, all the buildings are closed, and I’m unarmed. If somebody wanted to come up and hurt me and steal my car, there’d be nothing to stop them. \n\nI’m a male and I hate it. That’s why I’m buying a gun. It’s legal in my state.",
            "title_similarity": "0.82526547",
            "sentiment_compound": -0.9443
        },
        {
            "id": "h69sx29",
            "score": 1,
            "text": "Electric cars are a scam.",
            "title_similarity": "0.446448",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h69t8hb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69th22",
            "score": 2,
            "text": "Get a concealed carry permit",
            "title_similarity": "0.13632402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69tpv1",
            "score": 2,
            "text": "get a gun.",
            "title_similarity": "-0.027626604",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69u0z7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69u4ml",
            "score": 1,
            "text": "Electric Cars are terrible vehicles for long distance driving anyway so if that's something that your planning on doing quite often I would probably suggest just sticking to a plug in hybrid they are great fuel savers and are usually loaded with great features this should solve your worries.",
            "title_similarity": "0.70873535",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h69u6fh",
            "score": 2,
            "text": "Get a gun.",
            "title_similarity": "-0.027626604",
            "sentiment_compound": -0.34
        },
        {
            "id": "h69ucvl",
            "score": 1,
            "text": "It’s highly likely that there will be swappable batteries eventually whereby you just get fully charged batteries in exchange for your empty battery.",
            "title_similarity": "0.4358729",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h69ui9n",
            "score": 1,
            "text": "I mean, depending on where you are, how often are you going to need to be charging the car away from home? Many of these vehicles have a 300 ish mile range, I’m pretty sure, so how often do you do a 300 mile round trip from your house?\n\nMost people are much closer to their place of work than that, and rarely have to make trips of that length. And often trips of that sort of length are with other people (going to a place for something or a holiday etc), so that negates your point too. And I’d be surprised if over such a long distance, there wasn’t at least one ‘safe’ feeling station (a larger, busier roadside services or the like, or something in a city centre etc).\n\nSo, in other words, as you almost always charge an electric car at home, you’re going to be spending LESS time at a station overall, and there are ways to mitigate any risk on those few trips.",
            "title_similarity": "0.7735213",
            "sentiment_compound": 0.885
        },
        {
            "id": "h69ulmo",
            "score": 1,
            "text": "Charging stations can be placed at convenient locations where someone would already need to spend their time: restaurants; grocery stores; motels; gyms; your personal home; etc.\n\nPeople typically spend 10-15 minutes going to gas stations for the sole purpose of getting gas.\n\nI think the same argument could be made for the increased safety of a charging station when compared to a rural gas station.",
            "title_similarity": "0.5818687",
            "sentiment_compound": 0.34
        },
        {
            "id": "h69uzbh",
            "score": 1,
            "text": "Hydrogen will take over if people would get their head out of their asses. If we are to stop using fossil fuels we need a clean energy source and while nuclear isn’t clean it’s not as bad in some respects as batteries. There has been an acceleration of development in the nuclear field especially with size they can fit in cargo containers yet no one seems to care and just says “it’s too expensive and time consuming” well didn’t people say that about solar and wind? Look where they are now. The fact is nuclear can produce more power than wind and solar and the spent fuel can be used to generate power. Reactors can and do produce hydrogen so not only would we have a power source but a fuel source in one. But let’s sink all the money into batteries, solar, and wind. Everything has pros and cons and they all produce “clean” energy.",
            "title_similarity": "0.68050873",
            "sentiment_compound": 0.8213
        },
        {
            "id": "h69v5st",
            "score": 1,
            "text": ">I know eventually I'll have to because they won't make gas cars anymore but it's a genuine concern right now\n\nHopefully by the time electric cars have become commonplace at least one of a few things will have happened:\n\nA) Charging can be done significantly faster\n\nB) Electric car batteries become smaller, standardised and interchangeable",
            "title_similarity": "0.6644019",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h69v80q",
            "score": 1,
            "text": "Men are at higher risks of volient crime than women",
            "title_similarity": "0.38427246",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h69vb5g",
            "score": 1,
            "text": "You just presented an argument for women to conceal carry rather than an argument against electric vehicles. A gun is the great equalizer, whether you are big or small, strong or weak, a gun in the hands of a well trained person levels the playing field. Take some training classes, learn how to defend yourself, and buy a gun. Contrary to what many people say, when you are well prepared you now can enjoy life and live without fear. If I’m going on a safari and I’m afraid my car will break down, taking tools and a mechanic friend now removes that fear. If anything happens I know it’s taken care of and I can deal with. Set your self free OP",
            "title_similarity": "0.6587453",
            "sentiment_compound": 0.9105
        },
        {
            "id": "h69vgs1",
            "score": 1,
            "text": "Just carry a generator in your trunk.",
            "title_similarity": "0.18079177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69vhw5",
            "score": 1,
            "text": "Just wait until the new aluminum ion batteries take over. They hold charges longer, don't degrade nearly as fast as lithium, and they charge at incredible speeds. Instead of 40 minutes at a charge station it will be closer to 5 minutes.",
            "title_similarity": "0.54023206",
            "sentiment_compound": 0.0788
        },
        {
            "id": "h69vks6",
            "score": 1,
            "text": "I think that based on the current state of charging infrastructure in the area you'll be driving, you should decide how often you'll be charging during a trip beyond driving range.  If you regularly drive more that 300 miles or so in a day and the area isn't full of chargers yet ... probably best to wait and get a hybrid.\n\nIf you rarely go beyond the driving rand and will charge at home at night ... Very little reason to not get an electric today regardless of local charging support.",
            "title_similarity": "0.7816458",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h69vxto",
            "score": 1,
            "text": "You can charge at home or overnight, if you’re travelling",
            "title_similarity": "0.19204596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69w3ou",
            "score": 3,
            "text": "It’s a valid concern. Have you considered a plug-in hybrid? They’re electric cars that switch to gas when the charge runs out. I have a plug-in hybrid Pacifica, and it goes roughly 30 miles before switching togas.",
            "title_similarity": "0.5950948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69wf6f",
            "score": 1,
            "text": "Buying pepper spray and learning how to use it seems like a better solution than lighting the planet on fire but maybe that’s just me.",
            "title_similarity": "0.54447085",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h69whlj",
            "score": 1,
            "text": "At least where I am, charging stations are usually accompanied by a certain amount of civilization - a cafe, restaurant, etc. Waiting there to charge your car is no different to just going into the cafe for a rest, which is something you'd probably be doing without an EV anyway.",
            "title_similarity": "0.5954844",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h69wlh9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h69wvt5",
            "score": 1,
            "text": "I hope you know that you are completely overthinking it. If you're in the US, take a gun. Lock your car doors and you should be fine.",
            "title_similarity": "0.4986382",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h69x4w9",
            "score": 1,
            "text": "You can now and in the future even more easily be able to travel any any direction in the US on major highways and charge your EV at very large rest stops full of mcdonalds and starbucks and sbarro and whatever which dozens of people and cameras open 24h. If you choose to get off the major highways and go exploring thats fine but based on your level of suspicion for random actors, im guessing you wont be doing a whole lot of that. So i think none of this should be a problem.",
            "title_similarity": "0.67228436",
            "sentiment_compound": -0.7299
        },
        {
            "id": "h69xkv1",
            "score": 1,
            "text": "Battery swapping might take off until they can improve mileage on a single charge. That would less time than filling up at a gas pump.\n\nYou can be attacked anywhere no matter how long you linger there, so you should keep some type of defensive weapon with you if you don’t feel safe being alone. If you’re in the US, there’s an obvious very effective choice.",
            "title_similarity": "0.62366974",
            "sentiment_compound": 0.4623
        },
        {
            "id": "h69xy2b",
            "score": 1,
            "text": "Safety First... you know your answer\n\n\n\nIf you \"feel\" unsafe, it doesn't matter what other people say, you'll have it on the back of your head... If you want to help the planet, buy a hybrid, if you want a fashion statement learn bjj and yoga.",
            "title_similarity": "0.53083766",
            "sentiment_compound": 0.7207
        },
        {
            "id": "h69yj5z",
            "score": 1,
            "text": "I’d look into a plug-in hybrid like a RAV4 prime. If you’re not driving a long distance every day, you can basically drive it only in the electric vehicle mode. For longer drives you have the option of using the hybrid mode or using the ev mode until you run out of charge. In hybrid mode, you can get 50-60mpg. Additionally, you can charge the battery off of the engine while driving and also when coasting down hills. I do a lot of long distance driving and I’ve fallen in love with this car",
            "title_similarity": "0.6926969",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h69zld3",
            "score": 1,
            "text": "I know it's often associated with right wing ideas, but hear me out, I promise that's not where I'm coming from. Also this only really applies if you live in America \n\nGet a gun and a concealed carry permit. Women benefit significantly more from the 2nd Amendment than men do, because it doesn't matter how small and physically weak you are, a bullet will still fire just as hard and do just as much damage to an attacker. There's a reason they're often referred to as \"The Great Equalizer\"\n\nCheck out r/liberalgunowners if you want to learn more",
            "title_similarity": "0.6665244",
            "sentiment_compound": -0.7941
        },
        {
            "id": "h69zw55",
            "score": 1,
            "text": "Can't you just sit in it and lock it if you feel unsafe?",
            "title_similarity": "0.47887915",
            "sentiment_compound": 0.0
        },
        {
            "id": "h69zy3e",
            "score": 1,
            "text": "I was going to say unless you traveling cross country or more than 300 miles daily…you would never need to charge your car in public EVER. I like the idea of plugging in my car in my garage at the end of the day and waking up to a full take every single day for the rest of my fucking life, fuck gas stations.  \n\nBut ya, cross country travel…just go to a sit down restaurant while your waiting, your Probly hungry after driving 300 miles anyways",
            "title_similarity": "0.72409445",
            "sentiment_compound": -0.1628
        },
        {
            "id": "h69zykx",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a011k",
            "score": 1,
            "text": "Because your gas car is much more likely to have a mechanical issue stranding you on the side of the road.  2,000 Moving parts for a normal car, 20 for a Tesla",
            "title_similarity": "0.69319177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a028g",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a06ts",
            "score": 4,
            "text": "I’m pretty hearty and don’t get creeped out often but even I’ve been with a friend at a couple of gas stations in the middle of nowhere or very early / late that have made me feel creeped out. I wouldn’t ever stop at those places with a battery that needed to be recharged. I’m sure things would have been fine but that isn’t a fun feeling. I’ve never thought of this before, as a woman who also drives a lot and goes a lot of places, even international places alone. It’s a good point though. I guess the lesson would be to not recharge on a dead battery if you have an electric car?",
            "title_similarity": "0.785789",
            "sentiment_compound": 0.8537
        },
        {
            "id": "h6a0jk6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a13pz",
            "score": 1,
            "text": "With a gasoline consuming vehicle your. ONLY option is to go out and get gas. With an electric vehicle most ppl charge overnight and if they go on long trips there are many public places offering services for charging (like restaurants that let you charge while you eat). That means you aren't stuck sitting in your car as it charges. There's also charge holding power banks available as well as solar panels that allow you to charge a bank as you drive. \n\nWith a gas fueled car you're stuck with having to stop at the closest station regardless of how sketchy (unless you have an attachable excess tank).",
            "title_similarity": "0.7448721",
            "sentiment_compound": 0.2359
        },
        {
            "id": "h6a1fwz",
            "score": 1,
            "text": "I have a plug in hybrid electric car (Chevy Volt), and for the great majority of driving days, I don't use a drop of gas.\n\nI plug in at home and charge overnight with the included portable charger and a standard outlet.\n\nFor road trips though, I use gas as you do now.\n\nI have owned the car for about 4 years, and I have never **waited** at a charging station to charge. I sometimes use them while shopping or whatever, if they are conveniently in the parking lot, but I don't wait at the car.",
            "title_similarity": "0.7112093",
            "sentiment_compound": 0.451
        },
        {
            "id": "h6a2285",
            "score": 1,
            "text": "Electric cars aren't made for cross country road trips yet.",
            "title_similarity": "0.5700052",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a23bg",
            "score": 1,
            "text": "40 minutes? Wtf do they have a place for you to go if it's raining, hot, or a blizzard?",
            "title_similarity": "0.5167196",
            "sentiment_compound": -0.6322
        },
        {
            "id": "h6a23p2",
            "score": 1,
            "text": "Charging times are getting up to 200 miles on a 15 min charge plus a lot of platforms are close to 400 mile range.",
            "title_similarity": "0.39374018",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a2ame",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a2dtp",
            "score": 1,
            "text": "Get the PlugShare app. Can plan and see in advance if any issues.",
            "title_similarity": "0.08683331",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a2eba",
            "score": 2,
            "text": "Get an electric car and a pistol. Problem solved.",
            "title_similarity": "0.32565063",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6a2iiy",
            "score": 1,
            "text": "Legally purchase a gun and take gun safety classes and go to shooting ranges. Get a concealed carry license as well. \nBetter to be prepared than afraid.",
            "title_similarity": "0.49705347",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6a2p8n",
            "score": 2,
            "text": "Get a gun?",
            "title_similarity": "0.017038641",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6a2pe6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a2rnv",
            "score": 1,
            "text": "My road plans would be to stop at a charging station that is attached to a restaurant or store with a eat in seating. Meijer has Tesla charging stations. I have seen convenient stores with stations.",
            "title_similarity": "0.39013404",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6a2yjc",
            "score": 1,
            "text": "You'll probably be long dead and gone before they stop making gas cars. I know there are more electric cars coming out, but gas will still be here for a very long time.",
            "title_similarity": "0.6526786",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h6a36x5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a3e23",
            "score": 1,
            "text": "If you routinely drive long distances, then an electric car doesn't really make sense for you right now. Period.  Most people drive less than 40 miles a day.  Electric vehicles make a lot of sense for those people.  If you're driving more than 200 miles a day regularly, stick with gas.  If you only occasionally (once or twice a year) drive further than that, get an EV and then rent a gas car for those long trips.  Saves the wear and tear on your primary car and you don't have to worry about charging in public.\n\nI've been driving electric for about a decade now and I've never needed to charge away from home.  (I did charge a couple of times more out of convenience, like getting a really nice parking spot if I plugged in.)  I just rent/borrow a gas car for the rare trips out of state.  Anything further than 5 hours drive, I'm flying anyways!",
            "title_similarity": "0.82349706",
            "sentiment_compound": 0.8069
        },
        {
            "id": "h6a3kwz",
            "score": 1,
            "text": "Get a gun and learn how to use it, living afraid is a shame.",
            "title_similarity": "0.56407404",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h6a438q",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a49es",
            "score": 1,
            "text": "Here’s one I haven’t seen: \n\nYou don’t have to sit in an $80,000 car. You can buy a Tesla for $35,000. You’re not automatically a juicy target because you drive an electric car.",
            "title_similarity": "0.6608721",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a4csp",
            "score": 1,
            "text": "You’re right that as a man I do not understand that feeling. On the other hand, I do know my girlfriend eats alone at Sheetz practically every day on her lunch break and she drives a $45,000 Audi. I do not believe she has ever had any problems. \n\nLunch is probably the safest time to be at a gas station though now that I think about it",
            "title_similarity": "0.75933695",
            "sentiment_compound": 0.2095
        },
        {
            "id": "h6a4la6",
            "score": 1,
            "text": "As a woman, I’d be comfortable parked in just about any well-lit parking lot for 40 minutes while my car charges. Park your car at the gas station/charging station, start charging it, go in and buy some snacks and use the bathroom, come back out and browse Reddit for a bit and leave when you’re fully charged or charged enough to get to your next stop. As long as you’re not driving into super sketchy areas to do this, I don’t see a problem. If you’re driving through Detroit, for example, you can stop and charge at one of the nicer suburbs surrounding the city.",
            "title_similarity": "0.6745316",
            "sentiment_compound": -0.8178
        },
        {
            "id": "h6a4o3y",
            "score": 1,
            "text": "Damn that’s a very legitimate concern. My plan for getting an electric car was to custom install a solar panel. Probably would cost a lot extra, but it’s something I’m willing to work towards. I figured, why not have an extra battery and a solar recharge for an all electric car? It surprises me that they’re not already part of the package.",
            "title_similarity": "0.593274",
            "sentiment_compound": 0.128
        },
        {
            "id": "h6a4pwl",
            "score": 1,
            "text": "I don’t know if I’d consider most Airbnb charger friendly. You’re going to be slow charging then and hoping there’s an external outlet you can use nearby. I also wonder how charging at them will factor into pricing. \n\nI’m a guy but I understand where you’re coming from. I’m a big guy and even I wont fill up my bmw at a dimly lit gas station. Just common sense. Sitting at an unmanned parking lot that usually in the cheapest area possible for 45m? No thanks. \n\nAll the above said. My next car will be electric as I don’t drive all that much. I’ll rent an ICE if I need to go long distance.",
            "title_similarity": "0.81244326",
            "sentiment_compound": 0.0059
        },
        {
            "id": "h6a4qzz",
            "score": 1,
            "text": "I also feel this way about car doors that automatically unlock when you park 😞",
            "title_similarity": "0.37786776",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6a5aq9",
            "score": 1,
            "text": "I don’t have an electric car but I’ve driven cross country alone or with a child a few times. I had a sketchy situation involving some truck drivers boxing me in somewhere in Utah so I started dressing like a boy. I wear a ball cap and men’s clothing. To anyone driving by, I look like a guy.",
            "title_similarity": "0.7002876",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h6a5bhk",
            "score": 1,
            "text": "I had an electric car for a while - assuming you have a charger at home, you start every morning with a full \"tank\". Refueling mid trip only occurs on long road trips. (Or incidentally opportunity charging - my local grocery store had a charger in the lot as did many restaurants.)\n\nOn long trips we usually charged up at malls - stop for food and a bathroom break, stretch our legs... Charging stations tend to be in a public location that's generally pretty safe.\n\nSince you mentioned $80k - the Tesla supercharger network is pretty well built out, and the charging is quick enough that those food and bathroom breaks get you a decent amount.",
            "title_similarity": "0.6565201",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h6a5gwy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a5hqx",
            "score": 1,
            "text": "I have an electric car and in the past year I’ve never charged anywhere but home.  With over 300 mile range you rarely charge anywhere but home.  My wife loves it because now she never has to go to a gas station.",
            "title_similarity": "0.65002394",
            "sentiment_compound": 0.7466
        },
        {
            "id": "h6a5rt5",
            "score": 1,
            "text": "I generally don’t charge away from home except at planned stops. Lunch, shopping, and so on.\n\nThe fact is, owning an electric car means you charge it at home. That’s it. I get home and I plug my car in and it’s full when I leave. \n\nDo you really lay down 200+ miles in a day? No. No, you don’t. If you’ve got a shit ton of errands all over town you might go 85 miles and still have half a battery left if you bought a long range car. You never need to fill up away from home. Practically never. \n\nMeasure how many miles you go in a long day of running all over the place. Buy an electric car with at least double that range. If you really do go 300 miles a day, fine, get a plug in hybrid.\n\nI still have an old 2012 Chevy Volt plug-in hybrid. It goes 30 miles on its battery, then switches to a gasoline engine and runs the same way a Prius does. I often don’t start the engine at all in a day but I could drive it from here to Kansas on a whim with zero planning and no worrying about charging it. Plug-ins are now available in all sizes, in SUVs and Minivans and what have you. If you absolutely must have internal combustion you can still get your first thirty miles free. All told I’m averaging 60mpg in my volt but that varies wildly with trip length. Interstate trip will be more like 40 but short trips in town will be over 100 if I use any gas at all. Charging nowhere but home.",
            "title_similarity": "0.7132577",
            "sentiment_compound": 0.8553
        },
        {
            "id": "h6a61kb",
            "score": 1,
            "text": "Electric cars aren’t for road trips yet. We’re not at a point where they make any sense to use past your home geographical bubble. \n\nThe future you’re thinking of what be that slow. It’s just the way at the moment",
            "title_similarity": "0.66298926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a67ij",
            "score": 1,
            "text": "where do you live that petrol stations are that dangerous?",
            "title_similarity": "0.46078765",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6a682k",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a6ezd",
            "score": 1,
            "text": "Do your research on electric cars before you even consider buying one. Look up the maintenance costs and how much it would cost to install a charging station at home. My research told me they can be as little as $800 and as much as a few thousand so a sound investment if not a little pricey. Not to mentioned completely alleviates your fears of the pump/charging station. Another thing to consider is how much you travel and how often you travel long distance. With some electric cars having 400+ mile battery capacity nowadays it makes sense for a daily commuter for many people.",
            "title_similarity": "0.76003116",
            "sentiment_compound": -0.4703
        },
        {
            "id": "h6a6hje",
            "score": 1,
            "text": "I mean you could learn to defend yourself like males have to. Or get a gun and learn how to point and shoot. Playing the victim your whole life ought to get boring eventually.",
            "title_similarity": "0.51450646",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h6a6tcz",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a7id2",
            "score": 1,
            "text": "Doesn't this apply to anyone with an expensive tesla?",
            "title_similarity": "0.45292297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a7pux",
            "score": 1,
            "text": "Not going to change your mind. A majority of us guys are fucking horny monkeys with self control that only operates in the presence of immediate consequences.   \n\n\nnever thought of this. stay safe. guys who i'm describing, you are so fucked",
            "title_similarity": "0.5338892",
            "sentiment_compound": -0.5742
        },
        {
            "id": "h6a7sc5",
            "score": 1,
            "text": "Keep summer safe",
            "title_similarity": "-0.047177467",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6a7swv",
            "score": 1,
            "text": "Some EV's, like the Volt for example, have gas and electric options. \n\nSo you can use the electric when you're charging at home, and the gas when you're on a road trip.",
            "title_similarity": "0.45933342",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6a7v9h",
            "score": 1,
            "text": "is it possible to own two cars? One for in city driving and one for outer i.e. long distance. That way you can always recharge at home.",
            "title_similarity": "0.43092877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a8cub",
            "score": 1,
            "text": "Probably not going to alleviate fears, but a brutal truth is that your exposure to risks by stopping in the middle of nowhere to refuel probably isn’t that different between a 10 minute versus 40 minute wait. It’s mostly about the fact that you stop and get out of your vehicle at all.",
            "title_similarity": "0.73770463",
            "sentiment_compound": -0.899
        },
        {
            "id": "h6a8ft6",
            "score": 2,
            "text": "CCW",
            "title_similarity": "-0.12866075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a8nq7",
            "score": 1,
            "text": "Thanks for posting this. I have wondered about this",
            "title_similarity": "0.011936016",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6a8p18",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6a8yhs",
            "score": 1,
            "text": "How often are you driving cross country?  Rent a car the once in a great while you are driving far distances.  95% of my trips are 20 miles or less.  That is what these cars are built for.",
            "title_similarity": "0.5651128",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h6a9a0p",
            "score": 1,
            "text": "Honestly you wont be alive when there is strictly only electric cars. And electric cars are not only 80k there are many below 30k",
            "title_similarity": "0.6096158",
            "sentiment_compound": 0.2062
        },
        {
            "id": "h6a9mpv",
            "score": 1,
            "text": "Where do u live ?",
            "title_similarity": "-0.05253688",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6a9xjz",
            "score": 1,
            "text": "They won’t stop making gas cars in your lifetime, this isn’t something you have to worry about.",
            "title_similarity": "0.5131715",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h6aa2qt",
            "score": 1,
            "text": "I don't want one because I have a travel trailer.  It would take me forever to cross the country",
            "title_similarity": "0.6778467",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h6aa7wm",
            "score": 1,
            "text": "I really wish electric cars had batteries you could easily swap out like cell phones back in the day.",
            "title_similarity": "0.5619426",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h6aauxh",
            "score": 1,
            "text": "I wouldn't worry about it. Somewhere, there's a bunch of coal being burned to send that charging station its juice.",
            "title_similarity": "0.3698402",
            "sentiment_compound": 0.3412
        },
        {
            "id": "h6abipx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6abzeg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6acejr",
            "score": 1,
            "text": "Get an extra battery?",
            "title_similarity": "0.116660856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6acqpd",
            "score": 2,
            "text": "Buy a gun idk",
            "title_similarity": "0.17783383",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6acrzf",
            "score": 1,
            "text": "Infrastructre isn't ready for routine cross country driving IMO.  A plug-in hybrid would be better for you.",
            "title_similarity": "0.6788551",
            "sentiment_compound": 0.1999
        },
        {
            "id": "h6acy2s",
            "score": 1,
            "text": "are PGE tell you they need you to cut back your electric uses and not charge your car Can someone tell me how this will work when Ca makes everyone had electric cars",
            "title_similarity": "0.5940522",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h6adapv",
            "score": 1,
            "text": "Being armed and alert is much better protection than being a man. As a bonus, women can do it to. As an additional bonus, you can protect yourself and make the world a safer place at the same time. Everyone wins.",
            "title_similarity": "0.3855227",
            "sentiment_compound": 0.9648
        },
        {
            "id": "h6adcs6",
            "score": 1,
            "text": "Quick question for you, to put things into perspective.  How many miles do you drive in a day?\n\nBefore the pandemic, before I started busing to work, I was averaging a way-larger-than-average 50 miles a day, and spending about 10-13 hours a day at home (including sleeping time).\n\nAssuming I didn't have anywhere to charge while I was at work, assuming I never had anywhere to charge while out on errands (the local mall has charging stations, as do many larger stores or pharmacies), I could still *easily* have kept my car topped up at home, even with a standard wall outlet.\n\n\nA standard 120v15a wall outlet puts out 1.8kW of power per hour.  At 10 hours a day plugged in, that's 18kWh. Basically all modern EVs use about 300Wh of electricity per mile, give or take.  That's 6 miles of range per hour.  At 10 hours of charging (e.g., 9pm to 7am) that translates to 60 miles of range per day.\n\n60 miles of range *per day* just from a standard outlet, *every day,* between when I was winding down for bed and when I left for work.\n\nIf you get home around 7 pm and leave for work around 7 am, that's *12* hours, which gives you *72* hours of range per day *minimum.*   Even in winter driving conditions, that's *no less than* 30 miles of range *every day.*\n\nIf you have access to a good Level 2 Charger (240v40a), you can get on the order of 30 miles of charging *per hour.* \n\nIn other words, it's *quite possible* that outside of roadtrips, you will *never* need to charge anywhere but the comfort of your own home.\n\nHow's that for safety?",
            "title_similarity": "0.75678957",
            "sentiment_compound": 0.8708
        },
        {
            "id": "h6adm7k",
            "score": 1,
            "text": "I feel like most gas stations in po dunk middle of nowhere don't even have an electric charging station in the first place.  I've driven cross-country several times. You plan your trips.  You can just as well plan your stops somewhere relatively safe. You should be getting well over 300 miles per charge on the highway so unless you're driving across Yukon territory, you shouldn't need to stop at a shady place.",
            "title_similarity": "0.7822311",
            "sentiment_compound": 0.6472
        },
        {
            "id": "h6ae183",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6ae1v4",
            "score": 1,
            "text": "Valid apprehension. However a simple pedestrian equalizer should do the trick. The extra benefit is that the person dumb enough to attempt some sketchy shit would never expect the owner of an electric car to turn around pointing a loaded deagle at their face",
            "title_similarity": "0.5942956",
            "sentiment_compound": -0.802
        },
        {
            "id": "h6ae252",
            "score": 1,
            "text": "Several factors go into this argument, I’ll try to address them in the same way I had them myself.\n\nRange-\nAll EVs have enough range to cover a typical day of driving. The average is 30 miles per day, most EVs tout hundreds of miles. As long as an EV can regain the amount of miles you drive each day, there is no need to use a public charging station.\n\nCharging Locations-\nThinking of EVs as traditional cars is the mistake we make right now. It’s hard to change the way we think about cars. But if you thought of an EV more along the lines of your cellphone, it makes more sense. You charge your phone overnight, use it throughout the day, and plug it back it for use the next day. Your EV is the exact same. You will charge you car in your garage/parking spot, use it for your daily driving needs and plug it back in when you get home.\n\nCharging is getting faster and faster as well. DC charging will become standard on more and more EVs. In the unlikely scenario where you need more than 300 miles of travel in a day, most chargers will be quick. I imagine a lot of women have the same concerns, making safe/clean charging stations along the Highway system will be a thing.\n\nLong Distance-\nFor long distance trips, you can charge your car in any location that offers an outlet. These plug-in chargers are slow and will take a long time to charge. But if you are staying at a hotel/motel, an overnight sleep should top your right up. While the scenario OP describes might be scary, it isn’t very likely. Several years ago, locating a convenient charging station for a road trip was a bit inconvenient. But it’s 2021, there are more and more charging locations at more at more accessible stops. \n\nWhen will I switch to EV-\nBy the time anyone HAS to get an EV, the infrastructure will be in a much more accessible state. That 20 minute charging stop would be an emergency situation and not the normal. Everyone would have a charger in their home, there will be EV charging stations at every public location. There will be so many places to plug in your EV while you are doing something else you already do with your gas car, you just won’t think about it. Your car will have a charging account, login into the charger with some handshake technology and you could charge your vehicle anywhere on a single bill.\n\nThere are many YouTube videos to check out going over these exact issues. Make sure you check out one from the last 2 years or so, an evolving technology rapidly changes. Something from 2018 or later might have outdated information and only scare you further.",
            "title_similarity": "0.7553328",
            "sentiment_compound": -0.9534
        },
        {
            "id": "h6aea72",
            "score": 1,
            "text": "If I were you, I’d maybe check on a plug in hybrid car for now. That should give you plenty of range for those long trips, with short gas station visits. But also give you the benefit of having a plug in electric car.\nSure, even those will be phased out in the future, but it could a nice in between while the quick charging situation get figured out.",
            "title_similarity": "0.63449466",
            "sentiment_compound": 0.8922
        },
        {
            "id": "h6aeguu",
            "score": 1,
            "text": "In my neck of the woods there is an abundance of teslas. They get 350+ miles per charge. There is a Tesla super charger at the target nearby, where an hour charge gets a pretty decent battery bump. You can easily spend an hour at target. 10 years ago I think most EVs got <100 miles per charge. Now they get 200-300+. In a few years, probably even more than that. \n\nAlso, the infrastructure is being built up. If you live in SoCal you’re always close to a charge. Most other big cities have public charging and you won’t be at a shady gas station. I charge while at the gym and Whole Foods. Not exactly shady…Also all the libraries here have charging stations. \n\nBut, in the very near future…like for next week… get a plug in with range extender. The bmw i3, Chevy volt, and a couple others are electric drive with a gas generator attached. So if you do use up your 200+ miles, you can spend 5 minutes at a shady gas station and get another 100 miles or so burning Dino juice. But for regular work and back driving, you’ll be all electric.",
            "title_similarity": "0.66194177",
            "sentiment_compound": 0.6428
        },
        {
            "id": "h6aei16",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6aeoqi",
            "score": 1,
            "text": "It sounds like you should wait for plug-in hybrid electric vehicles (PHEVs) to advance their technology in the upcoming years. Right now, there are many hybrid cars that can plug in and go 20-30 miles on electric before using gas. I cant wait for the day until that number goes up to 100ish miles. Will be perfect for running around the city expense free, but also can use gas on longer trips so you don’t need to wait to recharge.",
            "title_similarity": "0.68504405",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6af3di",
            "score": 1,
            "text": "Damn society is pathetic",
            "title_similarity": "0.31515336",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h6afaaw",
            "score": 2,
            "text": "You get get a gun, training, and a CCW.",
            "title_similarity": "0.09324019",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6afdrt",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6affx4",
            "score": 1,
            "text": "I'm going to sound like an ad, but check out Aptera. They have a super lightweight composite 2 seater than can have 1000 mile range and it has solar panels on it so it can get up to 40 miles a day from that alone. The smallest range one is 250 miles for ~$25,000 and the 1000 mile one is ~$46,000.\n\n(If you are really considering getting one though, they have a referral program. I'm still on the fence, but I'd rather be on the fence with a discount code)",
            "title_similarity": "0.64757466",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h6afkj3",
            "score": 1,
            "text": "Get a hybrid and always carry a weapon and practice using them very often. A nice pepper gel will do if a gun, knife or bat makes you nervous. People can come up into home and we’re there much longer than 40 minutes. We can’t stop assholes but we sure can slow ‘em down.",
            "title_similarity": "0.62814206",
            "sentiment_compound": -0.2187
        },
        {
            "id": "h6afm05",
            "score": 1,
            "text": "So with some cars doing 500km these days I can see anyone having to top-up somewhere they deal safe... If they need to top-up?\nMy sister has an electric car she's hardly ever actually used public chargers as very few journeys are more than the range of the car.",
            "title_similarity": "0.73291206",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6afxjy",
            "score": 1,
            "text": "Electric cars cannot do distance well, are overpriced, resource intensive and a tiny percentage of all vehicles on the road. There's a shortage of safe charging stations and the batteries are affected by temperature. Electric cars are overpriced grocery getters. I could buy a used Honda CRV for 10k that would go for hundreds of miles on one tank of gas, with plenty of places to gas up in between. EV batteries drain when the temperature is high or low because you need to heat or cool. Their efficiency is impaired further in colder weather as well.",
            "title_similarity": "0.8224227",
            "sentiment_compound": 0.5083
        },
        {
            "id": "h6afy66",
            "score": 1,
            "text": "Assuming you're in a country that allows you to, buy a gun and learn how to responsibly use it. It is the equalizer between a petite female like yourself and somebody potentially much larger than you intending to do you harm.",
            "title_similarity": "0.48449206",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h6afzrz",
            "score": 2,
            "text": "Tesla owner here, unless you're driving literally all the time, the only time you'll ever charge at the station is on long road trips, you can plug into any external outlet like you would for a phone, and can still charge your car. Buying a Tesla was the best thing I've ever done. It's saved me tons of money in many ways, and it's fast and slick as hell.",
            "title_similarity": "0.6339728",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6ag32f",
            "score": 1,
            "text": "you are worrying so much for a scenario that wont happen. gas cars arent gonna go extinct in this lifetime",
            "title_similarity": "0.6576784",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6ag9bb",
            "score": 1,
            "text": "Get an electric car when solid state batteries are a thing. From what I heard on Japan they're almost there.",
            "title_similarity": "0.3976068",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6agm7k",
            "score": 3,
            "text": "Usually super chargers at are newer, nicer places with better lighting. And you have other well off people who are usually also charging their Tesla’s. So it’s overall much safer. You can also always rent a car if you are going for long drives out of town. This makes you save way more money and also not having to ever go to a gas station while you are driving locally. It’s a win win win.",
            "title_similarity": "0.65609694",
            "sentiment_compound": 0.9821
        },
        {
            "id": "h6ah2jv",
            "score": 1,
            "text": "Miner is burning Li batteries. I live in rural America and I know for sure they have no idea how to put them out.",
            "title_similarity": "0.66129446",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h6ah3d2",
            "score": 3,
            "text": "I find when on long road trips and having to stop in the middle of the night that casinos are typically the safest and cleanest rest stops. I don’t gamble, but I would grab a bit to eat, hit the bathroom, and by then I’m guessing your car would be charged. There’s security everywhere and typically free decent coffee or caffeine beverage too!\n\nEdit: spelling",
            "title_similarity": "0.65360004",
            "sentiment_compound": 0.7644
        },
        {
            "id": "h6ahaiv",
            "score": 1,
            "text": "This is the dumbest cmv I have ever seen. It's almost so dumb I don't believe it's real. Just lock your door and chill. If this is actually real, then I'm sorry, but your fear and delusion is so debased from reality that you need serious help.",
            "title_similarity": "0.6384193",
            "sentiment_compound": -0.7137
        },
        {
            "id": "h6ahuh0",
            "score": 1,
            "text": "you should try being black for a few days hahaha",
            "title_similarity": "0.27493715",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6ahy44",
            "score": 1,
            "text": "Tbh I'd be less concerned about that and more concerned about getting repairs done. I feel like that'll be expensive",
            "title_similarity": "0.48610336",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6ai2ht",
            "score": 1,
            "text": ">I try and spend as little time as possible at the gas station because it feels unsafe. I understand that a lot of men won't know what that's like or even give it a second thought.\n\nMen are more likely to be attacked by strangers than women are. Not saying that your feelings are invalid, just pointing out that things may be different than most people think.",
            "title_similarity": "0.82590616",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6ai46b",
            "score": 1,
            "text": "Buy a piece for your peace.",
            "title_similarity": "0.07834204",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6aij57",
            "score": 1,
            "text": "I mean, if you're really THAT worried, use the money you save on gas to buy a Glock or other handgun. This strikes me as a complete non-issue though if you're inside the car with the doors locked.",
            "title_similarity": "0.6815736",
            "sentiment_compound": -0.2854
        },
        {
            "id": "h6ajlr4",
            "score": 1,
            "text": "Then don't get one until charging times get better.  Or stop going outside if you're that scared",
            "title_similarity": "0.54635674",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6ajmp4",
            "score": 1,
            "text": "Sounds like entitlement. Just be responsible and make sure your car is charged before you leave. like others have said. There's plenty of ways around it other than just hanging out at a gas station. Overthinking can be a curse sometimes, but most of the time it just makes you further commit to fears of what could happen, than what's going to really happen.",
            "title_similarity": "0.71380115",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h6ajqtu",
            "score": 2,
            "text": "Charging at home is probably the best part, and as these get more common, they'll get less expensive. $80 is already more than twice what a base Model 3 costs.\n\n*Most* of the Tesla superchargers are reasonably nice places to stop -- like people are saying, they tend to be actual shopping plazas and such, places you could go inside. Most of the ones I stopped at had multiple cars plugged in, too. And those cars likely have Sentry Mode enabled -- I don't know how widely known this is, but if someone was going to try to do something violent, probably not a good idea to do it next to that many cameras!\n\nThere's also a surprising number of stops that are just hotel parking lots. And even when the hotel is kind of out of the way, it tends to be a decent hotel with a decent lobby that I'd definitely feel safe in.\n\nUnfortunately, I have seen stops that are closer to what you're afraid of: In the middle of nowhere in a gas station parking lot somewhere along I-80 in Nevada, for example. And I was stuck there maybe 30m. I didn't feel unsafe, because it was the middle of the day and there were plenty of people around, but it was basically just a gas station and a McDonald's and not much else.\n\nAnd because there are so few of these stations in the first place, you usually arrive with a pretty low battery. Charges faster that way, but it also means fewer options to just nope out of there and get to the next charger the way you might if a gas station looked sketchy enough. Hopefully that'll be less of an issue if gas really does get entirely replaced...\n\nSo my advice would be to plan your route ahead of time, plan to do most of it during the day, and any night driving you have to do, plan to do it in relatively heavily-populated areas (or at least, see if your charging stops can be in relatively heavily-populated areas). Other than that, there's stuff you can do to make things safer, and you're *probably* fine, but for now the thing you're afraid of does exist.",
            "title_similarity": "0.6319287",
            "sentiment_compound": 0.7531
        },
        {
            "id": "h6ajs6w",
            "score": 1,
            "text": "Im pretty sure noone needs 40 minute prep time for assault, And i dont think just driving by assaulter Is a problem (Its hard to see who sits in the car, And time out Is identical or lesser in electric than gas)\n\n\n if you got Away after 2 minutes with gas, you would get Away after 40 mins on electricity.",
            "title_similarity": "0.8042987",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6ak65m",
            "score": 1,
            "text": "Just got a hybrid Rav4. \\~40 mpg and it gets 500+ miles per tank of fuel.    \nThe Highlander is bigger and therefore less MPG, but these new hybrids are awesome.",
            "title_similarity": "0.54782295",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h6ak9ym",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6akc2u",
            "score": 1,
            "text": "As a man, I understand I'll never be able to fully sympathize (and acknowledge being a woman is far more dangerous in these situations).  But have you considered if the problem is partially just one of perception?  I don't mean to suggest stopping at gas stations doesn't pose a risk to your safety, but just driving by itself exposes you to quite a bit of risk.  An EV would allow you greater choice in where to stop to charge your vehicle, so instead of having no option outside that single shady gas station, you can choose a more populated restaurant or hotel.  And with time, the options will dramatically increase.",
            "title_similarity": "0.7923085",
            "sentiment_compound": -0.2904
        },
        {
            "id": "h6akklh",
            "score": 2,
            "text": "You ask specifically about long trips. \nAnd you worry about long wait at charging stations. \n\nHere are some points to consider. \n\nTake an EV with a larger battery and highly efficient. It’s kinda obvious, but makes for less charging stops. \nThen chose one with a very well built, managed and extensive charging network. I mean a charging network both for travel but also for destination charging. And reliable, with all the info at hand in the car. \nMake yourself comfortable and chose a car that provide Information like availability (how many stalls, how many occupied, how may failed) but also amenities around it (restrooms, restaurants, hotels, malls…). And a browser with a big screen that you can you consult the site’s proposed facilities directly. \nAnd because you might now and then want to do this while driving, make it safe by choosing a car that can pay attention to the road and in fact drive safely for you, while you check those information. \nAlso chose a car that will not make it hard to charge: just plug and charge. No time lost trying to figure out how to initiate a charge, which app to use, which payment method accepted. And then all the stress when that does not work and you need to call the operator and they start arguing that maybe it is your car that has a problem so call you dealer.\n\nI’d indeed recommend a Tesla, that will provide all of the above for a safe and uneventful charging experience. \n\nAs you are concerned with safety, know that all Tesla have Sentry mode: cameras all around the car are recording. This is indeed often used after an incident happened, as proof, but I think now people now more about this and thus, maybe wishful thinking, but would be discouraged to act offensively around a Tesla. \n\nGood for you to think about going electric. Probably you know it already, but these cars are really great to drive. And if you’re concerned about the environment, that’s the way to go. \n\nSorry about the long post, but I hope it helps change your mind. The more electric on the road, the better by my book. \n\nWishing you already safe trips. \n\nDisclaimer: I indeed have been driving a Tesla for the last 6 years. \n\nLast tip: you can also use abetterrouteplanner.com to plan EV road trips, to explore and plan ahead, with any EV",
            "title_similarity": "0.60196745",
            "sentiment_compound": 0.9903
        },
        {
            "id": "h6akml3",
            "score": 1,
            "text": "Get pepper spray. Like to meet a mf who can not cry out after one dosage lol.",
            "title_similarity": "0.37291768",
            "sentiment_compound": 0.7817
        },
        {
            "id": "h6alj8x",
            "score": 1,
            "text": "If you like to drive across the country an elective vehicle is probably a pretty bad choice anyway",
            "title_similarity": "0.62742347",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6alldf",
            "score": 2,
            "text": "I don’t want to get an electric because I just found out it takes 40 minutes to recharge",
            "title_similarity": "0.7750052",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6am7uj",
            "score": 1,
            "text": "Do you think people are. Carjacking modern electriccars regularly? Most cars now can easily be traced and thief’s would target older cars with less security features. It sounds like you feel unsafe in daily life if this is actually a concern to you. You could move if your community makes you feel unsafe. Or if legal in your state Cary a firearm or pepper spray.",
            "title_similarity": "0.70833254",
            "sentiment_compound": 0.7584
        },
        {
            "id": "h6amrwz",
            "score": 1,
            "text": "1. Nearly all my charging is done in my garage.\n\n2. The rest has been done in very public well lit Walmart or Walgreens parking lots. \n\nI'm much more afraid of gas stations than either of those locations",
            "title_similarity": "0.68549514",
            "sentiment_compound": 0.3353
        },
        {
            "id": "h6an1fo",
            "score": 1,
            "text": "By the time electric cars are the only option the infrastructure will improve and charging stations will be as common as gas stations, and the price and charging time will drop\n\nI would not drive cross country in an electric car now, but you don't; need to worry about the future, because the tech should improve, so you won't have these problems",
            "title_similarity": "0.7038125",
            "sentiment_compound": 0.8819
        },
        {
            "id": "h6anh7w",
            "score": 1,
            "text": "Nobody wants to wait 40 minutes for their car to recharge.  Hopefully super capacitors will be available in cars soon.  Charge time will take a minute or two, just like filling a tank of fuel.",
            "title_similarity": "0.74124825",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h6annaw",
            "score": 1,
            "text": "You stay in the car, locked, for 99% of that 40 minutes. You don’t stand outside by the pump like a gas station.\n\nedit - or you leave the car charging, and you go get a snack at a restaurant. The charger locks. Your car locks.",
            "title_similarity": "0.6945696",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6anqnz",
            "score": 1,
            "text": "You can get a hybrid -- still saving the planet most days, gas for when you need to drive for longer.",
            "title_similarity": "0.44359398",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6anx4d",
            "score": 1,
            "text": "Get the bulletproof version you'll be fine",
            "title_similarity": "0.06895769",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6ao2yg",
            "score": 2,
            "text": "It's truly saddening that women in third world countries have to have these kinds of fears.",
            "title_similarity": "0.5534545",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6ao32b",
            "score": 1,
            "text": "I drive a Leaf with around 100 miles range.  I charge at home and have only had to use an outside charger twice last year.  I planned it well in advance as I knew I was going on a longer journey.  Usually I use between 10-30 miles a day. Plug it in overnight.  Another full charge. If you are regularly doing 250 mile a day, which I doubt, invest in a Tesla for fuel economy alone.   It also has the added security advantage of filming any person that goes near it.",
            "title_similarity": "0.71597207",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6ao3ec",
            "score": 1,
            "text": "Why not charge at home? That is where 99% of electric car charging occurs.",
            "title_similarity": "0.42455375",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ap9i3",
            "score": 1,
            "text": "I think with the time it takes to charge we are either going to see a shift in what it means to go to the gas(charging) station or see more efficient charging like I can see a charging station being a small restaurant or movie or bowling like u get me it's going to be something to make that wait feel shorter",
            "title_similarity": "0.5220101",
            "sentiment_compound": 0.8104
        },
        {
            "id": "h6apa0v",
            "score": 1,
            "text": "sit in the car and lock the door",
            "title_similarity": "0.21228299",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6apk3l",
            "score": 1,
            "text": "How often are you road tripping over 400km?! If you need to take a road trip and are worried about pit stops rent a car for cheap and save the mileage on your nice EV. Save the planet.",
            "title_similarity": "0.72168916",
            "sentiment_compound": 0.7712
        },
        {
            "id": "h6apkuz",
            "score": 3,
            "text": "I agree,  the lack of places to charge is a concern and the time it takes.  I am also female so I understand the fear.",
            "title_similarity": "0.55788505",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h6apwua",
            "score": 1,
            "text": "I have supercharged about 6 times in the last 18 months.",
            "title_similarity": "0.15329948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6aq25v",
            "score": 2,
            "text": "This is not a problem of electric cars, but more a problem of skewed perceptions. The rate of crime today is more than 75% lower than it was in 90s. It's just a fact that in the last 25 years, crime rates have been dropping and the US is a safer place than it was.\n\nYet at the same time, people seem to believe that the crime is actually going up. The reasons could be complex, from sensational media to the social upbringing with stranger danger and amber alerts. Whatever it is, it makes people believe that there is a lot of crime and danger when in fact the situation has been continuously improving for the past 3 decades. \nhttps://www.pewresearch.org/fact-tank/2016/11/16/voters-perceptions-of-crime-continue-to-conflict-with-reality/\n\nThe solution is not to avoid electric cars, but to recognize that you might have a fear which is not consistent with reality and try to work to get rid of this perception of danger, so that it does not dictate your life decisions.",
            "title_similarity": "0.62970924",
            "sentiment_compound": -0.9882
        },
        {
            "id": "h6aqnsh",
            "score": 1,
            "text": "Just drove 1300 miles 2 different times in a week and had to stop for gas 3-4 times each trip. I was thinking how electric cars would manage long road trips 300+miles. Seems it be a hassle to find the right place to charge then be stuck there for a hour at least until you can move again, compared to a car where there's gas stations on almost every highway exit and takes 2 mins and you're gone.\n\nI still want an electric car but I want this problem fixed before I'm willing to give up gas cars for long distance driving road trips",
            "title_similarity": "0.8374386",
            "sentiment_compound": -0.6896
        },
        {
            "id": "h6aqqjc",
            "score": 1,
            "text": "That’s why I like NIO battery swap stations. No need to get out of the car, takes 2 minutes to get a full charge.",
            "title_similarity": "0.5403247",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6aquyz",
            "score": 1,
            "text": "I own an ev and a gas car I would never suggest an ev for you an EV is good for 2nd car not only provided other is gas and EV is not for long distance (Tesla maybe I do not have $80k)\n\nEv is great for groceries kids golf store movies mall etc bad for any long trip\n\nA) fast charge is very slow if battery is hot and it will be after a long drive\n\nB) fast charge locations are hit and miss blink chargers are always broken then what? often you wait hours for a level2 to finish where do you go pee while you wait?\n\nLook at the apps why do you think the app lists last time station was used there is a reason for that detail\n\nC) often dead car stuck in parking spot or if you go walk while you wait for a spot some body jumps in front of you or the machine is broken or asshole Karen or ken is parked in charge spot\n\nCops will not tow nor will charging company what are you going to do wait 3hrs for tow truck to arrive?you have things to do\n\nD) if we go distance we go by gas if we go around town (1 to 1.5 hr round trip or 100 to 125 miles) we are good in the EV any thing more we use gas \n\nBut I would never ever recommend EV for you",
            "title_similarity": "0.8462211",
            "sentiment_compound": -0.7618
        },
        {
            "id": "h6arbxe",
            "score": 1,
            "text": "I'm a petite woman and it has honestly never occurred to me I'm supposed to be nervous at gas stations.",
            "title_similarity": "0.6401233",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h6arc2z",
            "score": 1,
            "text": "If you live in the United States you could always take a concealed weapons course and carry a concealed weapon. It's not for everyone, but I've heard some women feel much safer in lots of places with that as an option. \n\nAgain, it's not for everyone, and the second amendment is a pretty hot topic. Just throwing in some thoughts I've heard.",
            "title_similarity": "0.63444424",
            "sentiment_compound": 0.81
        },
        {
            "id": "h6arr6k",
            "score": 1,
            "text": "Keep a gas powered generator in your car",
            "title_similarity": "0.22920048",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6arsgm",
            "score": 1,
            "text": "40mins? I’m reluctant just on that fact for being there that long.",
            "title_similarity": "0.50983566",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6as51m",
            "score": 1,
            "text": "\"It doesn't seem sensible for a petite woman to go on long trips alone.\"\n\nThere, I identified your problem without blaming something else. ;)",
            "title_similarity": "0.62867486",
            "sentiment_compound": -0.0444
        },
        {
            "id": "h6ascz4",
            "score": 1,
            "text": "If this is based off “gas cars going away” it sounds a little foolish. How long do you truly think it’s gunna take? Do you honestly think gas powered vehicles are going to be phased out like that? A solid Hybrid vehicle would increase how far you could travel and decrease gas costs…",
            "title_similarity": "0.60079014",
            "sentiment_compound": 0.8706
        },
        {
            "id": "h6asgzc",
            "score": 1,
            "text": "Oh man every dude on this going “BuT mEn ArE vIcTiMs ToO”. Are you whiney petulant children really unable to not make this about yourself for 5 fucking minutes? Jesus Christ.",
            "title_similarity": "0.54519117",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h6bbp1k",
            "score": 1,
            "text": "Well, if your American is recommend carrying a handgun on you to defend yourself. If not maybe a strobe light or an incredibly bright flashlight to blind your opponent.",
            "title_similarity": "0.47014868",
            "sentiment_compound": 0.624
        },
        {
            "id": "h6bbrda",
            "score": 1,
            "text": "For one no your not paranoid, it’s ok to feel a bit scared in this world, I do know there are locking attachments to hook onto those chargers and you can lock your doors from the inside if need be, if things take a turn for the worst don’t hesitate to call 911 \nSending all the love!",
            "title_similarity": "0.5544994",
            "sentiment_compound": -0.6641
        },
        {
            "id": "h6bck0b",
            "score": 1,
            "text": "Then don’t. Charge at home.",
            "title_similarity": "0.23967257",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6bd0t6",
            "score": 1,
            "text": "If your a woman, you are less likely to be a victim of violence",
            "title_similarity": "0.39121115",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h6bd65o",
            "score": 1,
            "text": "You sound irrationally paranoid. Like I don't wanna belittle your fears, but i suspect your assumptions are based on spending too much time on the internet and not enough in real life. I dont think it's at all realistic to expect someone will attack your while you charge your car",
            "title_similarity": "0.74319196",
            "sentiment_compound": -0.827
        },
        {
            "id": "h6bdfbw",
            "score": 1,
            "text": "Stay in the car",
            "title_similarity": "0.09590627",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6bdut3",
            "score": 1,
            "text": "If that's your concern, a EV should be your top option since ideally, you will be charging your car at home or at work. Not at a charging station",
            "title_similarity": "0.55758953",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6be0si",
            "score": 1,
            "text": "I think comparing EVs to filling up on gas is misleading, charging an electric car is basically parking your car somewhere near shopping/attractions or at home, not waiting in your car until it’s charged (even with quick charging this would get boring every time you charge). The only charging stations I’ve seen have been in relatively nice areas\n\nOfc there’s always some people who try to get your attention but that’s the risk of going outside unfortunately. I’ve had my EV for 5 months and in that time two men have stopped me when I got back to my car to drone on and on about EVs, but they were relatively harmless",
            "title_similarity": "0.83908606",
            "sentiment_compound": -0.765
        },
        {
            "id": "h6be0wl",
            "score": 1,
            "text": "80k for what? You can get a tesla for 35k...",
            "title_similarity": "0.3028134",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6be507",
            "score": 1,
            "text": "Lol otherwomen across the world don't even have vehicles to roam around in and your worried about sitting in your car in public",
            "title_similarity": "0.7582313",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6bed4y",
            "score": 1,
            "text": "I wouldn’t get an electric car just based on the cost alone, but there are several other reasons that I won’t get into because that’s not what this post is about. HOWEVER I cannot tell you how many times I’ve been in an area where I have FELT unsafe but have been completely fine. Was there a chance my unease was valid? Absolutely. Feeling uncomfortable keeps you alert incase anything DOES happen. I do not however believe that should be your first consideration because chances are, you’ll be fine. Stay alert and ready to defend yourself, but chances of anything happening are slim.",
            "title_similarity": "0.73492754",
            "sentiment_compound": 0.8982
        },
        {
            "id": "h6bed5x",
            "score": 1,
            "text": "No one is trying to kidnap or rape you.  Get over yourself.",
            "title_similarity": "0.31643775",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h6beuc9",
            "score": 1,
            "text": "Cannot agree more, luckily I don't feel as unsafe as you...lol, actually have enough street intelligence to be around my sh country, having said that, not even in the most advanced country I'll drive electric, not at least for a couple decade's...in this weird times you need reliable wheels, be safe, and learn to handle situations, as weird as it could sound, being relax, (but paying attention, not lost on your phone), will keep you safer than being a scardy cat",
            "title_similarity": "0.6599321",
            "sentiment_compound": 0.8145
        },
        {
            "id": "h6bfhfg",
            "score": 1,
            "text": "You're not really saying that you WANT to get an electric car, you're just reluctant. As someone else pointed out, there are many places to charge your car, not just at rest stops. Also, you most likely won't find a charger in the middle of nowhere. At least where I live there are a few employers that have installed level 2 charging for their employees, local shopping centers have level 2 and DC fast charging, even some municipal parking areas have chargers. I have seen a few public parks with level 2 chargers as well.\n\nConsidering you mentioned sitting in an $80k car, it seems you may be thinking Tesla. The stations that I have seen are brightly lit and near other businesses, they also seem to be big on \"destination charging.\"\nIf you plan out your trip using an EV app like plugshare you could plug in at a charger and then eat lunch or check out some local attraction. Most times you won't even be just sitting in the car waiting.",
            "title_similarity": "0.80639815",
            "sentiment_compound": 0.8192
        },
        {
            "id": "h6bfx6s",
            "score": 1,
            "text": "Where are you at? I’m my country (Malaysia) we have charging stations at some shopping center parking lots, you can park your car and leave it to charge while you run errands/shop. Few birds one stone, it’s pretty convenient and time saving!",
            "title_similarity": "0.48481572",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h6bg59u",
            "score": 1,
            "text": "What a strange viewpoint. Sit in the car locked or go about your day? Carry a firearm? Rent a gas car on cross country drives? It’s not hard",
            "title_similarity": "0.50488335",
            "sentiment_compound": -0.2603
        },
        {
            "id": "h6bg5og",
            "score": 1,
            "text": "Ever heard of locking the door?",
            "title_similarity": "0.23562947",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6bgb8k",
            "score": 1,
            "text": "Buy a Prius.",
            "title_similarity": "0.11260626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6bggn2",
            "score": 1,
            "text": "You have so many alternatives to charging your vehicle.",
            "title_similarity": "0.29971412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6bglfl",
            "score": 1,
            "text": "This is why I like Nio’s idea of having swappable batteries in electric cars.\nPull up, pay, guy comes out with a dolly and swaps out dead battery for one off the charger. No wait times",
            "title_similarity": "0.49840945",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h6bh0ym",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bh1a0",
            "score": 1,
            "text": "We’ve owned an EV for almost a year now.  During that time, we’ve only had to power up away from home twice...both times traveling.  Our car tells us about all charging stations along the way including how many cars that are currently charging.  We chose to pick to charge at Sheetz stations because they are always busy.  The rest of the time we charge at home.  We haven’t noticed any large increase to our electric bill.  No problems at all......in fact we also own an older gas car.....I’m at the gas station just about every week with that one.",
            "title_similarity": "0.6936964",
            "sentiment_compound": 0.5511
        },
        {
            "id": "h6bh297",
            "score": 1,
            "text": "You could get a home charger, and spend ZERO time at any rest stop ever again, if you keep your trips within the range of the car",
            "title_similarity": "0.59527516",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6big8g",
            "score": 1,
            "text": "Well there’s what’s statistically likely, and your fear which is irrational given the statistical chances. Not that your fear isn’t real, but know that it’s fear given to you by movies, TV, and horrible rare situations that you read online",
            "title_similarity": "0.50442296",
            "sentiment_compound": -0.8775
        },
        {
            "id": "h6bihp5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6biyyg",
            "score": 1,
            "text": "That's fair.  If you regularly drive on long road trips for business or vacation, then I wouldn't get an electric car.  If you own your house, and will be using it for your commute than you will be charging it over night at your house.  99.9% of the time.",
            "title_similarity": "0.74087024",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6bj1vb",
            "score": 1,
            "text": "One key difference between electric cars and gasoline (or diesel for that matter) is you can only get gas at a gas station whereas you can charge an electric car just about anywhere. You could likely go to a cafe or restaurant, have something to eat and charge up.\n\nIt’s also important to note the distinction between not *feeling* safe and actually being safe. Feelings are not always reality.",
            "title_similarity": "0.69715315",
            "sentiment_compound": 0.2556
        },
        {
            "id": "h6bj248",
            "score": 1,
            "text": "> I like to drive across the country\n\nThat reminds me of the story about hunters and the bear.\n\nThe punchline to that story is: \"I think you like it\".",
            "title_similarity": "0.42170095",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h6bj6hp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bjm9m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bl5y3",
            "score": 1,
            "text": "No shade to OP but I honestly cannot imagine what it's like to maneuver through the world with this kind of fear. If I was in the same position, thinking of buying an electric car, I am positive this kind of thinking would never even cross my mind. I have traveled cross country by myself numerous times and I never once was worried for my safety simply because I was a woman. I mean yes you have to be aware of your surroundings and make safe choices but my mind just doesn't work this way I guess.",
            "title_similarity": "0.78988457",
            "sentiment_compound": 0.965
        },
        {
            "id": "h6bm2yi",
            "score": 1,
            "text": "Then charge your car at Target.",
            "title_similarity": "0.27154294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6bm9e3",
            "score": 1,
            "text": "If you get your windows tinted dark enough no one will be able to see you sitting in your car.. but I understand your worry",
            "title_similarity": "0.66227424",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h6bmase",
            "score": 1,
            "text": "I'm a woman and your fears are absolutely absurd. Unless you've actually been accosted multiple times at a gas station I the past, then your fears are unjustified. Not everything you see in the movies actually happens in real life. If you're really that daft that you think someone will harass you at a gas station of all places, just sit in your car while it charges and carry something protective with you, otherwise grow some better common sense.",
            "title_similarity": "0.80199015",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h6bmcj3",
            "score": 1,
            "text": "Get tinted windows, a sun shade and put gun owner bumper sricker on your car.. or actually buy a gun.",
            "title_similarity": "0.4344626",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6bmcqz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bmdzu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bmphj",
            "score": 1,
            "text": "I'm a guy who could decently protect himself. I have to travel long distances sometimes with my work and I have had to stop at fuel stations in the middle of the night I am keen to get out of asap. \n\nWhether that be dodgy people staring at me in the car lot or a lack of anybody around in the middle of the night.\n\nEven car charging stations which we have a few of in my town, they are in spots that are completely isolated with no buildings to run into or ask for help.\n\nI think electric cars are great and the way of the future. But if there's something about them that makes you feel unsafe, then follow your gut feeling.",
            "title_similarity": "0.7862377",
            "sentiment_compound": 0.3552
        },
        {
            "id": "h6bn8yk",
            "score": 1,
            "text": "5 years with two different electric cars. I’ve always charged at home or work unless I’m going to Vegas (from SoCal) and since I have a Tesla I stop at busy charging stations, go to the bathroom, grab some jerky and my car is well charged to get where I’m going.  Range anxiety is a thing but after about a month you figure out what works for you and never stop in a shady area again!",
            "title_similarity": "0.754402",
            "sentiment_compound": 0.1088
        },
        {
            "id": "h6bnan0",
            "score": 1,
            "text": "I have been stopped at the gas station several times. I am not exactly a gorgeous woman, but I’m not unattractive. It doesn’t matter if I’m in PJs or dressed up. I’ve been told as I am cashing out by some man that he is going to meet me at the pump and get my\nnumber. Another time some guy followed me when I pulled into the gas station to also insist I give him my number. And he saw me before he decided to do that. So I can’t speak on the electric car part, but I’m sure you’ve have your own experiences that are similar or at least just as jarring. You’re very valid for worrying about being stuck in one location for a long time.",
            "title_similarity": "0.7413995",
            "sentiment_compound": -0.1145
        },
        {
            "id": "h6bnrie",
            "score": 1,
            "text": "depending on where you are, theres little point in it anyway.\n\nin Pennsylvania, where i live, most of our electricity comes from coal, meaning the carbon emissions of an electric car really dont change much.\n\ni mean, electric cars dont really affect climate change in a big way anyway. the majority of emissions are industrial, google \"polluter class\" if you care.\n\ni suppose my point is, youre right, but there are better reasons to forego that switch.\n\nget a hybrid.",
            "title_similarity": "0.6691848",
            "sentiment_compound": 0.6187
        },
        {
            "id": "h6bo8tu",
            "score": 1,
            "text": "Well if you can drive across country and drive a 80k car you're doing fine. Not even guy is a pig... you don't need to be afraid of everything. Enjoy your riches",
            "title_similarity": "0.5142083",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h6bo978",
            "score": 1,
            "text": "The likely hood of you being harmed is equal to that of a male.\n\nStop being paranoid over a non existent threat.\n\n\nThis is coming from a paranoid schizophrenic with PTSD due to a history of violent assault. So I do know what it’s like as a man to be terrified and the simple truth is you have you face your fears as irrational and try to move on.",
            "title_similarity": "0.5273317",
            "sentiment_compound": -0.9744
        },
        {
            "id": "h6boeya",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6booac",
            "score": 1,
            "text": "Lock your door?",
            "title_similarity": "0.082487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6boqlh",
            "score": 1,
            "text": "Electric cars are great! You can always plan your longer trips so that you’d be charging up somewhere during the day, just like I get gas on my lunch break when it’s still bright out. And if you don’t plan on driving long distance very often you shouldn’t worry too much about it, like others have said just plug it in every night when you get home!\n\nAlso I see a lot of talk about air bnb, and just want to say they were in fact caught giving a SA victim a very large sum of money to stay quiet and have covered up thousands of reports of SA cases. Realistically it’s not a safe option if you don’t bring a door jammer, the person you’ve booked through has a key or code just like you do for where you’re staying whether it’s a guest house or a private room. Also air bnbs are super expensive just to charge your car, I’d definitely recommend just using a government building or Starbucks during the day.",
            "title_similarity": "0.7433278",
            "sentiment_compound": 0.9611
        },
        {
            "id": "h6bowmk",
            "score": 1,
            "text": "Get a handgun.",
            "title_similarity": "0.019365076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6bp6xq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bpv1z",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bpwn7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bpwpr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bq365",
            "score": 1,
            "text": "May be unpopular... but get a conceal and carry permit in your state and a bit of weapon training. A firearm is the great equalizer for self defense... \n\nIt truly sucks that our civilization is at such a point where any woman should be made to feel in any kind of danger even at a gas pump.  And I'm sorry that you (and all women) have to deal with this!  I highly suggest a CCW and weapons training for all persons, not just women.  Self defense is our right and it doesn't matter how petite the bearer is or how much bigger the attacker... gun beats muscle.",
            "title_similarity": "0.69804466",
            "sentiment_compound": -0.9176
        },
        {
            "id": "h6bq3z9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bq51i",
            "score": 1,
            "text": "Look the reality is that a man that's 6''3\" 270lbs, and I'm 5'8\" 200, can be just as frightened and honestly as easy of a target. When people fight back in a robbery or rape, an attack on  another human, of course innocent or even terrible! People will do what their nature is. For example even Joe Rogan has guns for self defense. You feeling as though this happening to you vs a fat white guy in the same place is scariest for you is irrelevant. If you can carry a gun do it. I did private security and always carried a gun. You're just along for the ride, like the rest of us. Seriously get a small handgun and train with it..you'll be more deadly than anyone without a gun at least.",
            "title_similarity": "0.64952934",
            "sentiment_compound": -0.7879
        },
        {
            "id": "h6bqfy3",
            "score": 1,
            "text": "Why not just get one that also uses a back up generator powered by gas.  Charge when you can but in the event you can't the generator will do it.",
            "title_similarity": "0.51846445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6bqns1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6br006",
            "score": 1,
            "text": "Have you considered buying a gun? With proper training it might give you the piece of mind to find comfort in situations that are inherently pretty safe but currently give you high levels of stress.",
            "title_similarity": "0.5496645",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6br6dn",
            "score": 1,
            "text": "We have an EV and a gas car. I use the EV to drive to work every day and plug it in every night when I get home. The car is my husband's and we use that for the long drives. I haven't had to spend any time at the gas station ever since I got my little EV and I love it. It's an older Nissan Leaf, so it doesn't have a huge range, but it's been a great little commute vehicle. We also have solar panels, and the guy installing them added another panel for the car.",
            "title_similarity": "0.68943715",
            "sentiment_compound": 0.8303
        },
        {
            "id": "h6brfr3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6brvxb",
            "score": 1,
            "text": "I've been jumped by a group of guys and sent to the hospital for emergency surgery, another occasion held at gun point and I still have no issue walking around somewhat sketchy areas at night by myself. Only difference is now I'm more aware of my surroundings and carry something for self defense. Buy the electric car and don't over think that scenario, don't tip toe around life because you're fearful of anything and everyone",
            "title_similarity": "0.73635066",
            "sentiment_compound": -0.836
        },
        {
            "id": "h6brxzn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.009015491"
        },
        {
            "id": "h6bs2va",
            "score": 1,
            "text": "This has probably been said, I scrolled a bit but didn’t read all the comments. An EV doesn’t seem like the right choice anyway if you frequently “drive across the country”. It will add so much time to any trip. I guess it depends on how large that country is, but even a 6 hour (400ish miles) drive in a model 3 was kind of annoying when I’ve done it.",
            "title_similarity": "0.84288067",
            "sentiment_compound": -0.1875
        }
    ]
}