{
    "CMV: I don’t think a distinction should be made if women are victims of a crime, it does not make the tragedy any worse.\n\nSometimes if you hear a tragedy being reported… you might hear that women and children were among the victims.\n\nI’ll give children a pass… but I don’t think it is relevant to know that women were also victims. I don’t think they should stand out even more.\n\nEven in works of fiction, you might have some bad ass. He lives by a code though… he doesn’t kidnap or kill women. He would have no problem popping 2 in a guys head just because, but women are off limits.\n\n\nWhen a tragedy happens, it’s a tragedy regardless of who it happens to.  None of the victims deserved what happened to them. People who were loved were lost. We shouldn’t be more sad or less because of the sex of the victims .": [
        {
            "id": "h6d8uj5",
            "score": 1,
            "text": "/u/Babou_FoxEarAHole (OP) has awarded 5 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/oqqyok/deltas_awarded_in_cmv_i_dont_think_a_distinction/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.4408328",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h6d7mec",
            "score": 0,
            "text": "Sounds good in theory but this isn't realistic. It might be equivalent to you but at the base of it all, eggs are more valuable than sperm so the life of women is held in higher regard than the life of men. This is why men take the most dangerous jobs and why men are primarily the ones who die in wars. Men are taught to be disposable and to prepare for the day that they're standing on their front doorstep, defending their family from the invaders. Women are only to enter combat when the man is incapacitated.   \n\n\nOf course, there are anomalies and life is relatively safe in many parts of the world so this view can be classified as archaic. Still, when push comes to shove many women will look at a man differently if he sees a mouse and screams before hopping on a chair. Many men won't think much of a woman doing the same. This is because men are disposable and are to be used to protect women and children from danger so if a mouse can ruin a man's nerve then that man likely won't do his job when an intruder comes into the home.",
            "title_similarity": "0.7201658",
            "sentiment_compound": -0.9738
        },
        {
            "id": "h6dhm3u",
            "score": 4,
            "text": "Sorry dude but women are more vulnerable in many ways and that makes crimes against them even more predatory and disgusting.\n\nEspecially regarding crime. Men rarely get raped, it's usually easier to rob a woman and generally women are the ones who get abused in intimate relationships. Those are all facts. \n\nI realize there's exceptions to all this and there's some bad ass women who would kick my ass and take what they want from me. But that's an exception not the rule.\n\nWomen are most often the ones who care for our children and are physically weaker giving men more responsibility to be protective if that's an option or even necessary. Obviously society has progressed to the point of daily animal attacks or other natural phenomena threatening us and are unlikely for most of humanity but it's still pretty built in to our biologies and we are not that far removed from apes in the grander scheme of things.\n\nThis is a pretty simple concept and as far as gender equality this is probably not the hill to die on.",
            "title_similarity": "0.7413213",
            "sentiment_compound": -0.8558
        },
        {
            "id": "h6d2d7w",
            "score": -2,
            "text": "There is this meme following a string of news stories it goes like this:\n\n>Florida MAN does something crazy!\n\nHow is it relevant that it's a man doing it? Why focus only on headlines with a specific gender?\n\nI think your new view should be that either no one mentions gender ever again except when it's inescapably necessary or that it's fundamental to our society and biology to mention it. \n\nI think it unfair that you focus only on women either way.\n\nAlso one choice leads to a life time of trying to change the way society speaks, the other choice is to just not be offended and enjoy your life.",
            "title_similarity": "0.7008598",
            "sentiment_compound": -0.2292
        },
        {
            "id": "h6ddtlz",
            "score": -2,
            "text": "I can’t buy that.\n\nNot when a crime CLEARLY ENOUGH happens more to women than men. Like rape.",
            "title_similarity": "0.6876045",
            "sentiment_compound": 0.4737
        },
        {
            "id": "h6d406q",
            "score": 13,
            "text": "Can you give an example where it was specifically pointed out that women were among the victims? \n\nI don't really remember ever hearing that in a newsstory.\n\nAlso when it comes to fiction, depiction doesn't mean endorsement.\nEspecially in dark comedies the most brutal people often have a \"code\" but that's usually used by the writer for comedic purposes to showcase the absurdity of it.",
            "title_similarity": "0.8010757",
            "sentiment_compound": 0.1789
        },
        {
            "id": "h6dird3",
            "score": 11,
            "text": "Women don’t usually commit the violence and women are usually the victims of sexual and viscous acts predicated by men. That’s why!",
            "title_similarity": "0.7205269",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h6d4jad",
            "score": 164,
            "text": "If you talk with your friends about personal safety, you’ll probably hear your women friends share way more stories than the men about situations when they felt physically unsafe or vulnerable. This doesn’t mean women are less “courageous” than men or any bs like that; it’s just a fact of women’s real, lived experience in society. If you are a man and you have empathy with the life experience of women, there is something particularly heinous about male criminals who terrorize women. I don’t think it’s any more complicated than that.",
            "title_similarity": "0.8251971",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h6d6ei4",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.052103803"
        },
        {
            "id": "h6d9b41",
            "score": 51,
            "text": "It doesnt make a tragedy worse, but it can highlight a larger societal issue with misogynistic violence to point it out. The same is true for minorities.",
            "title_similarity": "0.6844292",
            "sentiment_compound": 0.092
        },
        {
            "id": "h6daxnh",
            "score": -4,
            "text": "One thing I'll say is that regardless of sex, we don't tend to value the lives of people who don't value their own lives, and it happens to be that lots of guys derive their value from things other than themselves (like their occupation or dedicating their entire lives to live to some standard, sacrificing many parts of themselves along the way to achieve it even to disturbing lengths) & girls tend to value themselves more than things around them; as a consequence, we are less sad for men dying than women dying.\n\nIt's easy to love someone that loves themselves and easy to miss them terribly when they're gone, and vice versa, it is difficult to love someone that doesn't love themselves and difficult to miss them when they're gone. You **can** love & miss someone that didn't love or value themselves, but you have to do it completely on their behalf & at your own expense with no expectation that they will learn to love & value themselves just because you do, and if you want to do that, more power to you because YOU NEED IT if you want to shoulder that responsibility which is completely optional. It may sound cold to say, but it is actually neutral & there is nothing wrong with refusing that responsibility & leaving that apathetic person if you don't want to help them.\n\nAs far as things go for me, I will still find it easy to value those that value themselves & difficult to value those that don't value themselves, and if those that value themselves happen to be girls & those that don't happen to be guys, then I wont value guys as much as girls. It could be the other way around, but it's not right now. It's unfortunate, but yeah. :/",
            "title_similarity": "0.75349975",
            "sentiment_compound": 0.9234
        },
        {
            "id": "h6d9zj1",
            "score": 77,
            "text": "I think it’s the same reason why something is more tragic when a child is killed or hurt. They are helpless. And essentially couldn’t do much to help themselves, pretty vulnerable.\n\nNow, not to say women are helpless or anything, they’re definitely more capable than a child. But a lot of women are going to have a lot of trouble defending themselves from a man. It’s just an unfair fight. So it’s a lot more tragic to hear. \n\nIt’s very much a ‘pick on someone your own size’ situation. That’s why if a woman hurts another woman, the gender isn’t emphasised whereas when a man hurts a woman it’s a bigger deal because the guy most likely naturally overpowered her.",
            "title_similarity": "0.70438063",
            "sentiment_compound": -0.9828
        },
        {
            "id": "h6d9vhg",
            "score": 12,
            "text": "When a murder or crime has occurred and is being reported as a newsworthy crime there’s usually a lot of uncertainty on why someone was attacked. It could be gang violence, a drug deal gone wrong, retaliation for other violence, etc. We generally don’t sympathize with the victims as much in those instances. When a woman or child is the victim you can be much more certain that it wasn’t those things, and it’s a more genuine “tragedy”. This isn’t always the case, but it’s more of a certainty in the uncertain time immediately following a crime, which is why news reports use it.",
            "title_similarity": "0.771266",
            "sentiment_compound": -0.9655
        },
        {
            "id": "h6dcaaf",
            "score": 9,
            "text": "Women are more valuable than men for species propagation. A woman can only carry one child per year, and is physically vulnerable during pregnancy. A man could impregnate hundreds of women per year with no effect on his survival fitness. \n\nFor a small tribe of early humans, this calculation mattered for survival of the group. Should all male members die but 1, the group continues with children born of this surviving donor and the female members. Not great for genetic diversity, but good for group survival. If all the women died but one, with dozens of surviving males, you'd have a very small generation, putting the entire group's survival in peril. They'd hope for female offspring, but that's not guaranteed. This is further complicated by childhood diseases. Without modern medicine, a good portion of children die before 5, further reducing your breeding pool. So you may end up with a handful of female children able to reproduce.\n\nTake a group of 40M, 40F. With 1M, 40F, you will get replacement level fertility, perhaps even expansion. The next generation could produce 80 members in its next generation comfortably. If you have 40M, 1F, you may have 8 (if you're very, very lucky) in the next generation, 4 of whom would likely be female. \nYou've reduced the population of your group by 90% with this simple sex selection.\n\nThis is why \"women and children\". Children are biologically expensive and are an investment in group survivability. Women are more vital to group survivability than men and thus were selected for extra social protection. \n\nWomen and children as a protected social class stems from this deep biological drive. Of course its not really applicable in an overpopulated world of 8 billion, but I think a quick look around us illustrates how we are all still home sapiens at heart.",
            "title_similarity": "0.62334263",
            "sentiment_compound": 0.9626
        },
        {
            "id": "h6da8nf",
            "score": 106,
            "text": ">We shouldn’t be more sad or less because of the sex of the victims .\n\nSure, but this is not just about empathy for the victims, but about understanding the social impact of the violence. \n\nIf a lightning strikes a woman, or a man, I can equally mourn their loss as human beings. \n\nBut if a woman gets raped at murdered while jogging in Central Park, that basically contributes to the already existing perception that it is dangerous for women to even exist outside alone, that this is a men's world and they are just prey in it. \n\nWhen a man gets murdered, that overwhelmingly happens because he participated in gang violence. And when it isn't, when it's literally just a random middle-class white guy getting stabbed to death while jogging, that's an outlier that doesn't really connect to a societal fear that men already hold about jogging alone.",
            "title_similarity": "0.76753825",
            "sentiment_compound": -0.9973
        },
        {
            "id": "h6dc4y9",
            "score": 0,
            "text": "I get where you're coming from, and I might agree that we shouldn't distinguish between victims' genders, but I will try to explain some reasoning behind why we still do it (other than obvious cultural traditions from long ago). Women are less physically strong than men, and are therefore more vulnerable and helpless in the face of violent crime. You stated that you understand why children are named as victims: we see a tragedy as worse if it happens to someone who didn't have the power to stop it or evade it. Therefore, we can extend this logic to women as well, since while they are not as weak as children, they are weaker than males on average.",
            "title_similarity": "0.8381903",
            "sentiment_compound": -0.98
        },
        {
            "id": "h6di7i8",
            "score": 0,
            "text": "Since women are generally more vulnerable than men I'd say there should be a distinction. The tragedy is, as you say, just as big.",
            "title_similarity": "0.51173794",
            "sentiment_compound": -0.7645
        },
        {
            "id": "h6dwdv4",
            "score": 0,
            "text": "Because women in MANY countries and cultures are as helpless to their circumstances as children are. Just look at many Islamic countries to see how little protection women enjoy.",
            "title_similarity": "0.6119336",
            "sentiment_compound": -0.0164
        },
        {
            "id": "h6ekxyw",
            "score": 0,
            "text": "It matters for statistics and sociological reasons.",
            "title_similarity": "0.19488698",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h6elnso",
            "score": 0,
            "text": "Well women are far less capable of defending themselves. Albeit some women are perfectly capable of standing against a man, most are biologically weaker and are easier to victimize. If the man commits the crime, or a group of men commit the crime against women or children, then it shows the depraved nature of the criminal actors. It shows their cowardice  and invokes a sense of anger because it is such a horrid thing, to hurt something that is not properly equipped to fight you back.",
            "title_similarity": "0.7465057",
            "sentiment_compound": -0.9428
        },
        {
            "id": "h6euqrx",
            "score": 0,
            "text": "It does matter. When an incel goes on a murder rampage trying to kill as many women as possible the gender of the deceased does matter.",
            "title_similarity": "0.59924424",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h6f8bz2",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.052103803"
        },
        {
            "id": "h6fcy0v",
            "score": 0,
            "text": "What about children?? Why do they get a pass??",
            "title_similarity": "0.2700631",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fkmzl",
            "score": 0,
            "text": "I think it's an innocence thing. When you take into account men are more likely to commit crimes at a ratio of 9:1 (USA) and actually worldwide, cross culture. 90% of homicides worldwide are perpetrated by men, you start to see guys less as victims in general.\n\nAre all women victims/innocent? No.\nBut that's not what the reporting is about. It's intent is to illicit a response in people. Make them really feel for the victims. We tend to try to protect those we love and are responsible for. And to cater to the hetero male buying the media, that means family...women and children.",
            "title_similarity": "0.7267205",
            "sentiment_compound": 0.9046
        },
        {
            "id": "h6foevx",
            "score": 0,
            "text": "From a purely evolution perspective, mammal species reproduction is bound to how many women you have. You have 1 man and 100 woman you can have 100 babies. If you have 100 men and 1 women you can only have 1.\n\nThus the life of a woman is more valuable to a species ability to reproduce - the more a species can successfully reproduce the more likely it survives and hence this gets selected for. \n\nA lot of our psychology comes from millions of years of evolution hardwiring emotional responses, hence you could probably say that fact has a part to play in why the death of a woman plays off as worse.\n\nNow in a modern society where the things we care about have moved past ensuring basic survival on most living moments it shouldn’t really be more of a tragedy. \n\nBut this is the nature of being a human just because you can analytically understand something doesn’t mean it’s going to remove lizard brain emotions that were required to get us to where we are today.",
            "title_similarity": "0.5117011",
            "sentiment_compound": 0.4146
        },
        {
            "id": "h6fp49z",
            "score": 0,
            "text": "One explanatory reason for this is biological. Evolutionarily speaking, women (and all female mammals) are the limiting factor in reproduction. By that I mean a woman can only have one child once every 9 months, while in theory, a man could have as many children as he wanted in that time, provided there were enough women for him to impregnate. Therefore, for the species to propagate it was advantageous for women to be protected better and have men do the more dangerous jobs. That is also why in hunter-gatherer societies, men did the hunting and women the gathering and child rearing.\n\nNow this is just an objective reason why both men and women would care more about the safety (and death) of women, since if (a lot of) women get killed, their tribe would not be able to continue to exist. It explains why people's gut reaction is to be more concerned about women. It might not necessarily be fair, but you can't really blame people for something they don't have a lot of influence over.",
            "title_similarity": "0.65125006",
            "sentiment_compound": 0.4183
        },
        {
            "id": "h6fswkz",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.07758578"
        },
        {
            "id": "h6fzxzn",
            "score": 0,
            "text": "There's a quote (which I'll butcher) that basically says civilization is all about protecting women from the evils men inflict upon one another. \n\nIn our current culture, everyone is a man/woman/non-binary/spectrum person, so it's kind of silly talk about women as victims. Everyone (and no one) is a woman.\n\nBut historically, society was focused on protecting women as the weaker sex and for their reproductive capabilities. Without civility, most of history is just raping and pillaging. I mean, wars were sparked over one guy stealing another guy's woman. Check out the Trojan War or Braveheart.",
            "title_similarity": "0.7597286",
            "sentiment_compound": -0.9836
        },
        {
            "id": "h6g2vjc",
            "score": 0,
            "text": "Well, as long as you “give children a pass.”… I’m assuming you’re a man and that’s okay, and maybe I’m wrong, but don’t get mad at women for being mourned more than you because of some weird reverse fragility. The fact that you are on the cusp of, “Is children dying worse?” Makes me think that you need to stop thinking about yourself and dive in to some form of ideology that resembles empathy because you obviously don’t have that ability.",
            "title_similarity": "0.80012774",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h6g4jce",
            "score": 0,
            "text": "Yes, a tragedy is a tragedy regardless of who was harmed, but I think part of the reason it's mentioned is that it usually plays a role in why they were harmed. Both blatant and internalized misogyny is alive and thriving, and unfortunately, this means that women are targeted for simply being women. You could say the same for any marginalized or vulnerable group of people. That's why it seems \"more tragic\" when a child is harmed; because they are more vulnerable than other groups of people. For this reason, it could be seen, not as more sad, but as an added layer of heinousness when someone (anyone) is specifically targetted for simply existing as who they are ( race, gender, sexuality, etc... ) or harmed because they are part of a vulnerable population (children, the elderly, etc...). **No victim of a tragedy or violent crime deserves what happens to them, but some people are more vulnerable than others because of a history of discrimination and oppression that led to harmful social dynamics which still exist today.** Women are one of the groups of people who are more likely to be targeted, and children are unfortunately very vulnerable due to their age. So is it sadder if something tragic happens to a woman instead of a man, or a child instead of an adult? Not necessarily, and that concept might even be subjective altogether. But there is some sort of additional layer of tragedy that comes from the fact that women are sometimes targeted simply because they are a woman and children are sometimes targeted simply because they are children.",
            "title_similarity": "0.68633604",
            "sentiment_compound": -0.9967
        },
        {
            "id": "h6g57xg",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.052103803"
        },
        {
            "id": "h73shat",
            "score": 0,
            "text": "Why would you give children a pass? \n\nIf it’s by the logic they are young then by that logic it’s less of a tragedy when old people die.\n\nIf it’s by the logic they are “powerless” against the tragedy (eg picture a serial killer stabbing a child) then by that logic women are more powerless than man.",
            "title_similarity": "0.749099",
            "sentiment_compound": -0.9692
        },
        {
            "id": "h6d2yxo",
            "score": -1,
            "text": "How do you feel about men being mentioned?",
            "title_similarity": "0.282379",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6dmci0",
            "score": 1,
            "text": "It infantilizes women and I can’t stand it either",
            "title_similarity": "0.37075704",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6dngde",
            "score": -1,
            "text": "Some things are more evil than other evil things.  As dark as evil is, there are still gradations.\n\nMurder just isn't as evil as rape and murder.  Which isn't as evil as torture, rape, and murder.  Which isn't as evil as torture, rape, and murder *of a woman*, compared to a man.\n\nThese are uncomfortable distinctions to be sure and ones few are equipped to dwell on for any length without psychological repercussions.  \n\nBroadly speaking, women are weaker than man across every physical metric.  Women are asked to live side by side with men and place their safety in the trust of other men throughout their entire lives.  The violation of this trust, when they suffer violence (particularly from men) is *more evil* than the same violence to a man.  The obviousness of this is more clear when we acknowledge that violence to children is more evil, precisely because they lack the physical means to \"fight back\".\n\nOne could argue that the whole point of civilization is to nurture a society in which women are protected from the worst and most capriciously violent acts of men.\n\nEquating the violence that women suffer to that of men, in an effort to highlight that tragedies that can also befall men, is to forget these basic biologically driven ethics.  Tragedy can be bad for both sexes, but it is disingenuous and ethically immature to equate the two.",
            "title_similarity": "0.8005192",
            "sentiment_compound": -0.9939
        },
        {
            "id": "h6dochm",
            "score": 1,
            "text": "Same with children. You always hear \"the crash killed 15 people including 2 children \" so?",
            "title_similarity": "0.35909876",
            "sentiment_compound": -0.802
        },
        {
            "id": "h6dowm9",
            "score": 1,
            "text": "Women are on a lower level teir of physical capability than men meaning it is easier to prey on them.  The same way crimes against children, the mentally handicapped, or the physically disabled are dispicable because those people are unable to defend themselves properly.  The same thinking is applied to women.  Not saying women are childlike or mentally/physically disabled, just they cannot defend themselves as capibly.",
            "title_similarity": "0.7551923",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6e3c7w",
            "score": 1,
            "text": "Both are terrible but which is worse?  Your dad getting beat up and robbed or your mom getting beat up and robbed?",
            "title_similarity": "0.5140346",
            "sentiment_compound": -0.7622
        },
        {
            "id": "h6e7pwf",
            "score": -1,
            "text": "Men commit the vast majority of crimes, if men was a race white men would have already built a wall around you. 95% of violent crime is committed by men. Some are also men but they harm women also. Women don’t harm women, men harm men women and children. Look at all the history of mass shooters almost all male. Men also are bigger than women and you know they are physically stronger - they use that against women. #yesallmen",
            "title_similarity": "0.60302675",
            "sentiment_compound": -0.9371
        },
        {
            "id": "h6egjij",
            "score": 1,
            "text": "I'm not sure the reason, but this phenomenon seems to span for all of history where female lives matter more than men's lives, like how society will draft men to fight and die for wars instead of women. Although I heard (not based on facts) somewhere that past societies didn't want women to fight in wars, because when they got caught in a dangerous situation, then the men around her would grow protective and basically all die to protect her even though it may not be practical to in the situation. Thus it was impractical to draft women into armies at that time.\n\nIt also seems based on societal norms where men should protect their women, so it's more acceptable for men to take a hit / punishment and women should be unscathed; if the woman is hurt then it is a tragedy.\n\nOne other thing to consider is that men are generally larger and physically stronger than women counterparts, thus generally making men better capable to defend themselves. Since women are generally less physically strong, then our society considers them more delicate and injuring something delicate is also outrageous.",
            "title_similarity": "0.74169385",
            "sentiment_compound": -0.9789
        },
        {
            "id": "h6ey1y0",
            "score": -1,
            "text": "So then you do not know why the distinction is made. \n\nWomen are attacked for reasons due to their gender. These reasons need to be addressed in addition to the « main » charge, say murder. \n\nIt is heavily discussed and debated and reasoning would actually makes sense to you.\n\nAs an exemple, if women’s gender implies they’re weaker, can’t defend themselves, aren’t supposed to say no, owe you sex because you paid restaurant, and further reason to lead to the situation of violence, then yeah, distinguish you incorporate in your acknowledgement that the facts/reasons do re qualify the charges",
            "title_similarity": "0.6764034",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h6ezzgs",
            "score": -1,
            "text": "How many women are under abusive conservstorships in Hollywood vs men? How many men's actions far outweigh the risk factors of the women and yet they are left alone of their free will.. this is one of many reasons why distinctions need to be made. I rest my case.",
            "title_similarity": "0.67108315",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h6fdt3g",
            "score": -1,
            "text": "Women die and babies suffer, most fathers are absent.",
            "title_similarity": "0.39759108",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h6fgfok",
            "score": -1,
            "text": "Maybe and no. In a perfect world of equality/-no. But the way the world is inherently socially and physically stacked against women maybe it should be.",
            "title_similarity": "0.5985322",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h6fi7uz",
            "score": -1,
            "text": "Women are more valuable to society",
            "title_similarity": "0.3639034",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h6fmx8m",
            "score": 1,
            "text": "Does one of these headlines make you shake your head more whrn the gender of the victim is mentioned?\n\nHeadline: \"Person Murdered for Dishonoring Family\" Replaced by: \"Raped Woman Murdered By Own Family For 'Dishonoring' Family\"\n\nHeadline: \"Disobedient Child Killed by Parents\" Replaced by: \"Disobedient Woman Killed By Parents for Refusing To Marry Cousin\"\n\nHeadline: \"One Person Dead After Family Disapproves of Public Display of Affection\" Replaced by: \"Woman Killed By Family After Being Seen Kissing Man in Public\"\n\nHeadline: \"Man Murders Two Members of Own Family Over Suspected Infidelity\" Replaced by:\"Woman and Child Dead After Husband Kills Wife Over Suspected Infidelity\"\n\nAll over the developing world women are considered property of their male relatives, to be disposed of as those male relatives decide regardless of the wishes of the female involved. To universally remove mention of the murdered person's gender would mean people would not feel the same sense of outrage, and there wouldn't be as much activism around the issue of human rights, women's rights,  and  forced marriage as there is now.\n\nSo while yes, I would agree that one should be equally sad about every life that is lost,  there are certain situations in which the gender of the victim is important and must be mentioned.",
            "title_similarity": "0.5270971",
            "sentiment_compound": -0.9952
        },
        {
            "id": "h6fog5v",
            "score": -1,
            "text": "\"When you're colorblind, you don't see which color is disproportionately oppressed\" or something like that. It applies to gender as well. If you choose to ignore sex, race, religion, etc you won't notice that some of them get the short end.",
            "title_similarity": "0.7150825",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6fq6t5",
            "score": -1,
            "text": "I think the issue is that women are still a highly oppressed group, and targeting any person weaker than you (physically, socially ect) is especially heinous. It’s why we find racially motivated crimes to be worse than none- racially motivated crimes. You have targeted a woman because you perceive her to be less than yourself, when the world is already perceiving her that way. Insult to injury.",
            "title_similarity": "0.63848484",
            "sentiment_compound": -0.9322
        },
        {
            "id": "h6fu0vp",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.052103803"
        },
        {
            "id": "h6d5rye",
            "score": 14,
            "text": "All people equal. However most women aren't brought up to be tough. Men are without a scientific doubt overall physically stronger and bigger. So a female assaulted by a man is heinous. Strength and toughness alone isn't an indicator of worth, goes without saying but you know...reddit.\n\nMovies use the trope for suspense which can influence our feelings.\n\nTragedies are tragic regardless of the victims personal identifiers.",
            "title_similarity": "0.719629",
            "sentiment_compound": -0.8772
        },
        {
            "id": "h6daasg",
            "score": 8,
            "text": "Can you give examples of this happening? I think people usually act like a death is more tragic depending on the person's age and how and why it happened more than gender",
            "title_similarity": "0.60701364",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h6d815r",
            "score": 2,
            "text": "> Sometimes if you hear a tragedy being reported… you might hear that women and children were among the victims.\n\n>...but I don’t think it is relevant to know that women were also victims.\n\nWhat if it's relevant or unexpected, e.g. in unusual cases where people wouldn't expect that there were women involved? \n\nFor example, when there's an explosion at an oil rig, which (typically) only employs men, or some other accident at a men-only religious building. If there were women among the victims, it would now be an unexpected factor and therefore worth calling out separately.",
            "title_similarity": "0.77130497",
            "sentiment_compound": -0.9153
        },
        {
            "id": "h6dj8v2",
            "score": 2,
            "text": "It’s important to understand the role that women play in establishing a society.\n\nFirst the obvious...without women there is no new life.\n\nNow the less obvious and requires an acceptance of biological differences... Men are predisposed to physical labor and the hardships that come with it. Including competitiveness whether in the form of war or merely reproductive preference. But women civilize men! In a world of only men we would be an animal species where the strongest one rules. But thanks to the more humanitarian and emotional nature (and demands) of women, men need to improve their civility to be able to continuously appease the interests of women which happen to be the reproductive force of our species.\n\nSo in essence, we have a built-in need to value and protect women more than men. Is this taught behavior? In part, yes. But even if it wasn’t taught it would be an imperative biological necessity.\n\nIn essence, imagine a society where 90% of women were killed off and mostly men existed. The rebuilding of that society would both be brutal and require countless generations. But imagine a world where 90% of men were killed off. The rebuilding of the community would be relatively predictable and while material development would be slower, it would quickly increase over few generations as new boys were born.",
            "title_similarity": "0.6485598",
            "sentiment_compound": 0.8476
        },
        {
            "id": "h6e9vf7",
            "score": -2,
            "text": "The day a man becomes pregnant from being raped will be the day your point will have some standing.\n\nAlso, why are you giving children a pass and does it not apply to women?",
            "title_similarity": "0.689343",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6enoe9",
            "score": -2,
            "text": "Worth noting that most people who commit acts of violence that result in tragedy are men- so a lot of the time you might be talking about a man, specifically, committing acts of violence against women & children, which I feel is relevant. \n\nThis obviously wouldn’t apply to natural disasters. Except in the sense that generally, men have made the decisions that have led to climate change being a thing that causes a lot of natural disasters.\n\nI’d argue that sometimes it’s noteworthy and sometimes it’s not.",
            "title_similarity": "0.7340041",
            "sentiment_compound": -0.9386
        },
        {
            "id": "h6f01qi",
            "score": -2,
            "text": "How do you react to the fact that 90% of rapists are men?",
            "title_similarity": "0.32718706",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h6ff6ei",
            "score": -2,
            "text": "Women are targeted because they are women. That's why a distinction is made.",
            "title_similarity": "0.40418446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fsh3t",
            "score": 2,
            "text": "In the USA, men are considered disposable and replaceable.  USA suffers from widespread misandry.",
            "title_similarity": "0.48576427",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6fxj2n",
            "score": -2,
            "text": "I think this is a lot like the counter-argument to Black Lives Matter. “Don’t all lives matter?” Yes, they definitely do. But white people are targeted statistically less than African Americans and that deserves acknowledgement and awareness that it’s an issue. Similarly, women are targeted considerably more frequently than men, and it needs to be called out.\n\nEdit: left out a word",
            "title_similarity": "0.62312376",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6fye8g",
            "score": -2,
            "text": "It strongly relates to the reason women are statistically not safe when alone or at night.",
            "title_similarity": "0.49813595",
            "sentiment_compound": 0.1114
        },
        {
            "id": "h6d4hl4",
            "score": 31,
            "text": "It seems like this view is egalitarian idealism:  If we really want men and women to be equal, then part of that is treating situations where men and women are victims equally.  And, in practice, women as victims still get a bigger reaction.\n\nThe thing is, in practice, men and women have it different on account of gender.  So, even for people who aspire to egalitarianism, it can make sense to treat men and women differently based on gender.   A good example of that might be gender discrimination in hiring, pay, and promotions.   In that case, discriminating against women isn't just a crime against those women individually, but it's also pushing against a social agenda of egalitarianism.\n\nNow, I'm guessing that you had something more like machismo in mind when you were talking about \"women and children,\" as victims.  The thing is, different people have different ideas about how society should work, and different ideas about what practical differences between men and women are.",
            "title_similarity": "0.68808293",
            "sentiment_compound": 0.706
        },
        {
            "id": "h6dd9mc",
            "score": 4,
            "text": "People usually highlight gender because the motivations behind their killing CAN make the crime worse. For example, if there is a male serial killer that only targets women it may be due to misogyny, but if he kills indiscriminately that would be a bit different. It’s important to recognize these things. Both crimes are absolutely bad, but the motivations (like sexism) can make them seem worse.",
            "title_similarity": "0.7404759",
            "sentiment_compound": -0.9558
        },
        {
            "id": "h6ddroc",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.052103803"
        },
        {
            "id": "h6dtvk9",
            "score": -3,
            "text": "I'm pro choice and I know women have successfully been taken out of the equation of reproduction but have a little more respect for the ones that bore you(bore? Carried you in their womb)",
            "title_similarity": "0.6656519",
            "sentiment_compound": 0.582
        },
        {
            "id": "h6fsh41",
            "score": -2,
            "text": "Sad you are so filled with grievance",
            "title_similarity": "0.22475448",
            "sentiment_compound": -0.7553
        },
        {
            "id": "h6d44mz",
            "score": 560,
            "text": "Part of this has to do with the traditional power dynamics.  If the crime in particular is physical in nature for example someone is beat to death.  It’s seen as particularly despicable if someone physically much stronger attacks someone weaker.  So a full grown man beating a child or woman is seen as more despicable and cowardly than beating up another man.\n\nNow technically there could be power disparities between men.  After all a big 6’4” 250 lb linebacker beating up a 5’4” 130 lb man might be looked at as shameful too.  But generally “man vs man” is seen as a “fair fight” at least and conflicts between men have always been viewed differently as a result.\n\nOf course all this assumes that an adult male is the perpetrator, which statistically is the most likely.",
            "title_similarity": "0.622234",
            "sentiment_compound": -0.9637
        },
        {
            "id": "h6d2n3o",
            "score": -6,
            "text": "Everything is cultural, some cultures kill unwanted children and see nothing wrong with that. Our cultures has decided that woman and children have “more value” than men. There’s nothing right or wrong about it, it’s just a cultural norm that our culture has decided to follow. If you disagree with it that’s fine but you’re in the minority.",
            "title_similarity": "0.8130225",
            "sentiment_compound": -0.2837
        },
        {
            "id": "h6dmkkv",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.07758578"
        },
        {
            "id": "h6d36xk",
            "score": 1082,
            "text": "In the modern world I agree, but you include works of fiction and in many historical or fantasy fiction settings it makes sense. If you go back a few thousands years there were plenty of cultures that were militaristic enough that a significant portion of the male population would die in battle. (This is part of the reason many ancient cultures allowed polygamy.) This is definitely true of many fantasy settings as well. Since that is the norm, some amount of male deaths basically becomes \"acceptable losses.\" You don't expect all your male friends and your brothers to come back from each raid, so you have already prepared yourself for their death. In this context, it makes total sense that people would focus on the unexpected deaths of women and children rather than the accepted and socially acceptable deaths of men.",
            "title_similarity": "0.6773167",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h6d9u6s",
            "score": 272,
            "text": "Demographics of the victims sometimes gives context to the crimes. For example, the guy who shot up massage parlors in Georgia earlier this year. He was specifically going after asian women, so it is relevant for the news to report that.",
            "title_similarity": "0.5592395",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6ddbno",
            "score": 22,
            "text": "I would tend to agree with if we actually lived in an egalitarian world in which all genders were equal not just in theory but in practice too. As it is though, the vast majority of the earth and even the US does not have gender equality. People raise girls differently than boys—and that means it’s not very common at all to teach girls self defense or encourage them to lift weights. Women could be a lot stronger and better able to defend themselves if they we raised differently but instead what do we have? A bunch of cultural mores that tell girls and women that having bigger muscles is masculine and therefore unattractive. or that being too athletic is masculine.  \nWe could be raising boys with a lot less emphasis on their physical strength as well.   \n\nAnyhow, we live in a world that is very far from An equalitarian ideal. Women are not equal by law in most countries on earth. And in the countries that they are equal culture has not caught up and so girls are raised in an unequal way. It’s almost like girls and boys are raised to encourage the worst attributes of their genders.",
            "title_similarity": "0.68252575",
            "sentiment_compound": 0.9657
        },
        {
            "id": "h6ddc7z",
            "score": 91,
            "text": "Another perspective which hasn't already been written in the comments is that if we don't mention gender, people will default to the victim being male or female depending on the crime. If it was a gang murder, people will assume the victim was a man. If it was a domestic violence murder, people will assume the victim was a woman. These don't help in breaking stigmas and we may even make our own assumptions and stereotypes about how the crime happened.\n\nAlso, revealing information about the victim helps to personify and humanise the victim rather than just turning them into a statistic. If you hear about a murder on the news, they will almost always show a picture of the victim and reveal some information about them out of respect.\n\nIn fiction writers usually mention that the victim was a woman because of power imbalances. The hard truth is that most women are at the mercy of men's benevolence. If they are assaulted they have little to no way of defending themselves, whereas even a weak man would at least put up a fight (by the way I am not victim blaming, just pointing out that it takes more effort to kidnap a man than a woman so they are less likely to worry about going out along etc). This means the reader can make judgements on the character. If the murderer exclusively murders women, men, children, ethnic minorities, or murders anyone, it reveals some information about the murderer's motivations and personality. \n\nIt's the same logic as why punching a random person is bad, but punching a person in a wheelchair, or a little child is particularly bad. It's about the imbalance of power and \"picking on someone your own size\".",
            "title_similarity": "0.8538649",
            "sentiment_compound": -0.9866
        },
        {
            "id": "h6d8yl4",
            "score": 1,
            "text": "In terms of catching criminals, knowing who they target can give information to their capture.",
            "title_similarity": "0.466542",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h6daan7",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.07758578"
        },
        {
            "id": "h6dax8x",
            "score": 1,
            "text": "I think it comes from the fact that historically men would fight in wars, women and young children tended not to. So a modern translation of \"women and children\" would be \"civilians targeted and killed.",
            "title_similarity": "0.7585435",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h6ddsrx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052103803"
        },
        {
            "id": "h6degok",
            "score": 1,
            "text": "I'd say it's temporarily better because there is a percentage of people that think that a woman's life is worth less. \n\nSince increasing the penalty help more and more people understand that a woman is also worth, it's temporarily good.",
            "title_similarity": "0.6091913",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h6deigy",
            "score": 4,
            "text": "i agrée that it may not make it more tragic, but i think it still remains a good way to show the true brutality of a crime. due to societal rules going back centuries, people, overall, have a *thing* about how men CAN. NOT. lay hands on a woman. it’s built into us, and makes any violent crime seem more horrible. it’s not more tragic, but i feel that, quite honestly, it takes a lot more brutality for most people to injure a woman than a man, therefore upping the brutality. \n\naccidents are a COMPLETELY different story, but i still see where it comes from, though i don’t agree with it being used now. basically, men overall did a lot of shit that had a really high risk of dying. that was just accepted; your husband was probably gonna die in a tragic accident. war, factories, mining, you name it. in many cases, men had to risk their life for their family to survive. in basic terms, men died all the time. that was seen as normal and fine, probably up even through WWII, if not further. but women did not die: women were not supposed to die. so when one did, it was seen as far more tragic than the loss of a man’s life, since it was already risked every day. \n\nthis social dynamic of women staying home safe and men supporting them at very high risk is one that doesn’t really exist anymore. there are less dangerous jobs, and women are doing them. but even though circumstances have changed, the societal mindset hasn’t. changing the societal mindset is ridiculously difficult, even when part of it is based in nothing.",
            "title_similarity": "0.81357586",
            "sentiment_compound": -0.9962
        },
        {
            "id": "h6dejxc",
            "score": 1,
            "text": "Logically yes, there’s no difference, but humans are made mostly of emotions, and can only occasionally access logic as a tool for problem solving, so specifying women will always feel the way it does to tons of people. Not because it’s logically different, but because it feels different to human (meaning emotional) beings.",
            "title_similarity": "0.7239127",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h6df88k",
            "score": 1,
            "text": "To explain the reason that it is this way, traditionally due to old-fashioned gender roles, women are viewed as weak the same as children, and unable to defend themselves. Today we know better and that women are as capable and grown as men are.",
            "title_similarity": "0.6223158",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h6dfpd7",
            "score": 2,
            "text": "Would Jack have survived if Rose had shared the door?",
            "title_similarity": "0.42263865",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h6dg8ux",
            "score": 7,
            "text": "It gets people to click.  It doesn't need to be relevant.",
            "title_similarity": "0.47499567",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6dgyyt",
            "score": 10,
            "text": ">I’ll give children a pass… but \n\nBut why? Because I think understanding this part fully will lead to understanding the bigger picture. Whatever reason it is that makes you feel like children deserve special treatment for being children is probably the exact same reason some people give for women getting the same.\n\nAnd even if nearly every single person agreed with you, the headlines would still do it. Why? Because mentioning women isn't going to make you *less* likely to click through, but it will work to catch some of those few who do care more. That means mentioning children if children are involved, women if women are involved, and race if the perp and victim fit the narrative that news outlet thinks its viewers will be most enraged by.\n\nAnd that, unfortunately, is the purpose headlines serve. Not to accurately represent the correct amount of tragedy in a given situation. It's to get views.",
            "title_similarity": "0.7478678",
            "sentiment_compound": 0.1332
        },
        {
            "id": "h6dhwhs",
            "score": 5,
            "text": "I agree, it’s dated and sexist.\n\nMad Max: Fury road was such a weird movie to me, because of them having female characters just die without it being some plot device. Also, that Furiosa is so obviously the protagonist.  It took me weeks to figure out why that movie stuck out in my head.  It just felt… different.\n\nIf you kill women, it’s at the very least intended to drive home a little more emotion. George Miller, that beautiful feminist, broke the mold",
            "title_similarity": "0.6689617",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h6dmg4f",
            "score": 8,
            "text": "For most of human history, women, being objectively physically weaker and particularly vulnerable while child-rearing, needed men to protect them. Not just their husbands, but much of society oriented to protecting women from the predatory men among them.\n\nAs a cultural holdover, women dying is a societal and cultural failing, and we \"make note\" of it because we are all accountable by societal convention. When a man dies it is subconsciously assumed that they had more of a choice in the risky endeavor. For women going to the shop can be risky behavior.\n\nNot arguing that this is \"right,\" just that women's safety depends on societal cohesion more than men's does.",
            "title_similarity": "0.7816278",
            "sentiment_compound": -0.3972
        },
        {
            "id": "h6dmue7",
            "score": 1,
            "text": "Its all biology...",
            "title_similarity": "0.10486754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6drjrm",
            "score": 1,
            "text": "It's a holdover from when men felt it was masculine to protect women who are generally smaller and not as strong now a lot of them just whine to be equal to us and be included in tragedy reporting..good thing we don't need you anymore....and I'm well aware my name is Karen no need to point it out in a weak response...everyone",
            "title_similarity": "0.8067832",
            "sentiment_compound": -0.8751
        },
        {
            "id": "h6ds67i",
            "score": 2,
            "text": "I think it depends. More women are killed because they are women than men are because of their gender. Murder and deaths following abuse, that kind of thing. In those cases it should be mentioned, I think. Just like with any hate crime.\nHowever I do agree, not Killing/fighting women in fiction suggests that the \"hero\" thinks it wouldn't be fair since he's obviously so much biggerbetterstronger than them and men could at least aspire to being a match to him.",
            "title_similarity": "0.72599405",
            "sentiment_compound": -0.9453
        },
        {
            "id": "h6dsfim",
            "score": 1,
            "text": "It shouldn't make it more tragic, but in reality it does. And I say that as a man, for whatever reason our deaths aren't as sad.",
            "title_similarity": "0.6391151",
            "sentiment_compound": 0.2925
        },
        {
            "id": "h6dsuuc",
            "score": 2,
            "text": "This reaction actually stems from human biology. In evolutionary terms, women are more valuable to society due to their ability to bear children. If a tribe goes to war and half of the male population is decimated, the overall population can still be rebuilt. If the same were to happen to female population, the future of the tribe would be severely compromised. Because of this, historically males would be the ones sent off to war, while women and children were to be protected at all cost. This response is so hard wired in the human brain, that to this day we experience deaths of women and children as more tragic than the deaths of men.",
            "title_similarity": "0.66895056",
            "sentiment_compound": -0.8109
        },
        {
            "id": "h6dvcc8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052103803"
        },
        {
            "id": "h6dwv0n",
            "score": 2,
            "text": "Man have always been considered exposable compared to women. In modern times where things are more \"equal\" its shouldn't still be the case but male issues dont get addressed so we're going to be the disposable ones for a while longer.",
            "title_similarity": "0.70608354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6dxbww",
            "score": 1,
            "text": "We are a hundred years from gender not influencing court.",
            "title_similarity": "0.4019992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6dxjto",
            "score": 1,
            "text": "In society men are expendable.",
            "title_similarity": "0.36315903",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6dya8r",
            "score": 3,
            "text": "I like to keep in mind, when hearing about a female victim, “was she targeted BECAUSE she’s a woman?” or “did this victim just happen to be a woman”\n\neg. Someone shoots up a women’s bathroom as some sexist incel crime vs. someone shoots up a grocery store and most of the victims happen to be women. \nOne scenario was a hate based crime and one maybe was purely gun violence \n\nAlso, more men are victims of murder for a similar reason that most men are murderers. It’s not a statistic based on sexism, but rather a possible result of the patriarchal expectation for men to suppress and instead be tough, confrontational or sometimes violent.",
            "title_similarity": "0.6889938",
            "sentiment_compound": -0.981
        },
        {
            "id": "h6dzcgm",
            "score": 1,
            "text": "I agree that it doesn't make the tragedy individually worse, but it makes a statement about systematic issues. Each additional tragedy, despite continued media exposure and calls to address it, is worse than other tragedies in light of this.",
            "title_similarity": "0.7089987",
            "sentiment_compound": -0.9342
        },
        {
            "id": "h6e3v09",
            "score": 1,
            "text": "Get over your feelings. Words have actual meaning so they are used accordingly.",
            "title_similarity": "0.3447608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6e5aid",
            "score": 1,
            "text": "By all laws, in most countries, there is no distinction.",
            "title_similarity": "0.30353457",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6e6bkg",
            "score": 2,
            "text": "Agreed. It diminishes men's suffering and it infantilizes women.",
            "title_similarity": "0.50208646",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6e7h51",
            "score": 2,
            "text": "Yeah I too do not get why that is the case.\nTo me hearing that a man brutally murdered another man V/S a man brutally murdered another woman sound equally bad.\nAlthough I don't see why it should not be specified. It gives us more info regarding the incident. Wouldn't you like the exact details of the crime? \nAlthough I agree that we shouldn't feel more empathy if it were a man or woman, and a criminal isn't more of a criminal If he does that exact same thing to a man vs a woman.",
            "title_similarity": "0.80115914",
            "sentiment_compound": -0.9838
        },
        {
            "id": "h6e9smb",
            "score": 2,
            "text": "I mean... technically? Sure it’s no worse... but if a dude is willing to commit a violent act against a female then it can be assumed that he is a little disconnected from the general beliefs of the society in which he lives, you know? The crime itself is no worse, but it would be worth considering during sentencing. A dude who gets into a verbal altercation and then beats another dude to death versus a dude who gets into a verbal altercation and then beats a woman to death may have committed the same crime, but the aggravating factor of it being a victim of presumably lesser strength is worth considering. \n\nI thought about bringing up things such as “like force” but I think what I said was clear enough. I think if you take into consideration the idea of the victim being a child you see how the victim can affect the heinous nature of the crime. It can also be different if the victim is a woman.",
            "title_similarity": "0.76265347",
            "sentiment_compound": -0.9784
        },
        {
            "id": "h6e9x9x",
            "score": 1,
            "text": "It's a hold over from old society.  Women were considered much more valuable than men.",
            "title_similarity": "0.46007994",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h6eeciq",
            "score": 1,
            "text": "I disagree. \n\nThe main reason is that no matter how hard societies today want to pretend that reality conforms to social constructs, it does not. \n\nMen and women are different. They have been since the dawn of man. What this means is that men and women cannot be treated the same, because they are not, and certain things must be taken into consideration when regarding male and female victims of a crime. \n\nFor example, sexual assaults and rape are a problem in some professions/areas of the country and since women in general are the objects of sexual desire you need to be more cautious about others making passes at them, grooming them, or offering job positions in exchange for sexual favors. Hollywood had a huge problem with this and many former A list actors and actresses, or others who were involved with the business, have told their stories and experiences. The casting couch was apparently a very real thing and I don't think it has stopped. \n\nNot to mention the women's role in regards to the species. Specifically younger women, who are what continue our society by giving birth to the next generation. They hold more value to society than young men do, that's why historically young men going off to die in large numbers were acceptable but women dying were not. This still rings true today, although not as much as it once did. \n\nI agree that a tragedy is a tragedy no matter who. But I can tell you that when a woman is assaulted in a violent crime or brutally raped, it is almost instinctual to want to protect and avenge them that much more because of the value that women should have in our society. \n\nNow this perspective is one that looks at people as a whole, not the individual. Individually yes, the impact of the loss of someone is more tremendous the closer you were to that person regardless of their sex. This is because you knew them as an individual and grew to love their personality. \n\nTLDR: as a whole, men and women are equal but have different societal value. I know, that sounds paradoxical. But given the fact that women, young women especially, have more value when they are the victims of a crime it is more impactful to the community and a greater cause for justice/vengeance.",
            "title_similarity": "0.7722",
            "sentiment_compound": -0.9844
        },
        {
            "id": "h6ejasm",
            "score": 2,
            "text": "I agree! As well as “black this” “white this”. It only stirs the pot for no reason. A tragedy is a tragedy.",
            "title_similarity": "0.58812773",
            "sentiment_compound": -0.8268
        },
        {
            "id": "h6elqse",
            "score": 1,
            "text": "not worse. but different",
            "title_similarity": "0.14620042",
            "sentiment_compound": 0.1967
        },
        {
            "id": "h6em11f",
            "score": 1,
            "text": "Women and children are the weaker subsets of humanity and should be protected, which is why it’s worse when they are targeted.",
            "title_similarity": "0.6582284",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6eprh0",
            "score": 1,
            "text": "You have to identify if the crime was because she was a woman, that is the importance of it",
            "title_similarity": "0.58927894",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6er8c8",
            "score": 2,
            "text": "Think about it this way: if you lived in a hunter gatherer society, and you had to choose between killing 50% of the men or 50% of the women. It’s actually pretty obvious that You would kill off the men because you could still birth the same number of children with half the number of men. Hell, a tenth the number of men.\n\nI think that logic followed an evolutionary pattern, where the (hunter gatherer) societies that were more willing to sacrifice men were more more likely to survive long term, and therefore, more of them reproduced. Making us hardwired by evolution to value the lives of women more than men. \n\nSo, while you might not like it, I think it will be on an evolutionary timescale before we begin to change the way we value the differing lives of men and women.",
            "title_similarity": "0.5481479",
            "sentiment_compound": -0.8364
        },
        {
            "id": "h6ew8p0",
            "score": 1,
            "text": "They used to say women and children first because women bear children and children have their whole lives ahead of them",
            "title_similarity": "0.3754557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6eyanu",
            "score": 1,
            "text": "Honestly with children it just shows it’s more tragic because they’re well children and so young. I agree sex shouldn’t matter but I think it comes from history where women and children were seen more so as commodities or property depending on the culture.  \n\n\n\nI think also the anti hero/ “bad” guy thing comes from the idea that men hurting women is sexual or sexually motivated. A man hurting a woman is often associated with sex crimes unfortunately. \n\n\n\nLastly I think it was primarily used to distinguish battle loses or war loses to civilian casualties since the military used to be all male/mostly male. The loss of women and children would indicate a civilian area was targeted.",
            "title_similarity": "0.7933593",
            "sentiment_compound": -0.9613
        },
        {
            "id": "h6ez0cf",
            "score": 1,
            "text": "Tragedy is equally as bad for all genders. The reason for saying it's against a specific group is to see if there is a trend and if there is a trend to anticipate the violence and to try to stop it from occurring.",
            "title_similarity": "0.6938339",
            "sentiment_compound": -0.9349
        },
        {
            "id": "h6f00gb",
            "score": 1,
            "text": "I mean most women are smaller and weaker then men and in most cases the perpetrator is a male.  How could you not feel for a women whos last moment was being physically dominated by a man, who at that point can do what ever he wants with her.  This situation but with the gender reversed is rare and is why people are disgusted when women are VICTIMS.",
            "title_similarity": "0.6562592",
            "sentiment_compound": -0.9158
        },
        {
            "id": "h6f03ef",
            "score": 1,
            "text": "I don’t know... I think men are generally stronger then women so when a man beats the crap out of a woman it seems worse than if a man beats the crap out of another man.",
            "title_similarity": "0.54465836",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h6f0mbm",
            "score": 1,
            "text": "Children make less sense than adults though.",
            "title_similarity": "0.3124938",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6f4lt9",
            "score": 1,
            "text": "It does when I’m choosing an episode of forensic files",
            "title_similarity": "0.28317198",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6f5o1d",
            "score": 1,
            "text": "There is a hierarchy of value we attribute to people based on thier sex, age and vitality. This can be seen in cases of assault towards different demographics of people. The order of value from highest to lowest is elderly, disabled, children, women, men.\n\nWe will focus on the more valued group's needs and problems to the detriment of the greater good simply because we don't value the needs of all the groups equally. It's funny because each group has its own way of saying \"these people over here need our help!\", despite the fact thier group by numbers would be more affected.",
            "title_similarity": "0.639713",
            "sentiment_compound": 0.8204
        },
        {
            "id": "h6f6ryx",
            "score": 2,
            "text": "I think people will have a tough time changing your view here. Like, we live in a culture where people sincerely believe rape is worse than murder and sentences to women for the same crimes are a thrid that of those given to men. Not to downplay rape, at all, it's horrible and heinous, but society feels a responsibility to see women as helpless victims. Look at something like breast cancer. Nearly double the funds are raised for it every year than prostrate cancer despite relatively the same number of cases (there's a little more breast cancer). There's more raised for Breast Cancer than Lung cancer adn Colorectal cancer combined.",
            "title_similarity": "0.72565544",
            "sentiment_compound": -0.9942
        },
        {
            "id": "h6f85m6",
            "score": 1,
            "text": "A tragedy is a tragedy nonetheless",
            "title_similarity": "0.30415496",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h6f93vl",
            "score": 1,
            "text": "I think that sometimes analyzing the gender (or race, but your post is about gender) in crimes or tragedies is necessary because we can identify trends and stuff. But I agree with you on the whole \"the women and children\" thing when we're talking about mass tragedy that no one had control over like a natural disaster. I hope this makes sense.",
            "title_similarity": "0.79657644",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h6faiu7",
            "score": 3,
            "text": "And yet Femanists still believe that we live in a Patriarchy.",
            "title_similarity": "0.32275587",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fcixl",
            "score": 1,
            "text": "You’re right",
            "title_similarity": "-0.013799542",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fd09p",
            "score": 1,
            "text": "I think it's more to do with the fact that women are more vulnerable (traditionally speaking). \n\nLike women who get taken advantage of. Exploitation of vulnerable people is just another layer of crime. \n\nVulnerable people are less likely to seek or receive help, so it is the job of justice to make sure they are 'avenged'",
            "title_similarity": "0.71687376",
            "sentiment_compound": 0.5279
        },
        {
            "id": "h6fdl33",
            "score": 1,
            "text": "I've always thought the same thing when they mention how many victims come from your country in an international incident. Like why should it matter?",
            "title_similarity": "0.505448",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6febsx",
            "score": 2,
            "text": "Can we also stop referring to them as “mother, wife or daughters “?  They are people just like men. It’s tragic when any person dies.",
            "title_similarity": "0.5912673",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6fgeti",
            "score": 1,
            "text": "Because women are physically weaker than men I think there should be a distinction. Like it a man committed a crime against a women he took advantage of his biology, which makes it worse.",
            "title_similarity": "0.65531707",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h6fixmx",
            "score": 2,
            "text": "Not going to try to change that view.  it's disgusting that somehow it only matters if a victim is a woman, or if you care more if it's a person from your country or religion or whatever.",
            "title_similarity": "0.7261093",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6fj040",
            "score": 1,
            "text": "r/MensRights",
            "title_similarity": "0.087195136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fnt0x",
            "score": 1,
            "text": "I only times the use woman and children are in war zone conflicts. Im guessing this is because women are less likely to be on the front line and more likely to be citizen casualties.",
            "title_similarity": "0.64418757",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h6fo11w",
            "score": 1,
            "text": "You don’t hear this unless it’s during times of actual conflict, like Palestine and Israel, and even then they’re only metaphorical for innocent civilians",
            "title_similarity": "0.654475",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h6fqvig",
            "score": 1,
            "text": "Our beliefs in life are that women and children are these fragile little cute things (they are usally cute and fragile let’s be honest) but men were evolved to protect women and children from lions and tigers and other men. So it’s kind of like a reader using a different word of txt to portray a stronger idea. What sounds worse, 5 people were killed or 3 women and 2 children were killed. We have evolved to take those into account as such a more worse case because women and children 95% can’t fight back against really anything. No trying to be sexist or anything but unfortunately most men are stronger than women and usally why rape happens in women than men( and a lot of men are just a holes) \n\nTLDR; women and children are used as a type of grammar to portray stronger emotions twards things due to evolutionary reasons.",
            "title_similarity": "0.7622599",
            "sentiment_compound": -0.967
        },
        {
            "id": "h6fvwhl",
            "score": 2,
            "text": "Thing is, women are taking over. So soon we will be able to have people feel bad for us",
            "title_similarity": "0.47049674",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6fy8iu",
            "score": 1,
            "text": "Isn't a lot of this just because language is very gendered?\n\nI don't know about a movie hero moral code, but in terms of a news headline, I feel like \"two women, (23 and 24) die in robbery gone wrong\" just reads a lot more naturally then \"two people...\" \n\nAnd the first is technically more informative, even if the fact that they were women has no real bearing on the story other then alleviating any fears about men you know in their early twenties",
            "title_similarity": "0.77629614",
            "sentiment_compound": -0.9091
        },
        {
            "id": "h6g0fuz",
            "score": 1,
            "text": "I definitely think at this point it's an outdated holdover. Other commenters have given good historical explanations so I'm going to give a slightly older origin.\n\nIf you go back to the early Middle Ages in Western Europe, you see various groups, notably the Church and some kings, trying to curb some of the worst aspects of war and violence. The feudal system makes for a fair bit of minor warfare and raiding. Also, feudal lords and professional soldiers had a lot of power and a fair bit of freedom so abuses are just waiting to happen. Ending these problems entirely didn't look feasible, but limiting their impact on everyday life, ending the worst abuses and generally easing things in a more humane direction was a priority.\n\nThus we have various codes of chivalry, ie the medieval Geneva convention.\n\nReducing the impact of war on civilians was important. However, with professional soldiers such as knights and mercenaries being rare, the bulk of armies were made up of levies. Basically, local men of some lord's domain pulled from the fields, given basic equipment and expected to fight. So the civilian/combattant distinction can get a little messy. However, women and children were never pulled as levies so they were guaranteed to be civilians. So you can have a blanket rule about not messing with them.\n\nYou want to reduce the abuse of power by feudal lords and knights. So you want an idea of not picking on the weak. Again, who counts as weak? It can get messy. Well, at least you can make a blanket rule against picking on kids. \n\nThe emphasis on protecting women came as a reaction to some really nasty practices of the time. Many groups used rape as a weapon of war. It's psychologically devastating. Also, feudal lords and knights felt they had a right to just carry off any woman they wanted and force her to be their concubine. Basically kidnap, imprisonment and ongoing rape. Reducing the amount of casual rape was a priority so the \"Don't mess with women!\" PSA was kinda hammered home. And it needed to be constantly re-emphasised, hence all the little niceties to keep it constantly top of mind. Thankfully, it did kinda stick.\n\nAnyway, the propaganda for chivalry was extensive. It was promoted by Kings and the Church. Early on, some excommunications were given out. In one notable case to an Anglo Saxon king who abducted and raped a nun. Extensive stories were told, such as the various tales of King Arthur. As feudal lords transitioned into aristocracy under strong kings, they kept this tradition of chivalry and adapted it. As standing armies began to form, officers were pulled from the aristocracy and kept the traditions. That kept going even as the officer corps became more democratic.\n\nA general adherence to the now rather garbled code of chivalry became the mark of the \"civilized\" man. Special treatment for women and children was part of that. So while the modern laws of war recognize that women can be combattants and men can be civilians, \"women and children\" remains a catchphrase in popular culture. When a man kills or harms other men, he can at least still be considered \"civilized\". But if he attacks women and children, he's automatically considered some kind of monster.\n\nSocial attitudes definitely need to be adjusted in light of recent changes in gender dynamics. That said, I can only hope the Geneva conventions capture the public imagination as much as chivalry did.",
            "title_similarity": "0.7179038",
            "sentiment_compound": -0.998
        },
        {
            "id": "h6g22ew",
            "score": 1,
            "text": "Men are physically stronger in some sense then women and if the female was attacked then she is a victim. Basically anyone that was assaulted harrassed touched etc is a victum of a tragedy. Idk depends on the situation cause a man can be a victim too if he was hit. No one gets a pass till their attacked or in someway effected negatively",
            "title_similarity": "0.7120155",
            "sentiment_compound": -0.9517
        },
        {
            "id": "h6g43pk",
            "score": 2,
            "text": "From an end of the world only 100 humans left point of view for repopulation you'd want like 75%+ of them to be women otherwise I agree with you it's bs.",
            "title_similarity": "0.3823722",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6g7nvd",
            "score": 1,
            "text": "the distinction (in fiction, typically medieval/fantasy/war) is that women are assumed as helpless and defenceless as children. While women are on average physically weaker than men, the combined fact that they also receive no combat training and are seen as 'too emotional for war' renders them defenceless and innocent in the eyes of men. Hence why women are thrown in with children, because they're seen as non-combatants having no chance to fight back and survive. And given that male dominated society is in charge of both government and military (esp kings in medieval genre), women don't really have much autonomy- again *like children*. So yeah, definitely my least favourite part of the genre, but I'm a sucker for medieval {fantasy}.  \nIRL on Australian news, I never hear that gendered distinction though. When reporting tragedy, emphasis is always on the number, age and if it were civilians caught in 'crossfire' by the military.",
            "title_similarity": "0.69770104",
            "sentiment_compound": -0.9204
        },
        {
            "id": "h6g97ye",
            "score": 2,
            "text": "Yes and no. I think it depends on the country and culture. I do not agree with women being inferior at all. Most women I've met are better at being in charge of shit than I am XD. But at the same time in cultures where women are not equal yet I can see why people freak out more about women being victims. Although in countries where women are equal yeah its bullshit. I don't care any more that a woman died in an explosion than a man did. Children on the other hand, yeah they're too innocent yet to be involved in violence so I definitely care if there's children involved more than men or women",
            "title_similarity": "0.794114",
            "sentiment_compound": -0.7126
        },
        {
            "id": "h6ggzn3",
            "score": 1,
            "text": "People have more issue with women death cause less women is less natality. Which is pretty bad seen in a social specie.\n\nLess man just mean more polygamy, they are dispensable. \n\nI remember a campaign about homeless, an horrified journalist who said \"17% of homeless are women !\"\n\n...so 83% are men. But they don't care. Cause they are plenty more in reserve to ensure the specie reproduction.",
            "title_similarity": "0.688996",
            "sentiment_compound": -0.6351
        },
        {
            "id": "h6gi250",
            "score": 1,
            "text": "You've framed this the wrong way, ask yourself, why is it not important to know that men died in a tragedy, but only women and children? And when it is men, it is mentioned and \"people\"?",
            "title_similarity": "0.69813144",
            "sentiment_compound": -0.7721
        },
        {
            "id": "h6gjcvn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.052103803"
        },
        {
            "id": "h6gswk2",
            "score": 1,
            "text": "I personally don't understand the kid aspect of it either. Life is life, children aren't more special at living just because they're younger. Adults have as much of a right to live, and hence have the same amount of tragic as a kid dying\n\n\n\"Kids have their whole life ahead of them\", but 18+ year olds don't? Or even OAPs that have just retired and are finally getting to do something they love with their life?\n\n\nDeath is death, it's either all tragic or none of it is\n\n\nI think only the method of death contributes to the tragedy. Like if somebody dies of natural causes (old age, heart attack, etc) that's not tragic at all. But if somebody gets brutally assaulted and murdered, then that's a bit more tragic",
            "title_similarity": "0.72337687",
            "sentiment_compound": -0.9897
        },
        {
            "id": "h6gy9nd",
            "score": 2,
            "text": "Anyone who says otherwise are utter misandrists. Men are equal valuable humans who should be treated with respect. No matter what misandristic \"theories\" some people come up with.",
            "title_similarity": "0.58292794",
            "sentiment_compound": 0.7291
        },
        {
            "id": "h6h0vuz",
            "score": 1,
            "text": "Literally disgusts me how people are debating if men's lives worth as much as women's or not. Every human is equal. Men are just as valuable. Always have been.",
            "title_similarity": "0.5687164",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h6hhylb",
            "score": 1,
            "text": "I disagree, despite the modern worlds assault on traditional values, men for the most part understand that it’s part of their job to defend women. When the call out “women and children first” on the titanic, your heart swells a little that even in the blackest night, they were able to put something before themselves (instead of just rushing the boats, which would have resulted in only men life rafts.)\n\nGiven that, (although i hate to use this analogy,) it’s comparable to a murderer kicking a kitten. Although that isn’t on the same scale as his other sins, we all so pause to say “dude, what the hell?”",
            "title_similarity": "0.7769227",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h6hrd1a",
            "score": 2,
            "text": "It’s yet another double standard we get to partake in. Equality except when something bad happens to a woman, then it happens to a *woman*",
            "title_similarity": "0.6339028",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6i0lct",
            "score": 2,
            "text": "I can't believe the hurdles people are jumping just to justify not giving male victims as much compassion as female victims. Like why?",
            "title_similarity": "0.70664394",
            "sentiment_compound": 0.4812
        },
        {
            "id": "h6kr45y",
            "score": 1,
            "text": "I wait for the day my news cast (imma from germany) says: \n\n“39 people died in the tragic accident. Fortunately, no germans and only men.\"",
            "title_similarity": "0.5245806",
            "sentiment_compound": -0.8979
        },
        {
            "id": "h6maquv",
            "score": 1,
            "text": "I think it really depends on what the crime/tragedy is for me to give an opinion.",
            "title_similarity": "0.55757284",
            "sentiment_compound": 0.0
        }
    ]
}