{
    "CMV: The US should not re-impose lockdowns/restrictions, and instead allow people who choose to be unvaccinated to become infected and/or die, per their wishes.\nGiven the Following Facts:\n\n* [Nearly all COVID deaths in US are now among unvaccinated](https://apnews.com/article/coronavirus-pandemic-health-941fcf43d9731c76c16e7354f5d5e187)\n* [Vaccination status is highly correlated with political affiliation](https://jahoo.shinyapps.io/vaxpolitics/)\n* [Total vaccinations are plateauing, showing no sign of increased growth.](https://public.tableau.com/app/profile/paighowal/viz/TrackingCovidVaccinationsintheUS/CovidVaccinationsintheUS)\n* [Projections show we will only ever reach 65% total Vaccination](https://covid19-projections.com/path-to-herd-immunity/), leaving 100+ million people unvaccinated.\n\nObvious Caveats:\n\n* Children, Pregnant Women, and those with legitimate medical condition preventing vaccination should be cared for and protected within reason, provided all medical care necessary, etc.\n* The US should continue to provide vaccines to any and all who want them, and try to reach rural communities who may not have easy access.\n\n**My Position:**\n\nWe can never eradicate Covid, as it has already become endemic. The vaccines have been proven effective with no long-term side effects, and have been made freely available along with incentives and a massive PR initiative. IE: Covid is an inescapable, but preventable illness at this point.\n\n**Thus, we should accept the bodily autonomy of the willingly unvaccinated, and allow them to be infected and/or die of coronavirus.**\n\nI would even go so far as to say we should allow insurance companies to deny them medical coverage. If they want to take their chances with the virus, that's their right, and we should let them.\n\nFurthermore, if we allowed this population to become infected, that population would build some natural biological immunity to current and future covid variants. It would be better to build that immunity now, while the vaccines are still effective, than hold out trying to prevent transmission until a new variant emerges that the vaccines do not work against. The Devil we know (Delta primarily) is better than the Devil we Don't know.\n\nPlease, CMV redditors.\n\n**Edit/Update:**  \nThank you for all of your wonderful and insightful comments everybody. You've given me a lot to think about and helped work through some of my misconceptions. I am pretty genuinely moved by the empathy and love that many of you have shown both for those vulnerable and even to those who are unvaccinated. \n\nYou have softened my views considerably, though I do think there may come a time in the future where our society has to have this kind of discussion. But until that point, we all need to take responsibility for ensuring this pandemic be mild, even if that means doing more than our fair share. \n\nIf anyone reading this is not vaccinated, PLEASE, go get the jab. Most people have very mild symptoms, and you'll be protecting not only yourself, but those around you. It is safe and effective.  please, do the right thing. ": [
        {
            "id": "h6lcgs2",
            "score": -264,
            "text": ">the vaccines have been proven effective with no long-term side effects\n\nThey haven’t even been fully approved by the FDA. It’s effective only for a time, and we don’t even know exactly for how long. And how can you say there are no long-term effects for a vaccine that hasn’t even been available for a year? \n\nI’m not an antivaxxer, but I won’t be getting the COVID vaccine any time soon, and neither will be my wife, who’s an MD and who is currently working in medical research.\n\nI know I’ll get heat for this, but I couldn’t care less. I’m not a red-hat, I wear my mask everywhere and take all other safety precautions. I don’t want to get inoculated with something that has been fast tracked as quickly as possible because of an emergency. I’ll let others be the beta testers.\n\nEdit: [Yup, this definitely helps](https://i.imgur.com/DWaJRq5.jpg)",
            "title_similarity": "0.5887227",
            "sentiment_compound": 0.9214
        },
        {
            "id": "h6lv7az",
            "score": 3,
            "text": "There is a pharmaceutical that eliminates the virus within a couple doses. A medical establishment based in India if I recall correctly was making noise about with supposed data to back it. The massive global push for mandatory vaccination while stripping the population of freedoms in the guise of security is straight out the playbook. They use the fear to separate and steer us.. if you not thinking for yourself the decisions are being made for you. Be well.",
            "title_similarity": "0.8160038",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h6ljb1u",
            "score": 1,
            "text": "One's bodily autonomy does not give them the right to infect others. Vaccines are not 100% effective. Natural immunity is not 100% effective. Masks and social distancing are not 100% effective. Just because I'm vaccinated doesn't mean I'm completely safe from unvaccinated people. Every time an unvaccinated person gets sick, the virus has a chance to mutate to a more infectious, vaccine-resistant, or deadly variant.\n\nVaccines have been a normal part of our society for well over 100 years. We are all in this together and people need to grow up.",
            "title_similarity": "0.7431122",
            "sentiment_compound": -0.6984
        },
        {
            "id": "h6limoq",
            "score": 4,
            "text": "My argument would be on two fronts.\n\n1) there are folks that are unable to get vaccinated due to age, health issues, treatment, etc. They are unequivocally at risk from the unvaccinated, and ALSO from the vaccinated who are still able to get covid and transmit it. \n\n2) even folks that are vaccinated are able to contract covid, aid in mutations, and spread it. It makes no difference from strain Alpha's outbreak to Delta's that some people are vaccinated. The risk is still there for everyone, just slightly less for those that are vaccinated. \n\nFrom those alone, lockdowns have a reason to be enforced again and I would argue they should be imposed far sooner then they were last time and be more heavy handed. We shouldn't have to lose another half million people or another almost full year of half assed lockdowns when we could just do a real month and make a difference.",
            "title_similarity": "0.7939004",
            "sentiment_compound": -0.8605
        },
        {
            "id": "h6li020",
            "score": -7,
            "text": "\"We can never eradicate Covid\" -- yes we can just like we did with Polio. All it will take is everyone getting vaccinated while the vaccines still work (i.e. before COVID mutates...)\n\nI'd love to see the selfish cowards who refuse to get vaccinated get what they have coming to them but the problem is they will over-run the hospitals and that is why our leaders MUST lock things down again (when the hospitals reach max capacity).\n\nIf we can somehow ship these unvaccinated COVID patients to makeshift hospitals or not allow them to seek medical help at hospitals (for example we let them die at home) then I would totally agree with you. But doctors and hospitals are obligated to treat sick people -- even if they brought the sickness on themselves and are killing our way of life --  and these highly contagious people will jam up hospitals. \n\nIn short, society cannot continue as normal without hospitals and medical personnel to treat people who suffer heart attacks, strokes, car accidents, cancer patients, etc etc. We simply cannot have people bleeding out on sidewalks coz the hospital has no room.\n\nThe only solution is to get people vaccinated. I think Uncle Sam should bribe these dumb people with tax breaks. Until them I am gonna let them know that they are the BAD GUYS. The world needs their help and they said, no. They are too selfish to help other people. They are too cowardly to get a vaccine that even an extremely unhealthy Trump got after he was infected. \n\nWe need to ostracize and ridicule these dangerous anti-vaxxers. That is the road to returning back to normal life. Unless we can agree to NOT ALLOW THEM TO USE HOSPITALS which I'm cool with but leaders cannot possibly be.",
            "title_similarity": "0.8280066",
            "sentiment_compound": -0.9945
        },
        {
            "id": "h6l82jw",
            "score": 38,
            "text": "So society is like a group of people connected by a chain. And so if enough people decide to jump off a cliff and die, because we are all connected, it can bring the rest of us down with them. Not just in a vaccine sense but we would lose workers, teachers, researchers, vital people in our communities. It would also kill the homeless, children, the sick, we can't tell parents they don't have to get the vaccine and hide them from their children or take away their kids so they would die. Like the fact is we should continue with the plan. Is the plan hard and difficult sure but this is a good plan if we actually follow through with it.",
            "title_similarity": "0.7235155",
            "sentiment_compound": -0.951
        },
        {
            "id": "h6lgsq2",
            "score": 1,
            "text": "That is exactly what we need. Thousands of sick completely throttling the Healthcare system, so when others need a non covid related health service they have to wait for months.",
            "title_similarity": "0.5555432",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6mdgmh",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.2363663"
        },
        {
            "id": "h6m3rdp",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h6l8fgy",
            "score": 27,
            "text": "There are 100s of millions not unvaccinated people.\n\nIf covid rips through them, they can easily overwhelm hospital/health care systems which would negatively affect healthcare for EVERYONE, even for Covid-unrelated issues.\n\nThese are issues affecting our society as a whole, so we cannot simply focus on autonomy of any individual.",
            "title_similarity": "0.7267624",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6ltyde",
            "score": 0,
            "text": "I have a toddler. He can’t be vaccinated. I am vaccinated but that doesn’t mean I can’t catch COVID. It just won’t kill me. I still risk bringing it home to him.\n\nIf the unvaccinated were just hurting themselves, go nuts. They’re not. They’re risking innocent bystanders like cancer patients and young children. I don’t want my kid to lose a lung because of someone’s freedumb.",
            "title_similarity": "0.75771976",
            "sentiment_compound": -0.9743
        },
        {
            "id": "h6m9sbf",
            "score": 0,
            "text": "I think those people can just not live on this country or society anymore. Plenty of open ocean left for y'all to go to. If you don't wanna get vaccinated, pay taxes, whatever, so be it, just get the fuck out if civilization and shut the fuck up, stop using civilizations internet and go die your idiot deaths in the water alone.",
            "title_similarity": "0.6449323",
            "sentiment_compound": -0.9571
        },
        {
            "id": "h6mb1qc",
            "score": 0,
            "text": "I hope 90% of the antivaxxers die in misery.  The problem is they can still infect other people.",
            "title_similarity": "0.62736005",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h6l75ch",
            "score": 3,
            "text": "There are people who can't be vaccinated but their wish is to not die. Please tell me how you plan to deal with them.",
            "title_similarity": "0.6512296",
            "sentiment_compound": 0.745
        },
        {
            "id": "h6la32w",
            "score": 165,
            "text": "An analogy to your position would be to allow drunk driving.\n\nThey're probably going to crash their own cars into the side of the road, so what's the big deal? Sure, some of them might hit other cars and kill the people inside, which may be entire families; but hey, it's their right to drive drunk, we just have to cut our losses.\n\nUnvaccinated people are not only perpetuating the virus itself, they are also perpetuating a petri-dish that will create deadlier variants. They are infecting those who can't be vaccinated and infecting those who *are* (some people still get sick, just not as sick). Not getting vaccinated when you are able to do so is negligence that perpetuates death and sickness.\n\n>\tif we allowed this population to become infected, that population would build some natural biological immunity to current and future covid variants\n\nJust like we did with Polio and the Measles? No. Some sicknesses don't just go away on their own. I think the fact that people think this is true just shows how spoiled we are thanks to scientific achievements of the (somewhat recent) past.\n\n>\t...than hold out trying to prevent transmission until a new variant emerges that the vaccines do not work against\n\nGuess which demographic the variant is most likely to come from? That's right. The people whom you're arguing for -- You're arguing *against* the prevention of new variants, which affects everyone and starts the cycle all over again.\n\nTherefore, this is not a reasonable view",
            "title_similarity": "0.75034374",
            "sentiment_compound": -0.9504
        },
        {
            "id": "h6lhur0",
            "score": 7,
            "text": "I feel lied too at this point regarding. The vaccines effectiveness.I got vaccinated very early and it has gotten less effective since. According to the people that made it since then. I obviously realize new research has come to light. But I was sicker than I have ever been in my life from both my first and second vaccine. Had highly elevated heart rate for days. High temp body aches chills and heat flashes. And chest tightness. Took a full week for me to feel better after the second. I’m happy I got the vaccine I believe in doing it for others. But I’m definitely not Getting a booster if it has side effects like the last. That said I know a ton of people that didn’t have side effects.",
            "title_similarity": "0.5995665",
            "sentiment_compound": 0.9702
        },
        {
            "id": "h6loa0e",
            "score": 8,
            "text": "I think you are missing a key fact here-we shouldn’t have ended mask mandates, social distancing, restrictions, etc. until all of the population (children under the age of 12) are afforded the opportunity to get vaccinated. Those of us with younger kids are feeling like a no-win here; life has seemingly moved on for others but we aren’t able to protect our kids in crowded indoor spaces, and it sucks. If we could keep a mask mandate for them, I could take them out in public and enjoy themselves a bit, but as it stands now, we feel like we are captive again with the vast majority refusing to wear masks",
            "title_similarity": "0.70627254",
            "sentiment_compound": 0.7543
        },
        {
            "id": "h6m799j",
            "score": -1,
            "text": "My kids and infant aren't choosing not to be vaccinated. \n\nMy aunt in advanced chemotherapy isn't choosing not to be vaccinated.\n\nThese are the people who will die. \n\nIntentionally unvaccinated people will likely survive to mutate the virus past vaccine efficacy and we will be right back where we are. Furthermore, these assholes will now be dealing with long hauler effects which not only drain our resources, but include cognitive impairment. Do you want selfish people who already cannot understand vaccines, elementary school level science, and basic compassion voting on your behalf? \n\nI sure as shit don't. \n\nMandate vaccines. Fuck these people.",
            "title_similarity": "0.815888",
            "sentiment_compound": -0.3016
        },
        {
            "id": "h6ntmcd",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "0.20002617"
        },
        {
            "id": "h6l8mvm",
            "score": 8,
            "text": ">The vaccines have been proven effective with no long-term side effects,\n\nLong term side effects remain to be seen, it absolutely has not been proven to have no long term side effects, it hasn't even been out for a year ffs. \n\n> IE: Covid is an inescapable, but preventable illness at this point.\n\nPeople with vaccine can still get covid, it's not 100% effective and with so many mutations of covid how effective it will be long term remains to be seen.",
            "title_similarity": "0.58044237",
            "sentiment_compound": -0.6464
        },
        {
            "id": "h6mgtpo",
            "score": 1,
            "text": "You are a selfish fool. It’s not just the sick people that will be affected. Your position is, in essence, let’s just let everybody die because I’m a child that’s tired of lockdowns.",
            "title_similarity": "0.6888289",
            "sentiment_compound": -0.8933
        },
        {
            "id": "h6l8jn9",
            "score": 8,
            "text": "And... what about the wishes of their friends/family? E.g. typical family unit of 4. One of them is an antivaxxer. The remaining 3 would still request (from the antivaxxer or doctors) that vaccination be done anyway, while in hospital or otherwise.\n\nSure, stupid people want to do plenty of stupid stuff. But death usually leaves behind grieving people, which is a problem too.",
            "title_similarity": "0.7431201",
            "sentiment_compound": -0.9489
        },
        {
            "id": "h6lrbd8",
            "score": 3,
            "text": "Can you expand on your motivation for this viewpoint?\n\nThe messaging seems very wishy-washy. At first people were (rightfully) screaming bloody murder about all \"those idiots\" that were travelling, then the ones having get togethers and parties, then the ones going out in public without masks. \"You're killing people,\" \"you're a murderer,\" \"you're a piece of shit science denier,\" \"you don't care about other people you're just being selfish,\" \"it's not about you and your risk, it's about the vulnerable people who can't get vaccines,\" etc. etc.\n\nThat's all we heard for over a year. And now, now that the vaccine rollout is underway and we're seeing new strains pop up, those very same people are throwing their hands up and saying ugh, I'm so tired of this, I just want to go out again, so that's what I'm gonna do, and screw the anti-vaxxers.\n\nIn other words, making selfish decisions because they personally are tired of being inconvenienced. E.g. the exact same thing they were relentlessly chastising others for. So what's the difference, that you are vaccinated?\n\nYou can still spread COVID if you're vaccinated. You can still get COVID if you're vaccinated. The previously vulnerable people are still vulnerable, they don't much care if they get COVID from someone vaccinated or unvaccinated. There are new strains against which the vaccine is slightly less effective. Delta is just one variant, there are others.\n\nSo what changed? You're focusing on the anti-vaxxers because that helps you feel better about saying \"screw it, I'm tired of COVID restrictions, I'm just gonna live my life.\" Which is **exactly** the viewpoint that people were mercilessly attacking others for this whole year. Only now, it's OK to put those groups of elderly, or immunocompromised, or people who can't get the vaccine at risk because you got the vaccine, so you feel entitled to it?\n\nIt's not a very consistent viewpoint. By all means, do what you like, just understand that you're doing basically the same thing the anti-lockdown/anti-vax people have been doing. The same ones you're targeting in your post.\n\nEDIT: u/oldeenglishdry12345 My point is that the same people are at risk now as before. The unvaccinated **and** those who are unable to take the vaccine or otherwise in high risk groups. Just as before, only before when people said \"Well I'm healthy and young and the risk to me is low so why *shouldn't* I be able to go out?\" the response was \"because you're putting at-risk groups in jeopardy. You monster. \n\nNothing has fundamentally changed in that regard except that the zeitgeist is now that it's OK to put those same groups at risk if you got the vaccine, because \"I did my part and I wanna go outside now bugger off.\" \n\nAnd by the way: I agree with you. I'm vaccinated and I'm happy to mask up and go out. But the whole \"it's ok because they're selfish and I'm not\" thing is just a way to excuse ourselves from the same responsibility towards at-risk/immunocompromised groups that we put on others this entire past year. Before we considered it a responsibility, but now it's a punishment? Why? Because you personally don't feel like playing along anymore? Again: that's fine, that's your choice, but don't claim a moral high ground when the fundamental issue is not your concern for society but for your own comfort.",
            "title_similarity": "0.66249144",
            "sentiment_compound": -0.9746
        },
        {
            "id": "h6m7lan",
            "score": -1,
            "text": "No I won't. In fact I'll agree with you and add on to what you're saying. \n\nThose people, generally, have from the beginning been heartless and we extremely selfish. They say \"let the weak die\" or \"those people were going to die anyway.\" Which is a lie and completely heartless. \n\nI work and live in a rural part of the US and everyday I have to hear these people talk about their fellow countrymen as if they are sworn enemies. The most un-American people are these right wing nut jobs. They hate their fellow american just because they're different. Completely ignoring what this country is about. They are the ones that are always saying how free this country is, yet are the first to condemn you for being different. \n\nI was just at a country music event. It was lovely, not my style but it was good. And at this event and every country event the musicians always take the time to celebrate us veterans. Well they then sing a song about all of us Americans standing up for our liberty. It's something like 3% or so of the population actually serves. And less than that that serves on the front line to actually \"stand up and defend our liberty.\" But they aren't talking about liberty. They are talking about their way of life. \n\nThese people do not have our best interests in mind. This country is a salad and we are supposed to welcome ALL new ingredients! I didnt serve this fucked up country to only defend cis white Christians. \n\nIf we let those people die off because their own stupidity this country and in extension the rest of the world will be better for it. They will die and so will their racist ignorance with them.\n\nSorry I really didn't mean to rant. I'm just tired of these fake ass Americans making us look fucking stupid to the rest of the world.",
            "title_similarity": "0.6106286",
            "sentiment_compound": -0.9905
        },
        {
            "id": "h6lc6zo",
            "score": 14,
            "text": "Vaccination is not 100% effective. Even though most deaths might be among unvaccinated people, vaccinated people will still get sick and might still suffer from the disease, including long term effects.\n\n>Children, Pregnant Women, and those with legitimate medical condition preventing vaccination should be cared for and protected within reason, provided all medical care necessary, etc.\n\nSo I guess they should just... Be quarantined? Or what is the idea here?\n\n>We can never eradicate Covid, as it has already become endemic.\n\nWe've eradicated diseases before. With vaccines.\n\n>Furthermore, if we allowed this population to become infected, that population would build some natural biological immunity to current and future covid variants. It would be better to build that immunity now, while the vaccines are still effective, than hold out trying to prevent transmission until a new variant emerges that the vaccines do not work against. The Devil we know (Delta primarily) is better than the Devil we Don't know. \n\nThis is just... Incorrect. Providing more hosts to a virus is what allows it to mutate in the first place. That is exactly how we got the Delta variant. So, a mutant emerging that affects vaccinated people is far more likely when it has hosts to run rampant.",
            "title_similarity": "0.8356691",
            "sentiment_compound": -0.529
        },
        {
            "id": "h6lgmh2",
            "score": 10,
            "text": "/u/Vulptereen-327 (OP) has awarded 9 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/os11nh/deltas_awarded_in_cmv_the_us_should_not_reimpose/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.58262444",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h6mad64",
            "score": 2,
            "text": "As someone who is NOT going to be vaccinated, I’ll agree with this. I’m in my twenties and if I get Covid I’ll be just fine. There is literally no reason at all whatsoever for me to put a Covid vaccine in my body. Look at the CDC statistics for 20-30 YO people, statistically I’m virtually guaranteed to survive it.",
            "title_similarity": "0.6405126",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h6l77a7",
            "score": 37,
            "text": ">Children, Pregnant Women, and those with legitimate medical condition preventing vaccination should be cared for and protected within reason\n\nSo, it's unreasonable for the unvaccinated to always wear PPE and/or isolate themselves?  \n\nAren't those unwilling to get vaccinated, and refuse to take precautions, the greatest risk to those you've listed?\n\nI want them to do it not for themselves but for those you listed who want to get vaccinated but are unable to.  I don't see this as unreasonable.",
            "title_similarity": "0.7751119",
            "sentiment_compound": 0.5873
        },
        {
            "id": "h6lc7vb",
            "score": 916,
            "text": "**The post below uses in several places rounded, simplified, fictitious values to help explain the mathematical concept about why one particular statistic which you will see reported about vaccinations moves in a counter-intuitive direction, which can be misleading and can be misused by anti-vaxxers.** It originally used death but has been amended to hospitalisation because the fictional rounded numbers I picked are closer to the reality of the statistics for that. The concept is still the same for deaths.\n\n>Nearly all COVID deaths in US are now among unvaccinated\n\nThis doesn't mean what you think it means.\n\nLet's consider a few scenarios.\n\n• 1. Awful vaccine program: Vaccination is given to 1% of the population. Result: About 99.9% of the hospitalisations are in unvaccinated people.\n\n• 2. Realistically effective vaccine program: Vaccine that is 90% effective at reducing hospitalisation is given to around 90% of the population. Result: about half the hospitalisations are unvaccinated.\n\n(For every 100 people who would have been hospitalised before the vaccination program: 10 are unvaccinated and get infected and hospitalised, 81 are saved by their vaccination, 9 are hospitalised despite being vaccinated.)\n\n• 3. Unrealistically amazing vaccine program: Vaccine that is 90% effective is given to 100% of the population. Result: 100% of the hospitalisations are in *vaccinated* people.\n\n**The better your vaccination programme the GREATER the proportion of people dying/hospitalised will be vaccinated.**\n\nThe fact that such a large proportion of the people dying/hospitalised in the US are unvaccinated is a sign of the program having much more scope to increase coverage. \n\nEdit: simplified some numbers above. Also, for anyone thinking this only works at extreme values...\n\nWith a 90% effective vaccine\\*, for every 100 people who would have been hospitalised:\n\n- 0% vaccinated: 100 unvaccinated people are hospitalised, 0 vaccinated are hospitalised; Result: 0% of the hospitalised are vaccinated\n- 10% vaccinated: 90 unvaccinated people are hospitalised, 1 vaccinated are hospitalised; Result: 1% of the hospitalised are vaccinated\n- 20% vaccinated: 80 unvaccinated people are hospitalised, 2 vaccinated are hospitalised; Result: 2% of the hospitalised are vaccinated\n- 30% vaccinated: 70 unvaccinated people are hospitalised, 3 vaccinated are hospitalised; Result: 4% of the hospitalised are vaccinated\n- 40% vaccinated: 60 unvaccinated people are hospitalised, 4 vaccinated are hospitalised; Result: 6% of the hospitalised are vaccinated\n- 50% vaccinated: 50 unvaccinated people are hospitalised, 5 vaccinated are hospitalised; Result: 9% of the hospitalised are vaccinated\n- 60% vaccinated: 40 unvaccinated people are hospitalised, 6 vaccinated are hospitalised; Result: 13% of the hospitalised are vaccinated\n- 70% vaccinated: 30. unvaccinated people are hospitalised, 7 vaccinated are hospitalised; Result: 19% of the hospitalised are vaccinated\n- 80% vaccinated: 20. unvaccinated people are hospitalised, 8 vaccinated are hospitalised; Result: 29% of the hospitalised are vaccinated\n- 90% vaccinated: 10. unvaccinated people are hospitalised, 9 vaccinated are hospitalised; Result: 47% of the hospitalised are vaccinated\n- 100% vaccinated: 0 unvaccinated people are hospitalised, 10 vaccinated are hospitalised; Result: 100% of the hospitalised are vaccinated\n\n\\* Real world estimates for this value from the US, UK and Israel are in the range 88% to 96%.\n\nFor context, I'm in the UK. We've fully vaccinated over 90% of our over-50s population (the people who account for the vast majority of the deaths) and as a result we now have 40% of those hospitalised from Covid being vaccinated people.\n\nThat's a good thing. It's because the numbers are *much lower* than they would have been. It's 40% of a *smaller number*. But, the Covid-deniers and anti-vaxxers look at that number and think 40 is a lot, so the vaccines clearly don't work that well.\n\nAs vaccine take up increases the number of people hopsitalised and dying **plummets**. The vaccines **save huge numbers of lives**. But the *proportion* of vaccinated to non-vaccinated **completely ignores that**. It's a *shit number to look at* because it moves in a misleading and counterintuitive direction to what you would expect.\n\nIt will always increase because mathematically that's how it works.\n\nMy intention with this post is **to discourage people from using this statistic and to understand why it moves counterintuitively so that it isn't taken advantage of by anti-vaxxers**.\n\nGet vaccinated people!",
            "title_similarity": "0.78303266",
            "sentiment_compound": 0.9895
        },
        {
            "id": "h6lrg52",
            "score": 0,
            "text": "The problem with this is that there are a large number of people who are unvaccinated not because of their own choices, but because they can't be.  People with compromised immune systems, who have had an allergic reaction to some component of the vaccine in the past, who had a bad reaction to the first shot in a two-shot vaccination, children under 12...\n\nAnd every willfully unvaccinated person presents a risk to this population.",
            "title_similarity": "0.6933824",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h6ls69b",
            "score": 0,
            "text": "Well, I’ve not read the existing deltas, so there’s fair odds that somebody has brought this up already.\n\nBut a huge amount of people - be it due to allergies, autoimmune stuff, or other ongoing treatments - cannot take the vaccine. As in, there are good odds the vaccine could be incredibly harmful to them, if not fatal - or, quite possibly, (as I believe is the case for immunocompromised people), the vaccine will not work, as they have no immune system to learn to defend against the virus.\n\nThis means that you would be saying ‘because we want to respect the free choice of the antivax idiots, all of you people with disabilities or medical conditions that prevent you from getting the vaccine can die along with them’.\n\nAnd to make it worse, the people medically unable to take the vaccine have a HIGHER death rate from COVID than those who are just refusing to take the jab. So the consequences would be even WORSE for them.",
            "title_similarity": "0.8000131",
            "sentiment_compound": -0.7066
        },
        {
            "id": "h6mbw31",
            "score": 0,
            "text": "Agree, my body my choice right?",
            "title_similarity": "0.19034731",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6mcv4w",
            "score": 0,
            "text": "No one will accept another lockdown so this is a moot point.",
            "title_similarity": "0.4434371",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6md55y",
            "score": 0,
            "text": "I agree. Let all the people with AIDS die too, because most caught it with lifestyle decisions.",
            "title_similarity": "0.64776945",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6minrt",
            "score": 0,
            "text": "Ahem children under 12 are not approved for the vaccine. They will get it and bring it home and it’s not their fault. For those who are blissfully ignorant… yeah fuck em. I’m vaccinated my pregnant wife is too but our 8 yo daughter is not. School will be resuming in the fall and I’m worried. Hate to quote game of thrones but “winter is coming” and so is a resurgence in COVID cases… so yeah we’re basically screwed. And forget about lock downs good luck getting people to wear masks again.",
            "title_similarity": "0.7260978",
            "sentiment_compound": -0.548
        },
        {
            "id": "h6mqy03",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.2363663"
        },
        {
            "id": "h6n2n8c",
            "score": 0,
            "text": "It's a bit harsh but I understand the frustration. I'm fed up with the oxygen that social media gives these morons and the genuine damage they do to others. I don't care what happens to them as individuals anymore but the risk the impose on others by their narcissistic conspiratorial behaviour is totally unacceptable. As usual what they complain of in others is actually their own behaviour.  They are the sheep. They are the ones that don't look at evidence, they are the ones putting themselves and society at risk. \n\nAt first I tried to debate them, address the facts and ignored their insults. No I just don't care and wish they would all go away. I am particularly delighted to observe that the evangelical churches and far right are vigorously opposed to masks, vaccines and social distancing. Do us all a favour and remove yourselves from society and the gene pool.",
            "title_similarity": "0.6415547",
            "sentiment_compound": -0.989
        },
        {
            "id": "h6n93w4",
            "score": 0,
            "text": "also the people who are vaccinated die too",
            "title_similarity": "0.55070984",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h6nhfpf",
            "score": 0,
            "text": "I feel like masks and personal protective items along with regular hand washing and social distancing is far more effective than a vaccine that wont stop the next epidemic. There will be more and more and more. Civilization is at a point where things can spread to easily. The precautions we took before the vaccines work for all contagious diseases. Taking a vaccine and going back to business as usual will only bring on the next pandemic. That's why I don't like the vaccine. I wish people would just keep their masks on. You are the ones who spread diseases.",
            "title_similarity": "0.7830961",
            "sentiment_compound": 0.8903
        },
        {
            "id": "h6nhxa4",
            "score": 0,
            "text": "If the unvaccinated are still wearing masks and social distancing they are less likely to spread a contagious disease than a person who has the vaccine and just goes back to the way things were that allowed these diseases to become an epidemic in the first place.",
            "title_similarity": "0.7798397",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6l8t1h",
            "score": 1578,
            "text": "Doesn't seem very fair to the people who can't have the vaccine for whatever reason, or had the vaccine and had a poor immune response to it due to age/immunocompromised/whatever. \n\nI agree that endemic covid is likely but we can at least try to bend the curve on delta cases somewhat so that people who have a decent chance at hospitalisation despite getting vaccinated can have an unburdened healthcare system rather than a crowded disaster ward full of dying people. It's all well and good to say \"let's help these people and let those other people die\" but the reality is that dying people consume medical resources whether they deserve it or not. Also this approach would buy more time for developing and rolling out delta-specific boosters which seem increasingly necessary as preliminary data shows vaccine effectiveness decreasing c. 6 months out\n\nI would say re-introduce low-impact measures like mask mandates, ventilation, etc. and hope to Jesus you don't get to the point where you're looking at a new lockdown because it would almost certainly do more harm at this point just through backlash. Probably the worst possible course of action is to wait too long and then re-introduce all the heaviest restrictions at the last minute",
            "title_similarity": "0.8172878",
            "sentiment_compound": -0.5884
        },
        {
            "id": "h6l924w",
            "score": -1,
            "text": "This is how you get variants of the disease, this is how you kill a bunch of immuno-compromised people, and this is how you make sure that covid stays in Vogue for decades to come. I’m already tired of talking about covid don’t extend the fucking thing.",
            "title_similarity": "0.73388374",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h6lajh8",
            "score": 1,
            "text": "I see it this way. Healthcare workers should refuse service to those who are unvaccinated and get infected. Let nature decide their fate. Do they receive a Darwin Award or not?",
            "title_similarity": "0.74387413",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h6ltj96",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6ltkyp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6m8skl",
            "score": 1,
            "text": "These people have been harmed by misinformation - they still have kids, families, and lives. These people are not your play things. You don't get to live out vindictive fantasies and allow a misinformed group to hurt themselves just because the internet knows they're misinformed and hates them for it.",
            "title_similarity": "0.6470956",
            "sentiment_compound": -0.9436
        },
        {
            "id": "h6ml9kp",
            "score": 1,
            "text": ">Given the Following Facts:\r  \n\r  \nNearly all COVID deaths in US are now among unvaccinated\n\nThis is simply an asinine statement. It's easy to cherry-pick \"facts\" to suit your agenda. But if your claim and the linked article are so irrefutable, then why is the CDC discontinuing use of the PCR test? [Source](https://www.cdc.gov/csels/dls/locs/2021/07-21-2021-lab-alert-Changes_CDC_RT-PCR_SARS-CoV-2_Testing_1.html). The explanation shows that it can't properly differentiate between Covid and the influenza virus. Therefore, ALL of the numbers that have been reported should be called into question as to their accuracy. Based on my limited understanding of this, it sounds like there is NO DEFINITIVE test for Covid, but rather it's been diagnosed by elimination. While in principle this is completely logical, the reaction has been anything but. There are plenty of other illnesses, viruses, and substances that kill more than Covid allegedly does. The draconian reactions are unwarranted and unnecessary. \n\n&#x200B;\n\n>Vaccination status is highly correlated with political affiliation\r  \n\r\n\nSince you want to bring up this asinine point, you should also remember that the current President and Vice President undermined efforts to distribute the vaccine prior to their election. If that's not the pot calling the kettle black, but I digress.\n\n&#x200B;\n\n>I would even go so far as to say we should allow insurance companies to deny them medical coverage.\n\nInteresting position you take here. But you know the ACA prohibits exclusion based on this sort of thing right? Are you against the ACA? Just curious...\n\n&#x200B;\n\n>If anyone reading this is not vaccinated, PLEASE, go get the jab.\n\nNo thank you. Just like the Vice President said \"Just because Donald Trump tells me to get it I'm not going to get it\". The name of the politician is irrelevant. They are not to be trusted and Donald Trump is no more or less trustworthy than Joe Biden or Kamala Harris. New research is showing that treatments like Ivermectin work just fine against Covid so I don't need this \"jab\". I don't need to support Big Pharma.",
            "title_similarity": "0.8276726",
            "sentiment_compound": -0.94
        },
        {
            "id": "h6mo5x8",
            "score": 1,
            "text": "I am 100% fine with this, as long as every single one of them sign a waiver to refuse medical care in place of others who are vaccinated. \n\nIf my child get this, and the hospitals are full up I'm going to be livid.",
            "title_similarity": "0.70978606",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6n391n",
            "score": -1,
            "text": "Did you forget the part where the virus doesn’t just affect you and can easily kill others. It is biological violence against others.",
            "title_similarity": "0.7030009",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h6n3ob6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6na920",
            "score": 1,
            "text": "COVID is not a death sentence. MOST of the time it’s barely a take off from work sentence. I got COVID and barely even got sick. I’ve had worse head colds. To say that the unvaccinated will “get their wish and die” makes you sound like a little pompus prick (which you probably are). Grow up.",
            "title_similarity": "0.636728",
            "sentiment_compound": 0.0428
        },
        {
            "id": "h6ngwv1",
            "score": 1,
            "text": "LMAOOO \"the vaccine has been proven effective with no longer term effects\" where do you get your info? Where the hell did they do long term research on a vaccine that hasn't been out for a year? Because your facts are off your view is invalid",
            "title_similarity": "0.61674887",
            "sentiment_compound": -0.6199
        },
        {
            "id": "h6lmlhu",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6lipks",
            "score": 2,
            "text": "It is very unfortunate that a small percentage of the population isn’t able to get vaccinated and self assholes continue to put them in danger, but overall I like the idea of just letting that will happen happen so we can move on\n\nHowever I have to disagree with your post even though I don’t want to and here is why. There are enough unvaccinated people that a bunch getting sick and requiring medical attention at the same time could overload hospitals.  This would result in vaccinated people dealing with cancelled surgeries , delayed wait times /suffering and put the lives of vaccinated people at risk",
            "title_similarity": "0.7485816",
            "sentiment_compound": -0.9744
        },
        {
            "id": "h6ljtoz",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6lqn6u",
            "score": 2,
            "text": "The problem is not people who refuse the vaccine getting Covid and dying. The problem is people refusing the vaccine then getting Covid and infecting dozens of other people around them because of their selfishness. It’s not a, “my body, my choice” scenario. Those who refuse to get vaccinated are selfishly killing people around them.",
            "title_similarity": "0.7967502",
            "sentiment_compound": -0.951
        },
        {
            "id": "h6lukv3",
            "score": 2,
            "text": "If even a single vaccinated person contracts the virus and dies from someone who wont vaccinate, that is too high of a price to pay for antivaxxers willful stupidity.",
            "title_similarity": "0.75998986",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6lvtgg",
            "score": 2,
            "text": "Unvaccinated kids will die.\nPeople who can’t be vaccinated will die.\n\nHospitals will be overwhelmed (they already are) and if you have a serious injury or medical event such as a heart attack, there won’t be anywhere to put you. It’s also discouraging people to go get treated for minor things, go for regular checkups or even get bloodwork done. \n\nThere are also people who waited to see a doctor and have untreatable cancer that would have been treatable if caught sooner. \n\nI’d like to just let it run through the unvaccinated but I’m not willing to put my kids lives at risk. I’m also sick of my wife being called in to work.",
            "title_similarity": "0.7554654",
            "sentiment_compound": -0.936
        },
        {
            "id": "h6m7r8n",
            "score": -2,
            "text": "You do realize u still can die from covid with a vaccine right ? And also vaccine are the main cause of all these new Variant.  Vaccine doesn’t save u . You are still spreading covid everywhere u go . Good job not paying attention .",
            "title_similarity": "0.82379866",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6majic",
            "score": 2,
            "text": ">I would even go so far as to say we should allow insurance companies to deny them medical coverage.\n\nSo someone that doesn't want to take the vaccine, ends up getting t-boned or the like and gets a broken back, they should be denied medical care?",
            "title_similarity": "0.7976779",
            "sentiment_compound": -0.2551
        },
        {
            "id": "h6md8i8",
            "score": 2,
            "text": "Do you feel we should deny treatment or care to these people?\n\nIf so, do you hold the same standard to people who:\nsmoke, drink, or overeat unhealthy food to the point of obesity?\n\nAll of these are personal, bodily autonomy related choices, much the same way the vaccine is. All of them have negative health consequences that are clearly and conclusively documented.\n\nDo people lose the right to health care if they make less than ideal choices regarding their bodily autonomy?",
            "title_similarity": "0.77497",
            "sentiment_compound": 0.1435
        },
        {
            "id": "h6ljxid",
            "score": 106,
            "text": "I agree with not shutting things down again but I disagree with your argument about letting anti-vaxers die. The reason that people are anti-vax can be complex and often include socioeconomic factors and historical trauma.\n\nBlak people for instance are more likely to choose not to get the COViD Vaccine, much of which is due to mistrust for the medical institution as a whole. And they have good reason to feel that way, since black people were the target of unjust experimentation as recently as the last several decades. Even though the medical institution has changed since then, there is still lingering mistrust for doctors.\n\nThen you take families like mine who grew of so poor we didn't have insurance and therefore couldn't participate in medical care. Because of that, we developed a \"well we don't need it anyway\" attitude and swore by natural alternatives, claiming that our bodies had everything it needed to heal or protect itself. This is pretty common. When people lack access to an institution or don't feel included by it, whether it be the medical system, government, school, etc, they convince themselves they don't need it because that's less painful than acknowledging that it's important but just not in the cards for them. Low and behold once I got into college and studied medicine I completely shed that view of vaccines and now am very pro vax. But this change in view came out of a place of privilege (a really good education).\n\nSo the people you're talking about that \"deserve to die\" aren't necessarily people who are completely careless with their health or want to hurt other people. They are people that for a variety of reasons genuinely believe that it's in their best interest to avoid the vaccine. They may be completely wrong in most cases, but it's not entirely their fault for believing something that isn't true.",
            "title_similarity": "0.73284304",
            "sentiment_compound": -0.8496
        },
        {
            "id": "h6mrxou",
            "score": 4,
            "text": "People don't deserve to be denied medical coverage for practicing bodily autonomy, that's just insane. Consider the unvaccinated as stupid, irresponsible, or whatever else you consider them to be. If you wanna look down on those who choose not to get vaccinated, fine, that's your opinion. But medical care is a human right and when we start saying some people are more worthy of living than others that's when you start tiptoeing into eugenics territory. Human life is inherently valuable; all people are worthy of health care, dignity, and their one life that God gave them. \n\nAs a leftist who isn't getting the 2nd shot of the vax, hearing your lack of care for the unvaccinated population's access to med care is a bit disturbing. Lucky for you I'm already below the poverty line anyways so I can't even afford insurance in the first place. Yay for you!",
            "title_similarity": "0.71720976",
            "sentiment_compound": 0.9832
        },
        {
            "id": "h6ltgut",
            "score": 49,
            "text": "So I'm a medical student. I was luckily one of the first to get vaccinated. I run and lift and am in the peak of my health. I felt like the 88% chance of immunity against the delta variant seemed fine, and lived my life normally. I live in the south so you won't see masks here except the occasional person at the grocery store. I ended up catching covid, probably at the gym, and have had severe flu-like symptoms for 6 days now. I'm fatigued and sleep most of the day. I lost my sense of smell. It hurts to breathe, talk, and swallow. I used to think like you, let the unvaccinated get sick, and the part of society willing to follow CDC advice up to this point live normal lives. But now that I've been so sick after being vaccinated and healthy...my tune has changed. If it can hit me this hard, I can't imagine what it can do to unhealthy people with pre existing conditions. None of us are safe, including myself because you can possibly catch it again.",
            "title_similarity": "0.49887308",
            "sentiment_compound": -0.8796
        },
        {
            "id": "h6lgyms",
            "score": 53,
            "text": "The risk is the emergence of new variants of the virus. Spread of covid among unvaccinated people could result in a new variant that kills vaccinated people. Therefore, this could very well affect the vaccinated part of the population",
            "title_similarity": "0.7426052",
            "sentiment_compound": -0.4951
        },
        {
            "id": "h6mdizo",
            "score": 3,
            "text": "\"Vaccination status is highly correlated to political affiliation.\" I guess blacks and hispanics were secretly trump supporters then",
            "title_similarity": "0.61040366",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6m2r0m",
            "score": 5,
            "text": "You're factor \"Vaccination status is highly correlated with political affiliation\" is incredibly concerning ethically. It's true but the fact that this seems to be a motivator for you suggests that you value people's lives less because of their political affiliation. One's beleifs do not make their life less valuable.",
            "title_similarity": "0.6636439",
            "sentiment_compound": 0.8276
        },
        {
            "id": "h6l9byh",
            "score": 8,
            "text": "The vaccine isn’t guaranteed to be effective against all variants.  So far it has proven to be effective.  However, that could all change if covid is allowed to spread then adapt or mutate to become resistant to the vaccines.  This would then mean that even people who have been vaccinated would no longer have protection against covid.",
            "title_similarity": "0.7713015",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h6lhp3y",
            "score": 7,
            "text": "Personally I think once children can and see vaccinated we will see a big shift. It would also be interesting to know the percentage of people who can’t get the vaccine due to health reasons. I know two pregnant people and two people with cancer, with all four their doctor recommended the vaccine and they did",
            "title_similarity": "0.70439035",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h6lybsu",
            "score": 10,
            "text": ">The vaccines have proven effective with no long-term side effects\n\nIt’s been less than a year that we’ve had the vaccine, so we don’t know whether or not there are long term side effects. I personally don’t believe there will be any, but saying that there are none and that it is guaranteed to be safe is incorrect.",
            "title_similarity": "0.52222705",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6lptjl",
            "score": 13,
            "text": "Shouls insurance companies also be able to deny coverage based on someone who smokes/drinks alcohol or does not follow an optimal workout/diet/sleep program?\n\nThese things have a much more serious impact on your health status than a covid vaccine does",
            "title_similarity": "0.7515227",
            "sentiment_compound": -0.6253
        },
        {
            "id": "h6m3w05",
            "score": 43,
            "text": "> I would even go so far as to say we should allow insurance companies to deny them medical coverage. If they want to take their chances with the virus, that's their right, and we should let them.\n\nI think this is a dangerous view. It would justify insurers to deny medical coverage for any medical condition that is preventable. Are you willing to just let all smokers die? Deny IV drug users organ transplants? Refuse to treat an obese person having a heart attack or in a diabetic crisis? I'm not sure that's the kind of healthcare system you want to see.",
            "title_similarity": "0.8545087",
            "sentiment_compound": -0.9313
        },
        {
            "id": "h6l73yt",
            "score": 1,
            "text": "But if we allow people to go unvaccinated that would result in more deaths even if others are vaccinated.",
            "title_similarity": "0.74155986",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h6l8nav",
            "score": 1,
            "text": "lockdowns and restrictions have nothing to do with bodily autonomy.  How do variants of a virus come into existence and can you name me all the vaccines that give 100% protection?",
            "title_similarity": "0.6986581",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6l9gm0",
            "score": 2,
            "text": "If we simply allow people to become sick with impunity, they will eventually make their way into the healthcare system and do two things:\n\n1. Consume resources that could have otherwise be used for other patients.\n\n2. Raise the cost of care for everyone else because now medical resources are more scarce.",
            "title_similarity": "0.65984786",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6lcfll",
            "score": 2,
            "text": "It's more of the strain on the Healthcare system that would bring back restrictions",
            "title_similarity": "0.60428107",
            "sentiment_compound": -0.1189
        },
        {
            "id": "h6lhfxt",
            "score": 3,
            "text": "I would agree with you if the infected weren’t Petri dishes for new variants that would require new vaccines.",
            "title_similarity": "0.7424906",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6ll2mi",
            "score": 3,
            "text": "I think I agree in parts - but all things in measure. One very valid position is that by not locking down and allowing mass community transmission (transmission between vaccinated people is still a thing, the virus doesn't show any symptoms but you can still be contagious) you are promoting the evolution of further, more effective variants, that could bring deaths back up and render vaccinations useless.\n\nControlling covid is difficult, and I think by ruling out the re-imposing of lockdowns/restrictions we are doing ourselves a disservice. Hopefully, we won't need to lockdown again. But by ruling out locking down all together we could well be in a worse position.\n\n> The Devil we know (Delta primarily) is better than the Devil we Don't know.\n\nMy point mainly hinges on the more delta cases that are out there, the quicker and more likely it is that more deadly/vaccine-resistant variants emerge. Keeping Delta numbers as low as possible is in our interests, even if vaccines help reduce the damage that the virus does at the moment.",
            "title_similarity": "0.7959813",
            "sentiment_compound": -0.8924
        },
        {
            "id": "h6lm9nx",
            "score": 3,
            "text": "I think this is valid so long as the hospitals are not overwhelmed. Which they currently are not. \nIf they get overwhelmed then it could affect other non-covid patients.",
            "title_similarity": "0.62894857",
            "sentiment_compound": 0.0134
        },
        {
            "id": "h6lop5j",
            "score": 2,
            "text": "A month after the vaccine has full FDA authorization stop funding Covid treatments for the unvaccinated. Insurance Companies are not going to pay out for preventable medical expenses. It’s funny how these people are comfortable with socialized healthcare",
            "title_similarity": "0.7276344",
            "sentiment_compound": 0.6481
        },
        {
            "id": "h6lpq98",
            "score": 4,
            "text": "I would agree if it weren't for the fact that these people being infected means that new strains can mutate and make vaccines less efficient.",
            "title_similarity": "0.72098684",
            "sentiment_compound": -0.101
        },
        {
            "id": "h6lqu4l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6lqww0",
            "score": 2,
            "text": "Kinda depends on your definition of restrictions. It's within the government's purview to deny you services based on your vaccine status. Once the FDA gives non provisional approval to the vaccines, I assume it'll be added to the long list of vaccines needed to e.g. work at or attend a school. Is this an unneeded restriction?\n\nThe flip side of this is government-run mass transit systems where they also have a duty same as any other business to protect their workers, who may be living with immunocompromised relatives. Its very possible to get Delta COVID even when you're vaccinated. Is this an unneeded restriction?\n\nI'll remind everyone too that dying isn't the only bad outcome to COVID. Hospitalization is of course very bad. The \"long COVID\" symptoms are still something we don't know much about and it can be awful to lose your sense of smell or continually experience this brain fog we keep hearing about.",
            "title_similarity": "0.8342903",
            "sentiment_compound": -0.7847
        },
        {
            "id": "h6lss69",
            "score": 1,
            "text": "My father, a heart transplant recipient, has already been told by his transplant team not to expect the effects of the vaccination to last long due to the immune suppression drugs he needs to take to keep his heart and the rest of his body compatible.\n\nMy father, and so many like him, are an acceptable loss to folks who believe in your view. They believe the vaccination is a personal choice.\n\nBut it's not. Your choice to vaccinate or not vaccinate affects your family, your friends, and everyone in the community in which you come into contact with.  A choice not to vaccinate is a choice not to care about your responsibilities to the larger society.",
            "title_similarity": "0.7402452",
            "sentiment_compound": 0.8125
        },
        {
            "id": "h6lsxyl",
            "score": 2,
            "text": "1. Viruses mutate.\n\n2. People who are medically incapable of receiving the vaccine exist.",
            "title_similarity": "0.6580225",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h6lt841",
            "score": 2,
            "text": "While part of me agrees. The other part thinks that is a disservice to those that for whatever reason can't get a vaccine. \n\nAlso the number of hospital resources it will occupy, upping the risk to us all.",
            "title_similarity": "0.7164425",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ltuyi",
            "score": 1,
            "text": "If you don't care about carrying the virus and infecting other people that are at risk (and may even have had the vaccine), and potentially killing them then sure. If you care about not killing strangers then no. That is your own moral choice to make. However, a government is looking out for the population as a whole.",
            "title_similarity": "0.813434",
            "sentiment_compound": -0.0289
        },
        {
            "id": "h6ltvig",
            "score": 1,
            "text": "Allowing people to go unvaccinated affects other people.\n\nAlso the people who wish to protect themselves but still have to go to work with unmasked, unvaccinated people, are still at risk and would still die too.\n\nSo...it's not really doing anything.",
            "title_similarity": "0.62688893",
            "sentiment_compound": -0.7469
        },
        {
            "id": "h6ltyfq",
            "score": 1,
            "text": "More people infected means a greater chance of the virus mutating into something that the vaccines do not protect against.",
            "title_similarity": "0.71789277",
            "sentiment_compound": -0.2875
        },
        {
            "id": "h6lu9pz",
            "score": 1,
            "text": "I was just thinking this. It feels cruel but these people are impossible to reach and they do not care if their poor choices affect others. Let them die.",
            "title_similarity": "0.5906726",
            "sentiment_compound": -0.945
        },
        {
            "id": "h6lvb7d",
            "score": 2,
            "text": "Something to keep in mind is that the more widespread the virus is, the more chances it had to mutate. With widespread vaccines the selection between the new strains will be more on their ability to bypass vaccine immunity rather than straightforward ability to spread. Thus when 50%+ people are vaccinated is precisely the time to wrap up the mass epidemic asap without giving the virus the chance to adapt",
            "title_similarity": "0.7641301",
            "sentiment_compound": 0.5748
        },
        {
            "id": "h6lvbwd",
            "score": 1,
            "text": "I couldn’t see this point being brought up but another reason why we should further try and contain contagion is the mutations. The further the virus spreads, the more likely it is that it will further mutate into variants that our current vaccines do not protect us from, despite being shown effective against the current mutants (e.g. the delta variant). Contagion among the unvaccinated will provide further opportunity for the virus to mutate in a way that will make all currently fully vaccinated people vulnerable again.",
            "title_similarity": "0.7999315",
            "sentiment_compound": -0.9209
        },
        {
            "id": "h6lwg8m",
            "score": 1,
            "text": "i havent seen anyone up top mention new variants. allowing the virus to spread even just among the unvaccinated increases the likelihood/timetable that new strains that the current vaccine wont work on may develop.\n\nthe main point youre stating is that if they want to die, thats their choice, and its ok because no one else is affected by it. but thats just not true, for a multitude of reasons.",
            "title_similarity": "0.80785847",
            "sentiment_compound": -0.7002
        },
        {
            "id": "h6lwqpc",
            "score": 1,
            "text": "I'd be for this if it wouldn't make hospitals overflow with Covid patients and if the vaccine was 100% effective and if it wouldn't lead to new variants. \n\nThe risk is it leading to new variants and hospitals not being able to handle all anti-vax infected.",
            "title_similarity": "0.75265825",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6lwyuj",
            "score": 1,
            "text": "I mean you can't just pretend those \"caveats\" aren't part of society and that they wouldn't be part of any choice for new lockdowns or restrictions. That would be like saying we never should have had restrictions in the first place then saying \"obvious caveat of those 30 and up\".",
            "title_similarity": "0.69313943",
            "sentiment_compound": 0.4207
        },
        {
            "id": "h6lx5zt",
            "score": 1,
            "text": "Nah. Collective punishment is what we need to unite us as a country again. \n\nAll joking aside, we don't need them taking up beds in hospitals.",
            "title_similarity": "0.65417624",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6lyxmb",
            "score": 1,
            "text": "Allowing a larger breeding ground for corona to multiply that also are large enough to not be islands of population, you increase the number of replications over time, which increases the number of mutations over time, which increases the chance of a new variant occurring.\n\nWe know what this virus is capable off, but we don't know that for a future variant.",
            "title_similarity": "0.53972685",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h6lzb41",
            "score": 2,
            "text": "Some people can't get vaccines and could die because of this. It's as simple as that.",
            "title_similarity": "0.6520382",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h6lzjrn",
            "score": 1,
            "text": "I agree with this take. I ultimately believe as a society and a species we have a moral right to protect our weakest and most vulnerable members of our society, but we’re experiencing what I would call a culture war right now. We live in a word where nearly half the population thinks covid is either not a big deal or a hoax and who have basically been living their life as if a pandemic wasn’t occurring around them. I acknowledge and fucking hate the fact we are in this position because the government and politicians have failed these people. They failed to educate them adequately and now intelligence is valued even less in these communities. These people have fallen victim to fake news and bullshit Facebook pseudo science. So even though I ultimately don’t blame them for the beliefs the fact remains that they pose an enormous threat to our society. So to that end I agree that they should take the risk and whatever consequences may befall them. I’m extremely sympathetic to the causalities, but we can’t keep our economy fucked and our lives on hold for these mouth breathing idiots who really don’t care if you live or die anyways. So honestly, fuck em because at this point I think it’s for the greater good of society to allow these people make their choices and to face the consequences aloud their choices. They aren’t going to change their minds until something like this directly effects them so I think it’s win win. They either die or learn.",
            "title_similarity": "0.69410133",
            "sentiment_compound": -0.9781
        },
        {
            "id": "h6lzxbx",
            "score": 2,
            "text": "You would deny medical coverage for someone who has chosen no vaccine Vs vaccine when the two risks aren't calculable?  We're guessing at the risks, and if you're young and healthy, both may round to zero. If it turns out that five years after you get one of the vaccines you suffer some illness as a result, do you then get turned down for treatment because you guessed wrong?",
            "title_similarity": "0.71348405",
            "sentiment_compound": -0.9295
        },
        {
            "id": "h6m00qc",
            "score": 1,
            "text": "Doesn’t seem very fair to immunocompromised people and children who will get covid due to unvaccinated people’s carelessness. I would agree with you if we put all the unvaccinated people who CAN get a vaccine (without any health issues) on an island in isolation from everybody else but that’s not the world we live in, at all.",
            "title_similarity": "0.77155733",
            "sentiment_compound": -0.0009
        },
        {
            "id": "h6m03r8",
            "score": 1,
            "text": "\"What if everyone thought like that?\"\n\nThen I'd be a fool to think any other way.",
            "title_similarity": "0.49920273",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h6m0mkm",
            "score": 1,
            "text": "There has not been enough study to no if there are no long term side effects. There has been 2 made by Johnson and Johnson that have had major side effects. It was overly rushed. It will be the next adds you see instead of mesothelioma.",
            "title_similarity": "0.5894148",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h6m0z4g",
            "score": 2,
            "text": "You list “caveats” for people who have a reason not to be vaccinated, yet you somehow forget that just because they have a reason not to be vaccinated, doesn’t mean they’d be immune from death. If we open up the whole country, the people dying won’t just be people who chose not to get vaccinated, but everyone who *can’t* get vaccinated. God dammit, death doesn’t discriminate. If you stick to this stance, you have to accept that not only would you be letting lots of unvaccinated pricks die, but also unvaccinated *vulnerable* sick people who don’t deserve to die just so you can satisfy your fantasy of natural selection.",
            "title_similarity": "0.85420895",
            "sentiment_compound": -0.9413
        },
        {
            "id": "h6m126f",
            "score": 1,
            "text": "Your first _obvious caveat_ is a complete contradiction of the rest of your post.\n\nThe ability of government to care for those who can't get the vaccine is limited to things like lockdown restrictions since the vaccine itself can't be forced upon anyone. We all have to live with the decisions made by anti-vaccers, no matter how ill informed they may be. If that means we get shut in and can't go out, that sucks but it's part of living in a developed society... idiots and all.",
            "title_similarity": "0.77841073",
            "sentiment_compound": 0.1538
        },
        {
            "id": "h6m12gr",
            "score": 1,
            "text": "No",
            "title_similarity": "0.090345696",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6m1gog",
            "score": 1,
            "text": "I think there are a few things here to consider:\n\n- Having high covid case numbers puts a heavy burden on the medical system. This may mean there are less resources for people with other health emergencies.\n- There are other options than just lockdown vs no lockdown. For example indoor mask mandates help reduce the spread and still allow people a mostly normal life.\n- Vaccines are very effective but they aren't 100% effective. Allowing the disease to freely spread means more vaccinated people will get sick. And it also increases the chances of creating more variants that the vaccine may be less effective against. Vaccines work best when given to as many people as possible, that way they can completely suppress the spread of the disease.",
            "title_similarity": "0.71547055",
            "sentiment_compound": 0.9105
        },
        {
            "id": "h6m1lws",
            "score": 5,
            "text": "I’m an immune compromised person who is also pregnant. I had Covid early in the first wave, and had it a second time recently during my pregnancy. It’s been two months, and I’m still going in and out of the hospital, on my fifth round of antibiotics fighting the secondary pneumonia.\n\nI quarantined, masked, and my husband got vaccinated before I got sick the second time. The only reason I did not get vaccinated was because I discovered my pregnancy days before my first injection and delayed per my physician’s recommendation. It has been the plan for me to get vaccinated as soon as my symptoms subside—but that has not yet happened and Im now six months into my pregnancy.\n\nHere are my issues:\n\nNatural immunity does not prevent reinfection. In fact, it is not uncommon for reinfection to be a worse illness than the first. This was true for me. While the first experience with Covid was like a very severe flu followed by months of malaise, my second bout landed me in the hospital. I concede that the increased severity was impacted by my pregnancy, but my doctors have observed this more severe second infection in healthy people as well.\n\nDue to my location in a community high in Covid denial, not only are vaccination rates <20%, but people are actually downright cruel to those who mask. These people lie about being symptomatic with anything, and continue to live as normal even if they are testing positive for Covid. This has resulted in higher rates of cold, flu, and other communicable diseases. My extended family was coming into my home and sharing water bottles with my child—despite my pleas for them not to—WHILE they KNEW they were infected and didn’t tell us because it was “just a cold.” I wasn’t the only member of the family to end up hospitalized, but it did not change anyone’s attitude about the virus or it’s severity. In fact, they blamed my husband for the sickness, insisting that he was “shedding” a “biological weapon” by getting the vaccine.\n\nThe idea that we can protect vulnerable people by locking us up and letting the conspiracy theorists dominate public spaces is not grounded in reality. I haven’t even been going to the grocery store and am deep in depression from having so little social contact, and I still ended up seriously ill. And now I’m going to a hospital multiple times per week for treatment, getting exposed to everything imaginable. I can think of no other time in my life that I’ve had so may unique respiratory illnesses in a single season. \n\nI do not know the answer to this major predicament we’re currently facing. We cannot force individuals in the general population to get vaccinated, but we can require hospital workers, government workers, and private employees to do so to keep their jobs, and that’s a start. Right now, those refusing to get vaccinated perceive no negative consequences for their ideological hard-lining. Right now, the social approval from within the group is a positive feedback mechanism. While we can’t take away their choices, we need to do more to make them feel the consequences of their own actions. Some things we can’t enforce by law, but we can make the social consequences unsustainable. \n\nUltimately, this is a political issue as much as a public health crisis. It’s an ideological battle that will not be over any time soon. While I agree that it’s a tough puzzle, I do not believe that the answer is to just lift all restrictions and let business continue as usual. We will end up with nastier strains, and the medical system—which is already bleeding out—will become so crippled that even routine care will be impacted and we’ll have an increase in non-Covid deaths as well. Medical events as common as childbirth have now become high-risk, when they shouldn’t have to be.",
            "title_similarity": "0.59389824",
            "sentiment_compound": -0.983
        },
        {
            "id": "h6m1vn5",
            "score": 1,
            "text": "My children are under 12 and cannot be vaccinated. We still mask up, but we can't avoid all the unvaccinated.\n\nAdditionally, every additional infection runs the risk of creating further variants which may not be targetable by the current vaccine. They could be much worse. I believe that the delta variant is mostly covered, but no guarantee for the next one or the one after that or the one after that. We should try to nip this now.\n\nThese two reasons should show us that it's not up to personal choice.",
            "title_similarity": "0.7948497",
            "sentiment_compound": -0.5828
        },
        {
            "id": "h6m2nsm",
            "score": 1,
            "text": "Do you also think that someone who rides a motorcycle without a helmet and gets into an accident should be denied medical care?",
            "title_similarity": "0.6142302",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6m38f5",
            "score": 1,
            "text": "problem is that the people who won't take the vaccine will a) cause more variant mutations to develop for covid and b) will cause the virus to spread among the vaccinated anyway  \n\n\nnot to mention that if you don't make people prove that they've been vaccinated, they could be lying and just spread the virus among people when they go outside  \n\n\ni don't mind these people suffering the consequences of their refusal at this point, but i don't want other people paying the price for it either.  so i think we should go even HARDER.  no lockdowns, no masks, but you need to prove your vaccination status everywhere you go, and after a certain time and you don't get vaccinated you're paying fines or worse.  i think its time to stop playing softball with a group of people that will never listen to whatever reasonable plea you give",
            "title_similarity": "0.80591154",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h6m3ff7",
            "score": 1,
            "text": "Your opinion is self-perpetuating.\n\nThe reason it's becoming endemic, is because people won't grow the fuck up, and get vaccinated.  Until they do...it'll keep coming back around as a new variant, creating the need to get re-vaccinated, over and over again.  Which they will also refuse to take...wash, rinse, repeat, etc.\n\nAll these so-called \"anti-vaxxers\" are doing the pharmaceutical industry a giant favor.  What could have been just a one-off wind-fall, is now looking to be a long-term, perpetual profit booster for them.  They think they're standing up to the industry...but all they're doing is guaranteeing them massive annual profits, indefinitely.",
            "title_similarity": "0.7684896",
            "sentiment_compound": 0.8847
        },
        {
            "id": "h6m3ix2",
            "score": 1,
            "text": "You acknowledge that medical care for children should be covered, but you fail to consider that they shouldn't be infected at all. What if they die because they can't be vaccinated? Or suffer long-term issues?\n\nMask mandates and shutdowns at this point aren't to protect the selfish who choose not to be  vaccinated, they're for kids and the immunocompromised, so that they don't get sick at all.",
            "title_similarity": "0.7513401",
            "sentiment_compound": -0.9436
        },
        {
            "id": "h6m42r8",
            "score": 1,
            "text": "So wrong. Such utter nonsense",
            "title_similarity": "0.20000663",
            "sentiment_compound": -0.7496
        },
        {
            "id": "h6m471f",
            "score": 1,
            "text": "Except this is not fair to as you say \"Children, Pregnant Women, and those with legitimate medical condition preventing vaccination\". If they can't take the vaccine they rely on others to take the vaccine.  Also, a large enough mass of unvaccinated people can endanger those who are vaccinated because presented with a large enough viral load even those who have been vaccinated can suffer from a breakthru infection.  \nNo individual moving about in society is biologically isolated from others, the group organism can be threatened by a large enough group of individuals refusing to participate in the vaccination program.  \nAdditionally the long the virus remains active and the more times it is able to replicate that increases the chance for mutation and yet another more dangerous strain of the virus. Unless you can get all these unvaccinated people to go live together on an isolated island we can not biologically uncouple ourselves from them.",
            "title_similarity": "0.8154733",
            "sentiment_compound": -0.9454
        },
        {
            "id": "h6m4lcu",
            "score": 1,
            "text": "I’m more concerned about the healthcare professionals who are burdened with providing care for the unvaccinated. It is unfair to them.",
            "title_similarity": "0.5704782",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h6m4srp",
            "score": 1,
            "text": "This is how you make a super virus. What you're suggesting would massively speed up the appearance of new variants.",
            "title_similarity": "0.49845815",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6m5gxe",
            "score": 3,
            "text": "When I had cancer, the radiologist told me the possible side effects, but I still went forward because I considered the alternative; death.",
            "title_similarity": "0.6876729",
            "sentiment_compound": -0.8422
        },
        {
            "id": "h6m5t73",
            "score": 1,
            "text": "Unfortunately, there's a couple problems with this.\n\n1. There are a significant number of people out there that actually can't get vaccinated right now. Kids under 12 can't get it but they can still catch Covid, albeit at reduced numbers and risk.\n\n2. The ignorant people who choose to risk getting infected or dying still present a danger to vaccinated people down the line. The virus mutates into deadlier variants in these people. This could lead to a version of Covid that is resistant to the vaccine in the future.\n\nThis issue leaves us with 2 options. We can carry on as normal and wait for a Covid variant deadly enough to kill the ignorant more than infect them (and risk losing millions of vaccinated people's lives). Or, we can work to mitigate the spread again so that the virus doesn't mutate.\n\nThe latter solution presents its own challenges, of course. But for my money, keeping more people alive is a lot easier and safer compared to the former option.",
            "title_similarity": "0.7216221",
            "sentiment_compound": -0.9611
        },
        {
            "id": "h6m6ovf",
            "score": 3,
            "text": "As soon as you add denial of basic social services (your example of insurances denying coverage) its not exactly a free choice anymore is it? \nHow come we accept us all collectively polluting our environment and hence shortening our life spans? People die earlier when exposed to noise (such as encountered in cities) and stress… how come dioxins or other life shortening factors and choices (alcohol which may kill more people than COVID-19?) are accepted but COVID is now considered like something as serious as the plague? As long as we are willing to accept eG alcohol consumption or dioxin pollution, then not getting a COVID-19 shot should be absolute free of consequences - same as maybe we deal with the flu vaccination.",
            "title_similarity": "0.8093456",
            "sentiment_compound": 0.5513
        },
        {
            "id": "h6m6ozu",
            "score": 1,
            "text": "So a couple months of data is considered long term now?",
            "title_similarity": "0.17293851",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6m72vd",
            "score": 2,
            "text": "I would agree but you’re not choosing only for\nYourself…you’re choosing for the people you could be infecting also. So this is in no way a my actions don’t affect anyone else situation.",
            "title_similarity": "0.63913965",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h6m741j",
            "score": 1,
            "text": "I think there are things that can be done short of allowing the unvaccinated to become infected and/or die. One thing that has not been done to a large degree is requiring vaccination as a condition for doing certain activities where contact with large groups of people in close proximity is unavoidable, i.e., vaccine passports. \n\nThat conversation has been a non-starter but we may reach a point where we have to design the choice architecture so that those who do not want to be vaccinated must receive the vaccine as a condition to participate in all that society offers. \n\nOf course we as a society should not force anyone to do anything to their body but I believe we can legally restrict what is available to you based on your choice. There is legal precedent in the US Constitution (I'm speaking from a a US-centric point of view here) that when your personal choices endanger the general welfare of others then your personal freedoms can be curtailed, e.g, the right to freedom of speech does not allow me to shout \"Fire!\" in a crowded theatre and endanger the safety of others. So there is legal precedent.\n\nThink vaccine passports, as unpopular and contentious as they may be, are less extreme than simply allowing people infected and possibly die and are an option that has not been really explored yet.",
            "title_similarity": "0.8142529",
            "sentiment_compound": -0.8238
        },
        {
            "id": "h6m895l",
            "score": 1,
            "text": "The biggest problem I see, is that the longer we let it spread in any communities the more variance there will be, which our vaccines will be less effective at preventing. Trust me, I sometimes do wish we could just let the anti-vaxers fend for themselves.\n\nI worry with how few vaccines so many countries have, that we'll never be able to get rid of covid because it'll mutate all the time and stick around like a deadlier flu.",
            "title_similarity": "0.78592795",
            "sentiment_compound": 0.5058
        },
        {
            "id": "h6m8phz",
            "score": 2,
            "text": "This affects kids that don't get a say in the matter, and we don't just get to let kids die.",
            "title_similarity": "0.60026395",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6m9jsy",
            "score": 1,
            "text": "Some people who are immune compromised cannot get vaccinated.",
            "title_similarity": "0.5159285",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6m9mkj",
            "score": 1,
            "text": "“Children, Pregnant Women, and those with legitimate medical conditions preventing vaccination should be cared for and protected within reason, provided all medical care necessary, etc.”\n\nI would say that it is within reason to have lockdowns in places with a high volume of COVID cases. People in this country are not guaranteed healthcare, so risking the health of others is not just about if they die or not. Infections where people survive a hospital stay could bankrupt a family extremely easily. Every case needs to be treated as potentially life destroying and if people remain unvaccinated then we need to keep masking, socially distancing, and locking down as advised by medical professionals and epidemiologists until they are.",
            "title_similarity": "0.81382525",
            "sentiment_compound": -0.5571
        },
        {
            "id": "h6m9wsb",
            "score": 1,
            "text": "No FDA approval combined with the inability to sue if something goes wrong... I'll wait a little longer.",
            "title_similarity": "0.55955184",
            "sentiment_compound": -0.8609
        },
        {
            "id": "h6ma7kr",
            "score": 2,
            "text": "The unvaccinated pose a huge threat to children and elderly many of who cannot be vaccinated for various reasons. These individuals should be allowed to catch it and if so, die without assistance by medical professionals.",
            "title_similarity": "0.7457708",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h6mabev",
            "score": 3,
            "text": "The number of unvaccinated is too high to just “let it be.”\n\nIf the unvaccinated all die we fuck the economy because there will be too few people moving it. It will also allow variants to evolve and potentially start infecting the vaccinated at high rates. \n\nThere are GOOD reasons why we should encourage vaccinations.",
            "title_similarity": "0.7494283",
            "sentiment_compound": 0.186
        },
        {
            "id": "h6maer9",
            "score": 1,
            "text": "I'd feel very bad for the children who really want to get vaccinated but their anti vaxx parents wont let them... and then those children die.",
            "title_similarity": "0.66282684",
            "sentiment_compound": -0.886
        },
        {
            "id": "h6masil",
            "score": 1,
            "text": "As a person who did not want the Covid vax due to ongoing revelations of safety issues, unknown long-term fallout, and minimal Covid complication risk for my age group, I agree with the your title. \n\nYou’re also a fascist dumbass",
            "title_similarity": "0.7201311",
            "sentiment_compound": -0.6395
        },
        {
            "id": "h6mb0sa",
            "score": 1,
            "text": "My gf is on anti cancer meds that duck up her immune system.  She’s vaccinated but not protected.  Now we can’t even go grocery shopping because all stores removed mask requirements.  \n\nIt’s not just the trumptards at stake here.",
            "title_similarity": "0.7525605",
            "sentiment_compound": -0.7058
        },
        {
            "id": "h6mbsep",
            "score": 1,
            "text": "The issue is they put us at risk.",
            "title_similarity": "0.3674751",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h6mbxi9",
            "score": 1,
            "text": "Thank God Reddit is not representative of the majority of the population.",
            "title_similarity": "0.5383265",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6mcbpa",
            "score": 6,
            "text": "We all take different risks every day and make autonomous decisions that can affect our health. Are we going to deny healthcare to drug addicts, alcoholics or people who speed on the highway? If you wreck your car while driving selfishly for pleasure while endangering someone’s life should we lock you up for reckless endangerment? I understand your reasoning but it is extreme and if we apply it to people who don’t want to take an emergency experimental vaccine with unknown long term side effects (even though we think they are safe - just like the scientists said DDT was safe).",
            "title_similarity": "0.79309916",
            "sentiment_compound": 0.7149
        },
        {
            "id": "h6mcfb0",
            "score": 2,
            "text": "I honestly believe at this point that if you refuse the vaccine and then get covid you shouldn't be treated",
            "title_similarity": "0.728491",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6mcvc9",
            "score": 1,
            "text": "In the unlikely event I get COVID, I'll be glad I just got a mild fever and a cough rather than risking dying from a side effect of the vaccine (which would be twice as likely to happen compared to dying from COVID).\n\nAlso, fuck the government.",
            "title_similarity": "0.77605426",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6mcx5c",
            "score": 1,
            "text": "https://www.seattletimes.com/seattle-news/covid-19-now-a-pandemic-of-the-unvaccinated-not-so-fast/?utm_source=marketingcloud&utm_medium=email&utm_campaign=Morning+Brief+7-26-2021_7_26_2021&utm_term=Active+subscriber&fbclid=IwAR16VQfb4K3dc2DBjgP2cqFyimsk1RrHIIchoZGLcBdMGNU4tNCN9vMXdAs",
            "title_similarity": "0.5648751",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mdwph",
            "score": 2,
            "text": "The pandemic is being driven primarily by those who not vaccinate *and* will not mask or avoid gatherings. Holding that position is morally indefensible.",
            "title_similarity": "0.74660623",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h6mev9c",
            "score": 1,
            "text": "It's not as simple as just allowing people to live (or die) with the choices they make. So long as the virus is circulating, it will mutate, and the next variant could be the one that isn't protected by the vaccine. I'd also hate to have a medical emergency delayed because the hospital is overwhelmed with COVID patients.",
            "title_similarity": "0.82111174",
            "sentiment_compound": -0.9232
        },
        {
            "id": "h6mewmk",
            "score": 2,
            "text": "I have a two year old who doesn't get to make this \"choice\".\n\nHope I don't kill him at my new job tomorrow. 👀",
            "title_similarity": "0.53995454",
            "sentiment_compound": 0.7676
        },
        {
            "id": "h6mexqm",
            "score": 1,
            "text": "That's not how it works. They could still infect others. This would only work if:\n\n1. Everyone who is not vaccinated gets tested regularly. \n\n2. Everyone with a positive test is put under quarantine.\n\nAnd even then a hospitalization would require unnecessary ressources and money, as well as put more people in unnecessary risks. One could even argue they do not deserve to be hospitalized for COVID related complications at all.",
            "title_similarity": "0.809131",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6mff6v",
            "score": 1,
            "text": "Children still aren’t vaccine eligible. And I really don’t think I can stomach another year of homeschooling 4 kids. I will make several hundred dollars of donations monthly  for PPE to a school, but I’m not a good teacher.",
            "title_similarity": "0.4998834",
            "sentiment_compound": -0.4782
        },
        {
            "id": "h6mfkpp",
            "score": 1,
            "text": "JFC you have issues",
            "title_similarity": "0.18269186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mgx6x",
            "score": 3,
            "text": "You position ignores a huge segment of the population and is insanely myopic. \n\nBeing a society that *generally* values human life, and *generally* believes everyone has the right to healthcare. We are still going to try and save those people. Which means our hospitals are going to fill again with highly contagious people, and a very possibly fatal respritory virus. In your opnion sure whatever let them die. Unfortunately they will not be the only people in the hospital, anyone who is immuno-compromised, also greater risk, other patients, healthcare workers, visitors, vendors, regular employees. All at greater risk, vaccinated or not, simply by going to work. Remote work not a realistic option for most hospital employees. \n\nThis doesn't even begin to address the toll on mental health for healthcare workers, we are just beginning to witness the loss of nurses, respritory care, and doctors. Many attribute it to abuse, depression, and burn out. None of thse professions os something you want just anyone in, nor ate they 6 months of ojt and you are good. The US was looking at a shortage of healthcare workers before the pandemic.",
            "title_similarity": "0.7951441",
            "sentiment_compound": -0.8545
        },
        {
            "id": "h6mhcsk",
            "score": 1,
            "text": "*laughs in dead fully vaccinated people*",
            "title_similarity": "0.4528257",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h6mhmtp",
            "score": 2,
            "text": "Cool.\n\nThanks for wanting us healthcare workers to be swamped and constantly at risk for breakthrough cases.\n\nAlso, we all really want to see even more people die. /s",
            "title_similarity": "0.65841234",
            "sentiment_compound": -0.1243
        },
        {
            "id": "h6mhpix",
            "score": 2,
            "text": "We do this with the flu. Eventually we will get to your point. People will weigh their risk individually, and we as a society will deal with the consequences. I do however believe we should continue promoting vaccinations like we do with other diseases we have vaccines for.",
            "title_similarity": "0.76154846",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6mhzsg",
            "score": 1,
            "text": "This gives me eugenics vibes:/",
            "title_similarity": "0.31716913",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mju8c",
            "score": 1,
            "text": "That's a really ironic opinion to have considering allowing the free spread would cripple our health systems and cost tax payers billions when we could just institute universal healthcare and reinvest all the debt coming from people dying. Then maybe we could have less selfish people running around doing things that ruin economies because they can't see that doing the right think is just being careful and considerate for once in there live. \n\nOr you know we could just sacrifice everyone's life and let even more variants spread so that we can just keep killing people directly effected by people with opinions like you no matter how hard they tried to protect themselves.",
            "title_similarity": "0.76061964",
            "sentiment_compound": -0.5959
        },
        {
            "id": "h6mk3gj",
            "score": 3,
            "text": "I like the sentiment, but I live with a 7 year old who can't yet be vaccinated sure to his age.  While it's likely that he'll recover if he contacts the virus, there is the risk of it messing him up for life.  We live in a strong anti-vax area with severe growth, and his school district is no longer enforcing any restrictions.  This has is terrified, and we're hoping the vaccine is approved for children soon.  But, unless we want to homeschool him for the entire year, we don't have much choice.\n\nFuck letting people die 'per their wishes'.  They aren't the only ones they effect.",
            "title_similarity": "0.7153014",
            "sentiment_compound": -0.631
        },
        {
            "id": "h6mk7ei",
            "score": 2,
            "text": "The problem is they infect others. If it was just them killing themselves, fine I agree. But they go into work with it and cough on the secretary who's a mother, then she dies. Not cool.",
            "title_similarity": "0.59589267",
            "sentiment_compound": -0.5917
        },
        {
            "id": "h6mksrr",
            "score": 1,
            "text": "I’ve taken care of me and mine, whatever happens outside of my family is not my business.  Will I help those who want it?  Absolutely, but I’m not going to waste my time trying to make camels drink.\n\nI’ve done all I can to a reasonable degree.",
            "title_similarity": "0.5407176",
            "sentiment_compound": 0.7268
        },
        {
            "id": "h6mlnup",
            "score": 2,
            "text": "I think you are correct, Covid is probably here to stay. I’m unsure if it matters if everyone in the US is vaccinated or not.  I’m vaccinated and support it,  but I think the variants are going to keep coming out of other countries that have even lower vaccination rates.  Vaccines are tool in the fight against the virus but probably won’t be able to stop it alone.   Also, I don’t think punishment or calling people idiots, etc. is going to change any minds, probably only strengthen their position.",
            "title_similarity": "0.75055957",
            "sentiment_compound": -0.9091
        },
        {
            "id": "h6mmw0x",
            "score": 1,
            "text": "I have a family friend who underwent a heart transplant. In order to be even on the transplant list he had to be on deaths door. And he was. For 2 years he was stuck in a hospital room, his organs constantly failing, and never knowing if he would leave that tiny sterile room again. Now he finally received his new heart and immediately he is stuck indoors again. He can not leave his home and his body will not tolerate the vaccine. Only once the overwhelming majority of us are vaccinated can he step back outside. Please, do it for him. Do it for all those like him.",
            "title_similarity": "0.5713737",
            "sentiment_compound": 0.8764
        },
        {
            "id": "h6mn1x1",
            "score": 1,
            "text": "And they will be the population that generates variants and eventually a variant that does not respond to the vaccine and we will all be back to square one.  The more people it is allowed to circulate in, the more likely we will get variants.  They may not die, but someone else will and more people will get sick.",
            "title_similarity": "0.7506448",
            "sentiment_compound": -0.5231
        },
        {
            "id": "h6mn4p4",
            "score": 1,
            "text": "Almost like you're starting to grasp the idea of choice",
            "title_similarity": "0.1341353",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h6mnk30",
            "score": 1,
            "text": "You are writing from the perspective of an adult who can get the vaccine. \n\nThere are other categories of humans.",
            "title_similarity": "0.5896747",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mnp68",
            "score": 1,
            "text": "We allow people to kill themselves via tobacco consumption...\n\nSo it's obviously not about safety.",
            "title_similarity": "0.67950827",
            "sentiment_compound": -0.7296
        },
        {
            "id": "h6mnvpb",
            "score": 1,
            "text": "The current vaccine is 61% ineffective against the Delta covid variant.  \n\n#fact",
            "title_similarity": "0.5703787",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6mny7c",
            "score": 1,
            "text": "The main problem is the potential strain it will put on the economy and on our healthcare system. Having millions of people die is not good for any country, and having an already underequipped and essentially burnt out healthcare system try and mitigate the consequences of millions more getting sick and dying is something we should try to avoid.",
            "title_similarity": "0.71812725",
            "sentiment_compound": -0.9323
        },
        {
            "id": "h6mofou",
            "score": 1,
            "text": "This sort of ignores the fact that every person who gets the virus serves as a vessel for it to evolve. It will only be a matter of time before it mutates into a vaccine-resistant strain.",
            "title_similarity": "0.71993136",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h6mop6o",
            "score": 1,
            "text": "I actually got reported by someone for having this view, with a slight change. \n\nYou’re entitled to healthcare, but if you are going to abuse your healthcare provider, they should just move on to the next patient and leave you to your fate. \n\nI respect people right to choose whether they get vaccinated, but I don’t respect your right to be a complete asshole to the medical profession when you get sick. They shouldn’t have to treat you when you are a belligerent asshat.",
            "title_similarity": "0.76859975",
            "sentiment_compound": 0.1823
        },
        {
            "id": "h6motpf",
            "score": 1,
            "text": "I choose to stay away from the vaccine now for various reasons and I do not wish to change your view. I should be held 100% responsible for anything to come from it. I would also quarantine should I catch it. I still take my precautions though",
            "title_similarity": "0.7051374",
            "sentiment_compound": 0.0108
        },
        {
            "id": "h6motrn",
            "score": 1,
            "text": "I choose to stay away from the vaccine now for various reasons and I do not wish to change your view. I should be held 100% responsible for anything to come from it. I would also quarantine should I catch it. I still take my precautions though. I also was never out of work during the major of the pandemic and was around people the whole time. Closest contact I had with it was from my daughter's daycare and my wife and I still stayed clear of it. I do believe in covid, as it is a pretty big problem but I have no reason to be concerned personally yet so if and when the time comes then we'll see what happens. If it counts any, I have asthma as well so  I've been doing something right with luck in my favor for now",
            "title_similarity": "0.6941459",
            "sentiment_compound": 0.8111
        },
        {
            "id": "h6movkv",
            "score": 1,
            "text": "I appreciate this post, I'll take my chances. If I die I die",
            "title_similarity": "0.49568933",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h6mpa71",
            "score": 1,
            "text": "Repuglikkklan's should have covid parties",
            "title_similarity": "0.36837864",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6mpdzv",
            "score": 1,
            "text": "Covid fake buddy. Keep getting experimental shots in your arm I’m sure you’ll be ok.",
            "title_similarity": "0.4317335",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h6mpm5c",
            "score": 1,
            "text": "Agreed.",
            "title_similarity": "-0.045501884",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h6mpnc2",
            "score": 1,
            "text": "i have no criticism that has not been sayed before. but you sayed \"no long term side effects\" \n\nhow do you know this?\n\nmy point on this is we cant know this, that you didnt get any bad effects a month/year after vacination does not mean you won't get anything in the next 10 to 25 years.",
            "title_similarity": "0.49307123",
            "sentiment_compound": 0.6681
        },
        {
            "id": "h6mpo5t",
            "score": 1,
            "text": "I haven't seen this point argued in any of the other comments based on my brief skim through but wanted to throw it into the fold - the more people who get sick with COVID, the more likely a variant appearing that can overcome our current vaccines becomes.",
            "title_similarity": "0.7840207",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h6mq0e7",
            "score": 1,
            "text": "This is a terrible take. I agree that the anti vaxxers can fuck off and die alone. The problem is a) The mutation caused by them getting it can potentially fuck us over. b) There are people who medically cannot get the vaccine, and to write them off simply to fuck over the anti vaxxers is not ok.",
            "title_similarity": "0.77866334",
            "sentiment_compound": -0.9729
        },
        {
            "id": "h6mq5pm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6mqbxg",
            "score": 1,
            "text": "makes sense to me. before it was a problem of people dying, but if only unvaccinated people die, there is no loss to society whatsoever.",
            "title_similarity": "0.66841716",
            "sentiment_compound": -0.6963
        },
        {
            "id": "h6mqcqe",
            "score": 1,
            "text": "Agree no lockdowns but we shouldn’t stop caring about people just because they become adults. Stupidity doesn’t end at 18. And most of these people are victims of blatant propaganda.",
            "title_similarity": "0.67228603",
            "sentiment_compound": -0.7684
        },
        {
            "id": "h6mqh8s",
            "score": 1,
            "text": "I was all for this at the beginning of the pandemic. Don't force people to wear masks, but if they get Covid send them to the end of the line at the hospital or make them agree to not receive treatment in a rapid manor",
            "title_similarity": "0.81572276",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h6mqun9",
            "score": 1,
            "text": "We should lockdown **immediately** with this new strain and force antivaxxers to get the shot. If they don't, imprison them up like France is doing. We cant let these idiots kill everyone because they just don't want a little shot. It's fuckin safe pete's sake.",
            "title_similarity": "0.7338011",
            "sentiment_compound": -0.1101
        },
        {
            "id": "h6mqw1u",
            "score": 1,
            "text": "I disagree because their choice to be unvaccinated risks the health of the majority who want to live.  One stupid person should not be allowed to infect the world.  Thank God these idiots did not prevent Polio immunizations.",
            "title_similarity": "0.74219173",
            "sentiment_compound": -0.5063
        },
        {
            "id": "h6mqybn",
            "score": 1,
            "text": "Lockdowns are being used as a caseload management tool right now around the world. So right now it is just public health management that is pretty bottom of the barrel. You cant go any lower without risking every individual's life who may be vaccinated but will experience other health events at the same rate as unvaccinated and will now have no health care available to the them. \n\nSo lockdowns and Masks and such will stay around till we achieve herd immunity. If not, be ready for the days when there are no funeral pyres available and cities losing all their remaining trees to be used as funeral pyre wood in India and places like those. USA may not have clogged funeral grounds but many have many relatives unable to meet them or talk to them for the last time while they were still not already half dead and on their way out. This is not a policy now but just the abject reality you have to accept whether its USA or India or Turkey or UK or Australia or Japan or Peru or Ethiopia. \n\nIf you want to not have a lot of dead people, near and dear ones, lockdown now. Its only when we reach that stage that people reluctantly have given in. In India, deapite setting daily records for weeks in May and June, there was no National lockdown. Strategy was if you are brave enough to venture out and die from the disease or just desperate enough to eat like most of the populace, you will make on if those choices. No public education campaigns like I saw so many growing up. Using contraceptives and understanding fertility and family plannning was a huge push and I know it worked in many ways because I know my generation, but not for COVID. When people are dying in the streets on camera and rivers are full of dead floating bodies with nowhere to go, whether the government declares a lockdown or not, people are going to make the daily choice to go hungry or risk lives and many will therefore die anyways. Most of 5his is preventable in theory. An international effort of free vaccines made available immdiately and an agreement to continually tackle all current and future outbreaks. But obviously that is too big a task for humanity. So we will stick to Lockdowns - spontaneous and planned.",
            "title_similarity": "0.7589554",
            "sentiment_compound": -0.4627
        },
        {
            "id": "h6mrx03",
            "score": 1,
            "text": "Funny how no one is telling cops to stop locking up non-violent protestors and confining them to close quarters and then releases them into the public.\n\nWhat? Covid isn’t in jails?",
            "title_similarity": "0.59998465",
            "sentiment_compound": -0.2168
        },
        {
            "id": "h6ms4t6",
            "score": 1,
            "text": "Just letting the virus run rampant in unvaccinated people will increase the likelihood of a new variant emerging that will affect vaccinated people as well. We need to do everything we can to curb infection while the vaccines are still effective or we could lose all the progress we've made and possibly end up with something much worse.",
            "title_similarity": "0.7876079",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6mslt6",
            "score": 1,
            "text": "The anti-vax crowd will also find out that Darwin was right!",
            "title_similarity": "0.6512507",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6msxhr",
            "score": 1,
            "text": "What does the \"following fact\" that vaccination are inherently political have to do with your stance.\n\nAlso....Im pretty confident that your initial argument is a logical fallacy. Choosing to be unvaccinated does not equate a wish to be infected or dead. \n\nAdditional logical fallacy that not re-imposing lockdowns is only contingent on individuals vaccination status.\n\nI see no way to change your view when there is no actual perspective but rather compilation of loosely feelings and data points.",
            "title_similarity": "0.73979056",
            "sentiment_compound": -0.6284
        },
        {
            "id": "h6mtgh1",
            "score": 1,
            "text": "The real problem here is that the more people who are vaccinated the more hosts the virus has a chance to mutate in. If we keep spinning off new variants, then we will keep having the same problem. My fear is that eventually a variant will spin off that is super deadly or affects children.",
            "title_similarity": "0.7251595",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6mtq8z",
            "score": 1,
            "text": "The fact that you think that people on reddit are the ones needing to hear this is idiotic. You are screaming like minded ideas into an eco chamber. The only difference is you have such disregard for other human life that you believe anyone that doesn't agree with you should die. No one needs to change your mind. You just wanted justification for your shitty ideas.",
            "title_similarity": "0.7380958",
            "sentiment_compound": -0.9486
        },
        {
            "id": "h6mty2n",
            "score": 1,
            "text": ">>with no long term side effects\n\nLolololololkl!\n\nThat should do it.",
            "title_similarity": "0.35393563",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h6muetj",
            "score": 1,
            "text": "Israel found that Pfizer was only 64% effective in preventing asymptomatic infections. This would get a lot of vaccinated people sick, though few would die. But we also don’t know the long-term effects of covid. This is way too dangerous.",
            "title_similarity": "0.6811692",
            "sentiment_compound": -0.775
        },
        {
            "id": "h6murrt",
            "score": 1,
            "text": "The ol’ Carlin approach",
            "title_similarity": "0.17360212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mux58",
            "score": 1,
            "text": "Hard agree you can't convince people so stubbornly stuck in their views.",
            "title_similarity": "0.38375565",
            "sentiment_compound": -0.559
        },
        {
            "id": "h6mv186",
            "score": 1,
            "text": "I'd agree if it didn't directly effect everyone else as well as them. What we need is an island to out them on ;)",
            "title_similarity": "0.5438925",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h6mv7nj",
            "score": 1,
            "text": "The problem with high unvaccinated groups is they get infected (remain infected longer) and result in allowing the virus greater opportunity to mutate to a strain that infects everyone.",
            "title_similarity": "0.6244588",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h6mvobn",
            "score": 1,
            "text": "No man is an island. People who smoke make healthcare more expensive for those who don’t. \n\nFolks who can but don’t get vaccinated increase the likelihood of a new variant getting a foothold that impacts us all.",
            "title_similarity": "0.70234823",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h6mvw24",
            "score": 1,
            "text": "Better idea, line them up, and use a firing squad. Better than them finding their way into hospital and taking up beds. Fuck em, i dont give a shit anymore. My kindness and empathy basket is empty due to their constant stupidity.",
            "title_similarity": "0.69788015",
            "sentiment_compound": 0.2787
        },
        {
            "id": "h6mvxf0",
            "score": 1,
            "text": "The problem is that left unchecked the virus will continue to mutate and become more and more effective against people that have been vaccinated.\n\nAdditionally, just letting them die is not a viable way to govern.",
            "title_similarity": "0.76100296",
            "sentiment_compound": -0.4485
        },
        {
            "id": "h6mw8gs",
            "score": 1,
            "text": "While you did make it a caveat, just saying to give proper medical care to those who can't get a vaccine isn't really helping them much.  They will still need to take their lives into their own hands to have any sense of socialization or normalcy, especially if they live in communities with high refusal rates.  \n\nThe CURRENT variant deaths are 99% from those who aren't vaccinated, but allowing this to continue may produce more variants that are even more transmissible/deadly among vaccinated folks.  \n\nReal consequences work.  More people will vaccinate if it is made inconvenient for them not to (like having to continue masking, or not being allowed in certain places), and we need to get as many vaccinations as we can.\n\nThings like lockdowns/restrictions are emergency measures that can slow and stop spread when it is already out of control.  This is a better plan than just pleading and hoping.  If a given area gets really bad, and the hospitals start to fill, etc. then I think it is an obligation of the government to step in and take steps to reduce the impact.",
            "title_similarity": "0.77824026",
            "sentiment_compound": -0.6436
        },
        {
            "id": "h6mwlrj",
            "score": 1,
            "text": "Can I see the long term data you speak of OP?",
            "title_similarity": "0.2648486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mwqn2",
            "score": 1,
            "text": "You said it yourself in your post that there are people with obvious health issues that cannot get the vaccine. That should be enough reason to CYV",
            "title_similarity": "0.799641",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mws1q",
            "score": 1,
            "text": "I honestly think we need to stop helping people that refuse to vaccinate, atleast the ones that refuse to even if it's safe for them.\n\n All these braindead science deniers are what holds back the whole race.  If you are constantly whining about shit you are literally incapable of understanding yourself then you're just being a waste of space.",
            "title_similarity": "0.7215066",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h6mwu6y",
            "score": 1,
            "text": "Exactly. Let those who want the vaccine get it and leave everyone else to it.",
            "title_similarity": "0.65608644",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h6mwups",
            "score": 1,
            "text": ">The vaccines have proven effective with no long-term side effects\n\nDeath is long-term side effect. Your blatant ignorance of that public information in VAERS discredits your opinions as nothing more valid than mere biased opinions.",
            "title_similarity": "0.66138405",
            "sentiment_compound": -0.765
        },
        {
            "id": "h6mwvu5",
            "score": 2,
            "text": "If their decision not to be vaccinated only affected them, so be it. However,  that is not how it works and innocent people (as mentioned throughout this thread) including those have been vaccinated could fall.ill and die from variants of COVID (e.g. Delta variant).",
            "title_similarity": "0.7688347",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6mx16s",
            "score": 1,
            "text": "Your right. The people who legitimately can't get vaccinated are caught in the middle.  But lockdowns or not, people have made their minds up with regards to the vaccine and mask wearing.  I don't see vaccine numbers ever really going to, might as well go back to normal, because there's no other future end in sight",
            "title_similarity": "0.7925252",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h6mxfws",
            "score": 1,
            "text": "If they remain unvaccinated the virus will mutate until your vaccine barely means anything against that mutation.",
            "title_similarity": "0.7365797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mxn9f",
            "score": 1,
            "text": "Every time it replicates there is a chance to create a new version. “[Delta](https://www.google.com/amp/s/nymag.com/intelligencer/amp/2021/07/covid-b-1-617-2-delta-variant-what-we-know.html)” is more dangerous than previous versions. \n\nCan we afford to see how bad these variants can  get?",
            "title_similarity": "0.6579949",
            "sentiment_compound": -0.5849
        },
        {
            "id": "h6myam6",
            "score": 1,
            "text": "I agree. Humanity needs a cull. I'm completely indifferent to the death & suffering. If people wanted a chance they should have gotten vaccinated. It's the same as the plague in England. Massive deaths but life will go on. Whatever. The only problem is the businesses going bankrupt from lockdowns and new covid regulations.",
            "title_similarity": "0.78731847",
            "sentiment_compound": -0.9051
        },
        {
            "id": "h6myc03",
            "score": 1,
            "text": "It’s great that your views are softened. But you will NEVER get these antivaxxers to vaccinate.",
            "title_similarity": "0.7057344",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h6mzlq4",
            "score": 1,
            "text": "The problem with this dumb ass idea is innocent people will die. Immune suppressed. Children. Etc",
            "title_similarity": "0.63239175",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h6mzqmm",
            "score": 1,
            "text": "I didn't feel like reading through all the comments to see if this was said yet... \n\nThe more this virus spreads the higher chance it has to mutate. What if it mutates into something vaccinated peopele (like me) can get very sick from.\n\nThink how much more scary this virus can become if it mutates... maybe it will cause you to cough up blood until you die or cause your lungs to literally disintegrate.    Or worse.",
            "title_similarity": "0.7897763",
            "sentiment_compound": -0.9135
        },
        {
            "id": "h6mzrlj",
            "score": 1,
            "text": "This would be somewhat reasonable if they were the only ones affected, but they are not. It leaves out children and those who can't be vaccinated for legitimate medical reasons, and doesn't take into account that vaccinated people can be infected, too, and some die. Not acceptable.",
            "title_similarity": "0.74154615",
            "sentiment_compound": -0.9245
        },
        {
            "id": "h6mzwro",
            "score": 1,
            "text": "I like the thought but those with undiagnosed mental disorders might be killed becuse they thought they were doing well.",
            "title_similarity": "0.58698857",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h6mzy6f",
            "score": 1,
            "text": "If you want to get infected with a deadly disease as your personal freedom go for it.\n\nAs someone who's immunocompromised your risky activities can impact me is when I have a problem. \n\nYour unmasked unvaccinated self for your freedom removes mine, so we're at a crossroads, who's getting their choice taken away here?",
            "title_similarity": "0.79435396",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h6n03sq",
            "score": 1,
            "text": "All covid deaths may be among the unvaccinated because in May the CDC was no longer counting cases or deaths from covid in the vaccinated! I wonder how many unvaccinated had underlying conditions beings that covid is no worse then the flu with a 99.8% survival rate.",
            "title_similarity": "0.75197315",
            "sentiment_compound": -0.3691
        },
        {
            "id": "h6n04f1",
            "score": 1,
            "text": "Look, I happen to be pro-vax, but I think enough people have made all the necessary points about why people should get vaccinated. My question is, why is political affiliations your second point? Are you saying it’s ok if a bunch of people die because you’re not on their political side?",
            "title_similarity": "0.81982505",
            "sentiment_compound": -0.6007
        },
        {
            "id": "h6n0bz1",
            "score": 1,
            "text": "Sounds great in theory, but not everyone can get vaccinated due to compromised immune systems, so your basically asking a huge population to stay in isolation for life, or risk death, because your eaither scared of a small prick in your arm, or believe in a paper written 20 years ago claiming that vaccines cause autism, a paper that has been widly disregarded and disproven",
            "title_similarity": "0.77573895",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h6n0lxc",
            "score": 1,
            "text": "That us inconsiderate to health care workers sworn to try and save them.",
            "title_similarity": "0.5975132",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6n0ouc",
            "score": 1,
            "text": "I would support a medical policy that all things being equal in determining ones success to treatment with rare /depleted medical supplies (e.g oxygen, ventilators and meds. )Those vaccinated take precedence to those who are not.",
            "title_similarity": "0.6173067",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h6n0zdk",
            "score": 1,
            "text": "If it were up to me people who choose not to be vaccinated shouldn’t be able to use their insurance for covid related treatment.\n\nAlso we should’ve had an official card system where you have to show your papers to get into certain places \n\nYou’re not going g to convince these morons unless you make it inconvenient",
            "title_similarity": "0.7840625",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6n12yy",
            "score": 1,
            "text": "You cannot utilize \"caveats\" because your core View is in direct contradiction of those caveats.  For example, if you wanted to protect the pregnant, etc., then you'd have to encourage all the unvaccinated people to get vaccinated.",
            "title_similarity": "0.75946206",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6n2nay",
            "score": 1,
            "text": "Yea I agree to no more lockdowns. Wether or not you want the vaccine is completely up to the individual.",
            "title_similarity": "0.69581026",
            "sentiment_compound": 0.0201
        },
        {
            "id": "h6n2uql",
            "score": 1,
            "text": "Have you ever heard about collateral damage. Fuck those idiots if you ask me the walking plague monsters need to be culled",
            "title_similarity": "0.7032863",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h6n3176",
            "score": 2,
            "text": "I’ve had both my doses, despite early fertility concerns (it was definitely a widespread worry in the earlier days). When my time came, I happily went ahead and felt it was the best thing to help the world return to a bit of normality. However I went on to develop a period within 48 hours of my 2nd dose, despite no period for 2 years - and it’s now in to week 8. I am fully aware that this may have ABSOLUTELY nothing to do with the vaccine, but I cannot help be worried about the possible implications of a vaccine that could lead to this - if they are linked at all. Worst case scenario could be infertility and yes, that would of course be better than death from covid! But I know I’m not the only person to have similar issues and I can understand other women of child bearing age who are reticent to get the vaccine due to reproductive concerns. To note, I’ve seen my doctor and awaiting further examination after nothing found straight away; she admitted it could well be due to the vaccine but we likely won’t know the full scale of side effects for many years to come.",
            "title_similarity": "0.62805414",
            "sentiment_compound": 0.3574
        },
        {
            "id": "h6n3a28",
            "score": 1,
            "text": "It seems like most every argument has been made. But I think it is important to add that people are also dying from the secondary effects this virus is having on our medical system. Hospitals strain every year under the very expected flu season, the pandemic has pushed them to the brink. \n\nPeople are delaying getting preventative care, leading to more acute conditions (heart attack, stroke, late stage cancer, ect.) Those that do come in for acute conditions are being met with overwhelmed EDs, and often have to be transfered to other facilities sometimes states away just for basic care. In medical emergencies time is of the essence and the delay of a 4 hr ambulance ride to another hospital for surgery/treatment can absolutely result in death or long term disability. \n\nThen there's the resource shortage. There are already not enough Healthcare workers in the US on a good year. Now having to divert a significant amount of personnel/resources/beds/ventilators to a patient population that cannot even share the same floor as all the other patients freezes people with every day medical conditions from having access to care. \n\nExample: A general ICU patient to nurse ratio is 2:1, but hospitals are mandated to have enough people on a floor to run a code (someone's died and needs CPR) this is usually a minimum of 3 people including a respiratory therapist. So even if a covid unit ONLY has 1 patient, 2 nurses and a respiratory therapist has to be there with them. And that staff has to stay there and cannot attend other emergencies in the hospital because covid units are under strict isolation.\n\nVaccinated people are dying from covid indirectly even now. The least the unvaccinated can do is take some basic precautions, but they aren't going to do that. So maybe some mandated precautions are called for. \n\nI think an alternate to the \"let them get infected and die\" is instead \"let them relinquish their right to medical care in the case that they do become infected.\" Even so, that would be cruel in a way because a lot of people are making these very very stupid decisions based off of intense misinformation.",
            "title_similarity": "0.7031072",
            "sentiment_compound": -0.988
        },
        {
            "id": "h6n3bpm",
            "score": 1,
            "text": "The advancement of individualism to the highest degree is terrifying to say the least. I don't care if you believe that vaccines cause autism. Or I disagree with you on any political idea. The idea of just because they aren't taking the vaccine they should die is Asinine and overly apathetic to the human experience. These people aren't taking it because either they can't (medical reasons) or they won't due to being brainwashed by constant bombardment of \"facts\" saying that vaccines are deadly. 90% of those people aren't malicious in their intent they're scared and need better education. You may claim that it isn't anyone's responsibility to better educate these people but, that would make you seem extremely apathetic and uncaring.",
            "title_similarity": "0.7565904",
            "sentiment_compound": -0.852
        },
        {
            "id": "h6n3h27",
            "score": 1,
            "text": "Problem with that is that the more people that get covid, the higher the chance their is a new strain/variant that makes the vaccines even LESS effective. So in the long term it could screw over vaccinated people too.",
            "title_similarity": "0.6671725",
            "sentiment_compound": 0.3485
        },
        {
            "id": "h6n494b",
            "score": 1,
            "text": "What about my 14 month old son, who cannot get a vaccine?",
            "title_similarity": "0.4565351",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6n4kls",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h6n4lbe",
            "score": 1,
            "text": "They will make sick or old, or otherwise susceptible, people sick and possibly kill them.\n\nLet them skip the vaccination, but if their work brings them into contact with the at-risk segment of the population, fire them.\n\nThen it will work.",
            "title_similarity": "0.71505326",
            "sentiment_compound": -0.85
        },
        {
            "id": "h6n4soe",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h6n4xzv",
            "score": 1,
            "text": "While everyone has covered the ethical, moral, logistical and general reasons why this would be a bad idea, I want to focus on a more selfish reason: quality of life. \n\nAnosmia, the inability to smell, is considered an acceptable and minor symptom of covid. However, given how much smell is related to mood, memory, appetite, and interpersonal attraction, not to mention the fact smell helps us sense rotten food, gas, or smoke, then it should be considered a serious symptom. \n\nUnvaccinated people, by virtue of getting and spreading covid, lead to its mutations and the amounts of breakthrough cases increase. Many of this cases affect the vaccinated with “minor” symptoms but while the vaccinated people don’t die, they face the possibility of living the rest of their lives not enjoying food, nature or long term nostalgia. \n\nUnvaccinated people should not be able to make a decision that affect my, or any other vaccinated persons, quality of life to that degree.",
            "title_similarity": "0.7242381",
            "sentiment_compound": -0.8523
        },
        {
            "id": "h6n6jva",
            "score": 1,
            "text": "the big problem with this (aside from advocating eugenics) is that the more people that get infected, the more likely an escape variant will develop, which makes it more likely that the vaccines that those of us actually got will become useless and we'll have to start all over from scratch.  \n\n\nhowever, I feel like this is almost inevitable since re-imposing restrictions will likely be completely ignored in areas that don't vaccinate",
            "title_similarity": "0.78078234",
            "sentiment_compound": -0.7801
        },
        {
            "id": "h6n6wea",
            "score": 1,
            "text": "I'll just go ahead and tell my daughters, both of which are younger than 12, that they are fucked.",
            "title_similarity": "0.5294972",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h6n6xq3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6n6z0u",
            "score": 1,
            "text": "Children are dying from the new variant. My daughter is almost 4 years old and isn't eligible for the vaccine. She also has autism and it would greatly help her to go to the local special needs pre k but with her not being vaccinated and me being pregnant, I'm afraid one of us will get incredibly sick. \n\nI am vaccinated but when you're pregnant your immune system is compromised. If I got sick despite being vaccinated, covid can greatly harm myself or my unborn baby. I spoke to a woman last week who got covid while pregnant last year. It damaged her baby's heart so much that they had to deliver early. The baby's heart stopped and she was revived but she's profoundly mentally challenged now.",
            "title_similarity": "0.6722951",
            "sentiment_compound": -0.6227
        },
        {
            "id": "h6n73wk",
            "score": 1,
            "text": "Inb4 a more deadly and contagious variant comes out of the USA",
            "title_similarity": "0.58816445",
            "sentiment_compound": -0.3947
        },
        {
            "id": "h6n8529",
            "score": 1,
            "text": "The concern has literally never been about those who choose to go unvaccinated. The concern is those who cant get vaccinated.",
            "title_similarity": "0.5875995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6n8cdb",
            "score": 1,
            "text": "What about my kids?",
            "title_similarity": "0.1505461",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6n8g7m",
            "score": 1,
            "text": "Honestly I agree with you mostly, but I have a 1 year old son who can't be vaccinated, and even when he's old enough I don't know if I want him too. For whatever reason the vaccine DOES appear to have some dangerous side effects for young boys in particular. I'm not sure how I feel about it. My husband and I are both vaccinated but we're not sure what we're going to do with our son yet",
            "title_similarity": "0.6056534",
            "sentiment_compound": -0.7037
        },
        {
            "id": "h6n8idf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h6n8vnw",
            "score": 1,
            "text": "This is fear mongering. We are currently 85% down on deaths from our peak. Our overlords are not considering those who have recovered from covid and have natural immunity. I'm vaccinated, but this nonsense has got to stop.",
            "title_similarity": "0.71111536",
            "sentiment_compound": -0.8288
        },
        {
            "id": "h6n8zc1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h6n9cz2",
            "score": 1,
            "text": "This is a very short sighted way of thinking. I would definitely agree if it didn’t effect people who aren’t able to get vaccinated and mutations that occur due to infections. Mutations can continue to occur for anyone who gets infected. This in turn can cause the vaccine to not be effective. We already see it with the vaccines being not as effective against the Delta variant (not by much).",
            "title_similarity": "0.80203235",
            "sentiment_compound": -0.4781
        },
        {
            "id": "h6n9ngl",
            "score": 2,
            "text": "Considering that \n\n1. There are those (not many, but some, especially children atm) who cannot get vaccinated at this time \n2. Those who refuse the vaccine threaten these individuals, and also have no problem going to the hospital when they get sick \n\nI think the thing to do is mandatory 100% lockdowns effective for any business that doesn't require proof of vaccination for all employees and customers. Even with appropriate exceptions, this economic blow would provide the greatest incentive.",
            "title_similarity": "0.7537719",
            "sentiment_compound": 0.7837
        },
        {
            "id": "h6n9nsk",
            "score": 1,
            "text": "It's hard to answer this without writing a  novel. Just get the shot and listen to rational governments.",
            "title_similarity": "0.59721744",
            "sentiment_compound": -0.3318
        },
        {
            "id": "h6n9sa5",
            "score": 1,
            "text": "I was thinking along these same lines myself on the way home from work today.  \n\nIf we don't reach an appropriate level for herd immunity through vaccinations, we'll reach it through anti-vaxx deaths.\n\nEdit: auto correct",
            "title_similarity": "0.7278542",
            "sentiment_compound": 0.0067
        },
        {
            "id": "h6na5q3",
            "score": 1,
            "text": "Most people who are anti-vax are so because of ignorance. There will be many examples where innocent children grow up anti-vac because of their upbringing. Given the severity of Covid-19, I don’t think that ignorance should warrant a death penalty.",
            "title_similarity": "0.6992934",
            "sentiment_compound": -0.8678
        },
        {
            "id": "h6na67y",
            "score": 1,
            "text": "Bodily autonomy is a fallacy. When you choose to be unvaccinated, it's a decision that reaches beyond your body.\n\nIf you live on a deserted island in the middle of the ocean, alone or with other anti-vaxxers, and you choose not to vaccinate, fine (assuming none of you you ever leave that island again or receive visitors). \n\nIf you interact with any other humans at all, not fine. No vaccine is perfect, and at a societal level immunity relies on the compounding effect of everybody cutting their likelihood of infection and transmission. \n\nNot to mention there are those who will never be able to receive a vaccine for preexisting health reasons, who rely on all of us to vaccinate and cut the spread.",
            "title_similarity": "0.7268877",
            "sentiment_compound": -0.0505
        },
        {
            "id": "h6nafai",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nafpb",
            "score": 1,
            "text": "So, a lot of folks can’t get vaccinated for either medical reasons or simply being under 12. Letting unvaccinated idiots run around put those people at risk.",
            "title_similarity": "0.6290153",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h6naiyy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6najeg",
            "score": 1,
            "text": "This would be valid if it were something that only impacted them, but it doesn't. \n\nFirst, the vaccine isn't 100% effective, So even vaccinated individuals can still catch it.\n\nSecond, not everyone who wants to get the vaccine is able to. A lot of people aren't able to get it because of pre-existing health issues. Are you saying that they should be put at risk?\n\nThird, allowing it to spread amongst the unvaccinated increases the likelihood of variant strains. The more it is allowed to mutate, the more likely it is that a strain will develop that the vaccines don't protect against, thus putting everyone once again at risk.",
            "title_similarity": "0.7405418",
            "sentiment_compound": -0.9261
        },
        {
            "id": "h6naly1",
            "score": 1,
            "text": "You’re clearly not a healthcare worker, you’ve never never had your safety disregarded or paid attention to what nurses have had to experience in the past year. Allowing people to just decline the vaccine for whatever reason just makes those idiots think they can spread misinformation, conspiracies and utter fucking nonsense. You don’t get to decide who you give it to, how it affects them or if someone else dies. If you get sick don’t seek medical attention, you don’t deserve it.",
            "title_similarity": "0.68030167",
            "sentiment_compound": -0.878
        },
        {
            "id": "h6naokz",
            "score": 1,
            "text": "I agree but I think health insurance and life insurance should drop them too, and so should employers.",
            "title_similarity": "0.676015",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h6nat1v",
            "score": 1,
            "text": "What do you think happens when a lot of people get infected? The virus has a chance to mutate and when that happens we get a variant and a variant could be resistant to the vaccine that people have already gotten which would lead to a lot more deaths than necessary while a new vaccine is created",
            "title_similarity": "0.7351197",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h6nbayw",
            "score": 1,
            "text": "I sort of agree, I do agree that we should let the imbecilles remove themselves from the gene pool and get their Darwin awards. It's just their foolishness harms others, like the immunocompromised, or people that are allergic to vaccines.",
            "title_similarity": "0.7650454",
            "sentiment_compound": 0.2516
        },
        {
            "id": "h6nbl2s",
            "score": 1,
            "text": "I wouldn't care if it only affected them.   But they can infect those who can't be vaccinated or those who vaccinations don't work. \n\n  My spouse is immune compromised and he has been vaccinated, but was told it may not give enough protection to the original variant, let alone the new ones.",
            "title_similarity": "0.7948773",
            "sentiment_compound": 0.2815
        },
        {
            "id": "h6nbndk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h6nbqr6",
            "score": 1,
            "text": "I don't think it will work, since most unvaxxed (by choice) patients in the ICU wish they had gotten vaxxed after they had covid. I think all this will achieve is more people will end up in the ICU unprepared, meaning more medical bankruptcies.",
            "title_similarity": "0.72502255",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6nbqxt",
            "score": 1,
            "text": "My young children cannot be vaccinated and adults who can be vaccinated put them at risk.\n\nThey would like to go to school, and enjoy ordinary childhood events. More so, there are plenty of people that are medically unable to be vaccinated. The voluntarily unvaccinated put them at risk as well. \n\nevery able adult should be vaccinated to protect other, more vulnerable populations despite their disregard for their own life",
            "title_similarity": "0.72266865",
            "sentiment_compound": 0.7023
        },
        {
            "id": "h6nbtkp",
            "score": 1,
            "text": "I agree, I just don't believe were going to convince people who are unvaccinated to get the vaccine. No amount of data or facts is going to change that. Have these sign a waiver and let's go about our lives.  It doesn't matter IG it's unfair, unless you force it, they won't get it. Why try? Lmao",
            "title_similarity": "0.72437835",
            "sentiment_compound": 0.4635
        },
        {
            "id": "h6nbxt4",
            "score": 1,
            "text": "The government wouldn't do that because the economy would suffer if everyone's dead. Locking down hurts the economy but it can be fixed but lots of dead people results in less money",
            "title_similarity": "0.61361",
            "sentiment_compound": -0.9169
        },
        {
            "id": "h6nc1za",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nc6xs",
            "score": 1,
            "text": "It is constantly making copies of itself with often tiny but sometimes significant changes. Natural selection, essentially. The more it spreads the more possibility of mutations that can cause greater sickness and death. Including the possibility of mutation that is beyond the reach of our current medical science to effectively vaccinate against and/or treat. \n\nTL:DR It will keep mutating in unvaccinated people and could transform into something that will infect and kill others, potentially including those already vaccinated.",
            "title_similarity": "0.7643911",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h6nc72e",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h6nch1i",
            "score": 1,
            "text": "Agreed. But also refuse them medical care.",
            "title_similarity": "0.4549982",
            "sentiment_compound": 0.4678
        },
        {
            "id": "h6ncsq2",
            "score": 1,
            "text": "I'm not gonna let a bunch of selfish people die man. Plus the virus will mutate in them",
            "title_similarity": "0.7602613",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h6ncw0b",
            "score": 1,
            "text": "You should be able to sue someone and be compensated if they refuse to get vaccinated and infect you (assuming you are vaccinated).",
            "title_similarity": "0.73853403",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6ncwg6",
            "score": 1,
            "text": "This could never work. Covid isn’t deadly enough",
            "title_similarity": "0.38785937",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ncwl8",
            "score": 1,
            "text": "So that's the only fate for those who choose not to be vaccinated? Sickness/death? Why is it people suddenly pretend immune systems aren't a thing? Obviously some people don't become infected with this virus given the virulence of it, but that is willfully ignored. Otherwise virtually 100% of the global population would contract COVID at some point if natural immunity does not exist as many people claim/infer.",
            "title_similarity": "0.7882354",
            "sentiment_compound": 0.4685
        },
        {
            "id": "h6ncwwx",
            "score": 1,
            "text": "Letting the virus circulate and replicate among unvaccinated people is how we get scary variants that the vaccine doesn’t work on.",
            "title_similarity": "0.75084734",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6nd1b6",
            "score": 1,
            "text": "Every infected person is another chance for the virus to mutate possibly becoming more deadly or more contagious. We've already seen the delta varient make the vaccines less effective in both prevention of getting sick and how severe the symptoms are. Vaccines are still effective at both but less so, same for those who were previously infected. \nLetting unvaccinated people freely get infected puts the responsible people at higher risk of getting infected.\n\nYou don't let people drive drunk for the same reasons, it puts other people at risk of dying",
            "title_similarity": "0.8333328",
            "sentiment_compound": -0.9417
        },
        {
            "id": "h6nd54r",
            "score": 1,
            "text": "We all will be paying the medical care for anyone that's indigent. If you allow insurance to deny coverage even more will be passed onto the public. Hospitals don't get to turn away medical emergencies. \n\nThat's before we discuss what happens when emergency rooms and ICU's have to start making tough choices when they run out of beds.\n\n\"We've\" already paid a huge amount to develop the vaccine and delay spread until it can be deployed. Extending the pandemic another few years while facilitating the development of more strains strikes me as a sub optimal use of public funds.\n\nWe will never get rid of covid, but the vaccine is a great tool to fight its impact on the public at large, limiting harm, and its evolutionary opportunities.",
            "title_similarity": "0.7709993",
            "sentiment_compound": -0.0479
        },
        {
            "id": "h6nd8gl",
            "score": 1,
            "text": "Most of them will be just fine",
            "title_similarity": "0.047593374",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6ndgg1",
            "score": 1,
            "text": "Remember how the PCR test was the gold standard and you guys swore by it? And we said no, it causes too many false positives. And you guys said shut up. \n\nWell, FDA just recalled all PCR tests and all results should be ignored.\n\nAnd you swore for over a year it was great! Ir was used MILLIONS of times. \n\nI can’t wait for the FDA to do the same with one of the vaccines.",
            "title_similarity": "0.6918607",
            "sentiment_compound": 0.8221
        },
        {
            "id": "h6ndk4k",
            "score": 2,
            "text": "But what about children and the immuno-compromised, who can't get vaccinated and have to rely on herd immunity? Every person who goes unvaccinated puts them in considerable danger.",
            "title_similarity": "0.65212625",
            "sentiment_compound": -0.7218
        },
        {
            "id": "h6ndkq5",
            "score": 1,
            "text": "I've been thinking this for a couple months now. And since the majority of antivaxxers are conservatives who believe all manner of crazy (eg the big lie, antifi did Jan 6, trump's gonna pres again come august, etc), letting them take their ignorance with them to the grave could improve society in all sorts of ways.",
            "title_similarity": "0.6381335",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h6nds4t",
            "score": 2,
            "text": "The problem isn't that we are terrified of the unvaccinated dying, it is that they crash the whole health establishment in doing so, because of huge numbers of patients. If they agreed to take their chances at home then np, but they run to the er at the first sign of dyspnoea, and then all physicians, wards, icu units etc have to leave everything else to try and save their sorry asses.",
            "title_similarity": "0.680444",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h6ndxra",
            "score": 1,
            "text": "Two words…beneficence and non-maleficence.",
            "title_similarity": "0.26606262",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ne36f",
            "score": 2,
            "text": "\"Choose to die\" huh.\n\nWhy cant ppl realize that the longer this thing sticks around the more likely it is to mutate. And then the vaccines were all for naught and we start again from the beginning.... sigh.",
            "title_similarity": "0.75381696",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6ne3vk",
            "score": 1,
            "text": "You mean like every other vaccine ever? Oh wow. . .how profound",
            "title_similarity": "0.46416205",
            "sentiment_compound": 0.743
        },
        {
            "id": "h6nebkx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6neegs",
            "score": 2,
            "text": "By allowing insurance to not pay for the treatment of an infected unvaccinated person, it would bankrupt hospitals. \n\nAlso my 7 year old special needs child has congenital lung disease. She wouldn't fare well with it. If we completely give up i would have to lock her up completely until a vaccine is available for her. Thats not fair to her. She has already been restricted for 18 months.",
            "title_similarity": "0.6985079",
            "sentiment_compound": -0.8474
        },
        {
            "id": "h6nek2f",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nelsy",
            "score": 1,
            "text": "Hospital overload, every bed taken by a covid patient is one that someone else can't have. Vaccinated people still get sick, and hospital workers especially put at risk. More cases, more chance for variants, more chance for covid never going away and getting worse.",
            "title_similarity": "0.6307973",
            "sentiment_compound": -0.7517
        },
        {
            "id": "h6nf42v",
            "score": 1,
            "text": "My mom won't let me get vaccinated and frequently sends me to the store",
            "title_similarity": "0.4949345",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nf6d0",
            "score": 1,
            "text": "Fair as long as they’re quarantined from the rest of the population. Not everyone gets the choice to get vaccinated, and if the fuckers want to catch a plague they should do so alone.",
            "title_similarity": "0.8086429",
            "sentiment_compound": -0.6015
        },
        {
            "id": "h6nfc38",
            "score": 1,
            "text": "I really only have one counter, it's that children can't choose to vaccinate and they don't deserve to die. Trust me, I understand where you're coming from. Plenty of times I thought \"you know what, you wanna die, go right ahead, who am I to stop you?\"... But I feel wrong for that every time. It's not just about them, but everyone who they affect.",
            "title_similarity": "0.7388376",
            "sentiment_compound": -0.6094
        },
        {
            "id": "h6nfe6r",
            "score": 1,
            "text": "I totally agree that people who don't get vaccinated are painfully stupid and deserve the risk because they are putting it on themselves. but the vaccines aren't 100% effective and immediately lifting all lockdowns and measures will just result in the deaths of people who have done all the right things. also another comment mentioned people who can't get the vaccine even if they want it which would be awful to them too.\nyour idea is great in principle but in practice it could be awful for more than just anti-vaxxers",
            "title_similarity": "0.7555857",
            "sentiment_compound": -0.8066
        },
        {
            "id": "h6nficj",
            "score": 1,
            "text": "Only if unvaxinated people are refused medical treatment.  It's not fair to put that burdon on the medical system.",
            "title_similarity": "0.69872534",
            "sentiment_compound": -0.4874
        },
        {
            "id": "h6nfycp",
            "score": 1,
            "text": "I agree…. As soon as there’s a vaccine available for kids. Until then we need to at least try to stop the spread to protect kids, long term Covid damage in children might lead to real problems as they get older, and it’s not fair to children to make them suffer for the stupidity of adults. \n\nOnce the kids are vaccinated I’m all for Q anon republicans yeeting themselves out of the voting pool by going into the forever box.",
            "title_similarity": "0.7961467",
            "sentiment_compound": -0.9163
        },
        {
            "id": "h6ng148",
            "score": 1,
            "text": "The problem is we all are paying for the cost of care for the unvaccinated through our health insurance.",
            "title_similarity": "0.5978946",
            "sentiment_compound": 0.128
        },
        {
            "id": "h6ng3q1",
            "score": 1,
            "text": "Wish we would. Lil evolution could help. Culling of the species",
            "title_similarity": "0.53054845",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6ngjxw",
            "score": 1,
            "text": "A lot of those unvaccinated people would be ok for one thing. That’s why they don’t want to be vaccinated. I also don’t think it’s the place of the government to tell insurance companies not to treat paying customers (nor do I think insurance companies would care/listen).",
            "title_similarity": "0.7062058",
            "sentiment_compound": 0.0624
        },
        {
            "id": "h6ngq4f",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6ngurf",
            "score": 1,
            "text": "Killing other in the process who cant get vaccinated for actual decent reasons? How selfish, dumb and not informed can people be?",
            "title_similarity": "0.6460699",
            "sentiment_compound": -0.9034
        },
        {
            "id": "h6ngvne",
            "score": 1,
            "text": "When unvaccinated people get infected, they aren’t hurting themselves exclusively. Mutations happen very rapidly in viruses, causing variants which may be able to overcome current immunizations. This is why there is a new Influenza (flu) vaccine every year; it is designed to combat the newest mutated variant.",
            "title_similarity": "0.690262",
            "sentiment_compound": -0.872
        },
        {
            "id": "h6nh3yx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nh6ru",
            "score": 2,
            "text": "Require vaccines to work in public sectors and healthcare. Put in an actual vaccine passport that can’t be faked with a dumbass piece of paper. Require vaccines to fly, leave the country, enter large events and go to school/college (once approved in children). \n\nAnti-vaxxers only give a fuck about themselves. Hit them where it hurts and we will see the vaccination rates shoot up. However after this COVID mess I honestly think this country is on the fast track to a type of conservative dictatorship. Something has to give.",
            "title_similarity": "0.8265407",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h6nhjvp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nhtop",
            "score": 1,
            "text": "1.4 million people die each year from TB.\n\nThe vaccine for TB has been around for a while and is proven to be safe.\n\nAre you vaccinated for TB? \n\nIf you are not, should we refuse to treat you if you get TB?\n\nWhy has the government never mandated TB vaccines? Why have they not offered free stuff for getting the vaccine?\n\nWhy have they never imposed lockdowns or masks for TB?\n\nYou really should be asking what this is really all about at this point.",
            "title_similarity": "0.69532704",
            "sentiment_compound": 0.2658
        },
        {
            "id": "h6nhxo8",
            "score": 1,
            "text": "There won't be future lockdowns... The economy shutting down again is not an option... Inflation fears are too high to take such action now... The most that will happen is mask mandates...",
            "title_similarity": "0.65636814",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6ni2xj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6ni3p8",
            "score": 1,
            "text": "Yes. It’s survival of the fittest—-and vaccinated!",
            "title_similarity": "0.45425665",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h6ni8sq",
            "score": 1,
            "text": "Not with the increased velocity of variant spin-offs from high infection rates that keep reducing vaccine efficacy. It affects everyone.",
            "title_similarity": "0.7431747",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h6ni9h4",
            "score": 1,
            "text": "Yes but if there's a whole group of people still getting the virus that gives it a higher chance of mutating even more",
            "title_similarity": "0.62587297",
            "sentiment_compound": 0.5187
        },
        {
            "id": "h6nin48",
            "score": 1,
            "text": "There is another thing to consider,  and that is monetary expense.  The un vaccinated wont just drop over dead and have their survivors bury them in the back yard.  Covid puts people in the hospital,  in ICU, for weeks.  And there are serious, expensive , long term medical issues for survivors.  So, who pays for all of this ? We do. The people who got vaccinated and have insurance   and pay taxes.  No one has the right to put so much of a burden on the rest of us.",
            "title_similarity": "0.6831627",
            "sentiment_compound": -0.8514
        },
        {
            "id": "h6njf9m",
            "score": 1,
            "text": "Considering that the majority of unvaccinated people are black or Hispanic, I would say that your \"let them die\" mantra is bordering on racist.  Blacks and Hispanics do not trust the government, so just letting them die is pretty messed up.\n\n[https://www.kff.org/coronavirus-covid-19/issue-brief/latest-data-on-covid-19-vaccinations-race-ethnicity/](https://www.kff.org/coronavirus-covid-19/issue-brief/latest-data-on-covid-19-vaccinations-race-ethnicity/)\n\nhttps://www.bloomberg.com/graphics/covid-vaccine-tracker-global-distribution/us-vaccine-demographics.html",
            "title_similarity": "0.73721266",
            "sentiment_compound": -0.9287
        },
        {
            "id": "h6njfmt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6njgbn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6njyup",
            "score": 1,
            "text": "It is hard to remain sympathetic to the antivaxxers in this. \n\nBut, for merely practical reasons, we should take action.\n\n1) Hospitals are straining under the load. This impacts the hospital staff, and patients needing other services. Overcrowding means some people needing care, who *have* been responsible about the pandemic and vaccination, sometimes cannot get it.\n\n2) there is a population which legitimately cannot be vaccinated, or for whom the vaccine does not help. A vaccine stimulating the immune system only works if the immune system is operational, and there are many immune-compromised people.\n\n3) long haul Covid is frightful. We’re going to have a population of long-term disabled from covid at least as large as the death toll… probably a lot larger. That’s an avoidable problem.",
            "title_similarity": "0.76165825",
            "sentiment_compound": -0.3689
        },
        {
            "id": "h6nk12g",
            "score": 1,
            "text": "except it puts more than just said non vaxxer at risk. their wishes aren't any more important that those e who wish to be health but cant.",
            "title_similarity": "0.5696807",
            "sentiment_compound": 0.0504
        },
        {
            "id": "h6nk3js",
            "score": 1,
            "text": "Those who smoke, drink, take recreational drugs, over eat etc.. get treatment, they should too. It’s not about letting the ignorant die, but allowing them the opportunity to mature and grow as a human being. Though I do feel everyone’s frustration with miss information and crying wolf. I feel it is better to not stop down to their level, but to give them a chance to step up above theirs.",
            "title_similarity": "0.6466933",
            "sentiment_compound": 0.4371
        },
        {
            "id": "h6nkea5",
            "score": 1,
            "text": "I think this leaves out the immunocompromised people, who still wear there’s masks",
            "title_similarity": "0.63093334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nkh25",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nkmu5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nkv5k",
            "score": 1,
            "text": "Children can not get vaccinated. Immunocompromised people can not get vaccinated. People with the vaccine can still get the virus.",
            "title_similarity": "0.6855655",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nl6dc",
            "score": 1,
            "text": "No long term side effects?\nI'm vaccinated, but I am worried about this factor/ is sure as s*** isn't the case that it has proven no long term side effects.",
            "title_similarity": "0.66191983",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h6nlrht",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002617"
        },
        {
            "id": "h6nlrr2",
            "score": 1,
            "text": "I love that your view (based on your second link) is that most unvaccinated people are Trump supporters, and we should let those who refuse to get the vaccine to eat shit and die. Two thumbs up! I had a good chuckle reading this, I’m in full agreement. \n\nAnd I’ll go ahead and clarify right now that I do not mean people who are allergic to the vaccine components, pregnant women, people who suffer negative side effects, those with compromised immune systems, etc. I purely mean the conservatives who are convinced that COVID is not real and that wearing a mask means sacrificing your freedom and rights as an American and who refuse to “live in fear”.",
            "title_similarity": "0.82667744",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h6nlsgm",
            "score": 1,
            "text": "I disagree because if the virus mutates in unvaccinated people enough, it could possible require a whole new vaccine to be developed for that variant.",
            "title_similarity": "0.7143448",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h6nm3in",
            "score": 1,
            "text": "Lockdowns are necessary when hospitals start to fill up, threatening the care of not just Covid patients, but anyone who needs a hospital bed. With Covid unchecked against the unvaccinated, hospitalizations due to Covid could skyrocket to that point. Do you want to be denied a hospital bed after a car accident because some idiots think Fauci wants to make us all magnetic?",
            "title_similarity": "0.7552927",
            "sentiment_compound": -0.8248
        },
        {
            "id": "h6nm8oz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nmeu4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nmhjo",
            "score": 1,
            "text": "Problem is the anti vaxers just breed new variants",
            "title_similarity": "0.6307335",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h6nmrl9",
            "score": 1,
            "text": "I don't know if someone already said this but the uncaccinated are going to want to travel, sometimes to countries where not everyone who wants a vaccine can get it.\n\nIt would also not be fair for the hospital workers",
            "title_similarity": "0.7145507",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h6nmwhf",
            "score": 1,
            "text": "Selfish counterpoint - I work at a hospital, and I would like to be able to take a vacation at some point in the future without my absence being the straw that breaks the camel's back for an already over-stressed system.",
            "title_similarity": "0.6196126",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6nmyc0",
            "score": 1,
            "text": "Except children under 10 don't have the choice.",
            "title_similarity": "0.30821186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nn4eo",
            "score": 1,
            "text": "Yeah I get what you're saying but I can't afford not to work and I have a 6 month old. I worry about her catching covid from any of the very small number of people she is around due to me having to work. If I could get paid by the gov to stay home and protect her believe me I would.",
            "title_similarity": "0.53973716",
            "sentiment_compound": 0.2541
        },
        {
            "id": "h6nnemm",
            "score": 1,
            "text": "Lockdowns arent an acceptable policy no matter what. Its a totalitarian edict. Lockdiwns are, by definition, tyranny.",
            "title_similarity": "0.57720405",
            "sentiment_compound": -0.6293
        },
        {
            "id": "h6nnp8y",
            "score": 1,
            "text": "Well. All I can say is that I know few people that got covid. I know a lot more that got the jab (2 shots) and are doing terrible. I don't know how far this will go but I'll wait for the study to end first. Unless of course either the government or my job or the actual makers of the shot want to assume the responsibility if anything happens to me. I know the risks of covid. They are well documented. As for the jab... not looking so good when check VEARS",
            "title_similarity": "0.72339535",
            "sentiment_compound": 0.7237
        },
        {
            "id": "h6nnqdf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nnro2",
            "score": 1,
            "text": "What would a country be if they would simply allow their citizens to die of something that they might not be educated or enlightened in? A country’s job is to care about its people’s future, but sacrificing or at the very least allowing people to die without at least trying to stop them takes out what the end a country is supposed to be, which is humane. “If you have the power and will to overcome, don’t stand still waiting” -Tolkien",
            "title_similarity": "0.7117386",
            "sentiment_compound": -0.7876
        },
        {
            "id": "h6nnwiz",
            "score": 1,
            "text": "As much as I want to agree, I can't because science.\n\nIt doesn't just harm the morons. It harms people with immune system issues. It harms the very young and the elderly. It can create new strains that may not be stopped by the current vaccine. There are probably other reasons I don't even know off the top of my head if we just allowed the idiots out there to go on spreading this virus around.",
            "title_similarity": "0.7990973",
            "sentiment_compound": 0.1321
        },
        {
            "id": "h6no45r",
            "score": 1,
            "text": "No.\n\nHere's the thing. Yes, right now, vaccinated people are fine. And yeah, most of them should be fine. Here's why we need to get people vaxxed though. A virus mutates every 20 to 30 seconds, basically a new generation. While almost all of these variants die off, some live, and the ones that live are MUCH stronger. Like the delta variant. If we don't have herd immunity, (over 80 percent of the world vaxxed) it'll keep mutating\n\nWhen it mutates enough, the current vaccine we have becomes worthless. \n\nTLDR; if we are stupid, virus get stronger. If virus strong er, we all die. Vaxxed or not",
            "title_similarity": "0.68156207",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6no6fg",
            "score": 1,
            "text": "Some people (and all kids) can't get vaccinated. Plus the more unvaxxed people there are the more likely we are to get a variant that's vaccine resistant",
            "title_similarity": "0.72593457",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6no9ii",
            "score": 1,
            "text": "I mean, no matter how dumb, human life is human life. P.s if the virus is allowed to spread uncontrolled, who knows when it develops into something our vaccines are less effective against, thereby fucking us all over",
            "title_similarity": "0.7999723",
            "sentiment_compound": -0.3751
        },
        {
            "id": "h6np64m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6npfj7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nplaa",
            "score": 1,
            "text": " all the conflicting info we been fed for 2 years by our government doesnt help anything. I'm not vaccinated. But not because I'm anti vax its just I think its weird that they trying to pay me to get it. If its a matter of life or death. It should be mandatory.",
            "title_similarity": "0.6568732",
            "sentiment_compound": -0.8144
        },
        {
            "id": "h6npln3",
            "score": 1,
            "text": "Vaccines are very good, but not 100% effective.\n\nThe more infected people a vaccinated person is exposed to, the more likely the vaccine will fail.\n\nThus, the unvaccinated are not simply taking their own chances. They are imposing a risk upon every person around them, including the vaccinated.",
            "title_similarity": "0.7746396",
            "sentiment_compound": -0.9352
        },
        {
            "id": "h6npr6c",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6npsuw",
            "score": 1,
            "text": "They will create mutations resulting in more boosters for us. \n\nRestrict their movement.",
            "title_similarity": "0.58119345",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6npuyl",
            "score": 1,
            "text": "Depending on your state the pr campaigns advertising where to get vaccinated haven't reached much of the population and its relatively difficult to get vaccinated. I'm in florida and I was only able to get vaccinated in mid may because I heard the VA was holding a public vaccine drive via word of mouth and I was trying since the vaccines first became available. The state vaccine appointment system still hasn't gotten back to me yet with an appointment to get vaccinated. \n\nIf there were closures of non essential businesses it would be for the protection of everyone not just the unvaccinated. \n\nHow public safety measures are implemented could always be improved but, the U.S. never went into a lockdown and almost all measures were implemented by states. \n\nSo the choice isn't and has never been full lockdown or let people die, it's been limited measures at the state level and requirements to wear masks and social distance on airplanes or federal building and foriegn travel restrictions as dictated by the federal government. \n\nDisinformation has been as much of a contagion as covid-19 over the last year and a half. We need to be talking about restricting the coordinated campaigns by right-wing media, the GOP and foreign powers. Not your aunt on Facebook but the coordinated campaigns we've been continuously attacked by for over a year. That will do more for the problem and be more ethical than stopping vaccination efforts or refusing medical service to anti-vaxers some of who have been mislead by leaders who hold positions that should mean they are trustworthy.",
            "title_similarity": "0.5789841",
            "sentiment_compound": -0.952
        },
        {
            "id": "h6npx6d",
            "score": 1,
            "text": "Another take on this is that you are calling for the weaponization of healthcare, which is really quite an abhorrent stance to take. The idea of denying someone health insurance based on their vaccination stance would be the equivalent of denying people health insurance based on their dietary choices, or drug use.\n\nThis country is in the process of trying to make healthcare more available to more people, and weaponizing it will just cause more people to be against socialized medicine because of the ability to manipulate who is deserving and who is not. \n\nWhile in Cuba, my waiter explained that since the government pays for their education it becomes the government owns the proceeds and in turn owns the person. Same with healthcare.\n\nThe one thing you did get right is that if someone chooses to not get vaccinated, that is their decision.",
            "title_similarity": "0.7487539",
            "sentiment_compound": -0.7988
        },
        {
            "id": "h6nqna3",
            "score": 1,
            "text": "My son is 1 years old, and can't be vaccinated.\n\nWe only bring him out, when the numbers and trends look good in our area.\n\nWe just stopped doing that with delta variant numbers spiking.\n\nHaving a large section of your population non vaccinated, means catering to the risk. Temperature scans, covid tests, contact tracing, limited visitors at hospitals, etc... which are put in place in an effort to control the numbers and protect those that cannot be vaccinated.\n\nIf more people were vaccinated, society at large could take a sigh of relief and relax precautions, reduce costs, and return to a normalish economy.",
            "title_similarity": "0.7676562",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h6nqso4",
            "score": 1,
            "text": "Guess we should just let the virus run rampant creating new variants until one that the vaccinations isn’t effective against",
            "title_similarity": "0.75235415",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6nqt99",
            "score": 1,
            "text": "We need to keep pushing people to get vaccinated, polio took 40-50 years and yet it is present in 2 countries. This shows that we can eradicate a disease eventually. If people are foolish, govt still is responsible to take care of them.",
            "title_similarity": "0.6715521",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h6nqtkz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nqxfr",
            "score": 1,
            "text": "I feel like people, even after a year, don't get why we went into lockdown. It was to not overwhelm our hospitals. I like your idea, but I'd be pissed if I or someone I loved didn't get the best health care for a non-covid aliment because of full hospitals.",
            "title_similarity": "0.66832936",
            "sentiment_compound": 0.2633
        },
        {
            "id": "h6nr13v",
            "score": 1,
            "text": "I have honestly been fighting with the same question because at some stage we cannot keep waiting for people to change their minds, and we also cannot stop COVID at all - even fully vaccinated it won’t stop it spreading because the vaccines don’t.\n\nBut what I have realised from outbreaks here in Aus… is if someone IS vaccinated, the viral load is usually (not always, there have of course been super spreader vaccinated people) lower. One of the big problems when India had their massive Delta surge was that the amount of people in hospital increased the viral load, and going to hospital ended up making you worse than if you’d have stayed at home. Which is obviously going to overwhelm health systems. \n\nSo I am kind of at the stage on well we should do our best to push people who won’t get vaccinated to do it because it is still in the best interests of those in our society who cannot handle getting COVID. Because the less viral load there is the less massive outbreaks we have, the less likely people are to get a super nasty infection. This has economic benefits too, because the more seriously ill people you have there are long term impacts on healthcare costs for societies with public funding for that, but also there are losses to the workforce because more sick days occur and people will retire earlier if they are frailer younger (as we saw with a lower life expectancy after Polio).\n\nBasically even though it isn’t a total protection for vulnerable people, it is better if we get towards herd immunity even if it isn’t eradicated from spreading.",
            "title_similarity": "0.7961685",
            "sentiment_compound": 0.1032
        },
        {
            "id": "h6nrixx",
            "score": 1,
            "text": "why does everyone care so much at this point? If you got the vaccine it's mostly effective. If you get corona and live, it's even more effective at preventing you from getting it in the future compared to the vaccine. Get the vaccine if you are worried. Who cares if a bunch of people who don't want the vaccine dies? You can't force people to get vaccinated and I don't think they could even prove who has been vaccinated or not at this point. People I saw getting vaccinated at Sam's today never even showed an ID",
            "title_similarity": "0.7775475",
            "sentiment_compound": 0.8825
        },
        {
            "id": "h6nrjh5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nrmju",
            "score": 1,
            "text": "According to facts out of the UK , 40 percent of the newest covid positive people have had the SO CALLED vaccination. If it was truly a vaccine why is it still under emergency clearance only ? Too much false information being spread around about it. If you had covid already more than 75 percent of doctors say do not get the jab. Which is better a natural immunity or a lab made biochemical?",
            "title_similarity": "0.7003816",
            "sentiment_compound": 0.8645
        },
        {
            "id": "h6nrw40",
            "score": 1,
            "text": "Just get your vaccine and avoid the anti-vaxxers like the Lepers they are!  Nature will sort it out.",
            "title_similarity": "0.78311676",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h6ns2qi",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002617"
        },
        {
            "id": "h6ns4r5",
            "score": 1,
            "text": "Then the unvaccinated become breeding grounds for worse variants that could evade vaccines.",
            "title_similarity": "0.6874106",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6ns7wg",
            "score": 1,
            "text": "Consider the effects this is having on the healthcare system and the people staffing it. It’s been a very long year. Many doctors and nurses have had severe impacts to their mental health because of this situation. Non-emergent care gets pushed aside for the critically ill and dying COVID patients. This is not a good thing. Their hospitalization and death affects more than just themselves.",
            "title_similarity": "0.55912054",
            "sentiment_compound": -0.8179
        },
        {
            "id": "h6nslgb",
            "score": 1,
            "text": "How many will they kill along the way?",
            "title_similarity": "0.46412015",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h6nsphp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002615"
        },
        {
            "id": "h6nstm2",
            "score": 1,
            "text": "Vaccinated people can still be asymptomatic carriers and spreaders of the virus.  If unvaccinated people expose vaccinated people, those vaccinated people can expose other unvaccinated people, such as children under 12, those that are immunocompromised (AIDS, cancer, taking immunosuppressants for an autoimmune disorder), and anyone else that's not vaccinated for a legitimate reason.\n\nVaccines exist to reduce the severity of symptomatic disease.  That's it.  They don't make you immune to becoming a carrier.  They don't prevent you from getting sick.  They reduce severity.",
            "title_similarity": "0.8463342",
            "sentiment_compound": -0.9269
        },
        {
            "id": "h6nsz7s",
            "score": 1,
            "text": "“Allow denial of medical coverage” I swear some of you people are sadistic as fuck. We do this with literally nothing else. I don’t wish death on anyone, no matter how dumb their choice is or isn’t (and honestly, not absolutely everyone needs to get this vaccine)",
            "title_similarity": "0.77532995",
            "sentiment_compound": -0.741
        },
        {
            "id": "h6nt022",
            "score": 1,
            "text": "It's more about preventing mutations that circumvent the vaccines.",
            "title_similarity": "0.69487286",
            "sentiment_compound": -0.0972
        },
        {
            "id": "h6ntcb9",
            "score": 1,
            "text": "It will evolve again and again among the unvaccinated to the point where all of our vaccines will not help much and we will be back at the beginning......the right thing to do is everyone wear masks, everyone get vaccinated so we can pretty much kill this thing off. We actually have to work together as a team for this to happen.......................",
            "title_similarity": "0.7585396",
            "sentiment_compound": -0.5415
        },
        {
            "id": "h6ntg64",
            "score": 1,
            "text": "Except their unwillingness to get vaccinated allows the virus to continue to mutate and kill innocent people.   If their stupid actions only affected them, it would not be an issue.",
            "title_similarity": "0.7589195",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h6ntlqb",
            "score": 1,
            "text": "What about my child that cannot have the vaccine due to age?",
            "title_similarity": "0.5266524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6pcjp0",
            "score": 1,
            "text": "Important to note non of the vaccines are 100% perfect. Though small, the risk to a vaccinated person certainly does increase in the scenario you mentioned above. Not to mention additional strain on hospitals and other medical facilities has real negative impacts to everyone, included vaccinated people.",
            "title_similarity": "0.71312344",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6pcy1j",
            "score": 1,
            "text": "what about the serial killers? as per their wishes they just want to kill people but NO the govt wants to control everything",
            "title_similarity": "0.65610284",
            "sentiment_compound": -0.8381
        },
        {
            "id": "h6pdihm",
            "score": 1,
            "text": "What is really amazing is kids under 12 can't be vaccinated.  Protecting them, within reason, probably means lockdowns.  This is why public policy generally shouldn't be, \"fuck it\".",
            "title_similarity": "0.7130673",
            "sentiment_compound": 0.7872
        },
        {
            "id": "h6pe92f",
            "score": 1,
            "text": "I’ve had the virus and am still healthy. Just like the overwhelming majority. Fear porn!!",
            "title_similarity": "0.56048995",
            "sentiment_compound": 0.3786
        },
        {
            "id": "h6peaxu",
            "score": 1,
            "text": "Its all fun and games till you get someone with Trypanophobia 😭😭😭",
            "title_similarity": "0.42515427",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h6pgg8t",
            "score": 1,
            "text": "You do realize the vaccine isn't available to all people yet, right?\n\nFor example anyone in the US who is under like 11 or 12, I forget the exact number, isn't even allowed to have the vaccine yet. \n\nSo you're letting 11-year-olds die for no reason in your scenario.",
            "title_similarity": "0.7255496",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h6pgzy8",
            "score": 1,
            "text": "I think we never should’ve locked down in the first place but instead of just worrying about those your unvaccinated we should also consider all relevant information regarding Covid not just ones that affirmative political bias. That actually shows that the lockdowns in cells were far more dangerous than the actual virus, and according to the Center for disease control the vast majority people who died during the Covid pandemic they were listed as Covid deaths did not die from Covid itself. For instance a man in Michigan was suffering from depression but both barrels of a 12 gauge shotgun in his mouth and blew his head off. Because he had Covid in his System that showed zero symptoms he was listed as a Covid death anyway even though he was killed with a buck shot blast to the face. What else I think is far more dangerous than the lockdowns and the virus was the censoring of information that went against the bias of the time. For instance then President Donald Trump mentioned how there was a theory that the virus came from a lab league. Both the media and Dr. Anthony Fauci rebuked this claim until it was revealed a few months after Joe Biden had been inaugurated that the theory was most likely true and many reporters in the media acknowledged they only rebuked it because it came from Donald Trump regardless of whether or not it was factual or even possible. \n\nI would say instead of locking down again, why not just quarantine the sick and vulnerable and that everyone else live their normal lives",
            "title_similarity": "0.75904435",
            "sentiment_compound": -0.9916
        },
        {
            "id": "h6pj5fi",
            "score": 1,
            "text": "My only addition is that those that choose not to get the vaccine, without legitimate medical limitations or age restrictions, should be forced to sign a Covid DNR allowing medical professionals to allocate their time and resources to patients who did everything they could to survive the disease.",
            "title_similarity": "0.7822429",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h6pllcr",
            "score": 1,
            "text": "We should've done this from the start, no locldowns, no restrictions, just let people do what they wanna do. There's still no solid evidence to support that lockdowns actually helped us, even though they make sense in theory. People can mask up and stay indoors if they want, but the government shouldn't have forced people to do anything",
            "title_similarity": "0.6630738",
            "sentiment_compound": 0.5916
        },
        {
            "id": "h6pnkrz",
            "score": 1,
            "text": "Just like pre-COVID, non-vaxxers create a social health issue. There are compromised demographics that cannot get vaxxed, either because of health or age or economic class.\n\nAnti-vaxxers are a disgrace. They don't deal with those situational barriers to receive healthcare. They just choose to be a vessel for deadly diseases because of some bullshit they saw on the neighborhood Facebook page.",
            "title_similarity": "0.76330936",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h6psdz2",
            "score": 1,
            "text": "Nope. I agree. Build “unvaccinated” hospital tents staffed w unvaccinated healthcare workers and let them take care of themselves. No Medicare, Medicaid, or insurance, these folks can pay those unvaxxed folks out of their own pocket.",
            "title_similarity": "0.60235965",
            "sentiment_compound": -0.1306
        },
        {
            "id": "h6psjw8",
            "score": 1,
            "text": "Agreed. The same as allowing people to take the clotshot and put themselves at risk by taking experimental drugs as well as still having the chance of catching covid anyway.",
            "title_similarity": "0.7129259",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h6py72p",
            "score": 1,
            "text": "You do know that some people cant get vaccinated for medical reasons right? Weather it’s allergies or other health problems some people do have a legitimate reason to not get the covid vaccine, many have to wait for a few months (post surgery immune system damge and stuff) and some may never be able to get it\n\nWhile we should open up soon, acting like everyone who isn’t getting the vaccine is an “antivaxer who deserves to die” is a shitty ass take and is just giving the finger to people with legitimate and diagnosed medical concerns that they have talked to their doctor about and their doctor said not to get it based on their medical history",
            "title_similarity": "0.754462",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h6s8xna",
            "score": 1,
            "text": "Thankyou! Let me die in peace.",
            "title_similarity": "0.30133998",
            "sentiment_compound": -0.1759
        },
        {
            "id": "h6ugvwx",
            "score": 1,
            "text": "Unfortunately, letting more people pick up the virus could lead to a higher chance of the virus mutating during replication which would inevitably screw over vaccinated people potentially :/",
            "title_similarity": "0.70540595",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6want3",
            "score": 1,
            "text": "Proven effective with no long term side effects? Interesting being that they’re only a few months old",
            "title_similarity": "0.27938306",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6zundn",
            "score": 1,
            "text": "So we should round up all the anti jabbers and put them in cages",
            "title_similarity": "0.5061565",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6zx78a",
            "score": 1,
            "text": "Vaccinated people can still spread covid",
            "title_similarity": "0.42136514",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71ua1q",
            "score": 1,
            "text": "You are the blur between auth-left and lib-left. Please stop associating yourself with the latter, thx ☺️",
            "title_similarity": "0.5206708",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h7bz6o1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h847v77",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20002621"
        },
        {
            "id": "h87eukf",
            "score": 1,
            "text": "Agree, there's only 99% chance of survival.",
            "title_similarity": "0.3025991",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h88wfdo",
            "score": 1,
            "text": "\"we should allow insurance companies to deny them medical coverage\"\n\nWell isn't that a slippery slope. While most of these people could've prevented their medical bills if they had followed the CDC's advice, that is true for many diseases for which people end up needing medical care, and yes that includes contagious diseases.\n\nThere is a vaccine for (noncovid) pneumonia that is recommended by the CDC. Should insurance companies be able to deny medical coverage to pneumonia patients who didnt get the pneumococcal vaccine as recommended?\n\nAnd insurance companies could also use this reasoning to deny coverage for people with sexually transmitted diseases. Give them an inch and they will take a mile. This isn't a road we want to go down.",
            "title_similarity": "0.8179618",
            "sentiment_compound": 0.7269
        }
    ]
}