{
    "CMV: We should not allow media companies to run the Presidential Debates\nHere are the main reasons I believe this:\n\n1. The current Presidential debate format is a joke and is an embarrassment to our country. Participants should not be allowed to interrupt, participants should not be asked more questions than another, and participants should not be allowed to get 3x the speaking time as others.\n2. Media companies are incentivized to make the debate as entertaining as possible, not informative, truthful, fair, etc.\n3. Media companies make a ton of money from these highly viewed events. They also own the rights to all the footage, making it inaccessible to many.\n4. Media companies are typically biased and susceptible to outside forces (advertisers, foreign countries, broadcasters) leading to some preference for one candidate over another. \n5. I believe we should have a publicly funded series of debates organized by people from across the political spectrum.": [
        {
            "id": "h7ks9rz",
            "score": 1,
            "text": "/u/ThrowThisShitAway10 (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/ox8nr2/deltas_awarded_in_cmv_we_should_not_allow_media/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5151554",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h7kvliq",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.088521376"
        },
        {
            "id": "h7ldh19",
            "score": 6,
            "text": "Unfortunately, almost everything in your post is wrong (assuming you are talking about debates for the general election and not primaries.)\n\n> The current Presidential debate format is a joke and is an embarrassment to our country.\n\nThat's opinion (not necessarily wrong) and isn't of evidentiary value to this discussion. \n\n> Participants should not be allowed to interrupt\n\nThey aren't. Does it happen? Sure. A good moderator will keep the candidate in line. \n\n> participants should not be asked more questions than another\n\nGenerally, the moderator is supposed to stay on top of that and they do a fair job of it.\n\n>  participants should not be allowed to get 3x the speaking time as others.\n\nThey aren't 'allowed\"... they don't \"get\" extra time. Some candidates will monopolize the speaking time, which again is the moderator's responsibility. \n\nWhere you have strayed from anything even vaguely resembling reality is that \"media companies\" run the debates. THEY DON'T. That's only in the primaries. In the general election, debates are the responsibility of the Commission on President Debates (since 1987) which is jointly run by the two parties. They set down the rules and the candidates have to agree to them.\n\n> Media companies are incentivized to make the debate as entertaining as possible, not informative, truthful, fair, etc. \n\nThey aren't *incentivized*. The debates air on ALL of the broadcast TV networks, as well as the cable news channels. As for whether they are informative or truthful, that's on the moderator.\n\n> Media companies make a ton of money from these highly viewed events. \n\nThey don't. At least not the way you're (probably) thinking. The money they make is on the PRE- and POST- debate coverage. The debates are carried ad free. Generally the ad rates depend on the overall viewership of the network.\n\n> They also own the rights to all the footage, making it inaccessible to many.\n\nThey don't. No network OWNS the rights to debate footage.\n\n> Media companies are typically biased and susceptible to outside forces (advertisers, foreign countries, broadcasters) leading to some preference for one candidate over another.\n\nAgain, an opinion. I'd be interested if you can cite a source (again, this isn't about primaries).\n\n> I believe we should have a publicly funded series of debates organized by people from across the political spectrum.\n\nI agree with this in concept.\n\nWhile I appreciate your frustration at how debates are carried and controlled, the media are NOT the ones responsible.",
            "title_similarity": "0.8996799",
            "sentiment_compound": 0.9202
        },
        {
            "id": "h7klqap",
            "score": 1,
            "text": "1. Agreed, but this can be changed while still being run by the media  \n2. True, but there is not a single person in the country who is not influenced by who is president  \n3. Is it really inaccessible to anyone? As far as I can see this is one of the most easily accessed media items of basically anything aired on American television.  \n4. Yes, but so is everyone  \n5. Yes, but WHO?",
            "title_similarity": "0.6980222",
            "sentiment_compound": 0.9455
        },
        {
            "id": "h7kpcai",
            "score": 13,
            "text": "A few problem with this premise:\n\nWho else actually have the platform with a big enough base to support a presidential debate? The point of a presidential debate is to reach a LARGE audience to sway those in the middle ground.\n\nThe whole reason why media company even bother with the debate is they KNOW it will be a massive spike in viewership. They literally hype it up month in advance.\n\nWell yes they are Bias, But during a event with such a big viewership, no sane media company will shoot them self in the foot by being bias. Regardless of how their daily reporting goes. Simply because if you were to be a ass to 1 party, the they probably won't return to the debate the next year.  Which is why ironically, presidential debate is one of those time when media company are actually surprisingly unbias.\n\nThe problem with having a government run / public funded series is that you want both side to attend. So the host has to be reputable enough for both party to agree to, which is extremely hard.",
            "title_similarity": "0.82271373",
            "sentiment_compound": -0.3998
        },
        {
            "id": "h7lbtaa",
            "score": 0,
            "text": "DeFiDebates",
            "title_similarity": "0.0876679",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7lbzad",
            "score": 0,
            "text": "DeDebates",
            "title_similarity": "-0.0306079",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7li9mg",
            "score": 0,
            "text": "Under current system it's impossible. If we take US for example, then having those media companies helps dems and reps to divide the people in the way both of them want. Both of them are fighting with each other for non-issue things to prevent people from getting actual problems. And pretty much the only people who would help you fighting these media companies are leftists and most likely if you succeeded at getting rid of those companies, then you already have different system in place.",
            "title_similarity": "0.8563151",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h7ls2nz",
            "score": 0,
            "text": "Look you’re correct but you’re also missing the way way WAY bigger problem which is the entire presidential election system is a farce that makes other first world countries literally face palm when they see it. It would be funny if it wasn’t you know deeply dangerous for us as a species.",
            "title_similarity": "0.8492867",
            "sentiment_compound": -0.8919
        },
        {
            "id": "h7lvdhb",
            "score": 0,
            "text": "Further, the debate format allows media companies to decide which parties are even permitted to participate, further stifling minor parties (Greens, Libertarians, PSL, etc.) in a time where an extremely large amount of Americans are dissatisfied with both major parties and their right-ward death spiral. Especially with ranked choice voting being implemented in more states, a debate platform open to nominees from all parties is important... even when that runs contrary to corporate interests.\n\nAs for OP's points, each one is correct. And after the Sanders/Biden debate, where Biden was permitted to lie repeatedly and flagrantly the entire time without challenge from the moderator and the circus of the Trump/Biden debate, it should be very clear that what we have doesn't work.\n\nWe already know that media has an extremely strong bias with regards to politicians. For instance, we can look at the overwhelming negative coverage of Bernie Sanders with hyperbole that bordered on insanity even from mainstream outlets, such as \"Bernie is anti-woman \\[and he\\] makes my skin crawl.\" or that legendary rant about him rounding up and executing people in central park (which aired on MSNBC.) Statistically verifiable was the mainstream media providing more than 50% more coverage of Biden, along with three times the negative spin when covering Sanders on CNN. MSNBC further, according to a whistleblowing producer, intentionally declined any opportunity to interview Yang and intentionally limited coverage of his campaign.\n\nIn Chomsky's 'Manufacturing Consent' he details the special symbiotic relationship that corporate media and our government have, and it's definitely worth a read, but both bolster one another in maintaining a destructive status quo that is leading to continued inhumane exploitation, endless war and the destruction of the planet.\n\nAllowing corporations any say in the electoral process is something completely unconscionable.",
            "title_similarity": "0.8307588",
            "sentiment_compound": -0.9389
        },
        {
            "id": "h7kmk0s",
            "score": 588,
            "text": "> I believe we should have a publicly funded series of debates organized by people from across the political spectrum.\n\nThe GOP candidate won't attend the debate funded by liberal voters. The DNC candidate won't attend the debate funded by conservative voters. \n\nIn fact, if the debates could be magically changed in a way that promises good faith and substantive debate/discussion of the issues, the bad faith candidates won't attend. \n\nAlternate solution: No more debates.\n\nEach candidate is given a list of ~10 topics and they need to record a 3-10 minute video with their take on that topic. The videos are all available on a free and easy to access website. Candidates can also record a series of 1-3 minute response videos which will be added to the site in the appropriate area.",
            "title_similarity": "0.8432722",
            "sentiment_compound": 0.8637
        },
        {
            "id": "h7lkq16",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10970944"
        },
        {
            "id": "h7lvtgn",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.088521376"
        },
        {
            "id": "h7koy46",
            "score": 14,
            "text": "The biggest issue here is the reality of who is now conducting these. You mention in a comment that you want “bipartisan people” to run it and make questions. Who are the bipartisan people? In the US 99% of he time people talk about bipartisan efforts is just a code word for “centrism” which is its own political ideology and already had a good amount of representation in media. This isn’t actually bipartisan, so how do you suggest we find a group that actually is?\n\nDo we let the questions represent the people? A bunch of republicans have believed the election is rigged, is it fair to have questions asserting that the last election was rigged and trump Won? A bunch of democrats think trump is hitler, is it fair to have questions asserting that?\n\nThe reality is someone has to have power to run this, and while us media companies suck you’re not really offering any real suggestion to an alternative, just the idealistic swoon of “bipartisanism.”",
            "title_similarity": "0.7591796",
            "sentiment_compound": 0.8105
        },
        {
            "id": "h7lo1f5",
            "score": -2,
            "text": "Honest as fuck here, Joe Rogan should be able to run it. He wont let them fuck around",
            "title_similarity": "0.6382593",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h7ks1xk",
            "score": 4,
            "text": "Media companies do not run the presidential debates. Presidential debates are currently and have always been run essentially in the way you're suggesting.",
            "title_similarity": "0.69289255",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7koe7z",
            "score": 225,
            "text": "So in the US, the (non-primary) Presidential and Vice Presidential debates are sponsored and run by the Commission on Presidential Debates. They decide on the moderators, venues, and formats based on their own standards/criteria. The board is not made up of Media companies, although former news directors have served, I believe. \n\n&#x200B;\n\n[You can read more about the CPD here.](https://www.debates.org/about-cpd/overview/)",
            "title_similarity": "0.6575751",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7lb4vn",
            "score": 67,
            "text": "[removed]",
            "title_similarity": "0.088521376"
        },
        {
            "id": "h7knsd4",
            "score": 2,
            "text": "> I believe we should have a publicly funded series of debates organized by people from across the political spectrum.\n\nSure, and who broadcasts them and facilitates them?  How are these people selected.  And how do we ensure these people aren't \"media\"?",
            "title_similarity": "0.7322452",
            "sentiment_compound": 0.644
        },
        {
            "id": "h7krbqb",
            "score": 2,
            "text": ">Media companies are typically biased and susceptible to outside forces (advertisers, foreign countries, broadcasters) leading to some preference for one candidate over another.\n\nThis also applies to your recommendation as people from across the political spectrum will be susceptible to outside forces (especially when they have the authority to organize a debate) and they will have political advocacies that lead them to support one candidate over another.\n\n>I believe we should have a publicly funded series of debates organized by people from across the political spectrum.\n\nHow about we have people who know how do organize debates organize debates instead? Like a coalition from the best collegiate debate schools.",
            "title_similarity": "0.8366939",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h7l5dnr",
            "score": 1,
            "text": "How bout we stop affiliating candidates with parties and vote for them based on their ideas?",
            "title_similarity": "0.6277644",
            "sentiment_compound": 0.128
        },
        {
            "id": "h7lam24",
            "score": 3,
            "text": "The OP should see how the debate rules are made. The one time they will work together to keep 3rd parties out.",
            "title_similarity": "0.5264859",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h7lhpv1",
            "score": 3,
            "text": "The CPD has two sources of their funding; the GOP and Democrats. The media companies do not control the debates. The CPD (and by extension their only two funders) do.",
            "title_similarity": "0.67953384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7lisph",
            "score": 1,
            "text": "I agree but I would add we shouldn't let the Dem and Repub parties control the debates either.",
            "title_similarity": "0.7021036",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h7llwqt",
            "score": 1,
            "text": "Yeah man. It's probably the most obvious and public display that our leaders are prechosen for us. They only want career politicians to win that the establishment has chosen. This is why they do not allow smaller candidates to speak with any kind of significance. The worst thing that could happen would be for a non-career politician to win an election, as all career politicians are under the thumb of corporate America... and corporate America is who is REALLY running things.",
            "title_similarity": "0.86794674",
            "sentiment_compound": 0.7303
        },
        {
            "id": "h7lo6s0",
            "score": 2,
            "text": "If the candidates want to participate and the media wants to provide the platform who tf is the goverment to take away their freedom of speech?\n\n>I believe we should have a publicly funded series of debates organized by people from across the political spectrum.\n\nOkay, so? Why would you have to ban other debates in order to have that?",
            "title_similarity": "0.79011714",
            "sentiment_compound": 0.5171
        },
        {
            "id": "h7lpo3k",
            "score": 1,
            "text": "I like the idea of masked candidates.\nFull body black out, voice distortion; make it solely on policy, arguments for/against and oration. \nWe need a leader, \nnot a CEO or manager in charge of America LLC.",
            "title_similarity": "0.69689167",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7lsi3p",
            "score": 1,
            "text": "You could watch it on cspan.  They were streaming live on youtube.  I would flip between cspan, fox, and cnn just to see how everyone spins things.",
            "title_similarity": "0.36199883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7lwr5v",
            "score": 1,
            "text": "Media companies are incentivized to get people to watch it. Entertainment vs informational media make the same ad revenue if there’s the same amount of viewers. \n\nWith this in mind, do you think it would be better to maximize viewers and renege on some of the civility? Or do you think it would be better as more informative and less viewers? With the assumption that every viewer can vote, is it better to have a larger percent of lower knowledgeable people or a smaller percent of higher knowledge? \n\nDo you think a publicly funded debate series would really be less bias? At least w a for profit model the slant is known and (relatively) harmless. With a political bias we’d see things much worse imo. \n\nThere are plenty of private debate forums that candidates can choose to participate in, but don’t. What makes you confident that candidates are 1: able to uphold their views in a more rigorous setting or 2: willing to?",
            "title_similarity": "0.74466026",
            "sentiment_compound": 0.8092
        },
        {
            "id": "h7m46ja",
            "score": 1,
            "text": "Three rule violations should result in being disqualified from the Presidency lol",
            "title_similarity": "0.6425308",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h7m8x03",
            "score": 2,
            "text": "I agree the media shouldn’t run them.  There are bigger issues, candidates should be forced to completely answer question,  they should also be challenged when they have voting records different then there claims.  But it needs to be done by non-partisan people with real examples",
            "title_similarity": "0.8016489",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h7m8z2q",
            "score": 1,
            "text": "I agree with you but your optimism for #5 sounds more like naiveté. Where are these public funds coming from? Because it sounds like taxes and good  luck selling that to anyone. And who are these imaginary people that are going to host a bipartisan event? You also say across the political spectrum. Does that include everyone? Are the alt-right invited to help run this event? Hope you got extra security and insurance.",
            "title_similarity": "0.68219984",
            "sentiment_compound": 0.987
        },
        {
            "id": "h7ma07p",
            "score": 1,
            "text": "I cannot argue with that, i agree.",
            "title_similarity": "0.12374186",
            "sentiment_compound": 0.5478
        },
        {
            "id": "h7mbi5d",
            "score": 1,
            "text": "What's the alternative? For the government to do it? \n\nThat feels kind of \"state tv\"-ish to me.",
            "title_similarity": "0.5500448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7me641",
            "score": 1,
            "text": "1. The overwhelming majority of the voter base will watch the entertaining debate rather than the informative fairly moderated one. In future debates candidates with a chance to win won't bother.\n2. If a candidate loses because they have worse ideas their supporters won't admit it, and won't cosider it fairly moderated. Candidates with a chance to win won't bother.\n3. Except they already know that being informative is political suicide. Informative candidates don't win. So they won't have bothered in the first place.",
            "title_similarity": "0.8384373",
            "sentiment_compound": 0.7827
        },
        {
            "id": "h7mkqvo",
            "score": 1,
            "text": "OP will be happy to learn that media companies do not run presidential debates, the Committee on Presidential Debates does",
            "title_similarity": "0.6901279",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h7mnvm3",
            "score": 1,
            "text": "Lol the biggest problem about media outlets handling the elections is that almost all of “news sources” are owned by corporations, so the candidates they push to the headlines are already handpicked to serve the capitalists. This totally defeats the purpose of democracy and is frankly quite embarrassing for the United States as a country.",
            "title_similarity": "0.8194618",
            "sentiment_compound": -0.379
        },
        {
            "id": "h7moyts",
            "score": 1,
            "text": "I don't care who does it first, but I want a presidential debate where there is a yes/no section. A simple, 5-10min section where the candidates are asked about a political topic and can only answer yes or no. No others words. \n\nWe can have a second section letting the candidates explain the reasoning for their answers afterwards, but they have to give clear answers to tough questions. \n\nBecause I, as someone who has to decide which of them I want to represent me and my fellow citizens for 2-6yrs, want a clear idea of where they stand. And one if the most important qualities that should be expected of any damned political leader is decisiveness.",
            "title_similarity": "0.7360569",
            "sentiment_compound": 0.7633
        },
        {
            "id": "h7mqno7",
            "score": 2,
            "text": "Debates shouldn’t be live. Everyone should record their answers to all of the same questions, then they all get to watch each others responses and record a rebuttal if needed. Then all of these videos should be posted. All these fuckers lie, and then double down because facts can’t get checked. Fuck all of them but 45 most of all.",
            "title_similarity": "0.70883036",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h7mqs4c",
            "score": 1,
            "text": "Donald Trump saying that it’s all a show and he is good for ratings was actually really self-aware because it’s completely true. When he was in the news, TV ratings and readership was really high for almost all news outlets and now it’s decreased by 2/3s or something ridiculous.",
            "title_similarity": "0.65054905",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h7ms3pg",
            "score": 1,
            "text": "They edit video then lie and say they didn’t. They are no better than reality shows and that goes for the news and the weather. Main stream tv is a joke, I almost respect reality shows more and I can’t stand reality shows.",
            "title_similarity": "0.8028959",
            "sentiment_compound": 0.382
        },
        {
            "id": "h7mtsvq",
            "score": 1,
            "text": "Honestly, just have each candidate do a long from interview. I learned more from Joe Rogans Bernie interview than I have from any other televised media outlet.",
            "title_similarity": "0.44309503",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h7mypd0",
            "score": 1,
            "text": "I get the questions in advance from time to time.",
            "title_similarity": "0.112142004",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7mzwp1",
            "score": 1,
            "text": "Everything is a joke. This is just slightly adjusting the cherry perched atop the fucked cake.",
            "title_similarity": "0.48665172",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7n0jds",
            "score": 1,
            "text": "It’s worse than the media companies, the two parties really run the debates. Ever wonder why Ross Perot was the last 3rd party candidate in a debate? Cause he was kicking their ass",
            "title_similarity": "0.7804461",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7n10s1",
            "score": 1,
            "text": "Yeah we ahould. Ahut the fuck ufowow",
            "title_similarity": "0.24280609",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7n15rw",
            "score": 1,
            "text": "I think the bigger and more important problem is that third parties, like the Libertarian Party, are being excluded from the debates. Libertarians got 3% of the popular vote in 2016, even being excluded from the debate stage. If we include them in the debate stage, then they will actually compete with the other parties.",
            "title_similarity": "0.6881566",
            "sentiment_compound": 0.8278
        },
        {
            "id": "h7n22pv",
            "score": 1,
            "text": "We should not let 2 major political parties act like children and they are ruining our country",
            "title_similarity": "0.8360705",
            "sentiment_compound": 0.539
        },
        {
            "id": "h7n2dyt",
            "score": 1,
            "text": "Election speculation should ALSO be illegal.\n\nIt is used by biased media on both sides to influence elections.",
            "title_similarity": "0.78182876",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h7n75jw",
            "score": 1,
            "text": "The debates on the networks are setup for ratings and skew partisan fir this reason. The real presidential debates are done by the Comission for Presidential Debates (debates.org). They consist of three Presidential debates and a Vice-presidential debate.  They are run the correct way.",
            "title_similarity": "0.70371366",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7n8p7w",
            "score": 1,
            "text": "Put them in a old sound booth let them speak the agreed upon time then kill the Mic.  Then neither can interrupt,  monopolize or any other disparaging gestures. For the debate.  THEY WANT TO ACTIKE SPOILED LITTLE BRATS SO BE IT.",
            "title_similarity": "0.7224728",
            "sentiment_compound": -0.4835
        },
        {
            "id": "h7nh4hu",
            "score": 2,
            "text": "Debates are what the leading candidates want them to be. If they don't want to debate by your rules, they won't go  and then your debate becomes a town hall.\n\n\nOn a wider scale, I don't think debates even matter. Current elections are all about making sure your guaranteed voters show up, and your opponent's voters can't make it to the polls.\n\nThe only use of a debate is to rile up your own supporters, or if you're lucky, dishearten your opponent's.",
            "title_similarity": "0.8413912",
            "sentiment_compound": 0.6343
        },
        {
            "id": "h7npdkd",
            "score": 1,
            "text": "I think debate is not a good way to judge the candidates' proposed policies, the arguments for those policies or the criticism against them as the point of the answers to all questions is never give an honest answer (which, for most political questions is: \"Well, it's complicated and there is no magic bullet to this problem, but....\"), but instead waffle some key words and slogans to make your position look strong and if possible make some nasty stabs on your opponent. These stabs are not supposed to be logically constructed arguments based on solid facts with sources but instead populist good sounding soundbites. \n\nIf we acknowledge that, then we can take the whole thing as entertainment and then the current format is just fine. \n\nIf you really want to turn the drilling of proposed politics into proper discussion where every statement has to be backed up by solid logic and sourced facts, then the only way I could see that happening would be to do it in written form, for instance here in reddit. \n\nSo, you could make a thread for each topic. Everyday both candidates post there a message (which has to be shorter than the agreed character limit) where he/she defends his/her position against the presented criticism and attacks the opposition's position. All claims have to be backed up by sources (and we could have moderators pointing out when no sources were provided, just like in r/NeutralPolitics). Anyone could read the debate at his leisure whenever there's time. It would teach the voters the arguments behind each position (or the lack of them) much much better than a 2 minute populist soundbite could ever do. \n\nIn this format, someone just shouting: \"Fake new\" without saying anything else would just look ridiculous, while in the tv debate people take it seriously as there is never any time to dig deeper into the fact basis of the presented claims.",
            "title_similarity": "0.8327118",
            "sentiment_compound": -0.9688
        },
        {
            "id": "h7ntupv",
            "score": 1,
            "text": "Joe Rogan, presidential debate host.  Jamie would be the fact checker we all need.",
            "title_similarity": "0.54609436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7nvges",
            "score": 1,
            "text": "Democracy, the theatrical performance.",
            "title_similarity": "0.2474849",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7nxxz8",
            "score": 1,
            "text": "Who is the \"we\" you're talking about?",
            "title_similarity": "0.2061364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7o3c1d",
            "score": 1,
            "text": "I agree, but who should?",
            "title_similarity": "0.069558635",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h7oexke",
            "score": 1,
            "text": "\"We shouldn't allow media companies to anything other than entertain and explicitly so.\" There, ftfy",
            "title_similarity": "0.73727036",
            "sentiment_compound": 0.1615
        },
        {
            "id": "h7r8um9",
            "score": 1,
            "text": "There's a lot of things we should do. we wont do them because capital has captured the political process in this country since about the era of reconstruction. Huge media companies dont want to lose power any more than huge health insurance or oil companies. \n\nVast concentrations of wealth brought on by wartime spending enabled power to be more tightly monopolized at every level, and ever since then we've been meekly throwing misguided populist movements at some unseen enemy while labor power and hard fought concessions are stripped away. The system nurtures and encourages right wing populism  when it gets into trouble like after 2008, (and white supremacist movements when things really get hectic.) Left wing populism or anything thats close to the mark gets ignored or grouped by the media together with the alex jones types. (like saying bernie bros where sexist or racist, or just like trump supporters)\n\nNear the place where I grew up the duponts in Delaware where a family of french nobility who fled the revolution to come to america. The manufactured gunpowder during the civil war and used that capital to become a chemical giant. I gave one of them a ride in my uber car a few years back and I couldnt get over how soft his hands where. Its just amazing to me how tightly woven together history is.",
            "title_similarity": "0.80814046",
            "sentiment_compound": 0.8093
        },
        {
            "id": "h7tw27a",
            "score": 1,
            "text": "That already happens to a degree with the Commission on Presidential Debates. The main issue with it is that the “moderators” selected are usually major media anchors anyway and have their own biases and conflicts of interest (such as Anderson Cooper). Another issue is that the rules of the Commission are flawed. Not every party is represented because in order to be invited to debate you need a certain percent of votes (Gary Johnson and other libertarians pretty much never get invited to the debates).",
            "title_similarity": "0.84200644",
            "sentiment_compound": 0.1134
        },
        {
            "id": "h82dtax",
            "score": 1,
            "text": "Well technically the Commission on Presidential Debates is in charge of the three debates between Presidential candidates as well as the Vice Presidential debate. The Commission is sponsored by both parties and accepts donations from a variety of individuals, organizations, and institutions to fund the debates.\n\nThe idea of reforming the process and changing the rules has been discussed for decades and runs into the same obstacles. Chief among them is that while the rules can be modified the participants and audience cannot be changed. You cannot force politically savvy candidates to remain quiet when speaking is in their interest, even if it means interrupting. The debates are already seen as biased and that wouldn’t change even if you brought back Lincoln and Douglass, most media outlets openly favor the Democratic Party while a few openly favor the Republican Party. If you allow the pundits to speak then it will involve politically biased views being shared and if not the news outlets will devote even less coverage to it. Finally the real issue is the audience is not willing to listen to a detailed discussion of trade policy or anything else, and if the audience is just political junkies and policy geeks the candidates gain nothing and won’t appear.",
            "title_similarity": "0.8327416",
            "sentiment_compound": 0.967
        }
    ]
}