{
    "CMV: Police vehicles should not be allowed to be black with dark lettering\nWhen police cars are black with dark lettering making it difficult to identify the car, to me, it says that police are not there to prevent crime but to catch people in the act of it. I have no issue with undercover police who are in completely unmarked vehicles, but a traffic cop sitting on the side of the road in a difficult to identify vehicle does nothing to stop people from speeding rather only to catch one of the drivers speeding or driving recklessly. \n\nIn my mind police cars should be painted bright colors that clearly say I'm here, don't commit crime while I'm here.  Imagine a police officer sitting in a parking lot in an all black vehicle versus a brightly colored one. He could be sitting on his lunch break or writing up a report (or eating doughnuts) and if he was in a brightly colored vehicle it wouldn't matter if he was looking around to see if anybody was committing crime because citizens would know much more easily that police presence is in the area.\n\nEdit 1: I think a common theme I am picking up from people who oppose my view is the assumption that people want to commit crime and would otherwise always commit crime if no law enforcement was around.  I'm operating under the assumption that I want to be protected from crime.  If a crime is to occur I want people to be around to protect me from it.  If police are brightly colored and their presence is known I am allowed to feel safer.  Not only do I feel safer but I would also feel a reduced need to commit crime in order to protect myself.": [
        {
            "id": "h7v7n8z",
            "score": 0,
            "text": ">don't commit crime while I'm here\n\nMaybe, just maybe don't commit crimes at all.  The idea that you need to allowed to break the law except when the police are around says your reasoning has to be wrong.\n\nWould not the police, the law and to be honest, other honest citizens prefer you obeyed the law at all times?",
            "title_similarity": "0.76964384",
            "sentiment_compound": 0.5535
        },
        {
            "id": "h7vkabw",
            "score": -1,
            "text": "Commenting this again at the top level: Having conspicuous police doesn't prevent a crime, nor does it stop one. It simply ensures that the crime will take place where a conspicuous police car *cannot* easily be identified, making it less likely for that crime to to prevented, stopped, and even eventually prosecuted.\n\nWhat's more, the (non frivolous) detriments of inconspicuous police cars listed by OP are only really applicable to someone who is in the act of or is considering committing a crime. Which, of course, is what the police are there to do - be detrimental to criminal activity.\n\nOne other thing to consider is protecting police officers. It is not unheard of for police officers to be targeted while they are in their cars, such as what happened in the case of Christopher Dorner. Not making the police so clearly identifiable provides them with anything from the two extra seconds needed to identify an attacker all the way to preventing an attack in the first place.\n\nThanks for the CMV, I enjoy this one.",
            "title_similarity": "0.8655265",
            "sentiment_compound": -0.8975
        },
        {
            "id": "h7vu87b",
            "score": 0,
            "text": "They’re painted black to intimidate the people they’re purportedly serving. They don’t want you to see them as servants. They took all those slogans off their cars. They want you to feel fear. It’s psychological manipulation.",
            "title_similarity": "0.671551",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h7v26qd",
            "score": 30,
            "text": ">When police cars are black with dark lettering making it difficult to identify the car, to me, it says that police are not there to prevent crime but to catch people in the act of it.\n\nSo.... what exactly is your issue with that? Wouldn't you want them to catch people committing  crimes?\n\n> but a traffic cop sitting on the side of the road\n\nWhat do you mean by traffic cop? Like Highway patrol or a city cop eating lunch in a parking lot/pull through catching up on paperwork? \n\n> in a difficult to identify vehicle does nothing to stop people from speeding rather only to catch one of the drivers speeding or driving recklessly.\n\nOr you could just obey the rules of the road.... then whats the issue?\n\n>In my mind police cars should be painted bright colors that clearly say I'm here, don't commit crime while I'm here.\n\n\"Good no cops around floor it\" yeah.... this doesn't work how you think it does. \n\n> Imagine a police officer sitting in a parking lot in an all black vehicle versus a brightly colored one. He could be sitting on his lunch break or writing up a report (or eating doughnuts) and if he was in a brightly colored vehicle it wouldn't matter if he was looking around to see if anybody was committing crime because citizens would know much more easily that police presence is in the area.\n\nIdk where you are from but unless I go to a different state I just about know what all the police cars in my area look like... How hard is it to remember a \"black ford explorer with tinted windows, light bar and a push bar\" pretty simple.... Hell HWP is even easier in my state they are silver (but that is because they sit on the highway).",
            "title_similarity": "0.87310547",
            "sentiment_compound": 0.9696
        },
        {
            "id": "h7v6gsd",
            "score": -1,
            "text": "The best way to prevent crime is to take criminals off the street, not giving them a glaring notification to briefly stop their criminal activity until this clearly marked vehicle passes by. Cop cars can't be everywhere. \n\nPlease don't rebute this with issues in jailing people for petty crime, you know that's not what I mean.",
            "title_similarity": "0.8716946",
            "sentiment_compound": -0.9131
        },
        {
            "id": "h7v1kfw",
            "score": 1179,
            "text": "The problem is that the goal of the police is to minimize crime as a whole, not just when they are around. This is easier done with more subtle vehicles.\n\nIf cars are brightly colored, then you could easily check for them and, when none are around, commit a crime. With normal looking cars you never know if you are safe from the police. These less-visible cars can also easily be made visible with their lights.",
            "title_similarity": "0.81774735",
            "sentiment_compound": 0.1058
        },
        {
            "id": "h7v40tq",
            "score": 3,
            "text": ">In my mind police cars should be painted bright colors that clearly say I'm here, don't commit crime **while I'm here**.\n\nThat's the catch, it's  a deterrent that works on: I see a police vehicle, I am not commiting a crime. But what when I don't see it? Well, way to go, if they would be there, I would see their bright-ass car.\n\nWith toned down cars, you cannot be sure if there is no police around. So, deterrence is more constant, as you know you don't see the police car, but also know that you might've just missed it.",
            "title_similarity": "0.84485155",
            "sentiment_compound": -0.6197
        },
        {
            "id": "h7vh5gn",
            "score": 49,
            "text": ">a traffic cop sitting on the side of the road in a difficult to identify vehicle does nothing to stop people from speeding rather only to catch one of the drivers speeding or driving recklessly\n\nWell that's simply not true.\n\nA traffic cop sitting on the side of the road in a difficult to identify vehicle, who successfully pulls over and fines 100 dangerous drivers ... will very likely have stopped many of those people from being such dangerous drivers in the future.  That's the entire point of fines -- punish people when they commit crimes, and they will be less likely to commit more crimes.\n\nConversely, putting a traffic cop in a brightly-coloured car visible to all ... will stop a few people from speeding for the 10 seconds it takes them to drive past the cop.",
            "title_similarity": "0.86243796",
            "sentiment_compound": -0.8742
        },
        {
            "id": "h7vq983",
            "score": 11,
            "text": "The color of police cars have little to bearing on criminal activity.\n\nFirst let’s go down history lane:\n\nWhy are cop cars black? Black was universally the color of all cop cars. Why? Cause it was cheap. As Henry Ford said you can have a model T so long as it’s in black.\n\nThis changed however post WWII where the famous black n whites rolled out. The white hood and doors thought to increase visibility, (black during snow). In the 70s we saw a higher degree of change of design as computer technology and vinyl improved.\n\nThe next big change came in the 90s, where in the US we had the major crack and gang epidemic. Blue was chosen for many departments as a more “friendlier” color. \n\nThere are other events but the next recent major trend/change has been the rollout of the new all black squad cars. Why the change back?\n1. Homage back to tradition \n2. It’s thought to present officers for themselves and to the public be more professional. Think of a black limo or suit. The saying goes everything looks better in black. \n\nTLDR: the color scheme has proven to impact crime very little, and it’s more about professional perception. I’d say the color of their cars are the least of their worries today, but there it is.",
            "title_similarity": "0.7159119",
            "sentiment_compound": -0.6848
        },
        {
            "id": "h7vq8tl",
            "score": 8,
            "text": "You ever slowed down after seeing a pretty plain looking Ford Explorer that you thought might be a cop, but then turned out to just be an ordinary Ford and not a cop?",
            "title_similarity": "0.6851878",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7v4a0t",
            "score": 203,
            "text": ">In my mind police cars should be painted bright colors that clearly say I'm here, don't commit crime while I'm here.\n\n....and when they aren't there?\n\nPart of the benefit of having not overly conspicuous vehicles is that the \"threat\" of a police officer being nearby is reasonable. You can't spot them a mile away. So it's, in theory, a natural deterrent.",
            "title_similarity": "0.7996663",
            "sentiment_compound": 0.8254
        },
        {
            "id": "h7v5flt",
            "score": 0,
            "text": "Its about maintaining a presence, if people know the cops could be around any corner then the idea is that they'll be less likely to speed in the first place.",
            "title_similarity": "0.64779276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vtxfe",
            "score": 0,
            "text": "Honestly, police vehicles like this are extremely easy to spot during the daytime.  My guess as to why they’re configured that way today is more for conducting nighttime no-knock raids on drug dens. They’re less notable from a distance up the road at night if the dealers have lookouts.",
            "title_similarity": "0.7341371",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h7vxbfw",
            "score": 0,
            "text": "If your not breaking any laws you shouldn't have a problem.",
            "title_similarity": "0.42912966",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h7v1p8z",
            "score": 112,
            "text": "[deleted]",
            "title_similarity": "0.014985187"
        },
        {
            "id": "h7v7iu1",
            "score": 68,
            "text": "This maybe doesn't reflect well on me as a person, but when I'm speeding on a highway, usually because I'm hauling solo for 8 hours to go home for the holidays and want to shorten the trip as much as I reasonably can, I'll slow down when I see an officer .... then immediately speed back up when they're out of view.  It doesn't have a long term impact on me.  Getting a ticket, and the associated higher costs, is likely going to stick with me a lot more.",
            "title_similarity": "0.6093904",
            "sentiment_compound": 0.5335
        },
        {
            "id": "h7v4lcx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.01552302"
        },
        {
            "id": "h7vqnps",
            "score": 1,
            "text": "Can I offer the suggestion that the goal of police actually IS to catch people in the act, and not to enforce the law by their presence? Police don't make nearly as many arrests/catch as many infringements if people know of their presence. If police constantly made their presence known, people wouldn't have to hide their criminal endeavors eith as much ingenuity as they do today.",
            "title_similarity": "0.7695031",
            "sentiment_compound": -0.4371
        },
        {
            "id": "h7vx7qe",
            "score": 1,
            "text": "Agree, stealthy is not healthy.",
            "title_similarity": "0.28837472",
            "sentiment_compound": 0.0366
        },
        {
            "id": "h7wlky7",
            "score": 1,
            "text": "Someone has probably already brought this up but maybe catching someone in the act because they didn't know any police were there could possibly be helpful?\n\nImagine there's someone who is speeding on a highway. They are obviously very dangerous and could cause a wreck. That would be terrible, right?\n\nNow, let's say that the person driving this car likes to go very fast but is very careful to make sure they slow down if they see a police officer so they don't get caught. If they can't see the police car because of the darker color cars, they will keep speeding and get a ticket which might deter them from speeding again. \n\nHowever, if the car is easy to spot, they will know that the police are there and will slow down to avoid getting caught but once out of range they will start speeding again.\n\nObviously, tickets aren't going to discourage everybody from driving fast but it might discourage some people which could potentially make the roads safer.\n\nAnother point is that the brighter colors could make the car look very tacky and I doubt there are any police officers that would want to drive a clown car.",
            "title_similarity": "0.8385834",
            "sentiment_compound": 0.6259
        },
        {
            "id": "h7v2m7z",
            "score": 48,
            "text": "In the UK you rarely find speed cameras on motorways because they found that actually, more accidents were caused by people trying to brake suddenly to avoid getting a speeding ticket than what were caused by actual speeders. \n\nA similar logic could play with regards to speeding and brightly coloured police cars. People see a police car (or what they think is a police car) and take evasive action to avoid the police and end up actually causing an accident. If the police car is less obvious, the speeding driver may not realise until the police try and stop them. \n\nAgain, in the UK we have times where drivers see reflective markings on what they think might be a police car so will suddenly slow down only to realise it’s “just a highways agency vehicle” and speed right up again. The amount of braking that occurs because it “might be police” is ridiculous.",
            "title_similarity": "0.7823121",
            "sentiment_compound": -0.8357
        },
        {
            "id": "h7vj0bf",
            "score": 6,
            "text": "Most departments are more interested in social engineering rather than show of force.  Any force bigger than about 200 officers uses some form of crime analytics to determine where they generate tickets, arrests, and crashes.  This combined with citizen complaints about jag offs speeding through their school zone is why there is a cop there with a speed trap.\n     \nTo make the argument for asthetics color barely matters vs shape.  Eyes are designed to catch things that are irregular patterns.  Which is why a cop car with out a light bar is harder to recognize.  Most marked cars have a light bar, side light, and a push bar.  If you don't notice that you won't notice anything else.",
            "title_similarity": "0.7960906",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h7vsqn7",
            "score": 9,
            "text": "Is that a thing? I've only seen police officers in white cars with the white and blue checked pattern and orange lines (except undercover cop cars who were driving somewhere). I'm not American though so maybe it's that.",
            "title_similarity": "0.7524253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vmnco",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.01552302"
        },
        {
            "id": "h7x4axc",
            "score": 2,
            "text": "I'm genuinely curious- Why are so many people referring to low key cop cars and speed cameras as \"profit/revenue making\"? More so the speed cameras, actually. If you don't run a red light, you don't get caught on camera, and you don't have to pay. If society followed basic law and order, there would be no revenue to be generated from these cameras.\n\nSecondly, cops can't be everywhere, it's expensive manpower, so knowing that there are cameras everywhere, dystopian or not, will make people less likely to commit crime and make others feel safe as a result. Isn't that the goal?\n\nAlso, more surveillance is exactly what we need and will help solve so many crimes.\n\nI just don't understand how cameras that catch you breaking the law at a public place can be termed revenue generating? \n\nSame goes for unmarked cars- The fine is meant to be a deterrent for the FUTURE. It's not just about having a flashy police car which you spot and then decide not to run the light. It's about making you pay a fine and punishing you so that the next time you get any bright ideas, you remember the fines and hassle you went through, and choose not to go through it again.\n\nDon't break the law, don't pay fines and nobody profits off of you.",
            "title_similarity": "0.82024",
            "sentiment_compound": 0.811
        },
        {
            "id": "h7y8icf",
            "score": 2,
            "text": "This comment section tastes like boot.",
            "title_similarity": "0.15089321",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7vtfa9",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.01552302"
        },
        {
            "id": "h7vvwrn",
            "score": 3,
            "text": ">In my mind police cars should be painted bright colors that clearly say I'm here, don't commit crime while I'm here.\n\nIn other words, \"Don't commit a crime while I'm here, do so when I'm not here.\"\n\nThe goal is to make it so people don't feel comfortable committing crimes, NOT to make it so people are comfortable doing crimes - except when police are around.\n\nI also don't understand why you're okay with cops in unmarked cars, but not police cars? That makes no sense.",
            "title_similarity": "0.8961052",
            "sentiment_compound": 0.4082
        },
        {
            "id": "h7w60lu",
            "score": 3,
            "text": "To me the much bigger problem with it is that it makes it harder for people to recognize that the people pulling them over are actually police. \n\nAt night in particular there’s no way to tell if you are being pulled over by a black police dodge charger with charcoal grey lettering, and flashers hidden behind the windshield or grill, or just someone with a black charger who bought lights. \n\nIf it were a clearly marked police car and it was fake, it would be much more likely that the real police would catch the person and charge them with impersonating a police officer. Police cars that have only subtle differences with normal cars makes it much easier to impersonate a police officer and much harder to catch impersonators.",
            "title_similarity": "0.86989653",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7w32gf",
            "score": 20,
            "text": "I feel like people shouldn't have to see a police car to not do something illegal.",
            "title_similarity": "0.69818753",
            "sentiment_compound": 0.6623
        },
        {
            "id": "h7v35pv",
            "score": 9,
            "text": "I think traffic cops / cameras being hard to identify quickly is part of the reason people try to stay constantly conscious of their speed while driving, and is completely intentional (they still have to be identifiable when they try to stop someone, imagine your reaction if a random undercover car randomly starting to chase you and ordering you to stop...)\n\nAs for more 'intentional' crimes like assault, or theft, I'd think someone contemplating this kind of thing would be acutely aware of what the police looks like, regardless of the specific design.",
            "title_similarity": "0.8198649",
            "sentiment_compound": -0.5165
        },
        {
            "id": "h7v790k",
            "score": 1,
            "text": "How would you say that people's behaviour is influenced if they know that they cannot see police that are enforcing speeding laws?  Would that make them more or less likely to speed as opposed when they know that they can see the cops from a mile away?",
            "title_similarity": "0.78046095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vjpwr",
            "score": 1,
            "text": "if its all number license plate its a op",
            "title_similarity": "0.24489516",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h7vobdi",
            "score": 1,
            "text": "Different divisions within a law enforcement agency have different goals and different methods to achieve them. \nUniformed patrol officers are there to respond to calls for service, patrol their assigned areas, and whatever proactive enforcement they have time for in between. These are generally extremely visibly marked and circulating throughout the community. \nMost of the investigative divisions are, by their nature, reactive. They are investigating the crimes originally reported to uniformed officers. Most places they drive around unmarked. Not in an attempt to disguise them, necessarily, but sometimes they need to blend a bit more and more often than not having them waved down for some other issue may hinder the investigation they’re working.\nNarcotics and street crimes units are almost always proactive units, generating their own caseload. They are almost always unmarked, often in less than traditional vehicles. \nTraffic enforcement units are tasked with enforcing traffic laws and responding to citizen complaints about traffic violations. These laws are enforced, in large part, with the goal of reducing traffic crashes and related injuries. They are often a mix of marked cars, unmarked cars, and motorcycles. Their ability to catch these violators is enhanced greatly by lower visibility. \nIf your argument is you only want people obeying traffic laws when there is an obvious cop car around, great. We will need a lot more officers and a lot more cars. I have found that flashing lights out of nowhere not only affects the violating driver, but those around them wondering where the next one is hidden. \nFull disclosure, I am a traffic cop. I get no personal joy or extra days off for writing more tickets. My absolute favorite thing is responding to complaints in areas, doing directed enforcement in those areas, and returning later to find the number of observable violations has reduced. The bottom line is hidden or not, if you’re not violating the law you needn’t worry where I may be hidden.",
            "title_similarity": "0.7319227",
            "sentiment_compound": -0.9689
        },
        {
            "id": "h7vompb",
            "score": 1,
            "text": "I agree with you when it comes to urban areas but if a cop is easily visible in the middle of nowhere speeders will just slow down to the speed limit until they are out of the cop's sight and then keep on speeding.",
            "title_similarity": "0.8140119",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h7vv8sn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.01552302"
        },
        {
            "id": "h7vwkvi",
            "score": 1,
            "text": " >When police cars are black with dark lettering making it difficult to identify the car, to me, it says that police are not there to prevent crime but to catch people in the act of it. \n\nGood. So??\n\nWhy is it ok to commit crime when a police car is not around???",
            "title_similarity": "0.86889577",
            "sentiment_compound": 0.3865
        },
        {
            "id": "h7vyai7",
            "score": 1,
            "text": "You can call 911 and have them confirm you are being pulled over by a police car.",
            "title_similarity": "0.61787367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vyn1w",
            "score": 8,
            "text": "If everyone knows they are there, then they won’t commit a crime. The whole point IS to catch someone committing a crime",
            "title_similarity": "0.6311109",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h7vzqrv",
            "score": 1,
            "text": "Here in CT, lots of town and state police cars have their red and blue lights on all the time (not blinking). It’s fantastic. You see them and slow down.",
            "title_similarity": "0.6291547",
            "sentiment_compound": -0.4449
        },
        {
            "id": "h7w1ph3",
            "score": 1,
            "text": "I have a huge problem with “undercover” police in totally unmarked cars. Using public funds to deceive the public into punishment? That concept very obviously came from a concentrated government power having a distrust of the general public, and you fucking work for us so fuck you.",
            "title_similarity": "0.70999765",
            "sentiment_compound": -0.9273
        },
        {
            "id": "h7w35pr",
            "score": 1,
            "text": "I 100% agree with OP. Police should be a friend to their community, not an undercover set of \" eyes\" so to speak. CMV too.",
            "title_similarity": "0.62549746",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h7w3c4j",
            "score": 1,
            "text": "If people could recognize cop cars instantly they would change their driving habits whenever one was around. (Lets be honest, we all do this). \n\nUnmarked cars are to help catch people breaking traffic laws. \n\nPeople who break traffic laws put me at risk of injury or death. \n\nYeah,  I'm ok with it.",
            "title_similarity": "0.8158138",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7w59hn",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.014985187"
        },
        {
            "id": "h7w70ex",
            "score": 2,
            "text": ">don't commit crime while I'm here\n\nSo is a cop supposed to deter crime only in their immediate vicinity? Doesn't seem efficient to me. If there could be a cop car around any given corner, I'm definitely never going to risk getting a ticket, so I'm always going to drive at the limit.\n\nIt's not that it's primarily supposed to just catch someone in the act, it's supposed to deter it from happening in the first place.",
            "title_similarity": "0.8721328",
            "sentiment_compound": -0.0915
        },
        {
            "id": "h7w86fm",
            "score": 1,
            "text": "> it says that police are not there to prevent crime but to catch people in the act of it.\n\nHow exactly do you define preventing a crime and being there to catch people in the act of committing a crime any different from one another? Bouncers are inside and in front of clubs, stationed to prevent obstructions and remove problems the moment they happen rather then moments after. Sure, they may be identifiable, they stand out differently from the rest of the crowd, but what is intrinsically different about being a cop who is supposed to prevent crime, and literally stationing themselves in a location and scenario where they are able to prevent one as they happen? In most cases, the latter sounds like the better given proper funding and lack of over-step by authorities (but that's an entirely different conversation.)",
            "title_similarity": "0.79965585",
            "sentiment_compound": -0.9273
        },
        {
            "id": "h7wa4qm",
            "score": 1,
            "text": "In Washington State it is illegal for an unmarked police vehicle to make a traffic stop unless it's part of an ongoing investigation.  They still do but if you take it to court it gets thrown out.",
            "title_similarity": "0.7616346",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h7wep8i",
            "score": 1,
            "text": "Slightly unrelated, but police are not here to prevent crime. Rather, they respond to reports of crime. It's a subtle distinction but one I feel is important.",
            "title_similarity": "0.6931515",
            "sentiment_compound": -0.8559
        },
        {
            "id": "h7weyqj",
            "score": 1,
            "text": "If they have a bright green car they won’t catch anyone speeding or committing a crime. If they are hidden they’ll have a higher chance of catching someone on the act of doing something illegal. A bright green or white car would just tell the criminal that they’re there and either wait till they leave or go rob another place.\n\nI think instead of having a bright car, they should have a regular citizen car. Hidden lights but maybe something like a Subaru Outback. Something that makes them look like a normal citizen instead of a cop. They’ll catch way more criminals that way I think.",
            "title_similarity": "0.8465485",
            "sentiment_compound": -0.3898
        },
        {
            "id": "h7wgp62",
            "score": 1,
            "text": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Autobahnpolizei_Niedersachsen_Fahrzeug.jpg \n\nYou would probably like the german police car.",
            "title_similarity": "0.48786452",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7whekh",
            "score": 1,
            "text": "If people commit less crime around police cars, there could be a legitimate strategy to minimise crime around ‘normal’ cars as well, if they are suspected of potentially being police. Therefore more crime is being prevented in the absence if police.",
            "title_similarity": "0.7395647",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h7wirav",
            "score": 1,
            "text": "So you’re condoning crime ? Or?",
            "title_similarity": "0.41829675",
            "sentiment_compound": -0.6278
        },
        {
            "id": "h7woeoh",
            "score": 1,
            "text": "Peace officers they should always be peace officers this shit is ridiculous",
            "title_similarity": "0.38570088",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h7wqsv0",
            "score": 1,
            "text": "Hmmm now that I think about in glad they're a light bright blue and white in my country",
            "title_similarity": "0.2048459",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h7wqt8d",
            "score": 1,
            "text": "Why can't it be both. Why can't they be preventing and stopping ghe crime if it occurs? I don't see why yiu think it's either or? Since cops can't litrally be everywhere it serves as an added deterrent for you drive safely since cop could be around the corner just in case you decide to break the law. \n\nThe real question becomes, why do you care so much if you aren't breaking the law anyhow? What does it matter if they are black or blue. If you aren't breaking the law anyhow the color means nothing. Getting upset that you can't see a cop ahead of you is indicative of someone trying to get away with something and getting upset that there is someone potentially there to hold them accountable.\n\n It's like getting mad that banks have security cameras hidden around. Do you think banks shouldn't be allowed to have cameras. Just like the cop vehicles they act as both a deterrent and a tool to catch folks in case they do something like rob a bank. This should be a pretty cut dry example using the same logic you presented against you here.",
            "title_similarity": "0.8470258",
            "sentiment_compound": 0.7002
        },
        {
            "id": "h7wr6be",
            "score": 1,
            "text": "People are going to commit crime, whether or not cops are visible. Some people won't. Those who wouldn't with cops around will still do so when there aren't, and nobody gets saved. But one bad guy does something bad because he doesn't see a cop car and gets arrested, and taken off the streets (and their ability to commit more crime)? I think that's what it's about. \n\nYou shouldn't fear the police because you can't see them on every corner, because the bad guys can't either. Not to mention you could target a police vehicle before you commit said crime and immediately and effortlessly eliminate the most obvious hindrance.",
            "title_similarity": "0.84512436",
            "sentiment_compound": -0.9752
        },
        {
            "id": "h7wusdv",
            "score": 2,
            "text": "Police can't be everywhere all the time. If they were always highly visible, then a potential criminal would know the area is clear when they're not in sight. By occasionally making police not so easy to see, they are able to create an environment in which a potential criminal can't know that they aren't around, and thus are able to punch above their weight in deterrence.",
            "title_similarity": "0.7220531",
            "sentiment_compound": -0.7293
        },
        {
            "id": "h7ww910",
            "score": 3,
            "text": "Unmarked police cars play an extremely important role in evidence gathering. Let me set the scene. There are two guys dealing drugs and while the police know about it, they don't have enough evidence to gain a warrant to search, or warrant to arrest. They send a fully marked car with massive writing that says 'POLICE' side to follow the 2 guys to gather the evidence. The dealers are going to spot it a mile away and go into hiding. \n\nNow think about if the police send a undercover /unmarked car instead. They could park anywhere and blend with usual traffic and remain hidden to catch the 2 guys in the act. \n\nYou could argue on why they don't use just a regular car. However, doing so would eliminate a major feature of police cars, the lights and sirens. If an incident was to happen and the 2 officers were the closest, but stuck in general traffic. It can cause chaos in a time where literal seconds can be  the difference between life and death.\n\nWhen most people think undercover cars, they think of Highway Potrol or Road Policing Command (QLD) using them. These serve the same purpose just with different departments using them. Remember, policing isn't about the victims, it's about gathering evidence against suspects to either fine or put away.",
            "title_similarity": "0.82766235",
            "sentiment_compound": -0.9171
        },
        {
            "id": "h7wws2i",
            "score": 1,
            "text": "to give a visual to OP's view.....good guy [UK Police](https://electrek.co/wp-content/uploads/sites/3/2021/06/Tesla-Model-3-police-car-UK-hero.jpg?quality=82&strip=all)",
            "title_similarity": "0.5655671",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wxyaz",
            "score": 1,
            "text": "Know what prevents crime? Catching criminals in the act, arresting them, having a DA that will actually charge a crime, and a judge who will apply a sentence. \n\nCriminals in jail commit crimes, but rarely against free citizens.",
            "title_similarity": "0.6398454",
            "sentiment_compound": -0.8706
        },
        {
            "id": "h7wy03m",
            "score": 1,
            "text": "The whole point is to catch the people committing the “crime” whether be a crime or a traffic violation. As a cop I can tell you that it doesn’t really matter if you’re in a marked or unmarked car, people will still do stupid stuff right in front of you, just not as frequently.",
            "title_similarity": "0.84202886",
            "sentiment_compound": -0.8558
        },
        {
            "id": "h7wz7yq",
            "score": 1,
            "text": "So, police in bright colours broadcast that they are here and so better not commit crimes. This would work, if the police had resources to be in many places and the people wanting to commit crimes would have no place to commit them. This is clearly an unreasonable assumption. The places where police are are a very fraction of all potential places where crimes can be committed. So, what if police dresses conspicuously? Then the potential criminal has to consider the option that there are police around even if he doesn't see them. And that should produce a bigger deterrent against crime as it would apply even in places where there are no police present at all. \n\nThe concept of religious belief that centers around a God that will see you even if nobody else sees is based on this same idea. This kind of religions started to pop up when the human communities became so big that nobody could keep an eye on everyone else. An invisible all seeing God was a good concept to keep people still following the rules even when nobody else was seeing them.",
            "title_similarity": "0.77959377",
            "sentiment_compound": 0.8171
        },
        {
            "id": "h7wzvd3",
            "score": 2,
            "text": "Just to mention it, without trying to change anyones view: A lot of countries in Europe have the type of police cars you are looking for. Painted with one thing in mind, being most easily spotted.",
            "title_similarity": "0.62286186",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h7x0c32",
            "score": 1,
            "text": ">to me, it says that police are not there to prevent crime but to catch people in the act of it.\n\nIf cars are immediately recognisable, that only deters crime when police cars are visible.\n\nIf any car could potentially be a police car, there's more incentive to obey the law all the time.",
            "title_similarity": "0.8657292",
            "sentiment_compound": -0.5183
        },
        {
            "id": "h7x1qdq",
            "score": 1,
            "text": ">a traffic cop sitting on the side of the road in a difficult to identify vehicle does nothing to stop people from speeding rather only to catch one of the drivers speeding or driving recklessly. \n\nBut isnt that a good way to stop the encouragement of speeding? You dont have to be hit by a car in order to know it hurts. Same applies here.",
            "title_similarity": "0.9005624",
            "sentiment_compound": -0.7694
        },
        {
            "id": "h7x25d4",
            "score": 1,
            "text": "I wouldn't say their job is preventing crime, in the first place. This is real life, not Minority Report.",
            "title_similarity": "0.61930716",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h7x2ew3",
            "score": 1,
            "text": "If there weren't any subtle cruisers trolling around to \"catch\" speeders, those same speeders are more likely to just speed every time they think it's safe to do so.\n\nAdding in the sneaky cruisers means any time someone thinks it's possibly a cop, they're more likely to drive slow and defensively, especially if  they've been pulled over by a sneaky cruiser before.\n\nCruisers are, at least in my area, often placed in high collision areas where speeding is a problem. Bare minimum this makes people drive more carefully in these areas regardless of if there's a visible cop. Provided they've experienced that \"oh lord, where'd that cop come from\" moment before.",
            "title_similarity": "0.78229475",
            "sentiment_compound": -0.6003
        },
        {
            "id": "h7x2mck",
            "score": 1,
            "text": "What if, and this might sound odd, but what if we didn't have police at all? They're not actually as useful in serving their community as many people still think. They're not legally obligated to protect you from harm. About 4% of their time is spent addressing actual violent crime.",
            "title_similarity": "0.66292036",
            "sentiment_compound": -0.9562
        },
        {
            "id": "h7x3y7k",
            "score": 1,
            "text": "ACAB",
            "title_similarity": "-0.14238416",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7x65k4",
            "score": 1,
            "text": "You think that's bad my town decided the best way to upgrade the white suvs with blue lettering was replacing the blue with reflective white. It's like 2 shades off from white.",
            "title_similarity": "0.57571864",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h7x6g2i",
            "score": 3,
            "text": "The overall effect of having a situation which allows police to ticket unknowing drivers in certain situations generates a fear of being ticketed in drivers even when there is no police around. That means you need less police to \"enforce\" a larger area, which in general, if you're not an anarchist, is a good thing. Doesn't take away from how shitty it is to be ticketed and that we could do a lot more to stimulate people to want to follow the law instead of being punished for not doing so.",
            "title_similarity": "0.772633",
            "sentiment_compound": -0.6728
        },
        {
            "id": "h7x78bn",
            "score": 1,
            "text": "They're called Law Enforcement, not Crime Prevention.\n\nYes, I realize that a key element of the police is actually preventing crime from occurring, but the lion's share is on the enforcement side. After a crime is committed.\n\nThe deterrent isn't a cop in a brightly colored vehicle, it's knowing that if you commit a crime you'll be caught and jailed.",
            "title_similarity": "0.78287196",
            "sentiment_compound": -0.7433
        },
        {
            "id": "h7x7m6g",
            "score": 1,
            "text": "Cops don't \"stop\" crimes, they just show up late and do an investigation. That's pretty much it. The idea that they're \"crime stoppers\" is ridiculous.",
            "title_similarity": "0.7216574",
            "sentiment_compound": -0.2292
        },
        {
            "id": "h7x85lx",
            "score": 1,
            "text": "The police just like any other company has goals to meet for it to get further founding and make rich people feel calmer.",
            "title_similarity": "0.5364465",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h7x8ztt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.01552302"
        },
        {
            "id": "h7xa5xv",
            "score": 1,
            "text": "When I was a kid I was struck by a comment made on the radio by the head of the Iowa State patrol. A holiday weekend was coming up, a time when car travel would rise by quite a bit, and with it accidents. \n       The trooper went on the air ahead of the weekend to say, “we are going to be patrolling the highways here and here and here, especially between these hours that are most traveled“ And he said, “don’t speed, because we will catch you.“ \n    The radio DJ asked why he would say and do that, because now the troopers would not be able to catch as many speeders, since they would be warned. \n      The trooper said, “our goal is not to write tickets. Our goal is to keep people safe. And people are safer when people drive the speed limit and more carefully. The only purpose of writing tickets is to motivate people to obey the laws so that they stay safe. If I tell people that they are in danger of getting a ticket it will drive slower. We’re not here to play gotcha. And we’re not here To raise money.”",
            "title_similarity": "0.6364682",
            "sentiment_compound": 0.5936
        },
        {
            "id": "h7xaavi",
            "score": 1,
            "text": "Police should be identifiable in case of an emergency. Catching criminals is a secondary job and they're not military so they don't need these covert operations to catch speeders. So you're absolutely correct sir.",
            "title_similarity": "0.7893498",
            "sentiment_compound": -0.743
        },
        {
            "id": "h7xapc7",
            "score": 1,
            "text": "Sometimes preventing crime IS catching people in the act, is it not? Most crimes are committed by criminals who commit them regularly, not by good citizens who break laws by accident. \n\nNot sure about your area and I’m sure there’s differences. But in mine, undercover and practical under covers are not there for petty traffic violations. They’re there for human trafficking, drugs, gang related stuff… you know, real crime.",
            "title_similarity": "0.7659858",
            "sentiment_compound": -0.9248
        },
        {
            "id": "h7xb0eh",
            "score": 1,
            "text": "Say for instance there's a van going around the streets to kidnap kids. If they see a corner where there's a bright pink police car, i dont think they'll go \"let's stop and call it a day\". They'll just find a different street/corner where there are no bright pink police cars. Doing this gives them leverage to know where's the best place to kidnap kids because no bright pink police cars are around.",
            "title_similarity": "0.8152547",
            "sentiment_compound": 0.2705
        },
        {
            "id": "h7xbany",
            "score": 1,
            "text": "People act differently in the presence of an authority figure. If every cop car had casino lights and neon pink bubble lettering or some shit, you'd be much much much less safe in the absence of them",
            "title_similarity": "0.70449746",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h7xbiac",
            "score": 1,
            "text": "Was recently doing some interstate right lane cruising(60 in a 65), when I had a beater car with tinted windows driving in my blind spot and not passing. After about 30 seconds I eased up so they would pass and I could get a look at this bad driver. When I turn my head and see a cop on his laptop looking back at me I got instantly scared. Not only were they driving in an unsafe manner, they were clearly trying to be sneaky and catch me on something.  I did my best smile and wave, but i was pretty agitated by the encounter.",
            "title_similarity": "0.7720529",
            "sentiment_compound": 0.074
        },
        {
            "id": "h7xerxp",
            "score": 1,
            "text": "1st world countries have police cars painted to be visible even in heavy fog. Also, not sure for all but at least for a few of them, 2nd world countries.",
            "title_similarity": "0.7276664",
            "sentiment_compound": -0.1232
        },
        {
            "id": "h7xeuzb",
            "score": 1,
            "text": "I think you keeping the law shouldn't be tied to cop presence. Cops are here to enforce laws,not show up to remind you that you shouldn't be a criminal.\n\nGoing by your traffic example you should always drive lawfully and yeah, if you were speeding or doing reckless driving you should be caught. \nYou went as far as say don't commit crimes while I'm here. Are you implying that when cops aren't around you should commit crimes?\n\nThat is why I think we need to establish better laws for citizen arrests. If I see you commit a crime, you can be sure I'll report you; but we both know unless it's something serious or you find the rare cop who will do something about it, no one will even bother finding you for a scolding.\n\nEdit: Your edit pointed out you are allowed to feel safe - and I absolutely agree. But cop presence shouldn't be what determines if you can or can't feel that way.",
            "title_similarity": "0.8795445",
            "sentiment_compound": 0.4558
        },
        {
            "id": "h7xfomo",
            "score": 1,
            "text": "The cops aren’t here to serve and protect anymore. They are here to fight crime and pass judgement. We’ve totally moved into a police state and gave them far too much power without any training.",
            "title_similarity": "0.70511544",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7xgpvf",
            "score": 1,
            "text": "The goal of police is not to prevent or reduce crime. It is to protect hegemony. If they can make some money by shaking down poor people along the way then they are happy to do that too. But never lose sight of the fast that police exist to protect the wealthy from the poor.",
            "title_similarity": "0.7038734",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h7xh3ud",
            "score": 1,
            "text": "I’m with you",
            "title_similarity": "-0.15288588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xh5x1",
            "score": 1,
            "text": "I always complain that those cruisers are bad at both being visible and being subtle. They are clear as day when parked on the side of the road for speed traps but if I ever was looking for a police because I needed one I feel it would be hard to find them.",
            "title_similarity": "0.8163247",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h7xhfwh",
            "score": 1,
            "text": "I used to think like this, but then I realized that I don’t endorse the view for anything except speeding. For example you probably want cop cars lurking around to prevent people from breaking into other cars, or assaulting people, or doing any number of other things that are actually bad. Having lurking cop cars that aren’t easily recognized encourages the perception that you don’t know whether you’re being watched so best behave even if there’s no obvious reason. \n\nThe real issue is that most of us don’t think speeding should be particularly illegal, and/or that speed limits should be much higher. Driving in the northeast everyone does 85 in a 65 and it would be nice to just acknowledge the real speed limit is 85 and stop randomly ticketing a small fraction of people engaging in normal behavior.",
            "title_similarity": "0.8673405",
            "sentiment_compound": 0.6608
        },
        {
            "id": "h7xi98w",
            "score": 1,
            "text": "Police departments auction off their cars after a certain amount of time. The markings are generally taken off, but it still kinda looks like a police car. I always slow down around them, just in case they are undercover. \n\nIf police cars were all very bright and noticeable, they would only slow people down when present. How is it better that cars only slow down when in the obvious presence of a police car, as opposed to every car that might be a police car?",
            "title_similarity": "0.80111367",
            "sentiment_compound": 0.9104
        },
        {
            "id": "h7xkhkx",
            "score": 1,
            "text": "The point of the police cars being easily spotted to to be able to find them when there is an emergency.",
            "title_similarity": "0.62942076",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7xkio1",
            "score": 1,
            "text": "Police vehicles in North America usually use the same vehicle classes / types all over. It’s easy as shit to spot them regardless of the livery they’re in, it’s kind of a joke IMO.",
            "title_similarity": "0.59137625",
            "sentiment_compound": 0.128
        },
        {
            "id": "h7xlf21",
            "score": 1,
            "text": "Having covert units to catch speeders prevents people from speeding because it cements the message that you could always get pulled over. It increased the odds of catching speeders.\n\nIf all police cars were used as very visible deterrents, sure, they’d deter crime around them, but criminals would be emboldened when they don’t see a cop given the added confidence that they won’t get caught. Same thing goes for speeders.",
            "title_similarity": "0.82486045",
            "sentiment_compound": -0.0946
        },
        {
            "id": "h7xnbql",
            "score": 1,
            "text": "Honestly they should just have two departments. One department for common misdemeanors, community patrols, traffic assistance that are white and clearly visible. It provides a feeling a presence to the community. \n\nFor the crime investigations or high profile stuff, just use a regular looking vehicle, but they can't do the stuff I mentioned above. This gray and dark bullshit is just making undertrained cops feel like they're cosplaying The Punisher or some Bobby Badass when they pull over grandma for a busted taillight on a Tuesday morning.",
            "title_similarity": "0.7936461",
            "sentiment_compound": -0.431
        },
        {
            "id": "h7xndne",
            "score": 1,
            "text": "Think about the panopticon. Criminals can't see you but you can see them, and that causes them to be more obedient.",
            "title_similarity": "0.67767465",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h7xoiek",
            "score": 1,
            "text": "Maybe if society was ACTUALLY interested in improving, we would be working on ways to improve where people won't feel the need to commit crime, instead of cops playing \"Gotca!\"\n\nBut the US is NEVER interested in addressing causes.  Only symptoms.",
            "title_similarity": "0.71604514",
            "sentiment_compound": 0.2156
        },
        {
            "id": "h7xq1g4",
            "score": 1,
            "text": "Well you should have both. One bright  for normal events and actions(so people can see you and go to you when needed) and one for special sneeky cover action. Like when they storm the house of a drug lord again or when there are armed attacks where they could already be targeted in their vehicles etc.\n\nAlso brightly colored car so people know that they can find help and to lessen the antagonisation of police.",
            "title_similarity": "0.73964435",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h7xq917",
            "score": 1,
            "text": "I don't see an issue with them catching people committing crimes, and I don't want the people committing crimes to specifically wait until the cops aren't around to commit them. \n\nWhat you're trying to describe is dodging crime, not what you're calling it, avoiding crime.",
            "title_similarity": "0.7891338",
            "sentiment_compound": -0.8836
        },
        {
            "id": "h7xsbrb",
            "score": 1,
            "text": "Really more to support your view but doesn't having difficult to identify police cars make it easier for a bad guy to impersonate an officer and pull someone over to harm them?",
            "title_similarity": "0.81627536",
            "sentiment_compound": -0.4614
        },
        {
            "id": "h7xswut",
            "score": 1,
            "text": "Won’t change your view. You’re right. Here in France it’s either white with a big sign clearly visible with written \"police\", or a normal car but with a blue alarm above it.",
            "title_similarity": "0.6293323",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h7xsxnf",
            "score": 1,
            "text": "Since I go days sometimes without seeing a police officer am I not protected? Am I only protected when in the presence of a police officer? I'm not buying this premise at all, I'm detecting a vibe from someone who has been stung a few times by these camouflaged cops.",
            "title_similarity": "0.6582023",
            "sentiment_compound": 0.2153
        },
        {
            "id": "h7xt2lf",
            "score": 1,
            "text": "Neither should their uniforms be dark or camp colored",
            "title_similarity": "0.3751629",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xt3lh",
            "score": 1,
            "text": "What about a place like Connecticut where the state police cars have no side markings at all?",
            "title_similarity": "0.53852403",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h7xuezg",
            "score": 1,
            "text": "Since there aren't enough police to be everywhere, the criminals will just go where they don't see a police presence.    With unmarked police cars, they can catch the criminals unaware, and get them so they won't go to another location.",
            "title_similarity": "0.83125305",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h7xumuq",
            "score": 1,
            "text": "I would say have some balls and quit being a little bitch, desperate for shiny police cars around every single corner so you don’t feel like such a fucking pussy all the time?",
            "title_similarity": "0.7828354",
            "sentiment_compound": -0.464
        },
        {
            "id": "h7xy8if",
            "score": 1,
            "text": "They can do both and they are already doing it in many places. There are bright cars that can be used to patrol and show to the people that they are here , to make people feel safe and to prevent other from committing crimes, and maybe by keep doing that to an area, they will make that area safer. \n\nAlso there are dark coloured cars, that it’s not so obvious that they are police cars in order to catch criminal groups that they have already commit crimes and they will keep doing it, by catching them during the action while they were not excepting it.",
            "title_similarity": "0.818451",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h7xyjb0",
            "score": 1,
            "text": "Unfortunately, police aren't there to PREVENT crimes.  Of course, that's something cops want to do, definitely.  But they are legally bound NOT to really get involved until AFTER a crime has been committed.  This is why if you call in because someone is acting like a jerk, and you KNOW he's about to do something, but he hasn't actually done anything yet, or threatened anyone, the cops can't do anything except come out and talk to the guy.  No crime has been committed, they can't actually do anything.\n\nThat said!  The first step in policing is simply presence.  Presence very clearly deters the vast majority of crimes and makes places MUCH safer.  If your goal is to deter, bright marked cars are perfect for that.  However, if your goal is to catch wrong doers, then you're doing a different kind of policing, that is still just as valid and as effective.\n\nThink of it this way:  If you're a regular joe, not a criminal, and you see a cop driving down the road, the first thing you do is check your speed and adjust accordingly.  It's something you should have been paying attention to, but for whatever reason, you missed it and only corrected when you saw the cop.  Perfect example of deterrence.  But, let's say you're a street racer.  You're looking to race, but you see the cop, so you play nice until they leave, and then you start racing, potentially causing a crash and injuring/killing someone.  Bright marked cars does nothing to stop this kind of behavior.\n\nBut, a more difficult to identify car, or an unmarked one, works perfectly for catching those who have bad intentions and are simply waiting to be in the clear.  Now the cops are catching the bad guys and keeping everything safe for everyone else that way.",
            "title_similarity": "0.78589416",
            "sentiment_compound": 0.9879
        },
        {
            "id": "h7xzx4t",
            "score": 1,
            "text": "OP just wants to commit crimes in peace change my mind",
            "title_similarity": "0.55857956",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h7y09lt",
            "score": 1,
            "text": "Police cannot always be there.\n\nBy making them less visible, you are allowed believe that they are always potentially nearby. And criminals are too.",
            "title_similarity": "0.61577845",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h7y4fct",
            "score": 1,
            "text": "At the end of the day, no police department will ever be able to provide complete and total coverage throughout its entire jurisdiction. There will, inevitably, be times and places where police cannot be present. This is especially true in some smaller towns that might have a few thousand people but only a few dozen police officers. \n\nAccordingly, many American police departments want to foster the idea that they could be anywhere. If you've got 200 cops in a city of 125,000 people, you obviously won't actually be able to put police in every place that they might be needed. However, the existence of unmarked/low visibility police vehicles will still force potential criminals to consider the fact that police could still be nearby, even if they can't see the police. This provides additional deterrence to the extent that some people who would otherwise try to commit a crime if they believed that no police were nearby would refrain from committing crimes because they simply can't be sure that police aren't nearby. It also allows police to capture people who actually go ahead and commit crimes simply because they think that police aren't around.\n\nAs far as these departments are concerned, targeted high visibility patrol *alone* would only displace crime (it wouldn't make the public safer overall, but instead just move crime to different areas of the city or to different times of the day). The concern is that places they can't patrol become significantly more vulnerable to crime, and whatever deterrent effect they have when present almost immediately and totally evaporates once they leave. \n\nAlso, it's important to note that most departments do not have the majority of their fleet made up of low-visibility or unmarked vehicles. The only law enforcement agency I can think of that does this is the Connecticut State Police. Typically, low-visibility cars are not assigned to permanent traffic patrol. They serve multiple other functions (e.g., spontaneous surveillance), and they typically have ghost graphics that allow you to easily identify them if you're actively searching for an officer because you need help.",
            "title_similarity": "0.61443245",
            "sentiment_compound": -0.9471
        },
        {
            "id": "h7y6uzg",
            "score": 1,
            "text": "It does prevent crime in general. Not just catches it in the act. The knowledge that undercover police cars exist deters people from committing crimes because they never know if they are safe or not.",
            "title_similarity": "0.85302985",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7y8wwp",
            "score": 1,
            "text": "Search for German police cars. You can spot them immediately no matter if it's day or night.",
            "title_similarity": "0.5119",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h7y9x4o",
            "score": 1,
            "text": "You are exactly right, it’s not about public safety it’s about quotas and making money .  You are 7 times more likely to die if you involve a police officer in anything.  Blue line tyrant isis gang members, the biggest criminal gang in this country",
            "title_similarity": "0.56950915",
            "sentiment_compound": -0.8719
        },
        {
            "id": "h7y9xi6",
            "score": 1,
            "text": "I feel that police cars should be easily identified too. The black on black paint/lettering makes it hard for people to identify where an office is if they need assistance. My child has special needs and wouldn’t be able to identify the new cop cars very easily.",
            "title_similarity": "0.7783351",
            "sentiment_compound": 0.7501
        },
        {
            "id": "h7yf87u",
            "score": 1,
            "text": "I’d make the same argument for speed traps. Although I think those are just ways of mining money off of people who aren’t really posing a risk to themselves or others. \n\nA lot of law enforcement has nothing to do with protecting and serving.",
            "title_similarity": "0.72127414",
            "sentiment_compound": -0.5945
        },
        {
            "id": "h7yfana",
            "score": 1,
            "text": "I work on the road.  I spend most of my life in traffic and such.  If I alone were an unmarked/undercover officer holy shit would I be handing out so much justice.  I don't mean petty stuff either, I mean red lights run and extremely obnoxious passing/reckless driving.  \n\nThis makes me sad that the police don't get to see it nearly as often as it occurs because nobody does it around them.  For traffic specifically this makes me *want* unmarked/undercover police.  \n\nYou should always be driving reasonably as if a cop was nearby I don't have any sympathy for \"oops didn't know you were a cop\".",
            "title_similarity": "0.8396297",
            "sentiment_compound": -0.8192
        },
        {
            "id": "h7yhm6d",
            "score": 1,
            "text": "That would be pretty expensive to paint a car like that.\n\nA few years ago, Cleveland cop cars went from the black/white look to just black because painting that strip of white cost like $600.",
            "title_similarity": "0.45747325",
            "sentiment_compound": 0.802
        },
        {
            "id": "h7yhsfh",
            "score": 1,
            "text": "Based on your edit, I think you're wanting a visible presence of authority as a preventative. Right now, I'm thinking about this idea of the panopticon. It's a prison system in which a guard tower is placed in the middle, and the jail cells go all around that guard tower. The guard tower has black windows, so that the prisoners can't tell when the guards are looking at them. This prevents misbehavior because the prisoners are not aware of when they are being watched. \n\nI agree with your edit in that police should protect you and prevent crime, but I also think some people feel they need to do these illegal things. If it's a more nefarious crime, then obviously the crook is going to keep a heavy eye around to make sure that no police are around. The example you give is a police officer in an unmarked ghost car in a parking lot. If I was somebody who was breaking into vehicles and I saw the police vehicle, then I would say to myself \"oh there's a cop here, I should go do it somewhere else\". It's an unfortunate reality in life that some people are just the downtrodden, and unfortunately it pushes them to do things in life that they shouldn't. But having a marked police car would only serve its purpose as to show the robber where not to rob vehicles. And because police can't be everywhere always, they would need that little bit of panopticon to keep them weary.",
            "title_similarity": "0.7082293",
            "sentiment_compound": -0.9827
        },
        {
            "id": "h7yi8t7",
            "score": 1,
            "text": "this is a dumb idea",
            "title_similarity": "0.16408417",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7yibno",
            "score": 1,
            "text": "There are some people out there that will not stop doing a wrong action until they get caught and face a consequence (even if it’s something small like a traffic ticket). By wrong action I mean things that are relatively small that someone might be able to justify as largely harmless.\n\nMany of these people believe they will never get caught. If they are smart enough not to do these things right in front of the police, then yeah they probably won’t get caught.\n\nBut using unmarked police cars properly allows us to catch some of these people. For some proportion of them, once they get caught once, they won’t repeat the action. Isn’t that also preventing crime?",
            "title_similarity": "0.76943195",
            "sentiment_compound": -0.5935
        },
        {
            "id": "h7yik4z",
            "score": 1,
            "text": "I agree completely (and hope no one changes your view! :) ).\n\nI loathe \"stealth\" cop cars.  Undercover cops are needed, and they need non-cop vehicles.  But these aren't those.",
            "title_similarity": "0.8202393",
            "sentiment_compound": 0.2845
        },
        {
            "id": "h7yl7ew",
            "score": 1,
            "text": "Tarrant City Al would drive around with the light off. Almost hit a couple during my job delivering news papers.",
            "title_similarity": "0.5706039",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ympsl",
            "score": 1,
            "text": ">don't commit crime *while I'm here*\n\nWhy not take this to the logical extreme and make an app that shows where every law enforcement officer is at every moment, and their schedule for the rest of the shift?",
            "title_similarity": "0.5862045",
            "sentiment_compound": 0.2411
        },
        {
            "id": "h7ypbvw",
            "score": 1,
            "text": "I have seen black n white fake police cars on side of road in plain view. It slows down speeders. Of course they are in plain view.",
            "title_similarity": "0.77234626",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h7ypew4",
            "score": 1,
            "text": "So you're argument is that you think it's unfair to criminals that some police cars are dark?",
            "title_similarity": "0.689418",
            "sentiment_compound": -0.8617
        },
        {
            "id": "h7ypmly",
            "score": 1,
            "text": "OP, why are you asking people to change your view if you aren't willing to consider any valid arguments against it?  People have a made a bunch which support your own stated reason for your view which is to deter crime, not catch it.\n\nThe best deterrent of speeding is the worry that you could be caught speeding at any time, not just when police are visible.  If all police cars running radar were clearly visible, many people would speed at all times where they didn't see police.  By knowing there's a potential you're being clocked by police at any time, you're more likely to avoid speeding.\n\nHere's an example.  In France, they have photo-radar on the highways.  However, their laws state that drivers must be told whenever the photo radar is coming up.  Normal speed limit there is around 120km/h (it's been a few years since I've been there, I think it's actually 110 in rain, 130 in clear weather but it's not important).  EVERYONE speeds like 30 over the limit at all times there, except where the photo radar is indicated, then they all slow down.\n\nBy making all police running radar visible, you'd basically be inviting people to speed when they don't see police.  By allowing police to be somewhat obscured, people are always vigilant of their speed as they know they could be stopped for speeding at any time if they do so.",
            "title_similarity": "0.78590226",
            "sentiment_compound": 0.652
        },
        {
            "id": "h7ypo9a",
            "score": 1,
            "text": "Bob is running late for work so he decides to get on the freeway and speed. Bob is traveling at a speed well above the posted limit when he notices a police officer sitting on the side of the freeway because of the distinctive white color. Naturally he slows down to prevent getting ticketed. As soon as the officer is out of sight, he speeds back up so he is not late for work. About a quarter mile down the road he hits a small sedan killing a family of four. \n\n\n\nBob is running late for work so he decides to get on the freeway and speed. Bob is traveling at a high rate of speed well above the posted limit. Suddenly he passes a vehicle parked on the side of the road and realizes that he has just passed a cop. Bob gets pulled over and ticketed. After being ticketed bob thinks about his actions and starts waking up earlier for work so he no longer has to speed.\n\nEdit: grammar",
            "title_similarity": "0.68763936",
            "sentiment_compound": -0.4549
        },
        {
            "id": "h7yq17k",
            "score": 1,
            "text": "Unmarked police cars have been a thing since forever. Not sure the point of this post. I think the police should have the ability to use whatever color cars they want marked or unmarked. Motorcycles bicycles are also commonly used. Undercover cops are all around. Gotta catch the crims!",
            "title_similarity": "0.7335744",
            "sentiment_compound": 0.2335
        },
        {
            "id": "h7yvem2",
            "score": 1,
            "text": "Also if your in need of help they’d be easier to identify.",
            "title_similarity": "0.19421154",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h7yxvmq",
            "score": 1,
            "text": "I’m still confused about the statement I need police to feel safe",
            "title_similarity": "0.469025",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7yxvrf",
            "score": 1,
            "text": "Black and white with dark lettering is the least of our issues I see police cars that are literally just a regular car with the word gotcha that you can only see from a certain angle and it’s a sheriff",
            "title_similarity": "0.7646779",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7z308v",
            "score": 1,
            "text": "They should be easily identifiable because they are supposed to be a resource of assistance. How can you ask for help if it’s camouflaged?",
            "title_similarity": "0.30955786",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h7z4dy6",
            "score": 1,
            "text": "Wait until this person finds out about unmarked police vehicles. I saw someone pulled over by a white Dodge RAM with no lettering at all and a tiny light bar in the front dash. This is common in bigger metro areas.",
            "title_similarity": "0.71853983",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7z5fql",
            "score": 1,
            "text": "Wait you kind of just explained why having stealthy cop cars is a good thing. If a whole neighborhood or city section knows that cops have these vehicles, they will be more enticed to actually follow the laws. Even if that effects a few people’s behaviors, thats still less potential for crime.",
            "title_similarity": "0.77102065",
            "sentiment_compound": -0.1119
        },
        {
            "id": "h7z6i7d",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.01552302"
        },
        {
            "id": "h7z7m1r",
            "score": 1,
            "text": "Actually in Japan and South Korea I think it was they have like neon cop cars so that if someone needs help they can find the police easily. South Korea not so much but Japan has a tiny crime rate from everything I've heard so it seems to be going well there",
            "title_similarity": "0.68456644",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h7zhovn",
            "score": 1,
            "text": "Imagine blaming the cops for getting caught haha...\n\nUnmarked police car are intrapping people!\n\nDont blame breaking the law on cops...",
            "title_similarity": "0.8285525",
            "sentiment_compound": 0.2796
        },
        {
            "id": "h7zi962",
            "score": 1,
            "text": "How about just not committing a crime?",
            "title_similarity": "0.3889655",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h81ytr7",
            "score": 1,
            "text": "I strongly believe that people that are going to commit a lot of ‘minor’ crimes like speeding are opportunistic and will keep going until they have to suffer for it in some way. If they can see the cop or there’s a camera warning they’re going to slow down for the 200m they’re in view and then go straight back to speeding because there were zero consequences for their actions. When there’s no warning for it and they therefore get a ticket or loose their license they have to deal with the consequences of their actions and are more likely to re-consider repeating it so they don’t have to face the consequences again. I think it’s a better long term solution because they’d be thinking about the consequences every moment they’re thinking about their speed as opposed to only giving a crap when they can see a cop car",
            "title_similarity": "0.756336",
            "sentiment_compound": 0.6636
        },
        {
            "id": "h86p18z",
            "score": 1,
            "text": "Did you just say that police shouldn’t catch people in the act. I agree it’s bit daft but people slow down a lot when they see police which causes traffic issues so if they are less visible it means ordinary drivers are driving normally and wreck less ones can be caught rather than them do it when there isn’t police.",
            "title_similarity": "0.8142531",
            "sentiment_compound": -0.4767
        }
    ]
}