{
    "CMV: collecting unemployment and bypassing underpaid jobs is a reasonable thing that shouldn’t be looked down upon.\nFrom my understanding, unemployment exists to prevent a tidal wave of job loss and keep money flowing through our society.\n\nBut it’s also an insurance policy. That people pay for.\n\nIf I had a 2021 Mercedes-Benz, it got totaled due to natural events that were covered in my contract it would be absolutely insane to say “No, don’t pay me. I found an 81 Honda I can use. I’m good.” I would claim every penny that I signed up for.\n\nThere’s nothing wrong in my mind of using all your benefit until you get a job in the same league as the one you lost. But I hear all the time that those people are lazy and “don’t want to work”. Change my view.": [
        {
            "id": "h84rsxj",
            "score": 1,
            "text": "/u/martjona (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/p07kln/deltas_awarded_in_cmv_collecting_unemployment_and/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.6345117",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h84abh6",
            "score": 8,
            "text": "But in your analogy, *you* paid insurance. With unemployment, *we* pay it - that's the difference. So if you stay on benefits that other people are paying for while you look for a job in the same league as the one you lost, people are eventually going to start asking you questions like, \"Why can't you get a job in the meantime and quit when you find a better position?\" or \"Why did you get fired from your good job in the first place?\" or \"what happens if everyone on benefits thinks like this?\" and so on.",
            "title_similarity": "0.7808786",
            "sentiment_compound": 0.8496
        },
        {
            "id": "h84bqr2",
            "score": -1,
            "text": "You do not pay unemployment tax.\n\nEmployers do. It is strictly a payroll tax, which you as an individual do not pay into. No \"People\" pay into it, only businesses.\n\nSo, in your analogy, it's not your insurance on the Mercedes Benz, it's someone else's insurance on you having \"a vehicle\". You holding out for your dream car, or an absolute replacement for your Mercedes-Benz is actually just a selfish move taking advantage of someone else. It will also raise the \"insurance\" cost over time as the insurance can no longer cover \"a vehicle\", but must cover for a specific vehicle (which will take longer and be more expensive).",
            "title_similarity": "0.8522582",
            "sentiment_compound": 0.2361
        },
        {
            "id": "h84p0zt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02732547"
        },
        {
            "id": "h861kea",
            "score": 1,
            "text": "> But I hear all the time that those people are lazy and “don’t want to work”. \n\nThen you should consume other media.\n\nThink of it from the perspective of an asshole business owner.  You want to pay as little as possible for your workers, but those worthless, entitled workers now have a sense of \"self-worth\" -- can you imagine the audacity of those peons, claiming to have \"self-worth\"? -- and are too lazy to work for the absolute crap you want to give them while treating them like trash.  They're not desperate for your largesse, so you can't own them like slaves anymore.  Sucks for you, dude.\n\nSo you get together with your asshole business owner pals, who are put in the awful position of having to actually respect their inferiors -- ugh, makes you want to vomit -- and get on Hannity or whatever to convince the country that the Democrats are Bad and are Anti-Business and whatever else.  You see, their goals align: conservatives don't want their money going to, uh, *those* people (you know who I'm talking about, wink wink, you know, with the melanin?  I'm talking about Black people), and asshole business owners don't want their money going to *those* people either but still want their labor.  So conservative media amplifies these asshole business owners' voices.\n\nThe general reaction to asshole business owners complaining about not being able to find workers is almost always dismissed as asshole business owners being, well, asshole business owners, at least outside of conservative media.  If you keep hearing that they're lazy and don't want to work, then you must be consuming conservative media.\n\nAnd maybe you should stop doing that!\n\nEDIT: I just want to clarify that not all business owners are assholes, not by a long shot.  But it's only the asshole business owners that are making this complaint.",
            "title_similarity": "0.7163879",
            "sentiment_compound": -0.9867
        },
        {
            "id": "h84prdk",
            "score": -4,
            "text": "Maybe consider taking pride in providing an honest days work for an honest days wage instead of being entitled?",
            "title_similarity": "0.61724555",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h84p8hm",
            "score": -2,
            "text": "Agree",
            "title_similarity": "-0.09348208",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h84r851",
            "score": 2,
            "text": "Your situation is specific to you and although may be somewhat common, does not represent everyone collecting unemployment. \n\nUnemployment is something your employer normally pays for, but the insurance scheme wasn’t meant to last as long as it has. It’s also not meant to keep you held over until you find a similar paying job. It’s meant to hold you over until you can land back on your feet at all. It is in no way comparable to private monthly car insurance. \n\nOur unemployment system awarded funds to people who fit specific criteria, but left millions of others who did not meet those specific criteria (such as people who recently started a job before Covid) completely high and dry. \n\nIf you get unemployment, you are blessed and I am happy for you. Getting unemployment does not make you lazy. Coming up with reasons not to work, other than safety, however, is entitled by any definition. It is really the first time in human history we are even rationalizing this as away of life.",
            "title_similarity": "0.84027016",
            "sentiment_compound": 0.874
        },
        {
            "id": "h84e1jf",
            "score": 0,
            "text": "Yes but with car insurance you pay the premiums which cover the damage with unemployment everyone else pays the premiums to cover you when you don't work everyone has hard times and deserves to have some kind of safety net but intentionally not finding a job for no other reason than you don't want too is a very crappy thing to do",
            "title_similarity": "0.8461052",
            "sentiment_compound": -0.9404
        },
        {
            "id": "h84wml6",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.012003828"
        },
        {
            "id": "h84alwg",
            "score": 23,
            "text": "It’s a prisoners dilemma, and a game of chicken.\n\nIt’s a prisoners dilemma because we would all be better off if everyone goes back to their crappy jobs or similar crappy job, but since we don’t know that everyone else will, people stay on unemployment, thus making the outcome worse for everyone.\n\nIt’s a game of chicken because(at least what people say) the reason they are staying home is they don’t feel they are getting a fair wage at their old job and they are waiting it out until big business decides to pay living wages. Problem is, we know big biz can wait, and once the eviction moratorium ends and UI benefits go back to normal, labor can’t wait, and we all know most people haven’t been upskilling.\n\nThe biggest problem of why it’s not rational to continue os because it isn’t sustainable. Most states UI funds are bankrupt. If this were a business it would close its doors. Since this is a public good, we can’t allow that to happen, so taxes are going to skyrocket over the next few years to pay for the excess spending on government programs. Most people receiving their checks don’t care about the future financial viability of public’s goods, but it’s incredibly important. \n\nCounties got through crazy things in the past through sacrifice and helping one another. If people had the attitude you are describing during the Spanish flu or WW2 I shudder to think about where the world would have ended up.",
            "title_similarity": "0.7174287",
            "sentiment_compound": -0.9587
        },
        {
            "id": "h84rik2",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.02732547"
        },
        {
            "id": "h84y1yi",
            "score": 2,
            "text": "> getting a job in the same league as the one you lost\n\nA lot of people have already pointed out some of the issues with your claims that people want others to accept a lower paying job. The government agrees, you don’t have to do that.\n\nBut what about people that were already making low wages at low skill jobs? You can Google a few different numbers but the statistics usually say somewhere around a quarter of the country is making less than $15 an hour.\n\nNow, you can find a $15 an hour job pretty decently, maybe $10-12 and they’d hire basically anyone. Even Walmart’s pay averaged at $12 an hour. So those people that lost their jobs at minimum wage jobs, in my opinion, are lazy and “don’t want to work”. Those people are currently making about the same as they used to but now they have 20-40 hours less that they do not work. So of course they’re not going back to work.\n\nThey don’t want to work. That’s almost a fact. Who would want to go to work 30 hours a week at Walmart when you could just sit at home and get the same amount of money?\n\nNow is that a bad thing? No. I don’t want to work either. Nobody wants to work. Who wants to go to work?\n\nExcept, there ARE people working at Walmart right now, and McDonald’s, and picking up trash, and cleaning the streets, and laying down concrete. And while not all of these are things we need (we don’t NEED McDonald’s) they’re all necessary for our society to function. Those people working at Walmart are contributing to state and federal taxes, they’re busting their ass at a shitty job they probably hate because they have to. Because they know that it’s their duty to be productive members of society to keep society functioning.\n\nSo yes. I think those people who used to work minimum wage jobs and could go get another job if they wanted to are lazy.",
            "title_similarity": "0.76489854",
            "sentiment_compound": -0.9772
        },
        {
            "id": "h84smw4",
            "score": -1,
            "text": "There is absolutely nothing wrong with what you've said, but that isn't the complete picture. Indeed, insurance is exactly that -- insurance. If you need to tap into it due to an unexpected event, you absolutely should. But people today aren't tapping into something they've already paid for, rather, they are advocating their governments and officials to inflate and resupply the emptied coffers of the insurance, which is no longer there, by confiscating the fruits of someone else's labor for their benefit. Not only is this act of thievery deeply immoral, it is an affront to individual liberties, private property, and the foundations upon which this country was born. You see it would be insane to say, after your insurance has paid you what you're owed, \"Hey, I ran out of that money. So go steal from u/ecelol and pay me more. I understand there are jobs available for me to work and get that money, but they don't pay as well as I'd like to be payed, or they're too annoying/difficult and I would rather sit and watch TV and see my bank balance go up\".",
            "title_similarity": "0.8091028",
            "sentiment_compound": -0.8838
        },
        {
            "id": "h84ajcc",
            "score": 7,
            "text": "I think you're arguing against the strawman position set up by the other side of the debate. it's easy to paint a group of people as \"lazy\" when they aren't. For unemployment benefits, occasionally that comes with a racial or ethnic component. \n\nBut I think the argument from the other side is that the people who are sitting out are either making more money by not working because of pandemic benefits, or would have been working for minimum wage anyway (meaning their replacement jobs couldn't be underpaid).",
            "title_similarity": "0.80981266",
            "sentiment_compound": -0.1378
        },
        {
            "id": "h84zwg6",
            "score": -2,
            "text": "Yes",
            "title_similarity": "-0.17524971",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h859q40",
            "score": 12,
            "text": "The mentality of sucking out all benefits possible before doing what must be done is a greedy mentality that will drain society. It is a mentality we should fight against.\n\nThis greedy mentality can be absorbed during times of abundance when there are many high-paying jobs, but it will destroy a society during times of scarcity when good jobs dry up and everyone wants on the dole.\n\n&#x200B;\n\nWe can fight against it in two ways that I see:\n\n1. Change the laws to assume everyone has the mentality and minimize waste due to greed. e.g. Put limits on unemployment benefits so people can't just leech on the system.\n2. Fight the mentality through cultural and religious means where the individual grows their character to always do their best and not take from society unless it is required.",
            "title_similarity": "0.7345853",
            "sentiment_compound": -0.8979
        },
        {
            "id": "h85p7fu",
            "score": 5,
            "text": "I honestly don’t mind anyone who collects unemployment and does nothing because *I* would like to do nothing and collect unemployment. I believe in celebrating other’s successes because in doing so it feels like that success kind of rubs off on me. Even if it’s just seeing someone get to stop and enjoy life for a minute, that’s good enough for me.",
            "title_similarity": "0.7358583",
            "sentiment_compound": 0.9708
        },
        {
            "id": "h85q7d0",
            "score": 0,
            "text": "That money isn't free. It either comes from people working or a printing press (digital one of course). The government doesn't give interest free loans to us normal folks. Us and our children will be paying back every dime plus interest in the form of increased taxes and increased cost of living / goods due to dollar devaluation. Not to mention the immediate cost increases from supply & demand. Less workers = less supply = higher cost. Also, paying workers a lot more money to try and get them to come back still results in creased cost to consumer due to increased cost of doing business.\n\nAlso, if you are intentionally turning down jobs while on unemployment because you want to make more money on the taxpayers dime other than make less on your own is illegal. Unemployment is just supposed to be a stop-gap until you can find another job. It isn't a handout until you can get the exact job you want / dream job. You are actually violating the law and abusing the system by doing this. Which is what those people who are calling you \"lazy\" are saying that.",
            "title_similarity": "0.7506777",
            "sentiment_compound": -0.9421
        },
        {
            "id": "h84rbnr",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.02732547"
        },
        {
            "id": "h85a1ad",
            "score": -1,
            "text": "Debatable not wrong but debatable.",
            "title_similarity": "0.19311765",
            "sentiment_compound": 0.1967
        },
        {
            "id": "h85hcy4",
            "score": -1,
            "text": "Can’t argue with that.  I wouldn’t even try to change your view",
            "title_similarity": "0.3101219",
            "sentiment_compound": -0.34
        },
        {
            "id": "h85neb2",
            "score": 1,
            "text": "I'll just add that it's that kind of selfish attitude that leaves everyone else paying too much tax.",
            "title_similarity": "0.5754241",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h868px7",
            "score": 1,
            "text": "Illegal.  Who made the law. Businesses who want a hungry labor force at their disposal or the workers who breathe the same air as the rich. Plenty of laws are worth breaking because the law as written is bs.",
            "title_similarity": "0.69988585",
            "sentiment_compound": 0.296
        },
        {
            "id": "h86ma7q",
            "score": 1,
            "text": "The people who express hatred towards individuals who abuse unemployment are the ones who aren't, obviously. It's pretty easy to see why people who are working for dirt wages are upset that someone doing nothing is making more. The hatred is misguided though.\n\nThey should be mad that this is even possible. Why don't their jobs pay living wages? Why does all the profit an employee generates go to people in higher positions and shareholders? Why does the cost of service increase while the lower level employees wages rarely do?\n\nA lot of the people I know collecting unemployment are doing it as an F you to the government and their employers. They've clearly shown that they have very little interest in solving the issues of the lower and middle classes, so why should the little guy care at all about abusing their handouts? They've abused us all for decades. \n\nIn America, the taxes you pay barely go to your schools, healthcare, roads, internet infrastructure, or really anything that increases your quality of life. It gets sucked into the military industrial complex and agencies that infringe on your freedoms. You've paid them for very little return all your life. Stop calling people lazy and start thinking about why this became a problem to begin with.",
            "title_similarity": "0.78129184",
            "sentiment_compound": -0.9843
        },
        {
            "id": "h84phl6",
            "score": 49,
            "text": "I don’t think any reasonable person really looks down on someone collecting unemployment after losing their job (or holding out for a *reasonable* amount of time for the right job) … it’s when people are serially unemployed, or purposefully collecting unemployment in lieu of working as a long term situation that it begins to be a problem. \n\nIt *should* be looked down upon in these situations because unemployment isn’t meant to function in that way. With your insurance analogy, it would be like everyone wrecking their car on purpose to get a new one… eventually that insurance company would go bankrupt. The “pot” for unemployment can be thought of similarly. \n\nIt functions fine as an insurance policy for those who lose their jobs - as it should. And some people do take advantage and the system doesn’t collapse because it has enough wiggle room. If everyone started taking advantage in the above way though it wouldn’t be sustainable. The people who take advantage also likely make it worse for people who really need it. They siphon funds from people who may seriously be screwed without it, and cause legislation that also might deny folks who really could’ve used that help. \n\nBased on that, any non-sustainable behavior or behavior that subtracts from others should absolutely be looked down upon.",
            "title_similarity": "0.7993774",
            "sentiment_compound": -0.9744
        },
        {
            "id": "h85vtyg",
            "score": 2,
            "text": "I agree. The way I see it, the people who complain about those on unemployment typically believe in only looking out for themselves, i.e only caring about their own bottom line. Well, thats what people who are taking advantage of unemployment are doing: only caring about their own bottom line. If a person makes more on unemployment than they would getting a job, why tf wouldn't they choose the thing that makes the most financial sense to them? It says nothing about the person in question and everything about the job market. Raise your wages if you want workers, otherwise quit bitching. \n\nFor context, I actually was able to keep my job throughout the pandemic. A few of my coworkers were temporarily furloughed and made more money than they were making, and were a little disappointed when their furlough was over, but banked the extra money they were making. I'm not bitter that they made more, im happy for them, and I'm also happy for me for getting to keep my job and continue being productive.",
            "title_similarity": "0.7864865",
            "sentiment_compound": 0.9256
        },
        {
            "id": "h84b4gh",
            "score": 190,
            "text": "[deleted]",
            "title_similarity": "0.012003828"
        },
        {
            "id": "h85l3ai",
            "score": 8,
            "text": "Employees don’t pay unemployment tax, employers do, and they pay reimbursements to cover shortfalls.\n\nAnd if you are collecting unemployment you are required to look for work, but not to take a job that pays significantly less than what you made. Over time the reduction in pay that you would have to take increases, as they try to get you off of the benefit.\n\nBecause it isn’t insurance, it is something employers pay into and want to avoid using.\n\n\nHow do you imagine the money would keep coming in if people just chose not to work?\n\nLet me put it another way, your insurance company offers you a renal while your car is being repaired, but for a limited time. Why? Because it costs them money, and that money is collected in payments from everyone, not just you. If you wreck your 2021 Mercedes they are going to fix it or replace it, and they are probably already taking  a loss with you. Add in a rental, but for an indefinite amount of time, and you might not be in as big a hurry to get your car fixed.\n\nNow you are driving a similar car to what is being repaired / replaced, and you aren’t putting miles on your own car and hurting it’s value.\n\nCan you see where the abuse comes into play? You aren’t spending your money in extending the rental, you are spending a whole lot of other people’s money. And that act causes everyone’s rates to go up.\n\nNow consider it isn’t just you, everyone who wrecks their car has an unlimited rental car and many have the same idea.\n\nDo you think car rental prices stay the same? They don’t, they would need a lot more cars to cover the need. Do you think auto insurance would cost the same? Nope, they would have to predict what the new rental car cost is per insured driver and divide the new higher cost amongst all of the insured drivers.\n\nAnd maybe you don’t care when your car is wrecked, at that time you are getting over on the man, other people are paying for your rental. But now your insurance costs lot more, and you won’t have a wrecked car all the time. Next week or next month you will be in your car, and see me in a rental, and now you might realize that you are now paying for me to get over, and not over the man, but over you.\n\n\nSo back to unemployment. Do you imagine compensation would or could stay the same if unemployment costs went up drastically for employers? No, the money doesn’t fall out of a tree. So the people who have jobs would make less to cover this choosing unemployment.\n\nAnd if the federal government gets involved, now we are talking about tax dollars. So with what they are doing right now in extending unemployment benefits at the federal level, that money given to the unemployed is paid for by all of us through taxes. More specifically it is paid for with borrowing, selling bonds, and then we pay interest on the debt. (Right now we pay about $403 billion a year on our current debt)\n\nSo we borrow and pay interest so people can stay at home? If that were to continue long term, how would it be funded? Productive people generate our tax revenue, and every dollar spent from taxes is taken from a taxpayer. (There is overhead, so we actually tax more than the dollar to pay the dollar, just look at the breakdowns of the stimulus deals, in dollars taxed vs dollars paid) \n\nSo if we extended unemployment indefinitely, well great, pay will go up for a lot of low paid employees, or automation will replace many low paid jobs. But not all businesses can afford that, and if they were made to wave a magic wand and do it no matter what, prices would have to go up to cover the difference, and or fewer people would be hired. Payroll is not covered by hopes and dreams, and most businesses are close to break even.\n\nWhich gives you inflation, where the higher wage people are now making buys less.\n\nAnd then every person who chooses unemployment adds to the tax burden, meaning employers pay more in tax and less to us, the government takes in more tax (or borrows) to keep up their end, and there is ever less money after higher taxes, lower pay, and with inflation.\n\n\nThe point being employees don’t and cannot be made to pay unemployment insurance or reimbursements. The unemployed are not receiving money that they contributed to.\n\nAnd most importantly, if you provide incentive for something you tend to see it more, and this is providing incentive to be less productive or not productive at all.",
            "title_similarity": "0.81642556",
            "sentiment_compound": -0.9876
        },
        {
            "id": "h84e0ed",
            "score": 73,
            "text": "This reminds me of one a funny exchange I had with a tourist. \n\n>Me: So what do you do for a living, pal?\n\n>Guy: I am an unemployed rocket scientist. \n\nAnyway, I think you view is the actual view held by most people and governments. I doubt that anyone would expect my laid off rocket scientist buddy to pass on unemployment benefits just because the local Baskin Robbins is hiring.",
            "title_similarity": "0.7378011",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h84ml3y",
            "score": 1010,
            "text": "[deleted]",
            "title_similarity": "0.012003828"
        },
        {
            "id": "h85aw4g",
            "score": 5,
            "text": "In your scenario sure it's fine not to accept the Honda at first. But if 6 months/a year goes by you really should take the Honda at that point. Everyone has setbacks.",
            "title_similarity": "0.7011296",
            "sentiment_compound": 0.1174
        },
        {
            "id": "h85p95q",
            "score": 1,
            "text": "that extra unemployment goes away in a month. its going to be interesting to see what happens when all these people need an income.",
            "title_similarity": "0.60817444",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h85t67p",
            "score": 1,
            "text": "In no scenario based on reality would your insurance policy dictate you take an 81 Honda to replace your new Mercedes-Benz. There's plenty of Mercedes-Benz vehicles in the world and plenty of other cars of similar value. Similarly, no unemployment insurance system is going to require you to take a $20k/year job when you lost your $100k job. \n\nAll that being said, if you squeeze every penny out of your insurance policy you possibly can then your premiums are going to increase. If enough people do this all at once, then everyone's premiums will increase. The pot of money the insurance company has to pay out claims isn't infinite.\n\nIf your policy pays for 6 weeks of a rental car, well gosh darnit I'm going to use all 6 weeks of the rental car. But so is everyone else who also lost their cars in this event. So now there's a shortage of rental cars. Now rental cars are more expensive. Now, rental car companies are also going to be buying up inventory of cars to try and fulfill all their contracts. Now the price of cars has gone up. Now the inventory of available cars has gone down. 6 weeks is up, and you've got to finally get a new car. Well, a lot of people needed new cars all at once, and so did the rental companies. There's only 2 Mercedes-Benz left on the lot, they're 30% more expensive so you can't really pay for one now with your insurance claim and you don't really like those particular models anyway. You have to give the rental car back tomorrow and find yourself at a Kia dealership....",
            "title_similarity": "0.81695604",
            "sentiment_compound": -0.6331
        },
        {
            "id": "h85tujb",
            "score": 1,
            "text": "First off at least in the US you do not pay a penny for unemployment insurance only employers due.  Even if it is called insurance it is absolutely nothing like any other true insurance product.",
            "title_similarity": "0.63713783",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h85vv4t",
            "score": 1,
            "text": "These people are literal parasites in the system \n\nThe choose to not contribute when they are fully capable of providing utility in some way shape or form \n\nYet they choose to steal from everybody else",
            "title_similarity": "0.57394546",
            "sentiment_compound": -0.079
        },
        {
            "id": "h86045e",
            "score": 1,
            "text": "You should absolutely go for jobs in your range, and not just any place with a help wanted sign. But the implication is that the job you lost was NOT one of those low paid jobs. \n\nAssuming that is the case, rejecting any comparable job at all is a net loss of income. Unemployment pays somewhere around 40% of your previous income. In order for the additional federal $300 to make up the rest, your pay range would have to be around $12.50/hr. Anyone who earned more than that makes less money on unemployment than they would by working. \n\nTake the time to find an appropriate job, but if you are trying to get every last penny you “paid for”, you are losing money.",
            "title_similarity": "0.7956128",
            "sentiment_compound": -0.9719
        },
        {
            "id": "h86178d",
            "score": 1,
            "text": "The issue is not from use but from systemic and abusive use.  The person who uses it because it was something they paid into either through unemployment insurance or taxes is perfectly acceptable.  But there are a subset of people out there who are perpetually unempl and grift the system to ensure they stay in the benefit roles.  States and counties have different stipulations but most have some mechanism that resets the benefits period, usually a birth, firing, hospitalization, ect.",
            "title_similarity": "0.7666019",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h861ygq",
            "score": 1,
            "text": "Pay people for the job you want them to do.",
            "title_similarity": "0.4132977",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h864eg9",
            "score": 1,
            "text": "If you're not going to contribute to society, society shouldn't contribute to you. No one deserves a penny they didn't work for",
            "title_similarity": "0.61446553",
            "sentiment_compound": -0.296
        },
        {
            "id": "h865h4u",
            "score": 1,
            "text": "\"underpaid\" jobs is not the issue but capitalists/employers want it to be so they can make claims about the signing bonuses/hourly wages being \"so generous!!\", people just \"don't want to work\".\n\nIn fact, folks want real jobs with a real 40 hr schedule [not \" can you come in this afternoon for 3 hours? \"] and benefits\n\n$20/hr for a crappy McJob is still a crappy McJob",
            "title_similarity": "0.83475316",
            "sentiment_compound": -0.4528
        },
        {
            "id": "h8668wt",
            "score": 1,
            "text": "The only thing that will change your mind is personally watching someone get paid and seeing that they just refuse to work while you are trying. Don’t worry it will eventually happen.",
            "title_similarity": "0.67641276",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h868ko2",
            "score": 1,
            "text": "I don’t want to change your view. Your spot on.",
            "title_similarity": "0.26388088",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h86dppw",
            "score": 1,
            "text": "It better be reasonable I wouldn't be able to feed myself. Since covid, cooking jobs are easy to get but such unhealthy environments. Managers are pissed about labor \"shortages\" wages have not gone up and the job is just as hard as it's always been. I'm trying to switch careers after 15 years cooking, I would be starving without unemployment.",
            "title_similarity": "0.727058",
            "sentiment_compound": -0.9116
        },
        {
            "id": "h86ea5m",
            "score": 1,
            "text": "Question: is your view that the government looks down on your view or other citizens do?",
            "title_similarity": "0.4255501",
            "sentiment_compound": 0.0
        },
        {
            "id": "h86gw6b",
            "score": 1,
            "text": "If your place of work pays less than the bare minimum the government will give you to survive during an international crisis then why would you go back to work?",
            "title_similarity": "0.7103969",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h86iuoj",
            "score": 1,
            "text": "Calling it insurance is misleading as you can't opt out. You didn't sign up for anything, that money was taken whether you wanted it to or not, so it's a bit morally gray at best to be accepting money that was acquired by extorting others.",
            "title_similarity": "0.678932",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h86j1ni",
            "score": 1,
            "text": "Reading some of the comments, people seem confused how UI works for employers. Keep in mind, every state is unique but this is how Oregon handles it: \nWhen you’re a brand new company in 2021 with employees, your automatic unemployment rate is 2.6% of wages paid. (That’s raised substantially since COVId, it used to be in the 1%). \nSo let’s say you paid out $100,000 in wages for the quarter, you owe $2600 in state unemployment insurance. \nEvery year this rate gets evaluated and adjusted depending on your file. Depending on how many people made a claim and for however long they were on UI, they adjust your rate “accordingly”. \nCOVId aside, usually if no claims were placed than your rate would either stay or drop a bit. With Covid , I’m honestly not sure how they’re doing their evaluations. \nBut, your employer very much pays into a pot for you as an employee benefit that you are rightfully entitled to. Feeling bad that their rate might go up a bit is like feeling bad for taking a break because you got a raise. You’re still entitled to that employee right/benefit.",
            "title_similarity": "0.6703796",
            "sentiment_compound": -0.8268
        },
        {
            "id": "h86jdz5",
            "score": 1,
            "text": "I guess I'd ask for a definition of underpaid.  $13 for Target, Walmart, McDonald's...   not underpaid to me.  $13 for a construction job, yes.",
            "title_similarity": "0.5788114",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h86k87c",
            "score": 2,
            "text": "I fell for that once. I had a good job, well paid, etc. Lost job and obtained unemployment.  I was receiving the highest amount paid by unemployment because my lost job was well paid...still a fraction of what I had earned. In my guilt filled state, I accepted a low paying job. The business failed and I was out of work again in a few short months. Now my unemployment was based on the pay of this low paying job and I began receiving a pittance.  I then lost everything,  home, car, credit rating.  OP is correct.  Don't do this. Wait until you find a job that pays at least a living wage before giving up your unemployment insurance. It's your money, you paid into the account and you are entitled to receive it when needed.  That's what insurance is for.",
            "title_similarity": "0.7062257",
            "sentiment_compound": -0.9042
        },
        {
            "id": "h86nh1r",
            "score": 1,
            "text": "That's called being a leech to society.  It's supposed to be a support and hold-over while you get another job.  Get off your lazy ass and work like everyone else.",
            "title_similarity": "0.6347494",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h86omg9",
            "score": 1,
            "text": "Not taking a lesser job is the entire point of unemployment.  It’s better for the individual and society.",
            "title_similarity": "0.6527338",
            "sentiment_compound": 0.0
        },
        {
            "id": "h86ou4i",
            "score": 1,
            "text": "When I got out of the Navy in 1981, Ronald Reagan was president and we were in the middle of a recession. I would pull into our industrial district businesses seeking work and there were signs in the parking lots that said, \"Not accepting applications\". Washington state had very good unemployment at the time. I spent a year without a job because employers at the time were not hiring or misstating the job descriptions. I got canned twice in three months, trying to do really shitty jobs, that were described as something else by the employer. The state investigated both employers and I got my unemployment benefits for a full year.",
            "title_similarity": "0.74578714",
            "sentiment_compound": -0.8467
        },
        {
            "id": "h86z2hb",
            "score": 1,
            "text": ">From my understanding, unemployment exists to prevent a tidal wave of job loss and keep money flowing through our society.\n\nThat is the excuse, not the reason.\n\n>If I had a 2021 Mercedes-Benz, it got totaled due to natural events that were covered in my contract it would be absolutely insane to say “No, don’t pay me. I found an 81 Honda I can use. I’m good.” I would claim every penny that I signed up for.\n\nYou do not, of course, “sign up” for unemployment insurance: it is foisted upon you.\n\n>There’s nothing wrong in my mind of using all your benefit until you get a job in the same league as the one you lost.\n\nIf you literally mean “nothing wrong”, then you are mistaken.  \n\nUnemployment insurance *drives up unemployment*.  That is, the world becomes poorer because people who could be usefully employed, doing things for other people, are instead sitting on the couch.  That is very, very bad.\n\nYou may believe that the good things about the situation outweigh the bad things, but that is not what you wrote, you wrote  “nothing wrong”, and that is untrue.\n\nI can only guess what you think the good things are, but your reference to “a job in the same league as the one you lost” is very troubling.\n\nImagine you have two unemployed people, one who has been cleaning toilets all his life and the other, I dunno, has been reviewing TV shows for a living.  A job opens up, cleaning toilets.  Does it not seem more fair that the guy who previously had a cushy job now has to do the unpleasant one, while the unemployed janitor gets to continue enjoying his vacation?",
            "title_similarity": "0.96592146",
            "sentiment_compound": -0.9129
        },
        {
            "id": "h8764pm",
            "score": 1,
            "text": "∆",
            "title_similarity": "-0.15616556",
            "sentiment_compound": 0.0
        },
        {
            "id": "h87u5y3",
            "score": 1,
            "text": "What a piece of shit mentality.",
            "title_similarity": "0.060497224",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h87ymmb",
            "score": 1,
            "text": "It’s wrong to live off of other peoples’ money.",
            "title_similarity": "0.4831903",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h88efof",
            "score": 1,
            "text": "For the sake of Changing your view:\n\nThere is a vast difference between “this thing is true” and “there is a scenario in which this thing is true.”\n\nExample:\n\nMurder is bad \n\nBut maybe it is morally permissible to murder your attempted rapist in self defense.\n\nIn the same way:\n\nCollecting unemployment and bypassing work is bad\n\nBut maybe it is morally permissible to collect unemployment and bypass work for which you are dramatically overqualified.",
            "title_similarity": "0.6850506",
            "sentiment_compound": -0.9864
        }
    ]
}