{
    "cmv: Animal cruelty negligence and especially torture deserve way harsher punishment.\nI've seen videos of animals either being neglected, abused, and sometimes even tortured. It's awful. I can't believe that the punishment is slim to nothing. There was a video of a man torturing animals and all he got was 2 months of jail time.\n\nI still can't believe that you can get more jail time from stealing than doing absolutely horrible things to animals. Animals may not have the exact same emotions as humans but that does not make it okay in any way shape or form.\n\nIf there is something that I don't know or if my view is wrong please tell me. (This is my first time posing on this subreddit)\n\nEdit: I don't have any issues with people eating meat. But If they make an animal go through pain which is completely unesecary. I think that's awful. I also try to treat meat as a luxury and I get my meat from organic and trusted farms. Not from a factory.\n\nEdit 2: Sorry but I won't be able to reply to the majority of people ane. Also if you don't mind, when you reply could you please make it more about animal abuse than veganism? That was my main point of this but thank you for replying anyway!\n\n&#x200B;": [
        {
            "id": "h87051b",
            "score": 70,
            "text": "They are just animals. If you eat meat then you are okay with the killing and torture of animals. \n\nDogs and cats included. They are all the same, just because people prefer one doesn't make it any more or less evil or okay.",
            "title_similarity": "0.5903672",
            "sentiment_compound": -0.9029
        },
        {
            "id": "h88b2ep",
            "score": 10,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.  We will try and do this quickly so discussion can continue though the amount of time will vary based on moderator availability.\n\nThank you for understanding.",
            "title_similarity": "0.6313622",
            "sentiment_compound": 0.2066
        },
        {
            "id": "h87co10",
            "score": 0,
            "text": "Word of advice: butcher shops are the best place to buy meat. Typically the meat comes straight from a family owned farm/ranch. And it's weeks fresher than shit from the stores. (I also live in a very barren, rural area)",
            "title_similarity": "0.53133047",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h86u4s2",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h8727az",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h87dev2",
            "score": 2,
            "text": "These videos are made with the purpose of emotionally manipulating you, and it looks like it worked. Making decisions about punishing someone, especially harshly, just because your feelings are bothered is a very bad idea. As some people pointed out here, would you punish pest control workers, hunters, farmers, fishermen and simply people who, for example, use mouse traps? The activities of those people invariably lead to animal suffering. And let's not forget that even in the absence of people, animal suffering is the norm in nature. Would it be worse for a rat to be poisoned or to be torn apart alive by a cat? You can't keep a cat, a bird and a worm safe together. Also, which animals would you include into this proposition - all of them? Half of them? Only selected ones? Based on what would you select them? Lastly, if according to your proposed law, many or most people would be criminals (as in copyright infringement, for example), then the law won't work and will need to be thrown away.\n\nWhat actually happens to some people when they are given such videos to watch is that they substitute the animals with people in their mind and make false conclusions based on that. Stealing directly hurts people, while whatever that person was doing to an animal (let me guess, it wasn't a rat or a snake, right?) does not, and laws are usually made to improve the well-being of people. Still that person got 2 months jail time, which was unnecessary and in most of the world probably wouldn't happen.",
            "title_similarity": "0.79236305",
            "sentiment_compound": -0.9862
        },
        {
            "id": "h86nzp5",
            "score": -11,
            "text": "I believe it deserves no criminal punishment at all.\n\nCriminal laws should regulate behavior that impacts OTHER PEOPLE in a society. The only really reason for criminal laws is to regulate interpersonal relationships to make societies operate smoothly to benefit of all participants in society.\n\nAnimals fall outside of that.  Some dude treating his own animal poorly affects lives of exact ZERO other people. For this reason, it should be outside of scope of criminal laws.",
            "title_similarity": "0.6628797",
            "sentiment_compound": -0.4695
        },
        {
            "id": "h87bxw9",
            "score": 0,
            "text": "As long as the stingray that killed Steve Irwin gets life in prison as well, I’m fine with this.",
            "title_similarity": "0.5314286",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h86j47v",
            "score": 371,
            "text": "A major problem is where do you make the distinction between what is acceptable or not.   I mean few people wouldn't say beating dogs is wrong, yet even the most ardent dog or cat lover will think nothing of killing insects. And further still mice and rats are routinely killed and they too have supposedly show emotion.  \n\n Most people also do not consider the conditions of the animals lives of the food the eat.  Most chickens are stored in cages forever before slaughter.  \n\n\nWhy don't we just keep laws for actions regarding humans. Things in which we can all agree on.  Animals are too varied and humans have too many differences to settle on what is or isn't acceptable in humans treating animals.",
            "title_similarity": "0.78323674",
            "sentiment_compound": 0.6634
        },
        {
            "id": "h86ne87",
            "score": 61,
            "text": "A small reminder that your claim to morality is about as valid as anyone elses, including the person who throws live chicks into a meat grinder for a living, since morality is subjective. So you can't really definitively say a punishment 'deserves' to be harder unless you're just saying that you'd *prefer* it to be so.",
            "title_similarity": "0.7578809",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h86wg46",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.093195885"
        },
        {
            "id": "h87nihc",
            "score": -1,
            "text": "There should be no punishment, since animals are not moral agents and should not have rights, they are property and should be treated as such. \n\nAlso, sentience is not what gives you rights, otherwise bugs would have them. What gives you rights is you belong to a species where rationality is normalized. There are people who can’t feel pain or can’t feel emotions, this doesn’t give you the right to end their lives, though someone being not a moral agent, implies they can’t have rights, therefore you can kill them (as long as you are not harming anyone’s property)",
            "title_similarity": "0.68394816",
            "sentiment_compound": -0.5343
        },
        {
            "id": "h86y0gl",
            "score": 7,
            "text": ">I still can't believe that you can get more jail time from stealing than doing absolutely horrible things to animals.\n\nStealing is a property crime involving someone else's property.  The type of stealing that is given harsh jail sentences is the type committed by the poor against the rich. The primary purpose of a legal/justice system is to protect the people who that system serves from those who operate outside of it.  Animal cruelty doesn't touch the dimension where the rich are affected by its unchecked existence, and it hasn't seen the same concerted efforts to challenge the existing legal stance as have other torturous and cruel situations such as the battle over labor rights.\n\nYou shouldn't be surprised at the disparity given the purpose, structure and history of justice.",
            "title_similarity": "0.8145953",
            "sentiment_compound": -0.976
        },
        {
            "id": "h87fp0x",
            "score": -2,
            "text": "While I agree to an extent, animal fighting is a part of some people's culture. I do not think that it should be okay for a person to chop a domestic animal's foot off and let it bleed out, that's just cruel. However, breeding and raising an animal for the explicit purpose to be a fighting animal is in my opinion not a bad thing. I have family from foreign nations who actively practice the tradition of Dog, Cock, and even Cat fighting. The animal's are raised not as pets, but in an extremely competitive and \"survival of the fittest\" environment in order to breed top line animals. Food is made scarce, space is made tight and the animals are essentially in a \"natural\" state of life its just instead of the great outdoors is in a controlled environment. These animals only know this life, and do not suffer within it. They simply adapt and overcome, and they are made into \"warriors\". There is a lot of time, effort, and knowledge in this field, and is highly respected in some areas of the world. \n\nIf it isn't negligent to neuter an animal, to take away their survival instincts, force them to rely on their owners, or if it isn't considered illegal or immoral to raise \"prize animals\", I don't think it should be illegal to raise fighting animal's.",
            "title_similarity": "0.72701544",
            "sentiment_compound": 0.9514
        },
        {
            "id": "h87h6fp",
            "score": -2,
            "text": "Pet cruelty, absolutely. If you want to get rid of industrialized farming, you need to understand the consequences. Organic and trusted farms are more expensive. But if they shut down all industrialized farms, it's not like all meat would be the same price as organic stuff now. The price of meat would skyrocket. Think $100 for a hamburger expensive. The massive scale of industrial farming is absolutely essential to our quality of life. As disgusting and cruel as it is, it's a necessity for most people.\n\nThat's why veganism and organic farms will never solve this problem. It bugs me that more people with such strong opinions on this don't take the time to learn the other side of the issue and understand the consequence and reality of the situation. With lab grown meat and meat substitutes on the horizon, it's clear that these will be the way out eventually.",
            "title_similarity": "0.7617841",
            "sentiment_compound": -0.8959
        },
        {
            "id": "h876tcs",
            "score": 10,
            "text": "People regularly rape people and get away with it, so if we can't even handle properly punishing human on human crime, I doubt we'll ever get to animals.",
            "title_similarity": "0.8316674",
            "sentiment_compound": -0.936
        },
        {
            "id": "h873dog",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h876e7u",
            "score": -4,
            "text": "I mean...\n\nParents can cause their children literal harm by making them morbidly obese, doing literal body mutilation (circumcision), maltreat them (forcing to take vegan diets), cause psychological abuse and (to some extent) physical abuse.\n\nAnd your argument is, we should prosecute people for doing something to animals, but let's forget about humans?\n\nUntil you start punishing parents for abusing their children, you should not expect anyone to care about abusing animals.",
            "title_similarity": "0.8066861",
            "sentiment_compound": -0.9638
        },
        {
            "id": "h876g7n",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h87fmnd",
            "score": 0,
            "text": "Should we arrest lions that eat other animals alive?",
            "title_similarity": "0.62474835",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h87vzdj",
            "score": 0,
            "text": "Perhaps I'm the one in need of a changed view, but in any case, I'll describe my viewpoint on the topic.\n\nMy moral code is that every human should aim to act in the way that benefits humanity.\n\n* The prosperity of humanity is measured by the statistical amount of time that we have left to live before we go extinct. In other words, it's the mean of the probability distribution of remaining lifetime for the human race.\n    * This raises an important question of how one determines if humanity is still alive or not. For example, if we upload everyone's consciousness to a server and program everyone to just constantly be happy, reducing our existence to a bunch of boxes on a wet rock, are we still living? I elect to ignore this question for now.\n* To benefit humanity means to cause an increase in prosperity.\n    * This can be achieved in many ways, such as giving birth, saving a life, or even giving someone a compliment --- a compliment can inspire a person to work harder and be nicer to others, which increases the likelihood of someone else down the line creating a direct contribution to human prosperity.\n* On the topic of punishment, if punishment is deemed helpful, one's wrongdoings should be punished roughly proportionally to what degree to which the offender decreased human prosperity.\n    * It's important to note that punishment is not always helpful. If we had the technology, the ideal response to wrongdoing should be to alter the offender's mind to increase their attraction to creating prosperity. This is currently accomplished through psychology and psychiatry, but some day we may resort to more sci-fi-esque measures to perform this sort of brainwashing.\n* Animals are tools. They should be used to benefit humanity. If they cannot be utilized in this way, they have no moral significance.\n    * Most animals create prosperity. Livestock can be bred to be eaten, and pets can be trained to provide physical and psychological health benefits to their owners.\n    * If it comes between a human and animal's life, the human almost always takes precedence --- the only counter example would be when comparing the life of a useful animal to a destructive criminal.\n\nHurting an innocent animal is destructive to humanity. However, it is nothing when compared to hurting a human. Animals can help humans, but the benefit of a functioning human is far more than the benefit of a healthy animal.\n\nAnimal cruelty does warrant proper punishment (or constructive rehabilitation, because animal cruelty usually signifies psychological issues), but I do not believe that these cases warrant ``way harsher punishment.''\n\nA significant weak point in my argument is that I completely fail to address the current state of animal cruelty responses in modern cultures. Regrettably, I often find myself arrogantly displaying my \"edgy teenager\" mentality, but I've admittedly done no research as to whether animal cruelty is a widespread issue that goes unresisted. In my opinion, the best counterargument against me would be to present evidence that animal abusers too-often go scot-free.",
            "title_similarity": "0.4603753",
            "sentiment_compound": -0.9272
        },
        {
            "id": "h880ig1",
            "score": 0,
            "text": "I think this is where we should seriously consider drawing a line **and crossing it** and consider animal cruelty towards a personally owned animal a thought crime and punish it for being a thought crime, enhancing the punishments already found and determined.\n\nWhy? Neglect and abuse of a dependent (pets, children, the infirm, the elderly) speaks of a type of mindset that a society and any other individual will suffer from - always. This mindset is **never** helpful to anyone else, so pets serve as a useful buffer between individuals as a test of lack of cruelty of the owner. That’s why strangers with happy/healthy pets are easier to approach in public, no matter what other bias they might suffer (appearance, personal hygiene, age, race, gender, height, weight, language, etc).\n\nSo it’s not that we are enhancing the punishment for cruelty towards pets specifically or animals in general, but that we are **punishing people for being mentally able to be cruel** to something analogous to something/someone more precious and **likewise vulnerable** in that person’s capacities.",
            "title_similarity": "0.77579844",
            "sentiment_compound": -0.9789
        },
        {
            "id": "h884f78",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h88am35",
            "score": 0,
            "text": "Cruelty to humans, (and by extension, animals) while horrific and vile to normal people, does not have a place in high levels of government. Sure, if your local town hall wants to enact measures to prevent neighborhood pets from going missing and ending up conscripted in an underground fighting pit, sure whatever, legislate to your hearts content. \n\nBut in the big picture, an individual human life has essentially no value (except the few that have demonstrated merit by accumulating ~~upvotes~~ I mean dollars) and animals naturally even less so. The purpose of government is to steer humanity in the big picture, and they're currently failing spectacularly at mitigating global warming, while the petty squabbles of insignificant individuals play a distracting role. \n\nAgain, feel free to legislate to your hearts content in your petty, local community.",
            "title_similarity": "0.780429",
            "sentiment_compound": -0.0654
        },
        {
            "id": "hqpq9w2",
            "score": 0,
            "text": "Basically all meat eating. If I killed and ate a dog real quick, you are fine with that?",
            "title_similarity": "0.51649094",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h87dbhv",
            "score": 7,
            "text": "Your entire view is based on the assumption that hurting animals is wrong, but you have not presented any argument to support that position (and such an argument is actually impossible).\n\n>I think that's awful. \n\nIt seems like this is your entire argument. Is there anything that could possibly counter \"I think its awful?\" Nope. Because it's not a real argument, it's just something you don't like.\n\n>I also try to treat meat as a luxury and I get my meat from organic and trusted farms. \r\n\nThe organic label is pure marketing bullshit, so you aren't helping anything by looking for it.",
            "title_similarity": "0.7705872",
            "sentiment_compound": -0.8467
        },
        {
            "id": "h86lcap",
            "score": 94,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h878nuk",
            "score": 60,
            "text": "Go vegan if you actually care about animals",
            "title_similarity": "0.42958426",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h88asu6",
            "score": 7,
            "text": "So, lots of people tend to find cruelty to animals more offensive than cruelty to humans.. me included. I am far more offended when I see a dog die in a movie than I am to see a human. This gut reaction is the problem with your theory.\n\nWe regularly scoff at pandhandlers on the street, and worry about a turtle trying to cross the road. If a person jumped in front of my vehicle to kill themselves, I would be mad at them. If a dog jumped out in front of my vehicle, I would be incredibly sad.\n\nMy point... ultimately is that your concern would be more beneficial elsewhere. Animals are awesome, but we tend to put extra weight on their lives than makes sense. We eat veal for Christ's sake. That's literally a baby cow tied to a stick with a tiny rope so it can't move abd build muscle. Animals are food and occasionally pets. We made that decision long ago and now it really can't be changed very easily.",
            "title_similarity": "0.84459466",
            "sentiment_compound": -0.876
        },
        {
            "id": "h8765df",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87o6f4",
            "score": -1,
            "text": "The problem is if you make laws with harsher punishments, animal rights crazies will manipulate the system to punish normal farmers for preparing meat. I really isn't a widespread problem despite what emotional manipulators would have you beleive and on the whole, very few people in society can stomach hurting animals. (Humane society and SPCA rake in a LOT of money from donations by pushing emotional ad campaigns while they operate shelters that kill unwanted animals.) At the end of the day, and while I certainly don't condone it at all, people own their animals and should be left alone to do as they will with their own property.",
            "title_similarity": "0.8066913",
            "sentiment_compound": -0.9558
        },
        {
            "id": "h87xhog",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87d12m",
            "score": -2,
            "text": "We punish people partly based on the idea of retribution for a wrong done to another. But animals are not humans - they don't understand that they exist, they comprehend pain in a generalised sense but are nowhere near as evolved as humans. The main reason we empathise with animals a lot because we anthropomorphisize them - we treat them like humans. Animals don't have names - they don't understand the concept. They don't have emotions. They can't feel love. They don't have morality or agency. \n\nPunishments done by humans to other humans should, and will always, be punished more harshly than anything done to an animal, simply because sentient beings are, for all intents and purposes, more important and valuable to humanity than animals. We invented the concepts of morality and justice because we did not want humans to suffer, because we saw suffering and knew that we would not want that inflicted upon ourselves. But that is a human idea. Animals are not like us, they do not think like us - and should not be treated like us in any system of criminal justice.",
            "title_similarity": "0.827511",
            "sentiment_compound": -0.9634
        },
        {
            "id": "h87j49e",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87f34q",
            "score": 69,
            "text": "[deleted]",
            "title_similarity": "0.09319587"
        },
        {
            "id": "h8787gv",
            "score": 38,
            "text": "\"Making an animal go through pain unnecessarily is wrong\" - you. But you don't have a problem with people eating meat? Eating meat is not a necessity, so even if you treat the animal well while you raise it, it has to go through pain when it is slaughtered. By your own standards it's immoral to kill an animal for meat",
            "title_similarity": "0.7147893",
            "sentiment_compound": -0.9024
        },
        {
            "id": "h878jpi",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h8785v4",
            "score": 70,
            "text": ">Animal cruelty negligence and especially torture deserve way harsher punishment.\n\n&#x200B;\n\n>I don't have any issues with people eating meat. But If they make an animal go through pain which is completely unesecary\n\nKilling an animal for your taste pleasure is always unescary, even if it had a \"great life\".   \nJust pick one, are you against animal cruelty or do you [eat meat](https://www.youtube.com/watch?v=LQRAfJyEsko)?",
            "title_similarity": "0.7702625",
            "sentiment_compound": -0.9352
        },
        {
            "id": "h86tp29",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h86zvok",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87b5tw",
            "score": 3,
            "text": "Given how you can probably live on a completely vegetarian diet, is any pain a food animal feels \"necessary\"?",
            "title_similarity": "0.46027574",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h87dvjq",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h87og2g",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h86ilit",
            "score": 120,
            "text": ">There was a video of a man torturing animals and all he got was 2 months of jail time.\n\nYou'll always be able to find examples of people getting off easily for horrendous crimes. While that can be a sign that the individual should have gotten harsher punishment, it doesn't mean that the penalties in general need to be raised.\n\nI'm not sure where in the world you are so I don't know what the laws are regarding animal cruelty in your country. Where I am (US) the penalty varies by states but can be [up to a $100,000 fine and/or up to 5 years in jail.](http://www.straypetadvocacy.org/PDF/AnimalCrueltyLaws.pdf)",
            "title_similarity": "0.8671381",
            "sentiment_compound": -0.8454
        },
        {
            "id": "h875pd9",
            "score": 3,
            "text": "\"Punishment\" doesn't solve much of anything. The threat of incarceration may cause some to quit the behavior maybe, but I would argue torturing animals is more of a psychological issue than a criminal one. \n\nI don't know what it would look like beyond counseling and maybe some kind of probation, but I fail to see how punishment, e.g. jail time, corrects this kind of behavior.",
            "title_similarity": "0.76999164",
            "sentiment_compound": -0.9766
        },
        {
            "id": "h87a71l",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87ah1t",
            "score": 2,
            "text": " What's animal cruelty exactly, because it seems like more of a relative definition than an objective (mainly dealing with severity to which an action is classified as such)? It it's killing an animal, or breeding it in anyway, this system just doesn't work logistically. Do prison's globally have the capacity to do such?; I'm not sure about this, especially when there are more severe crimes that the justice system should be worrying about in regards to sentencing more so than this. \n\n\nSecondly, I don't see why if they are not of the human species inehrently; in my opinion, this is more of a rehabilitation issue (why does individual feel the need to actually torture an animal in the first place, instead of simply killing it or leaving it to it's own device's). A good portion of the time, this can be a sign of a personality disorder or mental illness. They should be receiving psychiatric treatment majority of the time, but that's under the assumption that all of these global legal systems aren't corrupt to the point of caring and being able to classify such.\n\nAlso, how would you ever create a limit for this (if we are dealing we more severe sentencing you need more regulations and classifications)? If a person was to perform cruel experimentation on a spider should they go to a prison for a year? Will farmers end with four years?; Incarceration is no joke in many many regions, so at the very least this should be relative to the prison standards and regulations regarding incarceration, especially for the youth. Second, and there should be a certain standard of offenses for someone to have to go into said place, where they can end up dead or with extreme emotional dysregulation, which can make them commit more crimes. Further, I feel you may have to raise to incarceration rates on other offenses that are more serious.\n\nFourth, deserve is a relative concept, as opposed to an objective one. Overall, it doesn't make sense to me, as human rights don't equate to animal rights, especially since dogs don't follow the same regulations and laws as humans, so I fail to see why there is this urge to treat them even close to similar in such ideas. Also, I really don't want have to deal with false accusations and planting of animals, now that it is seen as a more legitimate offense.",
            "title_similarity": "0.8276119",
            "sentiment_compound": -0.9929
        },
        {
            "id": "h87aqdy",
            "score": 1,
            "text": "A lot of the time, people that hurt animals are projecting a feeling that can be rectified through mental help. I feel like a lot of the time these people could go on to lead healthy lives if mandatory therapy, animal cruelty classes, etc are part of the judgement. I’ve personally seen the change happen in a friend that is doing really well now. He had some psycho parents and once he dealt with that pain he could function properly. He had to pay for jail, therapy and classes, but was allowed to expunge his record after it was all paid.\n\nI think that on a first offense we should go low to no jail and years of mandatory classes and therapy *depending on the severity*.",
            "title_similarity": "0.7590256",
            "sentiment_compound": -0.5652
        },
        {
            "id": "h87cxpn",
            "score": 2,
            "text": "Brock Turner the rapist only served three months in jail for raping a woman. The affluenza kid killed people and was acquitted at trial because he didn’t know any better since he was rich. A bunch of horrible crimes aren’t punished enough or at all.",
            "title_similarity": "0.7299623",
            "sentiment_compound": -0.9349
        },
        {
            "id": "h87ety4",
            "score": 1,
            "text": "Harsher punishment in the sense of prison time isn't going to do anything. However, revoking the right to have a pet might unless needed as a service animal. Not sure how that would work though exactly.",
            "title_similarity": "0.6351931",
            "sentiment_compound": -0.8925
        },
        {
            "id": "h87fmuk",
            "score": 3,
            "text": "Nothing makes me sicker than animal cruelty. However, I only challenge your argument to say that punishment does not reduce recidivism as effectively as a rehabilitative approach. I'd rather require offenders to work (supervised) with victims of animal cruelty to help provide them with the empathy they lack.",
            "title_similarity": "0.7775997",
            "sentiment_compound": -0.9287
        },
        {
            "id": "h87ghey",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87ia0q",
            "score": 3,
            "text": "It's not unnecessary to make animals go through pain to eat meat. And you should have a problem with it given your supposed stance on animals going through hell. It is literally impossible to farm 75 billion land animals and 1-3 trillion marine animals every single year and not have the majority of those animals go through absolute hell on earth.\n\nI agree with the rest of what you said. The only way to do this is to demand animal rights. Across the board. Not just for specific animal breeds we find cute. That means, if you want to consistently protect a dog from being sexually abused, you have to also do the same thing for a pig, otherwise you have zero good arguments for your position.\n\nOne of the definitions of abuse is \"treat (a person or an animal) with cruelty or violence, especially regularly or repeatedly.\"\n\nNow, will you extend this kindness to all animals, or just animals you like personally? Will you change your stance on eating meat, or is this an inconsistency in your anti-cruelty politics you are fine defending? I have heard pretty terrible arguments for why conventional pig, cow and chicken farming is fine, while abusing dogs is not. None of them have stood up to even a miniscule amount of scrutiny, so I can't wait to hear your arguments to see if they are better.\n\nHow will you convince someone to give animals more rights in the law when you won't even defend certain species of animals from even having basic autonomy over their reproductive organs?\n\nAlso, are you against fishing? There's the \"unnecessary pain\" aspect again.",
            "title_similarity": "0.7815354",
            "sentiment_compound": -0.9722
        },
        {
            "id": "h87iwns",
            "score": 2,
            "text": "When you’re asking for harsher punishment, I think you’ve gotta be specific with what kind of fines or jail time you want to increase, and how to enforce that.\n\nDo you want to increase the amount of enforcement there is for possible neglect? Do you want to have a pseudo-child protective services but for pets? What kind of jail time/fines are we talking about that need to be increased? \n\nI think the current laws are pretty stringent as is, but the question is how you would catch someone neglecting a pet, especially since they would probably keep it inside all year round.",
            "title_similarity": "0.6968174",
            "sentiment_compound": 0.3591
        },
        {
            "id": "h87ji1h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87k3cu",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87lp1i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87ls0n",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87mdae",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87mnu1",
            "score": 3,
            "text": "> I don't have any issues with people eating meat. But If they make an animal go through pain which is completely unesecary.\n\nBy this logic we have to ban most hunting.",
            "title_similarity": "0.62221605",
            "sentiment_compound": -0.8847
        },
        {
            "id": "h87ouxv",
            "score": 3,
            "text": "So as pointed out the current punishment is up to 5 years in jail. Do you feel like that isn’t enough? \n\nKeep in mind crimes like rape tend to get a sentence of 7 years. Normal assault tend to get a max of 5 as well. It seems fairly on par. \n\nThe issue with raising is you need to balance it with jury nullification. You need quite the majority of people to agree that the punishment is suitable, otherwise they may acknowledge that the person did the crime but vote not guilty because the punishment isn’t fair. This isn’t good for obvious reasons.",
            "title_similarity": "0.7086526",
            "sentiment_compound": -0.0649
        },
        {
            "id": "h87ptuh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h87qpcy",
            "score": 1,
            "text": "There are people that abuse their spouses that get less time than someone who publicly abuses a cat or dog.",
            "title_similarity": "0.669545",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h87tuco",
            "score": 3,
            "text": "From what I’ve read in this response people are focusing on distinction of animals and case by case. I’m going to say that the treatment generally isn’t right. I think jail time generally doesn’t help anything. We can probably agree that anyone who tortured an animal intentionally (not talking about keeping dogs in too small of a house). Generally has something mentally not quite right. What’s locking them up actually doing? Taking away life chances and setting people up for failure in the US 50% of people get incarcerated again so don’t make sentences harsher by giving more time. Change the punishment.",
            "title_similarity": "0.8682529",
            "sentiment_compound": -0.6637
        },
        {
            "id": "h87u2jl",
            "score": 17,
            "text": "if the punishment was made harsher than the meat and dairy industries would actually have to be held accountable for their treatment  of animals, and i don’t see that happening",
            "title_similarity": "0.7604927",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h87urly",
            "score": 1,
            "text": "Will this also allow normalization of the consumption of horses, dogs, and insects in the United States?",
            "title_similarity": "0.40387756",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h87wtt0",
            "score": 1,
            "text": "Jail time is arbitrary and if punishments are being examined for augmentation then the focus should be on rehabilitation rather than changing this arbitrary number to another arbitrary number. I don't think increased jail time leads to more success in rehab so other options have to be considered.",
            "title_similarity": "0.5807961",
            "sentiment_compound": 0.2451
        },
        {
            "id": "h87z6rc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h881rln",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h882ly3",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.06611834"
        },
        {
            "id": "h883fy5",
            "score": 3,
            "text": "Hard not to bring up veganism here op. If you're against animal abuse, you have to be vegan. Otherwise you're not only for animal abuse, but you directly fund it.",
            "title_similarity": "0.5785388",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h885wfm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0661183"
        },
        {
            "id": "h886kgj",
            "score": 1,
            "text": "Torturing dogs cats or similar pets should be on par with child abuse. That kinda people need to be in jail or dead",
            "title_similarity": "0.6903948",
            "sentiment_compound": -0.926
        },
        {
            "id": "h889pij",
            "score": 2,
            "text": "The House of Representatives made animal cruelty a federal crime in October of 2020.\n\nhttps://www.humanesociety.org/news/extreme-animal-cruelty-can-now-be-prosecuted-federal-crime",
            "title_similarity": "0.56010056",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h8aqikp",
            "score": 3,
            "text": "I would be down to do this if we extend the laws to all animals, not just dogs and cats and cute animals that we love. I guarantee you you’ve eaten the products of animals that were torture damn near their entire lives.",
            "title_similarity": "0.7014202",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8b65ie",
            "score": 1,
            "text": "Heres a different reason to change your view:\nPrison is not a good deterrent to crime, and it's even worse at rehabilitating criminals. People leave prison more traumatized, unstable, and ill-prepared for life than before, which is not useful for creating upstanding citizens. Prison is nothing more than petty retribution with rare positive outcomes and common negative ones, for the whole of society. [There's a ton on it but this article seems super applicable here.](https://newsroom.unsw.edu.au/news/business-law/do-harsher-punishments-deter-crime)\n\nIt's only potential benefit is lifelong imprisonment for people we can't allow loose into society- who that includes is of course debatable. Most would agree generally murderers, rapists, child molesters would be included, and there can be an argument for animal abusers as well. \n\nBut given the reality of how prison does not deter crime nor rehabilitate criminals, there is no argument for temporary imprisonment as punishment, for anything really, unless you think it's ideal to inflict suffering on people for some number of years and then release them to very likely go on and inflict yet more suffering. \n\nThe better solution to animal neglect, abuse and torture is better education about their care and sentience, and a better world for people to grow up in so they don't have the issues that lead to such disturbing behavior.",
            "title_similarity": "0.8157643",
            "sentiment_compound": -0.9855
        },
        {
            "id": "h8cd9cf",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.093195885"
        },
        {
            "id": "h8czzqs",
            "score": 1,
            "text": "I agree, however you can do only so much before it becomes cruel and unusual punishment which is banned by the bill of rights in America.",
            "title_similarity": "0.55254865",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h8fhqjs",
            "score": 1,
            "text": "The thought structure for your view is flawed.  It's called a dangling modifier.\n\npunishment should be harsher than ......... What?\n\nHarsher than they are now?  But \"now\" is fluid.  The \"now\" of you reading this comment isn't the same \"now\" as me writing this comment.  By letting the modifier dangle like this, you get modern politics.\n\n\"Men should be less sexually aggressive to women\".  This made sense in 1960 when groping waitresses was common.  In 2021 more than 1/3 of adult men where not even sexually active, but the view/position hasn't changed it's still men should be less sexually aggressive to women. (note the pandemic actually helped more men become sexually active)\n\n\"Punish criminals harsher\".  This is Republicans doing it.  In the 1960's with \"State hospitals\" for the mentally ill there was a perception that these criminals where getting off easy by going to hospitals rather than prisons.  Fast forward to 2022 and the penalty for taking a piss in an alley is 5 years in prison and you are added to \"the sex offenders registry\" and not allowed to work with children or hold government positions.  We are well past obsurdity on \"punish criminals harsher\"\n\nLets look at \"animal cruelty deserves harsher penalty\".\n\nPenalty : 1$\n\nHarsher\n\nPenalty: 10$\n\nHarsher\n\nPenalty: 100,000$\n\nHarsher\n\nPenalty: 1 year\n\nharsher\n\nPenalty: 10 years\n\nHARSHER\n\npenalty: 100 years\n\nHarsher\n\npenalty: DEATH\n\nHarsher\n\npenalty: Shot up with drugs that put you in unbearable agony and keep you pumped full of these agonizer drugs for weeks untill your heart gives out from the strain.\n\n&#x200B;\n\nHARSHER\n\npenalty: WTF how do you get harsher than that!!!!\n\n&#x200B;\n\nThis is a flaw with how humans work.  If you are not one of the few people actively involved with each and every incremental step, you aren't in a position to actually try putting on the breaks if it goes too far.  Even if it goes so far as the agonizer drugs, will you actually realize that?  or will your posistion persist as \"harsher\"?\n\nA Dramatically stronger position/view would be \"The punishment for animal cruelty should be 2 years in prison\"  Nothing dangling there.  If the penalty is 3 years, reduce it, correct number is 2.  If peanalty is 1 year increase it, correct number is 2.  If penalty is agonizer drugs......wtf, correct penalty is two years.",
            "title_similarity": "0.68650544",
            "sentiment_compound": -0.9996
        },
        {
            "id": "h8hnsgt",
            "score": 2,
            "text": "Petco, Petsmart….lookin at you.",
            "title_similarity": "0.1991362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6cr9o",
            "score": 1,
            "text": "You need to stop going into dark corners of the internet and watching these videos. I don't know why you'd do that to yourself",
            "title_similarity": "0.55453014",
            "sentiment_compound": -0.296
        }
    ]
}