{
    "CMV: Fat acceptance is the same as enabling an addict\nI am an alcoholic in recovery (almost 6 years sober) and one thing that really sets me off is seeing articles and posts about how overweight people need to be better accommodated/catered to. \n\nWhile I consider myself to be an empathetic person and I would never be vocally cruel to anyone, this really raises my hackles because, essentially, I see NO difference between this and demanding that, because I'm genetically an alcoholic, I should be furnished with booze and allowed to be a drunken mess. \n\nLife isn't easy, people struggle against inherent, damaging traits, genetic or otherwise, all the time. I simply don't get why one should be 'accepted' while the other is deterred. (note: This is not an argument for me to go back to drinking)\n\n**Edit**: Thank you all for the replies - even the ones calling me an idiot. Two quick add-ons: The specific article in question that made me write this was all about how a hotel did a poor job of catering to 'plus-size' people due to the fact that towels and toilets were \"too small.\" I am not advocating for cruelty or 'shaming,' but rather, this notion that the world should change instead of oneself. \n\nSecond, your comments have made me realize that I have carried a big chip on my shoulder in regards to my own lack of support - perhaps, seeing 'acceptance', whether it's for addiction, being overweight, etc., touches a nerve because it was so absent in my earlier life.\n\n**Edit 2**: It has become clearer that I had not properly understood the actual meaning of 'fat acceptance' and had jumped to conclusions based on social media and buzzfeed articles. (not smart) Thank you again to all the helpful comments.\n\n**Final edit on this journey of self-discovery**: I think a lot of these feelings were/are rooted in self-loathing. The base assumption is that I am some fit person, but I am definitely overweight. My brain finds it a lot easier to jump to negative conclusions when analyzing myself, thus, I think I am projecting that outward as well.": [
        {
            "id": "h8aq7wu",
            "score": 1,
            "text": "/u/hockeyjoker (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/p142ov/deltas_awarded_in_cmv_fat_acceptance_is_the_same/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.47236097",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h8b2wp1",
            "score": -1,
            "text": "Fat acceptance is about 2 things *mostly*.\n\n1 - Fat people being able to walk around in public without being harassed by total strangers. Something that EVERYONE should be able to do.\n\n2 - Fat people being able to have medical treatment that is not withheld until they have lost weight. This can manifest in the form of doctors assuming that any health problem is due to weight and not even investigating reported symptoms of cancer, endometriosis, polyps, etc etc. This can manifest in the denial of diagnostic surgeries until someone has lost weight. This can also result in health and life insurance companies refusing coverage, which in the US specifically is one of the corporate equivalencies of assigning zero value to an individual life.\n\nAnd on a different note, there are some specific medical circumstances where alchohol is prescribed medically to alchoholics. Obviously this is not your situation, but just being aware of that fact should help you understand that your lived experience does not apply to all other people who share one of your health problems.",
            "title_similarity": "0.7674824",
            "sentiment_compound": 0.3453
        },
        {
            "id": "h8ak06h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8b07vu",
            "score": -1,
            "text": "Fat acceptance is both a) the best strategy to approach people to get them to lose weight, and b) how you should treat strangers generally.\n\nThe research on this is pretty clear - shaming people is 100% counter productive. Besides, losing weight is far more complex than people think. Your body wants to hold on to fat, and hates getting rid of it. \"Just eat less\" doesn't work.",
            "title_similarity": "0.8238875",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h8atioq",
            "score": -3,
            "text": "An interesting difference with obesity that's worth considering is this:\n\nIt's actually *worse* for your health to lose weight and then regain it than it would have been to simply stay at the \"unhealthy\" weight in the first place. \n\nSince something like 95% of people that try to lose weight regain most of it within 5 years, they'd actually be medically better off not having been encouraged to lose it in the first place. \n\nInstead, people should learn to appreciate their body, and make efforts to *stop gaining* weight, at least a first. If and only if they are able to succeed at that long-term should they consider themselves sufficiently likely to successfully lose weight to make that attempt. \n\nI can't think of any comparable addiction that has this feature, so most analogies are going to fail.",
            "title_similarity": "0.74497855",
            "sentiment_compound": -0.4956
        },
        {
            "id": "h8arf6i",
            "score": 8,
            "text": "When my wife and I were thinking about adoption and foster care, we had to take classes through the county to get qualified.  We sat at tables in a U shape, and directly across from us was a younger couple.  They were both extremely obese.  They came to class with bags of fast food breakfast.  I don't think it was their first breakfast, either.  They also carried with them a big bag full of sugary snacks and chips.  Just tons of junk food.  After they finished breakfast, they started digging into the junk food.  We had an hour to go get lunch, and they would come back with more bags of fast food lunch. I guarantee you they ate lunch then brought more lunch back to class.  When they finished their second lunch, they dove back into the junk food bag. \n  \nThey didn't stop eating the entire time we were in class.  I sat across from them for four days, and they did that every day. It was disgusting. I'm sure some people have glandular issues that can cause weight gain, but that is always manageable with a healthy diet and exercise. Anybody that obese has nobody to blame but themselves.  I'm sure that couple is not unique. That is probably common behavior for the morbidly obese, which is why I have no sympathy for them.  And I hope that particular couple wasn't allowed to adopt or foster a child, because they would only pass those unhealthy habits on to the child.",
            "title_similarity": "0.55339366",
            "sentiment_compound": 0.4408
        },
        {
            "id": "h8apmbl",
            "score": 0,
            "text": "Bottom line, just don't be a dick to people.  Nobody should feel worthless.  Don't we have enough problems as a society.  Obesity is a symptom of a mental illness.  Unhealthy food triggers the pleasure receptors in the brain, no different than a drug addict or alcoholic.  You state you are a recovering alcoholic, yet here you are on your soapbox, shouting that of I can recover, so can everyone else.  This is a flawed opinion.  Obese people know they are fat. They live with it everyday.  Everyday they are discriminated against.  They are !are to feel like second class citizens, then they get depressed and eat to dull the pain.  It's a vicious cycle.   \n\nSource:  I've been obese my whole life of 58 years.  Leave people the fuck alone and live your own life and don't judge people you don't know.  Like the saying, you shouldn't throw stones in glass houses.",
            "title_similarity": "0.87541187",
            "sentiment_compound": -0.9776
        },
        {
            "id": "h8d19ye",
            "score": 0,
            "text": "As a fellow alcoholic, let me explain something. Being an alcoholic gives you ABSOLUTELY ZERO grounds of experience on the issue of obesity.\n\nThere is not a daily need for you to use your drug of choice in recovery. You do not need alcohol to live. You will not die if you never drink again.\n\nNow do you understand why food addiction and chemical addiction are NOT the same?\n\nThis post remaining up is a lightning rod to attract people who have that harmful view. You do not get to boost yourself with the apology at the end. If you have learned the mistake you made posting it, you need to delete it.",
            "title_similarity": "0.8036263",
            "sentiment_compound": 0.2933
        },
        {
            "id": "h8ahisj",
            "score": 2,
            "text": "It is an odd one. Rather than support folk to get to a healthy  size, we are indeed  told that we should love the curves. No one wants to see folk suffer, and I guess it's a sensitive  issue",
            "title_similarity": "0.6545539",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8aktf0",
            "score": -17,
            "text": "“I see NO difference between this and demanding that, because I'm genetically an alcoholic, I should be furnished with booze and allowed to be a drunken mess.”\n\nWhat if the overweight person has a healthy diet and exercise program, and are normal in cholesterol levels, blood sugar etc, but are still overweight? I know many people for whom this is the case. They are healthier than overweight people who eat junk food and don’t exercise, and they do lose some weight, but many are still obese. What else can they do?",
            "title_similarity": "0.8819865",
            "sentiment_compound": -0.914
        },
        {
            "id": "h8au0zm",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.13213183"
        },
        {
            "id": "h8au1s8",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.13213183"
        },
        {
            "id": "h8d0l4b",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8anx2m",
            "score": 0,
            "text": "It’s not about being equivalent to”being furnished with  booze and allowed to be a drunken mess.” \n\nIt has to do with the proven (in multiple studies over 40years) that shame links to increases in obesity, being overweight or even obese is not a 1:1 determination of health, and that diets fail at a rate (depending on the study you look at) between 93-97%, with participants in diet programs weighing more 5 years after beginning a diet program. \n\nIf shame effectively kept weight off then there would be no fat people in the US. \n\nThe point is to accept people as humans first, and recognize and yes, celebrate them as they are.",
            "title_similarity": "0.74816275",
            "sentiment_compound": -0.5801
        },
        {
            "id": "h8b4v6j",
            "score": 0,
            "text": "You're gottdamn right. Especially during a global pandemic, telling people that a condition which multiplies their chances of falling I'll and potentially dying should be a point of pride, is morally close to manslaughter.",
            "title_similarity": "0.6650194",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8b5mkj",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.13213183"
        },
        {
            "id": "h8apnly",
            "score": -1,
            "text": "I get what you're saying. There are definitely assholes who seem to only care about fat acceptance when they get to look down on others--the same as any attempt to correct a wrong like racism or sexism. Just because some people go too far doesn't mean the entire concept is wrong.\n\nMind you, this is tough. On one hand, we don't want to enable unhealthy behaviors. On the other hand, people have a right to do unhealthy things if it doesn't hurt others. Imagine how you would feel if a complete stranger came up to you and said, \"I really hope you're dieting & exercising because you're fat and I want you to be healthy.\" How rude would that be even if it was accurate! \n\nAs for \"glorifying\" being fat: \n\n* Letting people smoke cigarettes without comment despite it being unhealthy is not glorifying smoking.\n* Letting people skip the gym without comment despite it being unhealthy is not glorifying laziness. \n* And letting people be fat without comment despite it being unhealthy is not glorifying fat bodies. \n\nAn alcoholic, like a drug addict, is literally addicted to the substance. AFAIK, there is not medically defined addiction to food. Poor choices? Absolutely! \n\nYou should change your view because: \n\n1. Fat acceptance is mostly (but not completely) about protecting people from harassment.\n2. We don't typically harass people for doing similarly unhealthy things like alcohol or not exercising--just fat. (The closest we come is with tobacco, but that's mostly due to second-hand smoke and there's no equivalent with food.)\n3. Even if we mean well, fat people don't need our judgement or even concern unless they ask for it. It's not our business unless it impacts us.",
            "title_similarity": "0.7793044",
            "sentiment_compound": -0.3223
        },
        {
            "id": "h8aqubn",
            "score": -1,
            "text": "People don't lose weight overnight. It takes a lot of time and effort. Some people have a very hard time losing weight because of medication or metabolism issues. So why should we not cater them? Should restaurants refuse service to obese clientele? Should gyms refuse entry to obese people because they might break the equipment? Try to step into their shoes. We should at least make their lives a little easier and treat them with dignity. Not everyone who is obese is addicted to eating. But all alcoholics are addicted to drinking. So your analogy doesn't check out here.",
            "title_similarity": "0.8235406",
            "sentiment_compound": 0.2529
        },
        {
            "id": "h8akyzs",
            "score": 364,
            "text": "I think the premise that a person can only be overweight due to a debilitating addiction similar to alcoholism is flawed from the start.\n\nYes it's possible for someone to be overweight due to a food addiction but it's also just as likely that they can't afford healthy food, their metabolism makes losing weight difficult, they don't have time in their lives to exercise, etc.\n\nAlcoholism or other drug addictions are 100% a direct result of an abuse of an unnecessary drug. Someone overweight might have the exact same relationship with food as a thin person, not to mention that everyone has to eat. You can't avoid food.\n\nThe other major difference is that due to the very visible nature of being overweight (as compared to some other addictions), overweight people are often subjected to cultural and interpersonal ridicule in ways that, lets say, an alcoholic will rarely be.\n\nA functional alcoholic can go through life without anybody suspecting they have an addiction, while an overweight person is often reminded of their difference in large and small ways daily. And even if their alcoholism were public, the response is often compassion as opposed to either ridicule or shaming that an overweight person often receives.\n\nThat's what the fat acceptance movement is in response to. It's telling overweight people that their value as a person is not dependent on their weight.",
            "title_similarity": "0.82515526",
            "sentiment_compound": -0.9853
        },
        {
            "id": "h8ao06a",
            "score": -11,
            "text": "You do realize that there are actual medical conditions that cause people to not only gain weight but struggle unbelievably to shed any of it???\n\n...maybe you just need to educate yourself a bit more.\n\nSome overweight people eat very healthy and exercise regularly and still suffer being overweight and get ridiculed for it. That is why \"fat acceptance\" is not at all enabling but just humane. \n\nThe last fat person you judged... did you bother to ask why they are overweight, or just assume you know the magical answer to everyone's life?",
            "title_similarity": "0.813092",
            "sentiment_compound": -0.9588
        },
        {
            "id": "h8akzkn",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8amyx7",
            "score": -1,
            "text": "No not at all, drug addiction is way way way more harmful, being overweight increases your risk of illness and injury but doing drugs is a case of how long before you die or get clean. Drug addiction also leads to other people getting harmed often as a result of the need for money for drugs. \n\nBeing overweight is unhealthy and that is a fact but it is also a choice and people are free to choice what they do with their body. Drugs often start as a choice but end up becoming an addiction. \n\nAlso a lot of fat acceptance instead that it is healthy to be over weight but more that fat shamming and being generally harmful to fat people is bad and shouldn’t happen. It is more about accepting people who are over weight are free to be themselves and be loved than it is that being overweight is healthy.",
            "title_similarity": "0.87805104",
            "sentiment_compound": 0.3789
        },
        {
            "id": "h8aja5f",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.13213183"
        },
        {
            "id": "h8ar8ae",
            "score": 5,
            "text": "The issue seems to be muddied waters. What \"fat acceptance\" started as was don't be a dick to someone just because they are fat. Fat people were pretty much seen as universally ugly despite any other features. For anyone with addiction or who uses food as a comfort to deal with mental illness (me included) this leads to depression and disillusionment. The basic thought becomes \"I'm ugly, and if I lose weight I will still be ugly, so why bother.\" This leads to someone who was fine in any other respect to stop any kind of care, including mental health care and personal hygiene. In the same way that anyone should love yourself despite your flaws, it's ok to be proud of other physical traits despite being overweight.\n\nIt's also because obesity is a clearly visible vice, so people are more confident in being judgmental. You can't glance at someone and know they have a gambling addiction, or are an alcoholic, or are addicted to cocaine, but you can tell a person is fat from a mile away and we all know it.\n\nIt also affects healthcare, and not in the ways you expect. It is clinically irresponsible for a doctor to not tell an overweight person to lose weight, but is also irresponsible for them to brush off complaints as \"solely due to weight.\" In the same way people get brushed off because \"it's just anxiety\" or \"it's just your period\" or \"it's just aging,\" being fat generally leads to getting worse healthcare. Especially when the weight is a symptom of underlying causes.\n\nOf course there are apologists who take it too far. Nobody should be shamed for wanting to lose weight. Excess fat is detrimental to health on physical, physiological, and mental levels. However, the depression that comes with a stigma may discourage a person from even trying. Even if you are not perfect, you can be fat and *relatively* healthy. If you walk several miles a day, then eat a whole cake, you will be fat and suffer any joint pain/damage due to the excess weight, but your blood pressure and other health factors will benefit from the aerobic exercise.",
            "title_similarity": "0.84039044",
            "sentiment_compound": -0.9884
        },
        {
            "id": "h8ahwe7",
            "score": 2658,
            "text": "I'm not sure why people equate fat acceptance with shoving burgers down peoples throats. Fat acceptance is simply the the idea fat people should not be ridiculed or discriminated against.\n\nPeople with food addictions are still going to be treated.",
            "title_similarity": "0.70331115",
            "sentiment_compound": 0.7309
        },
        {
            "id": "h8almtw",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8ansnr",
            "score": 0,
            "text": "People's health needs are none of your damn business.  Simple as that.\n\nYeah, your alcoholism should probably also be accommodated.  People should be wary of alcoholics and not pressure others into drinking something that may cause significant harm.",
            "title_similarity": "0.7103695",
            "sentiment_compound": 0.3911
        },
        {
            "id": "h8ao7sj",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8apar1",
            "score": 3,
            "text": "Fat acceptance =/= obesity is alright and nothing should be done about it.\n\nThis topic comes up almost every week and it's the same thing over and over again, and no one seems to grasp the concept that fat acceptance, for most of its history, was never about obesity being okay, actually.\n\nFat acceptance broadly started in the 90's when being rail, waifishly thin was the norm. That norm was extremely damaging, because it requires so much work and self-denial that it was ruining people's bodies, mental-health, and wallets. Fat acceptance basically stated that being thick, hefty, rounder, whatever, is actually fine and that there's more to being healthy than having a trim figure. You can be plus-sized and eat perfectly healthy or have a wide waist-line while working out regularly, because people are built differently. \n\nObesity factors in how there's growing evidence to suggest that over-indulging in food has something to do with past traumas or other similar issues than just base gluttony, and that people who are obese don't need or deserve to be maligned or scorned by society since they're essentially fighting an uphill battle against their own bodies. No one is arguing that they should be able to eat how they want, medical expenses be damned, but that maybe there should be seats available to them on public transit, or that some might actually need canes and carts to navigate because their body is all worn down by their weight. It's obviously a complicated issue, but enabling obesity isn't on the table.",
            "title_similarity": "0.75555503",
            "sentiment_compound": 0.0091
        },
        {
            "id": "h8aphho",
            "score": 0,
            "text": "I understand what you are saying. My husband is an alcoholic (recovering, 3years sober) and we had a friend who would have an issue with alcohol use, but he would talk about getting his stomach stapled vs getting help. He would then run off to buy more fast food. It's acceptable to see a 500 lbs person in McDonalds shoving down 5000 calories a meal, society doesn't see it for what it is - an addiction, the same as alcoholism and drugs.",
            "title_similarity": "0.77087843",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h8apqgy",
            "score": 0,
            "text": "People with addiciton should also not be ridiculed.\n\n\"Junky\" is an offensive term for addict, usually a homeless addict. Similar to fatso for a fat person.",
            "title_similarity": "0.81038785",
            "sentiment_compound": -0.224
        },
        {
            "id": "h8aq5xw",
            "score": 0,
            "text": "There’s a difference when you look at the recovery process. When you were 3 months into your sobriety journey, you were already sober even though your journey was far from over. An obese person who’s 3 months into their weight loss journey is still going to be obese. Not sure if that changes your main CMV but it’s something to think about. An obese person might be ready for a change or already in the process of making one and if that’s the case the analogy would be between the obese person and your 3 month sober self, not the drunken mess you were before.\n\nI agree that these fat acceptance arguments tend to go way off the rails, but if they’re talking about access to treatment I think it’s reasonable. TLC has a show called My 600-lb Life where morbidly obese people go to Houston to have a procedure done by this one doctor and a lot of times it’s insanely difficult for them to even make it there.",
            "title_similarity": "0.6991608",
            "sentiment_compound": 0.6409
        },
        {
            "id": "h8as5he",
            "score": 0,
            "text": "My only argument against this is that a person on drugs can, and do, hurt and kill people all the time, predominantly with cars. Completely unintentionally of course. Unless a fat person falls on you, you are in very little danger of being hurt by them.",
            "title_similarity": "0.7528498",
            "sentiment_compound": -0.9544
        },
        {
            "id": "h8aueii",
            "score": 0,
            "text": "It is worth noting that there is a big difference in being fat and being obese. Some people, particularly people of color (and especially Polynesians), naturally have larger bodies. This is not due to lifestyle or diet, and some of these people are very athletic.\n\n[https://www.youtube.com/watch?v=WIFkC0LkV3U](https://www.youtube.com/watch?v=WIFkC0LkV3U)\n\n[https://www.thesportster.com/entertainment/top-15-greatest-fat-professional-athletes/](https://www.thesportster.com/entertainment/top-15-greatest-fat-professional-athletes/)\n\nNotably, fat shaming can result in severe harm to these people, particularly in the medical profession. It is relatively common for a fat person to have all of their problems blamed on their weight.\n\nWhen doctors don't take fat people's medical problems seriously, this can result in severe and dangerous medical conditions being un-diagnosed.\n\n[https://www.webmd.com/diet/obesity/news/20170803/fat-shaming-patients-can-cause-real-harm](https://www.webmd.com/diet/obesity/news/20170803/fat-shaming-patients-can-cause-real-harm)\n\nSocietal fat shaming does not distinguish between obesity and larger body types, and this makes life needlessly harder for people who are naturally a bit more heavy-set.",
            "title_similarity": "0.59147596",
            "sentiment_compound": -0.961
        },
        {
            "id": "h8aw46d",
            "score": 0,
            "text": "OP; unfortunately i agree with you. Now can we start equating sober people who have never touched a drop or a joint to anorexic/bulimic people? I always knew those squares had something wrong with em. LOL! (Kidding)",
            "title_similarity": "0.8090063",
            "sentiment_compound": 0.4659
        },
        {
            "id": "h8ayicg",
            "score": 0,
            "text": "Obesity and addiction have the same source problems. People are primarily obese because they can't stop eating and drinking highly processed food, that packs on fat. When you couple that with an inactive lifestyle, the mortality rates aren't going down anytime soon. Heart disease and obesity kill a lot more people than booze.",
            "title_similarity": "0.77971053",
            "sentiment_compound": -0.3208
        },
        {
            "id": "h8azixc",
            "score": 0,
            "text": "I really used to think I was powerless against food. Now I'm on my feet 9 hrs a day and I don't eat sweets which has led to a decrease in my body fat. I was over 300 lbs at the start of the year and I'm 245 now. What's messed up is how fat I still am, like I feel I could drop another 50 and still be chubby. (I'm 6'4\" btw. Height seems to be important when talking about weight.)   \n\nI've realized that to get and stay fat, it's usually a good indicator that you sit around all day and/or you scarf down calories. I used to eat all the food, now I just eat my food.   \n\nStill though, I learned to agree that accepting morbidly obese people is like accepting smokers and junkies. It comes down to you though. Do you want to be mean? You're not going to change that person's life no matter how you approach them. They don't have to know you don't approve, they themselves don't approve on some level. So any acceptance/tolerance movement really just boils down to don't be a dick.   \n\nIf you really want to be a dick, I can't stop you. But it's a lonely life unless you're connected old money.",
            "title_similarity": "0.7188791",
            "sentiment_compound": 0.0876
        },
        {
            "id": "h8b4i04",
            "score": 0,
            "text": "Can people tell you're an alcoholic by looking at you?  Can they walk into a room, see you, and know you're struggling with it every day?  Do they treat you poorly whether today was a good day or a bad day because of it?",
            "title_similarity": "0.74140316",
            "sentiment_compound": -0.3049
        },
        {
            "id": "h8b58tv",
            "score": 0,
            "text": "I wonder how my big bone with many hormonal problems cousin feels when she reads stuff like this.. she is seen like an addict just because she is big bone with hormonal issues. She has a happy life with a man that oversees her \"addiction\" and a beautiful baby.",
            "title_similarity": "0.76717865",
            "sentiment_compound": 0.872
        },
        {
            "id": "h8b5c8v",
            "score": 0,
            "text": "Recovering alcoholic?\n\n&#x200B;\n\nSo you just have 3 drinks a day right?  All family functions are at bars?  Your fridge is fully stocked with wine & beer and your pantry is full of vodka and whiskey.\n\nIn fact, your body **physically** **requires** several drinks a day, and your problem is just that you drink 6 instead of 3.\n\nBut through pure willpower alone, you got your drinking down to just the required amount every day.\n\nFucking champ.",
            "title_similarity": "0.7047072",
            "sentiment_compound": 0.4175
        },
        {
            "id": "h8b6yjk",
            "score": 0,
            "text": "The Republican party is the same as promoting evil, change my view. Every single Nazi ass white power person who voted for Donald Trump and invaded the Capital building needs to be locked up in Gitmo for life.",
            "title_similarity": "0.5877317",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8b96dj",
            "score": 0,
            "text": "No difference? I’m not seeing a ton of articles about someone scarfing a large Cajun fry and killing a family on their drive back from Five Guys.",
            "title_similarity": "0.5201688",
            "sentiment_compound": -0.765
        },
        {
            "id": "h8ban61",
            "score": 3,
            "text": "When people see you holding a beer people don't automatically presume you to be an alcohol addict, and ​assume all problems that come with alcohol addiction to also apply to you. \n\nWhen people see you as fat people presume you to be a food addict that is unable to control their food addiction, and assume all problems that come with food addiction to also apply to you. I mean, that's the position you're taking in this very post itself lol. \n\nThe problem with that presumption is that you don't actually know whether they're a food addict or not just by looking at their body shape, just like how people can't tell if you're alcoholic if they just see you holding a beer. That's not how you judge if a person is addicted to anything at all, addiction is about behaviour and not about looks. You can't actually tell anything about a person's behaviour or lifestyle or actual health from how they look either.\n\nSince you know nothing about their behaviour or lifestyle or health, why would you assume them to be an addict? It just doesn't make any sense at all. We need to stop pretending that fat shaming actually has anything to do with the behaviour or the health of the person they're shaming. It's always about looks and only looks. \n\nJudging people by how they look is bad because not only it's lookism aka discrimination by looks, you're also going to be factually wrong most of the time. It's also important to remember that there are a lot of people who are called fat aren't actually fat, they're just called fat because the people fat shaming them thinks they are. \n\nFat acceptance has less to do with fat people and more to do with the people doing the fat shaming. There will always be fat people around in society.  People who fat shame need to accept that their fat shaming has nothing to do with the supposed altruistic concern for fat person's behaviour or lifestyle and rather everything to do with their own discomfort at seeing a fat person. People who fat shame act out because of that discomfort and created an actual form of discrimination in society that affects both fat people and people who aren't actually fat but judged as fat. People who fat shame really just need to accept that fat people exists and get over it.",
            "title_similarity": "0.8259824",
            "sentiment_compound": -0.8135
        },
        {
            "id": "h8bcemq",
            "score": 0,
            "text": "I see it this way. Choices are what you eat, portion control, how often you eat, exercise and the type of exercise. Observing these choices are key to losing and maintaining a healthy weight, choosing not to is a choice and that choice should be addressed. If you let yourself go, then it's not acceptable to have extra public tax support for your health, also that it isn't acceptable to have to be paying an equal amount to a airline for resource costs, when it costs more resources to transport significantly heavier people. So all in all, I believe that if you dig your own grave, you are the only one that should have to pay for it.\n\nNow... broaching professionally diagnosed medical conditions that prevent regular exercise and healthy routines, consider yourselves excommunicated from the conversation. Basically, I don't have the experience to speak on this (most likely nobody outside of a professional medical or scientific degree regarding each particular field of study, does). That is something that would have to be addressed via a medical professional. That being said, however, the majority of people on this planet and on Reddit (though many liars claim otherwise) are not experiencing health conditions that prevent them from exercise and eating right, minus third world poverty restrictions which are also a great unknown to most.\n\nOverall, we have majority responsibility and control over our own health, and treating it badly is a choice one should have to shoulder, financially, alone. Healthcare in the U.S., and U.K. is atrocious because of the potential health risks a majority of people pose to insurance and other medical support programs. \"Freedom\" doesn't mean stuff cheeseburgers or fried food down my gullet all my life until I require medication or surgery. If you have professionally diagnosed addiction or medical condition, then you are a unique case that requires unique attention, and you are not part of the norm conversation, rather just a fixed element one has to observe when making political decisions. That is my thought on the matter.",
            "title_similarity": "0.7187075",
            "sentiment_compound": -0.2556
        },
        {
            "id": "h8boc70",
            "score": 0,
            "text": "Why don’t you just focus on your own health and stop looking around for another subset to bully.  \n\nPeople with food addictions have a different battle to face.  No cold Turkey for them.  They have to sit with their demons three times a day.  And believe me, no one goes out of their way to make life easier for fat people.  It’s not easy to wear your weakness for all to see and comment about.  Some people go home and beat or verbally abuse their loved ones, some are addicted to porn, drugs, alcohol and gambling.  But you’d never know it.  An overweight person wears their biggest challenge for all to see … and most people are unkind.",
            "title_similarity": "0.83487797",
            "sentiment_compound": -0.9209
        },
        {
            "id": "h8bs1cs",
            "score": 0,
            "text": "I think people are underestimating what fat acceptance is. It has no more to do with being nice to fat people than political correctness has to do with being nice to racists. Fat acceptance is about making people feel powerless to effect change in their bodies. It's scientists telling people to give up before they even start, because they know the food pyramid is more likely to cause obesity than to prevent it. It's the media normalizing obesity. It's psychiatry insisting that shame doesn't work while simultaneously designing social credit control systems to nag our every behavior.\n\nFat people are innocent. They're just trying to make the best of it, while our institutions are deliberately trying to harm their health with bad advice. If we stopped sending our anorexic girls to the doctor, we'd be able to stop sending them to the psychiatrist too.",
            "title_similarity": "0.7890543",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8btw61",
            "score": 0,
            "text": "Y’all are really obsessed with fat people, huh?",
            "title_similarity": "0.60568845",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h8c60bd",
            "score": 0,
            "text": "I came in late to the conversation and I see OP has actually made some considerable progress in the way he thinks about the issue. It’s my opinion that OP has suffered some abuse in his life that is still creating what are called “stuck points”. Stuck points are thinking errors that allow us to assume the worst is true regarding people and their intentions. Social issues like fat shaming and how to handle it are varied and complex and cannot be solved in absolutes. Each individual must find their own way to their best version of themselves. It doesn’t really matter what trauma you’ve been through, or what your obstacles are, there are rarely any “universal solutions”. \n\nIf you are someone trying to overcome addiction, abuse, or intrusive thoughts, take a moment to reach out to someone for help. Therapy and a good doctor can greatly improve your quality of life if you are willing to do the work. Good luck out there!",
            "title_similarity": "0.7868159",
            "sentiment_compound": 0.5564
        },
        {
            "id": "h8c7fm5",
            "score": 0,
            "text": "I’m fat and I agree, I know I’m fat and it’s unhealthy I need to change not be ok with my weight, it’s like being ok with a heart condition and not taking the proper steps to help my heart.",
            "title_similarity": "0.71987414",
            "sentiment_compound": 0.9187
        },
        {
            "id": "h8c8yvn",
            "score": 0,
            "text": "So many people who are considered obese CAN NOT do ANYTHING about their weight. The cause could be a life-saving medication, or a genetic disorder.\nBy accepting them you are essentially saying \"hey its okay, I'm not sure what is causing you to gain weight, but I will help if you need anything.\"\nWhile enabling an addict is encouraging the use of substances that can and will cause harm to their bodies, and may kill them. Enabling an addict is saying \"I don't care about your heath and wellbeing enough to have a conversation about your addiction and offer my help to get you to a point where you are  functioning in a way that does not harm yourself.\" Saying the two are similar is an unfair comparison, ignoring the many factors that go into the two things. While some obesity does come from things like over eating, its not all. 'Fat acceptance' is telling people they should not feel negative about their bodies, especially if they can in no way help the way it looks.",
            "title_similarity": "0.8246014",
            "sentiment_compound": -0.818
        },
        {
            "id": "h8cdxr3",
            "score": 0,
            "text": "It is weird that people have a lot more compassion for someone with a food addiction than someone with a substance abuse issue. To me they are the same. My brother is broke because he and his wife eat so much, like $20-30 in take out alone per day. Everyone wants to help him no one wanted to help me when I struggled with alcohol. It’s a double standard. \n\nIn fact I think they should be subject to the same scrutiny. I can’t get a transplant because of my past choices, they also should be ineligible for all transplants. They shouldn’t receive disability - I don’t get disability because of my alcoholism I just would get fired... They shouldn’t be on Medicare because it’s their fault their health is terrible. I knew a guy who had over $1000 in medication a month just because he was super obese. Why am I paying for it when he caused it? \n\nI don’t think people realize just how much obesity costs us each year! There are more people in the US with a bachelors degree than with a health BMI. Yes there are more people with degrees than a BMI under 25. It’s a health crisis and we can’t say it out loud because “it’s anti fat bias” I don’t care what anyone looks like - I just don’t want them to die or be a drain on our already flawed system.",
            "title_similarity": "0.80906427",
            "sentiment_compound": -0.9235
        },
        {
            "id": "h8cex2g",
            "score": 0,
            "text": "As someone who is obese, this is my take on fat acceptance. We as a society allow the accessibility to quick unhealthy foods on most street corners, grocery stores and a lack of mental health services for people to address the underlying reasoning with the way they eat. \n\nImagine yourself addicted to cocaine and it’s a required substance just like food. You are really trying to limit cocaine except the fact you drive down the road and there is a shop with really cheap cocaine everywhere. You go to office and there is a vending machine with small amounts of cocaine. There are establishments where groups of people get together and all do cocaine together. While this is not an excuse our society does not make it easy for people to really address their addiction problem.\n\nBecause “WE” as a society allow for this availability we are accepting the consequences of that, which in my opinion is a better representation of fat acceptance. \n\nYou want people to be less fat quit making unhealthy foods so available and cheap and make healthy ones more available and cheaper because eating healthy when it comes to convenience is way more expensive. This is the only way to address it on a large scale.",
            "title_similarity": "0.7801285",
            "sentiment_compound": 0.7948
        },
        {
            "id": "h8cfksm",
            "score": 0,
            "text": "So wouldn’t gay acceptance be the same yet we have to eat that shit up every where.",
            "title_similarity": "0.61914384",
            "sentiment_compound": -0.0865
        },
        {
            "id": "h8dffmw",
            "score": 0,
            "text": "I mean maybe? But there’s many ways to be fat and not all are controllable. It also gets difficult when the addiction is something you can’t just quit. Our bodies make chemicals that make us hungry and tell us how much and what to eat.  \nHormones and genealogy play a big role, so it’d be very hard to make the argument that all fat people are addicts.  \nFurthermore, you shouldn’t shame addicted either. It’s not enablement to not shame someone and lack of acceptance is often what leads to addiction anyway(as you may know!)  \nTo sum it up, there’s always gonna be fat people, just like there will always be addicts! Make friends and influence them, but let them be them and make do with that.",
            "title_similarity": "0.8356753",
            "sentiment_compound": 0.5825
        },
        {
            "id": "h8dg2kr",
            "score": 0,
            "text": "I Read the original post and the edits, and I still will say fat acceptance is a fringe and almost bad idea.  I’m Also a previous alcoholic, and can contest I would get death glares for buying a bottle too many, but the fat lady behind me that can’t even walk around the grocery store and has to use a scooter, gets over looked with her full cart of junk food? Yes it’s total enabling in this world. Yes, we can ACCEPT people’s obesity. But my problem is with the glorifying of being “plus size” that has come about in recent years. We shouldn’t be glorifying plus size models in billboards and letting them pose for high fashion brands that only cater a small fraction of their fashion to the plus size group. I’m sorry, but I don’t want to see a fat person on any billboard/advertisement. It’s gross to look at, it promotes unhealthy lifestyles, and unhealthy images for kids to look up to. Fat acceptance gives kids a reason to say “what the heck, it’s acceptable!” Thus leading to the worst era of childhood obesity known To mankind. And most of these fat kids, are children of fat people. I’m not saying size 0 models are a realistic body goal either, not promoting the fashion model industry at all. But where does this end? I know shaming is the wrong approach, but putting obesity on a pedestal and glorifying it isn’t the right approach. People get paid just for being fat now. It’s disgusting. I’m obviously on one of my many alternate Reddit accounts, so I don’t care what happens to this comment. Downvote away. It’ll just show me I’m right. How unhealthy everyone is about obesity and enabling it.",
            "title_similarity": "0.8281201",
            "sentiment_compound": -0.6027
        },
        {
            "id": "h8dj368",
            "score": 0,
            "text": "I think it’s so funny all these people saying “you need food to live” yea no fucking shit! But how much?? If you read one of my other comments on this post. History shows that humans didn’t start eating three meals a day until the late 18th century, which only the rich did to show they were rich. The first people of earth would eat in seasons, going up to two months without food and be JUST FINE. Thanks to recent research, it is shown that we can live on 6-9 cups of water a day, for many months, and obese people (because they have more fat reserves) can go nearly a year without food with the body eating its own weight. It’s called water fasting, which cultures have done for centuries for spiritual and personal reasons. I frequently participate in 7 day water fasts, and the rest of the time I’m intermittent fasting, only eating 6 hours out of the day all in the same time block. Mor than half of my family is fat. I’m not, even though I technically have the “genetics” that magically make people fat, and I have thyroid issues. But I’m not fat. even though I have all the reason to claim medical obesity and say fuck it it’s too much hard work, I defy what other people are too lazy to. You don’t need to be eating all day everyday. It is scientifically proven. Yes, you need food to live. But not constantly.",
            "title_similarity": "0.6922339",
            "sentiment_compound": 0.9115
        },
        {
            "id": "h8ai542",
            "score": 60,
            "text": "Fat acceptance doesn't mean accepting an unhealthy diet and lifestyle. Obesity is the symptom, not the cause.",
            "title_similarity": "0.6068924",
            "sentiment_compound": -0.3786
        },
        {
            "id": "h8alji2",
            "score": 55,
            "text": "[deleted]",
            "title_similarity": "0.13213183"
        },
        {
            "id": "h8amwbb",
            "score": 13,
            "text": "Body Positivity =\\= \"enabling an addict\"\n\nSome people act as if they want to \"help someone with their problem\" by being a total dick to them and shaming someone for drinking, smoking, being overweight. \n\nHow about we not comment on someone's lifestyle unless we are close enough to the person to also give a crap about their feelings, or if it's your job. (Aka my doctor)",
            "title_similarity": "0.825927",
            "sentiment_compound": -0.624
        },
        {
            "id": "h8aon6e",
            "score": 13,
            "text": "If you look at this CMV you can see how Fat acceptance is needed and not the same as an alcoholic acceptance. fanboy_killer said the fat acceptance movement went too far because there were a few overweight woman in a magazine. This is hilarious because there are still magazines, commercials, and movies that show drinking as a fun harmless pass time. Let’s not forget that “traditional” models are unrealistically skinny and have caused many girls to have eating disorders to live up to that false image. But, there is not a CMV every week about how unhealthy it is to be an underweight or a model, even tho being underweight is more deadly than being overweight.",
            "title_similarity": "0.83142126",
            "sentiment_compound": -0.1943
        },
        {
            "id": "h8an1jd",
            "score": 161,
            "text": "As someone who definitely needs to lose a few pounds, you know what strategy is the LEAST effective in motivating me to lose weight?  People making fun of me for my weight.  People telling me that I need to lose weight, when it's none of their goddamn business. People mocking me at the gym for actually trying to lose weight.  There have been [actual studies](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6565398/) showing that fat shaming only makes people \"sicker and heavier.\"\n\nIf fat people don't try to lose weight, we're called out for being unhealthy, gross addicts.  If we do try to lose weight, we're ostracized from those spaces because people don't want to look at our gross bodies.\n\n\"Shaming people\" because of their weight has only ever caused harm.  Not only in discouraging fat people from getting the help they need, but also in [causing eating disorders](https://news.llu.edu/health-wellness/how-weight-shaming-can-lead-serious-eating-disorders) \\- particularly in young girls - who are so terrified of becoming fat that they harm themselves into becoming skinny and malnourished.\n\nEDIT: Holy crap, y'all are toxic as hell. Love how absolutely *nobody* in the comments is acknowledging either the study I linked showing that fat shaming literally just makes obesity worse, or that fat shaming has contributed to eating disorders. Thought this was supposed to be a fact-based subreddit.",
            "title_similarity": "0.7775241",
            "sentiment_compound": -0.9827
        },
        {
            "id": "h8an706",
            "score": 36,
            "text": "> I see NO difference between this and demanding that, because I'm genetically an alcoholic, I should be furnished with booze\n\nWhy is this the analogy you use for the fat acceptance movement? Has anyone ever claimed that fat people should be furnished with free food? Fat acceptance simply means that we shouldn't bully people for their weight. I never understand why this is so controversial.",
            "title_similarity": "0.8596244",
            "sentiment_compound": 0.726
        },
        {
            "id": "h8algfp",
            "score": 1,
            "text": "Fat acceptance does not mean people are blind to the fact that being obese is a major health concern. We could as a society decide to go back to only shaming people, but that clearly does not work (accepting you are an alcoholic and yet are still a worthy person makes it easier to quit drinking than shaming you for drinking, which would likely make you drink more to cope) accepting yourself and loving yourself makes it a whole lot easier to make healthy changes than shaming, and it is easier to find acceptance in yourself when you are not constantly hearing how bad you are",
            "title_similarity": "0.82329345",
            "sentiment_compound": 0.9831
        },
        {
            "id": "h8an3sc",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8anond",
            "score": 1,
            "text": "I'm not going to try to change your mind that this is enabling behavior, but rather that enabling other people's destructive behavior is preferred to yucking their yum. I have no problems with alcoholics or drug addicts so long as their lifestyle doesn't affect me. You can get off by rubbing your own fecal matter all over yourself, but as long as you shower before you leave the house, it doesn't affect me. Similarly if you want to eat whatever you want, when you want, that doesn't effect me at all and if it makes you happy I encourage it. Who am I to tell others how to live their lives. The sight of someone different from me doesn't offend me. So rather than seeing fat people and thinking \"I have to use self control not to drink, they should also use self control because it offends me that they aren't treated as poorly as I was when other people were telling me to stop drinking.\" Maybe give them a break and let them live their lives. I assume someone you love told you to slow down on the drinking and you took this to heart. It's also fine to tell someone you love that you worry about their eating because you are concerned for their well being. It's another thing entirely judging strangers for lacking self control or being offended by their presence because you judge them to be flawed when you don't even know them.",
            "title_similarity": "0.7384649",
            "sentiment_compound": 0.9543
        },
        {
            "id": "h8aoim9",
            "score": 1,
            "text": "Yes but should people shame you for being an alcoholic? I think not, everyone struggles. This is what “weight acceptance” is about. \n\nSimilar to with alcoholics many treat it like it’s an easy fix without serious mental and physical reasons that someone can’t just stop being overweight. \n\nThe whole point of weight acceptance is for people to be more compassionate. Really you should t be shaming anyone for anything. None of us are worthy of throwing the first stone at anyone. This is what “obesity acceptance” is about. If someone is an asshole and their lack of self awareness affects you, it’s not because they are fat. It might be a contributing factor, but I guarantee you shaming them over their weight is not going to make things better for them, or for anyone.",
            "title_similarity": "0.87986267",
            "sentiment_compound": 0.9694
        },
        {
            "id": "h8aosdp",
            "score": 1,
            "text": "There are many different reasons that people can be overweight, and not all of them are easy to fix (a personal choice such as a poor diet).  Mental issues, hormone imbalance, other physical issues that cause weight retention or gain, depression, eating disorders, etc.\n\nAs a recovering alcoholic, I am sure that you can appreciate the struggle to end an addiction.  Now imagine doing that while having to have 3-5 drinks (meals and snacks) a day.\n\nUnfortunately, a lot of issues go un-diagnosed and even with insurance, coverage can be sporadic at best, when it comes to treating problems that lead to obesity.",
            "title_similarity": "0.7988389",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8apzt6",
            "score": 1,
            "text": "Being fat and overweight is a disease, it fucking sucks being fat, the cheapest foods out there are extremely addicting, and so I believe it's very important to Not Fat Shame, but we shouldn't make it the new norm, which is what's happening in a lot of places. Fat people are sick. They shouldn't be made feel bad about being fat, and this is coming from a former fat kid who used to get bullied - BUT, we gotta find a way for fat people to stop being sick, ie, fat. And shame does sometimes work.",
            "title_similarity": "0.8520918",
            "sentiment_compound": -0.9827
        },
        {
            "id": "h8b2rh3",
            "score": 1,
            "text": "OP pussed out.",
            "title_similarity": "0.20285003",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8b9xwe",
            "score": 1,
            "text": "Let them die of coronary atery disease at 30. Less fatties, less problems.",
            "title_similarity": "0.53670424",
            "sentiment_compound": -0.7222
        },
        {
            "id": "h8bbafu",
            "score": 1,
            "text": "One big difference between struggling with food addiction versus alcohol/cigarettes etc. is that you don't need either of those to live. You can, theoretically (however challenging it may be), live a life without needing to consumer alcohol or drugs. But you have to eat. Imagine being told that instead of quitting drinking alcohol cold turkey, even though it was destroying your life, you still had to consume a quantity of it a day. How much harder would that make it not to relapse into full alcoholism? I'm not saying food addiction is harder, just different, and thus shouldn't be treated like other addictions. Also, like is being said, acceptance is not about enabling behaviours rather not subjecting people to cruelty and ostracization because they are struggling with their weight.",
            "title_similarity": "0.7802253",
            "sentiment_compound": -0.8993
        },
        {
            "id": "h8bbqpa",
            "score": 1,
            "text": "There are a lot of morbidly obese/obese people who are falling victim to the Body Positivity movement. I think maybe this is where we can critique the \"health it every size movement\". I agree that Fat Acceptance can be nice for mental health, but not very nice for physical health.",
            "title_similarity": "0.7985265",
            "sentiment_compound": 0.1598
        },
        {
            "id": "h8bdort",
            "score": 1,
            "text": "Really dislike fat people. When I see them it ruins my day",
            "title_similarity": "0.63921165",
            "sentiment_compound": -0.6997
        },
        {
            "id": "h8bee5f",
            "score": -1,
            "text": "Can't go a day without a Fatpeoplehate post disguised as \"we care about your health\".",
            "title_similarity": "0.6109224",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8bezu4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8cfatl",
            "score": 1,
            "text": "First things first: Everyone needs food to live. You don't need opioids or alcohol to live.\n\nSo right there it's a false comparison and analogy right out of the gate, it exists in bad faith so therefore impossible to take seriously.\n\nSecond: There are so many complex reasons that people become obese. We don't really even understand fully the interaction of human nutrition, biome, the environment and genes. These sciences are in their infancy and we get new insights every year that complicate our ideas of human metabolism. It is far more complex than calories in and calories out. Because before about 1940-1960 (not including the depression years) Americans ate WAAAAY more calories than we do and they didn't actually burn that much more even though they were less sedentary. Labor and physical activity doesn't actually burn all that much and humans have been pretty ingenious and figuring out ways to conserve calories.\n\nBut suffice to say that when over the course of the last thirty years 30-55% of the population becomes overweight to obese — it os no longer an individual issue or moral failure. It is something systemic. Because that is what has happened.\n\nAnd it is happening almost everywhere. It's even happening to our animals! Not just pets. But animals that live around human crops. Wild animals adjacent to human habitation are getting fatty liver disease autoimmune, hormonal and metabolism diseases associated with obesity.\n\nSo to stigmatize individuals is about as helpful as stigmatizing people for getting cancer.\n\nThird: After people become obese almost all weight loss effort fail. Research suggests that roughly 80%of people who shed a significant portion of their body fat will not maintain that degree of weight loss for over 12 months.\n\nNow you can go and believe that 80% of humanity are just weak willed lazy fatties if you want, but that not only subjectively cruel but literally impossible. Once again corporations that make our food and pollute our environment have off-shored their responsibilities on to indivulas like they always do by making this propaganda that it can't be them - it must be YOU.\n\n&#x200B;\n\nRather I would spend less time worrying about fatties and more time trying to figure out what is going on with the environment and our food systems and try to fix it.",
            "title_similarity": "0.7065053",
            "sentiment_compound": -0.9816
        },
        {
            "id": "h8cicys",
            "score": 1,
            "text": "Reading a lot of these comments, people don’t understand how hard it is for overweight people to lose weight and keep it off. And I keep seeing the word obese a lot, as if there isn’t loads of people who are merely overweight to fat, before they even reach obsess. Fat people who are plus sized but not obese get discriminated against just as much as truly large people, though the fatter you are the more hate and disdain you seem to generate.\nI’ve been overweight all my life. Maybe my metabolism got messed up from the fad and starvation diets I did when I was a teenager, but I’ve never been able to be what I regard as thin, no matter what I tried.  I even gave myself a heart murmur trying to get to a normal weight (remember when fen phen was a thing?)\nThere are many studies on how your metabolism adapts to a lower calorie intake when you go on a diet, to try and hold on to the weight. Your body works against you, literally, which is one reason why so few people manage to lose weight and keep it off.\nNow, I have hypothyroid and am peri menopause, so I’ve give up ever being a “normal” weight; I’d be happy to lose 15 pounds and be merely chubby. I work out usually about an hour 6 days a week on average, and while my diet isn’t as strict as it should be maybe, I certainly don’t go to town eating whatever I want.\nPeople who haven’t had weight issues don’t understand how much people who have have struggled with their weight all their lives. Often, hearing “lose weight” from your doctor feels very defeating, as if that idea isn’t something you think about almost constantly already.\nI got told by my doctor to try to work out more (not for weight purposes, for cholesterol and menopause symptoms)- doc, I already workout 40-50 minutes almost every day, how much more do I need to up that? Who realistically is going to work out 2 hours a day?",
            "title_similarity": "0.78359437",
            "sentiment_compound": -0.9537
        },
        {
            "id": "h8cssfj",
            "score": 1,
            "text": "I can see where your thought process started but as the edits have said I’m sure you have a different view now. I just kind of laughed because I could see it being a problem being to large to use the toilets and getting larger toilets would be the accommodation I just wanted to know what you thought a hotel would do to accommodate the alcoholics? Bigger mini bars and foam furniture in case they fall over?",
            "title_similarity": "0.7672769",
            "sentiment_compound": 0.514
        },
        {
            "id": "h8amj8q",
            "score": 16,
            "text": "Alcoholics (or addicts in general) *should* get help and *should* be accepted as people, just like fat people. Fat people deserve the same things that anyone else does, so if you need to change things to make it more accessible for them, that’s your moral obligation",
            "title_similarity": "0.76116735",
            "sentiment_compound": 0.743
        },
        {
            "id": "h8aia6s",
            "score": 152,
            "text": ">I am an alcoholic in recovery (almost 6 years sober) and one thing that really sets me off is seeing articles and posts about how overweight people need to be better accommodated/catered to. \n\nWhile I can go google a few articles on the subject, wouldn't it help everyone if you linked these specific articles?  Additionally, can you quote some of the suggestions you find issue with?\n\nI ask because it's near impossible to have a conversation like this when we're all playing with a different set of cards.\n\nLast, can you provide whatever definition of Body Positivity (as you coined \"*fat acceptance*\") you're using; along with providing the source of said definition?",
            "title_similarity": "0.8980607",
            "sentiment_compound": 0.8512
        },
        {
            "id": "h8aomni",
            "score": 2,
            "text": "> I see NO difference between this and demanding that, because I'm genetically an alcoholic, I should be furnished with booze and allowed to be a drunken mess.\n\nSo, if you're predisposed to alcoholism, then enabling that alcoholism would make it more difficult for you to function. You wouldn't be able to work, pay your bills, take care of the people in your life, maintain healthy relationships, etc. And, of course, it would eventually kill you.\n\nIf you're genetically predisposed to being fat, then not having the normal accommodations that most people have--being able to fit in smaller seats, being able to find clothing that fits you, being made fun of by people for no good reason--all that makes it more difficult for you to function. On top of that, being fat (not necessarily morbidly obese, just fat) isn't necessarily going to kill you. An unhealthy lifestyle might, but some people get exercise, eat healthy, spend lots of time outdoors, and while that has some relationship with their size, they may never be thin, just because they're genetically predisposed to being kinda big.\n\nObesity also has a statistical relationship with poverty, which probably contributes to the way we look at it. But if we decide that \"fat acceptance\" is harmful, it lets us pin the blame for the failures of our economic system on the victims of that very same system. Not everyone has access to healthy food options or the education to even choose them if they could, and I think the solution to that is more equitable access to both goods and education, not punishing people for being fat.",
            "title_similarity": "0.9066783",
            "sentiment_compound": -0.622
        },
        {
            "id": "h8alq77",
            "score": 86,
            "text": "> I see NO difference between this and demanding that, because I'm genetically an alcoholic, I should be furnished with booze and allowed to be a drunken mess.\n\nThe fat acceptance movement isn't demanding fat people be showered in donuts and pizza. We live in a strange society. On the one hand, the portions of our food are massive, cheap, easily available, and addictive. The advertising for it is everywhere, fast food is everywhere.\n\nThen on the other end we have our nations beauty standards. Skinny is beautiful. Actors in movies and t.v will be incredibly in shape. The roles of fat people are extremely limited (when was the last time you saw a fat leading actor or love interest). In magazines and on Instagram Photoshop is rampant, making already hard beauty standards almost impossible to live up to.\n\nSo with one hand our society forces food into our face, and with the other it slaps us and says \"you're so ugly we can't even show you in our media\"\n\nI used to be fat. I hated my body the entire time. It made me depressed, it affected me socially and academically. I was never under the illusion it was healthy to be fat, very few people are. And even after losing the weight I still have issues with how I perceive and judge my own body. \nFat acceptance isn't saying being fat is healthy, but it is saying you shouldn't hate yourself just because your fat.",
            "title_similarity": "0.82777333",
            "sentiment_compound": 0.9017
        },
        {
            "id": "h8air8b",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.13213183"
        },
        {
            "id": "h8alqiu",
            "score": 5,
            "text": "A lot of people ignore/won't accept that emotional eating can be binging behavior and that many obese individuals have an eating disorder. The issue with HAES and fat acceptance is that these individuals' coping/psychological issues will not be addressed, as limiting food intake in any form is \"bad\"",
            "title_similarity": "0.752947",
            "sentiment_compound": -0.703
        },
        {
            "id": "h8b7b36",
            "score": 4,
            "text": "I don't get why people who claim to hate fat people want them to get healthier? This is hate, not mild annoyance. I hate fat people so I hope they stay fat so that they don't live past 40. What is this poser shit?",
            "title_similarity": "0.7929501",
            "sentiment_compound": -0.8915
        },
        {
            "id": "h8aklzm",
            "score": 32,
            "text": "How we address obesity as public health problem and how we treat individual obese people are two different issues. We can try to fix society-wide problems that lead to rising rates of obesity without blaming or needlessly punishing individual people. A cursory search for \"how to approach an addict\" yields a lot of results like [this](https://www.healthline.com/health/addiction/helping-an-addict#talk-to-them), that say you shouldn't use blaming language or get angry when you try to broach the topic with people. I think the same is true for obesity -- there's nothing to be gained from being mean or blame-y (indeed, people such as [Roxane Gay](https://www.theguardian.com/world/2014/aug/02/roxane-gay-bad-feminist-sisterhood-fake-orgasm) have published extensively about how shame is a big factor that contributes to obesity). Fat acceptance isn't about accepting obesity as a society, it's about not judging individual people and making life even harder on them than it already is.",
            "title_similarity": "0.73120576",
            "sentiment_compound": -0.5442
        },
        {
            "id": "h8aujx9",
            "score": 318,
            "text": "So for me, what changed my mind was clarifying two things:\n\n1. How prevalent anti-fat bias is in medicine and popular culture, and\n2. How things like fat acceptance and Health At Every Size (HAES) have a meaning beyond the fringe internet stuff\n\nTo the first point, like all social movements, fat acceptance and the body positivity movement arose in response to external pressures - namely, that fat people are generally treated worse by the medical establishment ([1](https://pubmed.ncbi.nlm.nih.gov/25432989/), [2](https://onlinelibrary.wiley.com/doi/full/10.1038/oby.2008.636))  and are portrayed very poorly in media ([1](https://www.nytimes.com/2010/03/16/health/16essa.html), [2](https://www.nature.com/articles/ijo200822)), for no other reason than their weight. There is a strong perception that obesity is primarily a result of personal choices or lifestyle ([1](https://journals.humankinetics.com/view/journals/ssj/25/1/article-p7.xml), [2](https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1600-0838.2004.00399.x-i1)) when that is not really supported by medical evidence ([1](https://link.springer.com/article/10.1186/1741-7015-11-41), [2](https://link.springer.com/chapter/10.1057/9780230304239_2)). As a result, there is a lot of implicit and explicit bias, in medical professionals and otherwise, that fat people have to contend with ([1](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3930920/#R16), [2](https://www.nature.com/articles/0801745), [3](https://www.proquest.com/openview/dda6afbde4ebf3f31bc116d8ce8c6f07/1?pq-origsite=gscholar&cbl=35035), [4](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0048448), [5](https://onlinelibrary.wiley.com/doi/full/10.1038/oby.2003.142)).\n\nTo the second point, while you typically see Health At Every Size  portrayed in a very fringe way on sites like Reddit, it does have a professional meaning. [This article](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1681635/) does a pretty good job of explaining the movement from a medical standpoint, but essentially it's a movement among professionals to promote a more nuanced and patient-centric approach to weight management and physical intake. There are a growing number of studies that suggest that this approach is more effective in reducing physiological measures like blood pressure/lipid levels long term, improving psychological health outcomes, and, somewhat ironically, in sustained weight loss ([1](https://www.sciencedirect.com/science/article/abs/pii/S0002822309014357), [2](https://www.sciencedirect.com/science/article/abs/pii/S0002822305003226), [3](https://www.sciencedirect.com/science/article/abs/pii/S0002822309014357), [4](https://www.nature.com/articles/08020124), [5](https://onlinelibrary.wiley.com/doi/full/10.1038/oby.2007.638)), when compared with traditional dieting and behavioral strategies. It's already become standard for dealing with disordered eating: as of 2009, The Academy for Eating Disorders, Binge Eating Disorder Association, Eating Disorder Coalition, International Association for Eating Disorder Professionals, and National Eating Disorder Association all explicitly support an approach that focuses on health measures rather than weight ([Source](https://higherlogicdownload.s3.amazonaws.com/AEDWEB/b9c7a708-8c22-4dd4-bf39-bd59fca8ab6d/UploadedImages/Press_Releases/ED_Orgs_Join_Forces.pdf)). It's a pretty new approach, and there is definitely more research that needs to be done before it becomes mainstream, but even if the HAES movement isn't perfect, it's clear that our current conversation about weight in relation to health is too narrow. To put it in context, imagine if, in treating alcoholism, the only number your doctors cared about was your BAC - if you're legal to drive at your checkup, congrats, you're healthy! I'm sure you know that alcoholism is much more complicated than that, and while yes, if your BAC is high all the time it's probably bad, focusing on just that number does a disservice to a lot of patients. The same could be said for our focus on weight.\n\nHonestly, I get it, there's some really extreme stuff that gets posted on the internet, and it can be frustrating as someone who's seen the harm that grossly disordered eating can do to patients. But what all these doctors in the studies above and the fringe Twitter people have in common is they're both trying to address a problem in the way we discuss, diagnose, and treat weight-related issues in this country. While I would never try to convince you that everyone on the internet who advocates for body positivity is 100% right, I hope you can agree that there is a problem with how things are currently done.\n\nEDIT: Fixed one of my links",
            "title_similarity": "0.7653632",
            "sentiment_compound": 0.9849
        },
        {
            "id": "h8annfn",
            "score": 6,
            "text": "Acceptance does not equal enabling.\n\nI can accept your addictions without enabling them. So they are not the same thing",
            "title_similarity": "0.62707895",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8axb16",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.13213183"
        },
        {
            "id": "h8am9y0",
            "score": 2436,
            "text": "Addiction is a response to untreated mental illness, with a genetic component thrown in, which is why it’s so much more prevalent in populations that lack access to mental healthcare. It’s self-medication gone awry.\n\nSo, shaming addicts, or ostracizing them for their addiction gives them yet another painful thing to self-medicate about. \n\nAcceptance isn’t the same as enabling them- but treating them as “less than” just makes the problems worse, and recovery harder. \n\nYou could say the same with obesity. It’s well established that people eat as a stress response- and what’s more stressful than being shamed for your body? It becomes a vicious cycle. \n\nSo, not “accepting” fat people makes their problems worse, and makes it harder for them to overcome them. \n\nIt’s not about saying obesity is physically healthy- it’s about recognizing two very basic, simple truths:\n\n1: People can’t be shamed into psychological health\n\n2: People with diseases like addiction or obesity are still People, and deserve to be treated with dignity and respect, because that’s what people deserve. \n\nThere’s a third one in there:\n\n3. It’s not your job to ‘help’ anyone get healthy, so commenting on their weight, unless you’re their doctor or personal trainer, is not appropriate, and what you should do is mind your own business and not give advice, as you would with any other physical ailment, because you don’t know the whole story. \n\nSo, “fat acceptance” isn’t about enabling bad behavior, it’s about not being an asshole to people who are already struggling.\n\nEDIT: \n\nFor the people who are posting things along the lines of \"but I shame people because shame WORKS!\" I'd refer you to this peer-reviewed medical study saying that it doesn't with obesity, and in fact makes the problem worse. This isn't the only one- a cursory google search will confirm this. So, now you have actual data that refutes your firmly held belief, and like a rational human being, you should change your view and behavior, right? \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6565398/",
            "title_similarity": "0.8065219",
            "sentiment_compound": -0.9909
        },
        {
            "id": "h8b9zpx",
            "score": 47,
            "text": "Wow, those edits show incredible self-awareness and a commitment to personal growth.\n\n\nYour strength, determination, and self-reflection are nothing short of inspirational.\n\n\nCongrats on breaking the habit and wishing you the best for the rest of your life.",
            "title_similarity": "0.471507",
            "sentiment_compound": 0.967
        },
        {
            "id": "h8avnxm",
            "score": 9,
            "text": "Fat acceptance falls in line with an ideal we were all (hopefully) taught as kids. Outward appearance does not equal worth. That’s all it boils down to. \n\nI also urge you to look at it from the opposite lens. Many many young girls are obsessed with the idea of *not* being fat, and are then shown “fat” women by media, so they starve themselves to not be that way. But if we take away fat as a derogatory term, that breaks the chain.",
            "title_similarity": "0.74337685",
            "sentiment_compound": 0.3133
        },
        {
            "id": "h8aqyah",
            "score": 23,
            "text": "I think it's best to see this tendency as perhaps an overcorrection of the constant and universal shaming of obese people in every area of life. I myself am obese (working on it) and many people I know are as well, and I don't know of anyone that demands unfair accommodations, etc. we usually just don't want people to be rude. \n\nAnd I saw a few comments about how obese people will often criticize a doctor as being fat phobic. And maybe sometimes that's a bit of a defense mechanism, but it's also against the tendency of doctors/people to dismiss the concerns of fat people. Like saying \"oh you're just fat, lose weight and you'll be fine\" and maybe not trying necessary tests or also thinking of other possible causes for an issue. Maybe you disagree with how common it is, but I think it's pretty obvious on it's face that fat people are often dismissed as being \"just fat.\" so it would make sense to me that it can happen.\n\nAnd your furnished with booze argument, what does this even mean? Are fat people showered with pizza out of nowhere? Or demand free food? No they just want to do what they want and exist. \n\nAnd I'm friends with some alcoholics (congrats on the 6 years sober by the way!), and I don't treat them negatively or tell them what they shouldn't or should do unless they asked me to look out for them. That happens with my obese friends too. We're all struggling, we all do things that are harmful to us at points, and we're all hoping to improve and dealing with that journey.\n\nAnd do fat people demand to be the equivalent of a drunken mess? People don't want to be around drunk people because of how people act when they're drunk. If I eat an entire pizza, I just get tired, I'm not belligerent or rude or loud, etc. \n\nSo the acceptance thing is just recognizing that life is hard and people want to feel valued, loved, attractive, etc. as much as we can. Obese people usually KNOW that there's an issue or potential issue, even if they're pushing fat acceptance stuff. So when we don't want people to bash us over the head with why that's wrong, it's because we already have our own issues around the subject and don't need you, a stranger, to put your input in.\n\nLast thing, I think the food being different than drinking thing is because food is a necessary aspect of life, which is why our entire society, for the most part struggles with it. I have binge eating disorder and have been addicted to food my whole life (it can be really upsetting and dark), and the fact that it's always there and necessary makes it feel like I'm always dancing with the devil, so to speak. So even the accommodation thing, we have accommodated overweight people because our entire country (America) has generally skewed that way, so that even people now that are considered thin would have often been considered a bit heavy 80 years ago, right?",
            "title_similarity": "0.85330725",
            "sentiment_compound": -0.7297
        },
        {
            "id": "h8alwey",
            "score": 3,
            "text": ">I see NO difference between this and demanding that, because I'm genetically an alcoholic, I should be furnished with booze and allowed to be a drunken mess.\n\nIs someone providing these obese people with food and taking away their responsibilities to  work and buy their own food?\n\nSociety in general doesn't have a problem with alcoholics who don't drive drunk,show up to work able to perform their duties, don't spend their paycheck at the bar,  and have healthy relationships with the friends and family members in their life. But be honest, if you were in addiction recovery you almost certainly didn't fit that bill.",
            "title_similarity": "0.85709023",
            "sentiment_compound": 0.7354
        },
        {
            "id": "h8amo6f",
            "score": 3,
            "text": " Fat acceptance started as just accepting that fat people exist and this does not make them imoral or bad people. Now \"fat acceptance\" has morphed into fat pride, disguised as fat acceptance. \n\nActual fat acceptance is not the same as enabling addiction as it is not to do with the food addiction but the person. But fat pride does encourage people to not change and thus, not recover from their addiction and so is enabling it.",
            "title_similarity": "0.7506113",
            "sentiment_compound": 0.9224
        },
        {
            "id": "h8aquno",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8ar17a",
            "score": 2,
            "text": "A lot of body positivity isn’t because they think being fat is healthy or okay, it’s because due to whatever cards in life they were delt they gained weight. Most people just want to be accepted and have cool clothes and most of us are trying to work on it but that is far easier said than done.\n\nI grew up in a family that already had eating disorders, my parents overate and they still do and they would give me far too much food. Well I also have ADHD, and because of that my impulse control when it comes to food is non existent. So when I get to buy my own food I can buy better snacks for impulse eating like low sodium sunflower seeds or veggies, but my parents do not support me no matter how many times I tell them to stop buying me these big ass meals from places they insist on eating out instead of cooking and a lot of places they eat dont have healthy options. So bad impulses from my mental disorder and no support from the people who feed me.\n\nI could go on and on about my struggles with weight loss, but my fingers are getting tired cause Im typing this up on mobile so hopefully this gives you a better undrstanding. Most of the people who glorify being fat are a minority and should be ignored because most people realize its not heathly and they are trying, they just want to be treated fairly and have support cause that does help along the way.\n\nBut yeah I promise it isnt body positivity enabling my addiction or most other peoples and it never has. I am sure there are people out there that make excuses for themselves but a large majority do not and so you shouldn’t treat all fat people like they are part of that minority just cause you or someone else met 1 person or maybe even a few like that online.",
            "title_similarity": "0.79036695",
            "sentiment_compound": 0.9535
        },
        {
            "id": "h8ar9ia",
            "score": 3,
            "text": "In order to be able to put the effort in to lose weight, you must value yourself first. That is what fat acceptance does. You can be healthier and better looking but you must be able to like who you are right now to have a chance at permanently making the changes necessary to improve.",
            "title_similarity": "0.6556263",
            "sentiment_compound": 0.886
        },
        {
            "id": "h8ars64",
            "score": 2,
            "text": "Fat acceptance is the same as not discriminating drug abusers. The right thing to do is point them towards treatment, as with fat people. It's completely unnecessary to discriminate both a fat person and a drug abuser.",
            "title_similarity": "0.71069205",
            "sentiment_compound": 0.3235
        },
        {
            "id": "h8aseuv",
            "score": 2,
            "text": ">Second, your comments have made me realize that I have carried a big chip on my shoulder in regards to my own lack of support - perhaps, seeing 'acceptance', whether it's for addiction, being overweight, etc., touches a nerve because it was so absent in my earlier life.\n\nJust to follow up on this, the idea that \"alcoholism is a disease\" and not purely or primarily or a moral failing was intended for purposes of de-stigmatization and acceptance. Clearly not everyone believes that and lots of people see alcoholism as a personal failure of the alcoholic, but the intent is largely the same. \n\nI'll also just add that comparing the two seems rather unhelpful. Alcoholism has a huge effect on the people around the alcoholic, from family, to coworkers, to people who share the road, etc. There's a reason that making amends is a step in AA. There may be effects on others as a result of obesity, but they're comparatively quite minor, which to me makes obesity largely a personal issue in a way that drug/alcohol addiction often is not.",
            "title_similarity": "0.8592938",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h8asezx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09973792"
        },
        {
            "id": "h8ataax",
            "score": 3,
            "text": "> The specific article in question that made me write this was all about how a hotel did a poor job of catering to 'plus-size' people due to the fact that towels and toilets were \"too small.\" I am not advocating for cruelty or 'shaming,' but rather, this notion that the world should change instead of oneself.\n\nThe issue here is that these accomodations are not going to make it harder for fat people to lose weight, it's going to cause other issues, from mild stress due to too-small toilets and towels, to musculoskeletal issues caused by poor posture and accomodations. \n\nI'm quite tall, and I have problems with my rib cage simply because I have had poor back support from almost every chair I've ever sat in since middle school. The same applies to people who are overweight. Tacking these issues onto someone who is already overweight is only going to make it harder for them to lose weight, especially if they are stress eaters or have other problems.",
            "title_similarity": "0.7983203",
            "sentiment_compound": -0.987
        },
        {
            "id": "h8avo6o",
            "score": 1,
            "text": "As an addict in recovery, you have every right to demand non-alcoholic options of food and drink. Why wouldn’t an obese person be allowed to ask for accommodations for their issue? How do know that they aren’t “recovering” or dieting? People’s issues are different, so sometimes are the needs.\n\nEdit: a word",
            "title_similarity": "0.8071195",
            "sentiment_compound": -0.2168
        },
        {
            "id": "h8avszj",
            "score": 1,
            "text": "As someone who has struggled with obesity my entire life, I think it's extremely dangerous to tell people, especially young people, that being overweight or obese is okay.\n\nThe writing is on the wall, really. If you are overweight, your chance of dying early or being prone to health challenges is higher. I hate it when I hear big people say \"you can be *healthy* fat\" because the fact remains that you're heavy than you need to be and that puts stress on your body and (though many overweight people I've met deny this) your mind.\n\nI think that what many large people want is to be treated with respect, and that is true for all people. Whether someone is fat, stupid, or different than you- all people deserve basic respect.",
            "title_similarity": "0.7882377",
            "sentiment_compound": -0.8553
        },
        {
            "id": "h8aw0ft",
            "score": 1,
            "text": "IMO, I think 'fat acceptance' is just the push for acceptance of body types that are a little bigger than the slim, wide-hipped paradigm that is established within western beauty standards. People, particularly women, are shunned for having larger bodies; if it isn't to a significant  or noticeable detriment to their health, I see no issue in the 'acceptance' of these individuals. This incessant, oftentimes alienating, encouragement to 'get slim' is generally frowned upon, I presume, because it is just unneeded. \n\nDisclaimer: I might be just as flawed in my opinion; someone inform me of any possible misreading on my part :)",
            "title_similarity": "0.78450274",
            "sentiment_compound": 0.9137
        },
        {
            "id": "h8az1dc",
            "score": 1,
            "text": "Reminds me of what Bill Maher said about fat acceptance.",
            "title_similarity": "0.51988876",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8azeq6",
            "score": 1,
            "text": "The way I see it, everyone takes responsibility for their own body. If you’re fat and you want to be fat, I have no problem with that. That’s fat acceptance in my book. If you’re fat and want to be leaner, well, I hope you accomplish your personal goals of change. That’s not me saying skinnier is universally better, that’s just me supporting what they want to be. Again, that’s fat acceptance.",
            "title_similarity": "0.7100163",
            "sentiment_compound": 0.9672
        },
        {
            "id": "h8azueh",
            "score": 1,
            "text": "I'm not obese, just a little chubby... \nI have to take corticosteroids a lot. They always make me gain weight. By the time I get that weight off, it's time for another round of steroids. \n\nThat being said, weight is just not as simple as food+ exercise. There's genetics, medications, metabolism. \n\nThe food industry also doesn't do anyone favors hiding sugar in everything.",
            "title_similarity": "0.7805975",
            "sentiment_compound": 0.1179
        },
        {
            "id": "h8b08gf",
            "score": 1,
            "text": "> Second, your comments have made me realize that I have carried a big chip on my shoulder in regards to my own lack of support - perhaps, seeing 'acceptance', whether it's for addiction, being overweight, etc., touches a nerve because it was so absent in my earlier life.\n\nin case you don't know, many ideas perpetrated by certain recovery groups are both false and dangerous. chief amongst them are notions of \"enabling\" and the opposite of hitting rock bottom. while it may seem superficially intuitive, evidence shows completely the opposite--people do not get better when denied support and allowed to totally fuck up their lives. people get better when they have support and access to help\n\nthe best way to help obese people who want to lose weight is for them to have a stable, safe environment and access to doctors, dieticians, and physical trainers. it's not to neglect them and give them even more triggers",
            "title_similarity": "0.77844834",
            "sentiment_compound": 0.9166
        },
        {
            "id": "h8b0r3j",
            "score": 1,
            "text": "the biggest factor that makes people fat is ….. genetics! Look at all the people you know and their different metabolisms and learn to focus on yourself",
            "title_similarity": "0.53733516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8b1jgj",
            "score": 1,
            "text": "Being a bit or a lot fatter than other people does not inherently mean being unhealthy or at risk. Any sort of drug addiction, big or small, poses a danger to your health and is actively unhealthy. It's not the same at all.",
            "title_similarity": "0.70760053",
            "sentiment_compound": -0.875
        },
        {
            "id": "h8b1kjy",
            "score": 1,
            "text": "Fat acceptance is admitting you have a health problem, but that doesn’t make you any less human then being a drug addict. Being addicted to food or heroine just means you need help, and ridicule from all your peers makes recovery more difficult.",
            "title_similarity": "0.84765357",
            "sentiment_compound": 0.2641
        },
        {
            "id": "h8b2qxj",
            "score": 3,
            "text": "From what I’ve read in the comments, the only thing that does bug me is that the media coverage of potentially some crazy ladies “being fat-shamed” because the hotel didn’t had big enough toilets is ridiculous and possibly enabling in the way you describe.\n\nWithout the article I can’t know if the receptionist was rude, or how fat was the lady, but they can’t call it discrimination if the toilets are regular size just as you can’t call discrimination if their bathroom is not safe enough for you if you pass out drunk inside during an episode… \n\nIt’s just an hotel buying the best toilet they can according to their metrics of average customers.. \nIf you want people to accommodate a very specific need you have, there are other options. Otherwise it’s up to the hotel to determine if it’s profitable enough to have huge toilets (which, btw, could be horrible for me.. i already kinda fall in on some of the “regular” ones unless i sit in a wide stance)",
            "title_similarity": "0.83164895",
            "sentiment_compound": -0.0923
        },
        {
            "id": "h8b3e0c",
            "score": 1,
            "text": "While I by no means think we should encourage people to be fat, that's not what people typically mean by fat acceptance. I can want people to be healthy while not being a dick to people that aren't. Yelling at someone addicted to heroin that heroin isn't healthy isn't going to accomplish anything and neither is yelling at an obese person.",
            "title_similarity": "0.73731464",
            "sentiment_compound": -0.0485
        },
        {
            "id": "h8b3qie",
            "score": 1,
            "text": "I assume AA had a lot to do with your sobriety? Stop by an OA meeting sometime. The format will feel familiar. The difference being that you took your addiction and put it in a shelf. Compulsive overeaters in recovery have to take theirs down off the shelf 3 times a day and look it in the eye.  \nIf only for the sake of your own sobriety, I hope you can find some empathy.",
            "title_similarity": "0.75408983",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8b5pp2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8b6mlh",
            "score": 1,
            "text": "The point of fat acceptance isn't to normalize or encourage obesity, the point is we shouldn't treat people worse just because they are overweight. You shouldn't base someone's value on their weight when in a context where weight is irrelevant.",
            "title_similarity": "0.67148334",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h8b7lwe",
            "score": 1,
            "text": "HAES is bullshit.",
            "title_similarity": "0.24921378",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8b8gzd",
            "score": 1,
            "text": "I'm overweight, I've always been a little bit overweight, my family members are also overweight, there is a genetic component to my weight which makes it harder to lose it. I also have mental health issues, also genetic, and if I want to not be suicidal I have to take a cocktail of medications, some of which *cause me to gain weight*. I am not \"healthy\" as in \"skinny\" but I am healthy as in I don't actively want to kill myself, and I have to prioritize that. I don't want acceptance, I want people to leave the issue alone because it is extremely personal and none of their business. I shouldn't have to justify my body to anyone.",
            "title_similarity": "0.8239392",
            "sentiment_compound": -0.9277
        },
        {
            "id": "h8b90rg",
            "score": 2,
            "text": "Fat acceptance != \"fat is healthy\"\n\nBeing overweight is a health risk, a quality of life reduction, and generally shortens your lifespan. That said, so do half the things humans do. Fat people are less healthy, but they do not have less worth as a person, and that's what fat acceptance is (or should be) about.\n\nMuch like with other addictions, there are also levels of severity. If someone is morbidly obese and struggles with mobility, someone reaching out and offering support is probably a good thing. If someone is in more or less good condition and is just on the fatter side because they like food, they probably don't need a full-blown intervention.\n\nCould I be much healthier than I am? Sure! I could spend much more of my free time working out and diet aggressively. Or... I could enjoy food and be comfortable that I'm only ever gonna be \"kinda fit\" and not an Adonis, and know that having fat stores on my body makes me a heavier person but not a worse one.",
            "title_similarity": "0.76289344",
            "sentiment_compound": 0.9921
        },
        {
            "id": "h8ba65r",
            "score": 1,
            "text": "If you gave an obese person the option to click their fingers and become a healthy, attractive weight they would all take it",
            "title_similarity": "0.5980141",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8bcp4d",
            "score": 1,
            "text": "Fat acceptance to me is more about not hating yourself, or in this case someone else, based on body size. It's about not discriminating against or disparaging someone because of their size and just treating them like every other person. It's also about not basing your value as a person on your size, no matter what size you are. I don't think it's necessarily to say we shouldn't look after our health, but whether a person does or doesn't look after their own health isn't anyone else's business.",
            "title_similarity": "0.7279968",
            "sentiment_compound": 0.2681
        },
        {
            "id": "h8beipr",
            "score": 1,
            "text": "Another thing that is unhealthy for you is *not getting enough sleep.*\n\nHowever, it turns out that *shaming people for not getting enough sleep* does not help most people get more sleep. In fact, it does just the opposite — it cultivates anxiety about sleep, which makes it *harder* to sleep!\n\nSame with *intolerance* for lack of sleep. If everyone who ever dozed off at school or work were expelled or fired and not allowed to get an education or job until they had fixed their sleep problem, the expected result would not be a population getting better sleep due to having strong social incentives ... but rather *more ignorance, more poverty, more homelessness, more suicide.*\n\nSo that's something to check whenever someone proposes shame or intolerance as a way of getting people to change unhealthy habits. *In some cases, shame and intolerance make people less able to change their habits, or ruin their lives in ways that invalidate the attempt.*",
            "title_similarity": "0.7431234",
            "sentiment_compound": -0.9919
        },
        {
            "id": "h8bfhlp",
            "score": 1,
            "text": "The answer you are looking for is on the top two paragraphs of page 62.",
            "title_similarity": "0.23882301",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h8bflim",
            "score": 1,
            "text": "I think telling people they are beautiful at any size is the wrong way to go about it.\n\nIt encourages fat people to call others fatphobic because they were complaining about an issue they've been having that could very well be attributed by their weight.\n\n1. You call them out on their obesity.\n\n2. Don't say nothing and suggest mcdonalds",
            "title_similarity": "0.7618569",
            "sentiment_compound": 0.6478
        },
        {
            "id": "h8bg1hc",
            "score": 1,
            "text": "So you took one random article hardly anyone is ever going to read and turned that into a widely held belief among society that you feel the need to rant about. People need to stop doing this circular bullshit.",
            "title_similarity": "0.63753724",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h8bghvx",
            "score": 1,
            "text": "You can't blame individuals for systemic problems. \n\nThe North American food supply changed in the 90s and it's been having subtle long term effects on us for decades. It's so subtle that it's taken this long to notice. \n\nOur food is less nutritious now than it used to be, so we need more calories for the same nutrients. \n\nGo to Europe, order dinner. It'll be half what you expect in American and you'll be more than full. \n\nNorth American agriculture is a mess and large scale but biome destruction is happening too.",
            "title_similarity": "0.66968477",
            "sentiment_compound": -0.7982
        },
        {
            "id": "h8bgm3h",
            "score": 1,
            "text": "Being morbidly obese, I can tell you it's an addiction I struggle with everyday.",
            "title_similarity": "0.6441221",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8bh4ak",
            "score": 1,
            "text": "It is an addiction - mostly an addiction to sugar. A side effect of sugar addiction is excessive huger, aka overeating, because a lot of food has tons of added sugar. Why? Because the makers know people are addicted to it.  \n\n\nUSA (and Mexico) have a major sugar crisis.",
            "title_similarity": "0.72413075",
            "sentiment_compound": -0.6573
        },
        {
            "id": "h8bhi5n",
            "score": 1,
            "text": "Fat acceptance isn’t addition acceptance.\n\nIf you want to compare drug addiction to fat acceptance, it would be “Fat acceptance is like saying addicts shouldn’t be mocked”\n\nIs that bad? Hmmm",
            "title_similarity": "0.76324886",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h8bhlqh",
            "score": 2,
            "text": "Have you ever lived with or lived or even *known* an addict? Because it’s a constant, self destructive cycle. My sibling is an alcoholic. Before they were sober, they would drink every night to sleep, drink in the morning to psych themselves up for life and work, and drink during the day to maintain some sense of emotional stability. \n\nCould totally accepting “fatness” lead to some unhealthy behavior? Sure. But if someone eats healthily enough, or even if they don’t and they’re fat for genetic or medical reasons, does it really matter? Not eating low fat options or always getting a salad is not at all comparable to someone drinking to get through the day ir taking cocaine to feel normal. \n\nSure, addiction and being overweight are both unhealthy. But your logical is incredible infantile if you think they’re the same. One is a state of being that can be caused by many things, and can remain even if you work out and eat healthy. The other is a medical condition, that is not a state of being but a constant need that has to be controlled. They’re not even remotely the same thing and only someone with no knowledge of addiction, fatness and a child’s sense logic would ever think accepting someone for being overweight and not shaming them is similar to giving an alcoholic a bottle of booze. \n\nThis is a subject that is deeply personal to me because of my sibling. I’m glad you’re reevaluating your opinions and view points based on your edits. Thank you for being open to growth, it’s not a fun process, but it makes me hopeful.",
            "title_similarity": "0.85749644",
            "sentiment_compound": 0.9509
        },
        {
            "id": "h8bhs95",
            "score": 1,
            "text": "Obesity could be related to chemicals that mess with our internal sense of how much to eat. Lithium etc. [https://osf.io/x4fk3/](https://osf.io/x4fk3/)  \n\n\nIt might be more about other things than addiction",
            "title_similarity": "0.6520739",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h8bhvcu",
            "score": 1,
            "text": "Just imagine the reduced strain on America's healthcare system if the number of obese people was reduced by 50 percent.\n\nI don't look down on people because they're overweight. But, I also don't feel sorry for people who end up with chronic ailments due to a lifetime of obesity. Hopefully that's not too harsh.",
            "title_similarity": "0.7297574",
            "sentiment_compound": 0.7424
        },
        {
            "id": "h8bi450",
            "score": 1,
            "text": "as an alcoholic you'll understand this: \n\nyou must have 3 drinks per day. but try not to fall of the wagon.",
            "title_similarity": "0.64039147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8biid3",
            "score": 1,
            "text": "I was 150 in high school, when I got out I was living with a larger family and did a lot of drinking/smoking/eating. Gained almost 100 pounds in a few months and got sick of myself, moved out and continue to do things to keep my weight down like parking far away at stores. \n\nIn construction, they call a big stomach a Dickey Doo, because it's sticks out more than your Dickey do.",
            "title_similarity": "0.64193976",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h8bj3x5",
            "score": 1,
            "text": "No. We should accept all fat people. Not all fat people are fat because of food. And not all fat people are unhealthy because they are fat.",
            "title_similarity": "0.7041281",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h8bj4up",
            "score": 1,
            "text": ">Edit 2: It has become clearer that I had not properly understood the actual meaning of 'fat acceptance' and had jumped to conclusions based on social media and buzzfeed articles. (not smart) Thank you again to all the helpful comments.\n\nFirst off congrats on the sobriety, 5 years myself- it’s hard as shit sometimes dawg\n\nSecond thing, you rock for being able to re-evaluate like that, esp the closing sentiments. \n\nFinally, there’s a podcast about (mainly fad diets) that has a really great episode on “fat acceptance”. One of the hosts is Aubrey Gordon (aka “your fat friend”) and a point that stuck with me in a big way was when she talked about coming out from HS assemblies with bruises because of the way theater seats are built. She’s an expert on fad diets (and why they don’t work) because she’s been struggling with her weight for a long ass time; and hearing her talk about day to day issues she’s got to deal with was really eye opening for me. \n\nBoth hosts are awesome and I can’t recommend it enough, all well researched and hilarious.",
            "title_similarity": "0.7818374",
            "sentiment_compound": 0.9277
        },
        {
            "id": "h8bk91p",
            "score": 1,
            "text": "I think it's like how were supposed to accept people who have mental illness, for who they are and not their ailments. I think you just totally missed the point or are a young kid.",
            "title_similarity": "0.6523856",
            "sentiment_compound": -0.024
        },
        {
            "id": "h8bkaxr",
            "score": 1,
            "text": "It's the same as *accepting* that someone is an addict. You're not enabling them, but as you know, one can only change their behavior when they take ownership. If you were to bring over unhealthy food for them, that would be enabling... Just like if you brought drugs to an addict. Saying you accept them for who they are, like you might to your spouse if they are working on alcoholism, is a form of support.",
            "title_similarity": "0.8013437",
            "sentiment_compound": 0.8641
        },
        {
            "id": "h8bkmk1",
            "score": 1,
            "text": "This is absolutely correct.",
            "title_similarity": "0.01987111",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bkx34",
            "score": 1,
            "text": "Okay so big nuance here. Some peoples bodies make it much, much harder than yours to hold or lose weight. The idea is to not fucking destroy people with unlucky genetics. As well as people who are gluttonous. Theres no point.",
            "title_similarity": "0.7058837",
            "sentiment_compound": 0.2885
        },
        {
            "id": "h8bljm4",
            "score": 1,
            "text": "Not every fat person is addicted to food",
            "title_similarity": "0.56967294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8blmga",
            "score": 1,
            "text": "It should be less about acceptance and more about encouragement. You don't help an addict by arguing about whether they are an addict. You just encourage them to get help. It's actually quite important that they accept they are unhealthy, but there can be tact and respect involved.",
            "title_similarity": "0.7173643",
            "sentiment_compound": 0.8209
        },
        {
            "id": "h8bls20",
            "score": 1,
            "text": "Focus on yourself. You're no better than anyone else. Stop judging others.",
            "title_similarity": "0.49094003",
            "sentiment_compound": -0.5583
        },
        {
            "id": "h8bltld",
            "score": 1,
            "text": "Every addict is able to improve their situation with the right programs and help. \n\nNot every fat person can do that. Not every fat person is fat because they have a bad diet and don't exercis. Fat shaming and fat informing can be really hurtful to someone who has no avenue for recovery. It's like telling a cancer patient the health risks of continuing to have cancer...",
            "title_similarity": "0.81395197",
            "sentiment_compound": -0.9216
        },
        {
            "id": "h8bluzp",
            "score": 1,
            "text": "Fat acceptance is the same as accepting  addiction as a disorder that needs to be treated.\nOn the the other hand, fat shaming is the same as stigmatizing addicts.",
            "title_similarity": "0.7562816",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8blvs2",
            "score": 1,
            "text": "This take is on this sub, and /r/unpopularopinion, at least once a week",
            "title_similarity": "0.30644572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bmbel",
            "score": 1,
            "text": "Their should be a distinction between fat acceptance and fat prejudice. I don’t think for a second if someone is against accepting “fat’ness” as a normal and acceptable part of the culture we live in, that’s fine. You could be against accepting it for your kids, you could be against it for general health, you could be against it because of the look, you could be against it because you don’t want yourself or loved ones to think that’s a healthy or acceptable lifestyle. However, I seen a point made in here that really makes a lot of sense. We shouldn’t accept people sending hatred towards people who are overweight though. For one reason or another, somtimes your weight is beyond what your mentally or physically capable or controlling or dealing with. Medical reasons and addictions are both super hard to deal with. However, the people suffering from food addictions or people dealing with medical fatness are also not trying to get people to think they are there beautiful or the “norm” they know and are aware of the issue. I think the issue lies, (in my view where I think the OP is coming from) is when people like Lizzo (an over used target, I know) come on stage and say they are beautiful the way they are, which is generally over weight and likely not the healthiest. Beauty is subjective and many people find their beauty in another person and it’s not a flat line across the board. However the problem myself and OP see is when it’s becoming a “normalized” trend, we shouldn’t normalize or push people to get fat, or be happy with it, it’s not healthy. This doesn’t mean that we should shake the people who are especially if they are not asking for help or trying to get your input. Their a a very fine silver lining, that can easily be followed by doing your best to mind your own fucking business and not be a dick. Basically just have mannors.",
            "title_similarity": "0.7447059",
            "sentiment_compound": 0.9842
        },
        {
            "id": "h8bn6oh",
            "score": 1,
            "text": "Every other addiction you can handle easier for ex. You just cut out alko and thats it you are sobber. Heroin same, weed same etc. (You go though recovery faze and you are done)\nBut with food you just can not simple stop eating you must eat! \nSo begining of recovery is so much more difficult.",
            "title_similarity": "0.76237917",
            "sentiment_compound": -0.5852
        },
        {
            "id": "h8bo3o4",
            "score": 1,
            "text": "Not everyone is fat cause they’re addicted to food. It’s that simple.",
            "title_similarity": "0.7008443",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8boge6",
            "score": 1,
            "text": "I think there's a tipping point where it shouldn't be acceptable.\nLarger people are fine, but when it gets to the point where everything they do needs to be catered to, then I see a problem.\nIf they're not able to go to xyz store, or need special accommodations because they're too big.. the responsibility of organizing it shouldn't fall on the establishment or others.\n\nI recently had a plane ride next to a very large person. They were literally halfway onto my seat, armrest up because they couldn't fit in one. It made the entire trip uncomfortable. Just buy two seats if this is a problem instead of having the rest of us cater to your lifestyle.\n\nI agree that fat shaming is wrong, being large is whatever, I don't tell people how to live... but don't be a burden on society or complain that an establishment isn't able to accommodate you.",
            "title_similarity": "0.6830975",
            "sentiment_compound": -0.8942
        },
        {
            "id": "h8boq1d",
            "score": 1,
            "text": "Now say the same thing but with Transgenderism being a mental illness.",
            "title_similarity": "0.47616178",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h8bp6fn",
            "score": 1,
            "text": "Fat acceptance is certifiably insane.",
            "title_similarity": "0.4811117",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8bp6te",
            "score": 1,
            "text": "I think it's pretty obvious the solution is just to not single anyone out.  If you are going to ridicule people's appearance, you have to ridicule everyone, and not just fat people.  We all have flaws you can latch onto to make yourself feel better, *you fucking asshole*.",
            "title_similarity": "0.7073214",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8bpmdi",
            "score": 1,
            "text": "Lol. get off of social media and you would not give two shits about something like this. Plus people were getting fatter and fatter well before weridos on twitter decided being fat is cool and totally \"healthy\".",
            "title_similarity": "0.71397436",
            "sentiment_compound": 0.9224
        },
        {
            "id": "h8bpr69",
            "score": 1,
            "text": "Ehhh it's much more of enabling an unhealthy life style than it is an addiction",
            "title_similarity": "0.61185926",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h8bpujc",
            "score": 1,
            "text": "There are COUNTLESS articles/posts about there being “no ideal weight”, “doctors are fat phobic” etc it’s absolutely insane. OP couldn’t be more on point.",
            "title_similarity": "0.68691623",
            "sentiment_compound": 0.1045
        },
        {
            "id": "h8bqmkp",
            "score": 1,
            "text": "There are commonly mental issues involved, which is why I never comment on anybody’s body. If that means I “accept” their bodies, so be it. I see a lot of people on reddit post pictures/videos of random obese people with the caption “this is not okay” or “this shouldn’t be normalized,” and the comments are brutal. An obese person could see those captions and comments, and binge eat because the comments made them feel worse about themselves than they already do. Most obese people don’t choose to be obese.",
            "title_similarity": "0.8103335",
            "sentiment_compound": -0.802
        },
        {
            "id": "h8br7k4",
            "score": 1,
            "text": "I agree with the sentiment of it all.   I do not condone shaming anyone with addiction (food, drugs, alcohol etc).   However I too see the pendulum swinging where they are promoting people to be PROUD of their weight and accept that there “is nothing wrong with my weight”.   We simply would not advocate for drinkers and drug users to be PROUD of their use and advocate there “is nothing wrong with using”.  There is something wrong,  you don’t deserve shame,  you deserve empathy.  Being empathetic to the point of convincing the afflicted everything is “fine” is a disservice to those with the disease.",
            "title_similarity": "0.74674356",
            "sentiment_compound": 0.9439
        },
        {
            "id": "h8br9dc",
            "score": 1,
            "text": "Oh lord have mercy 🙄. Stop worrying about my weight. I'm good with who I am. You should be as well. When you get to be 40 or so, you stop giving a flying fuck what other people think of you.",
            "title_similarity": "0.66471976",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8brf0u",
            "score": 1,
            "text": "There is a difference between acceptance and enablement. \n\nThat’s all. You either get it now or you never will.",
            "title_similarity": "0.33982366",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8bt37e",
            "score": 2,
            "text": "I don't know you so I can't *truly* know what's in your mind when you say this, but I *do* knew a few people who have said essentially the same thing, (that fat acceptance is encouraging people to be unhealthy and it needs to stop), and the problem is that it's dishonest.\n\nJust something for you to think about but the people I know who say this, it doesn't come from a place of empathy and sincere desire to see overweight people better themselves. It comes from a place of judgement and personal disgust of \"having to look at fat people\". I know this is true because I know these people and never once have they expressed real understanding or empathy. They simply wish there were more hot chicks to look at. Women that say this just want to feel superior. At the end of the day, it's really nothing more than criticism disguised as concern. \"It's unhealthy\" is a valid argument but it's simply not what they really care about.\n\nAll I'm saying is, I hear this a lot, and I've never once heard anyone say it from a good place.",
            "title_similarity": "0.7860965",
            "sentiment_compound": 0.8261
        },
        {
            "id": "h8bt62z",
            "score": 2,
            "text": "I'm not sure if I can add a lot of content that hasn't already been covered. But I'll try from the perspective of a fat person. \n\n\nFirst, I don't have the option of quitting food. I've quit soda because I don't have the capacity to moderate my intake, and if I don't drink it regularly, it tastes nasty.  \n\n\nSecond, moderation and healthy habits are hard. I've been working with a nutritionist. I'm adding fruit and vegetables to snacks and meals. I am trying to add activity to my day to day life that I can keep up indefinitely. \n\n\nThird, nature and nurture. I've never been skinny. I was 170lbs in middle school despite shotput and martial arts. My grandparents made sure I had healthy food,  but they were of the age of depression. It was normal that I was forced to finish my food or called upon to finish someone else's. I worked my ass off and joined the military. The only times my weight was halfway decent was when I was working 12 hrs shifts and was too busy to eat regularly,  or when I worked out twice a day (45 minutes of cardio, plus 15-30 minutes of other exercises) 5+ days a week. I don't have the mentality and drive to do that. \n\n\nFour, diversity. I have a cousin that looks like she could be broken in half like a twig. That's healthy for her. She eats when and what she wants to eat.  Humans are not all built the same. I only wish it were so easy for me. \n\n\nFive, social/ society. I'm required to have a job as well as my husband. That doesn't leave a lot of time or energy for meal prep. Grabbing food fast equals high taste reward, low health reward. Furthermore, healthy food tends to be much more expensive (unless you have and take the time to prepare it) and has a lower shelf life. Lastly, getting food that my husband, my child, and I like is... problematic. He could live on fast food. Bitter tastes and odd textures turn him off to most of the weirder, but healthier, foods I like. \n\n\nSix, impossible body types. Healthy doesn't necessarily mean skinny (though, obviously obesity isn't healthy). Try to find a picture of a natural woman that is depicted a desirable beauty. It doesn't exist. Men are heavily pressured as well, but at least dad bods are becoming accepted.\n\n\nSo, here I am, a fat sack of shit. I'm trying to get through the day to day. Any little dose of serotonin that helps make it more palatable helps... and food will always be easily available. The other side of it is I know I need to be healthier. I know I have to work harder to be healthier. \n\nBut, people treat you like you have no worth if you're fat, like fat is the worst thing you can be. Like there aren't innumerable toxic traits that skinny people have that are over looked because you can't tell at first glance. \n\n\nI realize alcoholism isn't a disease, any more than obesity. That some people are more inclined to it. That it is destructive to your health, and only that person can decide to become better. \n\n\nBut the fact is, that fat people exist. Their habits really don't put other people in danger (unless you count teaching the behavior, which In desperately trying not to). They are customers, and they are asking for accommodations within reason. Which companies likely don't want to do because it will increase their costs. \n\n\nAnd frankly, I'm tired of being conditioned to feel like being fat is the worst. If there is anything wrong with me, it's because I'm fat. I am ugly, undesirable, and worthless as a human being because I am fat. I can't be pretty, bright, a delight, or anything positive unless it's despite being fat. \n\n\nI guess it was easy a just giving up something. Whether it was chocolate, coffee, etc. But nutrition isn't that easy. I know giving up an addiction isn't easy (there are plenty of people that smoke or vape. It seems so easy to quit to me, but I've never smoked, so I realize that I just don't know how hard it is.) I can only speak from my perspective.\n\nTo answer your question, I can support the addict without enabling the addiction. \n\nCorporations ARE already enabling obesity (low quality, high calorie foods and beverages are everywhere and cheap). Hotels needing accommodations are a false equivalent.",
            "title_similarity": "0.7328562",
            "sentiment_compound": 0.9815
        },
        {
            "id": "h8bt800",
            "score": 1,
            "text": "It’s hilarious that you think alcoholism is genetic. AA really have you eating  out of their asses.",
            "title_similarity": "0.7321309",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8btja1",
            "score": 1,
            "text": "There is a mile of diferencies between being an alcoholic and being a fat person for the people around you. \n\nAcceptance is just the collective tolerance for whatever you are doing. If my obese cousin asks me what should they eat for dinner, my suggestion would probably not be something worth 3000 kcalories. But I wouldn’t actively nag and ridicule them for not listening to me. Its their body, their life.\n\nOn the other hand I don’t want my drunk uncle at my house pestering everyone with his dragon breath until he passes out or decides to drive home drunk.\n\nA fat person ruins their own life, and alcoholic usually drags everyone around them down with them.",
            "title_similarity": "0.8481097",
            "sentiment_compound": -0.8549
        },
        {
            "id": "h8btx1u",
            "score": 1,
            "text": "80% of covid patients in the US are obese and heart disease is the biggest killer.\n\nSo I agree, the western world has created its own pandemic",
            "title_similarity": "0.5956298",
            "sentiment_compound": 0.5688
        },
        {
            "id": "h8bugcl",
            "score": 1,
            "text": "Lmao, can you please link the article about the hotel and the obese",
            "title_similarity": "0.47603253",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h8bun9q",
            "score": 1,
            "text": "Who accepts it?",
            "title_similarity": "0.05489037",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8busf3",
            "score": 1,
            "text": "How did your Europeans easily identify all Americans visiting their country?\n\nThey look for the really fat, loud people that are dressed really badly.",
            "title_similarity": "0.6276746",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h8bv1fa",
            "score": 1,
            "text": "There’s so much more to being overweight than just eating too much.  I’ve got no proof but I think some peoples bodies handle all the garbage in our food differently.",
            "title_similarity": "0.6852764",
            "sentiment_compound": -0.3573
        },
        {
            "id": "h8bvju1",
            "score": 1,
            "text": "Basically? However being fat is a punishment of itself, I don't think that people need additional shame. To change and get healthy people need support and access to tools like to nutrition science and exercise equipment maybe i don't know what do i know i'm just an egg.",
            "title_similarity": "0.6927401",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8bvo0i",
            "score": 1,
            "text": "I would highly recommend listening to the Obesity Epidemic episode of the Your Wrong About podcast and any episode from their sibling podcast called Maintenance Phase.\n\nIt really evolved the way I thought about fatness, nutrition, etc.",
            "title_similarity": "0.65222913",
            "sentiment_compound": -0.079
        },
        {
            "id": "h8bvzfu",
            "score": 1,
            "text": "They were talking on NPR this morning about how some kids are afraid to go back to school cause they got fat over covid lockdown. Ridiculously soft, these kids and parents today. If you don’t like being made fun of for being fat, A. You’re too worried about what others think, and B. Do something about it. Some motivation never hurt anyone",
            "title_similarity": "0.7342968",
            "sentiment_compound": 0.7488
        },
        {
            "id": "h8bw1i1",
            "score": 1,
            "text": "I can't understand why being overweight Is almost normality but people underweight or Just skinny are always pointed out... \"That person looks anorexic\" \"they have a eating disorder for sure\" \"you should eat more\"... It's so Easy to say these things to someone underweight but don't you dare saying the same to overweight people.",
            "title_similarity": "0.7863033",
            "sentiment_compound": 0.2515
        },
        {
            "id": "h8bwihx",
            "score": 1,
            "text": "Christ the horrific opinions that are posted here. Accepting people =/= giving someone with a drug dependency drugs. \n\nHow is that r/changemyview worthy?!",
            "title_similarity": "0.67749524",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h8bwu0u",
            "score": 2,
            "text": ">Life isn't easy, people struggle against inherent, damaging traits, genetic or otherwise, all the time. I simply don't get why one should be 'accepted' while the other is deterred.\n\nI'm really tired of seeing this sentiment. A lot of people justify suffering by arguing that \"it's just how it's meant to be\". The whole point of humans progressing is to change the world and make it more comfortable for those who live in it. Just because some may suffer from a genetic disability doesn't mean that they don't deserve to live comfortable lives. I understand that what you're saying about having had an alcohol addiction. However, a person with an addiction would have a more comfortable life by making rehabilitation more accessible, less expensive, and less frowned upon. \n\nP.S., congrats on being 6 years sober!",
            "title_similarity": "0.7047828",
            "sentiment_compound": -0.2127
        },
        {
            "id": "h8bx4y4",
            "score": 1,
            "text": "Drinking alcohol isn't a necessity in terms of continued vital function.  Eating is.  And you might say \"well, those fat people eat too much is the same as me drinking too much\" and you are correct, I think, from a biological standpoint.  (IMO) We're still figuring out how that want/need process works and how to better control it short of \"cold turkey\".  I think it's clear that some people don't have a \"normal\" way to turn off their hunger, much like an alcoholic or drug addict can't just have one and be done.",
            "title_similarity": "0.8251371",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h8bxjny",
            "score": 1,
            "text": "I completely disagree. Sadly, being overweight is the last form of acceptable discrimination/prejudice. The bigger you are, the more invisible you become, especially socially. There are many reasons people may be overweight. It could be due to thyroid issues, trauma, emotional issues, genetics, etc. Not just a matter of \"putting down the fork\" as some people say. You never know what people have been through in their lives. Be kind always. If you can't say something nice, don't say anything at all. That saying about sticks and stones is completely untrue. Words do hurt.",
            "title_similarity": "0.7965718",
            "sentiment_compound": -0.9058
        },
        {
            "id": "h8bxwm6",
            "score": 1,
            "text": "It has different causes, it is both a medical and behavioral/lifestyle issue.",
            "title_similarity": "0.26958",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8byz2j",
            "score": 1,
            "text": "You don’t need to drink alcohol to live. While being overweight is obviously not healthy, it’s not exactly equivalent to other addictions. It’s really eating disorders untreated for years. Being overweight will make your life shorter but can’t kill you outright in 6 months like anorexia. There’s also stigma from other people (that are probably themselves overweight, as you admitted). Low hanging fruit because you can tell what their addiction is from looking at them. So nice observation skills?",
            "title_similarity": "0.8286185",
            "sentiment_compound": -0.7785
        },
        {
            "id": "h8bz37p",
            "score": 1,
            "text": "That’s actually a really good point. I am a little thicc and chunky but I am the perfect height and weight for my age. And I eat just fine. Of course there are MANY people who assume they are the same when in reality they are very unhealthy. They of course should not receive slander and pure anger about how they look but should be given kindness for the situation",
            "title_similarity": "0.72587067",
            "sentiment_compound": 0.3087
        },
        {
            "id": "h8bzmy3",
            "score": 1,
            "text": "I'd equate it more with accepting peoples lifestyle choices. Why is obesity equated with the harmful activity of drugs. But not equated with the thousands upon millions of hamful activities that not only does society accept but praises. \n\nWe glorify perhaps no one more in society than football players. Despite the FACT that being a football player has a 99% of causing brain damage and CTE. \n\nhttps://www.bu.edu/articles/2017/cte-former-nfl-players/\n\nWe put rock climbers and skydivers and jetskiers and snowboarders and skiers on the covers of magazines despite the fact that these lifestyles come with high risks. Everyone knows someone who has died or suffered severe injuries from these activities. \n\nWe glorify NASCAR and Formula 1 driving and other motor sports despite the fact that at least 1 person dies every year from motor sport racing. \n\nYet the obesity only increases your risk of negative health problems by 20%. So if your risk of a heart attack is 1 in 1000 obesity makes your risk go up to 1.2 in 1000. If your risk of diabetes is 1 in 100 obesity makes your risk go up to 1.2 in 100. \n\nIn fact the reality is that obesity alone has now been shown not to increase your risk of death AT ALL. \n\nhttps://www.sciencedaily.com/releases/2018/07/180712114440.htm\n\nThe negative health associations are more likely to be caused by the hate and shame towards obesity, not the obesity itself. People who have health problems are more likely to be sedentary and to overeat as a coping mechanism because it's one of the few things that they can do. People who become obese are hated and shamed by society further isolating them and causing them to turn to food as a coping mechanism.  So the best thing you can do to help people with obesity is to respect, love and encourage people with obesity. \n\nThe reality is that the health effects of obesity are vastly over stated and believed to be far higher than they are in reality. \n\nEven if they weren't we praise and glorify thousands upon millions of activities and lifestyles that are far riskier than obesity. \n\nWhy do you think that is?\n\nBecause obese people and obesity are socially unacceptable and fat people are hated for the sole reason of not being physcially attractive based on purely cultural standards of beauty.",
            "title_similarity": "0.7441383",
            "sentiment_compound": -0.9935
        },
        {
            "id": "h8bzqq4",
            "score": 1,
            "text": "Fat shaming has kept orders of magnitude more people fat than fat acceptance ever will. Not to mention the number of eating disorders caused or perpetuated by fat shaming. Shame is much better at perpetuating self-hatred and associated harmful behaviors than it is at enabling sustainable self-improvement. You have to believe you're both worthy and capable of change in order to do so.",
            "title_similarity": "0.7891631",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h8c0gft",
            "score": 1,
            "text": "I think the only people that accept fatness are the ones that are too polite to hurt someone's feelings and actively take part to prevent those feeling from being hurt by others. Deep down they know.",
            "title_similarity": "0.668418",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8c0kou",
            "score": 1,
            "text": "Can we just re-open r/fatpeoplehate to give you fuckers somewhere to go? It's getting really boring seeing this same rant on the front page again and again.",
            "title_similarity": "0.67420524",
            "sentiment_compound": -0.8357
        },
        {
            "id": "h8c0mcg",
            "score": 1,
            "text": "As someone who also struggles with my drinking I SHOULD be given alcohol and catered to actually.\n\nNah you make good points but if someone offered me that I would probably take it, so good thing they don't.",
            "title_similarity": "0.7631705",
            "sentiment_compound": 0.7279
        },
        {
            "id": "h8c0uxm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8c0zt6",
            "score": 1,
            "text": "I love all your edits. Some great self awareness there.",
            "title_similarity": "0.36316052",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h8c22xw",
            "score": 1,
            "text": "Wow this is judgmental as fuck. If you look at fat positive media and think to yourself “these guys just want to live unhealthy!” You’re fucking stupid",
            "title_similarity": "0.6872969",
            "sentiment_compound": 0.202
        },
        {
            "id": "h8c2lwh",
            "score": 1,
            "text": "I used to be fat in elementary school (240lbs by grade 8) but I got bullied a lot and eventually it got bad enough that I basically stopped eating till I lost ≈50 pounds. My mental health skyrocketed and I became more active, more athletic, and more popular. If you have an obese friend in your life please help them.",
            "title_similarity": "0.7234268",
            "sentiment_compound": 0.6345
        },
        {
            "id": "h8c2nef",
            "score": 1,
            "text": "Some people are fat in the same way that people are short. It's genetics, no amount of help outside of dangerous surgery will cause them to exit their \"obesity range\".\n\nThis is equivalent of saying \"You aren't helping that disabled person by getting them a wheelchair, help them walk.\"",
            "title_similarity": "0.6939703",
            "sentiment_compound": -0.1994
        },
        {
            "id": "h8c33iy",
            "score": 1,
            "text": "I love fat people I just don't like Lizzo",
            "title_similarity": "0.685859",
            "sentiment_compound": 0.4749
        },
        {
            "id": "h8c3ey4",
            "score": 1,
            "text": "You can be fat and strong, fat and run a 5k, fat and flexible, fat and fit. Having fat doesn't mean you're unfit, as being skinny doesn't mean you're fit. Accepting people's bodies as they are is the first step to becoming healthy, and healthy doesn't always look thin.",
            "title_similarity": "0.6302621",
            "sentiment_compound": 0.9116
        },
        {
            "id": "h8c3im0",
            "score": 1,
            "text": "No ones saying you have to accept being fat yourself. It’s about letting go of shit that doesn’t impact yourself.  Shaming fat people to the point of it consuming your life is as pathetic and useless as the war on drugs. It’s a good idea to have a healthy diet the same way it’s a good idea to stay away from the wet, the coke, meth, even weed. But when you act out and look like an idiot that’s not a good color on you.",
            "title_similarity": "0.83773327",
            "sentiment_compound": -0.8105
        },
        {
            "id": "h8c3oju",
            "score": 1,
            "text": "Towels and toilets too small? Bruh if they made a toilet for a 500 pound person poor 130lb me would have to Spiderman hang from the ceiling so I don't fall in. Actually after thinking about that I'm kinda on board.",
            "title_similarity": "0.68364525",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8c3p80",
            "score": 1,
            "text": "Edit: genetic alcoholic is a whole lot of bullshit",
            "title_similarity": "0.5844733",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8c3ss0",
            "score": 1,
            "text": "As an overweight person, I agree with this. There is nothing acceptable about poor impulse control, undue stress on joints and hearts, or the ridiculous amounts of extra pollution that is caused by the massive eating habits of the most egregious of our community who binge eat and snack all the time. I’m doing my best to eat less and eat healthier and excercise but I have poor impulse control. Nobody is shoving these fatty foods down my throat, it’s my fault and I have to be accountable for it. Please, *Accepting* people for who and what they are is different than *supporting and encouraging* people not to take accountability or better themselves.",
            "title_similarity": "0.81719005",
            "sentiment_compound": 0.9051
        },
        {
            "id": "h8c44cs",
            "score": 1,
            "text": "My doctor told me they aren’t allowed to tell people they’re fat anymore or even comment on their weight in general until it causes an illness.",
            "title_similarity": "0.63776326",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8c4c1j",
            "score": 2,
            "text": ">I see NO difference between this and demanding that, because I'm genetically an alcoholic, I should be furnished with booze and allowed to be a drunken mess. \n\nTo a certain degree, you should. When a severe alcoholic goes through a rehabilitation program, part of that program includes giving them either alcohol or benzodiazepines. The reason for this is that if a severe alcoholic quits drinking cold turkey, there's a very real chance they could die. There's also a very real chance they could relapse.\n\nDespite what some media displays and the views of certain fringe groups, our cultural message towards addiction is constantly shifting closer to one of acceptance. Oregon decriminalized all drugs because there's significant evidence that doing so helps citizens escape addiction. Intervention programs involve loved ones expressing concern, not disdain. Successful rehabilitation programs work from a position of positive reinforcement and necessary forgiveness. It's what's been proven to work.\n\nIf your view is that we should treat obesity as a form of addiction, perhaps you're right. If you think that we treat addiction with scorn, you're off the mark. As a culture, addiction is treated with love and acceptance, to the best of our abilities. Getting better every day.",
            "title_similarity": "0.8979235",
            "sentiment_compound": 0.9833
        },
        {
            "id": "h8c4qn3",
            "score": 1,
            "text": "Yeah I mean if you think hatred and shame is how you help addicts too, I can see what you all mean! God, can you all stop being such hateful idiots all the time ?",
            "title_similarity": "0.7684111",
            "sentiment_compound": -0.7901
        },
        {
            "id": "h8c504r",
            "score": 1,
            "text": "i'm raising fat kids, its sad.  i watched my chubby daughter come in and ask for a sprinkled krispy kreme donut before bed last night at about 8pm.  those donuts should not even be in my house. its poison.",
            "title_similarity": "0.66090715",
            "sentiment_compound": -0.765
        },
        {
            "id": "h8c55pg",
            "score": 1,
            "text": "This is something that has bothered me since I was a child. Like I somehow saw it differently than everyone else around me. A (for the most part) totally controllable choice about ones health. And we find it necessary to help ppl actively do unhealthy things or accept it. Swap the pancakes with a cigarette and watch the narrative change even tho the choice and outcomes are the same. It’s bizarre. Def something a psychologist needs to explain because on its face it’s hypocritical at best.",
            "title_similarity": "0.7826663",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8c5uul",
            "score": 1,
            "text": "There's a podcast called \"Maintenance Phase\" that I really enjoy which has helped my understanding of the science issues behind the rhetoric around the \"obesity epidemic\".\n\nSize does not equate health.",
            "title_similarity": "0.6752919",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h8c60bs",
            "score": 1,
            "text": "Saying it's okay that you're fat isn't the same as saying it's healthy. Just like saying you being an addict is okay, which you admittedly are and it is, isn't the same as saying your addiction is healthy. Being told you're not less of a human for something often makes it easier to overcome that something",
            "title_similarity": "0.76155615",
            "sentiment_compound": 0.91
        },
        {
            "id": "h8c77h4",
            "score": 3,
            "text": "As a fat person I wish there were more accommodations to help me lose weight. I do feel like an addict. Food is cheaper in bulk, there are no cheap, healthy, quick options if you need to grab a bite. Everything has loads of sugar in it.",
            "title_similarity": "0.7898778",
            "sentiment_compound": 0.2513
        },
        {
            "id": "h8c7da2",
            "score": 1,
            "text": "Fat acceptance is alright, I mean the majority of the population is obese or overweight. Remember it isn’t just caused because you eat too much and have money. A mcchicken is a $1, meanwhile a salad is $6. I’d say the problem is healthy at every size. I wouldn’t say those on the underweight or over are healthy at all. Food is an addiction, people laugh at diet soda but at least I’m not chugging hundreds of calories anymore.",
            "title_similarity": "0.7809794",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h8c7gbz",
            "score": 1,
            "text": "Nah you are right. I've being overweight since I was like 26, obese since I was 33, now at 44 finally started dieting since March 2021 (dirty keto, easy af) I'm right below overweight back to normal weight. I'm less depressed, less exhausted, better mood and even better skin, and look even younger than I looked back in 2012. Why would anyone want to normalized that.",
            "title_similarity": "0.6449375",
            "sentiment_compound": -0.2567
        },
        {
            "id": "h8c7jd6",
            "score": 1,
            "text": "I'm with you. I'll never accept the current societal notion that the world at large must weaken itself to accommodate weak people. Toughen up or accept that the world should be geared towards the people who need to accommodation as a baseline to go off of.",
            "title_similarity": "0.6062639",
            "sentiment_compound": -0.6351
        },
        {
            "id": "h8c887a",
            "score": 2,
            "text": "I know you've already sort of \"finished\" but I'll throw in my two cents. I think with body positivity and fat acceptance it is important to discuss the context. Encouraging people who are not at their ideal weight to be confident at the beach is good. Telling morbidly obese people or anorexic people that they are healthy at any weight is not good. I'm not going to make a call about how much body positivity is each of those types of things but there are definitely both types of it out there.\n\nSomeone saying \"I don't like fat acceptance\" sounds like someone saying \"I don't like feminism\". You need more context to get what they mean.\n\n*(I use feminism as an example because there were, not so much since maybe 4 years ago, a lot of radical feminists that would say \"kill all men.\" I haven't heard this in ages and understand that's not what feminism is to most people.)*",
            "title_similarity": "0.77535313",
            "sentiment_compound": 0.954
        },
        {
            "id": "h8c8hdf",
            "score": 3,
            "text": "So…. If an addict is trying to quit, is he no longer an addict at that point?\n\nIt’s not like fat people instantly aren’t fat anymore the second they try to do something about it. A lot of them fight an internal battle all the time about their diet or lifestyle. \n\nAccepting is not the same as enabling. Sometimes acceptance and love can help people overcome difficulty in their lives. \n\nIf we vilified addicts for what they were, I think a lot of addicts would have a harder time recovering. Sure, some of them may be driven to quit due to shame. But remember that there’s a downside to fat shaming too. Like all the girls (and boys) who hurt themselves due to anorexia or bulimia.",
            "title_similarity": "0.8206289",
            "sentiment_compound": -0.5354
        },
        {
            "id": "h8c98sj",
            "score": 2,
            "text": "To add on to everyone's opinions, fat acceptance is merely not ridiculing or treating someone different because of their weight. Addictions are complicated issues stemming from genetic and mental health components.\n\nI was over weight my whole life. I was pissed that my brother and I ate all the same foods growing up but I was chubby by 5 years old and my brother has and is tall and slender. I resorted to weight loss surgery in adulthood because I just yo yo dieted my whole life seemingly never making progress. \n\nLet me tell you it was SHOCKING how much better I was treated when I was skinnier. I'm not even exaggerating. I had never been treated so nice in my life by strangers. It was honestly a little destabilizing to see a whole other world you're living in that is dependent on your weight.\n\nFast forward 3 years and I've regained all my lost weight due to a binge eating disorder caused by undiagnosed bipolar disorder. (Which are my only medical issues. I'm shockingly healthy as my dr points out) I'm back living in the 'I just want to make it through the day without looks of disgust by strangers' world. I'm not asking for special accommodations, sure larger towels or larger airline seats would be nice. Lets be real, those seats are uncomfortable for most anyway. But I really just want to not be turned down from a job, or made to feel unwelcomed, or have doctors dismiss an injured elbow from a fall as if you being fat has anything to do with it.",
            "title_similarity": "0.79061174",
            "sentiment_compound": 0.4155
        },
        {
            "id": "h8ca10t",
            "score": 1,
            "text": "The difference is that alcoholics almost always cause problems in other peoples lives, be it being aggressive, needing to be taken care of, endangering others lives, having to deal with the cops, etc.\n\nAin't no fat person has ever affected me in anyway like an alcohol abuser has.",
            "title_similarity": "0.8046056",
            "sentiment_compound": -0.1651
        },
        {
            "id": "h8cak1r",
            "score": 1,
            "text": "By your logic your entire planet destroying culture/civilization is \"fat\" and enables addicts of destructive behavior whether you're \"fit\" biologically or not. Way to go, Fat Ass.",
            "title_similarity": "0.7157458",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h8calb5",
            "score": 1,
            "text": "Reading the comments oh boy do we have a long way to go.",
            "title_similarity": "0.3084758",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cax31",
            "score": 1,
            "text": "Fat Shaming saved my life\nIDGAF SOMETIMES HATE WORKS",
            "title_similarity": "0.6979914",
            "sentiment_compound": -0.3885
        },
        {
            "id": "h8cbext",
            "score": 1,
            "text": "Whoever you are, your edits give me hope in life. Great moment for self realization and taking the time to actually listen to people and learn. 10/10.",
            "title_similarity": "0.4077469",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h8cbfwl",
            "score": 1,
            "text": "Not sure if video explanations are allowed in this subreddit but I think this is a good take on the issue: https://www.youtube.com/watch?v=Ax1U04c4gaw",
            "title_similarity": "0.4624204",
            "sentiment_compound": 0.5218
        },
        {
            "id": "h8cbheh",
            "score": 1,
            "text": "Some people, no matter what they do / will ever do, will not lose weight. \n\nFat acceptance is having the grace in not judging a person, especially since you don't know their struggle.",
            "title_similarity": "0.684902",
            "sentiment_compound": 0.8379
        },
        {
            "id": "h8cbpda",
            "score": 1,
            "text": "People should be allowed to be addicts. They should be allowed to be fat. We are all individuals. Nobody wants to promote these things but the people that give in to over eating or drug use deserve to be respected just like everyone else. It's their choice and it doesn't effect you",
            "title_similarity": "0.76564467",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h8cbv1u",
            "score": 1,
            "text": "Well you normally don’t tear apart families when you get fat…so nope.",
            "title_similarity": "0.6182995",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8cc4df",
            "score": 1,
            "text": "Well since we do that all day everyday anyways, why would this thought process change anyone’s mind?",
            "title_similarity": "0.41382498",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8cc4ts",
            "score": 1,
            "text": "I have overweight parents.  I work I Healthcare.  I have certificates in nutrition and \"wellness counseling\" and I have been a taught weight loss classes (these DO work and if you're overweight, please do know that people are available to help you work through this). \n\nWith all of that said... I can't change your mind.  You bring up some good points.  I think you're right.",
            "title_similarity": "0.6813791",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8ccegy",
            "score": 1,
            "text": "Massive difference between the SWJ bullshit of \"fat acceptance\" and the other extreme of constant, brutal fat shaming.  \n\nOur society is too stupid to understand that there can actually be shades of grey here.  We shouldn't be simply accepting and overly accommodating of these grotesquely obese individuals, BUT at the same time insistently pointing out how Fatty McFat Face is fat doesn't help either.\n\nPretending that being fat is healthy (or even beautiful) isn't right, but at the same time, give someone a break and let them deal with their own demons.",
            "title_similarity": "0.8177746",
            "sentiment_compound": 0.2011
        },
        {
            "id": "h8ccopr",
            "score": 1,
            "text": "People always give easy ass deltas\n\nNo debate, no back and forth, no further inquiry, just oh wow I'm a changed person you get a delta.",
            "title_similarity": "0.5284445",
            "sentiment_compound": 0.1749
        },
        {
            "id": "h8ccq9p",
            "score": 1,
            "text": "I appreciate my coworkers when they tell me what I'm buying isn't healthy. Being fat is not okay and we shouldn't pretend that it is.\n\nDon't worry, I shit on their smoking/drinking habits in return.",
            "title_similarity": "0.8322106",
            "sentiment_compound": 0.6599
        },
        {
            "id": "h8ccw66",
            "score": 1,
            "text": "Here's where I'm at on this topic. Under no circumstances should **anyone** be body shamed, but we cannot ignore the health risks with obesity.",
            "title_similarity": "0.6725044",
            "sentiment_compound": -0.4376
        },
        {
            "id": "h8ccwfs",
            "score": 1,
            "text": "Absolutely. As someone who is a former fat person I can say that's a 100% true. When you preach fat acceptance you're justifying self harm. I used to be almost 300 pounds and I'm gonna say this now, weighing the same as 3 people isn't normal nor is it healthy",
            "title_similarity": "0.7100147",
            "sentiment_compound": 0.0108
        },
        {
            "id": "h8cd2uv",
            "score": 1,
            "text": "No need to apologize IMO. I agree with your entire sentiment.",
            "title_similarity": "0.34003553",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8cd9ah",
            "score": 1,
            "text": "A beautiful example of internalised fatphobia",
            "title_similarity": "0.5185231",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h8cdrnm",
            "score": 1,
            "text": "Upvoting because of the personal growth ^-^",
            "title_similarity": "0.33911234",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8cdtl8",
            "score": 1,
            "text": "amazing journey of self-knowledge @u/hockeyjoker",
            "title_similarity": "0.29368192",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8cdwrd",
            "score": 1,
            "text": "You know that Wall-E future is coming...",
            "title_similarity": "0.040069908",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cekmw",
            "score": 1,
            "text": "On, but off topic. Not here to rip you to shreds, pretend I know something I don’t, or give you my idiotic two cents… \n\nCongrats on nearly 6 years sober. Being over 3 years sober myself, I find it maddening that people judge the sober ones… we are the ones who stopped doing something most cannot or will not. Cheers— with a NA beverage, of course!",
            "title_similarity": "0.8512759",
            "sentiment_compound": -0.8335
        },
        {
            "id": "h8cel1t",
            "score": 1,
            "text": "You don't know people life story or situation.\n\nYes. I'm fat. I know I'm fat. I'm 300 pounds but I was nearly 500 pounds. If you come up to me with all the health benefits of losing weight, I'm gonna tell you to piss off.",
            "title_similarity": "0.6869938",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8ceuyp",
            "score": 1,
            "text": "Body positivity is a joke, go exercise.",
            "title_similarity": "0.43284667",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h8cf44k",
            "score": 1,
            "text": "Being fat is almost always a choice",
            "title_similarity": "0.4474705",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cf7zw",
            "score": 1,
            "text": ">one thing that really sets me off is seeing articles and posts about how overweight people need to be better accommodated/catered to.\n\nNobody says to give them twinkies and high-fives.\n\n>I see NO difference between this and demanding that, because I'm genetically an alcoholic, I should be furnished with booze and allowed to be a drunken mess.\n\nIs someone offering you vodka and high-fives? Otherwise I feel like you are being intentionally obtuse.\n\n>Life isn't easy, people struggle against inherent, damaging traits, genetic or otherwise, all the time. I simply don't get why one should be 'accepted' while the other is deterred.\n\nNeither is accepted. I'm not sure what bizarre worldview you've somehow invented, but nobody is saying that fat people or drunks are healthy and should continue. They are saying people shouldn't be stigmatized for looking different, even if they can help it. Do people stigmatize you based on the appearance of your liver? Or maybe it was your actual behavior?\n\n>all about how a hotel did a poor job of catering to 'plus-size' people due to the fact that towels and toilets were \"too small.\" I am not advocating for cruelty or 'shaming,' but rather, this notion that the world should change instead of oneself.\n\nThey could easily be very tall or muscular and have the same issue. Should tall people shorten themselves? Should ripped people skinny down?\n\n>It has become clearer that I had not properly understood the actual meaning of 'fat acceptance' and had jumped to conclusions based on social media and buzzfeed articles. (not smart) Thank you again to all the helpful comments.\n\nWell fuck, I'm late to the party then. Good on you for listening to reason. Exactly what I would expect from a self-described empathetic individual. Good on ya.",
            "title_similarity": "0.9195118",
            "sentiment_compound": 0.9739
        },
        {
            "id": "h8cfdrh",
            "score": 1,
            "text": "That's because you obviously don't actually know what fat acceptance is.\n\nIt's not saying being fat is healthy or denying health science, it's entirely focused on the stigma put on fat people by society. It says that fat people don't need to hate themselves or be treated like shit just for being fat. The same is true for drug addicts, actually... they don't need to hate themselves or be treated like shit for being addicts. They're still human beings, they just have problems that need sympathy and help rather than shame and cruelty.",
            "title_similarity": "0.80384",
            "sentiment_compound": 0.7422
        },
        {
            "id": "h8cfhm9",
            "score": 1,
            "text": "I would just point out there's a difference between \"acceptance\" and \"promotion.\"",
            "title_similarity": "0.36462373",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8cfnds",
            "score": 2,
            "text": "You're painting with too broad a brush.\n\nFor the sake of your argument, let's assume that fat people got that way because they have weak personalities, overindulged, and took no steps to exercise. I think that covers the anti-fat bases. \n\nSo... Now you have Chuck the fat guy. Let's assume he's really fat, not just overweight.  None of the things that made him fat make him inherently incapable of working/providing for himself. Or of being an otherwise contributing member of society. \n\nYou have two choices here- culturally make things easy for Chuck so that he can freely travel (size-friendly seatbelts), attend work (presentable clothing, coworkers who don't show utter contempt), and attend to his hygiene (grooming aids, etc) OR you can say \"fuck Chuck- he shouldn't have eaten that last ten tubs of mayonnaise\" and not give him those things.  If Chuck becomes housebound and/or can't work anymore, Chuck goes from just being fat to being more of a drain on society than his increased health insurance costs already make him. \n\nMaybe Chuck will lose weight, maybe he won't. But society being nice to him is cheaper than food stamps.",
            "title_similarity": "0.77956843",
            "sentiment_compound": 0.3918
        },
        {
            "id": "h8cgk3v",
            "score": 1,
            "text": "I mean you got people that can't help their condition. Kinda like you don't tell a diabetic to stop snacking when their levels low. Same as you dont call someone fat cus what they look like",
            "title_similarity": "0.7304082",
            "sentiment_compound": -0.2146
        },
        {
            "id": "h8cgnox",
            "score": 1,
            "text": "Upvote because of the edit.",
            "title_similarity": "0.31330758",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cgzk5",
            "score": 1,
            "text": "I just think america needs to ban the food products and additives making its population obese, no matter how many businesses it ruins.",
            "title_similarity": "0.685989",
            "sentiment_compound": -0.7632
        },
        {
            "id": "h8ch5g8",
            "score": 1,
            "text": "Kind of not even in the same ball park when you're talking about addiction though. You require food to stay alive, yes there are people who go above their means of survival but it's still not really the same. Based on your definition, it's like saying earning more money than you need to survive is the same as enabling an addict.",
            "title_similarity": "0.69555557",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h8chnby",
            "score": 1,
            "text": "Your edits show true humility and objective reflection. It's no wonder you were able to recover from alcoholism. I hope your journey helps others with their self improvement.",
            "title_similarity": "0.6014514",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h8chsjq",
            "score": 1,
            "text": "Id feel pretty confident that most fat acceptance ads are funded by fast food, soda, big tobacco, big sugar, etc",
            "title_similarity": "0.589997",
            "sentiment_compound": 0.8651
        },
        {
            "id": "h8ci198",
            "score": 1,
            "text": "Fat people should be charged more for health insurance. An alcoholic with 11 accidents doesnt pay the same car insurance as a professional driver. Why does some fatass 35 year old who CHOOSES to get diabetes and will visit a doctor once a month pay the same as someone who exercises and eats right?",
            "title_similarity": "0.73283345",
            "sentiment_compound": -0.4946
        },
        {
            "id": "h8ci4mt",
            "score": 1,
            "text": "Maybe some of those overweight people have endocrine disorders.",
            "title_similarity": "0.5582464",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h8cia8m",
            "score": 1,
            "text": "I can spend the rest of my long life never drinking alcohol. I cannot live beyond 3 weeks not eating. Food addiction is more difficult to conquer than alcohol. I wouldn't shame an alcoholic and I wouldn't shame an obese person. What you see with far shaming almost never happens to alcoholics, unless they get obnoxious. Fat people react to being picked on the same way a drinker or smoker does. They need their substance to numb the harm.",
            "title_similarity": "0.8367987",
            "sentiment_compound": -0.7639
        },
        {
            "id": "h8cijdq",
            "score": 1,
            "text": "“I am an alcoholic in recovery.”\n\nAnd you’re judgy and preachy? I’m shocked.\n\n /s",
            "title_similarity": "0.7121732",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8ciyqp",
            "score": 1,
            "text": "Being “fat” is so common, opinions like this are becoming more and more infantile. Clearly there are broader issues than “fat acceptance”. \n\nGrow up, buddy. Have some compassion",
            "title_similarity": "0.6020042",
            "sentiment_compound": 0.829
        },
        {
            "id": "h8cja5o",
            "score": 1,
            "text": "Medically everything involving people that are considered extremely obese 300 lbs or more, is more difficult, if a facility doesn't have a machine to diagnose or scan a patience of this size said Patience is often sent to another hospital that can or in some cases the zoo. Sorry not sorry, you can absolutely call me a fat shamer if you want to, I have no problem with that. Other than legitimate genetic or other conditions that cause extreme obesity. If you are over 300 lbs of your own doing, it is your fault,  people shouldn't shame you, but neither should they have to tiptoe around your size either or cater to you",
            "title_similarity": "0.7619548",
            "sentiment_compound": -0.0929
        },
        {
            "id": "h8cjdcd",
            "score": 1,
            "text": "nothing to change.   YOU WERE RIGHT ALL ALONG.",
            "title_similarity": "0.15489441",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ckkvl",
            "score": 1,
            "text": "Do fat people affect your life in any way shape or form? Why should their body types bother you?",
            "title_similarity": "0.6042527",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h8cl27i",
            "score": 3,
            "text": "Double Plus good new speak.  To understand \"fat acceptance\" we need to identify the two disconnected meanings for the word/phrase and talk about them independently.\n\nFat Acceptance \"A\" is exactly what you talk about.  It's helping the alcoholic get more booze and stay drunk.  It's building up a body of apologetics for why it's not really the drunk driver's fault they murdered a family of 4 while too drunk to stand up.  This Fat Acceptance \"A\" exists to make the land whales feel better about themselves because \"It's a thyroid problem\", not \"why in hell did you eat 16 big macs today\"\n\nFat Acceptance \"B\" is basically AA for obese people.  Shaming and abuse is probably why they are fat in the first place.  That Big Mac never judges them.  Doubling down on making them feel bad about their weight is just going to result in them doubling down on the number of Whoppers they eat.  Having that person who can't walk a mile be greeted with smiles and encouragement when they are trying to do a lap around the park will encourage the behavior of walk a lap around the park.  This \"don't shame fat people for existing in public (particularly when they are up and walking around getting exersize and just doing what they need to do so they can lose weight)\" is a truly life changing thing for people trying to improve themselves.",
            "title_similarity": "0.8646426",
            "sentiment_compound": 0.9558
        },
        {
            "id": "h8clfxi",
            "score": 1,
            "text": "horseshit.",
            "title_similarity": "0.05168526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cltvn",
            "score": 1,
            "text": "Fat people are probably working on it. We don’t wanna feel like we are hated dregs of society that are the equivalent to heroin addicts. We just wanna live our life",
            "title_similarity": "0.77828634",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h8cm3d8",
            "score": 1,
            "text": "Show me any human and I’ll eventually find their addiction. I honestly have less of a problem with addicts than I do with judgmental folks.",
            "title_similarity": "0.71919215",
            "sentiment_compound": 0.144
        },
        {
            "id": "h8cmiwz",
            "score": 1,
            "text": "It’s not genes it’s jeans and fat people have no self control as with any addict. Seek help and heal. Stop trying to make the world accept bad choices.",
            "title_similarity": "0.7471826",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8cmpt9",
            "score": 1,
            "text": "Agreed. I don't think large buildings/campuses need \"smoking zones\", either. If you can't go without your drug while there, don't come.",
            "title_similarity": "0.60969424",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8cmpww",
            "score": 1,
            "text": "People can have medical issues that make it impossible for them to lose weight. Like thyroid or hormone issues, or medications they have to take that make them gain weight as a side effect.",
            "title_similarity": "0.614964",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8cmqiy",
            "score": 1,
            "text": "Burns my soul to see fat kids these days with sugary drinks with hamplanet parents wheezing along behind them. Ffs man",
            "title_similarity": "0.66669977",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8cmwlr",
            "score": 1,
            "text": "No one is killing people because they are fat and driving or breaking into homes for food or robbing people at gun point saying give me all your Twinkies.",
            "title_similarity": "0.6700073",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h8cni00",
            "score": 1,
            "text": "I look at it a lot like the covid pandemics, because obesity is an epidemic in the West. The majority of people know and understand that obesity is a disease that can cause fatal health problems, it puts an enormous strain on the healthcare system and is detrimental to societies as a whole. However, there is a community that denies either the importance of treating the disease or denies that there is an effective way to treat the disease.",
            "title_similarity": "0.74084926",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h8cnlcj",
            "score": 1,
            "text": "Late to the party here but after reading OPs edits (and before reading the comments) how in the fuck did OP get gaslighted in to thinking he's wrong in what he said. Fuck me I don't go to hotels and ask for extra buckets and wipes to cater for being an alcoholic",
            "title_similarity": "0.7253542",
            "sentiment_compound": -0.93
        },
        {
            "id": "h8cnpb3",
            "score": 1,
            "text": "Agreed, unless it's uncontrollable due to a disease or disability",
            "title_similarity": "0.36513668",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cnr32",
            "score": 1,
            "text": "Acceptance is great, regardless of what makes someone different- what’s not great is forcing the notion that obesity is sexy. People with substance abuse problems aren’t glamorized, people that care do accept them and try to get them help though. But ignoring the facts behind why being overweight and living a self-destructive lifestyle is bad and promoting things like “big is beautiful”, etc., simply reinforces  confirmation bias and inhibits motivation for an unhealthy person to make a positive change.",
            "title_similarity": "0.7907171",
            "sentiment_compound": 0.0908
        },
        {
            "id": "h8co79i",
            "score": 1,
            "text": "\"Fat acceptance\" should just mean accepting fat people as people who don't deserve bullying or degradation.  It shouldn't and usually doesn't mean encouraging people to be fat, or lying that obesity is healthy.",
            "title_similarity": "0.7027674",
            "sentiment_compound": 0.2192
        },
        {
            "id": "h8coxg0",
            "score": 1,
            "text": "There are medical conditions that cause people to gain weight, and medical conditions that require medicines that cause people to gain weight. \n\nYou can’t have a medical condition that just automatically puts drugs in your veins. \n\n“Accepting” an addict would come with a 100% guarantee that the person made a choice in using. \n\nThere is no such guarantee with overweight people unless you personally know them well enough that they’re willing to share their private medical conditions with you. So basically your family and close friends. \n\nIt’s not the same.",
            "title_similarity": "0.7669989",
            "sentiment_compound": 0.8677
        },
        {
            "id": "h8cpbn2",
            "score": 1,
            "text": "Fat doesn't equal unhealthy. Health is also a luxury. Addiction is also a social issue, more than a personal disease. Look up rat park. If you can be skinny and unhealthy then you can be fat and healthy. Being fat is uncomparble to addiction. Of course a person can have an ED and be skinny or fat. But plenty of bigger people are not that way because of a disease or life style choices and it is more to do with genetics. I also think the way we handle and treat addiction in the US is deplorable.",
            "title_similarity": "0.7958665",
            "sentiment_compound": 0.6234
        },
        {
            "id": "h8cpwq1",
            "score": 1,
            "text": "You’re right, don’t listen to these people. Look into the history of the fat acceptance “movement”.",
            "title_similarity": "0.6132648",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8cqd8h",
            "score": 1,
            "text": "I dont think being fat should just 'be okay' , particularly with children.   \nHowever, sometimes people are such addicts that they kind of need to just come to terms with the fact that theyre unlikely to change. look at people on methadone.",
            "title_similarity": "0.7799925",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8cqqhg",
            "score": 1,
            "text": "I'm fat and agree. Used to be fit as a fiddle but now i enjoy food too much. Tried changing but it's quite hard not eating such yummy food :/",
            "title_similarity": "0.69979614",
            "sentiment_compound": -0.2508
        },
        {
            "id": "h8crcko",
            "score": 1,
            "text": "Just throwing it out there that it fucking drives me wild seeing 4x shirts in stores and no LTs. Just cause I lost weight and am still tall now I can't find clothes that fit well without special ordering shit?",
            "title_similarity": "0.6663588",
            "sentiment_compound": 0.1979
        },
        {
            "id": "h8crf2p",
            "score": 1,
            "text": "No matter what, being cruel to anyone because they are obese is....cruel.  But obese people weren't born that way, and they are not a protected class.  At the same time, obesity is a result of a sedentary lifestyle, a sedentary workplace, poor eating habits, lack of understanding of good foods vs. bad foods, overabundance and marketing of calorie dense foods, mental health issues--a combination of all of these.  Our society has created the obese people, they are not single agents of their own descent into fatness.  Getting them out of this place through cruelty is not the answer.",
            "title_similarity": "0.73726237",
            "sentiment_compound": -0.9545
        },
        {
            "id": "h8crfa2",
            "score": 1,
            "text": "we should accommodate fat people. people are fat and they deserve to do the same shit everyone else does. accommodations in public places aren’t going to enable fat people to continue being fat, they’re just making things more accessible to people trying to live their lives. \n\na wider turnstile isn’t gonna kill ya",
            "title_similarity": "0.74982464",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h8crkfk",
            "score": 1,
            "text": "You bring up the genetic component, which is a complicated issue. Obvi some people are overweight due to a food addiction or eating disorder/some psychological condition that could be in theory overcome with medical/therapy-based intervention. However, those resources aren't always available to everyone, even of someone is actively seeking them out.\n\nThen, some people are overweight due to lifestyle. Stress, sedentary work, lack of access to good nutrition due to lack of time for meal prep or lack of funds for healthier, more expensive ingredients. This is a very complicated issue, and can become comorbid, or exacerbated with predisposed conditions. Theres an intersection of class and addiction that needs to be addressed in this discussion.\n\nFinally, you have people who are overweight or obese from underlying physical issues. I had a close friend when I started working who was morbidly obese from a genetic disorder. We worked a labor intensive job, outside, and she was fit, but struggled with her weight and preconceived notions people had of her from her weight. She ate healthy, but her body didn't care. She did her best to be as healthy as she could be, but there was nothing she could do aside from surgery, which would only be a temporary solution and be costly. Beyond the eventual risk of heart disease, the real reason her obesity upset her was because of how people perceived her. People assumed she had some kind of mental deficit which made her unable to control herself, and this affected her life negatively.\n\nLastly, alcoholism and obesity aren't really comparable. Becoming intoxicated is an induced, temporary state, with negative side effects which are often behavorial or incidental (acting inappropriately or drunk driving, for instance). There are long term physical side effects, but you could say the same of a lot of things. Even working out too much can wear your body down and become detrimental to your physical health. Being obese isnt dangerous to others in the way that a drunk driver could be. \n\nThen think about what it takes to stop being obese vs. stop being an alcoholic. If you're obese, it may take years for you to safely lose enough weight to have a healthy BMI. Yes, it takes time for you to overcome alcoholism, but you don't have to gradually get less drunk over the course of years. They're totally different beasts: apples and oranges. Someone who is spending years trying to lose weight will be inconvenienced by the small size of public amenities during this time. A recovering alcoholic will not face these kinds of physical difficulties.\n\nI guess this isn't very related, but Im very, very tall. I'm about 6'5, and while that isnt the tallest, being this tall sucks, I have to say. Im skinny, but toilets and bathrooms are difficult. I often have to use the handicap stalls to have room for my legs, and sometimes toilet seats are too small for me in ways Id rather not describe. Public transportation can be a real nightmare, especially on flights where my knees are crammed into my chest for hours on end. Not to mention how often i slam my head on dangling light fixtures and doorways. All that is to say I heavily sympathize with people who find that the world is not built with them in mind. Obviously I'm healthy and many people have this problem far worse than I (people in wheelchairs, dwarfism, blindness, deafness) but I still know what it's like.",
            "title_similarity": "0.67146343",
            "sentiment_compound": -0.9722
        },
        {
            "id": "h8crmqa",
            "score": 1,
            "text": "This again, it must be Monday.",
            "title_similarity": "0.20787422",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8crxfe",
            "score": 1,
            "text": "Some people look fuckin weird skinny",
            "title_similarity": "0.32861793",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h8cs6cx",
            "score": 1,
            "text": "Some medical conditions/interventions cause weight gain. So it’s not always “lifestyle” choices that lead to obesity.",
            "title_similarity": "0.5338266",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h8cs74i",
            "score": 1,
            "text": "I’d love it if we implemented a system like the Japanese use but we’d probably have riots.",
            "title_similarity": "0.5870482",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8cs9q2",
            "score": 1,
            "text": "To me, fat acceptance means being fat doesn't meant you're ugly.   It doesn't mean it's a healthy lifestyle.  \n\nEg, being an alcoholic used to be considered pretty degenerate but now is seen as an addiction that needs to be treating not that alcoholism is  perfectly fine way to live",
            "title_similarity": "0.87075096",
            "sentiment_compound": 0.93
        },
        {
            "id": "h8csp4p",
            "score": 1,
            "text": "Wow what a post.\nIt was like a movie.\nI laughed I cried.\nIn the end I got the moral of story.\nKudos to all who played a role in this Production.",
            "title_similarity": "0.59757984",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h8csrbo",
            "score": 1,
            "text": "I actually agree with you. Fat acceptance and enabling obesity are totally different things. The basis of the fat acceptance movement is loving yourself no matter your size. However, loving yourself does not entail abusing your body to the brink of becoming unalive. IMO, Obesity and Anorexia are two sides of the same coin and anyone enabling that behaviour needs to get a clue because it’s dangerous.",
            "title_similarity": "0.7869531",
            "sentiment_compound": 0.9393
        },
        {
            "id": "h8ct31v",
            "score": 1,
            "text": "After reading all the edits I probably shouldn't tell this story. But whatever, \n   I'm from Canada and while people here aren't all slim, I'd never before seen the level of overweightness until I was travelling in Hawaii when I was like 22. My partner and I went to a buffet and there was quite a line. We waited about 5 minutes in line before getting to the food. Anyway there was this extremely obese woman, probably the fattest woman I had seen in my life up to that point. And she was sitting very close to the buffet. At one point she got up and just turned around to the buffet table and started dishing up her plate while everyone else just remained standing in line waiting their turn. I saw her do this multiple times while I was there. I was outraged, I kept using the example, 'if someone is so fucked up on drugs they can't light their crack pipe, you don't do it for them!'  Why was everyone allowing this? I still have so answer and it still angers me thinking about it.",
            "title_similarity": "0.62265253",
            "sentiment_compound": -0.9529
        },
        {
            "id": "h8ct61x",
            "score": 1,
            "text": "I am not fat because of food. I'm fat because of my inability to exercise. The idea that all fat people are that way because of an addiction to food is wrong.",
            "title_similarity": "0.7459971",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h8ct7ek",
            "score": 1,
            "text": "No two things are exactly the same. Same goes for a metaphor.",
            "title_similarity": "0.2999076",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8ct9kw",
            "score": 1,
            "text": "We already come to the point where fat people are shaming other people for not dating fat people.",
            "title_similarity": "0.7176114",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctb0h",
            "score": 1,
            "text": "But it’s still none of your business if it isn’t harming you or others.",
            "title_similarity": "0.36187246",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h8ctddr",
            "score": 1,
            "text": "How much someone weighs is not for you to “accept” nor is it any of your fucking business",
            "title_similarity": "0.4061694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctw7x",
            "score": 1,
            "text": "Lots of fatphobic people in here.",
            "title_similarity": "0.4080081",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctzro",
            "score": 1,
            "text": "Shout out to OP for your journey on this post!!",
            "title_similarity": "0.11261228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cu4hy",
            "score": 1,
            "text": "Ridicule doesn't cure addiction and doesn't help people lose weight either",
            "title_similarity": "0.57162035",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8cu7x4",
            "score": 1,
            "text": "If fat jokes bad why funny?",
            "title_similarity": "0.56110823",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h8cuf7v",
            "score": 2,
            "text": "It’s more like harm reduction IMO. Obesity and substance abuse are two major public health crises, neither of which have been handled well by Western (namely American) society. \n\nWe’re learning that stigmatization is a huge driver of negative outcomes for both obesity and substance abuse, so just as people advocate for more access to, say, opioid agonist therapies like suboxone and decriminalization of personal drug use, people are also advocating for a less shame-focused approach to wellness. \n\nThere are people who claim both are “enabling,” but in reality the harm reduction model prioritizes small/realistic goals and removing obstacles. In regards to obesity, that might mean creating an environment in which people feel comfortable exercising in public, or are protected from size-related trauma that could perpetuate their unhealthy habits.\n\nI really doubt that most people who strive to be body positive would say claim it’s a good thing to “let” people be obese. I think they instead recognize that another person’s weight is most likely none of their business and that it’s more helpful to be kind and welcoming to someone despite their struggles. Most of us need to heal on our own volition, in our own time.\n\nI have had a hard time with people in my family who are obese. I worry greatly about their health, but I had to make a conscious decision to accept them for who they are in this moment. Would I engage in unhealthy behaviors with them? No, but I’m always going to strive to make them feel loved and do what I can to help them when a) they are explicitly asking for my help and b) the help I can provide is appropriate and realistic.",
            "title_similarity": "0.7743508",
            "sentiment_compound": 0.9815
        },
        {
            "id": "h8cuouw",
            "score": 1,
            "text": "Fat people are unattractive and gross",
            "title_similarity": "0.5333065",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h8cuyi6",
            "score": 2,
            "text": "Let’s dig deeper beyond the surface. There are multiple factors that contribute to the growing population of overweight and obese Americans.\n\n- Proper nutrition isn’t taught in schools.\n- Added sugar (which is extremely detrimental to health for countless reasons) is included in the vast majority of readily available foods\n- Nuancing the above: the vast majority readily available and economically affordable foods in supermarkets contain processed carbs and added sugars: both of which will take years off your life and make your shortened life uncomfortably unhealthy.\n- The tendency for healthcare specialists to resort to drugs to cure problems created by lifestyle and dietary causes. Again addressing the symptoms rather than the root causes.\n\nThese factors are influenced by and to no surprise benefit one particular minority group: the elites. The pharmaceutical companies. The companies that run and own the majority of the world’s food supplies. Those that are in power.\n\nThere is no profitability in Heath, only in sickness. Let’s stop pointing the fingers at each other and address the problem at its core. \n\nIt’s none of our (citizens) fault that many people are fat, but is all of our responsibility to educate ourselves and help each other make better and healthier lifestyle choices.",
            "title_similarity": "0.7355337",
            "sentiment_compound": -0.308
        },
        {
            "id": "h8cvd0k",
            "score": 1,
            "text": "Body positive is one thing, fat acceptance is another thing.",
            "title_similarity": "0.51366675",
            "sentiment_compound": 0.765
        },
        {
            "id": "h8cvy9t",
            "score": 1,
            "text": "I guess we should not shame them as that would only make them feel worse and dive deeper into their problems but rather except and try to help as best we can through understanding.",
            "title_similarity": "0.55745137",
            "sentiment_compound": 0.8492
        },
        {
            "id": "h8cvzui",
            "score": 3,
            "text": "OP, I can see that after all these comments, this thread has cooled and you have made edits to your post. I hope you will still see this comment, and hopefully, it can help change your mind. \n\nI’m an addict, addicted to food. At my largest I was 730 pounds. I carried it well (relatively…) usually people that size need to be lifted by cranes and flatbed trucks. I was still riding my motorcycle and driving my Jeep. \n\nI was never one for fat acceptance. I was ashamed of who I was and what I looked like. Through a roller coaster of events, I dropped to a 1200 calorie a day diet and only worked out on days that had the word day in it. it took years but I went from 730 down to 230. \n\nI was proud of how much I had lost, but had nothing but empathy for people who were bigger because I know how bad it sucks. You’re in a hole with a shovel and it only gets deeper. \n\nSomething extraordinarily traumatic happened, and I fell off the wagon. Not only did I go back to eating 4,000 calories a day but I started drinking and I never drank before. I gained 150 pounds In a year. So now I’m 380. If you look at just my height and weight, I am technically morbidly obese. But when people meet me, they don’t know my history. They don’t know that yeah, I’m huge by most every standard, but I used to not be able to fit through doorways. I would break office chairs. \n\nI’ve been stable at this weight for 18 months. 1-2 pounds off, 1-2 pounds on. I’ve gotten back in charge of my life. I’m not an advocate for fat acceptance. But I accept my weight, and I’m damned proud of my current weight, given that I was once twice as big. \n\nPoint is, don’t automatically think that people who are proud of their bodies are embracing unhealthy addiction. I’m fighting it every day, and I wish people were more compassionate and empathetic.",
            "title_similarity": "0.81935143",
            "sentiment_compound": 0.9775
        },
        {
            "id": "h8cw91j",
            "score": 1,
            "text": "Nah bro you’re right on the money.  To be fat is to be unhealthy, it’s proven. With fucking science. Now of course these days no one gives a fuck about science, but to accept being fat is to accept being unhealthy. There is no healthy overweight….",
            "title_similarity": "0.7558553",
            "sentiment_compound": -0.7129
        },
        {
            "id": "h8cwee0",
            "score": 1,
            "text": "So you are just going to pretend that thyroid disease does not exist.  Ok.",
            "title_similarity": "0.46245372",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cx3e5",
            "score": 1,
            "text": "Wth is fat acceptance. Body positivity is about accepting your body and lovIng you body at every stage it’s in. We only get to live for a short time, why spend that time hating how we look. we should always encourage health living of course, and we can continue to do so while also still accepting and loving ourselves when maybe we’re not at the best shape. Why does one have to automatically cancel the other one out.",
            "title_similarity": "0.7040485",
            "sentiment_compound": 0.8893
        },
        {
            "id": "h8cxamy",
            "score": 1,
            "text": "”Fat shaming“ is the newest guise for hate speech.",
            "title_similarity": "0.5663076",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8cxcro",
            "score": 1,
            "text": "Fat people are GROSSSSS ewwww",
            "title_similarity": "0.52848756",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cxj9r",
            "score": 1,
            "text": "The assumption being made here is that ALL overweight people have an eating addiction.  That is not the case.  I am a fit person who watches my diet and yet I fail to lose weight.  I have seen doctors,  nutritionists, fitness trainers-- no avail.  Don't make the assumption that all fat people are weak.   Some are trying very hard but have not unlocked the secret to their metabolic issues.",
            "title_similarity": "0.79031026",
            "sentiment_compound": -0.6648
        },
        {
            "id": "h8cycwn",
            "score": 1,
            "text": "No, it isn't...lol.  try using that big brain.",
            "title_similarity": "0.37510157",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cycxs",
            "score": 1,
            "text": "As a fat person, the one thing that gets me is celebration dinners. For everything. Highest form of enablement for obese people. Something good happened- let’s celebrate with food, but why do you emotionally eat?",
            "title_similarity": "0.6924704",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8cyhzp",
            "score": 1,
            "text": "It's great how people become doctors of medicine and psychology when they feel the need to  start shaming people for something, justifying to themselves that it's the best way to get someone to change.  \n\nA popular podcaster has advocated shaming, and since then, I have seen  several discussions like this about the necessity to help change someone's habits.  I guess I underestimated the reach of podcasting, as well as people's inability to think for themselves.\n\nMaybe it's just the current age that has brought shaming to a head, where it's common place for a random anonymous individual, media outlet, social media, to talk complete shit, and get away with it.It's backed up by others who are willing to jump on that same bandwagon. This includes politics, pandemics,  etc..",
            "title_similarity": "0.7693287",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h8cytwm",
            "score": 1,
            "text": "Well yeah nobody says being an addict is a good thing, but you can be friends with addicts and try not to treat them as harshly as the outside world does because you can empathize with their struggle. Being fat and being an addict do demean your experience as a member of society, and both of those things can easily be outside a person's hands to control.",
            "title_similarity": "0.80908704",
            "sentiment_compound": 0.6718
        },
        {
            "id": "h8cz0jf",
            "score": 1,
            "text": "Thanks from a morbidly obese woman trying to get help but feeling like everyone thinks this shit is normal.",
            "title_similarity": "0.64789426",
            "sentiment_compound": -0.0194
        },
        {
            "id": "h8cz2df",
            "score": 1,
            "text": "This is word for word how I describe it too my thin friends, I’m overweight, I feel the struggle",
            "title_similarity": "0.6094585",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8cz6mp",
            "score": 1,
            "text": "Fat acceptance is lazy",
            "title_similarity": "0.5189588",
            "sentiment_compound": 0.128
        },
        {
            "id": "h8czcck",
            "score": 1,
            "text": "Yeah, listen, please don't go around teating addicts horribly either. Just be nice to everyone, it's not a hard task",
            "title_similarity": "0.58079946",
            "sentiment_compound": 0.4932
        },
        {
            "id": "h8czsxf",
            "score": 1,
            "text": "Because being fat isn’t always a fucking choice. There are many reasons why someone could be overweight. Also overweight people don’t deserve to suffer just because they aren’t stick thin. Overweight people are human beings and don’t deserve all the shit they get. Overweight people don’t deserve to be oppressed",
            "title_similarity": "0.7301934",
            "sentiment_compound": -0.891
        },
        {
            "id": "h8czyht",
            "score": 1,
            "text": "How many people have you seen rob or murder people for a double-quarter pounder?",
            "title_similarity": "0.4309606",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h8d0f8q",
            "score": 1,
            "text": "Your initial feelings were right. People should put the fork down instead of killing themselves and expecting everyone else to build around their irresponsible life decisions. I say this as someone who is addicted to good and can never eat enough. Keeping the weight off is hard af but I do everything I can to stop myself from eating too much and would never expect anyone to alter any environment for me for eating too much. These people aren't handicapped, they just need to stop eating so god damn much.",
            "title_similarity": "0.7977185",
            "sentiment_compound": -0.8548
        },
        {
            "id": "h8d0ncy",
            "score": 1,
            "text": "When was the last time someone laughed at you because you are an alcoholic?",
            "title_similarity": "0.73451996",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8d1vob",
            "score": 1,
            "text": "Lots of fat people out here writing tomes in here",
            "title_similarity": "0.4261641",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d1yij",
            "score": 2,
            "text": "I don't get why people can't mind their own buisness, if it's a family member you are genuinely worried about then sure but random people in the street and stuff is crossing a line from trying to help to being a dick.\n\nI think everyone should mind their own buisness no matter what, unless asked of course. I don't want to hear about how I'm going to hell for not believing in god, killing myself with smoking or alcohol, a monster for being gay, a cunt for being a lesbian, disgusting for being overweight, soft for not hitting my kids, etc from any random person.\n\nQuite frankly I don't give a shit what you think about me and nothing you could possibly tell me is going to change who I am. I can decide for myself who or what I am.\n\nJust leave people alone, it's their life stop trying to get in other buisness to avoid working on yourself. If they want to clog their arteries then that's their buisness, sure tell your family if you are concerned but stop giving unsolicited advice to strangers.\n\nI hate seeing diet tips under even slightly overweight people's pictures by some self righteous jackass, just leave them be. Do you really think they don't know being overweight is bad or that smoking destroys your lungs? Genuinely? Cause if so I might have to tell you how much you are ruining your life by being dumber than a sack of shit....",
            "title_similarity": "0.7698866",
            "sentiment_compound": -0.9963
        },
        {
            "id": "h8d2aok",
            "score": 1,
            "text": "You know what the difference between being addicted to food and addicted to alcohol is? Your body doesn't require you to drink any alcohol to live. As an alcoholic you should be pretty familiar with the idea that One Drink Is Too Many, but people with emotional eating or similar eating disorders don't have the ability to just not eat anymore.",
            "title_similarity": "0.82350075",
            "sentiment_compound": 0.1424
        },
        {
            "id": "h8d2ey8",
            "score": 1,
            "text": "Body acceptance isn’t about encouraging people to remain fat, it’s just not to insult them because they are",
            "title_similarity": "0.54612184",
            "sentiment_compound": 0.8443
        },
        {
            "id": "h8d2ryr",
            "score": 1,
            "text": "No",
            "title_similarity": "0.011216706",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8d30dh",
            "score": 1,
            "text": "JFC society still treats fat people like pariahs and makes them feel terrible about themselves. This idea that fat people are being praised for their size is absurd. Just because Lizzo says “I don’t hate myself” doesn’t mean society accepts large bodies as equal to slender bodies.",
            "title_similarity": "0.79760945",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8d4cx9",
            "score": 1,
            "text": "You metabolism tanks when you hit the big three O. Sure some people eat way to much, but you can get fat by gaining a few pounds a year. You can't become a drunk, by drinking one beer to many, and have accumulate over fifteen years. You can stop drinking for two days, and be sober. You could eat nothing for two days, and still be fat. You don't need to drink. You do need to eat. The food they tell people to eat, is the same food they use to fatten cattle. Fat people can drive cars, and not kill people. Drunks kill people driving like it's the right.",
            "title_similarity": "0.74474907",
            "sentiment_compound": 0.7106
        },
        {
            "id": "h8d4wuk",
            "score": 1,
            "text": "Goodness forbid if someone who pays for a hotel rooms be all of its amenities has amenities that suit their needs like a slightly bigger towel. Where are my smelling salts??",
            "title_similarity": "0.59052694",
            "sentiment_compound": 0.5514
        },
        {
            "id": "h8d551f",
            "score": 1,
            "text": "The people I see often fat shamed (not celebrities) are often not even overweight. Just girls who aren’t petite. They look fine. They look healthy. Even if they were obese, they’re not tryna promote obesity. Just tryna not be humiliated for it.\n\nI have PTSD, something I’ve worked long and hard to recover from, and if I were to say “Please don’t make fun of me for that” and somebody responded with “You shouldn’t encourage having trauma!” I’d be pretty upset too.",
            "title_similarity": "0.772006",
            "sentiment_compound": 0.8383
        },
        {
            "id": "h8d5cb4",
            "score": 1,
            "text": "I wanna say one thing. It doesn't make an addict quit his addiction because people bully him for it.",
            "title_similarity": "0.7352236",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8d5l38",
            "score": 1,
            "text": "You're right. I'm fat and hate poeple who are proud of it",
            "title_similarity": "0.66039073",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8d5ud1",
            "score": 1,
            "text": "Congrats on your sobriety. You are fighting the good fight and I am proud of you.\n\nI would simply say look at a child growing up with an alcoholic father and an overweight/fat mother or vice versa. Which do you thing will have the worst impact on that child?",
            "title_similarity": "0.78559715",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8d6ekc",
            "score": 1,
            "text": "It's not just about eating though. I never had a problem with weight until I started taking mental health medications, and now I am overweight. I've talked to a dietician and she said my eating is normal. There are obviously things I have to do to lose weight, but if I literally gain weight from eating normally, why should I be treated horribly for that?",
            "title_similarity": "0.78775966",
            "sentiment_compound": -0.2432
        },
        {
            "id": "h8d6hsr",
            "score": 1,
            "text": "omg",
            "title_similarity": "-0.011707649",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d6qqf",
            "score": 1,
            "text": "Hey, just wanted to say congrats on your sobriety. I hope you have a good support network these days. Your post and edits were an interesting read.",
            "title_similarity": "0.56667745",
            "sentiment_compound": 0.9274
        },
        {
            "id": "h8d891c",
            "score": 1,
            "text": "You guys are so angry r/fatpeoplehate got banned, it's been years, get over it.",
            "title_similarity": "0.62391645",
            "sentiment_compound": -0.8042
        },
        {
            "id": "h8d8cwh",
            "score": 1,
            "text": "People are overweight, but they don't need to carry a constant shame and self hatred for themselves. \n\nFat acceptance is about removing that self loathing an being allowed to exist and work towards self-love. \n\nSome interesting facts they have found out;\n\n Once body reaches a certain weight, even after that weight  is lost your body's hormones try the body back to that weight.\n\nSatiety is controlled by many factors bit a suprising one is the diet of not just your mom but your grandmother as well. So if your grandmother was malnourished, impoverished or had food access problems that affects how you crave food and how satisfied you are with your food.",
            "title_similarity": "0.80976295",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h8d8cwy",
            "score": 1,
            "text": "Hey author of this post, I'm 11 years sober and just wanted to say congrats on your sobriety.",
            "title_similarity": "0.6570821",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h8d8e59",
            "score": 2,
            "text": "Lol are you seriously trying to argue that people just cannot lose weight? That’s insane. Good luck trying to find credible studies to back you up! \n\nOf course, losing weight for some may be easier than it is for others. But everyone, (humans, animals...literally everyone) can lose weight through diet and exercise. \n\nIf your friends honestly cannot lose weight through true diet and exercise, then they must have a medical condition that they should get checked out. If they have no underlying medical conditions then what you’re saying absolutely makes no sense at all and the only logical explanation is that they are lying to you about their diet and exercise.",
            "title_similarity": "0.7672931",
            "sentiment_compound": 0.5485
        },
        {
            "id": "h8d8jld",
            "score": 3,
            "text": "You need food to live. You don’t need alcohol or drugs to live. So even if it is food addiction, it’s a lot more complicated to combat than other substances that a person can walk away from and avoid forever. Food addicts will constantly be faced with their problem and triggers for the rest of their lives. \nBut there is a much bigger group of obese people who’s bodies will stay the same shape no matter how little they eat. It’s a very ignorant way to view people just because of the size of their bodies. Sure some people are capable of shedding weight and controlling their size with diet and exercise, but they are a relatively small group of people. For the majority, things like metabolism, hormones, menstrual cycles, thyroid issues, autoimmune disorders, type 1 diabetes, etc. will all affect size and weight beyond their control. It’s great to be healthy and have complete control of your body, mind, and life, but you need to understand that you are the very minute minority. Most people around you are fighting an intense battle that they never asked for or wanted, and the rest of us have no idea. All we see is fat, one symptom. And we assume that’s the only problem they have.",
            "title_similarity": "0.75407904",
            "sentiment_compound": 0.1944
        },
        {
            "id": "h8d8nms",
            "score": 1,
            "text": "This is really a strawman argument. No one says \"obese people should be accepted for being obese and not helped\" unironically. Fat acceptance is just saying that people who don't look like the average model should be accepted for not having a perfect body. Most of the people fat acceptance is targetted at aren't even by definition overweight because that is how flawed the average image you would see in advertising is.",
            "title_similarity": "0.7880597",
            "sentiment_compound": -0.6675
        },
        {
            "id": "h8d8v98",
            "score": 1,
            "text": "But people can be fat due to medical conditions addiction jts something you actively do to yourself \n\nThere is a small small percentage of babies who used in the womb in comparison with to X thing made me gain lots of weight\n\nIm not fat but im had a hard time losing the weight I gained by antidepressants and i can’t imagine how people with hypothyroidism,PCOS, etc could fell\n\nWe need to have more empathy with fat people, and also people dealing with addictions because we cant shame anyone into psychological health but that’s another problem",
            "title_similarity": "0.791675",
            "sentiment_compound": 0.7738
        },
        {
            "id": "h8d8van",
            "score": 1,
            "text": "People who can't discipline themselves should not be immune to ridicule. Being fat (or addictive) may just be a biproduct of lack in discipline. But putting the two together may be not be totally accurate.",
            "title_similarity": "0.6621839",
            "sentiment_compound": -0.4756
        },
        {
            "id": "h8d9p11",
            "score": 1,
            "text": "Being addicted to something is a behavior. Being fat is a physical characteristic. One does not always lead to the other. Being kind is never wrong.",
            "title_similarity": "0.55954933",
            "sentiment_compound": 0.7144
        },
        {
            "id": "h8d9pfa",
            "score": 1,
            "text": "As a fatty, I was a little insulted initially but reading your edits made me so happy. Self discovery is beautiful.",
            "title_similarity": "0.615469",
            "sentiment_compound": 0.9179
        },
        {
            "id": "h8d9qsn",
            "score": 1,
            "text": "I used to be fat and in practice it is enabling an addict. Though in theory it is correct. It isn't productive to just point out that they are fat all the time or mock them. They know. \n\nThe root of the problem in addiction is usually a need not being met somewhere else in their lives. Help fix that and you empower them to overcome addictions. Often on their own.",
            "title_similarity": "0.8474158",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8dafgo",
            "score": 1,
            "text": "That is just an excuse",
            "title_similarity": "0.17596394",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8daln1",
            "score": 1,
            "text": "Fucking wanker.",
            "title_similarity": "0.269095",
            "sentiment_compound": -0.5849
        },
        {
            "id": "h8daowz",
            "score": 1,
            "text": "WTF is wrong with you? You obviously know drug addiction and withdrawal are are worse than food. fuck off",
            "title_similarity": "0.70480204",
            "sentiment_compound": -0.9341
        },
        {
            "id": "h8das2y",
            "score": 1,
            "text": "Fat people dont eat too many slices of pizza and run over a crossing guard because they were too full.",
            "title_similarity": "0.64886975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dbc1h",
            "score": 1,
            "text": "Being a alcoholic is a real issue thats difficult to get on the top of, fat people can just eat less or maybe even take up walking",
            "title_similarity": "0.7608836",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8dbg9f",
            "score": 1,
            "text": "When you stop drinking alcohol, you’re healthy. Then you stop smoking, you’re healthy. When you stop eating food, *you die*. Our relationship with food needs to be more nuanced— more people have eating disorders than ever before. We do need to be more accomodating of body types. I don’t see what’s so complicated about it.",
            "title_similarity": "0.7540556",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h8dbt0n",
            "score": 1,
            "text": "Jesus,  you people need to fucking get off the internet.",
            "title_similarity": "0.41235486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dc6xt",
            "score": 1,
            "text": "Reading all this, My fat ass over here wanting a Pizza 😂",
            "title_similarity": "0.5275978",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8dcgmo",
            "score": 1,
            "text": "I’m fat, I know I’m fat, I don’t like that I’m fat, I try and try and fail and fail to change, it’s pure hell. I don’t like using the word addiction b/c in my mind that’s for people who had drug and alcohol issues; I feel like I’m lessening what they go through if I say that; however, I can stop eating no matter what I try. You don’t have to accept me, but it would be nice to have people not go out of their way to hurt me.",
            "title_similarity": "0.8559941",
            "sentiment_compound": -0.5841
        },
        {
            "id": "h8dcod0",
            "score": 1,
            "text": "Overweight people are the reason this disease kills more then 1% of those who get it.",
            "title_similarity": "0.55690104",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h8ddpt9",
            "score": 2,
            "text": "Some people are having a hell of a time and can’t do anything about it.  I had 6 months where I couldn’t move my arm followed by a 6 month recovery from surgery where I couldn’t lift, run or do anything without a shoulder dislocation.  Got fat af and super depressed.  Took a long time to beat it and get back into decent shape.  All the people that talked shit to me made me pretty much stop giving af about people.  It was especially bad because prior to the injury I was a fitness freak that could bench 300+, run marathons and worked put 2+ hours per day, and I lost my career due to the injury.\n\nTelling people in insurmountable situations that they’re lazy because their fat is such a shit move, since all it will do is push them further into depression.  Some situations can’t be beat, and our body’s release of cortisol assures that the chronically stressed can only get fatter.",
            "title_similarity": "0.6573845",
            "sentiment_compound": -0.979
        },
        {
            "id": "h8ddtqq",
            "score": 1,
            "text": "Food addiction should be treated as seriously as any other addiction, yet it's not. There's no food addiction rehab, yet obesity is just as deadly as continuous alcohol consumption, and can even play a factor in that addiction too.",
            "title_similarity": "0.81611574",
            "sentiment_compound": 0.3794
        },
        {
            "id": "h8de4id",
            "score": 1,
            "text": "Hey. I just wanted to say congrats on your 6 years of sobriety. That’s amazing and you are awesome. Keep it up.",
            "title_similarity": "0.5571486",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h8de9km",
            "score": 1,
            "text": "Fat people don’t go to Heaven.",
            "title_similarity": "0.4683085",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8dg2w0",
            "score": 1,
            "text": "THERE IS NO DEFAULT BODY. \n\nThe entire idea of \"healthy\" and \"fat\" come from an intensely ingrained culture of body shaming. \n\nForget \"fat acceptance\". We should accept that all bodies are different. Some people literally cant lose weight without damaging measures, and some people can't put on weight of they eat 4000 calories a day.\n\nThis whole idea that you see \"fat\" as something anyone should be ashamed of, is most likely because youve been shaming your own body since childhood.\n\nCheck out  The Body Is Not An Apology",
            "title_similarity": "0.8049319",
            "sentiment_compound": 0.6345
        },
        {
            "id": "h8dg7fk",
            "score": 1,
            "text": "Perhaps your view could be to mind your own business and not judge other people?",
            "title_similarity": "0.42042994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dgaek",
            "score": 1,
            "text": "As someone who used to think the same thing, I realize now that it’s easier to treat your body well, eat right, and exercise if you’re not constantly loathing it. Body positivity is about acceptance and treating yourself right. Once I got understood that and started genuinely caring for and respecting my body, I lost weight and stopped smoking.",
            "title_similarity": "0.68186843",
            "sentiment_compound": 0.959
        },
        {
            "id": "h8dgz30",
            "score": 1,
            "text": "I lived in China for seven years. If I stopped exercising for even a week my students would tell me that I was getting fat. They would tell me before I even realized myself. Living in China and being ridiculed for being fat is the main reason I’m a healthy weight today. It’s not like they were being mean to me, they were concerned about my health because being overweight is unhealthy.",
            "title_similarity": "0.7608387",
            "sentiment_compound": -0.8276
        },
        {
            "id": "h8dh5r6",
            "score": 1,
            "text": "“Fat acceptance” is about not attributing a person’s worth to the size of their body.",
            "title_similarity": "0.6340035",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8dhc8q",
            "score": 1,
            "text": "I don’t get all the apologies. You were correct from the word ‘go’.\n\nNot ridiculing and making people feel bad is just human decency. Saying ‘fat is good’ is cruel and objectively incorrect. \n\nFat acceptance has crossed into the realm of the unhealthy and unhelpful.",
            "title_similarity": "0.7494265",
            "sentiment_compound": -0.7482
        },
        {
            "id": "h8dhi1e",
            "score": 1,
            "text": "I think people need to start viewing the obesity problem as it is... A problem. So for example you're fat that IS a problem you need to change it, but you also need support to do it, i think the problem with the fat acceptance movement is that the visible part of it is a bunch of fat people just saying \"hey im morbidly obese and i don't have any health problem\". The problem is the extremes, i think people shouldn't compare themselves to celebrities or models but i also think that people shouldn't compare themselves to obese people that say they are good as they are. We need a middle ground. We should promote healthier ways.",
            "title_similarity": "0.7856479",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8dhj1b",
            "score": 1,
            "text": "Which physical accommodations did your addiction require you to get?",
            "title_similarity": "0.3966214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dhzsc",
            "score": 1,
            "text": "Your not \"fat\" just cause you eat a lot. It also comes with health conditions. My bio mother was \"fat\" but it was all 'water weight'. She barely ate anything. At all. Then there is my foster dad that after an accident gained a lot of weight, not from eating tho. He's tried and can't loose this weight. He works a physically demanding job, doesn't eat a lot(it's a family thing from being poor) and doesn't loose weight. Sure there are true food addicts, but just cause you are \"fat\" doesn't mean you are one. Like, just cause you are skinny doesn't mean your anorexic, or having eating problems. it's just your body type.",
            "title_similarity": "0.7431083",
            "sentiment_compound": -0.3415
        },
        {
            "id": "h8di4re",
            "score": 1,
            "text": "So many edits",
            "title_similarity": "0.14601338",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8djhby",
            "score": 1,
            "text": "Hmmm I think it's easier to quit hamburgers than crack.",
            "title_similarity": "0.57861406",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8djixm",
            "score": 1,
            "text": "I'm fat lol. Also all of my blood test results are either normal or only a point or so above normal. \n\nI'm trying to not be fat but just being fat doesn't automatically put you in the same place as a drug addict. \n\nEvery time I go to the doctor I get a concerned talking to then get blood work don't then end up hearing what I've known for awhile. I'm fat but don't currently have any immediate health concerns though I should Def work on not being fat lol. \n\nA drug addict can literally kill themselves or others any day via od or driving while under the influence. The second one there is very important as it effects more than just the addict.",
            "title_similarity": "0.82200295",
            "sentiment_compound": -0.7911
        },
        {
            "id": "h8djnwi",
            "score": 1,
            "text": "Why change your view if it is correct?",
            "title_similarity": "0.20606892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8djqwu",
            "score": 1,
            "text": "There's some confusion on what fat acceptance is. I also do not like the phrase because it's vague and can easily be interpreted badly. It just refers to not making overweight people because it's not okay to make fun of of someone who has a weight problem. It's not about being okay with individuals killing themselves through weight problems and food addictions.\n\nThere's also a confusion with people who are big boned or thick but are healthier than some slim people or with others dealing with legitimate obsessity. It's hard to draw a hard line on these things when your body doesn't work the same as some other person with different genes.  This needs to be apart of the discussion as well since these thicker individuals aren't overweight. They are just bigger but still healthy have good resting heart rates with no breathing problems or blood pressure issues.\n\nIt's not okay to ridicule anyone for whatever shape they are. Slim or big. Let's just be clear about that\n\nIt is okay to be concerned about an individual's health if they are physically changing to an unhealthy level or haven been legitimately overweight for a long time. The way you express that concern must be in a mindful way where your not being offensive based on what that individual finds offensive.",
            "title_similarity": "0.77341753",
            "sentiment_compound": 0.8062
        },
        {
            "id": "h8dk7g9",
            "score": 1,
            "text": "I wish that more people on Reddit realized that a lot of their “feelings were/are rooted in self-loathing.”",
            "title_similarity": "0.64271706",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8dk7k2",
            "score": 1,
            "text": "Wow so much growth in one post rock on",
            "title_similarity": "0.13689637",
            "sentiment_compound": 0.7703
        },
        {
            "id": "h8dkilm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0997379"
        },
        {
            "id": "h8dl26r",
            "score": 1,
            "text": "I was once 400 pounds and morbidly obese.  It was never healthy or good for me.  Probably took 10 years off my natural lifespan.  It also almost killed me and I was able to run an 8 minute mile, bench 275, and leg press 400.  But my cholesterol and risk of stroke was so high I would be dead today had I not lost it.  The vascular pressure, toxin build up, just everything is so bad for you when you weigh that much.  My joints took a heavy toll.  The list goes on.  Lose the weight people, you have no idea how much better off you will be years later even if you are happy now.",
            "title_similarity": "0.71472466",
            "sentiment_compound": -0.9504
        },
        {
            "id": "h8dl8kt",
            "score": 1,
            "text": "On some level you're  right but I think a lot of skinnies simply cant understand the shit fat people go through. And I'm talking about just fat ones, not even counting the obese ones.\n\nI've been skinny, fat, obese to skinny, fat, obese and so on because every say 10 years due to sarcoidosis I get the pleasure of going on a massive cortisone cure ( one of my side effect is an unstoppable, relentless hunger)\n\nAnd just the passive aggressive way you get treated as soon as you pass a certain threshold is on it's own already depressing.\n\nFat people could do with more compassion and less judgement. Normies, you guys dont know the circumstances what made that fat basterd fat so keep it to yourself.",
            "title_similarity": "0.7960017",
            "sentiment_compound": 0.9207
        },
        {
            "id": "h8dln89",
            "score": 1,
            "text": "Right or accepting people who drink at all, or accepting people who smoke cigarettes, or accepting people who use steroids, etc etc. If we're going to single one self destructive life decision, then we should just walk around judging everyone. Any alcohol consumption causes brain damage, so there should be just as much judgement for someone who drinks socially as someone who is obese, they're clogging up our medical system with their cognitive impairment and liver damage. I agree with you, those horrible people who drink white claw by the pool should be told, every time you see them, just how disgusting you find their abhorrent self destructive actions.",
            "title_similarity": "0.8358945",
            "sentiment_compound": -0.9524
        },
        {
            "id": "h8dlqol",
            "score": 1,
            "text": "Acceptance is the only path to recovery",
            "title_similarity": "0.27459285",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8dlv7e",
            "score": 1,
            "text": "As if every fat person doesnt wish they werent or think to themselves \"this would be easier if i wasnt so fat\"",
            "title_similarity": "0.6637893",
            "sentiment_compound": 0.1386
        },
        {
            "id": "h8dm1ep",
            "score": 1,
            "text": "As a big guy myself, fat shaming seems to be one of the few things that seems to still be culturally acceptable these days. Race, gender, sexuality, etc have all become generally much more taboo to make fun of people over, but people on the internet are more than happy to tell you how much of a fat ass you are. \n\nI've had bosses come in at previous jobs, look at me, see I was full time at that store, and automatically assume I didn't work hard enough to deserve it. I've had places assume I'm stupid and try to underpay me too. I've proved every last one of them wrong, but it doesn't change that I've always been viewed by some people as lesser than purely because of my weight.  Everyone deserves to be treated with basic human respect regardless of what their issues are and what they're going through.",
            "title_similarity": "0.82613325",
            "sentiment_compound": -0.1627
        },
        {
            "id": "h8dm77x",
            "score": 1,
            "text": "Correct. I almost cringe when an unhealthy person says they want ice cream. Like dude, I can't even remember the last time I had ice cream. You don't need that shit on your life lol.\n\n\nEdit: Woops thought this was /r/unpopularopinion",
            "title_similarity": "0.6609402",
            "sentiment_compound": 0.6278
        },
        {
            "id": "h8dmgsf",
            "score": 1,
            "text": "On a personal note, as the only fat person who is not an alcoholic in a family where literally every other member of my immediate family (and a solid 50% of my extended) is an alcoholic (some active, some in recovery)...be really careful about that \"I got sober, so no one else can have legitimate problems that require acceptance\" attitude. \n\nI am stewing pretty hard right now. I have some choice words I want to say, but that's my trauma talking which is ironic as a good bit of my trauma in life came at the hands of alcoholics and here's one telling me they don't understand why I deserve so much *acceptance*, a thing, incidentally, that I have had precious little of most of my life.\n\nI gotta get out of here before I say some things we will both regret.\n\n(I saw your updates. Still mad.)",
            "title_similarity": "0.8218771",
            "sentiment_compound": 0.008
        },
        {
            "id": "h8dmpl3",
            "score": 1,
            "text": "Nursing school student here. So not an expert but learning and will get there one day. \n\nCommon misconception that fat people are lazy etc. There can be physiological issues that can impede a person losing or gaining weight. For instance thyroid. If your thyroid is fucked, you have insulin issues (pancreas) growth hormone problem and so on then you can try as much as you want but the shape you have has to be addressed by fixing the issue causing it. And because of discrimination sometimes patients do not get the care or diagnosis they need. \n\nFor instance Cushing Syndrome (stems from cortisol issue). Look it up. A person with Cushing can't help their body shape or their hunch back- they are all symptoms that point to disorder. So yes, in some cases people need to make life style changes and can get healthy and lose weight and keep it off by changing dietary intake and making lifestyle alterations. But in a lot of cases there are patients that could try and try and do all the right things and still be shaped like the blue berry girl from Willy Wonka. The problem is the discrimination and blowing those patients off coupled with those patients are not medical experts and can't diagnose themselves. They don't understand why they can't lose weight and they eventually accept it meanwhile an underlying condition robs them of quality of life and opportunities because of cultural discrimination. \n\nSo without knowing why every single person is fat you cannot assume it is medical or habitual. So the best thing to do is accept that other people come in the shape they do and not hold it against them. You never know what people are dealing with or how hard they may be battling something behind closed doors.",
            "title_similarity": "0.74666065",
            "sentiment_compound": -0.2818
        },
        {
            "id": "h8dnh84",
            "score": 2,
            "text": "We already have alcoholic acceptance. \n\nWe don't blame the alcoholic (well, entirely) for becoming an alcoholic, and we support their struggle to control their addiction. \n\nThe same is true of fat people, except a lot more people don't accept that having a genetic predisposition to becoming fat is a factor, nor do they accept that fat people aren't just lazy assholes who purposely eat until they're gigantic.\n\nVery few fat people want to be fat people. Science just literally doesn't know how to go about helping them not be fat anymore. Anyone who says \"just eat less and exercise more\" isn't technically wrong, but they're an asshole and have no idea about the complexities of the situation.\n\nWhen a human body and brain acclimatizes to being obese, it seems to somehow reset the brain into thinking that is the normal state. So when people start to diet and exercise, the brain starts screaming for more calories and slashes energy expenditure as much as it can.\n\nSo a man who used to be obese can sometimes have to subsist on a full meal *less* a day than a man who has never been obese, all while his brain is screaming for more calories. Very few people have the mental fortitude to actually bear up under such an onslaught and maintain a lifestyle change. \n\nEither way, fat acceptance isn't about encouraging people to be fat or enabling them. It's about accepting them for who they are and not hating them for being fat. Most fat people suffer quite a lot trying to get rid of the weight, and they also have major problems with finding desirable partners, and they have issues getting jobs and so on.\n\nIt's not like being fat is great fun for anyone really. Fat people don't need to be treated like shit on top of having hard to control health issues.",
            "title_similarity": "0.8625399",
            "sentiment_compound": 0.7223
        },
        {
            "id": "h8dnnh8",
            "score": 1,
            "text": "This post has been temporarily locked due to the volume of comments overwhelming the mod team.",
            "title_similarity": "0.6144637",
            "sentiment_compound": 0.0
        }
    ]
}