{
    "CMV: Businesses struggling to hire minimum wage help is actually capitalism working as intended.\nA true capitalist economy creates wage growth through very, very low unemployment. When businesses struggle to hire or retain employees because there are better options elsewhere, then their only options are to make the job more attractive through wages or incentives, or go out of business. \n\nIn our case the cause is different, but the effect is the same.\n\nThe current environment where places are unable to hire help at minimum wage is actually going to benefit the lower class. Businesses around the country are now facing a choice: pay more than my competitor down the road and take his employees, or shut the doors. This is exactly what the left has been after all along, only this time, it's being driven naturally.\n\nEdit to add clarification...\nI wasn't very clear with my post above, so I'm adding to it for clarification. My original post remains untouched.\n\nThe point of my post is that very low unemployment will naturally increase wages. This is a result of having less labor in a market than demand for labor. Our current situation is far from natural; it was created by government overreach in shutting down our economy and increasing unemployment benefits. With that said, the end result is the same; there is less labor in the market than demand for labor.\n\nEven with a different cause, the effect (labor shortage) remains the same, and is showing to be a driving factor is a rising wage. Those companies that can remain profitable by increasing their wage have done so. Those that can't are struggling.\n\nWhile the cause of the labor shortage is not natural, the effect of a labor shortage remains unchanged.": [
        {
            "id": "h8p5b0t",
            "score": -1,
            "text": "Half of humanity lives on less than $3.25 per day, even after adjusting for the far lower cost of living in developing countries. Over the past 500 or so years, Europeans and North Americans stole most of their labor and natural resources, invested it over centuries, and now use that wealth to provide social programs such as healthcare and minimum wages to their citizens. They also have set up nearly impermeable borders that block any foreign workers from being able to compete. For example, it's easy to fund the NHS when you steal money from 1.3 billion Indians and distribute that wealth over only 60 million UK citizens. \n\nAnd for the countries that didn't steal natural resources from other people, they exploited their country's natural resources for themselves, and are now blocking others from doing the same. Norway has a significant amount of oil per capita. They sold much of it, and put the proceeds it in the world's largest investment fund. Since they are only distributing it over 5 million people, they are extremely wealthy. Now that they have already made their money, they are pushing impoverished countries not to use fossil fuels to grow, but similarly aren't sharing the profit from when they did the same thing too.\n\nUltimately, the trick is to use violence to control as much land as possible. Then you take as many natural resources as possible. Then you distribute it over the smallest number of people possible.\n\nThis plays out in the US's high minimum wage and strict borders. There are literally billions of people who can fill the jobs that American businesses can't seem to fill. Working just 1 hour at $7.25/hour would pay for at least 2 days of living expenses for 3.9 billion humans.\n\nBut America \"protects\" its least competent workers. A high school dropout in the US can get a job that pays significantly more than a fully trained physician in most countries. In a free market capitalist system, you are paid according to the supply and demand for your skills. It's like how a sports team is ranked in a league according to their skills. But we have a system where anyone who can do the same job better or for cheaper (provide more value per dollar) is blocked from taking that job. It's like a sports team that can vote to block every team that can beat them from playing.\n\nThis is especially absurd because we still have this system indirectly. Americans buy most of their products from impoverished people in Asia. It's no different from buying products from impoverished people in the US. The only difference is that now we also have to burn a bunch of fossil fuels to ship the product around the world too.\n\nAmerican businesses struggling to hire workers when literally billions of humans are unemployed is outrageous and a complete transgression of free market capitalism. It greatly harms the descendants of colonialism/slavery and greatly benefits the children of colonists/slave owners. But that latter group has political power in rich countries. Democrats and Republicans alike vote to block immigration and prop up social safety nets.\n\nIf your version of helping the poor is taxing billionaires and giving to yourself via a $15/hour minimum wage (which puts you in the top 1% of humanity), you're an immoral, selfish person. If your version is to tax billionaires and yourself, and give to the 10% of humans who can't even afford toilets, you're in rare company.\n\n99% of humans earn less than $15/hour. 84% of humans earn less than $7.25/hour. 50% of humans live on less than 3.25/day. 10% of humans live on less than $2/day and have to poop in the street. A homeless person in the US has 4 times the carbon footprint of an average human. All of these figures are adjusted for cost of living.",
            "title_similarity": "0.72403944",
            "sentiment_compound": 0.4888
        },
        {
            "id": "h8opt9a",
            "score": 26,
            "text": "It’s happening naturally? It’s natural for the government to shut down the economy and pay everyone not to work? The government is giving incentives that no employer can give. Don’t work and get paid.\n\nPlease explain how it’s going to help the lower class. Yes it is exactly what the left wants and why they continue to try and keep economy’s closed.",
            "title_similarity": "0.7727356",
            "sentiment_compound": 0.8577
        },
        {
            "id": "h8opfb3",
            "score": 0,
            "text": "The reason they are struggling is not through competition of other businesses, but that the government has made it more lucrative to not work by continuing to enhance unemployment benefits.  Not only that, but the reckless spending has caused extreme inflation which has raised costs for businesses as well.\n\nWhen enhanced UI benefits end, the leeches and roaches will come out and beg for jobs.",
            "title_similarity": "0.88420117",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h8otcdz",
            "score": 1,
            "text": "Allow land lords to evict and out unemployment back to normal and everyone will go back I work. The problem is government interfering. That's kinda the opposite of capitalism",
            "title_similarity": "0.6883366",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8oqmd1",
            "score": 818,
            "text": "The issue is thats true when its done by other businesses. When the alternative is government handouts, thats not capitalism.",
            "title_similarity": "0.6927217",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8oq2iq",
            "score": 65,
            "text": "[removed]",
            "title_similarity": "-0.016305145"
        },
        {
            "id": "h8os09c",
            "score": 33,
            "text": "The lack of work force is due to the government paying unemployment, including the extra benefits on top of it. Why work minimum wage when you can make more sitting at home? That’s not capitalism.",
            "title_similarity": "0.79960823",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h8p41dk",
            "score": 0,
            "text": "Capitalism is based on a free market. Dumping cash into the hands of people who can then choose not to work while living on other people's money that is taken from workers is pretty much the opposite of a free market. This is socialism, manipulating the market using worker's money.",
            "title_similarity": "0.7804924",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h8pbmn6",
            "score": 0,
            "text": "Everyone in this comment section saying increased unemployment benefits are the cause of this “labor shortage” (not really a labor shortage, employers that pay well are doing fine) are ignoring a number of very important factors. \n\n1. A freaking global pandemic happened and is still happening. It wasn’t just some spur of the moment “hey let’s give people handouts for no reason” decision \n\n2. Unemployment benefits only apply in very specific circumstances, like when you’re laid off or fired without cause. You can’t quit your shitty job and make more on unemployment. You won’t get any. \n\n3. There’s a ton of evidence that the unemployment benefits aren’t the problem (if there even is actually a problem)\n\n[Here’s a Forbes article from a person smarter than me](https://www.forbes.com/sites/shaharziv/2021/05/11/heres-why-300-a-week-unemployment-benefits-arent-driving-worker-shortages/)",
            "title_similarity": "0.8102554",
            "sentiment_compound": -0.9311
        },
        {
            "id": "h8ouspl",
            "score": 11,
            "text": "As noted elsewhere, there are government-related reasons. The problem we face is that capitalism can't work as intended because of unemployment benefits and eviction moratoriums because we've decided as a society that it's not acceptable to let people go homeless or starve on a mass scale. Same with providing medical assistance to those that can't pay for it. Without those things happening, there's a limit to the amount of pressure that can be put on wage growth.\n\nIt's important to note what the word \"naturally\" means here. Wage growth in a completely capitalist society would be pushed by the balance between not wanting to starve to death or be homeless and wanting to earn more. Capitalism is amoral, so society has developed morals like deciding how many people it's ok to let go hungry or not have a home. If that number is lower than the market would allow, wage growth won't be driven by capitalism entirely.",
            "title_similarity": "0.8241437",
            "sentiment_compound": -0.5891
        },
        {
            "id": "h8p5gz4",
            "score": 1,
            "text": "You're confusing short run effects and long run effects and getting confused about nominal vs. real. In the short run a shortage of labor will increase real wages (i.e. you can actually buy more goods) but in the long run there will be a general equilibrium and real wages will not be higher but there will be a higher nominal wage (i.e. Y will come back to equal Y). The way to increase real wages in the long run is through productivity growth.",
            "title_similarity": "0.8181525",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h8pt2o2",
            "score": 1,
            "text": "The government giving people money isn't capitalism.",
            "title_similarity": "0.49136052",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8ox6bg",
            "score": 90,
            "text": "It’s not capitalism working as intended. Capitalism is defined as:\n\n“an economic and political system in which a country's trade and industry are controlled by private owners for profit, rather than by the state.”\n\nYet the government is paying everyone to stay home. And keeping them from being kicked out of their houses.",
            "title_similarity": "0.7403687",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8op60v",
            "score": 9,
            "text": "What happens when the extra unemployment benefits that have been instituted for Covid-19 end?  \n\n\nI don't entirely disagree with your assessment. I do think that capitalism has a pretty good built in model to self correct for these things.\n\nBut these are not usual circumstance. The employers know eventually all this Zimbabwe money is going to run out (google Zimbabwe hyperinflation to get the reference). People are going to come back begging for these jobs they are scoffing at now.",
            "title_similarity": "0.86080647",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h8qllfn",
            "score": 4,
            "text": "This is the exact opposite of capitalism which I can easily demonstrate. Using UI to compete with wage growth is really unhealthy and I personally believe that it's part of a progressive agenda to float UBI and $15 minimum wage.\n\nBc in this system we're getting inflationary trajectory with real deflationary pressures. Deflation is far more dangerous then inflation and is the sort of thing that causes depressions not recessions. There was a lot of liquidity before the great depression also.\n\nIf people don't want to work, supply increases bc of work load efficiencies relative to supply demand. In simple terms there becomes a supply glut. Products are produced, no one is buying bc there's no demand bc there's not enough labor. If labor is choosing to let their skills deteriorate the problem compounds.\n\nLet's be clear, It's not that I don't want to see people have more money in their pockets, on the contrary I want to see everyone happy, it's that all value is being lost. I don't think progressives are wrong that the wealth inequality isn't an issue or that corporate socialism is a good thing. I think they're very wrong on the approach.\n\nWhat is the point of all this free money? So people can afford more cheap shit at Walmart? Get a little breathing room on rent and bills even tho they're progressively getting much more expensive?\n\nRemember that corporate socialism thing? Well the fed is borrowing money at lower mortgage rates then individuals to large investment firms so they can buy up existing housing stock. That's raising the price of home ownership and rentals.\n\nFederal money is guaranteeing student loans raising the cost of tuition while real wage stagnation has been an issue for decades.\n\nSo again what's the point of stimulus if value is lost?\n\nBut that speaks to the point: socialism implies government control, corporate socialism is no different and is being executed by politicians who are generally inept even if they're well intentioned. All it's doing is making the wealthy wealthier at the expense of the poor and middle class.\n\n2020 saw the largest transfer of wealth to the .1% in history. That's not good.\n\nIt is taxpayers who will eventually fund this, somehow some way, it has to be paid for with with taxes, higher interest rates or more efficient productivity to give America more advantage.",
            "title_similarity": "0.82499754",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h8pdelu",
            "score": -2,
            "text": "This is exactly why we shouldn’t have a minimum wage, it removes the ability to negotiate and removes jobs entirely from the economy. Nobody is going to pay anyone but teenagers and illegal migrants for berry picking for example because it’s simply unfeasible to pay $15+ per hour for such a task",
            "title_similarity": "0.6561578",
            "sentiment_compound": -0.7227
        },
        {
            "id": "h8or33m",
            "score": 403,
            "text": ">This is exactly what the left has been after all along, only this time, it's being driven naturally.\n\nOnly it has not occurred naturally.  [The average unemployment benefit and $300 supplement exceed the weekly minimum wage in every US state.](https://www.businessinsider.com/unemployment-benefits-versus-average-wages-across-the-us-2021-5)  Our increased wages are not the result of market forces, it is the result of government intervention, which comes with it's own set of consequences (increased prices, inflation, stagflation down the road?, etc...).",
            "title_similarity": "0.763906",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8ovnys",
            "score": 37,
            "text": "https://en.wikipedia.org/wiki/Reserve_army_of_labour\n\n>When businesses struggle to hire or retain employees because there are better options elsewhere, then their only options are to make the job more attractive through wages or incentives, or go out of business. \n\nThat Karl Marx guy thought capitalism was going to have cycles of economic booms that turn into bubbles of bad investment and then crashes and unemployment that lowers labor costs enough for another boom.\n\nWhen wages are high, big businesses spend money on machines, like McDonald's buying touch screens, small companies can't afford to do that and go bankrupt in the crash, and their business gets taken by the big businesses. Then the next cycle pay goes up again, but the machines haven't gone away. So workers have less leverage since the company can get away with overworking a smaller number of employees with the help of the machines without hurting their business as much. So wages still go up but much less than productivity did.\n\nSo minimum wage workers end up surrounded by massive amounts of cheap mass produced stuff but can't pay rent.",
            "title_similarity": "0.89899886",
            "sentiment_compound": 0.6517
        },
        {
            "id": "h8op19n",
            "score": 3,
            "text": "    Businesses around the country are now facing a choice: pay more than my competitor down the road and take his employees, or shut the doors.\n\nThese aren't the only choices. They also have the option of moving to a state or country with more cheap labor or automating. It depends on the business of course but the more expensive labor becomes and the better technology gets the more attractive automation becomes.",
            "title_similarity": "0.87164414",
            "sentiment_compound": 0.8376
        },
        {
            "id": "h8pl3ls",
            "score": 0,
            "text": "This isn’t gonna help the lower class, it’s just going to encourage businesses to pay ever so slightly more to keep their dmployees in the wagie cagie",
            "title_similarity": "0.8445837",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h8plk7m",
            "score": 0,
            "text": "The left shouldn’t get any pats on the back for this but you’re not wrong.",
            "title_similarity": "0.4221358",
            "sentiment_compound": 0.5157
        },
        {
            "id": "h8pveu8",
            "score": 0,
            "text": "People only believe in capitalism when it's fucking the little guy. I consider this part of semi-free markets working.",
            "title_similarity": "0.73060405",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pzyrw",
            "score": 0,
            "text": "Ah so the current, shitty system that benefits a small percentage of the population is working exactly as intended? Good to know. Guess I’ll be happy for a $11/hour job with no chance of upward mobility now.",
            "title_similarity": "0.77143836",
            "sentiment_compound": 0.5568
        },
        {
            "id": "h8qaked",
            "score": 0,
            "text": "Good all these low balling rich fucks can get fucked.  One less ivory back scratcher I guess this year asshole.",
            "title_similarity": "0.60006297",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8qit4e",
            "score": 0,
            "text": "Because these businesses, corporations, and owners only like capitalism when it works for them.  That's why they're the only ones complaining about a \"labor shortage\"; acting like they \"deserve\" employees.\n\nSimple as that, the tables have momentarily turned on the people who normally benefit from capitalism.",
            "title_similarity": "0.88207567",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h8qmshs",
            "score": 0,
            "text": "This is accurate.   Capitalism is just an economic mechanism of balance and maximizing market efficiency.    Yes, the unemployment boost in income is artificial,....but ALL of the factors in the market are artificial.    Government mandated taxes, benefits, identification, closed borders, intellectual property, trademark law, the concept of unreal property, corporate entities...etc.    it is ALL artificial.\n\n\nCapitalism is the maximization of efficiency in a market due to infinitesimal small and multiple actors acting independently.\n\n\nYes.   This is literally Capitalism working.",
            "title_similarity": "0.83244216",
            "sentiment_compound": 0.9337
        },
        {
            "id": "h8qmvcb",
            "score": 0,
            "text": "No it's not. \n\n- Government won't act in order for it to relieve the pent up pressures of the worker shorter, if there were stronger Unions & wage laws in place it would prevent what we see happening.\n\nTheir lack of intervention & wage suppression is causing workers to revolt.",
            "title_similarity": "0.6950652",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8qv8xh",
            "score": 0,
            "text": "While you make a good point with wages, I disagree with your assessment about government overreach and extra benefits. This labor shortage has been a long time coming, the shutdown and benefits finally tipped the scales for lower-class working folks to put their foot down on poor wages and working conditions (not to mention power-tripping management).\nThere was no overreach with the shutdown, and the fact that it wasn't a harder shutdown made the economic situation worse, as well as an incompetent government who was more focused on themselves rather than doing their jobs.\nTl:Dr, pay people better, if minimum wage followed inflation, the wage would be $22-24/hr. Stop making excuses for businesses to pay less.",
            "title_similarity": "0.86344445",
            "sentiment_compound": -0.4779
        },
        {
            "id": "h8qwr96",
            "score": 0,
            "text": "I feel like raising the minimum wage would solve a lot of the same problems with less government spending",
            "title_similarity": "0.77653587",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8r2hrn",
            "score": 0,
            "text": "A high minimum wage benefits large corporations..... which is probably better than being stuck working for your local Karen",
            "title_similarity": "0.78558445",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8rdp5a",
            "score": 0,
            "text": "People only want capitalism when it suits them. I will give an example of what happens in my own party especially with the National party (Farmers party).\n\nWhenever they have a good season they want minimal tax (no tax) and minimal govenment intervention. As soon as a drought,Flood anything they are the first to put their hand out.\n\nThe farmers here too get foreign workers and treat them like crap pay them little then charge exorbitant amount in rent. They're argument is they can't attract local workers. \n\nPeople only want capitalism when it suits them.",
            "title_similarity": "0.8000563",
            "sentiment_compound": 0.9134
        },
        {
            "id": "h8rmm7a",
            "score": 0,
            "text": "Our shortage is not from unemployment benefits, it's from over 6 million boomers retiring.",
            "title_similarity": "0.6052054",
            "sentiment_compound": -0.1969
        },
        {
            "id": "h8pahc6",
            "score": 67,
            "text": "You can't really reference\n>True capitalism\n\nThen pick a mechanism that isn't part of a free market to demonstrate how capitalism is working. \n\nThis is more a matter of people understanding basic arithmetic. Individual 'A' can make more money through unemployment than they could working a full time job because of legislated bonuses to unemployment. \n\nThat's it. Even if an individual could make marginally more by going back to work the expenses incurred by working may outweigh the benefit of additional income. \n\nThis has nothing to do with market forces or capitalism. It's bad policy, plain and simple. If at some point you find an employer that will pay people significant amounts, in some states unemployment can top 6 figures with the current bonuses, spread the word. \n\nYour premise isn't valid because the above situation is never going to happen... Arguing that the market would react the same way to a situation the market would never create is an interesting thought process.",
            "title_similarity": "0.8811071",
            "sentiment_compound": -0.0096
        },
        {
            "id": "h8p5u7v",
            "score": 6,
            "text": "You aren't incorrect, but part of the issue at hand is that many businesses already have a low profit margin. Increasing wages will often (though certainly not always) necessarily increase the consumer-facing prices. \n\nWhile there is nothing wrong with this in and of itself, it doesn't pair well with the mass production of mega corporations. The prices are brought so low at times with such thin margins that no non-corporate competitor can break in.\n\nAn uncomfortable truth for both Capitalists and Communists is that our consumer-driven culture spends far too little on goods.",
            "title_similarity": "0.87314737",
            "sentiment_compound": 0.341
        },
        {
            "id": "h8oqkop",
            "score": 1,
            "text": "It depends on what definition of the word \"working\" you're going for here\n\nIs it capitalism's market forces in action? Pretty much, sure\n\nIs it capitalism being successful? Not really, and also that'll depend greatly on who you're asking",
            "title_similarity": "0.78603053",
            "sentiment_compound": 0.8645
        },
        {
            "id": "h8ovbd8",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.016305145"
        },
        {
            "id": "h8p5f6m",
            "score": 1,
            "text": "But capitalism isn’t giving $1200 of borrowed cash from the government to people every month when many aren’t effected or have the covid vaccine now.",
            "title_similarity": "0.5803486",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8p5tby",
            "score": 1,
            "text": "If employees are refusing minimum wage jobs because competing companies are offering higher wages, that's capitalism. \n\nIf employees are refusing minimum wage jobs because they are relying on government unemployment aid as an alternative, that's socialism.",
            "title_similarity": "0.8689828",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h8pate1",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0064680353"
        },
        {
            "id": "h8pez2p",
            "score": 1,
            "text": "I agree with you mostly, but I'll push back a little. \n\nI think it's absolutely a tenet of free market capitalism (the kind of capitalism I'm talking about from here on out) that businesses failing is as important as businesses succeeding. It helps the economy know what is and isn't important, and helps things get done better over time. \n\nHowever, government intervention can warp that. If the government bails out businesses, the businesses don't have the incentives to improve as they would if they were able to fail. America is a country without a purely free market, and a lot of problems we associate with \"capitalism\" are often caused by aspects of the society that aren't free market (like healthcare, but that's another rant).\n\nMinimum wage is a tradeoff, and it should be understood as such. It makes it harder for unskilled labor to find their way into the job market, and incentivizes businesses to switch to ways of going things that require less labor, removing jobs. It also tends to hurt minorities more than non-minorities. It's also essentially a government restriction on free trade. It's saying \"you aren't allowed to sell your labor at any less than X amount, whether you want to or not.\" This means that minimum wage doesn't really belong in true free market capitalism. \n\nI would agree with your point if you amended it to mean \"businesses struggling to hire people is working as capitalism intended\", but I don't think that having minimum wages makes it true free market capitalism.",
            "title_similarity": "0.8799617",
            "sentiment_compound": 0.7679
        },
        {
            "id": "h8q5129",
            "score": 1,
            "text": "Yep, others have said it but I have to pile on.\n\nGovernment paying people to not work isn't capitalism. And there is nothing \"natural\" about that.",
            "title_similarity": "0.6139213",
            "sentiment_compound": -0.2651
        },
        {
            "id": "h8qgg1v",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0064680353"
        },
        {
            "id": "h8qk051",
            "score": 1,
            "text": "I would argue the goal of capitalism is to funnel as much money to the top as possible while paying workers as low a wage as possible. Through that lens I don’t think capitalism is working as intended.",
            "title_similarity": "0.8556912",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8r5vtj",
            "score": 1,
            "text": "If not for the pandemic and eviction moratorium this labor shortage would have never been feasible on the scale it is now.",
            "title_similarity": "0.6249242",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h8oqw7i",
            "score": 228,
            "text": ">it's being driven naturally.\n\nNot really.  Things like eviction moratoriums and extra unemployment are a factor.\n\nIn 2019 if you made $10 hour and lost your job.  And you had rent and are offered another $10 hour job, you would take it.  Your bills don't care and it is better than the $250 you get for unemployment.  Now, you know you can't be evicted, and your unemployment has an extra $300.  So the need to find a job is less urgent.  You can hold out for at least $14-15 and hour because you have your unemployment.  \n\nNow later this year or next year when unemployment is back to normal levels and you can be evicted, wages very like will pull back for many jobs. Once the applications start increasing they will hire new people at closer to the previous rates.",
            "title_similarity": "0.79365206",
            "sentiment_compound": -0.9502
        },
        {
            "id": "h8pf9ic",
            "score": 2,
            "text": "Labor shortage due to government handouts leads to increased costs to businesses.  Businesses then have to increase prices.  This increases the cost of living.  The result is people getting paid more as cost of living increases.  People's purchasing power remains stagnant.",
            "title_similarity": "0.84471214",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8qx9ig",
            "score": 2,
            "text": "Some industries need unions... others dont... stop being fucking idiots. Rarely does any solution come in a one size fits all package...",
            "title_similarity": "0.6128901",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h8pvcxz",
            "score": 4,
            "text": "Unfortunately this was caused by government intervention. So in this case it is not capitalism at work.",
            "title_similarity": "0.45843357",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8p08vk",
            "score": 2,
            "text": "The problem with see that there is private sector and public sector. If pay goes up in the private sector, due to capitalism, the public sector may be drained out of employees. Also if they wages go up then all the costs go up in the general economy. Then public sector pay is regulated by local/federal government so they will lag in wages increase.",
            "title_similarity": "0.82627976",
            "sentiment_compound": -0.7479
        },
        {
            "id": "h8p31ld",
            "score": 1,
            "text": "There’s also the alternative of consolidating and getting rid of minimum wage jobs via automation. In which case, the reverse of the intent of minimum wage happens.",
            "title_similarity": "0.63764244",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p861b",
            "score": 1,
            "text": "Then it shouldn't work...",
            "title_similarity": "0.07662658",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pakct",
            "score": 4,
            "text": "All capitalism is subject to the specific conditions of tax, regulation, macro econ policy, and subsidies of the government where it is located, to the population in the economy, its geography and history and so on.\n\n\"Capitalism working\" is a judgment call based on what outcomes you are targeting when you design that system. \n\nWhile the situation may be good for workers in forcing wages to rise, it may also serve as a hit on small businesses who are the least agile to react to major changes in the economy. If small businesses get killed off, we have an economy run by corporations, rather than your neighbors. Once the small businesses are killed, the government can just reverse the unemployment benefits and the wages can drop to a natural level. That gives us the worst of both worlds.",
            "title_similarity": "0.81182754",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h8pbfuj",
            "score": 1,
            "text": "But au contraire: we need an army of the unemployed to keep prices of labor down. What kind of capitalism is yours? Are you a commie?",
            "title_similarity": "0.7374894",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pefvy",
            "score": 1,
            "text": "The way capitalism suppose to work is that these labors would be where they are most productive. They are not right now.",
            "title_similarity": "0.7835752",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ph7y6",
            "score": 1,
            "text": "Unemployment was 3.5% in February 2020, but nobody was increasing wages then.\n\nTarget announced its increase in June 2020, when unemployment was around 11%.  Other companies started following suit.  Walmart announced its increase in February 2021, when unemployment was around 6%.\n\nSo before we even get to capitalism, I guess I'm confused how you are justifying a relationship between low unemployment and wage increases at all, when clearly it was the *opposite*.",
            "title_similarity": "0.64906514",
            "sentiment_compound": -0.8641
        },
        {
            "id": "h8pirn3",
            "score": 2,
            "text": "exactly, low wage jobs are a drain and should go out of business. people should value their time more and also seek to save money by doing things for themselves instead of paying for a service.",
            "title_similarity": "0.7919756",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8pjcmr",
            "score": 1,
            "text": "We do not live in a capitalist society. We have a hybrid economy that has capitalist elements and socialist elements. Ideally you want balance so the businesses can do what is best for them, and the workers also have their interests protected.\n\nRight now it looks like it's lose-lose for both. Either the government steps in (ie. increase socialist influence, could be bad or good depending on the policies enacted) or wait for a time correction (this is what a capitalist system would do, but grinding through this period is extremely tough on everybody).",
            "title_similarity": "0.854897",
            "sentiment_compound": 0.7193
        },
        {
            "id": "h8pl3sf",
            "score": 1,
            "text": "I guess you could look at it like a failed supply and demand type of deal. High demand for minimum wage workers due to low supply, but a failure to adequately raise pay. Usually businesses would flaunt higher pay to get workers, but that’s not really working",
            "title_similarity": "0.8452863",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h8plosl",
            "score": 3,
            "text": "\" then their only options are to make the job more attractive through wages or incentives, or go out of business.\" There are other option, invest in automation, improve your efficiency to lower labor and send your labor to another country that is not capitalist.  In real life business has no requirement to be philosophically consistent or to play by one economic set of rules.",
            "title_similarity": "0.8131294",
            "sentiment_compound": 0.8357
        },
        {
            "id": "h8plyt3",
            "score": 1,
            "text": "Don’t forget about robot slaves!",
            "title_similarity": "0.288917",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h8pmv2y",
            "score": 2,
            "text": "The idea of the minimum wage is to artificially increase the lowest income so that everyone can afford a certain lifestyle. That's a noble goal. But it has its own costs. \n\nThere are some jobs that need doing that no one wants to do. The free market can only get people to do that work by paying high salaries. But what does a high salary mean? It means a salary that is higher than what you can get from most jobs. People will tolerate awful jobs if they know they get paid more. In other words a high wage is a relative amount not an absolute amount.\n\nRaising the minimum wage simply makes many desirable jobs more desirable and many undesirable jobs less desirable. \n\nA lot of existing industries are also built on top of the unregulated market. Think of neighborhood babysitting. Asking your friend to take care of your kid while you are away for example, if you don't pay him/her market rate for his/her time, and you don't report that economic activity to the IRS that's basically black market work.  It's unregulated.\n\nIn general a minimum wage job is a good job. It's a job that can pay for all your basic needs. It can pay for low cost housing rental, cheap food, and utilities. \n\nOf course this isn't always true and plenty of minimum wage earners struggle to make ends meet. But that's because they are at the bottom of the economic pyramid. Every job or business that empowers you to pay for all your needs is built on top of jobs that doesn't pay quite as well. \n\nThink of the baby sitting example. The reason you can go out and work for pennies is because you can pay your neighbor even less (or nothing) to take care of your kids. The reason you don't starve is because someone out there is making less than you to make food cheap enough that you can buy it with your tiny wage.\n\nThe economy is a pyramid of exploitation. It's easy to fall into the trap and think you are at the bottom and it doesn't get any worse but it does. \n\nIf farmers didn't use illegal immigrants to grow their fruits then minimum wage earners would be able to afford fresh fruit. \n\nIncreasing the minimum wage would\n1) disrupt a lot of industries and jobs\n2) push a lot of regulated jobs to become unregulated and pay less then minimum.\n\nThat doesnt mean that wages shouldn't be raised in all cases. I'm against wholesale increases but industry or company targeted wage increases I'm in favor of.\n\nCompanies that are actually capable of raising salaries are monopolistic companies. Those that are dominant over a particular economic segment that face no competition can afford to raise wages because they dictate the price of their services. \n\nBut if you are a mom and pop store or a local restaurant, your price has to be inline with the store next door or you'll go out of business (and take your jobs down with you)\n\nIf the govt can target which industries are monopolistic, they can improve pay for a lot of people without causing any disruption.",
            "title_similarity": "0.89144266",
            "sentiment_compound": 0.9873
        },
        {
            "id": "h8ppn4f",
            "score": 2,
            "text": "This is just a short-term situation. The market rewards companies who pay the least for their work. Once the government decides it’s too expensive to pay out benefits, a lot of people will be back to gig work, multiple jobs and sub-payed, subcontracting “self-employment” to stay afloat.",
            "title_similarity": "0.9020965",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h8pq6tg",
            "score": 2,
            "text": "I dont think its \"capitalism working as intended\". But it is, atleast temporarily, a free and voluntary labor market. Without the \"work or starve\" incentive structure, workers have more power and leverage than any time in recent history.",
            "title_similarity": "0.7756097",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h8ps30w",
            "score": 2,
            "text": "This isn’t even accurate to today’s issue. Workers aren’t working for minimum wage because the government is paying them more to stay at home on unemployment. Your idea is very sound though, just not applicable to today’s situation in America.",
            "title_similarity": "0.7790278",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8pv7jx",
            "score": 2,
            "text": "You're confusing the definition of capitalism and free market. Businesses struggling to hire minimum wage help is *the free market* working as intended.",
            "title_similarity": "0.86955464",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8pvb8j",
            "score": 2,
            "text": "So you’re admitting that the objective of the left is to shut down small businesses… you judge the capitalistic worth of a company based on its ability to pay an artificially determined wage decided by a government lobbied by only the largest companies. So basically companies like Amazon and Walmart get to decide which small businesses should survive. Any artificial creation of big business and big government is not capitalism working as intended and is good for neither the worker nor the entrepreneur. It serves people like Bezos who can put competition out of business at a mass scale and leftists who brag about higher wages which few workers actually benefit from.",
            "title_similarity": "0.872802",
            "sentiment_compound": 0.9529
        },
        {
            "id": "h8pwpg0",
            "score": 1,
            "text": "Most people aren't working because they get equal or better pay through government benefits so it's not capitalism.\n\nThe issue with minimum wage was that there was a surplus of people looking for work vs work available and that is still the case now.\n\nFor those situations, people are forced to take what they can get, but covid has allowed many of these people to subsist on enhanced unemployment. Combine this with the eviction moratorium allowing these people to not pay rent, and you end up in a situation where they have no motivation to seek work when they could be making almost the same being unemployed.\n\nSo long as unemployment provides close to the same pay as minimum wage, there is no incentive to work for minimum wage. I can get paid doing work, or I can get paid doing nothing. It's natural for people to want to choose the latter.\n\nAgain, if not for government intervention, we would not be here so it's almost the opposite of capitalism, however I also believe government involvement is needed for capitalism to function in a healthy way to prevent anti competitive practices like monopolies.",
            "title_similarity": "0.87194836",
            "sentiment_compound": -0.9199
        },
        {
            "id": "h8pz4fl",
            "score": 1,
            "text": "The problem with your view is that these businesses have been subsidized indirectly through necessary welfare help and programs. People can’t conceivably make minimum wage and survive on its own, and companies will game the system accordingly to keep their wages low. This is not to say that it’s the government subsidies that have caused this, rather it’s businesses that would pay less given the chance. This is precisely the reason we need minimum wage laws, and I’d add to that pricing standards and percentage-return guidelines to stockholders and corporate officials, because people can’t just wait for the market to correct, it could be the difference between having food on the table or not. The market *may* correct, but without hard rules of play there’s nothing to stop companies from letting these better-paid people go and hiring people who are just as desperate as before and pay them jack shit again.",
            "title_similarity": "0.8596264",
            "sentiment_compound": -0.6067
        },
        {
            "id": "h8q2dgl",
            "score": 1,
            "text": "Until we let the company’s fail that can’t maintain a profit margin by bailing out the massive fuck ups then it’s never going to matter. \n\nCapitalism only exists when markets are flush or companies are small.\n\nSource- Wall Street, the air line industry, etc etc.",
            "title_similarity": "0.78260446",
            "sentiment_compound": -0.6339
        },
        {
            "id": "h8q2p3m",
            "score": 1,
            "text": "Your premise is inherently flawed because it assumes both a set idea for what 'capitalism' is and what 'working as intended' is.\n\nGenerally, Economists don't use the work capitalism because it means completely different things to different people (see e.g. discussion [here](https://www.reddit.com/r/AskEconomics/comments/96jlkt/what_exactly_is_capitalism_anyway/) and [here](https://www.reddit.com/r/AskEconomics/comments/96jlkt/what_exactly_is_capitalism_anyway/), and [here](https://www.reddit.com/r/AskEconomics/comments/eewr6w/why_is_it_that_economists_tend_to_not_like_the/), and lastly [here](https://www.reddit.com/r/AskEconomics/comments/hrkvoe/what_are_economists_take_on_capitalism_and/), if you're interested). Some may see capitalism as moving market forces, or private ownership vs. state ownership, or free-trade, or minimized governmental intervention. If we take that last one, for example, your point doesn't hold. \n\n*Intent* then supposes, well, intention. Not only were (relatively) free labour markets not 'created' overnight, they definitely weren't created with a set number of purposes in mind. They developed because they suited the institutional and economic context of the time. Nobody 'created' thinking 'now I've created this, surely wages must go up as supply goes down'.\n\n\nThe rest of your argument seems to hold. But really, the sole point you then make is that *labour markets* respond *as expected*. That this is either *capitalism* or *intent* isn't true.",
            "title_similarity": "0.710882",
            "sentiment_compound": 0.2958
        },
        {
            "id": "h8q2r3g",
            "score": 1,
            "text": "I have to open a restaurant at 4 a.m., but I love this topic. \n\nI’m going to drop this link so someone will hopefully learn something. \n\n[reserve army of labor](https://en.m.wikipedia.org/wiki/Reserve_army_of_labour)",
            "title_similarity": "0.4968691",
            "sentiment_compound": 0.844
        },
        {
            "id": "h8q2smg",
            "score": 2,
            "text": "But there aren't better JOBS elsewhere. The people that would be filling these low wage jobs are living off of government subsidies. This isn't true free market capitalism when millions of people are living off of government handouts",
            "title_similarity": "0.781276",
            "sentiment_compound": -0.9064
        },
        {
            "id": "h8q3fix",
            "score": 2,
            "text": "The wage increase only happened because of government intervention. Upping unemployment gave people an option between \"work for $7.25\" or \"be completely financially destroyed.\"\n\nThere seems to be some tension in the stated belief of \"LOOK AT WHAT CAPITALISM DID...but just ignore that it was sparked into action by the positive pressure of socialist policies.\"",
            "title_similarity": "0.84577584",
            "sentiment_compound": -0.7564
        },
        {
            "id": "h8q5h5d",
            "score": 1,
            "text": "I can't say you're wrong overall, it's just a bit of a sting to hear \"capitalism working as intended\" and \"created by government overreach\" within the same post. I can can see, you can see, that is the case, and by implication that government overreach isn't capitalism and so our current situation isn't \"capitalism working as intended\"... and thus the premise of the question is void?\n\nHowever, the salient point is, regardless of cause, we are undeniably in the situation we are in and it will put a lot of us out of business if we can not react to this new labour market. A market in which all functions/events/parties have had to be postponed and so now demand is higher than ever - all labour markets which have traditionally relied upon the \"temporary\" labour of 16-18 year olds as nobody is holding those events Sunday-Thursday, and no adult can pay their bills on less than 30+ hours a week. In the past that hasn't been too difficult because those 16-18 year olds have always wanted a bit of extra money for make-up, phone bills, xbox games, weed, whatever kids spend their money on these days and have been limited to that part-time economy where nobody would take a 16yr old with no experience on minimum wage instead of the 21yr old who has the added benefit of experience and incentive of paying bills and they're also willing to work for minimum wage because they can't afford to not work.\n\nWe've been discussing what we can do to make things more attractive and we've all realised it's not just the money (we've always paid more than minimum. Not by a lot until now, granted). We've been giving 20-40% more pay increases over what we would have 18 months ago, and advertising new positions at 50% more - but non of us are getting the number/quality of applicants to think that's really making a difference. The real difference, I think, is people have had a year off work, at 80% of their wage, realised they can live quite happily at that and not want to work for the extra 20/40/whatever% we can offer them! And the real problem that's put us in is the quality of work-life for our employees is diminished because of the shortage! I've lost 40% of my workforce in the last 3 weeks! 1 left because she wanted these particular 4 days holiday. No problem. Another girl can actually only work the 2 days the other one could that particular week - so of course I gave her her regular 2 shifts and had to call on everyone else to cover those 4 days. Cue holiday girl leaving because she didn't get any shifts that week and another leaving because I gave her \"too many\" shifts that week?! What was I supposed to do? Not give the girl who wasn't on holiday zero shifts and have her leave because somebody else was taking holiday?! And not give that girl those extra 2 shifts because she was on holiday the week before and other people had had to cover her shifts the previous week! Fuck sake! You take holiday that means you get no shifts that week and extra the week after! We're in a spiralling nightmare right now because as they drop, obviously it means the few which are left have to cover more and more, and I really don't know what to do about it! Paying extra just doesn't seem to do it - I just can't find anybody who is able to do the job who is also willing to do the job, regardless of wage!",
            "title_similarity": "0.74024194",
            "sentiment_compound": 0.919
        },
        {
            "id": "h8q5wq2",
            "score": 1,
            "text": "Bringing me back to macro economics",
            "title_similarity": "0.39274758",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qdvae",
            "score": 2,
            "text": "What your saying would be true if the free market determined minimum wage, however, the people deciding minimum wage just pick a random number they think people will be happy with based on absolutely nothing from reality and say, \"Look what i did!\"",
            "title_similarity": "0.771309",
            "sentiment_compound": 0.9151
        },
        {
            "id": "h8qe7g9",
            "score": 1,
            "text": "Capitalism is private ownership of capital.\n\nI think that what you mean is:\n\n>Businesses struggling to hire minimum wage help is actually *the free market* working as intended.\n\nNow, if I am correct that this is what you intended, then my only argument is that \"the free market\" is merely an abstraction used by economist to help explain economics.  In the real world, there is no such thing as a true free market.  The free market is to economics what a frictionless surface in a vacuum is to physics.",
            "title_similarity": "0.7786294",
            "sentiment_compound": 0.9313
        },
        {
            "id": "h8qgy5n",
            "score": 3,
            "text": "Most people are missing the actually hole here and are going for the low hanging fruit.\n\n&#x200B;\n\nPeople keep bringing up that \"Its not natural and thats the issue\", but they arent explaining the issue with it being unnatural.\n\n&#x200B;\n\nWhen you have a shortage of a good or a service, that means that there isn't enough for it to go around, naturally. So when you force a labor shortage like we have, what will end up happening is, yeah, businesses need to start paying their workers more, as you said. But also, the products in play become more expensive. How else will the businesses afford to pay their workers higher wages? \n\n&#x200B;\n\nOn top of this, not only does the product become more expensive, but people DONT wanna pay that amount. So their is less demand for the products in question, leading the businesses to run out of money, leading to less jobs and less opportunity to work, and less of a product.\n\n&#x200B;\n\nIn the end, well, it depends on your goal then. Its possible that a shortage like this could lead to a food shortage and a larger class divide. If food price doubles because businesses have to pay their workers more, whos gonna be effected? It would sure as hell cause millions to go malnourished than before. This gives even less class mobility than we already have, because if you are struggling to find your next meal, you won't be able to build up any sort of equity. \n\n&#x200B;\n\nHowever, the question is how hard will this specific shortage and change in pricing effect the market. Someone more versed in the subject would have to give you an actual prediction, but keep in mind that my explanation in the previous paragraph is 100% something that could happen, and might happen, from just giving people money directly without properly considering the impact.\n\n&#x200B;\n\nAt the end of the day, ye, this is a very interesting case study of capitalism in action. But don't just assume that capitalism at its nature will always work itself out. It doesn't, just like any other system, and we need to have a discussion and think out the possibilities before just assuming it will immediately work out.",
            "title_similarity": "0.78515375",
            "sentiment_compound": 0.6113
        },
        {
            "id": "h8qhi39",
            "score": 1,
            "text": "I'm having a hard time not drawing comparisons to sacrificing virgins for a bumper harvest. How many people must endlessly suffer low pay before the economic gods are satisfied and reward the rest of us peasants with a marginally higher wage?",
            "title_similarity": "0.7926476",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8qi3wc",
            "score": 1,
            "text": "While I agree people should be paid more for they're labor the problem is the consequences when doing so.\n\nThe problem is business aren't going to eat the cost of higher wages, the consumer will. \n\nSay a fast food restaurant sell a burger for 5$ and pay they're employees 14$ hr. But now with the current labor market they raise their wages to 16$ hr just to get employees in. That burger now costs 5.50 to compensate for the higher wages. The business is still making the same amount of money. (Or even more)\n\nBusiness could also devalue your buying power by overcompensating. Say your wages go up by 10% but the price of groceries gos up by 12%. You just lost 2% of your income. It's a slippery slope.\n\nEven still your current saves will be devalued with rising prices.",
            "title_similarity": "0.8051974",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h8qj4wz",
            "score": 1,
            "text": "Now explain F-2 Visas where jobs are so abundant but people are not willing to do the manual labor on farms to meet the labor demand so we have to hire foreign labor to harvest our crops.",
            "title_similarity": "0.6988553",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h8qje1j",
            "score": 1,
            "text": "i would make one change to that title:\n\nbusinesses struggling to hire minimum wage help is actually the natural outcome of capitalism. \n\ncapitalism is essentially the recognition that people do and should have a right to their body, their mind and the fruits of their efforts. there was no \"intent\" to capitalism other than to recognize those rights.",
            "title_similarity": "0.76809657",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8qox5l",
            "score": 1,
            "text": "I generally agree with you, but this is CMV, so a I'm going to try to challenge one, perhaps somewhat tangential, aspect of your view.\n\nYou say:\n\n> This is exactly what the left has been after all along, only this time, it's being driven naturally.\n\nThe implication is that capitalism has stolen a march on progressives: there's been all this talk about higher wages, but it amounted to nothing, and now the market is succeeding where \"the left\" failed.\n\nI think this misrepresents the complexity and dynamism of market forces.  Market _models_ may assume classically rational actors, but the map is not the territory.  Real markets are made up of people.  And the willingness of people to just walk away from $8/hour has been influenced _a lot_ by the public debate on the issue, and people's experiences in areas that adopted the higher minimum wage.  Had \"the left\" not waged this PR campaign, market conditions might be very different today.\n\n(I'm putting \"the left\" in quotes because the minimum wage is a liberal or social-democratic policy.  Actual, for-real leftists want to nationalize the whole factory, not just make it pay slightly better.  There are no actual leftists in mainstream American politics.)",
            "title_similarity": "0.82707244",
            "sentiment_compound": 0.5041
        },
        {
            "id": "h8qrlkm",
            "score": 1,
            "text": "Created by government overreach?! I just... Bruh. Come on.",
            "title_similarity": "0.39178008",
            "sentiment_compound": 0.3164
        },
        {
            "id": "h8quro0",
            "score": 1,
            "text": "It would be if they weren't living on dole that you and I pay. People are opting for mooching off their fellow man rather than working. If there weren't long-lasting sweet dole payments being made to these people, they couldn't reject good paying jobs to keep stealing from their neighbors after being offered employment at a decent wage. Otherwise yes a shortage of worker supply will increase wages.",
            "title_similarity": "0.8660526",
            "sentiment_compound": -0.7527
        },
        {
            "id": "h8qxcdn",
            "score": 1,
            "text": "Agree",
            "title_similarity": "-0.088680685",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8r0t58",
            "score": 1,
            "text": "The new very online world was not helping me in hiring. I found out indeed listed a suggested salary range for the positions I was hiring for as $13-14 an hour. In reality it is $17-$20 an hour. There is no way for me as the store manager to go fix indeed. I don’t know if there is a way for HR to fix indeed. It made my life a living hell finding people to interview. As soon as I made offers they were excepted within minutes. \n\nIt was a ton of unneeded crap that could have been avoided if some helpful person/bot didn’t list random numbers online for me.",
            "title_similarity": "0.6967101",
            "sentiment_compound": -0.8717
        },
        {
            "id": "h8r122t",
            "score": 4,
            "text": "Well companies which can afford it after a year of pandemic restrictions ***are*** raising wages, but it’s not translating into the same incentives which in a normal economy would attract qualified employees because the wage increases aren’t growing as fast as the dollar and consumer prices are inflating, and that’s an artificial consequence of Biden’s spending agenda. People are flush with Covid relief checks but no one’s manning the warehouses etc, so not enough product is turned out to meet the demand. Despite wage increases, it actually represents a net loss in compensation. Add to that, people often follow the path of least resistance, why earn your dollars working when you can collect them by idling? So this is not capitalism as intended. Not by a long shot.",
            "title_similarity": "0.8583983",
            "sentiment_compound": 0.7543
        },
        {
            "id": "h8r47jv",
            "score": 1,
            "text": "Supply and demand.",
            "title_similarity": "0.17896754",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8r5pzl",
            "score": 1,
            "text": "Hope you have a chance to see my comment and respond!  The logic here altogether is a bit off when looking at the big picture. While you are right that there are less, workers and therefore employers have to compete more for said workers (typically in the form of higher wages). You seem to be missing out on the flip side of the argument, namely inflation.  Looking at the supply side of the economy, you just need to think about what is happening to production. In large part, due to the mess of incentives and subsidies, many people have pulled themselves out of the workforce entirely.  Less workers means an overall dip in how many goods and services can be produced (at the very least compared to where we would currently be minus the unemployment supplement).   Even with the higher wages, the same number of people will be chasing fewer and fewer goods and services supplied by the economy, hence, prices will go up (faster than wages can keep up since there are less things to buy).  Inflation takes time to set in, so in the short term it may not feel so bad (even though we are even seeing levels of inflation 500%+ higher than they’ve been over the last decade or so). But long-term this is detrimental to an economy. The shock we’ve seen in the labor market affects aggregate supply (so this will be textbook stagflation as well).  \n\nThis is clearly an unnatural change, capitalism-wise, because the government is essentially incentivizing people to stay home and do nothing to collect higher-than-minimum-wage salaries. Couple this with the fact that eviction moratoriums mean you can’t be kicked out for not paying rent for literally a year at this point, means the do nothing all day route is a lot more enticing. \n\nLastly, inflation causing long-term lowered real wages is going to face a double blow from the insane deficit spending by govt and money printing by the fed.  We have never spent this amount of money in our history. Period. All of ww2 spending didn’t even reach these levels.  Our government is incentivizing people not to work (which is crazy inflationary on the supply-side) and funding it by printing more money/taking out debt (which is crazy inflationary on the aggregate demand/monetary side).  All this means is we are in for a rude awakening in the long term. You may think your paycheck is going up, but it sure as hell won’t go as far.",
            "title_similarity": "0.8738462",
            "sentiment_compound": -0.9862
        },
        {
            "id": "h8r692a",
            "score": 1,
            "text": "Let’s run a quick thought experiment by taking the argument to the extreme. Say you are the government, and you enact a policy for 90% of people not to work (by paying them enough unemployment that they choose to not work).  Sure the people that do work will get more money (because they could very easily choose not to and get paid). But now you have just 10% of your workforce trying to provide for the other 90%. They CANNOT produce nearly as many goods. As a result, the same amount of money chases a fraction of the economic supply. Overall, people end up with significantly less than they would have had this policy not been enacted…wages may increase, but inflation increases even more. The net result, people are worse off materially.",
            "title_similarity": "0.79209995",
            "sentiment_compound": -0.5476
        },
        {
            "id": "h8rbvah",
            "score": 2,
            "text": "Well, the thing is that the state is currently the main determining factor.\n\nThe stimulus checks, higher unemployment benefits, eviction moratoria etc. have all been shown to adversely affect hiring rates.\n\nI'm not saying they're the wrong thing to do, necessarily. But this isn't purely private market forces doing their thing at the moment. The current difficulty of hiring is almost exclusively determined by how generous public subsidies are and will be in the future.",
            "title_similarity": "0.8003818",
            "sentiment_compound": 0.2459
        },
        {
            "id": "h8rcojm",
            "score": 1,
            "text": "They also don't realize hundreds of thousands of people are now dead as well, so that's a lot of former and potential employees no longer eligible to work, because they are in the ground or in ashes",
            "title_similarity": "0.4675032",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8rcvqp",
            "score": 1,
            "text": "Depends.\n\nThis is going to relate to old supply and demand principles.\n\nThe value goes up as the relationship between supply and demand skews more toward demand - if everyone desperately need an acorn and there's only one, said acorn may be among the most valuable items on the market.\nIf no-one's really interested and there's millions of acorns, then they are dirt cheap.\n\nOn to labour.\nIf the reason for the struggle in employing minimum wage workers is the result of normal levels of labour supply, but way high demand for labour, then it is as you say \"capitalism working as intended\"\n\nOn the other hand, if the problem is caused by a labour shortage then that's society collapsing, not peak capitalism. (Why did labour supply fall so dramatically? Either a ton of people died, OR no-one wants to work, and somehow can cover living expenses without working)\n The first (extreme death rate) may be environmental or due to some foreign country nuking you, it seems unlikely that contemporary \"capitalism\" would opt to genocide the labour force- as it likes to have a healthy and even oversized one available- (drops wages you see)\n\nThe second implies that someone is giving out wage equivalent money without exchanging it for labour- which is obviously not the working of capitalism at all.",
            "title_similarity": "0.83487236",
            "sentiment_compound": -0.7773
        },
        {
            "id": "h8retsx",
            "score": 1,
            "text": "The fact that country bailout business is capitalism failing. It would be better for everyone if large companies died so smaller businesses could start the climb to the top but no. Capitalism failed and now we gotta deal with fewer and fewer corporations owning everything.",
            "title_similarity": "0.7969032",
            "sentiment_compound": -0.775
        },
        {
            "id": "h8rgnex",
            "score": 1,
            "text": "I believe that being able to change your view is all based on how narrow a view you hold. Are you talking about the definition of capitalism, and want someone to redefine the word to change your mind? Or are you speaking about our current situation?  \n  \nIf it’s about your definition, I don’t believe that can be changed by the very nature of being a definition.  \n  \nIf it’s about our current situation, there are factors outside of the control of private industry (capitalism). The largest ones are the pandemic and the government reaction. So if capitalism is a system fully controlled by private industry, our current situation isn’t actually that due to both the pandemic (infection and death), and the government response.  \n  \nAs an aside, you’ve already decided the government response was “overreach”. I believe that’s very debatable. Any time someone has to take preventative measures, it allows others to criticize since the avoided result is unknown. We don’t know what would’ve happened without the government’s actions. So it allows one side to say that it wouldn’t have been as bad and the preventative actions are actually harmful. And it allows the other side to say that there would’ve been at least twice as many deaths without those actions. Nobody knows for certain but there will be people who give their opinion with conviction anyway.",
            "title_similarity": "0.76135784",
            "sentiment_compound": -0.7059
        },
        {
            "id": "h8rkt01",
            "score": 1,
            "text": "The negative side effects of having the government artificially raise wages is coming. The inflation we are about to see is going to blow your fucking mind.",
            "title_similarity": "0.7825145",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8rphrv",
            "score": 1,
            "text": "wow yeah this is definitely how it’s going to play out /s",
            "title_similarity": "0.021134345",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h8rpkn0",
            "score": 1,
            "text": "Thank you. Love this clear perspective!",
            "title_similarity": "0.05528232",
            "sentiment_compound": 0.8748
        },
        {
            "id": "h8rqnps",
            "score": 1,
            "text": "It's really funny to see capitalists pretend that any business that mistreats their employees will go bankrupt, but then they bitch about not being able to mistreat their employees by paying them starvation wages with insane requirements and zero benefits during a fucking plague.",
            "title_similarity": "0.8191462",
            "sentiment_compound": -0.7753
        },
        {
            "id": "h8rrhes",
            "score": 1,
            "text": "Yeah, im going to close my place down. I get paid less per hour than my highest paid employee( I have 2). I picked a business that relies on min. Wage workers but I understand why that isn't enough for people. Fuck, it's not enough for me. It is going to be relieving not to be the boss. My business model relied on standards that no longer exist. Best of luck to everyone having to make these kind of tough decisions.",
            "title_similarity": "0.862761",
            "sentiment_compound": 0.7105
        },
        {
            "id": "h8rry6o",
            "score": 1,
            "text": "Your argument was \"Capitalism is working as intended\" but your first point about wages is \"In our case the cause is different, but the effect is the same.\" How is it working as intended if the causes of change aren't the intended causes of change?",
            "title_similarity": "0.7739932",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h8rsjg1",
            "score": 1,
            "text": "It’s not government over reach to prevent a pandemic. That’s what it’s for. If you don’t like it then get the vaccine.",
            "title_similarity": "0.46954852",
            "sentiment_compound": 0.3666
        },
        {
            "id": "h8rtdjb",
            "score": 1,
            "text": "Trying to pin the labor shortage on unemployment rather than loosing 600,000 'essential' workers. \n\nCapitalists selected those willing to compete for the lowest wage and sent them to die on the front lines of covid and now wonder why no one wants to work for poverty any more.",
            "title_similarity": "0.81754816",
            "sentiment_compound": -0.9423
        },
        {
            "id": "h8ru35c",
            "score": 1,
            "text": "What’s happening now is not capitalism. If this was capitalism it would be way way way worse. Tons more people would have been out on the street after they couldn’t afford rent or food. It’s the artificial conditions created by the gov which are benefiting workers. Obviously it gives less leverage to businesses so business owners don’t like it. But the reality is it would be way way worse if their customers had no money to spend.",
            "title_similarity": "0.82844913",
            "sentiment_compound": -0.775
        },
        {
            "id": "h8ruek6",
            "score": 1,
            "text": "I mean...  the minimum wage is defined by the government, isn't it? \nYou say \"choice\" but it's actually a condition for a lot of companies: \"you can either afford to keep a business or go duck yourself\".\nThe sense of competition that capitalism drives always leaves people behind, and wages might increase when demand for labor increases, but as fewer people are able to create business and have to compete for a crap pay in a fiercely competitive and unregulated market, the minimum wage would drop drastically as companies would start to take advantage of starving people as it has happened so many times, and at that moment thank god for the minimum wage set by the government.\n\nIn conclusion: wouldn't help minimum wage on the long run, but would actually solidify a poor sector of the population with very little options, and a very rich one taking advantage of the system at ease. So yes, it would be capitalism working as intended.",
            "title_similarity": "0.87857836",
            "sentiment_compound": 0.9142
        },
        {
            "id": "h8rugeo",
            "score": 1,
            "text": "It's the market system at work, not capitalism. The essence of capitalism is that the owners of the capital (land, businesses, factories, the tools) get to keep what is made with the capital (i.e., profits) instead of the output being kept by the laborers who used the tools. \n\nMarkets, on the other hand, help us figure out where to put our resources: we sell to the highest bidder and buy from the cheapest vendor, as opposed to, say, giving it to the first person in line, or the oldest person in the room, or making the product to begin with simply because it was on your to do list.\n\nIn the present case, the workers are simply saying, \"We're not willing to exchange that amount of labor for this amount of money. I have better options for my time. Maybe it's because the labor market is tight and I've already got a job; or maybe it's because at that wage rate I'm going to starve anyway so I might as well starve to death while playing the Xbox all day.\"\n\nThe workers are not saying (at least not yet), \"You can't rent my time unless I get to participate in the profits. Or better yet, we'll just rent the tools from you, and we'll keep the profits.\"\n\nAs weird as it might sound, you could have a group of software developers who wrote a bunch of code while renting server time from a server farm, collectively own the code they wrote, turn around and sell that code to the highest bidder. Or possibly, much like the workers in your example, not sell any of their time-turned-into-code because the price was too low.\n\nYou could also have a corporation that owns server farms pay people to write code for it and choose to sell that code to the highest bidder and keep the difference between inputs and outputs as profit that it doesn't share with anyone, even if they wrote the code.\n\nIn both examples you have an organization selling something in a market economy. In the first it's some form of collectivism; in the second, capitalism. Although capitalism and markets work hand in hand, they are separate beasts. It's often hard to see the difference because for most of us we've always experienced them together; however, markets predate capitalism by many hundreds, if not thousands, of years. (Here's looking at you First Nations.)",
            "title_similarity": "0.8206233",
            "sentiment_compound": 0.9653
        },
        {
            "id": "h8rv255",
            "score": 1,
            "text": "Capitalism is different from a market system. Capitalism simply means that capitalists allowed to exploit workers' labor. Labor shortages would still exist in other economic systems.",
            "title_similarity": "0.76361305",
            "sentiment_compound": -0.25
        },
        {
            "id": "h8rvsot",
            "score": 1,
            "text": "There are more open jobs right now than there are people on unemployment. The unemployment system is a socialist program intended as a safety net to protect against unexpected job loss. However, similar to other programs like worker’s compensation, it provided you slightly less than what you earned at work so people would have an incentive to return to work when they could. Right now, people are earning an extra $300 per week, which for many is more or the same as they were earning at their job. This is not capitalism working as intended because the government really has no practical limits on how much it can pay people to not work, so it will always be able to make unemployment checks seem more desirable than a paycheck from Wal mart. If it were Wal mart struggling to hire workers for $10 because Amazon was paying $15, I would agree with you, but that’s not what’s happening. Right now the incentive created by the unemployment system is to discourage capitalizing on your own labor to earn a profit by getting a job.",
            "title_similarity": "0.89525914",
            "sentiment_compound": 0.2041
        },
        {
            "id": "h8rwydg",
            "score": 1,
            "text": "If we have to wait for a global plague to see even a moderate increase in lower income wages that isn't a great sign that capitalism works",
            "title_similarity": "0.7381445",
            "sentiment_compound": -0.4929
        },
        {
            "id": "h8rynv7",
            "score": 1,
            "text": "They can’t find workers due to high unemployment payments",
            "title_similarity": "0.6137334",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8ryxmx",
            "score": 1,
            "text": "Goverment intervention in the free market isn't capitalism. \nThey are struggling because of handouts.\nThe west have no capitalist countries, they are all mixed economies.",
            "title_similarity": "0.6567291",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8rzc48",
            "score": 1,
            "text": "The issue I see is that small businesses are being asked to foot the bill for stagnant growth in corporate salaries and wages.",
            "title_similarity": "0.7843621",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8s17iu",
            "score": 1,
            "text": "I agree with your main point, that wages will go up as more opportunities at competition steal away your employees.    \nThe issue I have is that the government is skewing the playing field in two ways.  \n\n&#x200B;\n\nMinimum wage.  The average wage in any type of job will vary depending on location.  17$ an hour for a cashier in NYC is likely low, 17$ an hour in a cashier job in Aboline texas is probably way too high.  In a true free market, the supply and demand would balance itsself as long as the government stays out of it.  \n\n&#x200B;\n\nCOVID.  The governments response to covid has been to hand out money to people laid off or impacted by the government mandated closures.  Various levels of governments have made it more profitable to stay home than to go to work.  This has artifically skewed the balance.",
            "title_similarity": "0.8661059",
            "sentiment_compound": 0.9167
        },
        {
            "id": "h8s17wq",
            "score": 1,
            "text": "Well it took a pandemic and severe government action. High wages and low unemployment is not in capital's interests and they don't want the government taking action for that. And believe me they wield much greater influence than the rest of us. Always a conflict with capital.",
            "title_similarity": "0.7528819",
            "sentiment_compound": -0.7401
        },
        {
            "id": "h8s181n",
            "score": 1,
            "text": "\"Created by government overreach\"is an oddly loaded, negative term to describe the response to the pandemic.",
            "title_similarity": "0.49301484",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8s1dsf",
            "score": 1,
            "text": "This is happening where I work. Starting rate was only .15 above min. wage and now they announced $15.46 as starting rate (operator) with intentions of attracting more manpower and retaining.",
            "title_similarity": "0.5729871",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8s1p6l",
            "score": 1,
            "text": "The minimum wage has been stagnent for 40 years. The cost of living has gone up for the same period in time. And this trand is still going. Minimum wage workes dont have many choices. Thay live paycheck to paycheck so if thay find a job thay dont have the luxory to wait for a better offer. So what buisnesses have to do is to keep the minimum wage as much as you can barely survive.",
            "title_similarity": "0.6557474",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8s2ae7",
            "score": 1,
            "text": "It's does, and I think wage increases over time are in a way attributed to this. However the cost of living has gone up by a much larger degree. I'm earning equivalently more than my dad was in the 1980s in a similar job, but housing, food, utilities etc are vastly more costly now.",
            "title_similarity": "0.68036395",
            "sentiment_compound": -0.2592
        },
        {
            "id": "h8s2rxe",
            "score": 1,
            "text": "Today I learned that people don't even remember or know what real capitalism is anymore.",
            "title_similarity": "0.51615274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8s3w5d",
            "score": 1,
            "text": "I like the idea but it’s incredible how little people will work for and how poor work conditions they will tolerate. What we’ve discovered is that the capitalist machine is telling people that the world works a certain way, to pull themselves up by their bootstraps, when in reality we’ve created a bottom sector that can’t survive on what is being paid. Yet people still work there, often for psychological reasons that go way beyond crude economics. Adam Smith was correct, only if you look at it over a longer and much crueler arc of time.",
            "title_similarity": "0.8752198",
            "sentiment_compound": -0.8674
        },
        {
            "id": "h8s4221",
            "score": 1,
            "text": "It's something of a paradox in capitalism. \"Price is determined by supply and demand,\" but thing in question here is specifically low wage labour. By definition of what the supply is they cannot match the price of the labour to this rule.\n\nWhen you build a financial model around subpar wages, you then have given yourself the checkmate.",
            "title_similarity": "0.7621949",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8s5a8i",
            "score": 1,
            "text": "Well it’s not always a good thing because the big companies can now afford to pay their employees way more than small business. This will drive small business out & later on the companies can go back to paying their employees close to nothing",
            "title_similarity": "0.87661374",
            "sentiment_compound": -0.1793
        },
        {
            "id": "h8s60t2",
            "score": 1,
            "text": "That's a pretty chauvinistic way to look at things, bro. You can say that capitalism is working, but by what metric? American imperialism is holding the world back from economic development, keeping the world poor and crushing anyone who opposes it. I wouldn't say that's working, unless you want to dehumanize anyone who lives in the developing world.",
            "title_similarity": "0.7806421",
            "sentiment_compound": -0.8608
        },
        {
            "id": "h8s64la",
            "score": 1,
            "text": "This is actually a recognized phenomenon in Norwegian economics, where employers that are offering low wage positions are seen as unable to effectively utilize human labor",
            "title_similarity": "0.6576983",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h8s6sr2",
            "score": 1,
            "text": "I cannot change this view, I share it",
            "title_similarity": "0.02376755",
            "sentiment_compound": 0.296
        },
        {
            "id": "h8s7000",
            "score": 1,
            "text": "“Through wages, incentives or go out of business”- Those aren’t the only three options.\n\n1. You just offer the position as a flexible side hustle for people needing part time work.\n\n2. Aim the position to teenagers being weaned off their allowances and have no bills (all profit). After school job = weekend spending cash.\n\n3. Find people that believe in your company philosophically, who are driven to make it succeed as a lifestyle. This is how many non-profit organizations and private schools are able to survive while only being able to afford minimum wages.\n\n4. Make the quality of the work atmosphere so enjoyable and entertaining that people want to come to work even on days off- because it’s just a great place to be- regardless of the pay.\n\n- Remember, not everyone is incentivized purely by money. Many jobs I’ve worked were incentivized by atmosphere and the community.",
            "title_similarity": "0.7615616",
            "sentiment_compound": 0.9584
        },
        {
            "id": "h8s7xtf",
            "score": 1,
            "text": "\"Pure capitalism\" unfortunately wouldn't work this way. There are a number of tools available to employers for keeping wages low in an unregulated capitalist system. Two prominent examples from US history are mining towns, where the mine owners also own the entire town, cutting miners off from any other chance at competition, and expanding the labor pool by using child labor. We had to make laws about not making children do dangerous jobs for low pay because before we had those laws people made children do dangerous jobs for low pay. To this day we have people angry about the wage shortage (although they call it a labor shortage) saying that the jobs that are now shifting toward paying a living wage aren't meant to pay a living wage, they're meant for teenagers who, for some wild reason, don't also deserve living wages.",
            "title_similarity": "0.814005",
            "sentiment_compound": -0.9486
        },
        {
            "id": "h8s9o0x",
            "score": 1,
            "text": "1: capitalism doesn’t have an “intent”, it is a economic philosophy. Some are fans for efficiency reasons, and other for moral ones. \n\n2: wage growth is like the growth in prices for anything else. Based on both supply and demand. The only reason wage growth is even a focus is bc of our inflation, otherwise we would have “real wage growth” so if you make the same amount you have higher purchasing power due to the prices of other goods going down. For example you would never be able to afford spices 500  years ago. \n\n3: When you implement a minimum wage, it would conventionally be known as a price floor. When we see this in goods it’s typically a bad thing. “You can’t pay less than X for a good”. It’s rare but happens. It’s good for the barely lower class, and bad for the extreme lower class. If I could graph it it would be way easier to explain but alas…\n\nSo firms make ECONOMIC* hiring decisions based on two factors. Marginal cost and marginal revenue. How much am I paying per hour vs how much do I receive per hour. Although everyone would like to believe that their time is worth a lot, in terms of revenue generation there are many unskilled laborers who’s revenue is not worth the minimum wage. These people, instead of making low wages, now make NO wages. I’m sure you’ve heard the “the real minimum wage is 0” trope. \n\n4: When you’re competing with the government it is not capitalism. You’re competing against the welfare state/entitlement state. That’s by definition anti-capitalist. You could make as many arguments as you want about whether we should have minimum wage or not, you CANT argue that it’s capitalism. \n\nEasy cheat sheet. The more government involved, the less capitalist it is. \n\n\nTLDR: price controls, central planning, and competition with the state is not capitalism by definition. What you’re describing is economics. There will be an economic reaction to economic controls. An economic reaction does not mean it is capitalism.",
            "title_similarity": "0.88037366",
            "sentiment_compound": -0.6122
        },
        {
            "id": "h8sd8vt",
            "score": 1,
            "text": ">\tOur current situation is far from natural; it was created by government overreach in shutting down our economy and increasing unemployment benefits. \n\nThis is a ridiculous oversimplification. Unemployment benefits are only one small factor.",
            "title_similarity": "0.75479376",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8sg4ui",
            "score": 1,
            "text": "No, because then they out source. Technically, they COULD make it more attractive, but they don't, because they don't need to. If your goal is global capitalism, then sure, eventually some business' will struggle. The criticism however, is that MY (fellow) citizens can't find a job. \n\nCall centers can be outsourced. Programmers can be outsourced. Shipping can be given to immigrants. Some business' don't need to shut down because they can find a desperate soul and pay under the table. It's illegal, yes but that doesn't mean it doesn't happen.\n\nSo, what problem does companies 'struggling' to hire actually achieve?I",
            "title_similarity": "0.8300357",
            "sentiment_compound": -0.9423
        },
        {
            "id": "h8shf3r",
            "score": 1,
            "text": "Right, increase wages for a viable business, not trap people and artificially prop up businesses. Cant afford to flip burgers 24 hours? Well ones with the volume will stay open and either the owner will be desperate enough to man his own grill or close because that times more valuable in bed.\n\nApplying the 24-hour wartime grind was the worst thing to happen to America ans therefore the world. Restore BALANCE",
            "title_similarity": "0.79687685",
            "sentiment_compound": 0.5507
        },
        {
            "id": "h8smdiv",
            "score": 2,
            "text": "How do you define capitalism? For me, capitalism is an economic system characterized by private or corporate ownership of capital goods, by investments that are determined by private decision, and by prices, production, and the distribution of goods that are determined mainly by competition in a free market.\n\nWhat causes the living standard to improve? What causes prosperity? It’s not printing money. Printing money does not give us more iPhones, graphics cards, pizzas, X-ray machines, cars, or anything society needs for comfortable living. It is the act of producing goods and services that improve the living standard. Actually making more pizzas, and being free to produce and sell pizzas (and other goods) is what makes society richer. The government and the central bank have been pursuing a policy of monetary and credit expansion that’s needed to fund massive government spending. This expansion reduces the value of the dollar (inflation) and benefits those who take out the largest loans (often ultra rich people with bank relationships). Governments like devaluing their currencies because it makes it easier to pay back their debt and interest. \n\nThere’s a short term boost of economic activity following artificial money/credit expansions, but then the long term realities take hold and cause more poverty than the short term “prosperity” experienced initially, all at the expense of those who are at the bottom of the totem pole who rely heavily on the affordability of basic goods that are pushed higher by inflation. \n\nWhat we’re experiencing with rising wages is not a result of capitalism, as in capitalism the market rate of labor would be higher because of competition with other market participants, all of which is driven by demands of productivity. When the government comes in, it’s actually incentivizing non-productivity financed by non-productive debt, which will result in fewer goods and services, thus making society poorer. Even though wages will rise due to this intervention by the government, the inflation following will wipe out any “real” gains. People will be able to afford much less “things” even though the minimum wage has increased, because the factors of production will be much more expensive. We are already seeing the truth of this.",
            "title_similarity": "0.7937852",
            "sentiment_compound": 0.9398
        },
        {
            "id": "h8smynf",
            "score": 1,
            "text": "I have a degree in econ, and theres a lot here that could  definately be seen as a bad thing even if there more money going to the hands of people who are generally downtrodden. The first concept to be aware if here is real wealth, which is a function of the price level and income. The important thing to note is that you dont care how much you make, you care how much you can buy with it, so if you earning increase but the price level increases even more you're worse off, not better.\n\nAnother vital concept is the Non Inflation Accelerating Rate of Unemployment, or NIARU. When unemployment falls below this level we see inflation, which is an persistant increase in price level, because labour becomes more expensive and this cost must be covered by an increase in prices. As a result of this people generally get poorer as prices and wages spiral upwards, which has the effect of making savings worth less. Of course if you're Jeff Bezos and youre money is in Amazon stock your savings aren't touchef by inflation, but if you're a normal person holding cash you're impacted severely. Rather than moving poor people into the middle class, this will make middle class people poor, and all without touching the wealth of the rich.\n\nIt's possible that the price level increases less quickly than the wage level, and this is even worse. If the price level doesnt increase at the same rate as wages then businesses producing at the margin, meaning just able to make ends meet, must close and price level goes up as supply drops. Theres less to go around and society as a whole gets poorer. Either way, when unemployment falls below the NIARU the system generally explodes. \n\nWhat were seeing IS capitalist economics, but economics is a science which doesnt tell us if a thing is good or bad, only what the most likely outcome is. Just because something happens the way economic theory would suggest doesnt mean it's good, it just means the field is correct in its prediction. This being said, a rising minimum wage absolutely does not translate to a increased welfare because we measure welfare as how much you can afford rather than how much money you have. \n\nTl;dr an increased minimum wage might mean more money for some people, but empirical evidence tells is that it also means more expensive products and ultimately less stuff for everyone we're trying to help.",
            "title_similarity": "0.8366176",
            "sentiment_compound": -0.9876
        },
        {
            "id": "h8spmyg",
            "score": 1,
            "text": "But now the \"we need more tax cuts because of wage growth\" sob job is on its way. Capitalism isn't for the working class.",
            "title_similarity": "0.79843867",
            "sentiment_compound": -0.3221
        },
        {
            "id": "h8sppw5",
            "score": 1,
            "text": "I would like to change your view. It's not just minimum wage. We can't hire people for twice the min wage. We have people running out of our office like it's on fire. I love to watch it. Every person that leaves just makes my chances of moving up the latter better and I'm happy for people finding better work.",
            "title_similarity": "0.801252",
            "sentiment_compound": 0.9524
        },
        {
            "id": "h8src20",
            "score": 1,
            "text": "I love how business is responding, cut unemployment and make them take our shitty low paying jobs.  Your point needs to be yelled louder so low wage workers understand that this is their time to make progress",
            "title_similarity": "0.80561924",
            "sentiment_compound": -0.6642
        },
        {
            "id": "h8vzhcu",
            "score": 1,
            "text": "Rule of thumb - government intervention bad. If small businesses can’t afford to hire people and eventually go out of business, large companies and large employers are gonna have an upper hand and this is how government creates monopolies. And that’s never good.",
            "title_similarity": "0.76149195",
            "sentiment_compound": -0.1546
        },
        {
            "id": "h8y9fyt",
            "score": 1,
            "text": "Clarifying Questions:  Could you be a bit more specific as to what view you want challenged and why?   \n\n * Do you think capitalism *shouldn't* intend to work this way?  \n\n * Do you think capitalism working this way and as intended is a bad thing?  \n\nFinally, in your final paragraph you state, \"the cause of the labor shortage is not *natural*.\" To the best of my understanding, the catalyst for the labor shortage is a disease. While there are other reasons contributing to it, if it weren't for Covid, the shortage would not be happening regardless of the other factors. What is *unnatural* about disease having a negative effect on resources?  \n\nEDITED:  Typos and clarification",
            "title_similarity": "0.7815633",
            "sentiment_compound": -0.8798
        },
        {
            "id": "h8yvtqn",
            "score": 1,
            "text": "Capitalism working as intended is when both parties agree on the price. Wages should be negotiated and agreed upon privately between the worker and the employer, not imposed by the government",
            "title_similarity": "0.66937137",
            "sentiment_compound": 0.7595
        },
        {
            "id": "ha349fi",
            "score": 1,
            "text": "I'm amazed that some businesses are still offering crap wages during this hiring struggle. About time they raised wages. \n\nI hate the inflation argument that prices will go up if you raise wages. Federal government hasn't raised the wage in like 12 years and yet the cost of everything has gone up. Minimum wage should've been indexed to inflation a long time ago. If it had, it'd be at least $20 an hour. \n\nFunny how businesses could only offer $10 an hour or less, and then when they struggle to find people all of a sudden wages are like $15 an hour with a $500 hiring bonus. It's like they magically grew a money tree.",
            "title_similarity": "0.7679",
            "sentiment_compound": 0.5719
        },
        {
            "id": "haqo96i",
            "score": 1,
            "text": "An alternative outcome is that businesses will just squeeze more productivity out of the Type-A workaholics who remain employed, until the unemployed run out of food and come back to work, or a new innovation allows businesses to cut the jobs that are unfilled. The system will never optimize - because as long as it can barely function, it will never change.",
            "title_similarity": "0.8578353",
            "sentiment_compound": -0.2796
        },
        {
            "id": "hd0cy2t",
            "score": 1,
            "text": "I would f***ing lay own and die happy if every company including (boohoohoo sniff sniff Mom and Pop, poor dears) bit the bullet and closed PERMANENTLY because they didn't pay a living wage. F*** 'EM.",
            "title_similarity": "0.6673104",
            "sentiment_compound": -0.0268
        }
    ]
}