{
    "CMV: Pulling out of Afghanistan was the right decision and the Taliban takeover doesn't change that.\nI am 100% convinced that Biden made the correct decision. This is a war that has been going on for 20 years, and for what? Billions of dollars and thousands of lives wasted. I'm so tired of hearing the same old excuses about why we (the U.S.) needed to stay. Yes, of course, entering the war was a mistake and it would've been more ideal if we were never in Afghanistan in the first place.  But we can't change the past. Staying in the war even longer in the name of more \"nation-building\" would've only resulted in the same exact thing we are seeing right now, except a few years and many more taxpayer dollars and lives later. As the saying goes, \"If you find yourself in a hole, stop digging.\"\n\nI find myself a little shocked at the negative reaction of even some of Biden's usual defenders. Yes, the optics are bad. There's no denying that. But pulling out of Afghanistan is something that both Obama and Trump campaigned on and never followed through with. Biden had the balls to finally pull the trigger, despite the potentials risks and warnings from his generals. And honestly, I've gained a lot of respect for Biden because of it. This may be Biden's \"fall of Saigon\" moment, but he still made the right decision, and I stand by that.": [
        {
            "id": "h99a4aw",
            "score": 1,
            "text": "/u/ronhamp225 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/p5xwu8/deltas_awarded_in_cmv_pulling_out_of_afghanistan/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.57135123",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h99avxt",
            "score": -1,
            "text": "There were people in the Afghani government that were sympathetic to the Taliban and have been there. If we would've stayed the younger generation would've been able to establish a foothold and brought them into the future.",
            "title_similarity": "0.64410424",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h99tqqy",
            "score": -2,
            "text": "America always sticking their noses in business that really dont concern them and all they do is leave a wake of destruction and suffering.",
            "title_similarity": "0.58975375",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h9a8l78",
            "score": -1,
            "text": "The US was able to stabilize the country having about  10,000 boots on ground for several years now to support their military, the Us military is a 100% volunteer fighting force that understands they could deploy and still volunteers to do so; \n\nDue to the pull out all of this is happening that wouldn’t be at this moment;\n\n100,000’s of afghan men women and children will be murdered before the the end of the year. If you want proof over 200,000 we’re murdered when we left Vietnam and that wasn’t even religiously motivated. They are already executing our allies there. \n\nThe fall of Afghanistan now gives an entire country as a safe haven for Islamic terrorism. Al-Qaeda will now have a safe place to train and recruit in a country that we just said we didn’t care about any of the people to carry out terrorist attacks in the future. \n\nIsis will now have a staging area for invading countries\n\nThe US left a lot of weapons and equipment that are now in the hands of the Taliban. \n\nSo Biden was pretty blunt in his speech: he said for 20 years we haven’t been trying to rebuild the country. Unlike what we did in Germany, Japan and Korea; all countries we went to war with or in, made allies and now have strategic military bases in. \n\nIf this was planned correctly we had Bagram Air-force base where we could easily transported everyone we needed to out in an orderly manor before we left. People fell off of airplanes yesterday. I do not think you actually comprehend how bad the Taliban taking control over that country so fast actually is. Thousands of actual people; mothers and daughter are right now being raped and sold in sex slavery disguised as “marriages”. People that helped try to modernize their country and give rights to women are being pulled out into the streets and executed. The media hasn’t reported about it yet because they don’t have numbers or video of it but thousands of people were murdered there yesterday in the country. Thousands of people took their last breath. \n\nSure you say public support has always been to leave because what we were actually doing there apparently doesn’t effect the average American to care.\n\nThose 2,500 American lives lost and 10,000 boots on ground last month gave Afghanis the right to live life the way they want. It allowed religious freedoms, it allowed women to go to school, it stopped the selling of women and children into sex slavery, it stopped mass executions, it made the country secure enough that the Afghanis could rebuild their country. \n\nYou are either completely ignoring the lives that are being lost and the hundreds of thousands more that will be because of this decision. And you know what; it wasn’t you fighting the war and you were never asked too. You were not asked to make that sacrifice; men and women volunteered to make that choice for the past 20 years and I can guarantee if you ask a single vet of that war if what we were doing there saved lives the answer will always be yes. 2,500 Americans over 20 years gave their lives so children wouldn’t be murdered and raped and now two draft dodging senile cowards (Trump and Biden) gave up on the hundreds of thousands of people we were protecting from evil because they only care about the optics of American lives and it really seems like that’s all most of America cares about too. \n\nAnd if you don’t care about those lives, I said it earlier, Afghanistan is going back to the way it was pre 9/11; prepare for another massive attack from that region on US civilians in the next 10 years. If you don’t think the reason the Russian and Chinese embassies are still open there isn’t because they are going to pump billions into that country to proxy fight us through Islamic terrorism you are kidding yourself. Russia already used actual troops in Syria and Crimea and China hacks us every day. You left safely, since that is clearly all you care about, even though it wasn’t in danger from the afghans, is actually now more in danger today then it was a month ago before the pull out. \n\nYou only have your stance because you are extremely under educated in the matter or how the world actually works.",
            "title_similarity": "0.8041159",
            "sentiment_compound": -0.9942
        },
        {
            "id": "h997s74",
            "score": 462,
            "text": ">Trump campaigned on and never followed through with.\n\nIt was Trump who got the troops out, they were supposed to leave in May and Biden delayed it.",
            "title_similarity": "0.6792896",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h99h8fl",
            "score": 0,
            "text": "Pulling out of Afghanistan was the right decision. The way Biden did it was, like every other foreign policy decision he's ever made, wrong.\n\nFor example, abandoning Bagram air base in the middle of the night, not even telling the Afghani forces we were leaving, was incredibly stupid. Why give up an air base when we still have people (military personnel, embassy personnel, contractors, plus the Afghani translators) in the country? The air base should have been the last area we left.\n\nReminds me of Obama's assessment about Biden, \"Never underestimate Joe's ability to f**k things up.\"",
            "title_similarity": "0.8169047",
            "sentiment_compound": -0.7886
        },
        {
            "id": "h99g75l",
            "score": 11,
            "text": "I think the fallacy you are thinking it had to be 100% either way. They all go or they(troops) all stay. We could have supported the ANA through air strikes and advising still. One reason we went to war in Afghanistan is was to break up the terrorist and Islamic supremacist bases of operations. One thing about our presence there was it attracted the terrorist there keeping American homeland soft targets relatively safe. Now the terrorist will have a base again to plan and train for attacks overseas.\n\nBiden admin was wrong in every possible analysis of the situation there. And to make it worse he was out of office on vacation when it happened. This will rock other nations trust in him and question his competency on future foreign policy.",
            "title_similarity": "0.8305838",
            "sentiment_compound": -0.9628
        },
        {
            "id": "h99bjrd",
            "score": 87,
            "text": "[deleted]",
            "title_similarity": "0.061980523"
        },
        {
            "id": "h99fn6t",
            "score": 1,
            "text": "I agree. Biden called it because it had to be called. Trump said he'd call it, but said lots of things ,didn't do it, and is a dirty rockspider.  I've been re-reading the Time Magazine articles of Afghanistan from Oct 2001 onwards... fucking fascinating.",
            "title_similarity": "0.76318955",
            "sentiment_compound": 0.4748
        },
        {
            "id": "h99o3wa",
            "score": 2,
            "text": "The bonfire in your backyard is out of control. You call the fire department. They agree with you and everyone in the neighborhood that putting this fire out is the right decision.\n\nThey set out to burst the local dam to release millions of tons of water. It eventually does put the fire out, but your neighborhood has nowhere to live anymore.\n\nSo yes, pulling out of Afghanistan was ultimately the right decision and of course the entire world bloody agrees. Just like putting out the backyard fire was certainly the correct call. But pulling out in a manner where Afghan govt was basically left to fend for itself meant America signed their death sentences, just like the fire department dousing the backyard fire by bursting the dam",
            "title_similarity": "0.77634144",
            "sentiment_compound": -0.6355
        },
        {
            "id": "h99jq04",
            "score": 9,
            "text": "Yes if you find your self in a hole, you should stop digging, but you don’t then leave that hole for some poor bastard to fall into, ya fill up the hole, and while your at it, plant a tree, we should never have been there but after ducking it up like we did we needed to rebuild and help create a stable state",
            "title_similarity": "0.6064034",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h99dyli",
            "score": 45,
            "text": "I'm angry with how they left, not leaving.\n\nI'm angry with him planning an exit for 8 months but announcing a plan for local affiliates that gave them 2 weeks.\n\nWhere was the other 7 and a half months of evacuation time for people who risked their f*cking lives for your country?",
            "title_similarity": "0.743119",
            "sentiment_compound": -0.3917
        },
        {
            "id": "h99grhd",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "0.02576524"
        },
        {
            "id": "h99aj7f",
            "score": 146,
            "text": "Unpopular prediction: I think this will end up hurting Biden and the Dems electorally more than it will help him. I think the fundamental issue is misunderstanding public sentiment. First off: what’s popular on the internet, especially Reddit, and double especially that god forsaken place known as Twitter, is not likely to be popular with voters. I think when polling went out asking “do you want to bring troops home from Afghanistan”, a lot of people would say “yes”. Sounds good, right? Well, they probably also didn’t want Afghanistan to fall either. I think Trump and Obama understood this. So what they would do is make an appearance and show “progress” at drawdown while not pulling fully out, so as to not have Afghanistan totally fall. So, they would try to straddle the line, trying to take some troops out while not being the one holding the bag if it all goes to shit. So, in the end, I don’t think this will look good for Biden. He and the Dems will lose seats for this.",
            "title_similarity": "0.7373256",
            "sentiment_compound": 0.749
        },
        {
            "id": "h9b7rao",
            "score": 1,
            "text": "Pulling out was correct. \n\nI have a couple of issues with the withdrawal:\n\nBiden said there will be no emergency helicopters taking people off the roofs of buildings, that was false\n\nBiden said the government would stand on its own, that was false\n\nSo there is three major issues here:\n\nWhy did we go to Afghanistan half assed for 20 years and not just forcefully make it a US territory if we wanted to stabilize the region\n\nWhy did the US intel get the result of our withdrawal so drastically wrong, because if we had good Intel we could have had measures in place for evacuation and talks with the Taliban?\n\nWhy is Biden not owning up to the military failure and doubling down with no political capital instead of trying to rectify the intelligence department and being solemn about the failure?\n\nThose are my three questions.",
            "title_similarity": "0.845209",
            "sentiment_compound": -0.6656
        },
        {
            "id": "h99jrca",
            "score": 8,
            "text": "What were the American Armed Forces doing there for this long, playing the Savior of the World or just taking orders from their Overlords at Washington ? Either way, it would be in the best interests of American people and everyone else in the World if Washington stopped interfering into other countries, unless otherwise these countries explicitly seek American help. The Trillions of Dollars are better spent for the good of Americans instead of these other things.\n\nBut don't expect the World to forget what America just did in Afghanistan. It reminds me of Vietnam, Korea, Libya and Middle East. If pulling out was the best thing, it could have been taken care of long ago.\n\nThat said, I agree that it was gonna happen sooner or later but could have been handled in a better way. You get an upvote from me.\n\n*Edit: Spelling.*",
            "title_similarity": "0.78393084",
            "sentiment_compound": 0.974
        },
        {
            "id": "h998n23",
            "score": 777,
            "text": "[deleted]",
            "title_similarity": "0.061980523"
        },
        {
            "id": "h99ocqc",
            "score": 5,
            "text": "I would agree, though I would contend that he should have put a bit more thought and planning before executing it.\n\nSuch as the status regarding the translators that helped the U.S and its allies during the two decades, and refugees. But besides that, I think it was a situation that can be compared to pulling off a band-aid. Pull it off hard and fast, it would only hurt for a while. Do it slowly and it hurts longer.\n\nBut, I think that the war on Afghanistan was justified, seeing how it was in response to 9/11. Of course, in hindsight, this war did more harm to the U.S. in terms of its credibility, finances (debt), etc. But it was necessary for my view. \n\nBut, I think they went in without a concrete plan about what comes after they accomplished their objective. The reason why they stayed there for so long as they were concerned about the stability of the country, which was VALID, but expensive and unclear in regards to timeline.\n\nOf course, having 20 years of effort crumble in 2 weeks is shocking, demoralizing and a huge blow to the U.S. credibility (which I don't quite understand). But, most of this can be attributed to the Afghani armed forces themselves.\n\nNo amount of money, training, equipment, technology, and advice can magically give an armed force the will to defend their country. The Afghan armed force surrendered and gave up when the Taliban offensive started, which is why gains were made so quickly. HOW CAN ANYONE PIN THIS ON THE U.S??\n\nThe government itself was extremely corrupted, widespread cronyism, gross incompetence, etc. If 20 years and this is all we got from them then they never should have been in charge. If the departure of an ally means the armed force literally gives up on itself then no amount of money was going to give them a backbone.\n\nNothing that happened in the last 2 weeks can be pinned on the U.S. in my opinion say for the issue I highlighted above. \n\nAnd for China and anyone else, trying to frame the U.S. as a superpower that gives up on its allies or its actions as a betrayal. 20 years, trillions of dollars, equipment, thousands of lives = forsaking your allies & betrayal?? That shows commitment if anything.",
            "title_similarity": "0.7978911",
            "sentiment_compound": -0.9947
        },
        {
            "id": "h9a6jb7",
            "score": 1,
            "text": "Here’s a question then…\n\nWhat does your opinion, of Biden‘s decision to pull out, say about us veterans who served during those years, and about Americans who want to be able to defend themselves against terrorism?\n\nRegardless of whether we should’ve been in there or not, what isn’t going to change is that we were in there, and we upheld our oaths, and obeyed our orders. What’s worse about it is that after all our effort has been invested, many of us are still disenfranchised, lacking in benefits we need, and even being demonized for our service, which is something we’d have hoped would highlight qualities of merit and capability when we got out and sought to have private sector lives again.\n\nWhat happens to us now, with that opinion being the consensus, in the face of us giving Afghanistan back to the Taliban? Do we just become another demographic of misinformed and unfortunate Americans, with no future prospects or honored legacy for our service?  Do we become the stepping stones that future generations walk all over out of spite for those twenty years?  Did we loose friends and family in those years of war, simply for people like Biden to tell us it wasn’t worth it and that we no longer matter?  People are devastated that everything we worked to bring to Afghanistan simply popped off into smoke like a fart in the wind.\n\nOur intent wasn’t to stay there forever, our intent was to stabilize the country and give control of it to FREE afghans…. not people subjugated under a terrorist organization! And as right a decision as you think it might have been, what does that say about our own efforts to keep our own countries safe from terrorism?  That terrorism is just par and part for the course(Sadiq Kahn)?  That our military was useless!? ** after all the bull wash we’ve had to put up with**!?!?  Americans are NOT going to feel like fighting a war now with Biden’s decision representing the control that terrorists can take of ANY country, let alone Afghanistan!\n\nAnd you’d support the decision of a man to pull our troops out of there, a man who’d also vote to disarm Americans in the event the Taliban make their way to OUR doorstep?  Who’d demonize an entire constituency of Americans?  \n\nLet me tell you something about “not being there”; we probably shouldn’t have also been in places like Germany, Japan or Korea also.  But we’ve been all there since the end of each of their wars. We stayed there for the long hauls , and what do you think has happened to those Countries in the time we stayed, and the effort we invested in being present in those countries?… THEY’VE ALL FLOURISHED, and our predecessors are lauded as hero’s for truly ending those wars with their presence.  Who the hell is to say that it was the right decision to leave Afghanistan when we didn’t spend even a fraction of the time over there as we did in those other countries? Now that we keep winding down in those countries, what seems to be happening?  Ask yourself that.",
            "title_similarity": "0.7843457",
            "sentiment_compound": -0.9838
        },
        {
            "id": "h9acwdm",
            "score": 2,
            "text": "All good bra don't worry about the women about to get raped and the innocent families that can't afford to leave the country.",
            "title_similarity": "0.6076888",
            "sentiment_compound": 0.308
        },
        {
            "id": "h99kf9z",
            "score": 370,
            "text": "Think of it this way:  It may be the right decision to get off the interstate, since there's a bridge out ahead, but veering off the highway at 100 mph, jumping a drainage ditch and running over a group of school kids having a picnic in the process is arguably not the way to do it.  \n\n\"The bridge was out, I stand by my decision\" doesn't really hold water.  \n\nFor one example, there are a lot of individuals who were promised security, even relocation, in return for their cooperation and support.  These individuals and their families are now facing a swift and violent death.  You can compile a laundry list of really bad outcomes from this withdrawal.  \n\nIt wasn't that it shouldn't have happened, it was the execution.  If our leaders didn't see this coming, they're incompetent.  If they did see it coming, they're criminal.",
            "title_similarity": "0.7191591",
            "sentiment_compound": -0.9575
        },
        {
            "id": "h9aqfpo",
            "score": 34,
            "text": "I have a different take on this then everyone else. I think pulling out of Afghanistan was the wrong decision, morally and geopolitically, and I’ll list all my points below. \n\n1. TERRORISM. The reason we invaded is because the Taliban was harboring Osama bin Laden and refused to surrender him to American authorities. They were also creating an environment for terrorist activity to flourish in. The main impetus for the invasion was to prevent Afghanistan from being used as a launchpad for terrorism. \n\nRegardless of US efforts, our attempt to prevent terrorism WAS succeeding. Afghanistan is going to once again become a hotbed of terror and within a few years, we will see a resurgence of terrorist activity.\n\n2. WAR ON TALIBAN. People are celebrating that we are finally ending America’s longest war. Imagine going to war with the Nazis, and when they are beaten down, we just stop and pack up, allowing them to reconquer Germany. The Taliban has NOT been defeated. We literally forced the enemy to flee, and then gave the country back to them 20 years later. $2 trillion wasted. You cannot end a war when the enemy has not surrendered or admitted defeat. \n\n3. POLITICS. This withdrawal has been politicized from the beginning to score points. \nTrump and Biden are both responsible here, one for negotiating with terrorists and the other for finishing that withdrawal. There were only 4000 US troops in Afghanistan needed to keep a country of 40 million safe without major incidents. Japan has 50 THOUSAND troops. The opportunity cost was so low, staying would have been far more worth it to minimize the suffering we’ll now see there.\n\n4. STRATEGY. We can blame the ANA all we want for collapsing so quickly, but you cannot just blame the Afghan people for being unwilling to fight. The US govt. is also complicit for propping up an unpopular govt. whose leaders committed war crimes and refused to work with the other tribal warlords in Afghanistan to secure their own power. When you have untrained corrupt generals cutting deals left and right to save their own hides, of course normal soldiers will feel disheartened and surrender.\n\nThe US strategy of nation building was flawed, but instead of analyzing what we did wrong and fixing our mistakes, we NEVER LEARNED and just threw it all away. \n\n5. FOREIGN POLICY. Let’s be clear, the Taliban were funded by Russia, China, and Pakistan. We can’t do much overtly against China and Russia that we aren’t already doing, but Pakistan was literally playing America for the fool. The Taliban is Pakistan’s spear into the Middle East and they were funded directly by the ISI the entire time they fought against America. \n\nImagine fighting a terrorist group and allying yourself with their supporter at the SAME time. Osama bin Laden was literally hiding a mile away from one of Pakistan’s elite military institutions for 5 years. \n\n6. HUMANITARIAN REASONS\nI personally think developed countries should feel some responsibility to intercede when human rights violations become commonplace. That’s the whole reason we created the UN and intervened in many countries experiencing genocide or other issues. Afghanistan was also experiencing such issues and I personally think it’s morally wrong to abandon them to a corrupt government who’s president has fled the country and a literal terrorist outfit.\n\n6. CHINA. Joe Biden, Donald Trump and pretty much most of Congress have raised up the question of China, much of which I think is rightfully deserved. But ironically, if you want to pivot to China, then one of the best ways is to literally maintain the status quo in Afghanistan. Afghanistan is worth between $1-$3 TRILLION in heavy and rare earth metals, unprocessed. Now that the US is leaving, China is moving in and setting up shop. That’s why there are so many articles on China making deals with the Taliban. \n\nWhether this backfires on them or not, we know for a fact that China, which has already cornered the global rare earth metals industry, is only trying to expand its reach. For Joe Biden to come out and say that he’s developing a comprehensive policy to counter China, such as the Infrastructure bill or the alliances he’s trying to build via the Quad or NATO, this is an egregious mistake. He’s literally gifting the Chinese an advantage against America.\n\nThese are some of the reasons I think we should have maintained the status quo in Afghanistan. Some of my points may be wrong and I’d love to learn more but from analyzing this information, it doesn’t make sense for America to leave.",
            "title_similarity": "0.7768967",
            "sentiment_compound": -0.9961
        },
        {
            "id": "h99w6pa",
            "score": 32,
            "text": "Lots of analogies here to show that it’s possible to do the right thing in the wrong way. That doesn’t in any way prove Biden did this in the wrong way.\n\nThe best choice can have a bad outcome. Part of the reason there hasn’t been more violence is that the US set a timetable for leaving and then followed through. Personally haven’t heard a viable better strategy for leaving, only preferred better outcomes.\n\nThe rapid collapse only proves that the afghan state was non-viable, and has been on life supports that past 20 years.",
            "title_similarity": "0.8788044",
            "sentiment_compound": -0.6997
        },
        {
            "id": "h99he0y",
            "score": 0,
            "text": "Most people aren't objecting to the withdrawal itself. They're objecting to HOW the withdrawal is being done.\n\nA gradual, slow withdrawal would have been good. Instead, this is helter-skelter, chaotic, people are getting killed, and the thousands of interpreters who braved death to help American forces are now likely to be massacred.",
            "title_similarity": "0.71937466",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h99o70w",
            "score": 0,
            "text": "People like you really exist lol",
            "title_similarity": "0.09181721",
            "sentiment_compound": 0.6786
        },
        {
            "id": "h99qewt",
            "score": 4,
            "text": "You can believe that getting out of Afghanistan is the right policy, and at the same time understand that this was a terrible way to get out of Afghanistan.\n\nBut the execution of the plan was a catastrophe. Biden is not being honest when he said he had no other choice. The Trump administration reduced troops for a year with minimal loss of life and threatened the Taliban with repercussions if they crossed certain lines.\n\nThe United States cannot isolate itself from the world, and those who promote it have no idea how the world works. Unfortunately, there are criminals who are not satisfied with hurting their own. A world where there is less United States, there is more terrorism and organized crime. The idea of withdrawing troops was not bad because it was bound to happen eventually; but how he implemented the plan is what destroyed confidence in the Biden-Harris administration and generated a crisis in the Middle East, which had long been peaceful before this guy arrived.\n\nThe U.S. abandoning Afghanistan was the greatest military humiliation in history. They make it clear that they are now just a decadent empire and that the country that rules the world is China.\n\nA few weeks before the bloodbath, Joe Biden lied to the international community and the Afghans: \"It is not inevitable that the Taliban will retake Afghanistan. Afghan troops have 300,000 troops as well equipped as any army in the world and they have an air force, against about 75,000 Taliban. It is not inevitable.\"",
            "title_similarity": "0.875235",
            "sentiment_compound": -0.9843
        },
        {
            "id": "h99qv5z",
            "score": 0,
            "text": "The [Doha Agreement](https://www.state.gov/wp-content/uploads/2020/02/Agreement-For-Bringing-Peace-to-Afghanistan-02.29.20.pdf) as drafted during Trump's time in office outlined the withdrawal of the US military alongside a peace agreement . As flawed as it is, Biden had the chance to update or amend it, or which he did neither, which came as a shock to the Afghan and international community. Fine. \n\nGiven the Taliban's failure to uphold their part of the Doha Agreement (the critical ceasefire part), the Biden administration could have used this failure as a tool to make US withdrawal conditional, upon a genuine ceasefire and peace agreement. Biden could then have made considerable diplomatic efforts along with the rest of the international community to ensure that the strategic gains made socially and politically would not be immediately reversed, while also looking at the long-term maintenance plans for the millions of dollars worth of infrastructure put into the country, while also not leaving a huge stock pile of munitions and allies sitting targets. \n\nThis is to say, there was a way to exit, and the US did not handle it gracefully.",
            "title_similarity": "0.78720367",
            "sentiment_compound": 0.7641
        },
        {
            "id": "h99wazc",
            "score": 0,
            "text": ">This is a war that has been going on for 20 years\n\nUntrue. The war was over long ago. What the US was doing in Afghanistan was a security and stability mission.",
            "title_similarity": "0.8122686",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h99xs50",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.02576524"
        },
        {
            "id": "h99ygmi",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.025765255"
        },
        {
            "id": "h99zl5f",
            "score": 0,
            "text": "So I disagree. I don't think the US needed to pull out at all. There were so many different ways to go then this and have such a minimum involvement. 2000, 3000, 5000 troops to stay for decades, would be zero problem, they haven't had a death in a year and a half. India desperately wanted to be involved, but the US would not let them. The Taliban creates another hostile neighbor for India. \n\nCommentary Magazine podcast has been great on this issue. While I don't agree with their full analysis, they do a great job of taking apart both the Trumpian right and the I guess anti-war left. People would call them Neocons, but I don't think that is fair. https://podcasts.apple.com/us/podcast/commentary-magazine-podcast/id1081967784",
            "title_similarity": "0.8300816",
            "sentiment_compound": 0.8839
        },
        {
            "id": "h99zvn3",
            "score": 0,
            "text": "Our presence in the country was relatively inexpensive and US causalities were extremely low. We hadn't lost a single soldier in 11 months, meaning that being a police officer in the city I live is more dangerous. In return, 38 million people got to live under a semi-liberal democracy. Many of those people will now be stoned in the street. Those suspected of having worked with us will be shot. 50% of little girls had been enrolled in first grade, that number will now drop to 0. A generation of people who knew freedom now live under theocracy and terror. The lives of all those American troops who died to protect these people and our interests will have been spent in vain. I cannot understand the idea that a fraction of our tax dollars isn't worth millions of lives.",
            "title_similarity": "0.6604687",
            "sentiment_compound": -0.8477
        },
        {
            "id": "h9a0dcj",
            "score": 0,
            "text": "Until every person in the USA has a roof over their head, food to eat, health care and education, fuck the rest of the world. They shouldn’t be a higher priority for us. It’s really not that hard.",
            "title_similarity": "0.642583",
            "sentiment_compound": 0.0669
        },
        {
            "id": "h9a0icn",
            "score": 0,
            "text": "Lots of people died, lost fathers and sons for everything they died for over the course of 20 YEARS to be given right back. I can't imagine how that's tge right decision in any situation tbh. Did we need to leave? Yes. But that wasn't the way to go about it imo",
            "title_similarity": "0.6970488",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9a2sps",
            "score": 0,
            "text": "Who is against pulling out of Afghanistan?\n\nThe concerns are with how it was done.\n\nThe Taliban have a fighting season. It's in the summer. why wasn't the pull out mostly conducted during the fall and winter seasons when the Taliban aren't fighting as much so that the government has a better chance to get ahold of things?\n\nBiden said that the Afghans lacked the will to fight... Well some of them were fighting right up until when they ran out of bullets and food because they live in mountainous regions where there is road access doesn't exist or is very poor. Supplies were flown in, by Americans. We left aircraft there for the Afghans to use, but we drew down the people that maintained it.\n\nThe Afghans lacked the logistical structure to possibly fight the war. \n\nThen in Iraq, Biden left a force of a few thousand to swat ISIS (or whatever name they go by) every now and again and stop them from forming. Why wasn't something similar done in Afghanistan? What if the Taliban possibly form an ISIS like caliphate and start conducting terror strikes against the West, do we just go back in then?\n\nI don't want to be in Afghanistan either, but this pullout was very poorly executed.",
            "title_similarity": "0.72076917",
            "sentiment_compound": -0.9656
        },
        {
            "id": "h9a2tbn",
            "score": 0,
            "text": "It's funny cuz neolibs are heavily critical of this but leftists like Kyle Kulinski seem very much in favour of it",
            "title_similarity": "0.53885865",
            "sentiment_compound": 0.8314
        },
        {
            "id": "h9a4g55",
            "score": 0,
            "text": "You say the money and lives were wasted. Do you consider 20 years of women’s rights progress wasted? Do you consider a generation of children who get to grow up in relative safety and a democracy a waste? Do you consider the lives and liberties of all the afghans to be nothing of value? \n\nTo me, all these reasons are the biggest reasons to fight this war. Nothing is more noble than protecting life and Liberty from a bully. To run away from a bully and let him beat up on someone is the wrong decision, especially given the heinous nature of the Taliban.",
            "title_similarity": "0.7938367",
            "sentiment_compound": -0.9578
        },
        {
            "id": "h9aae58",
            "score": 0,
            "text": "I have no love for the people of afganistan.  I give zero fs if they choose to live under Taliban rule.  I don't care that the afganistan army folded.  \n\nwhat pisses me off is the billons of dollars of equipment that was left behind for the Taliban.  \n\nthe degree of incompetence shown by the former vice presidents handlers boarders on criminal.  and yes giving material support to the enemy is a war crime. \n\nChina has all ready seized on the the cluster f created by the former vice president's lack of leadership in the pull out. \n\nthe former vice presidents staff has been internationally recognized for how quickly they have changed the direction of the ship of state.\n\nit is time for Kamala Harris to come up with a short list of vice presidential picks.\n\nand just for context I bleed on the tarmac of Kabuls airport.",
            "title_similarity": "0.7558118",
            "sentiment_compound": -0.9516
        },
        {
            "id": "h9ac01u",
            "score": 5,
            "text": "You have a ridiculously over simplified view of this\n\nPulling out was right and I completely agree. Most American citizens agree with that and our government had plans to pull out. That said, arming the taliban (self declared terrorists) with cutting edge military tech in the form of thousands of trucks/MRAPS/APCS/humvees/drones/rifles/ammo/and whatever the hell else they took without resistance as they mob your runway and take potshots at you is a hilariously pathetic way to leave.\n\nSome people may tell you that there was a better way to coordinate a military withdrawal which did not involve using apaches to buzz 5' off the runway to clear it just in front of the plane which is attempting to depart with afghanis clinging to it and then sending thousands of US troops BACK reactively to attempt to retake the breached airfield so that the remainder of the diplomats/US citizens may escape. \n\nOver decades we armed the ANA and trained the ANA. They number around 300,000 and could have certainly been coordinated with to secure the airfield that we sent 3,000 marines to secure. \n\nYou are standing by what you think is the \"right\" decision but in reality it was a terribly executed military withdrawal \n\n4 afghanis with bricks could've tossed them into those engines and killed more than 800 Americans as they tried to take off. I mean.................. how can you stand by that. We are the most powerful military force on the planet and 4 guys with bricks could've killed 800 of them due to lack of planning",
            "title_similarity": "0.77843624",
            "sentiment_compound": -0.9561
        },
        {
            "id": "h9adwuj",
            "score": 0,
            "text": "Clearly not, look at what’s happened",
            "title_similarity": "0.10513687",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9akl4u",
            "score": 0,
            "text": "We gave them freedom. They had a taste but didn't earn it, so they don't value it. They have to take it if they want it back. As most of them wanted this let them have it. It offends us, but that's not our problem. They can sort their shit out.",
            "title_similarity": "0.57623655",
            "sentiment_compound": -0.7853
        },
        {
            "id": "h9b337e",
            "score": 0,
            "text": "Watch the videos of them training the Afghan army.   There was no way they were going to stand on their own.  Ever.  Just a bunch of uneducated, undisciplined, uncoordinated, extremely floppy, tiny men with zero allegiance to their country.  Now add inept cowards as their leadership.\n\nIt didn’t matter if you pulled out 10 years ago, today, or 10 years from now.  Afghanistan is chaos.  You can take an organized bad country and switch leadership, like Japan and Germany post WW2, but to take chaotic bad country and turn it around is next to impossible.  It’s a collection of tribes with next to no education, infrastructure, industry, and modern skill sets, and no allegiance to country or government.\n\nIt was doomed to fail, and it was just everything Eisenhower warned about.  Biden did the inevitable.",
            "title_similarity": "0.7380459",
            "sentiment_compound": -0.9864
        },
        {
            "id": "h9b6mn8",
            "score": 0,
            "text": "The Taliban takeover was always gonna happen whenever we left, the people trying to pull the “we should’ve left but what was the rush!? Now wasn’t the right time!” card are idiots. It wasn’t rushed, the withdrawal was announced 14 fucking months ago",
            "title_similarity": "0.75541514",
            "sentiment_compound": 0.1862
        },
        {
            "id": "h9bac04",
            "score": 0,
            "text": "the choice biden made is an affront to all the lives and limbs service men from all the nations involved gave up in the pursuit of providing freedom to the region from the clutches of religious zealotry. while i am ok with the gradual reduction of force in the area, the manner in which we moved out of the region was to abrupt. i feel sorry for all the females in the region the most as they got to taste what freedom tastes like for a moment before being enslaved as property once again by the taliban. the lack of organized departure also leaves a lot of our civilian allies (interpreters, informants, etc) that helped us vulnerable to the taliban along with all the militia we were training as the taliban is going house to house killing those that helped the allied forces.",
            "title_similarity": "0.71660346",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9bi51s",
            "score": 0,
            "text": "Why is NATO not getting grief from this and only USA. People from Britain have suffered from this war aswell as other countries.",
            "title_similarity": "0.68711853",
            "sentiment_compound": -0.6675
        },
        {
            "id": "h9bkz9u",
            "score": 0,
            "text": "No one who isn't a media addict cares, it's typical internet drama",
            "title_similarity": "0.47064084",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9btw6a",
            "score": 0,
            "text": "Lol. They left weapons. All women are off streets, they just released all prisoners as well as forced recruited all the 12+ males. We will be back. Probably around midterms.  lol the fact reddit blocks me. proves it.",
            "title_similarity": "0.6185332",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9a4tvb",
            "score": 11,
            "text": "90% of the replies on here are weird metaphors basically saying yes leave, but like this and not that. People turn to metaphors here because they don’t know wtf they’re talking about.",
            "title_similarity": "0.5939065",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h9999xo",
            "score": 3489,
            "text": "It’s not that pulling out of Afghanistan was the wrong decision. Bringing our troops home and trying to end wars is a good thing, but the issue is with how it was done, and how quickly all of our efforts were basically vacuumed up. We spent 20 years there. Thousands of troops back and forth, lives lost, and the Taliban take it back in less than 2 weeks? It leaves a sour taste in your mouth, especially for our veterans who risked their lives to try and help stabilize things over there. To have 20 years worth of time and energy crumble so quickly… it pisses you off. It makes you feel like it was all for nothing. That you risked your life and watched friends die for nothing. \n\n\nIt makes you wonder **what** the hell we were even doing over there. If we couldn’t help the Afghani people stabilize their country enough to manage 2 weeks without us, it makes it all feel like it was in vein. That’s why people are pissed about it. If you spent years doing anything and it went up in flames within 2 weeks the first second you looked away… you’d be absolutely devastated, and a lot of people are feeling exactly that.",
            "title_similarity": "0.8771298",
            "sentiment_compound": -0.8976
        },
        {
            "id": "h99bvhs",
            "score": 1,
            "text": "The entire endeavour was a tremendous waste of human life and money, with the pretext based on abhorrent lies. Why it’s taken 20years is beyond me, just terrible terrible corruption in the US government.\n\nIf the Afghans by majority want shariah law, good luck to them. It’ll be an awful regime, but people learn at their own rate. I just hope those who are peaceful and good at heart escape and find comfort and fulfilment elsewhere.",
            "title_similarity": "0.80503356",
            "sentiment_compound": 0.9559
        },
        {
            "id": "h99dpu8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.025765255"
        },
        {
            "id": "h99jsxb",
            "score": 1,
            "text": "Except they pulled out only to station more troops in Asia.",
            "title_similarity": "0.42561883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h99qri2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.025765255"
        },
        {
            "id": "h99r30l",
            "score": 1,
            "text": "Bomb the country back … I mean forward to the stone age.",
            "title_similarity": "0.4073974",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h99ur44",
            "score": -1,
            "text": "I think anyone who has not spent time in country does not have a qualified opinion on the matter.",
            "title_similarity": "0.31912148",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9b0zc1",
            "score": 1,
            "text": "Biden is a fucking moron",
            "title_similarity": "0.27049443",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h9b2uu9",
            "score": 1,
            "text": "I'm not mad that we pulled out, I'm mad that our president was either lying to us or too stupid to realize what was going to happen when we pulled out. \"No Americans have been evacuated by helicopter from the roof of an embassy\". One month later that exact scenario happens. I also think it's funny that the same president said AR-15s would be useless against the American military. Guess what 75k Taliban used to kick out both American military and ANA?",
            "title_similarity": "0.79977906",
            "sentiment_compound": -0.8059
        },
        {
            "id": "h9b5cjz",
            "score": 1,
            "text": "20 years is not long enough. To change the culture a commitment of 50 years minimum. Maybe 100 years. We left too soon.",
            "title_similarity": "0.65407145",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9bido6",
            "score": 1,
            "text": "I'm Indian and don't have a personal horse in this race. \n\nThe American exit was a major fuck up IMO. I'm not talking about the way it was conducted...but the actual decision itself.\n\nWhile the root cause of the issue is the lack of a CLEAR long term strategic objective (End terrorism? Get Bin Laden?) and IMHO the sheer socio-cultural disconnect between the Americans and the Afghanis...pulling out was the wrong move, once you'd decided to \"Natio Build\"\n\nTwo Trillion USD is nothing compared to the Geopolitical Capital lost by your Country.\n\nThe US has lost footing and face in a part of the world that is currently vital to the overall balance of power. \n\nIt was myopic and damaging to potential relations that the US may have had to build in the near future. \n\nY'all are making a habit of not \"finishing the fight\" and it's going to bite you in the ass, 50 years down the line.\n\nThe saddest part is the resurgence of a regressive, extremist group that'll lead to oppression of a people who've honestly seen endless conflict for over a century. \n\nAt the cost of sounding sanctimonious and naive - sometimes (rarely) war is just. \n\nI believe a burden of responsibility rests on a democratic (relatively) benevolent superpower.",
            "title_similarity": "0.7627513",
            "sentiment_compound": -0.9601
        },
        {
            "id": "h9bk2g7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.02576524"
        },
        {
            "id": "h99q8rq",
            "score": 56,
            "text": "It's really a situation where every single solution is wrong. Afghanistan has been a victim of the conflict between the USA, Russia and to some extent China  since at least 1978. While most of the time since then was spent actively hurting Afghanistan, as far as I can judge, at least the last decade the UN mission led by the US made an actual effort of building a democratic nation that respects human rights. But as we've all witnessed, these efforts were made on barren land and even though the US and their allies (remember, the UK, Germany and other countries also had some stake in this disaster) invested large sums of taxpayer money, human lives and resources, they had no lasting effect.\n\nWas it all a pointless waste though? I don't know. The Taliban are preparing a big \"cleansing\" and I have no doubt it will involve thousands of executions of innocent people. Minorities will be persecuted and women will have their human rights thoroughly restricted. [This tweet is just one tiny sad example of it](https://twitter.com/NasimiShabnam/status/1427195802066333701).\n\n>A photo of a school in #Afghanistan closed due to security issues. The students showed up bright and early anyway. \r  \n\r  \n> Teachers said goodbye to their female students who won’t be allowed to go to school anymore. A numbing helpless feeling.\n\nUltimately it's the Afghan people that failed to hold up the ideals that we westerners take for granted. It would've been irresponsible to keep dumping resources into this lost cause, that couldn't be fixed in two decades by a multilateral effort of some of the worlds richest and most powerful nations. There's a German saying that goes: \"Lieber ein Ende mit Schrecken, als ein Schrecken ohne Ende\" which roughly translates to \"rather a horrible ending than endless horror\" and I feel that it perfectly describes the whole situation.\n\nOn the other hand I can't help but think what would've happened if the UN withdrew earlier or would've never stepped in. Surely the Taliban would've done unspeakable things in the meantime, right? Ultimately it's impossible to tell if withdrawing at this point in time was the right decision. Maybe withdrawing now turns Afghanistan into a breeding ground for the next 9/11. Maybe staying there would've prevented ethnic cleansing. My gut feeling tells me the same thing as your view you want changed and somehow this comment turned into a bit of venting for me, but really, there's no way to know right now.\n\nTime will tell.",
            "title_similarity": "0.8030964",
            "sentiment_compound": -0.983
        },
        {
            "id": "h9ajg1s",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.02576524"
        },
        {
            "id": "h99nrqw",
            "score": 2,
            "text": "I myself do not believe there was ever any other ending fated for the end to this invasion.\n\nIrregardless. Here is my attempt.\n\nTaliban takeover, at the pace it happened, is a data point and learning that will possibly dither other future American adventures. Without such adventures what is the bloated military budget going to focus on? Money pipeline is set. People need to get paid. Contractors won't just retire. Defense companies won't just scale back projects. Funding for these are gonna dry up. So as soon as the presidency changes or even during, you will see newer and more expensive and equally futile adventures for the American Military on the horizon. War is a huge part of American economy. What are you going to replace it with? There is little possibility of any serious investments in anything of actual citizenry value like climate change at a scale that will matter. So that is not gonna drive the economy. If you are still dreaming infrastructure, sure go ahead. America I know, will screw it up 100. So. Let's just twiddle our thumbs and hope that the powers that be Don't decide to invade another planet or our Oceans given the recent expose on UAP. \n\nReads so cynical. And maybe I am a bit too much. But look at history. I am seriously concerned about the private defense contractors influence on Americans and that there really are UAPs and that Americans are gonna figure out a way to screw that up too thereby screwing humanity forever. \n\nJust the right amount of paranoid for me.",
            "title_similarity": "0.82042336",
            "sentiment_compound": -0.7092
        },
        {
            "id": "h9asx8f",
            "score": 2,
            "text": "I just wish they'd pulled out with all the women and children. Left the crazy men there to beat each other senseless.",
            "title_similarity": "0.56943166",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h99hbo5",
            "score": -4,
            "text": "I dont think it was the right choice to make. Sure we shouldve never been there to begin with, but we were there and now we arent. So the place will become a major hot spot for future terroist plots, they have all the equipment the US left behind, there will probably be a spike in terror attacks in the years to come, the taliban will change the afhgan way of life for the worse. Women must be accomponied by men in public and have to cover themselves, they also wont be able to go to school. Whoever the taliban deems a disident will be murdered, they will murder homosexuals, the list goes on.\n\n Biden messed up and it aint about optics. Dont agree with him just because you think its woke, it was a bad call. He shouldve had a better plan about pulling out. He wouldnt even let contractors in the country to service their airforce, so now that the US is leaving they wont have one. The military is outgunned and almost useless. \n\nBasically it was a stupid move and I stand by that. There were so many better options, and now they are sending in more troops than were originally there to evacute people. \n\nTrump was a much better president lol.",
            "title_similarity": "0.7602941",
            "sentiment_compound": -0.9839
        },
        {
            "id": "h9aleco",
            "score": 3,
            "text": ">Billions of dollars and thousands of lives wasted.\n\nBillions spent sure (about a trillion dollars total, though only about 150 billion of that was on afghan reconstruction itself), but were those lives really wasted?\n\nThere are about 20 million afghan women and girls, and millions of 'collaborator' men about to find out the hard way what 3500 coalition war dead were fighting to prevent (the peak in 2010 at 495, down to about 20/year since 2015) . \n\nThe US was down to 4000 soldiers in Afghanistan, providing primarily logistics and air support, while the afghan army did the bulk of the fighting the last few years (the part of the army that wasn't just papered over corruption).  The moment the US left, the Afghan army had to ask what was the point in fighting?  If they started to lose they were going to be brutally slaughtered and there was no one to help.  That's the problem with the US pull-out: the afghans that were willing to fight were only willing to do so if they thought someone would back them up if it started to go badly.  \n\nThe afghan army had no confidence in itself (with some justification clearly).  Building that takes a long time, and the manner in which the US left could have been better, obviously.  In hindsight (which is irrelevant now) the US should have pushed the afghans to take full responsibility for their operations even with the US in the country, and the US would only be involved if the the Afghans couldn't achieve their own victories or discovered they needed something they didn't have.  Building that confidence takes time, but it also needs to be grounded in reality: If you're on your own, and your enemy has an endless supply of fanatics who need not follow any rules of war you might just be fighting to die slightly later.  \n\nConsider the options the Afghans had:  If they tried to fight for every inch of ground, and started to lose, then what?  The americans made clear they weren't going to help, so everyone just gets slaughtered?  Why fight if the Taliban are willing to cut a deal of not slaughtering everyone that is, at least if you're one of the people in line to be murdered probably preferable.  Unfortunately, that leaves a large number of people to be murdered with no ability to fight back. \n\nBut then staying there, for what is an unfortunately long number of years can be a solution.  A 30 year old university graduate who is currently an activist or a local level politician would be the future President of Afghanistan.  They could, unfortunately turn out to be just as corrupt and incompetent as many of the post colonial governments around the world, or they could turn Afghanistan into South Korea or Taiwan or Malaysia or Chile or Thailand, or could have, they don't have that chance likely now. \n\n> pulling out of Afghanistan is something that both Obama and Trump campaigned on and never followed through with.\n\nNot all campaign promises should be fulfilled.  Talking points are just that, and there's a difference between having 500k troops (or 110k as the US peak in afghanistan was) versus 5000 or 2000 or 500 or whatever.   \n\n>Yes, of course, entering the war was a mistake and it would've been more ideal if we were never in Afghanistan in the first place.\n\nIn what way was it a mistake?  Should Al Qaeda have just been allowed to harbour in Afghanistan, hijacking aircraft around the world and crashing them into things with impunity?  Should they have just been allowed to keep car bombing things in the US, or bombing US warships and embassies?  The taliban protected and shielded Al Qaeda and provided them a safe harbour.  Don't forget who these assholes are.  \n\n>Staying in the war even longer in the name of more \"nation-building\" would've only resulted in the same exact thing we are seeing right now\n\nPossibly.  That's the counterfactual that's hard to know.  The Taliban were only charge of parts of Afghanistan from about 1994 - 2001, and more than half of the population of afghanistan has been born since 2001, there are a lot of people in the country who have been educated in a semi western (since the coalition occupied the place) way who might be willing to fight but who are still too young.  You don't put a fresh 20 something university grad in charge of an army of 300K people - and so all the middle and senior leadership in Afghanistan are these old fossils of warlords and mujahedeen, or exiled academics and that sort of thing.  It's not like Nazi germany where there were a lot of completely competent non Nazi's who had been in positions of power until around 1939, so when the Nazi's are turfed out in 45 the allies could turn to people who still had some experience actually running the government.  There's no equivalent in afghanistan: The place has been a mess for decades.\n\nAfghanistan is much more like Korea that is obvious on the outside I think.  The koreans had almost no internally capable people to run the country in 1945, having been completely occupied by Japan for 35 years (and partially for about 35 before that).  It took easily 40 years for the transformation of South Korea to really start to take hold, and it's been 75 years for them to become a full blown developed democracy.  Whether that would have worked in afghanistan we will never know.  But we do know that 10's of millions of people are going to suffer because the US wasn't willing to keep 5000 soldiers in the country a day longer.",
            "title_similarity": "0.7407412",
            "sentiment_compound": -0.9989
        },
        {
            "id": "h9bl3op",
            "score": 6,
            "text": "The USA has 50,000 troops based in Japan in the interests of regional stability and they have been there since ww2. South Korea has 20,000 troops for the same reason since the 50s. The idea of keeping 5 or even 10,000 troops as a deterrent and to maintain stability really isn’t that unreasonable. The costs involved also aren’t as huge as is often made out by the media or whatever political party is currently the opposition. A lot of the past cost are just down to poor planning and irresponsible spending on projects doomed to fail.",
            "title_similarity": "0.72625303",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h9a25o1",
            "score": 22,
            "text": "The important things to remember are: \nWe spent 20 years and $2T training the Afghans\nTrump signed a treaty to remove US troops within 135 days\nBiden followed through\nThe Afghan army just rolled over\n\nClearly, we weren’t making a difference, just propping up a government and army with our weapons and money. You can’t force patriotism or democracy on people. If people want to be communists, or Taliban, they will. If the army would rather surrender than establish air superiority, they will. \n\nThe Kurds wanted democracy. The Kurds fought off ISIS with pickup trucks and light infantry. The Kurds deserved a nation. The Kurds deserved our weapons and money. We abandoned them.\n\nI think the greatest lesson of this is that the US needs to stay the fuck out of places where we are not wanted, and we need to only help people who want to help themselves. If you’re not willing to fight and die for your country,  for your people, why should we? The Kurds deserved better. Afghan children deserve better, but their army decided they’d rather rape little girls than fight for their right to read.\n\nLife is about decisions, and we can’t force people to make the right ones.",
            "title_similarity": "0.8773073",
            "sentiment_compound": -0.83
        },
        {
            "id": "h99nmwr",
            "score": 1,
            "text": "I don't think people argue that the pull out was a mistake, only that it was sudden, leaving Afghanistan to mercy of Taliban.",
            "title_similarity": "0.71268016",
            "sentiment_compound": 0.2815
        },
        {
            "id": "h99o6y8",
            "score": 1,
            "text": "Never should have been there in the first place. It was all so the military industrial complex and those who run it could get more money.",
            "title_similarity": "0.65167904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h99qr63",
            "score": 1,
            "text": "America stayed in the war because ego wouldn't allow it to walk away, why else would they torture and imprison their perceived adversaries without trial or transparency? Because they had something to hide- simple!",
            "title_similarity": "0.69135284",
            "sentiment_compound": -0.9092
        },
        {
            "id": "h99rl1v",
            "score": 1,
            "text": "It’s no action from us now but Things will change when they go after the oil again",
            "title_similarity": "0.5897256",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h99s79x",
            "score": 1,
            "text": "it had to happen eventually, the afghans showed the world they are incapable of being organized enough and smart enough to hold their own against an even stronger force. we spent 20 years training their troops to fight them off just for the afghans to turn around, drop their weapons and wave the white flag. america just realized they were fighting for a lost cause and decided to gtfo of there and snuck out when no one was looking. the negative reaction we are seeing is a knee jerk kind and only because people think we just abandoned them when in reality we just decided enough was enough and promptly fucked off.",
            "title_similarity": "0.8274982",
            "sentiment_compound": -0.9638
        },
        {
            "id": "h99tita",
            "score": 1,
            "text": "I feel like this is kind of an unfair position.   \nBecause any president (or any person for that matter) would have been considered the recipient of that decision because no one wanted to be in there.   \nObama and Trump both promised to get troops out, and neither did, probably because the area would have destabilized.   \n\n\nNo one disagrees with you that pulling out of Afghanistan was bad because everyone wanted that at some point.   \nBut was now the appropriate time? Was the way he did it the appropriate way? Would have sooner been better? Would later have been better?   \nWhat about the good people who are left and are now suffering?   \n[https://www.youtube.com/watch?v=9lQKSkfg7gk](https://www.youtube.com/watch?v=9lQKSkfg7gk)  \n\n\nI don't know.   \nI guess my thinking is, that while the war was a mistake. Good was being done.   \nIt's easy to make decisions when you look at the numbers.  \nBut it's harder when you realize that people will suffer from it.",
            "title_similarity": "0.80049765",
            "sentiment_compound": -0.3672
        },
        {
            "id": "h99tol3",
            "score": 1,
            "text": "As much as I can try to understand  why the US should've left Afghanistan (I was 3 when this whole mess started and everything seemed to have happened at once), I can't help but see another Hitler in the making. After WW2, Germany and/or Austria were facing deep poverty and disarray. So hungry and desperate as folks were that to the words of a failed art student were sounding legit. \nWith some Afghans now feeling abandoned and maltreated by the US, it might drive them to bitterness and have them make a leader that could be for the good or for the bad.",
            "title_similarity": "0.7127974",
            "sentiment_compound": -0.973
        },
        {
            "id": "h99ulhc",
            "score": 1,
            "text": "Just one thing, Trump did campaign to get it done and actually did get it done. However, all that Biden did is delay the date.",
            "title_similarity": "0.6673943",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h99vqw5",
            "score": 1,
            "text": "Pulling out is good, sure. But pulling out so fast just to send people back? How is that something you can stand by? That isn't pulling out. Sure he \"stopped digging\" but sending people back is going right back to digging. Really \"pulling out\" accomplished nothing.\n\nWe were also there fighting for human rights. Women weren't allowed to leave homes without a man, go to school, or work. It seems odd that people who want to leave suddenly ignore that, but are often also the same people advocating human rights.\n\nJust because the US leaves, doesn't mean the war ends. There will still be conflict and repercussions.",
            "title_similarity": "0.70405924",
            "sentiment_compound": -0.6269
        },
        {
            "id": "h99wwre",
            "score": 1,
            "text": "The only right decision would have been never to go in the first place.",
            "title_similarity": "0.48112792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h99xu5z",
            "score": 1,
            "text": "Occupying another country is like fisting someone you can't pull  out all at once or someone's gonna get hurt biden made a bad call and left a lot of people to die and doomed a lot more people to a hellish existence under a tyrannical regime",
            "title_similarity": "0.6041372",
            "sentiment_compound": -0.9565
        },
        {
            "id": "h9a257i",
            "score": 1,
            "text": "I mean theres perspective, for americas bank balance it might be a good decision. For the general good of the afghani people, probably not.",
            "title_similarity": "0.5398816",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h9a2uyt",
            "score": 1,
            "text": "Why did the US leave so many guns/weapons over there? Or did the Afghan government just hand these supplies over without a fight? Now the Taliban are even more powerful. I think pulling out of Afghanistan was the right thing to do but how the US pulled out makes no sense.",
            "title_similarity": "0.774824",
            "sentiment_compound": 0.2956
        },
        {
            "id": "h9a39kp",
            "score": 1,
            "text": "YES YES YES! How can you help a country/nation of people who don’t see the wrong in their ways. We will always be the enemy because we don’t follow their beliefs they will continue to kill their own and others like they have done for so long now. We must save our own people too and sadly the good people left behind are the ones who must suffer because there own people are so radicalised and full of such hatred",
            "title_similarity": "0.6688922",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h9a48la",
            "score": 1,
            "text": "I think we could have done more once we made a mess out of Afghanistan.\n\nAs I've said in other comments the ANA is well established to be a complete joke. How anyone could think they would keep the country in order is beyond me.\n\nAlso isn't this a bit like starting a fire then walking away saying \"oh well it's on fire now so we may aswell cut our losses\" surely if anything we need to work extra hard to provide Afghanis with a decent solution?",
            "title_similarity": "0.7649212",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9a4f30",
            "score": 1,
            "text": "I agree. At this point in time all we were doing was funding and supplying the taliban with weapons and cash. The only reason why the war lasted so long was because it was lining the pockets of so many. People forget how profitable war is. War is expensive and all that funding goes into big companies pockets. I remember watching a documentary years back and one thing that stuck with me is that we would send millions of dollars in cash to Iraq and Afghanistan on these pallets to give to government officials over there. Then the majority of money and weapons would be seized by curropt officials or by the enemy. Half of the weapons we supplied to the govts over there to supply their army and train them was being sold to terrorist on the back end. \n\nI stand by Bidens decision as well. Its not pretty what is happening but necessary. And I honestly don't think it could of happened in a \"pretty\" way regardless. The people of Afghanistan have clearly decided to not fight for their country.",
            "title_similarity": "0.8037281",
            "sentiment_compound": 0.173
        },
        {
            "id": "h9a4fei",
            "score": 1,
            "text": "Liberation* of Saigon",
            "title_similarity": "0.14568721",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9a4kuo",
            "score": 1,
            "text": "Trump did follow through on it, he just didn't have enough time in office to finish it, in fact the only reason Biden went through with the pull out is because of the groundwork Trump set that made reversing the decision basically impossible for Biden. Biden didn't choose to withdraw Trump did and Biden completely fucked up the evacuation.",
            "title_similarity": "0.75295705",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h9a4vqc",
            "score": 1,
            "text": "He did not transition out of Afghanistan, he is retreating under attack. Tens of thousands of people may be murdered as the Taliban comes back into power with new pogroms and these are people who were working with the US under our protection. Biden has deserted them and left them to be butchered.\n\nPulling out was right, the way he did it is wrong. This is a disaster.  The Taliban are going door to door looking for girls, as young as 12, to marry and rape. So yeah, rape slaves bad",
            "title_similarity": "0.72908545",
            "sentiment_compound": -0.9799
        },
        {
            "id": "h9a5cpa",
            "score": 1,
            "text": "Agreed. We've already wasted 20 years there. Another 20 wasn't going to change anything.",
            "title_similarity": "0.6600139",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9a5j3i",
            "score": 1,
            "text": "I don’t disagree - we should have just spent more time getting our translators and guides and informants out of there first. It was always going to be a shitshow.",
            "title_similarity": "0.6659996",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9a6t28",
            "score": 1,
            "text": "Your right. People are just frustrated it was all for nothing.",
            "title_similarity": "0.376321",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9a6xj2",
            "score": 1,
            "text": "1) Trump had already made the decision, Biden just extended the timeline (and still f'd it up).  \n\n{I do not support Trump so STFU about that everybody reading this. }\n\n2)  Yes Afghanistan would have fallen either way, but we could've gotten the Americans and our allies out before it fell - with proper understanding what was going to happen - instead of Biden's denials for the cameras.",
            "title_similarity": "0.81226707",
            "sentiment_compound": -0.1353
        },
        {
            "id": "h9a7ymf",
            "score": 2,
            "text": "You have to remember this problem is essentially multifacet. While the original reason that we were there doesn't really exist anymore there was plenty of reasons for us to be involved in Afghanistan from a world safety and economic point of view.\n\nYes the USA should not be the world police, however the issue isn't so much with the Taliban taking control of Afghanistan as it is the political and military influence they can put on the surrounding world with control of Afghanistan.\n\nWith the US there we had essentially done at least a relatively decent job at keeping the fighting and political influence in Afghanistan's backyard.\n\nWithout the US the Taliban is now free to exercise political, monetary or military influence on Iran if they should so choose (at that point you have a Taliban with access to nuclear weapons).\n\nThere is no secret that there's a lot of oil in that part of the world. If they were to gain control of this they could essentially hold a relatively decent portion of the world hostage.",
            "title_similarity": "0.73757327",
            "sentiment_compound": 0.5824
        },
        {
            "id": "h9a86xu",
            "score": 1,
            "text": "It isn't just that he pulled out of Afghanistan.  It is the fact that he pulled the troops out overnight, without even informing the Afghans.  Not only that, they left billions of dollars of equipment behind, drones, Humvees, helicopters.  Which the Taliban now have in their possession and thanks to the news now that China is happy to establish relationships with the Taliban, they will have people who can show them how to use it all.\n\nThis isn't like pulling out of a Syria.  That was organised, done by increments.  Doing it like this Biden might as well have left a welcome mat for the Taliban. [Equipment Seized](https://www.independent.co.uk/news/world/americas/us-politics/taliban-seizes-drones-humvees-mraps-b1902308.html)",
            "title_similarity": "0.8003435",
            "sentiment_compound": 0.902
        },
        {
            "id": "h9a8an1",
            "score": 1,
            "text": "I think you should watch this interview with Rory Stewart, a former British MP who spent 2 years walking across Afghanistan https://m.youtube.com/watch?v=z0vU5E1jAyA",
            "title_similarity": "0.47492844",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9a97u0",
            "score": 1,
            "text": "I'm far from an expert. But we'd just started seeing the first young Afghani adults who grew up in a non-Taliban-led Afghanistan. It's hard to escape the feeling that if we'd held out an extra decade or so, we might have ended up with a generation of Afghanistanis who grew up free and were far more invested in keeping out the Taliban than the old guard who grew up used to the Taliban.",
            "title_similarity": "0.72954017",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h9aadvk",
            "score": 1,
            "text": "Hey I agree.  I HATE what is happening to those people over there and hope everyone that is trying to get out can.  But if their 300k strong army just fucking folds... then yeah it was in vain. We should have just got al Qaeda and then brought the un in to build the nation up",
            "title_similarity": "0.7914954",
            "sentiment_compound": 0.6032
        },
        {
            "id": "h9ab6po",
            "score": 1,
            "text": "I agree leaving was the correct thing to do- but more than bad optics, the withdrawal seems to have been poorly planned and executed, despite having been on the books since the trump administration. I’d desperately love to see us end the other occupations as well, but doing so will be a hard sell for most Americans if it involves literally handing over billions of dollars of arms & equipment to our literal enemies.",
            "title_similarity": "0.84732485",
            "sentiment_compound": -0.627
        },
        {
            "id": "h9ab75f",
            "score": 1,
            "text": "Tens of thousands of people we should have gotten out are still there. That's actually much more difficult to do now that the Taliban control the entire country. He's authorized a troop presence double the size of what it was a week ago just to go back in and find these people. These people, many of whom are now hiding from the Taliban, and will be harder to find without the intel and infrastructure, the previous government. We were in control of the situation, and now we have to rely on the Taliban's cooperation to wrap it up.  \n\nWhy couldn't we take 6 more months to do things more strategically?",
            "title_similarity": "0.78013265",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h9abh3g",
            "score": 1,
            "text": "Trump did go through with it. He signed whatever bill or order to pull them out. Do you seriously think Bidens administration alone could've achieved that in 8 months? This is the US government. But aside from that I agree.",
            "title_similarity": "0.74390376",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9ablxq",
            "score": 1,
            "text": "> But pulling out of Afghanistan is something that both Obama .... campaigned on\n\nWait.  What about Obama's Afghan Surge where he moved 150,000 troops into Afghanistan in a failed attempt at nation building? That was bigger than Iraq. \n\nThe mess we see today is the result of that.\n\nBiden was a part of that administration, but he claims he was against it now.   Trump was right to finally end this mess, but Biden severely screwed up the execution.  Any consideration of whether his move was right or wrong should be based on the results.  Today in the carnage a desperate Afghan was crushed in the landing gear of an evacuation plane.",
            "title_similarity": "0.81341827",
            "sentiment_compound": -0.9856
        },
        {
            "id": "h9abpcr",
            "score": 1,
            "text": "Trump was the one who decided to pull troops out, not Biden. So I am glad you agree with Trumps decision. Biden’s decision was to uphold or to keep going to war, he had a short time to make this decision (Trump set a date of May 1st, 2021).",
            "title_similarity": "0.7653212",
            "sentiment_compound": 0.2177
        },
        {
            "id": "h9ac1fu",
            "score": 1,
            "text": "This is the second coming of what the CIA did in Laos and Vietnam in the 70's.",
            "title_similarity": "0.3900131",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ae96s",
            "score": 1,
            "text": "The only issue I have with it is that nothing is being done to prevent groups like the CIA from funding the next Taliban. It's all well and good to cut your losses, but until you deal with your gambling addiction itself you won't fix anything. In that sense, pulling out is a part of the right move, but they still haven't completed the move as much as they should.",
            "title_similarity": "0.75881386",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9aeha7",
            "score": 1,
            "text": "Agreed, We don’t need to be the world police.  It’s a good thing we’re out. I lost friends to that pointless war and it’s infuriating that they were there to begin with.",
            "title_similarity": "0.71510446",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9aeqa8",
            "score": 1,
            "text": "What about abandoning all the people that helped us? It’s the most shameful thing I’ve seen our govt do in my life and I’m old so I’ve seen some stuff.",
            "title_similarity": "0.64680845",
            "sentiment_compound": -0.7264
        },
        {
            "id": "h9afm3j",
            "score": 1,
            "text": "That pullout wasn’t started by Pres Biden but by Trump and Pres Obama. It just took forever to get the fuck out of a losing war and now the right is blaming Pres Biden. The reality is good news for our Military and that we are no longer at war and we can stop sending our troops home in body bags.",
            "title_similarity": "0.85660326",
            "sentiment_compound": -0.9796
        },
        {
            "id": "h9agcr9",
            "score": 1,
            "text": "Dumb question but why instantly did people freak out? Like they knew we were withdrawing troops and knew the taliban would be back. I’m not even talking about leaving but just the panic/freak out? I’m assuming the media played it up. Also were the taliban murdering everyone they came across? Like why kill yourself by holding on to a plane? Did anyone make it to another country holding on to that plane?",
            "title_similarity": "0.7139887",
            "sentiment_compound": -0.9163
        },
        {
            "id": "h9agkup",
            "score": 1,
            "text": "I played soccer and about half the team was from various middle eastern countries. They have been saying for years that we have been wasting time and money and would accomplish nothing.",
            "title_similarity": "0.6248902",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9aguo3",
            "score": 1,
            "text": "For one he was a fucking idiot not listening to a advisors. When interviewed he was all gung ho about a takeover not being possible and saying the ANA were well trained and equipped just as well as most countries armies…..wtf. And then he even denied the fact that his advisors told him what would happened and said no they said no such thing when mentioned about them telling him so. All of these people warned him and warned him but he still could t fucking listen. Yeah it’s the fault of all presidents back to bush but damn, trump at least had some logistical process for it to be done correctly. He fucked up.",
            "title_similarity": "0.76618123",
            "sentiment_compound": -0.9471
        },
        {
            "id": "h9ahz1k",
            "score": 1,
            "text": "I don't really see why going against known risks and warnings from generals is considered a good thing to you...",
            "title_similarity": "0.50284153",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9aipd6",
            "score": 2,
            "text": "My only quarrel with it is not bringing the interpreters that supported the US out when we left and giving them full citizenship for their help.",
            "title_similarity": "0.65009356",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h9aiubj",
            "score": 1,
            "text": "Biden didn’t make the right decision though. Pull out fine, but do it with a little more planning and tact. It seems you’re defending Biden more so than the premise of leaving. \n\nBearing in mind we’ve been there for 20 years and have the most advanced military in the world, there’s 0 excuse for the haphazard exit. We’ve been there for so long, at this point a few more weeks to do it RIGHT would have at least resulted in less chaos. We could have quietly started pulling our people and the Afghans who helped us out over time, brought the weapons, and not given up everything. Now we’re in just as bad a position as we were last time Taliban ran the country. It’s going to turn into a breeding ground for terror again.",
            "title_similarity": "0.8632891",
            "sentiment_compound": -0.9434
        },
        {
            "id": "h9ak8iy",
            "score": 1,
            "text": "Could have taken the f*cking hardware with though, at least.",
            "title_similarity": "0.32714638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9akr8k",
            "score": 1,
            "text": "I agree that leaving Afghanistan isn't the problem. But like you said, we spent 20 years there. How and why did the US military fail so badly to try and help this nation? Having all our work collapse so fast means we either sabotaged it, or there was no real work done to begin with. Why did we pull out so quickly and leave so many people in danger? Why didn't we have a plan B in place - just in case? We have the richest military in the world. We should have done better.",
            "title_similarity": "0.8835237",
            "sentiment_compound": -0.8197
        },
        {
            "id": "h9akvmx",
            "score": 1,
            "text": "Agreed. It had to happen, he had the guts to do it and take responsibility and stand behind it.\n\nRemarkable!",
            "title_similarity": "0.4276097",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h9al8wx",
            "score": 1,
            "text": "No paragraphs for me. All I have to ask you is, why is pulling out of Afghanistan an option within the context of \"we can't stay there forever\", when:\n\n1. The US/NATO literally invaded Afghanistan and removed the government from there, effectively becoming responsible for the country.\n\n2. The US maintains a military presence of over 600 bases overseas, some of which to our knowledge are also in volatile regions like the DMZ, Qatar and Djibouti. Why is there such heavy priority to pull out of Afghanistan, when intelligence reports that even the PUBLIC is aware of, have categorically stated that doing so will result in the return of the Taliban, all of the ANA infrastructure and weapons being handed over to the Taliban, and the eventual oppression of all local women and girls?",
            "title_similarity": "0.7546368",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h9ald09",
            "score": 1,
            "text": "When you are more concerned with all the laundered money that went back into the US anyhow, than screwing over other people's lives and creating yet another wave of refugees that you will wipe your hands clean and let others take care of.",
            "title_similarity": "0.63798964",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h9alo0t",
            "score": 1,
            "text": "That's like saying \"look at these pros but ignore the cons column.\" Only looking at the benefits isn't smart decision-making.",
            "title_similarity": "0.50163543",
            "sentiment_compound": -0.2469
        },
        {
            "id": "h9alqp9",
            "score": 1,
            "text": "Pulling out was great, but the way it was done not so much. \n\nAs other comments have stated. We laid the foundation for a house and just left. No turnover nothing.",
            "title_similarity": "0.51127243",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h9amgki",
            "score": 3,
            "text": "The idea of withdrawing was not the problem: the way the withdraw was done was the problem. \n\nBiden ignored and neglected his top foreign policy advisors to push through this withdrawal. The remaining 2,500 U.S. troops snuck out of there base in the dead of night with no notice to Afghan forces or the government. \n\nThe Taliban took over in less than a month, despite Biden arguing otherwise, and now he sent 7,000 troops back into Afghanistan to secure the airport and evacuate American citizens. They have completely neglected Afghani nationals who served as translators or worked with Americans. 8 Afghanis were killed at the airport by U.S. forces, their allegiance is unidentified. \n\nMore than 600 Afghanis were crammed into the fusilage of a military plane with no processing, discussion of allegiance, or prevention of COVID measures in sight. People on the outside of the plane clung to the wheel and got crushed and others who grabbed the sides fell to their deaths. \n\nThis withdrawal gave no warning to other allies such as the U.K. and Germany who had to swiftly initiate evacuation procedures. \n\nThe U.S. left behind military gear that is now in the hands of the Taliban. Al Queda and other Islamist terrorists organizations can come back and enact terror on U.S. soil. Not only that, but the success of the Taliban inspired the Taliban of Pakistan to focus more on overthrowing the government and inspired other Middle Eastern Islamists to take over the government. Refugee Afghanis to a third country may be completely untraced. \n\nThis withdrawal was an absolute disaster on all fronts, a clear and direct display of the lack of competency of the Biden Administration, and an International embarrassment.",
            "title_similarity": "0.738989",
            "sentiment_compound": -0.7432
        },
        {
            "id": "h9amty9",
            "score": 1,
            "text": "Maybe.  But the way Biden did this is what is so terrible.  His administration did not plan removal well.",
            "title_similarity": "0.47966993",
            "sentiment_compound": -0.8275
        },
        {
            "id": "h9ao512",
            "score": 1,
            "text": "The actual best decision was to leave, but 1) adequately prep the Afghanis and not surprise them with empty bases one morning 2) arrange a thorough defence strategy to evacuate all our staff, all our allies who helped us for years and will suffer horribly when they are found 3) arrange superior air power to bomb the ever loving fuck out of the Taliban as they inevitably advance - like Israel when they faked out the PLO troops with reports of a ground strike, then buried the poor bastards in their tunnels by bombing all the entrances. \n\nAs it stands, we fucked our allies over, lost tons of equipment, completely wasted 20 years, and utterly doomed hundreds of thousands to death, torture, rape, oppression and slavery.",
            "title_similarity": "0.7758814",
            "sentiment_compound": -0.9969
        },
        {
            "id": "h9ap2yz",
            "score": 1,
            "text": "You are right",
            "title_similarity": "-0.012582887",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9apfvr",
            "score": 1,
            "text": "There’s more going on in the world than just that, and that’s not the main reason Biden pulled troops out.\n\nAfter the cyber symposium, Biden’s team would like you to pay attention to ANYTHING ELSE.",
            "title_similarity": "0.59012854",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9aplza",
            "score": 1,
            "text": "Leaving was inevitable, and the right choice. It should be a lesson against Nation-building, which is where we ultimately failed. The Military is well designed for removing threats, but we can't expect them to build the next Government as well (without radical changes to strategy, leadership, training, etc.).\n\nAs others have mentioned, our legacy of abandoning allies is extremely problematic from a reputation, diplomacy and moral standpoint. How can we expect people to risk everything when they can reasonably expect to be left in airplane exhaust?",
            "title_similarity": "0.77771556",
            "sentiment_compound": -0.9184
        },
        {
            "id": "h9apt28",
            "score": 1,
            "text": "I think pulling out was correct but timing was poor. It should have been a longer withdraw just so that we didn’t leave hundreds of million of dollars in military assets in country.",
            "title_similarity": "0.7677211",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9apx1r",
            "score": 1,
            "text": "Did the right thing?\nDID THE RIGHT THING?\n\nPeople are not simply going to lose their lives because of this (pick one) abysmal fuckup/criminal malfeasance/humanitarian disaster/complete lapse in leadership.\n\nThey will be executed.\n\nMen, women, and children.\n\nPlease, see yourself out.",
            "title_similarity": "0.6550425",
            "sentiment_compound": -0.1926
        },
        {
            "id": "h9aq83j",
            "score": 1,
            "text": "**President** Biden made the right call, and his speech was very intriguing.",
            "title_similarity": "0.44850123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9aq9rw",
            "score": 1,
            "text": "Right decision but done in a horrible way. Trump had a plan to take troops out but Biden just tuck everyone out all at once.",
            "title_similarity": "0.6812049",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h9ardym",
            "score": 1,
            "text": "I agree wholeheartedly.  They were never going to be willing to fight for themselves and their women & children.  To me the majority of them just seem like cowards.  Granted I really don't know anything about it, but the Taliban were far behind all of the technology we gave them.  They just gave up without a fight.  It just isn't our job to take care of a country who refuses to even fight for itself.  We have our own domestic issues that need our resources and attention.  It was time to stop the bleed.  I am horrified for all of the civilians who will suffer under the Taliban rule, but we tried for 20 years to help them and now it is like we were never there at all.  They just wasted (stole) our money and cost American lives.  So tragic, but not our fault.  We did so much more than we ever should have to help them.",
            "title_similarity": "0.758043",
            "sentiment_compound": -0.6991
        },
        {
            "id": "h9arec5",
            "score": 1,
            "text": "Absolutely needed to withdraw from Afghanistan.\n\nBut Biden absolutely botched the execution of the withdrawal. He deserves that blame, without a question. \n\nIdea great, plan horrific.",
            "title_similarity": "0.7243377",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9arrvp",
            "score": 1,
            "text": "Y'all having 2 different arguments here.\nPoint 1- \"pulling out of Afghanistan was the right decision...\"  Almost everyone agrees with this, almost everyone also agrees the manner in which it was done was bungled.\nPoint 2- \"It's xxxs fault.\"  The more important conversation should be how/where it went wrong and what could have been done differently and how might this be managed better in the future.  Sadly, it always devolves to my guy vs. yours.",
            "title_similarity": "0.7444698",
            "sentiment_compound": -0.6427
        },
        {
            "id": "h9as0na",
            "score": 1,
            "text": "Tell that to the women and children",
            "title_similarity": "0.049967736",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9asxm9",
            "score": 1,
            "text": "We never should have been there in the first place. If we really just had to have a war there it should have just been simple turn all the places they want to hide into a lake and be done with it.",
            "title_similarity": "0.6643638",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9au9xs",
            "score": 1,
            "text": "Didn't Rambo fight WITH the Taliban, I'm so confused....",
            "title_similarity": "0.5367143",
            "sentiment_compound": -0.204
        },
        {
            "id": "h9auc0n",
            "score": 1,
            "text": "No shit, that is the correct view",
            "title_similarity": "0.1106036",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h9aukpe",
            "score": 1,
            "text": "The Obama administration did the exact same thing in 2014. We left the whole country and watched it topple within weeks. Just to go back within 10 months. \n\nI went in 2013 and again in 2018-19. We were making huge  amounts of progress with a different mission-set. None of the reporters squawking from Kabul can say anything to the truth of the country. They had an effective militia on its way to becoming a military (ANA) and an ineffective regional government. \n\nLet’s discuss WHY the country fell within weeks - foreign influence from China, Iran and Pakistan. China has embraced the Taliban regime and the new Taliban-president of Afghanistan was in hiding in Pakistan, just like Osama bin Laden. The Afghani and Pakistani people are tied by tribal affiliations, they are both mostly Pashtun and will recognize that similarity over a country any day. \n\nThis was a proxy war that Joe Biden capitulated to china and Iran. \n\nJoe Biden just destabilized the entire Middle East, but don’t worry, we’ll go back within a year. Someone set a timer and prove me wrong",
            "title_similarity": "0.7598841",
            "sentiment_compound": -0.743
        },
        {
            "id": "h9aut36",
            "score": 1,
            "text": "Agree and not because Biden did it. Trump initiated the process. And. Biden could stop it but he knows that it is an unwinable war. Country falling in 8 days proves that. I feel bad for Afghan people, we need to evacuate all the helpers ASAP.",
            "title_similarity": "0.8209822",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h9autkc",
            "score": 1,
            "text": "Many people think it was the right thing to do, but the taliban are now flying blackhawks and driving MRAPs. Along with the countless fully functional machine guns being discovered. It would not have been difficult to destroy the vehicles (explosives, destroying electronics, etc) and I’m sure they could have melted or deformed the guns. Whether or not this has anything to do with Biden, I don’t know. But it makes sense to blame him because if it wasn’t his fault it should’ve been, this is a major move he should have been more of a part of (if he wasn’t).",
            "title_similarity": "0.77730525",
            "sentiment_compound": -0.9133
        },
        {
            "id": "h9aux1c",
            "score": 1,
            "text": "We were supposed to get out all the people that helped us first. We asked the afghan people to help us then left them to die. How do you think it's going to go next time we ask someone to help us?",
            "title_similarity": "0.6033813",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9avkjx",
            "score": 1,
            "text": "Trump made the move to pull out. No Biden. We’d likely still be in Afghan if it wasn’t for trump.",
            "title_similarity": "0.70050234",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9avs1b",
            "score": 1,
            "text": "Since the USA was the one that created the Taliban in the first place it should at least pay reparations to the citizens after leaving them with the mess it created there",
            "title_similarity": "0.68632054",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9aw20h",
            "score": 1,
            "text": "As a lefitist and Biden hater, he did the right thing, however Biden is ramping up the war drum aganist Cuba, Venezuela, Iran and China so remember the fall of Kabul as a lesson against War.",
            "title_similarity": "0.73761153",
            "sentiment_compound": -0.891
        },
        {
            "id": "h9awi0j",
            "score": 1,
            "text": "I agree that we should have left Afghanistan. I also don't entirely mind how it was done, because if it wasn't done decisively, it would never get done. \n\nHowever, what we should have done is evacuate more people. Get everyone out first. We pulled out so fast we left soldiers behind. Some of our own soldiers, not to mention thousands of Afghanis who want to leave or aided us.",
            "title_similarity": "0.77664393",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9awqaq",
            "score": 2,
            "text": "The US created this monster by funding the Afghans in its fight to stop 'communist' Russia from spreading to the middle east, it's easy for the US to get on the high horse now and say 'we're ending this war, we won't nation-build any longer' , but the US caused this, the interventionist and imperialist nature of the US as a nation has damaged not only countries like afghanistan but entire continents as well such as South America with the half a dozen dictatorships the US helped start. The US needs to be held accountable for its negative impact on the world somehow, and the backlash faced by Biden is just the start of that.   \nThe middle east came to bite the US in the ass once in 2001, it's going to do so again in the future if nothing is done.",
            "title_similarity": "0.79917634",
            "sentiment_compound": -0.9547
        },
        {
            "id": "h9awv7p",
            "score": 1,
            "text": "Going into Afghanistan half assed like we did was a bad move, and not committing to the conflict prolonged that war for this long. At any point the only correct answers were to pull out or go hell for leather, and everytime they had to choose the government went for option #3 which was to just hangout and hope the grossly incompetent Afghan national guard could achieve anything at all.\n\nThis whole thing was an avoidable shit show.",
            "title_similarity": "0.8026521",
            "sentiment_compound": -0.9567
        },
        {
            "id": "h9awyks",
            "score": 2,
            "text": ">Billions of dollars and thousands of lives wasted.\n\nTrillions of dollars which are gone. However, the American people have felt little pain from it. Let us not pretend that this is what has broken the bank. Thousands of lives and many more thousands injured. However its less human cost than brought about by automobiles, internal US violence, etc. I don't wish to underplay the significanc of their sacrifice but we have not lost so many soldiers considering the length of the conflict. \n\n> Yes, of course, entering the war was a mistake and it would've been more ideal if we were never in Afghanistan in the first place. But we can't change the past. \n\nAgreed, we can't change the past, what matters is looking forward and whether our withdrawal is the right choice. \n\n>Staying in the war even longer in the name of more \"nation-building\" would've only resulted in the same exact thing we are seeing right now, except a few years and many more taxpayer dollars and lives later.\n\nWell this is the contentious point. No one advocates staying there for fun. Staying is only worthwhile if strategic or moral goals are met. The rub of the issue is whether it is true that staying only would bring about more of the same.\n\nLet us consider the strategic value of a US military presence in Afghanistan. We are actively stabilizing the region. Afghanistan is going to be  flashpoint in the Middle East as various Muslim countries vie to influence. Also, China is sitting there and eyeing a country that is relatively weak but rich in natural resources. Our presence created some bulwark against China, yielding a possible operation point in the event of war or similar armed conflict. Presence can be a strategic objective. Notably our casualties had been minimal for many years though the country was not safe or particularly stable.\n\nMore convincing is the moral dimension, what some people term Nation building. After we achieved the initial objectives of our involvement in Afghanistan, we realized that we had absolutely fucked their infrastructure and held a situation we could not leave in good conscious. Additionally we decided to improve their situation with such radical ideas as allowing women to become educated. Part of the issue is that even 20 years is not long enough to so radically change the society. There is a generation of young people who experienced coed education. But the leaders are still the old. We began creating a society worth fighting for but failed to fight the graft and entrench values of a new society. The longer we are there, the greater the canalization of new values. The more people truly believe its worth fighting for. A man whose sister is a civil engineer will fight for her future rather than return to society where she cannot leave the house. \n\nLastly, our withdrawal horribly crippled the afghan army. While one might argue they should be an independent force, they are not. The US offered intelligence, mechanical support, and morale boosting backing. The Afghan army was still functioning on a WWII level of expertise (obvious exaggeration). Gun and mortars not predator drones and Abrams tanks. They cannot support advanced weapons systems effectively. There's a difference between active fighting and supporting their use of these systems. The counterpoint is that people were enriching themselves. A systemic problem of that part of the world.",
            "title_similarity": "0.8269421",
            "sentiment_compound": 0.7312
        },
        {
            "id": "h9axp5p",
            "score": 1,
            "text": "Technicality: If you’re 100% convinced, then nothing is going to change your view…",
            "title_similarity": "0.43745345",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9ayjhz",
            "score": 1,
            "text": "This was started February of 2020 when trump signed the “peace deal” with the taliban guaranteeing removal of all troops within 14 months. It’s still a good thing but all the Biden bashing seems to forget this small detail. The GQP didn’t forget, they just deleted the page on trumps website detailing the “wonderful peace treaty”.",
            "title_similarity": "0.7859041",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9aym4p",
            "score": 1,
            "text": "It was actually trump that started the action of pulling troops out, it just finally happened because shit in the government always takes a while, red tape and shit. Not a trump supporter, but I think we all need to remember who exactly is responsible for the decision, even if it is taking place under Biden’s presidency",
            "title_similarity": "0.8042601",
            "sentiment_compound": -0.2633
        },
        {
            "id": "h9aytpl",
            "score": 1,
            "text": "Yeah, fuck Afghanistan. It’s neither trump, Obama or bidens war this is GWB who got us into this.",
            "title_similarity": "0.6022284",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h9az84d",
            "score": 1,
            "text": "So you agree with removing rights from all those women and making them now cover their entire bodies including face, and not show any advertisements with skin etc.  You agree with leaving them behind when they are so desperate they are now falling off planes at 1000 feet?  It honestly reminds me of people jumping from the twin towers, we've now caused their 9/11, but an eye for an eye right?   You think denying women education is the right decision?",
            "title_similarity": "0.7305964",
            "sentiment_compound": -0.3174
        },
        {
            "id": "h9azgjo",
            "score": 1,
            "text": "It was always going to be a hot mess.  After 20 years of setting up their government  and training their military to resist the Taliban, they collapsed in a single weekend.  It was always going to happen, we just didn't realize how quickly.  What you are watching today is the exact reason I opposed the invasion in the first place back 20 years ago.\n\nThere just isn't a way to pull out of a country you destroyed without the locals assuming governmental functions and in that circumstance the strongest survive.  In Afghanistan, this is the Taliban.  Obviously, the Afghans themselves support the Taliban over the US occupation. as evidenced by their numbers and the ease with which they assumed control. \n\nWithdrawing the troops from Afghanistan and Iraq was the only issue I agreed with DLT on, but in the end he didn't have the cojones to actually pull the trigger.  Joe Biden made a very difficult decision knowing he'd take a boatload of grief, but he had the courage to do what has to be done.  \n\n\nOh by the way:  It's going to happen in Iraq the same way.",
            "title_similarity": "0.8990392",
            "sentiment_compound": -0.4569
        },
        {
            "id": "h9azk0w",
            "score": 1,
            "text": "The withdrawal was so badly handled. US didn't even hold on to Bagram, which would have made evacuations easier. \n\nOn top of which they've not dismantled the equipment, leaving behind a shitload of arms, ammunition, humvees, vehicles, state of the art drones, aircrafts for the Taliban to use. Which they will, to the detriment of the entire neighbourhood.\n\nThis disorganised withdrawal is criminally irresponsible.",
            "title_similarity": "0.72627926",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h9azsup",
            "score": 1,
            "text": "I think we can all agree leaving that shit hole was the best but the way we did it was messy and WRONG and that is what Biden needs to make up for",
            "title_similarity": "0.66257167",
            "sentiment_compound": -0.8151
        },
        {
            "id": "h9b09yc",
            "score": 1,
            "text": "Biden didn't kickoff the pullout, Trump did. Why are you putting this on Biden?",
            "title_similarity": "0.55168444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9b0lws",
            "score": 1,
            "text": "I personally think we should have just declared Afghanistan an American colony and offered everyone American citizenship.",
            "title_similarity": "0.5989877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9b0vwi",
            "score": 1,
            "text": "A lot of coverage calls this America's longest war but that isn't remotely true. We fostered a short period of peace in Afghanistan with a long period of bloodshed by both US/allied troops as well as Afghans. That short period needed to be longer to truly take hold.\n\nThe longest war the US has conducted as been the one in Korea which we have been doing since the 1950s. We have drawn down our presence there in the last few years but we are still holding over 22,000 troops there both as an APAC base of operations and as a force to deter North Korea from attacking South Korea.\n\nPulling our out of Afghanistan now would have been like pulling out of Korea in the 1970s and letting the North Koreans completely take over.",
            "title_similarity": "0.764956",
            "sentiment_compound": -0.0767
        },
        {
            "id": "h9b0w6x",
            "score": 6,
            "text": "There's been a fairly overt attempt to twist the narrative into being about staying vs leaving instead of the real controversy, the manner in which it played out. I'm not pissed off that we left; I'm pissed off because we yanked out our support before properly evacuating everyone who supported our cause and now fear for their lives and their families' lives. I'm pissed off that we were fed the narrative that the Afghan army could handle itself, that we wouldn't see helicopters evacuating people from the roof of the embassy. It's clear at this point that a number of people up the ranks felt that this was a possible (if not likely) scenario. So, it was either a complete, abysmal failure of planning and intelligence, or an outright lie.\n\nThere's been a lot of finger pointing at Trump and Biden, which is pretty childish (albeit expected). Trump is a moron who surrounded himself with morons, and surely would have bungled things just as badly if he were reelected. But at the end of the day, this happened under Biden's watch, after repeated assurances it wouldn't. \n\nAnyway, it's happening. It sucks, but it's finally happening. Hopefully not too many more people suffer than what was inevitable.",
            "title_similarity": "0.7761671",
            "sentiment_compound": -0.635
        },
        {
            "id": "h9b101i",
            "score": 1,
            "text": "The issue I see, probably the biggest one is: why would any of our military ever sign up for another war? Maybe private outfits and profiteers? But regular kids out of high school? Why’d you ever sign up? Especially given all the atrocities witnessed?\n\nAnd for regular civies, why foot another 2 trillion? Why send your kids off to die? For good dental and a shitty life insurance policy?\n\nI get it, the privateers are big business and employ a lot of people, but hey I’m sure they can just learn to code amirite?\n\nIt’s gonna suck big balls for Taiwan tho…\n\nOtherwise, yeah pulling out is always the answer, just gotta be careful on where you bust; nobody likes sloppy ropes.",
            "title_similarity": "0.7471489",
            "sentiment_compound": -0.3421
        },
        {
            "id": "h9b18we",
            "score": 1,
            "text": "He didn’t make the right decision. At all. Now Muslim refugees and potential terrorists are going to be brought to the US.",
            "title_similarity": "0.6344223",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9b1olv",
            "score": 1,
            "text": "Depends. Criticising the withdrawal could just be criticism of the Yanks' idiotic presence there to begin with, how they've been killing, more than building schools, roads and so forth. And they could have learned from their mistakes, and actually began a campaign of rebuilding and developing. But... nope. They always chose the easiest and most idiotic solution: quick pull out. Same in Vietnam.",
            "title_similarity": "0.73446023",
            "sentiment_compound": -0.7765
        },
        {
            "id": "h9b1q1o",
            "score": 1,
            "text": "Your first point is all I need to stop reading. You started the conversation by putting a price tag on the Afghan people",
            "title_similarity": "0.6072624",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9b1ury",
            "score": 1,
            "text": "I agree that getting out of Afghanistan did need to occur, however, we should have removedk all our military hardware first, and it should have been much more orderly instead of leaving 10's of thousands of both our citizens, as well as all the Afghani people who helped up while we were there.",
            "title_similarity": "0.7519903",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9b2tpl",
            "score": 1,
            "text": "It could have worked if we just bribed the Taliban with free bumper cars.",
            "title_similarity": "0.5562694",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h9b33x4",
            "score": 1,
            "text": "Would you have had the same agreement had it been trump who pulled out? Because for some reason, I feel like everyone wants to blame someone else for their mistakes in politics.",
            "title_similarity": "0.66160095",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9b3mf4",
            "score": 1,
            "text": "An alternative was to keep a small footprint of 2500 soldiers to maintain Afghanistan as it was. This way the radical Taliban do not control it and use it as a stronghold to launch attacks.\n\nRemember 9/11? More of those might happen now as the Taliban gain resources and ability to strike back.",
            "title_similarity": "0.74559283",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9b3n2a",
            "score": 1,
            "text": "The USA  wanted to build a functioning society in Afghanistan because the country sits on $3 trillion rare-earth deposits. In order to exploit it, you need an infrastructure. They are leaving because, at this point, it seems unlikely that this \"project\" will end up profitable",
            "title_similarity": "0.71942884",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9b3ugy",
            "score": 5,
            "text": "This wasn't nation building, we had a residual security force of ~3k troops carrying out selective counter insurgence efforts. A small group performing a big job. No American lives lost in over 1.5 years. This was not a huge commitment in the most recent years. Pulling out so hastily was a gross blunder, anyone who argues the opposite is entirely naive.",
            "title_similarity": "0.6618182",
            "sentiment_compound": -0.907
        },
        {
            "id": "h9b4d9w",
            "score": 1,
            "text": "Right decision, terrible execution by ALL parties involved.",
            "title_similarity": "0.45371804",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9b4p52",
            "score": 1,
            "text": "Trillions of dollars***",
            "title_similarity": "0.27553684",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9b5lvh",
            "score": 1,
            "text": "It’s time to the afghan people to do something. Probably some of the things the usa did there wasn’t all the right ones but i think on the end they did there best, now is time to the people to do something and step up against the talibans on some way since a armed force wasn’t a solution, the Americans couldn’t stay there forever. Is sad but is the true.",
            "title_similarity": "0.76629806",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h9b5oga",
            "score": 1,
            "text": "Upvoted your post because i want to read comments. The problem is not that americans left the Afghanistan, the point is how they did it, without any plan and in hurry. The main task of american troops was destroying of Talibans. In the fact, Talibs were “modernized” and well equiped because of weird corruption system between Americans, Talibs and Afghan government. I can write you lots of reasons and arguments opposite to your opinion. And  believe me they are taken not from internet, social media and etc\n\nPS: USA is the only country responsible to the chaos and crisis in Afghanistan.",
            "title_similarity": "0.7671462",
            "sentiment_compound": -0.93
        },
        {
            "id": "h9b5r9v",
            "score": 1,
            "text": "It wasn’t the withdraw the people have a problem with, on that we can all agree, it was the slapdash way in which it all transpired. \n\nI guarantee that if we thought it was going to go down like this, we would have pressured the Afghan govt to form a shared power agreement with the Taliban. \n\nIt would have been a coalition only in name, but with a peaceful transfer you might have been able to wring from them some concessions. A blanket amnesty for everyone, the right to leave upon acceptance elsewhere, and hell maybe even the right to go to a school for girls. \n\nWhether they stuck to the agreement would be up in the air, but at lest there would be an expectation. As it stands now we’re all just glad they didn’t put Kabul to the sword. \n\nIt’s the people left behind that kill me. The people willing to die clinging to an airplane than risk living under the Taliban.",
            "title_similarity": "0.716275",
            "sentiment_compound": -0.6858
        },
        {
            "id": "h9b5wza",
            "score": 1,
            "text": "So all those rights that women have fought for like equality, voting, driving, ect   Those are only American values. Those are not for women in Afghanistan I guess. Biden saying he stands behind his decision is only to placate people like you. It’s just government as usual. What’s good for you isn’t good enough for them. I wish Biden would apply his logic to the war on drugs. That’s been going on much longer an I’d think it would offend you because it is a war against Americans",
            "title_similarity": "0.7474266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9b6fhs",
            "score": 1,
            "text": "I just think if we see someone struggling, we should help them. It wasn’t a waste cus loads of people were saved and women could go to work and school. Fuck independence and patriotism, lives matter more.",
            "title_similarity": "0.5148524",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9b6p3a",
            "score": 1,
            "text": "My personal problem is how fast they left, leaving behind fully stocked army bases with billions of dollars of high tech equipment, so instead of people getting healthcare, the taliban gets a bunch of free weapons and vehicles to use and sell",
            "title_similarity": "0.7270148",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9b783b",
            "score": 1,
            "text": "I don't think majority of people are gonna change your view since majority of people (I would assume anyway) wanted this for a very long time and agree with you \n\nThe issue lies with\n\nA) the way it was executed\n\nB) questioning wtf has been happening for 20 years\n\nLike across 20 years, countless lives lost, trillions of money spend into it all for it to just disappear within a couple of weeks. All the life's that were lost were for a pointless reason and the money was crearly a waste of time\n\nAswell as people are saying this was going to happen no matter what, we'll if this was the case then why did it take 20 years for the US to let this happen? Why didn't they get out sooner",
            "title_similarity": "0.8511233",
            "sentiment_compound": -0.8853
        },
        {
            "id": "h9b7ehy",
            "score": 1,
            "text": "If you visited someone's home and damaged thier gas cooker by accident, you would not walk away and leave a dangerous gas leak behind without making sure the issue you caused was no longer a danger to the the house or it's occupants. Even though accidental, causing an issue creates an obligation on you to eliminate that risk before you walk away.\n\n\nInvading a country is the same, if you destabilise the country you have an obligation to put it on a solid footing before walking away.\n\n\nUs played role in creating Taliban (UK, Russia, Turkey  also have responsibility) and then invaded, those that aided us or relied on us promise of a different world are now at mercy of Taliban and US does have obligations to make sure we are not hearing about thier massacre in coming weeks. \n\n\nShould they stay indefinitely involved in Afghanistan politics? Obviously not, but can't walk away from mess they helped create either",
            "title_similarity": "0.719018",
            "sentiment_compound": -0.6406
        },
        {
            "id": "h9b8140",
            "score": 1,
            "text": "Trump was the one who signed the treaty so it was trump’s decision to pull out, he did it at the end of his term so Biden would take the blame. I personally think it was a damned if you do damned if you don’t situation because staying is keeping the current taliban and leaving will make a new one, the USA should just stop interfering in foreign affairs in general. And especially stop declaring war, they have not won a single war unless you count ww1 and ww2",
            "title_similarity": "0.83152366",
            "sentiment_compound": -0.9696
        },
        {
            "id": "h9b81sj",
            "score": 1,
            "text": "The same thing happened when Obama pulled troops out of Iraq and ISIS took over large parts of the country. I think part of the problem is poor or corrupt leadership. I have read many stories about leadership abandoning their posts and not keeping their forces supplied. Many experienced ones have been fighting nonstop and had run out of food and ammunition. Even the US marines would have faired terribly if leadership disappeared and they had no supplies. That isn’t the whole story of course. I don’t think the war was ever winnable as long as the Taliban could simply hide in Pakistan.",
            "title_similarity": "0.77370656",
            "sentiment_compound": -0.9607
        },
        {
            "id": "h9b86ep",
            "score": 2,
            "text": "I’m going to use your hole analogy. \n\n“If you find yourself in a hole, stop digging” is a good phrase but not applicable here. We were not digging that hole further by simply being there. What we were doing was supporting the walls of the hole from collapsing. Let’s consider the citizens in the hole as well, our exodus brings the walls down on them. \n\nTrue that most afghan men were indifferent on taliban control, but think of the women who now have no rights. Every girl over 15 is going to be assigned a husband. Do you support that? You must not only acknowledge the decision of leaving in principle, but also the consequences current situation. We should have never gone in the first place. But going in, and leaving a power vacuum is also the wrong decision.",
            "title_similarity": "0.7546117",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h9b86mx",
            "score": 1,
            "text": "Its like tutoring a kid in your class that is bad at reading and writing at a 8th grade level (for 20 years) and the next day at school, the tutored just up and gives up before they hand out the first test.",
            "title_similarity": "0.5637603",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9b8lal",
            "score": 1,
            "text": "If 20 years didn't change anything and they took it back within a week, that means we served no purposes, my friends died for nothing and i spent my time there for nothing.  \nMy mom used to say, help yourself before asking for help. They got all the help they could get to no avail.",
            "title_similarity": "0.7316018",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9b98te",
            "score": 1,
            "text": "I mean nobody is disagreeing with you",
            "title_similarity": "0.22399485",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9b9bex",
            "score": 1,
            "text": "Yeah, much better to have Taliban and China running the place after investing trillions in upgrading them into a modern society.\n\nI’m sure Beijing Biden gave it to them with good intentions. \n\nHow do you justify the massacre and atrocities the Talibans are inflicting on the Christians?!?\n\nHow do you justify Afghan women thrown back into the Stone Age with all rights taken away, and little girls being told they can no longer go to school?!?",
            "title_similarity": "0.7523592",
            "sentiment_compound": 0.8639
        },
        {
            "id": "h9b9l5h",
            "score": 1,
            "text": "I NEVER want to hear another mfer say,\n \"But where do we get the mOoOoonEY for healthcare hur dur.\" Same goes for college, infrastructure, environment, affordable housing, and you know what? A pony, yep. I'm also gonna also want that goddamned  pony y'all won't shut the fuck up about. Three trillion dollars?!  Do not even.",
            "title_similarity": "0.6728451",
            "sentiment_compound": 0.5948
        },
        {
            "id": "h9bamm6",
            "score": 1,
            "text": "Right decision, poorly executed.",
            "title_similarity": "0.22725469",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bamo5",
            "score": 1,
            "text": "I don’t think many people are criticizing the decision to leave (remember even Trump and many Republicans supported bringing the troops home)  - the problem is the way it was handled. There were a LOT of mistakes made in the months leading up to this that made things drastically much worse than they needed to be.",
            "title_similarity": "0.76111186",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h9bb4un",
            "score": 1,
            "text": "All of this shows why the can has been kicked down the road so often. There’s no good way out, so it was easier to stay.",
            "title_similarity": "0.57977986",
            "sentiment_compound": 0.2314
        },
        {
            "id": "h9bbfdd",
            "score": 1,
            "text": "Like many have said, Biden during his speech was presenting a straw man argument. He was arguing that we should have pulled out and it was the right decision.  Most people agree, but it was how it was done that was the problem. \n\nFirst there was an agreement between Trump and the taliban to be out May 1st. Biden broke this agreement  and angered the taliban. Then Biden out in 1000 extra troops before starting a withdrawal. \n\nAll of this went against their agreement and created what we have now. No one talks about this because it's an inconvenient truth liberals don't want to acknowledge.",
            "title_similarity": "0.8256829",
            "sentiment_compound": 0.3141
        },
        {
            "id": "h9bbj1b",
            "score": 1,
            "text": "While leaving is correct, this is a career ender for Biden.  It will be once a newly empowered al-Qaeda launches a terrorist attack on US soil right before the election.  The US will be unable to effectively respond with deployment.  Trump could easily call for massive air strikes, demanding B-52s over Kabul.  Americans love air strikes as they have basically no risk to the US while allowing us to show off the worlds biggest airforce.  It doesn’t matter if the Taliban sheltered or helped al-Qaeda.  Iraq had nothing to do with 9/11, and yet Bush had a 90+% approval rating at the time.",
            "title_similarity": "0.81992805",
            "sentiment_compound": -0.048
        },
        {
            "id": "h9bcega",
            "score": 1,
            "text": "Most the mainstream critics are all shills for the military industrial complex.",
            "title_similarity": "0.48179358",
            "sentiment_compound": -0.3535
        },
        {
            "id": "h9bdglm",
            "score": 1,
            "text": "Pulling out is almost always the right decision.",
            "title_similarity": "0.3627317",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9be64g",
            "score": 1,
            "text": "I thought Trump started the withdrawal",
            "title_similarity": "0.50016046",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9be7nd",
            "score": 1,
            "text": "I’ve heard someone say that they saw a video where Biden had stated that he will be a one term president because of this Afghanistan decision. I guess we will see.",
            "title_similarity": "0.6598642",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9beai8",
            "score": 1,
            "text": "The problem is that now that the taliban has complete rule over the country, it's breeding grounds for extremism and terrorism. Would not be surprised if some of these people partake in major terrorist attacks in the near future.",
            "title_similarity": "0.7198969",
            "sentiment_compound": -0.9527
        },
        {
            "id": "h9bedrc",
            "score": 1,
            "text": "Not like it was heavily debated 10yo but ok...\n\nBut more seriously, he did, but it’s about how it was done",
            "title_similarity": "0.52600574",
            "sentiment_compound": -0.4668
        },
        {
            "id": "h9bek01",
            "score": 1,
            "text": "20 goddamn years and trillions of dollars.  \n\nHow much more time and money did that worthless government need?!  \n\nThey held off the taliban for a *month*.  Did they want another *decade* to hold them off for 6 months??  Fuck that. \n\nBring the troops home - we have enough problems here to solve.",
            "title_similarity": "0.8397696",
            "sentiment_compound": -0.8986
        },
        {
            "id": "h9beuv1",
            "score": 1,
            "text": "Joe Biden didn't make that decision..",
            "title_similarity": "0.20798472",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bf0h4",
            "score": 1,
            "text": "I’m in agreement that we should have left. But we didn’t have to destabilize the region, give them countless weapons and leave in a frenzy. We could have take a month, removed resources and weapons, handed off bases and strategy to the Afghan military, and keep stability in the region. As it is, we have a max dash to leave, and for what? To allow the taliban to just walk into bases, taking weapons and armors, and taking cities where people are literally falling off of planes in the air, because they would rather die trying to escape than live in Kabul under the talibans rule. \n\nTHAT was wrong. \n\nLeaving was the right choice. How we left, in the manner we left, was absolutely abhorrent.",
            "title_similarity": "0.8231339",
            "sentiment_compound": -0.9836
        },
        {
            "id": "h9bfdx8",
            "score": 1,
            "text": "Not in love with Biden even though I voted for him, but I agree. Given the option of stay or go. Go is correct.",
            "title_similarity": "0.57564086",
            "sentiment_compound": 0.2654
        },
        {
            "id": "h9bfks6",
            "score": 1,
            "text": "So another one if bush's fked up. Smh",
            "title_similarity": "0.15209493",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9bftsv",
            "score": 1,
            "text": "Perfectly fine opinion. But you’re basically saying fuck Afghan people who don’t want to be ruled by the Taliban. It’s obviously more nuanced then that, considering it’s a fruitless battle. I think it’s also how things were done (so quickly) more so then what was done.\n\nYou can’t save everyone though so I respect it.",
            "title_similarity": "0.769926",
            "sentiment_compound": 0.6331
        },
        {
            "id": "h9bfuei",
            "score": 1,
            "text": "Cmv, you wouldn't have made this post if this happened under trump",
            "title_similarity": "0.51810896",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bfyf9",
            "score": 1,
            "text": "Very few people, in either major party, actually believed we should stay there. Most would agree that pulling out is the right decision. Obama and Trump both made strides toward pulling out. Biden, however, decided to take the rip the bandaid off approach and the results have been abysmal. He knew better, advice was given on how to do better. But he didn’t. He totally screwed up.",
            "title_similarity": "0.7639791",
            "sentiment_compound": 0.0119
        },
        {
            "id": "h9bg0ww",
            "score": 1,
            "text": "it was the going in that was the issue.",
            "title_similarity": "0.13648501",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bg5j3",
            "score": 1,
            "text": "I love the comments from people saying we should have done the evacuation gradually. \n\nYou mean, Afghanis would see people evacuating months ahead and they wouldn't bat any eye? The afghan army and police force would have high confidence their country would stay as others are getting the fuck out months ahead?\n\nThe Taliban would see reports of people evacuating early and they would just stay put?\n\nTo say we should have evacuated early, like we're in a sort of vaccum where those actions have no reaction, then sure, do that. But you start getting people out really early, you send a signal to EVERYONE that you have zero confidence in the government. And then you have a rush to the exits and a Taliban advancing quickly, just months earlier.",
            "title_similarity": "0.7848204",
            "sentiment_compound": 0.8515
        },
        {
            "id": "h9bgm7b",
            "score": 1,
            "text": "All makes me wonder where he will send the sons and daughters of America next.",
            "title_similarity": "0.45462096",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bhis3",
            "score": 1,
            "text": "Instead of pallets of cash, Biden gave them weapons and military vehicles.",
            "title_similarity": "0.36402184",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9bhu8v",
            "score": 1,
            "text": "It also was not a \"never ending war\" we had 2500 troops there to stabilize the country in order to stop the Taliban from using Afghanistan as a launch pad for terrorist attacks",
            "title_similarity": "0.75238305",
            "sentiment_compound": -0.7687
        },
        {
            "id": "h9bird0",
            "score": 1,
            "text": "The way it was handled/is being handled is just atrocious.",
            "title_similarity": "0.25784716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bj7md",
            "score": 1,
            "text": "I have been saying since we went there and installed a \"western style democracy \" that it would end up exactly like this. They are and have been warring tribes for thousands of years. We will not be able to change that mentality ever. 1 year, 10 years or 100 years there would not have mattered. I do feel for those left behind that want a different life.",
            "title_similarity": "0.8019333",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h9bj96p",
            "score": 1,
            "text": "This is just one American puppet regime fighting the newly established puppet regime.The area will continue to be destabilized it’s just a matter of who’s putting their fingers into the situation.Even Biden said that our involvement isn’t over but will just be changing in form.Covert>overt.",
            "title_similarity": "0.6541821",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9bk61k",
            "score": 1,
            "text": "The right decision was not interfering in the country at all. The US created the taliban, by funding its predecessors, the mujahideen. In the 70s burkas were rarely seen and, while poor, afghanistan was a very progressive nation. This changed when billions of dollars fueled islamic fundamentalism and created the Afghanistan we know today of burkas and suicide bombing. The west is at blame for whats happening in Afghanistan.",
            "title_similarity": "0.80833834",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h9bk67z",
            "score": 1,
            "text": "https://www.c-span.org/video/?c4973587/user-clip-trumpafghanistan",
            "title_similarity": "0.24100477",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bkq9k",
            "score": 3,
            "text": "We allowed hundreds of thousands of people to be killed.\n\nWe drop million dollar bombs on people who make less than a dollar a day.\n\nWe tried to train a country to be us, the US without ever really considering whether they wanted to be or not.\n\nOur training failed because they don’t have sophisticated supply chains and logistics to manage basic necessities such as food or ammunition. \n\nAfghanistan may be a singular country but it’s basically 50 individual states within itself without meaningful federal leadership.\n\nWe never should have invaded Iraq. I truly believe that’s what made this 20 years and not 3.\n\nNation building is a joke.\n\nDon’t ever expect me to support a war unless it’s WW3.",
            "title_similarity": "0.82587516",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h9bl1lm",
            "score": 1,
            "text": "Trump was the one who actually ordered troops out. Biden pushed back the timeline but yeah, I agree it was a good decision.",
            "title_similarity": "0.7498374",
            "sentiment_compound": 0.872
        },
        {
            "id": "h9bl1xs",
            "score": 4,
            "text": "There were women born after the end of Taliban rule that are young adults today that are being plunged into a world that is nothing short of slavery. \n\nThe US shouldn't be responsible for nation building... but we should have a UN peace keeping force that is responsable for preserving democracy and immigration. Both human rights.\n\nPulling out without having a better plan in place for ensuring that people weren't subject to terrorism and violence is just irresponsable. They made the bed that other people are forced to sleep in. They have a responsibility to ensure that it is preserved.",
            "title_similarity": "0.7160434",
            "sentiment_compound": 0.6075
        },
        {
            "id": "h9bloon",
            "score": 1,
            "text": "Forgive me but I don't know a tonne about this war. I know the basics. But my question is, was US presence really the primary thing stopping third from happening sooner?",
            "title_similarity": "0.6905036",
            "sentiment_compound": -0.8311
        },
        {
            "id": "h9blxwf",
            "score": 1,
            "text": "Biden Cuck.",
            "title_similarity": "0.07841096",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bnk0p",
            "score": 1,
            "text": "The Taliban was going to take over no matter when we left they were just biding their time, we should not have been over there to begin with",
            "title_similarity": "0.7161452",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h9bovzy",
            "score": 1,
            "text": "It is done, it is over. We can’t do it anymore there, let them resolve it amongst themselves. American intervention always make it worse not better",
            "title_similarity": "0.6665092",
            "sentiment_compound": -0.4416
        },
        {
            "id": "h9bp9a8",
            "score": 1,
            "text": "I’ve got a couple of questions, and to be clear I haven’t come to a conclusive opinion on this myself - sure, I made a snarky reply to a post a couple of days ago, but, generally I’m not really sure what to think. So:\n\n1) do you think going in the first place was a good move?\n\n2) what are your thoughts on the timing behind pulling out?",
            "title_similarity": "0.5836922",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h9bq18m",
            "score": 1,
            "text": "We did it all for the OIL",
            "title_similarity": "0.3876421",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bqstf",
            "score": 1,
            "text": "As a non american, seeing the video split between  biden saying that everything will be alright in july and the takeover in august, makes him look like a liar or a person that doesn't know what he's talking about at the best.\n\nRegarding if it was right or wrong that's the impression it leaves",
            "title_similarity": "0.6171649",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9bqzjl",
            "score": 1,
            "text": "God, some of these takes are so annoying. There *never was an opportunity* to radically westernize the country because that was never the goal. Why did the USSR invade? For the same reason we did. To have influence over the region and to have their own contractors in charge of natural resource extraction. We knew Saudi Arabia funded those behind 9/11 and that Pakistan is the Taliban’s ally. It was never about nation building. We armed and funded a group that would help form the Taliban to fight the USSR and as a result of our actions worsened the conditions and safety of everyone in the region.",
            "title_similarity": "0.7805365",
            "sentiment_compound": -0.3012
        },
        {
            "id": "h9bsiq8",
            "score": 1,
            "text": "I would say, whether leaving is the right decision or not is the wrong question to ask.\n\nImagine you're out driving.\nThe GPS tells you to turn left.\nYou turn left, into a brick wall.\n\nDid you take the right decision?\nI would say no.\n\nLet's say you're going 100 miles per hour. \nYour GPS tells you to take a sharp right turn. \nYou turn right, at the right time, without slowing down. \nYou slide off the road and hit a brick wall.\n\nDid you take the right decision? \nI would say no. \n\n\nAgain, even if leaving is the right thing to do, leaving in the right way, at the right time is just as big a part of the question.\n\nYou can't answer either without the other.",
            "title_similarity": "0.6592001",
            "sentiment_compound": 0.443
        },
        {
            "id": "h9bsk8r",
            "score": 1,
            "text": "Hard agree",
            "title_similarity": "0.08159195",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9bsr2y",
            "score": 1,
            "text": "Wow",
            "title_similarity": "-0.1412949",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9bsu0e",
            "score": 1,
            "text": "It's just more proof that the whole thing was a scheme in the first place.  It was never about protecting Afghanis or strengthening them, it was about profit for private contractors and power grabs.  There was never a chance of stabilizing the region.",
            "title_similarity": "0.63650966",
            "sentiment_compound": 0.6553
        },
        {
            "id": "h9btsdi",
            "score": 2,
            "text": "I want to address your last couple sentences there. There is nothing and no one to respect here. \n\nYes this was the time to pull out but only because any time at all would have been the best time - if it were still ongoing then right now would be the best time.\n\n It wasn't really a decision that makes Biden good he just did what anyone in that position should have done for 20 years. He could have pushed for it when he was in the Executive as VP. \n\nThe entire thing is a nightmare mess. No one made good choices at any point and it was never going to end well. The best that would ever come of it was that it ended soon and with as few deaths as possible and that didn't happen by a long shot. Not everything has to - or can, or should - be redeemed like that.",
            "title_similarity": "0.82386243",
            "sentiment_compound": 0.9877
        },
        {
            "id": "h9bu4el",
            "score": 1,
            "text": "i saw somewhere someone said “if we pulled out 15 years ago or 15 years from now, it would’ve all been the same” \n\nit was a useless war. i wish we had pulled out 15 years ago, because we would’ve saved money and lives. i think a lot of people’s frustration comes from exactly that. “we did all that fighting for what? nothing’s changed.” i’m glad we’re out of there, but disappointed that it was all for nothing.",
            "title_similarity": "0.7890755",
            "sentiment_compound": -0.7615
        },
        {
            "id": "h9butbn",
            "score": 1,
            "text": "I agree it was the right decision. We shouldn't have been there to begin with. You're also not going to change the majority populations mind (the Afghanis) and make them conform to your way of life.",
            "title_similarity": "0.64863515",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9buw8h",
            "score": 1,
            "text": "War for oil and heroin. It's pretty simple",
            "title_similarity": "0.40529194",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9bv6dd",
            "score": 1,
            "text": "It wasn't entirely Biden's decision. This was a deal that the Trump administration brokered last year in a face-to-face meeting with the Taliban. The deadline they set was for MAY of 2021. Biden made the call to honor the agreement, but asked for an extension. It was the right call to remove our troops. The war in Afghanistan has cost the US so many lives and resources, and it hasn't been worth any of it. \n\nBut why wasn't this extension used to facilitate the safe removal of as many Afghan citizens who wanted to leave as possible? \n\nWhy even bother with the extension if you were just gonna pull out, seemingly with no plan in place?",
            "title_similarity": "0.86341834",
            "sentiment_compound": -0.782
        },
        {
            "id": "h9bvd5h",
            "score": 1,
            "text": "Leaving in an orderly manner was the right thing to do. Now, because Biden is senile, countless American lives are at risk and terrorists have our military equipment.",
            "title_similarity": "0.73742807",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h9bvwh3",
            "score": 1,
            "text": "Trillions now",
            "title_similarity": "0.10140152",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bw013",
            "score": 1,
            "text": "> Staying in the war even longer in the name of more \"nation-building\" \n\nIt also has to be known that this has always been a lie, from the very start.",
            "title_similarity": "0.69460654",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9bw8wz",
            "score": 1,
            "text": "r/dontpullout",
            "title_similarity": "0.088029526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bwibu",
            "score": 1,
            "text": "Correct me if I am wrong but it seems like no one is saying we shouldn't be pulling out of Afghanistan, the detractors think we should have pulled out with more forethought. \n\nMy thought on this is that I truly think Obama wanted to pull out and that it crossed Trumps mind at some point but when you start trying to create plans and timetables the generals and the military industrial complex then come and make very salient arguments about how its not the best time or any way of doing it has so many holes and issues that it is best to wait, but wait for what? It seems like the only difference between this abrupt pull out we are doing and a better timetable is how long what is happening now would happen. I agree with the OP in that at some point someone had to simply pull the plug and not sacrifice a lot of lives in the future just because we sacrificed a bunch of lives in the past. Biden isn't seeking a second term and has a lot of political capital built over his years in the senate and as VP. If he didn't do this I am not sure who would be in a position to do this.",
            "title_similarity": "0.76317286",
            "sentiment_compound": 0.9346
        },
        {
            "id": "h9bwumh",
            "score": 1,
            "text": "It was pulling out and leaving citizens and arms behind.",
            "title_similarity": "0.16543907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9bx4qw",
            "score": 1,
            "text": "Correct decision poor execution.",
            "title_similarity": "0.20689015",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9bx8zw",
            "score": 1,
            "text": "I guess you can suck oil reserves dry in 20 years",
            "title_similarity": "0.522717",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9by6vg",
            "score": 1,
            "text": "I don't think it was Biden that made that decision. I'm not defending him and I absolutely hate his guts, but I think it was Trump that was the one who started the process while Biden finished it.",
            "title_similarity": "0.6763737",
            "sentiment_compound": -0.3604
        },
        {
            "id": "h9byek0",
            "score": 1,
            "text": "I agree pulling out is the right thing to do, even if Taliban takes over.\n\nBut going to war, which was caused by the 11. Of September, I think was the right thing to do. They shot the first shot, it was basically a declaration of war, and I don’t think they were expecting the US to respond as hard as they did. \n\nThey killed over 2000 civilians, the US responded and nearly wiped out all of al quaida and lots of taliban members. I think that’s fair.",
            "title_similarity": "0.8303853",
            "sentiment_compound": -0.9505
        },
        {
            "id": "h9byuix",
            "score": 1,
            "text": "🤣",
            "title_similarity": "-0.09931523",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9bzcq7",
            "score": 1,
            "text": "In my opinion I think we should have stayed for like two to three more years building a stable government that could have stood on its own two feet instead of just leaving more or less out of nowhere like we are currently doing",
            "title_similarity": "0.65638125",
            "sentiment_compound": 0.3798
        },
        {
            "id": "h9bzrhq",
            "score": 1,
            "text": "This is because we pulled out too late not too soon….",
            "title_similarity": "0.46241117",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9c0m49",
            "score": 1,
            "text": "Correct.",
            "title_similarity": "-0.09738699",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9c1ges",
            "score": 1,
            "text": "I would agree with this analogy about “If you find yourself in a hole, stop digging” but that doesn’t necessarily mean we needed to leave. \n\nIn the same way that if you are struggling to get a job at Google, the options are not only a job at Google or no job. The options in Afghanistan were not only keep doing what we were doing or leave and do nothing. \n\nPerhaps there is a solution involving other countries or the UN. Perhaps more time would have helped, a whole generation of young people is a powerful force. Perhaps fewer troops, perhaps building more infrastructure, perhaps… perhaps… \n\nAs I mentioned in another comment though, this is on us. We asked for a War and we got one. The least we can do is help the people who’s country we destroyed. We have criminals serving longer sentences for far less death and destruction.",
            "title_similarity": "0.6839865",
            "sentiment_compound": -0.9742
        },
        {
            "id": "h9c2cbe",
            "score": 1,
            "text": "For profit. That's why. Go and look at private contractors and the privatization of war.",
            "title_similarity": "0.5134968",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9c2r4e",
            "score": 1,
            "text": "I stand with OP. I’m so confused as to why this is considered Biden’s fault when only 2,500 troops remained in Afghanistan when Biden took office and adopted Trump’s evacuation plans.\n\nPlus, the Afghan government was corrupt and had no backbone. The Afghan president stated that they were going to continue the fight against the Taliban, and then fled the country days later, leaving his people to fend for themselves. This action (or inaction) was more than enough motivation for the Taliban to push forward with their plans to overtake the country’s capital.\n\nAlso, the Afghan government’s annual budget was in the tens of BILLIONS, and most of it was international aid. The US alone has provided and sacrificed more than enough help Afghanistan build that foundation and thwart the Taliban’s efforts. For any country or person to put majority blame on the US and/or a president who has only been in office for less than 9 months of the 20 YEARS we’ve spent in Afghanistan is simply ridiculous.",
            "title_similarity": "0.7980428",
            "sentiment_compound": -0.8948
        },
        {
            "id": "h9c2v7q",
            "score": 1,
            "text": "The Afghan Army did not want to fight. The Afghan people have to be the engine for change. How many times have we failed in trying to recreate another country in our image? Pulling out of Afghanistan was the right thing to do! It would have been right if Obama had done it! It would have been right if Trump had done it! I could care less if the Defense Industry profits are reduced!",
            "title_similarity": "0.81197184",
            "sentiment_compound": 0.7324
        },
        {
            "id": "h9c3ava",
            "score": 1,
            "text": "No one I’ve spoken to has been for staying, I think the main criticism is that he abandoned all the people our military made promises to. I heard some people were abandoned because their visas were in limbo, and others because they didn’t have a COVID test. This is how you take away what goodwill and faith our military members have amongst other nations. Good luck finding translators when there is another conflict…dipshits. \n\nBut noo, anyone coming through the southern border gets processed immediately. This left such a bad taste in my mouth.\n\nService for citizenship. They earned it.",
            "title_similarity": "0.714736",
            "sentiment_compound": -0.6858
        },
        {
            "id": "h9c3bqq",
            "score": 1,
            "text": ">Billions of dollars\n\nThe cost of the Afghanistan war represents about 1% of the tax revenue that the US Federal Government has made in the same period of time. \n\n> thousands of lives \n\n2,420 Americans have died in Afghanistan. This makes the Afghanistan War one of the least deadly wars that the United States has ever been involved in. Since 2014, American casualties in Afghanistan have not exceeded 25 deaths per year. More Americans die from drug overdoses in New York every single year than American soldiers have died in the entirety of the Afghan War. \n\n>wasted\n\nEvery aspect of Afghan society had improved post-invasion. HDI and standard of living were better, people were making better wages, had better access to education, had better access to medicine, etc. The 2,000 Americans and 60,000 Afghans who died fighting the Taliban didn't die \"for nothing.\" This is genuinely the dumbest possible take anyone could have about the war. \n\nTo say that withdrawing from Afghanistan is justified because what we sacrificed was \"wasted\" is functionally the same thing as an obese person justifying canceling his gym membership because he gained more weight when he stopped exercising for a few months.\n\n>  entering the war was a mistake\n\nAfghanistan is not Iraq. The Taliban was harboring Al Qaeda and we *needed* to stop that.\n\n> would've only resulted in the same exact thing we are seeing right now,\n\nWhat we're seeing right now is literally the result of excluding the Afghan government from so-called peace negotiations and a half-assed attempt at planning a withdrawal. \n\nWhen Trump brokered \"peace\" last year, the Taliban just switched the focus of their combat operations from Coalition targets to ANSDF targets. They picked up the intensity of raids, bombings, and assassination attempts against the ANA and ANP. Our \"peace\" with the Taliban also forced the Afghans to release thousands of Taliban prisoners that they had captured.\n\nWhen Biden finally ordered the full withdrawal, we didn't even have the courtesy of saying \"goodbye\" before we left. The last troops out of Bagram Air Base just shut off the power and slipped out in the middle of the night, not notifying the ANA and leaving the base open for looters. \n\nFor two decades, the US had modeled the ANA after itself. The military was reliant on air superiority to dominate the whole battlefield -- planes and helicopters allowed the ANA to move troops and supplies around the country faster than the Taliban and airstrikes allowed even outnumbered ANA units to decimate Taliban formations. The USA built a new Air Force for Afghanistan using American-made equipment. But no one ever bothered to teach the Afghans how to actually maintain that equipment. Instead, we spent billions of dollars paying American contractors to maintain the equipment. When the US left, we didn't just take away our own training, drones, fighter jets, and special forces. We also took all of those contractors responsible for upkeeping the equipment that was supposed to allow the ANA to fight on its own. \n\nLeaving so abruptly crippled the ANSDF. Lack of maintenance meant that the AAF couldn't provide CAS for ANA units. Without the aircraft, the ANA also couldn't get supplies or reinforcements to pinned-down units. This is exactly how we got stories like such as what happened in Dawlat Abad -- an entire Commando team was executed on the spot when they surrendered after fighting until they ran out of ammunition. \n\nWhen the US pulled out, ANA forces were spread thin throughout the country and, overnight, became incapable of consolidating forces in major population centers. Commandos conducting COIN operations in Farah province suddenly found themselves without effective communications or air support. In Zaranj, the 215th Corps left the city to focus on protecting Lashkargah. For weeks, local leaders had been asking for reinforcements. When the Taliban reached Zaranj, only the NDS's Agents were available to defend the city. \n\nAt Lashkargah itself, border troops were waiting weeks for more reinforcements before the government could finally pull troops out of Majrah and Garmsir to send to Lashkargah. When reinforcements finally arrived, they held out for two weeks before they were ultimately pushed back to the governor's residence and ultimately being forced to either evacuate by helicopter or surrender. \n\nIn Kandahar, government forces managed to hold out for just over a month. Although the ANA managed to reinforce the city with Commandos, there was a desperate food shortage. The defenders were rationing potatoes because the government could get any supplies to them. \n\nThese stories repeat throughout all of Afghanistan for the duration of the 2021 Offensive. All of the cities that fell are cities that the ANA managed to either retake or defend completely when they had reliable air support. \n\nHonestly, no one even needs to argue that America should stay in Afghanistan. If America's withdrawal had been planned out better, ANSDF would have probably seen much more success in defending the major population centers. With better execution, the Taliban wouldn't have been allowed to stall peace talks while intensifying attacks against ANSDF. The ANA could have been given clear forewarning about America's plans and enough time to adjust their own plans and positioning accordingly. Maybe even a situation could have been worked out that allowed some contractors to stay behind to properly train ANA/AAF personnel on maintaining the American equipment that could have been the game-changer in this conflict. \n\nMost importantly, a better-executed withdrawal wouldn't see tens of thousands of Afghans who risked their lives to help the United States stranded in a country now ruled by a regime with a nasty track record of reprisal killings and assassination. The most heartbreaking stories coming out of Afghanistan right now are those of former special forces, pilots, interpreters, etc. who worked with the United States and have been hunted by the Taliban for their collaboration with the US ever since.  \n\n>But pulling out of Afghanistan is something that both Obama and Trump campaigned on and never followed through with.\n\nAnd both of these men made terrible decisions that paved the way for Biden's shitshow today.\n\nIn 2014, Obama ended OEF and pulled out US combat troops without even trying to get any concessions from the Taliban. In 2016, he assassinated Mullah Akhtar Mansour, a pragmatist leader of the Taliban who was genuinely interested in peace negotiations. Trump literally brokered the shit \"peace\" deal that Biden followed through on.",
            "title_similarity": "0.68754053",
            "sentiment_compound": -0.4395
        },
        {
            "id": "h9c3jrh",
            "score": 1,
            "text": "Tell that to the citizens of Afghanistan. Look them in the eye tell them it's all going to be okay.",
            "title_similarity": "0.39829257",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9c3oz6",
            "score": 2,
            "text": "I think the two basic premises of your argument are both mistaken. \n\n1. Was the operation sustainable?\n\nThe US had 2,000-3,000 troops in Afghanistan in 2020, and was taking almost no casualties (about 50 in the six years since 2014).\n\nIn contrast, the US has had tens of thousands of troops stationed in South Korea since the 1950s, and tens of thousands more in Europe since the 1940s. Reality check: it was completely affordable, and - with a modicum of political leadership - totally politically sustainable. There was no massive domestic antiwar movement as there was against Vietnam.\n\n2. Was this outcome inevitable?\n\nNo. The idea that eventual Taliban victory was inevitable is unfalsifiable (clearly) but is not obviously true. If we stayed for 5, 10 more years, who knows what could change? A decade is an eternity in politics - a strong Afghan leader might have been elected president (capable of building a functioning state and army), the Taliban might have been rent by internal divisions, Pakistan may have had a shift in its policy due to changing internal politics… or maybe none of these things would have happened. Maybe withdrawal in 2031 would have been more or less the same, abeit with more money spent.\n\nThe point is, withdrawing was a predictable disaster, and a completely unforced one. Yes, sometimes you only have bad options before you (stay or go). *But it is always in your power to choose the less bad option, even if that means facing the same decision later.* Sometimes the best answer to a thorny problem is to put that problem back on the shelf for a while and revisit it when things change.\n\nAnd the consequences of leaving are colossal- far bigger than “bad optics” - America has not only been humiliated, but its promise of protection to an ally has been shown to be empty. That has huge destabilising effects for (among others): Taiwan, Korea, Saudia Arabia, Japan, Israel and all of Eastern Europe. American security guarantees underpin world peace, and they have just been shown to be worthless. If you don’t immediately understand why that is dangerous for pretty much everyone in the world, American or not, I am happy to explain. But it should be obvious.\n\nAnd that’s before we consider the impact that a colossal wave of refugees will have on the Central Asian region, the morale boost this has given to jihadist groups worldwide, and the (obvious) potential for another hostile, pro-terrorism state to emerge in a region already fraught with conflict…",
            "title_similarity": "0.7390735",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h9c479x",
            "score": 1,
            "text": "Obviously the right move is for each president to set a withdrawal date about a year after their term, so that the political consequences of staying or leaving are on the next administration.  Then the next president announces a surge, declare the surge a success, and announce a withdrawal date about a year after the end of their term.  Repeat for 20 years until someone gives up and actually sticks to a withdrawal plan.",
            "title_similarity": "0.7644931",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9c4e9j",
            "score": 1,
            "text": "It's clear the Afgan people had no interest in keeping their democracy intact.  If the people we trained and the rest of the public wanted to keep it so, then we would have seen a real civil war , but they didn't care and probably joined up with their \"enemy\" almost immediately.  Just an armchair opinion here.  I just hope they aren't AS extreme in their treatment of women as they have been in the past.",
            "title_similarity": "0.70358264",
            "sentiment_compound": -0.7455
        },
        {
            "id": "h9c4h7t",
            "score": 1,
            "text": "*2+ trillion btw, not billion\n\nI want to change your view by strengthening it, since I agree with it.\n\nPulling out slowly would have given the Taliban more time to prepare, gather resources, find weakpoints, infiltrate, recruit to boost their numbers, etc.\n\nA well trained and well equiped afghan military would have had the advantage of knowing the pullout timeframe while the Taliban would have been somewhat unsure of the exact date.\n\nThe fact that it fell in two weeks or less means that they weren't going to be able to hold regardless of the situation or pullout window.",
            "title_similarity": "0.799917",
            "sentiment_compound": 0.8927
        },
        {
            "id": "h9c4ial",
            "score": 1,
            "text": "There are so many other countries that are so much worse and have much greater human rights violations but the masses are whining about this one bc they only react to what is on the mainstream media at the moment.  In two weeks this will be forgotten and on to the new topic to whine about.",
            "title_similarity": "0.7292264",
            "sentiment_compound": -0.8621
        },
        {
            "id": "h9c5cde",
            "score": 1,
            "text": "My understanding is that the US left the Afghans a bigger and better equipped armed forces than the Taliban. However, the Afghans were intent on taking the title for fastest surrender evar, in the guinness book of world records 2021.\n\nI hear France is pretty happy to lose that title...",
            "title_similarity": "0.7727084",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h9c5eex",
            "score": 1,
            "text": "Anyone that have had tours in Afghanistan want to chime in? I'm curious if you saw this coming and what's your general thoughts on how last week unfolded.",
            "title_similarity": "0.49944007",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9c5v6y",
            "score": 1,
            "text": "Leaving 2500 troops there so things continued was fine. Not one soldier has died since the Trump agreement was signed. Now there is no preventive force and they have a full cache of weapons and equipment to boot plus the infrastructure now in place. They have more Blackhawk helicopters than 166 other nations. We could never declare victory but our forces when given the green light bombed them into submission . The evidence and the numbers are there in black-and-white. Why we just pulled out and left and did not even just leave that plan in place is beyond my comprehension. Now we are back to the worlds largest breeding ground for terrorist organizations who hate the west. You know it and I know it and the whole world knows it including our allies. It’s all over the news today foreign leaders asking why we left we did not have a plan to leave. They feel betrayed.",
            "title_similarity": "0.7266229",
            "sentiment_compound": -0.9703
        },
        {
            "id": "h9c5xyg",
            "score": 1,
            "text": "He doesn’t have balls, he needed money.",
            "title_similarity": "0.37367186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9c6w95",
            "score": 1,
            "text": "Pulling a small number of troops out and letting a country collapse/get overrun is wrong. We still have troops in Germany and Japan (70 years later) and same in South Korea after the Korean War. And when the next terrorist attack comes, our ‘allies’ will question why they would want to aid us.",
            "title_similarity": "0.73033893",
            "sentiment_compound": -0.9349
        },
        {
            "id": "h9c6xwb",
            "score": 1,
            "text": "If this happened like this under Trump I don't think many of you would be trying to see the bright side of any of this or making any excuses whatsoever. This was executed poorly as hell and there is no excuse for it. There are thousands left behind and the Taliban if they wanted right now could inflict heavy casualties. We are at their complete mercy there right now. That is not a position we should ever be in. Did you see those images of people falling from the plane? Remind you of something?",
            "title_similarity": "0.77791953",
            "sentiment_compound": 0.2115
        },
        {
            "id": "h9c6z23",
            "score": 1,
            "text": "The issue is how not that we pulled out.",
            "title_similarity": "0.22699529",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9c7cda",
            "score": 1,
            "text": "Not just thousands of lives. 242,000 dead in total.",
            "title_similarity": "0.36525536",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9c8d63",
            "score": 1,
            "text": "Maybe investing in the infrastructure if a country that america occupied for 20 years would've made a better result",
            "title_similarity": "0.63991016",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9c8mvj",
            "score": 1,
            "text": "Your view can be easily change knowing that Biden just put 7000 troops back into Afghanistan.\n\nRemember this is a complex situation that is changing as things develop. \n\nYour tax payer dollars are being burnt way more now than if Biden were to make an appropriate “right decision” that allowed for removal of personnel, destruction of sensitive items, and destruction of equipment/weapons.\n\nYou even mention “bad optics” because the decision couldn’t have been right knowing the equipment that was currently captured by the Taliban (and potential sensitive information) can be sold to another enemy state. This is the true gravity of the situation that could cause crimes against humanity a lot sooner than if “Biden did the right decision with a more appropriate delayed exit strategy”",
            "title_similarity": "0.77805924",
            "sentiment_compound": -0.835
        },
        {
            "id": "h9c8o2g",
            "score": 1,
            "text": "For me, the issue isn't merely the fact that we left. In the wake of US forces being removed, we've seen people literally dying to get out of the country; people who have lived there their whole lives who were depending on protection from the Taliban being trampled to death, falling from planes, all because we left without a moment's notice. It was absolutely within our power to set up some sort of process to get refugees out of Afghanistan in a safe and timely manner before we totally left, but instead we left a lot of people to face undoubted torture and persecution at the hands of the Taliban. I'm not gonna say it was a bad move getting out, but there was a lot more we could have done to avoid the humanitarian crisis that's coming",
            "title_similarity": "0.74200046",
            "sentiment_compound": -0.9696
        },
        {
            "id": "h9c90hq",
            "score": 1,
            "text": "I wonder if it was actually inevitable either way. A lot of the government and security forces were as far as I had known since their inception often corrupt. How can we nation build on behalf of Afghanistan if the officials that were elected to do so to be protecting Afghanistan and building a future did not. I think the Afghan government let the people down by relying on the it allies to prop them up all this time, apparently all the while taking bribes. We can figure blame, but really the writing was on the wall. The Taliban never disappeared, Bin Laden died and so what? It's a movement with many figures ready to replace the next. Despite this I don't think this is the end, I see all those people fleeing, and deleting their activities and actions to hide them from the Taliban and I'm reminded of just how many people oppose them. Perhaps they will be the ones to build the next Afghanistan. Either way, recent events are tragedy and I really hope that we all get behind our Afghan communities, and asylum seekers at this time.",
            "title_similarity": "0.7574805",
            "sentiment_compound": -0.5875
        },
        {
            "id": "h9c91da",
            "score": 1,
            "text": "This won't change your mind (despite this being CMV) but here's why there is nothing \"ballsy\" or otherwise smart about the pullout.\n\nRetreating from Afghanistan has been on the mandate for multiple presidencies. Why? Because it's obviously pointless. Moreover, everyone knew that the moment the US retreated, Afghanistan would collapse. Because no efforts were made to build a sustainable government there.\n\nThe US invested in \"training\" their local forces, which we now know was just 20 years of pissing around. Instead of investing in education, economy, civilian infrastructure and commerce, they spent trillions of dollars trying to get people to do pushups and shoot assault rifles. Of course it didn't work - nobody gives a fuck. People need a sustainable society where they can work, earn, feed themselves and their families, invest in their children, have dreams, do what they want to do, have the freedom to express themselves, trade with neighbors, grow relations with other governments. After the original shit-show Afghanistan was left in, the responsibility to inculcate all this was left to the US. Because they entered Afghanistan to begin with.\n\nYou want to argue that the US government doesn't owe them anything? Fine. But don't pretend the pullout was \"ballsy\" and intelligent. It's just that Biden kicked the jenga block when others kept putting it off. But I argue that since the US *was* in the country for 20 years, since they *did* invest trillions into the war, **why did they not change their mandate and actually invest in building a sustainable economy instead?** The Afghani forces *CLEARLY* never cared enough about simply being trained. Their priorities were elsewhere. Because the country has no civil infrastructure, nobody gives a fuck about learning to shoot weapons when they're struggling to put bread on the table. Especially since the US was holding the Taliban at bay - no sense of urgency.\n\nThe US mandate to allegedly train the locals was clearly not working. They knew pulling out would cause a massive crash. They were investing money into a lost cause anyway. And they KNEW they could instead invest in a good cause, and build up the nation to be a legitimate country that could actually fend for itself. But instead, they played hot potato between presidents and pissed around for two decades until someone finally said fuck it and left. It's not courageous, it's not smart, it's definitely not tactical. The terrorist group they went into Afghanistan to eradicate is now RUNNING THE COUNTRY. Every single mandate has fallen to shit. The ONE good thing they could've done - actually put statebuilding on the table, and take Afghanistan seriously - they refused to do.\n\nTo be clear, this isn't really Biden's fault of course. After two presidents touting an exit, he can't do a 180 and put nation-building on the mandate, people will bitch and moan about how the US won't leave Afghanistan. But that's exactly what he should've done.\n\nLeaving the country wasn't the \"right decision\". It was the easy decision. They made a mess, walked in and made a fucking mess, and left it worse than they found it. The only difference between now and before is that the US administration is finally admitting they are not interested in the responsibility they pretended to bear for 20 years.",
            "title_similarity": "0.8510592",
            "sentiment_compound": -0.9968
        },
        {
            "id": "h9c944s",
            "score": 1,
            "text": "The speed at which the Taliban took over, after 20 years of “building” the Afghan military and society in general…. Proves it was the right move. \n\nThere would have been no withdrawal that looked nice. Not when a hostile group is waiting to take over and apparently has no resistance. \n\nWhat would have made it better?  Another 2 decades?  Absurd",
            "title_similarity": "0.8798716",
            "sentiment_compound": 0.7158
        },
        {
            "id": "h9c9oh6",
            "score": 1,
            "text": "Standing ovation for this view👆Let’s GTFO",
            "title_similarity": "0.21488898",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9caape",
            "score": 1,
            "text": "The admin’s original estimate of 60-90 days of brutal urban warfare preceding the same eventual outcome would’ve been much worse. No one expected the Afghan government to hold out. They took the most sensible course of action and did everyone, including Biden, a favor by just conceding.\n\nBiden and Trump both deserve credit for ending this charade. If the media actually cared about Afghanistan, they would’ve actually paid attention to it after Bush dangled the carrot of the grotesque reality show they made of the Iraq War. They did not. Their lamentations ring hollow.",
            "title_similarity": "0.84677535",
            "sentiment_compound": -0.571
        },
        {
            "id": "h9caqsu",
            "score": 1,
            "text": "There's better alternatives than the sudden pull out\n\nEg. Host an election that the Taliban could win, start evacuations in 2020,  partitioning the country into several countries, continuing to pay contractors to keep the airforce flying, etc\n\n\nIn the end, the US can't stay there forever, but they also didn't need to throw afghans to the wolves",
            "title_similarity": "0.81821954",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h9cav8w",
            "score": 1,
            "text": "Wasn't it Trump that signed the treaty to withdraw troops? I'm not from the USA so pardon me if I'm missing something that has been discussed in the news already",
            "title_similarity": "0.66935873",
            "sentiment_compound": 0.2002
        },
        {
            "id": "h9cby4m",
            "score": 1,
            "text": "The war was dumb to even start but after all the money and all that training of the Afghan army with zero results, well it looks like quite a few people in that area are fine with a taliban state.",
            "title_similarity": "0.6938737",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9cc5of",
            "score": 1,
            "text": "Team America World Police…Fuck Yeah",
            "title_similarity": "0.3393695",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9cc6nh",
            "score": 1,
            "text": "I think that, if the US were planning to pull out, it should have at least done a better job of it. If it has  been done in a coordinated and controlled manner, them there could have been time to evacuate those who wanted to leave and to recover any weaponry/vehicles they had in country. This whole \"let's leave by an arbitrarily set date regardless of the situation on the ground\" plan seems to have resulted in unnecessary deaths while at the same time providing the Taliban rediculous amounts of modern weaponry.",
            "title_similarity": "0.73299396",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9ccjeo",
            "score": 1,
            "text": "There is far too much video evidence for peeps like u to sweep the massive fuck up under the rug.\n\nHave u even considered the 2nd, 3rd, 4th order...etc effects?\n\nHow there will be a mass exodus to places like Germany?\n\nHow thousands will mass executed?\n\nHow women and little girls will actually live in a Hand Maiden's Tale IRL? \n\nHow there are Americans and other NATO allies still stuck over there? \n\nHave u already forgotten Syria and how pulling out of Iraq created a whole new breed of terrorism? \n\nHave u been living under a rock?",
            "title_similarity": "0.67179084",
            "sentiment_compound": -0.5803
        },
        {
            "id": "h9cck5w",
            "score": 1,
            "text": "Biden didn't make any decisions 😂 wut are you talking about? Dude said the buck stops with him but isn't paying for it? Weird right? He must have bought Nikes to boycott them .... Oof",
            "title_similarity": "0.5936549",
            "sentiment_compound": -0.598
        },
        {
            "id": "h9cd0km",
            "score": 1,
            "text": "Interventionism exacerbates conflict and the death toll in the long run. There's no honest defense of this dated policy. And: the founding fathers were remarkably noninterventionist. Interventionism is ineffective, tribalistic, murderous, and anti-American. This shouldn't be a discussion, as if to suggest Vietnam or Iraq or Libya or (continues list) was good for anyone.",
            "title_similarity": "0.74524707",
            "sentiment_compound": -0.9016
        },
        {
            "id": "h9cd1w2",
            "score": 1,
            "text": "Every country involved had a moral obligation to pay to rebuild the country our militaries destroyed. Just pulling out like this is an act of cowardice and laziness and we should all be deeply, deeply ashamed.",
            "title_similarity": "0.6739212",
            "sentiment_compound": -0.6976
        },
        {
            "id": "h9cd4jj",
            "score": 1,
            "text": "The rest of the world did the same, yeah I doubt the whole world did the wrong decision",
            "title_similarity": "0.4414906",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9cde4p",
            "score": 1,
            "text": "Disagree.",
            "title_similarity": "0.00025159866",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9cdu0y",
            "score": 1,
            "text": "We shouldn't have been there in the first place.\n\nThe act of leaving in itself isn't a bad thing.\n\nHowever if leaving afganistan is part of a plan to put boots in Syria or Iran then it's terrible.\n\nA few years of an orange man, rainbow flags and Covid shouldn't distract us from the fact that Syria and Iran are still on the list and the establishment will try again and again to manufacture consent.",
            "title_similarity": "0.77212274",
            "sentiment_compound": 0.3691
        },
        {
            "id": "h9cemn6",
            "score": 1,
            "text": "Just a point of clarification the USA was not the only one who dumped, personnel and money, and lost lives into this conflict.\n\nI definitely think the fight had to be taken to the enemy, but the manner in which the allies went about it was not the smartest, and there was never a clear end goal",
            "title_similarity": "0.72576475",
            "sentiment_compound": -0.9121
        },
        {
            "id": "h9ceoah",
            "score": 1,
            "text": "Yes but we need to help the people who helped us.  He needs to make that right.",
            "title_similarity": "0.32624447",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9cflwg",
            "score": 1,
            "text": "it’s not bad optics.. it’s 20 years billions of dollars spent, hundreds of lives lost, all for no reason! If that doesn’t convince you this pull out was wrong, I’m convinced nothing will..",
            "title_similarity": "0.7848479",
            "sentiment_compound": -0.088
        },
        {
            "id": "h9cg7zi",
            "score": 2,
            "text": "It was not. \n\nThe goal of the military presence in Afghanistan began with getting revenge for 9/11 and destroying Al-Qaeda and the Taliban. This eventually extended into nation building which was a bad idea. The idea that we could force Western democracy on a very tribal nation wasn’t ever likely to succeed. \n\nHad the message over the years from Bush to Biden had strictly and consistently been “we’re keeping a small troop presence there to prevent Afghanistan from becoming a terrorist staging base” there likely would have been continuing broad support for this limited mission. \n\nSadly that was not the message. \n\nWe’ve kept forces in Korea since 1957 to offer force projection for our allies in South Korea against NK. The idea that we can’t keep a few thousand troops in Afghanistan to prevent the Taliban and by extension Al-Qaeda from gaining a foothold doesn’t make any sense. \n\nSimilarly the cost argument makes little sense either. The amount we’re spending on Afghanistan currently amounts to about 1% of the U.S military budget. \n\nNow however we’re about to see the consequences of leaving a power vacuum in a highly volatile region of the world. China and Russia will take advantage and the U.S is less safe today than it was before. I would not be surprised to see us back in Afghanistan before the end of Biden’s term just out of sheer necessity once again.",
            "title_similarity": "0.789364",
            "sentiment_compound": -0.89
        },
        {
            "id": "h9cgb19",
            "score": 1,
            "text": "Here is why I think we should have stayed in Afghanistan.\n\n1. The United States has permanent bases across the world and some have been there longer than 50 years.(South Korea and Germany). These countries can protect themselves but the US is there to protect their own interests by warding off the threat of Russia long after the Cold War has finished and the Soviet Union has collapsed \n\n2. The exact same situation occurred in Iraq, where the country was overrun as Iraqi soldiers refused to fight and surrendered en masse. Their army was able to regroup and fight only because of the extensive air support provided by US and it’s allies and the increase in ground support. Further the US has a strong military presence there today to ward of the the threats from Iran and help stabilize the local forces.\n\n3. Pakistan cannot be trusted and will abandon our interests in favor of theirs. They will use Afghanistan and the taliban proxy to strengthen their position against China and India. They hid Bin laden in their country and continued to provide taliban shelter and a safe haven whilst we were fighting the taliban.\n\nTherefore this has nothing to do with the Afghans being unable to protect themselves but rather us allowing Pakistan to secure its hegemony in the region in return of implementing US interests in the area. It’s a cost effective exercise but brutal in its nature. We have let a fundamentalist group takeover just because we did not want waste any more resources. But this will backfire as the country will be used as a terrorist launchpad.",
            "title_similarity": "0.8218169",
            "sentiment_compound": 0.2924
        },
        {
            "id": "h9cgo2h",
            "score": 1,
            "text": "Yup, I'm glad we're out of there.",
            "title_similarity": "0.29071885",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9cgrnz",
            "score": 1,
            "text": "As an American, yes. As a humanitarian, no.",
            "title_similarity": "0.35702866",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9cgxss",
            "score": 1,
            "text": "Leaving wasn't a bad thing. I support it. Afghanistan should've had some sort of plan in place for when we left, surely they didn't think we were moving in. The only part of the whole situation that's trembling is the fact that the Afghani government left billions of dollars in military hardware in the hands of the Taliban. Whether we're \"out of the war\" or not that poses BIG problems for the whole middle eastern region and america alike. But to really believe that the US is getting out of the war scene is quite naive. Whether we are to blame or not the first country that falls victim of Taliban terrorism is going to be pointing the finger right at us to be the guys to clean it up. After all it's our hardware they're using. Congratulations, we're now one step closer to WWIII. A terrorist organization just got there hands on US military hardware, we don't help with the clean up makes us look like allies to the taliban and cowards. We start looking like cowards to the rest of the world it leaves even bigger problems. Higher import taxes, treaties left null and void, then what tell me that. How long after that until someone attacks our soil again? Good thing gun sales are on the rise aye?",
            "title_similarity": "0.8690127",
            "sentiment_compound": -0.9657
        },
        {
            "id": "h9ch16i",
            "score": 1,
            "text": "President Ghani had zero support. Word is he stole the election. Ensuring fair elections and waiting a couple of years for the elections to happen and a loved government gather people’s support would have helped. Also calculating the army will hold 12 months was a mistake. If all soldiers think they will lose a civil war in 12 months, they’d rather surrender now and avoid the year of fighting.",
            "title_similarity": "0.8228844",
            "sentiment_compound": -0.0
        },
        {
            "id": "h9ch6wi",
            "score": 1,
            "text": "Pulling out now was wrong. We should have remained until the peace talks concluded and the Taliban peacefully formed a political party in Afghanistan giving them power peacefully while the remaining Afghani government held atleast some power and then we pull out and from then on we treat Afghanistan as a military Ally similarly to Israel and Saudi Arabia. \n\nIt would have been much more peaceful, we would have kept a friendly relationship with the government in power and the people of Afghanistan would be in a much better position as the Taliban would have limited power compared to the current situation. \n\nOf course all of this depends on the Taliban accepting the peace deals, which isn't a guarantee. But America's presence in Afghanistan was one of Afghanistans largest negotiation tools in these talks but now that tool is gone leading to the Taliban dropping all talks and instead of settling for a small amount if power they have now seized absolute power. \n\nShits fucked in all scenarios but i believe this scenario is less fucked than the one we got.",
            "title_similarity": "0.7467289",
            "sentiment_compound": -0.658
        },
        {
            "id": "h9chg1d",
            "score": 1,
            "text": "Of course it was, we put in 20 years and however many trillions and got like 20 minutes of solvency. Terrible investment for everyone but the arms dealers.",
            "title_similarity": "0.752665",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h9chtm5",
            "score": 1,
            "text": "We had 20 years to get their army up to scratch, but before leaving we withdrew air support and help on repairing their air craft. We also changed the withdrawal date which was seen as reneging on the deal. (I wouldn't trust an occupying force putting back the date if you'd been in my country 20 years)",
            "title_similarity": "0.8195695",
            "sentiment_compound": 0.5715
        },
        {
            "id": "h9cicpl",
            "score": 1,
            "text": "I agree with your assessment and others, but here is an argument for not pulling out which I disagree with although it is one of the less bad arguments in my opinion.\n\nAfter nearly 20 years in Afghanistan in order to keep the Afghan government in control it would require about 4,500 troops deployed based on conditions when Biden took office in early 2021.\n\nSource: https://thehill.com/policy/defense/537133-congressionally-mandated-panel-recommends-biden-delay-may-afghanistan\n\nThat is about one ninth (10-12%) of the troops we have deployed in Germany a country with one the world's largest economies, military, and supports human rights. The most recent estimate I found is that there are over +38,000 troops in Germany. Is it worth to have 4,500 US troops deployed so that girls can go to school, see a doctor, and not be forced in marriage at age 12-14? At that point is is question of values.\n\nSource: https://www.dw.com/en/us-military-in-germany-what-you-need-to-know/a-49998340\n\n\nI agree with the pullout although the way it was administered was poor on Biden's behalf. I **don't** agree with the argument above although it it is a better argument than most.",
            "title_similarity": "0.7680998",
            "sentiment_compound": -0.8013
        },
        {
            "id": "h9cifqi",
            "score": 1,
            "text": "The only thing I’d change your mind about is that the optics are objectively bad. Un-occupying a country should default to a positive thing, shouldn’t it? The specific case here is naturally more complex, and I feel like the main problem isn’t the US pulling out but the optics of “letting” the Taliban in.\n\nWe’ve been in Afghanistan for 20 years, if the Taliban can “take over” in 14 days the optics on that should be that it was the right decision.",
            "title_similarity": "0.8875587",
            "sentiment_compound": -0.0129
        },
        {
            "id": "h9cigtp",
            "score": 1,
            "text": "Now we need to nuke em a little:D",
            "title_similarity": "0.26537782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9cit3h",
            "score": 1,
            "text": "From r/trueoffmychest\n\nhttps://www.reddit.com/r/TrueOffMyChest/comments/p63mp3/afghanistan_deserves_their_fate/?utm_medium=android_app&utm_source=share",
            "title_similarity": "0.36389208",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9cj00m",
            "score": 1,
            "text": "nothing to do with whether or not we should pull out. everything to do with how we pulled out. we had months to prepare and still looked like we ran like chickens with our heads cut off. if this would have happened during trump there would 100% be an impeachment.",
            "title_similarity": "0.77177525",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9cj0qs",
            "score": 1,
            "text": "The US spends so much ficking money on theyre military and they havent won a war.\nNext time you want to send troops to the middle east just dont do anything.\nPls stop making a mess everywhere you put youre soldiers in.",
            "title_similarity": "0.7040064",
            "sentiment_compound": -0.5383
        },
        {
            "id": "h9cjv1c",
            "score": 1,
            "text": "Although I agree that leaving was the right decision and a long time coming, I have a problem with *how* the US left. It seems all the allies were taken by surprise and the locals were caught with their pants down. If Biden was able to point to specific policies and exit strategies (i.e. mobilize Afghan military, withdraw in phases, have protocols to destroy weapons/bases/resources if captured by the Taliban, etc.), then I think people would be less upset. \n\nI'll reserve my judgment, as it's still new and details are still emerging. It's possible that the US did all the right things but the Afghans were just outmatched or unwilling (or both). I know hindsight is 20/20. However, it seems like the US just straight bounced, leaving their friends behind in a shit show that could have been less shitty. It's not unlike the US to do such a thing either.",
            "title_similarity": "0.7921971",
            "sentiment_compound": -0.4703
        },
        {
            "id": "h9cksas",
            "score": 1,
            "text": "Right decision, poor execution. Should’ve had some plan in place to get our allies out.",
            "title_similarity": "0.5245876",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9cli5f",
            "score": 3,
            "text": "Most people aren't mad at him for pulling out of Afghanistan, they're mad at him for possibly causing civilian casualties due to poor planning and prioritizing a symbolic gesture over a safe exit.\n\nFirst, he was adamant to pull out before the anniversary of 9/11 so that he could declare it a political victory in a speech and make the exit more symbolic. He also announced when we would pull out (not very smart from a strategic perspective) and ignored the situation on the ground there. He should have kept the pull out more subtle and not fixated on a particular date.\n\nAlso, he evacuated troops before civilian workers. That is literally the dumbest possible way to leave and puts many of the civilians there that helped us at a huge risk of being targeted by the Taliban. The airport where these civilians could evacuate was even inoperable until several thousand troops were sent back in after the fact to help.\n\nBottom line is he risked the lives of many civilians for a symbolic political victory. His disastrous pull out plan could still potentially result in a lot of casualties because this is far from over. There are still thousands of people waiting for evacuation. His administration knows this and keeps deflecting by acting like they are being criticized for pulling out, when in reality they are being criticized by most people for piss poor planning and execution.",
            "title_similarity": "0.78761387",
            "sentiment_compound": -0.9598
        },
        {
            "id": "h9cn89j",
            "score": 1,
            "text": "There was no good way to end what we should have never gotten into in Afghanistan.",
            "title_similarity": "0.57863003",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h9cnbg1",
            "score": 1,
            "text": "the army should have been withdrawn from there sooner ,since afghan goverment was full of incompetence ,the big turn off is that us forces left almost all equipment there \n\nIts still kinda sad that ppl send there died in vain",
            "title_similarity": "0.71699476",
            "sentiment_compound": -0.9101
        },
        {
            "id": "h9co57t",
            "score": 1,
            "text": "I agree that Biden made the right call. The Afghan military gave up as soon as there was nothing in it for them financially. The President fled. Despite overwhelming advantage in training, position, and arms the Afghan military surrendered without a single whimper. We should start referring to Afghans as waving the white flag at the drop of a hat.",
            "title_similarity": "0.7316545",
            "sentiment_compound": -0.0875
        },
        {
            "id": "h9cona0",
            "score": 1,
            "text": "Leaving was right. Pretending that the \"Afghan Security Forces\" would do ANYthing other than melt away like snow in the rain was wrong.  \n\nEverybody who wanted/needed to get out should have been flown out of there FIRST. The troops should have been the last to leave. (BUT, they definitely should have left. Leaving was absolutely correct.)",
            "title_similarity": "0.7034601",
            "sentiment_compound": 0.6187
        },
        {
            "id": "h9csi4u",
            "score": 1,
            "text": "I’m in agreement, however, I’m angry that we didn’t take more action to help folks in danger escape. \n \nWe spent so much time and money over there. What is the matter of a few more months and a fraction of the total cost so far to get good people, the teachers, civil right advocates, the women who defied Taliban authority and serve in government.",
            "title_similarity": "0.74839437",
            "sentiment_compound": 0.5367
        },
        {
            "id": "h9cup3c",
            "score": 1,
            "text": "It’s too early to pass judgement on this decision. We will have greater clarity as to the wisdom of Biden’s pull out long after he is gone. To claim otherwise lacks perspective.",
            "title_similarity": "0.57375014",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h9cwehn",
            "score": 1,
            "text": "The problem isn’t that the troops came back, that was always going to be aim. The issue is, the handover and the way it was done was so fucking badly mismanaged and now basically an entire country is run by a terrorist, the exact opposite of what so many soldiers fought and died for. Now you have a terrorist group setting up government and now a massive humanitarian crisis caused by the US government. \n\nRegardless of who started and ended the war, the poor people didn’t deserve this and if nothing else, the US was holding some type of authority. \n\nAgain, not upset wars end, just horrible fallout and mismanagement.",
            "title_similarity": "0.79523313",
            "sentiment_compound": -0.9863
        },
        {
            "id": "h9cx4qb",
            "score": 1,
            "text": "I agree with the top comment and honestly yeah it sucks seeing your hard work not pay off but sometimes failing makes you better. This is the outcome of destabilizing other nations for your own personal benefit war never leads to anything other than suffering.",
            "title_similarity": "0.7309886",
            "sentiment_compound": -0.6312
        },
        {
            "id": "h9cxi70",
            "score": 1,
            "text": "There’s no need for this CMV! The neocons are out in full force writing article after article about how we’re “going about it the wrong way” and concern trolling every which way. Just open a newspaper and you’ll see it.",
            "title_similarity": "0.6178898",
            "sentiment_compound": -0.68
        },
        {
            "id": "h9cyfn1",
            "score": 1,
            "text": "I HOPE this isn't too unpopular on here. You're right.",
            "title_similarity": "0.27263343",
            "sentiment_compound": 0.5622
        },
        {
            "id": "h9d0ikl",
            "score": 1,
            "text": "It was the right decision for America but not for Afganistan. As easy as that",
            "title_similarity": "0.4857744",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h9d4a6z",
            "score": 1,
            "text": "Its more about the execution and not the overall idea. For example there's still a lot of people who were helping us for the past 20 years and are now in danger because of that. The fact that we're [leaving them behind](https://www.google.com/amp/s/www.wsj.com/amp/articles/biden-withdrawal-afghanistan-allies-translators-visa-miervaldis-human-rights-taliban-11629054976) instead of giving them asylum here is a big deal and is more than just bad optics.",
            "title_similarity": "0.79348147",
            "sentiment_compound": -0.552
        },
        {
            "id": "h9d4hqt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.025765255"
        },
        {
            "id": "h9d5z96",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.02576524"
        },
        {
            "id": "h9d7smm",
            "score": 1,
            "text": "We had to do it eventually, but we needed an exit strategy. They started murdering women, taking child brides, and basically undid everything we spent 20 years building in 24 hours. My husband risked his life there twice for nothing. His brothers came home in boxes for nothing. Our government is full of complete morons, and it pisses me off. It was a sad day for human rights.",
            "title_similarity": "0.7423966",
            "sentiment_compound": -0.9612
        },
        {
            "id": "h9da5v0",
            "score": 1,
            "text": "While I do agree with the notion of not being there in the first place, the idea the should be working on leaving, and not being involved in pointless wars; I disagree with the perspective that the only reason we were currently there was a for \"nation building\" and I ultimately disagree with how and when it was done. I do not think Biden was ultimately the \"guy with enough balls to do so\" because I believe things are a little more complicated than you're insinuating. \n\nI would first say we were mostly still there at this point for defensive purposes than economic ones. the Taliban is still very much active and existent. While I whole-heartedly agree theres way too much dirty money \"finding its way\" to the Taliban, theres always a threat of them being funded by other foreign enemies (this is not me advocating for making deals with them as a deterrent or appeasement btw) and the US still had a ton of allies and friendlies on the ground as well as foreign connections. Many of whom were operating for the sole reason to make sure the Taliban don't grow into a bigger problem.\n\nThat context makes the way Biden went about it that makes it a bad decision. Biden essentially left  foreign allies, Afghanistan civilians and assets, potential moles or US intelligence being relied on by foreign cooperation, as well as all the connections that may have been there for economic, diplomatic, or the worse \"nation building\" purposes hanging--putting lives in danger and putting a big gash in any foreign nations cooperating with us. \n\nbasically the biggest complaint isn't ideological but logistical. the way Biden went about it gave tons of munitions and military aircraft to terrorists, left allies dry, and let afghan citizens cooperating with the US be executed along with their families.\n\nedit: also Id like to add people seems think its more about \"bad optics\" or that this was ultimately inevitable. Again, the biggest complaint isn't a bad feeling as much as it exists--its about the objectively worsened relationship the US has with allies, the lost resources, and most of all doing so in a way that not only enabled the Taliban, but BUILT them into a much worse and more dangerous threat level.",
            "title_similarity": "0.72628623",
            "sentiment_compound": -0.9867
        },
        {
            "id": "h9db7be",
            "score": 1,
            "text": "Yup. 20 years and 3 trillion and counting and it lasted 2 weeks once we left.\n\nHell most children get less time ( 18 years ) and far less fucking money and do fine in life.\n\nMy thing is this: Imagine if over the last 20 years we invested 2.73 trillion or whatever it is into America. Like real infrastructure, schools, roads, jobs, health care, college, etc. \n\nWe need to spend money here, not everywhere else but here. Everyone bitching at us but hey, we tried. Any other nations want to step up and drop 20 years and 3 trillion? be my guest.\n\nSometimes you have to help yourselves too. They need to figure that shit out, because Russia and the us spent a lot of money and Afghanistan simply just wants to be Afghanistan.",
            "title_similarity": "0.7533817",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h9dbt22",
            "score": 1,
            "text": "I agree with you 100% percent. After 20yrs of training and supplying their military has to stop. I'm also troubled, and I don't know if this is true, but I heard when the Afghan Army saw the Taliban charging, they dropped their weapons and ran away? Can some one confirm or deny this? \n\nThat would be disgusting and the most cowardly thing I've heard!! You have to defend your own country. The US can't do that for you!",
            "title_similarity": "0.844905",
            "sentiment_compound": -0.9557
        },
        {
            "id": "h9ddxm6",
            "score": 1,
            "text": "A good decision poorly executed.",
            "title_similarity": "0.19420338",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9dfd61",
            "score": 1,
            "text": "Kind of difficult to discuss your point of view, but I'll try the best I can, you have to take into account that I'm not American.\n\nThe fact is that the original invasion of Afghanistan started just after 9/11 for very obvios reasons, the US wanted Osama dead and also they wanted to deny the taliban, and by extention Al-Qaeda, operational ground in Afghanistan, and this was basically the backbone of the whole war until today, that and training the afghanis to do it by themselves. So what changed? What improved for the US to retreat from Afghanistan? The answer to that is absolutely nothing.\n\nSo now why exit from Afghanistan? Well that's an easy answer, take the troops home and stop so  much military spending (which probably was in the billion) and those are pretty much it for the reason of why yes exit from Afghanistan.\n\nWhy not exit from Afghanistan then? The taliban is the only answer, but it has so much to it: They took women's rights, they ravaged their way to the capital and are killing every afghan army personnel they can find, they took every single piece of equipment they us and afghan army left to the point that they basically have an airforce right now and the fact that they are probably going to attempt terrorist attacks on US soil.\n\nSo was it the right move to exit Afghanistan? The answer is that they should have left eventually, but the way they did it and the time they did it was absolutely awful. The world right now is very preocupied about Iran, imagine that they ally with the taliban, WW3. The way the army retreated was also absolutely awful leaving a bunch of equipment for the taliban to take on the wake of their blitzkrieg conquest of Afghanistan.\n\nEvery action has consequences and this one will have more than a few, I'm just not sure how much time it will take for a building to fall down, but I can assure you that's what they're planning right now",
            "title_similarity": "0.7892383",
            "sentiment_compound": -0.9594
        },
        {
            "id": "h9dgr42",
            "score": 1,
            "text": "Its not that it was a bad thing. Its the fact that people who were promised safety and help for helping the US are now left behind at the hands of the Taliban (and its not pretty what they do to people who help the US). It was also largely publicized and its basically just telling the taliban \"Hey we are leaving at this date and time\", allowing the taliban to move in the moment the US has pulled out.  If anything, pulling out those who helped the US first then the soldier woulda been my plan (Im not a president or had experience in the army or anything so my opinion is as good as the next guys) \n\nGetting our troops out of there wasnt really bad, just the way it was done was.",
            "title_similarity": "0.79021156",
            "sentiment_compound": 0.8943
        },
        {
            "id": "h9dh3v3",
            "score": 1,
            "text": "I know vertually no one will agree with me, but I think in an ideal world I think america should have given Afghanistan some level of statehood. This way in my opinion, stability could have been better established, corruption reduced and institutions established. Long term once stability was achieved and corruption had vanished perhaps they could have had a referendum to resume their full independence if they wished.",
            "title_similarity": "0.7268",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h9dh65d",
            "score": 1,
            "text": "I do think it was the right thing to pull out as well, it was an endless war that the US could never have resolved. Call me selfish but the thing that worries me as a US is are we going to see another 9/11 type event or another deployment to the middle east from the US in the near future?",
            "title_similarity": "0.8034928",
            "sentiment_compound": -0.7851
        },
        {
            "id": "h9dhwci",
            "score": 1,
            "text": "It was the right decision, executed in the absolute worst way. Biden is making huge mistakes left and right. He’s well on his way to repeating the GWB model.",
            "title_similarity": "0.6519511",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9di5g5",
            "score": 1,
            "text": "I think what people were annoying about was how sloppily it was done. Instead of following any set procedure, The evacuation was ad libbed. The result was the Taliban gaining massive caches of heavy weaponry, artillery, armored vehicles, and ammunition.",
            "title_similarity": "0.6616569",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h9djfqa",
            "score": 1,
            "text": "It was basically The Vietnam war again almost exactly, I agree",
            "title_similarity": "0.47413787",
            "sentiment_compound": -0.3947
        },
        {
            "id": "h9dks0s",
            "score": 2,
            "text": "If you haven’t watched the Vice documentary from 2013, please do so before saying we didn’t pull out in the right way. We shouldn’t have ever gone and we should’ve left at the time this documentary was filmed or before. What happened in Afghanistan would’ve happened 10 years ago or 10 years from now. \n\nHere’s the link:\n\nhttps://www.reddit.com/r/Documentaries/comments/p65ztw/this_is_what_winning_looks_like_2013_a_stark_look/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.74150085",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9dlqrh",
            "score": 1,
            "text": "It’s not the decision to pull out that isn’t right, it’s how Biden did it. Then he lied to the American people over and over in his speech, and went back on vacation. This administration is a fuckin disaster - inflation, massive labor shortage, CDC vs WH drama, where is Kamala Harris???, Biden barely finishing press conferences, Biden calling lids at noon, gov printing money like it’s going out of style, and the list goes on and on",
            "title_similarity": "0.70804036",
            "sentiment_compound": -0.7925
        },
        {
            "id": "h9do2yx",
            "score": 1,
            "text": ">Yes, the optics are bad. \n\nUnderstatement of the year, right here. There was no need for there to be any bad objects at all. Everybody knew the Taliban was going to take over once we were gone. But there was no reason not to evacuate all the American citizens first as well as all of the Afghans with SIV status. We're literally leaving citizens and allies to die at the hands of a theocratic regime for no fucking reason whatsoever.",
            "title_similarity": "0.7921021",
            "sentiment_compound": -0.9109
        },
        {
            "id": "h9doawn",
            "score": 1,
            "text": "You're looking at this through an incredibly narrow scope I think. In context, that may be the case that pulling out is a good decision but the fact is that the American presence not only escalated a war that the natives can't properly handle but also involved and compromised various helpful native sources (like interpreters) and basically said \"you aren't American so fuck you.\"",
            "title_similarity": "0.6971539",
            "sentiment_compound": -0.6895
        },
        {
            "id": "h9dqbua",
            "score": 1,
            "text": "There is an argument for just keeping a base there just to keep the stalemate with the Taliban. Dan Crenshaw makes the argument here and its pretty convincing \n\nhttps://youtu.be/0g2lpVfSoac",
            "title_similarity": "0.6513242",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9e1o1r",
            "score": 1,
            "text": "Didn't Trump sign the withdrawal tho?",
            "title_similarity": "0.4293155",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9e73wz",
            "score": 1,
            "text": "The first thing to emphasise is that the Taliban takeover really is bad. Bad for both the Afghan people and the US and its allies. So any decision that results in that outcome is questionable. \n\nI agree that leaving in 1 year or 5 years would just have postponed the takeoever by 1 or 5 years. \n\nHowever the real alternative is simply leaving some 5,000-10,000 troops there indefinitely. That plus air support would probably have been enough to sustain the Afghan government indefinitely. \n\nNow sure that would go against the whole “end the war, bring the troops home” mindset, however the US has had thousands of troops stationed in South Korea and Germany for years and Americans seem ok with that. \n\nSome people might say “This would just make Afghanistan a protectorate / client state of the US” - would that really be so terrible? \n\nIf the Taliban can be convinced that US and NATO will stay there no matter what that might have pushed them to genuinely negotiate with the Afghan government.",
            "title_similarity": "0.86354494",
            "sentiment_compound": -0.8569
        },
        {
            "id": "h9ea5ka",
            "score": 1,
            "text": "I agree. He has balls.",
            "title_similarity": "0.092353985",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9f0z6s",
            "score": 1,
            "text": "We could have similar delayed under the winter which is when the Taliban are not fighting because they lack the equipment to fight in winter. That would have allowed us to get all our allies and citizens out.",
            "title_similarity": "0.68362653",
            "sentiment_compound": -0.5705
        },
        {
            "id": "h9g30og",
            "score": 1,
            "text": "Was pulling out of Afghanistan the right decision? I don't know for multiple reasons even if you leave terrorism and the Taliban out of it. Whether or not pulling out was the right decision, it definitely was not done the right way.",
            "title_similarity": "0.6225069",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9g523r",
            "score": 1,
            "text": "Pulling out of Afghanistan with such haste and bravado after 20 years and $1 trillion spent was the wrong move. Afghans have been abandoned and unfortunately the narrative now becomes completely controlled by the Taliban. Moreover, the war was a total failure by pulling out now. Working towards a peace process that lead to an end to the 30 year conflict in Northern Ireland didn’t happen overnight. Trump actually came close (apparently) but negotiations failed but this happens - and sides need a chance to learn. The main concern now is twofold a) rights of women and others in the country is in jeopardy (not saying that they were particularly good anyway) b) radicalism and the spread of the the caliphate under Sharia Law across the Middle-East and wider world. #justmytwocents",
            "title_similarity": "0.8614505",
            "sentiment_compound": -0.866
        },
        {
            "id": "h9gkk4f",
            "score": 1,
            "text": "Plot twist:  Afghanistan never wanted us there.  Afghani army fled to live out normal lives because they always sided with the Taliban.\n\nSatirical of course",
            "title_similarity": "0.6917276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9h15lo",
            "score": 1,
            "text": "Sunk cost fallacy is not adequate foreign policy.",
            "title_similarity": "0.4023371",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h9ms7yf",
            "score": 1,
            "text": "US fucked over Afghanistan and people of Afghanistan and all you suckers care about is your billion dollars of tax payers money.",
            "title_similarity": "0.66974616",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h9mufsx",
            "score": 1,
            "text": "They were only wasted  because we pulled  out. The  cost has been immense, but that’s not the  question anymore. The  question is the current commitment too much. And 3500 soldiers and no solider  deaths in over a year and half is worth perpetually remaining at that cost to conserve the entire  investment.",
            "title_similarity": "0.8180753",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h9x5836",
            "score": 1,
            "text": "I agree with the general point, but something I think you're missing is that a lot of the criticism against him isn't about him pulling out it's about /how/. He had plenty of time to get our allies out beforehand, he wouldn't of needed to delay it any longer in order to do that, either. I will say that this was a rare instance where his intentions were in the right place though, I just think he underestimated how fast the Taliban would take over and it's hard for me to blame him entirely because I think most people were surprised. Still, it doesn't change the fact that in hindsight that is something that could've been done better and it's important to talk about it so that history doesn't repeat itself. Then again, the best way to assure that is to not get into needless wars in the first place and that's something that needs to be harped on just as hard. But of course, the mainstream media ignores that part.",
            "title_similarity": "0.7775735",
            "sentiment_compound": -0.6863
        },
        {
            "id": "h9xnv6y",
            "score": 1,
            "text": "Pulling out was not the issue for me. It was the fact that we left so much equipment there to arm the taliban. Especially black hawks.\n\nhttps://www.google.com/amp/s/nypost.com/2021/08/20/us-left-billions-in-weapons-in-afghanistan-with-black-hawks-in-talibans-hands/amp/",
            "title_similarity": "0.67878515",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha3fdqd",
            "score": 1,
            "text": "Yes it was the right decision. The issue is how he pulled out leaving the entire country in a mess.",
            "title_similarity": "0.61716205",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hao8gl2",
            "score": 1,
            "text": "I served in Afghanistan. Pulling out was the right decision, I thought that when Trump made it and was happy it appeared Biden would continue with the plan. If I had known this is how it would be done, I would have never supported it.\n\nIf someone is on fire, the right thing to do is put out the fire. If you put out the fire by stomping on them and they die in the process, you did not actually help them. That's what Biden did to Afghanistan. There was no reason we couldn't leave civilian contractors there to fix aircraft and a small team of special forces advisors to help direct operations. That's literally all it would have taken.\n\nI don't think you understand how much equipment we left them and how bad it's going to be in the future. Western militaries number one advantage is air superiority, specifically air superiority that we operate at night when they can't see us. We left them thermal optics, night vision, infrared targeting equipment, DRONES, in addition to more weapons than they've ever seen in their lifetime.",
            "title_similarity": "0.8158874",
            "sentiment_compound": -0.7064
        },
        {
            "id": "hbo49na",
            "score": 1,
            "text": "I personally feel that there was no right decision possible in Afghanistan. All countries come with a past and the more people outside of the country drive the direction of another country, the more messed up it becomes. \n\nGeography usually determines which countries have been most invaded, occupied or annexed. A small country near a powerful much larger country for example or where 2 or more empires/religions meet. Any interference effects the development of a country as it prevents the conversation between its people to normalise their societies and have shared traditions. \n\nChange is difficult and frequent violent changes are hardest of all. In an ideal world, Afghanistan would be left alone to develop as it decided without outside influences. After so long it is no wonder that Afghan society is so fractrured and tribal. Who can you trust except your family and immediate neighbours?\n\nI hope that Afghanistan can flower again but there is a lot of history to be worked out before it becomes stable once more.",
            "title_similarity": "0.6890675",
            "sentiment_compound": 0.2272
        },
        {
            "id": "hc07l2o",
            "score": 1,
            "text": "Pulling out was the right decision done poorly",
            "title_similarity": "0.41446745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hghoaft",
            "score": 1,
            "text": "I am okay with him pulling but so fucking pissed at leaving all the equipment behind",
            "title_similarity": "0.57385564",
            "sentiment_compound": -0.8024
        },
        {
            "id": "hu6rh01",
            "score": 1,
            "text": "Soldiers dead, left behind and millions of dollars in fully armed military vehicles and helicopters just left there maybe do more research on why people are mad",
            "title_similarity": "0.6250223",
            "sentiment_compound": -0.8176
        }
    ]
}