{
    "CMV: Pedophilia should be treated as a mental disorder first and foremost. Those with feelings of pedophilia who have not acted upon them should be given nothing but sympathy.\nLet me first clarify that I am in no way trying to justify the sexual assault of children. It is, of course, disgusting and immoral. Having said that, I feel that my argument is primarily predicated upon my belief that treating pedophilia as a mental illness will lead to a decrease in the number of those crimes.\n\nFor what it’s worth, both the DSM-5 and the ICD-11 (Diagnostic Statistical Manual of Mental Disorders and International Classification of Diseases, respectively) classify pedophilia as a mental disorder, pedophilic disorder. Again, take this for what it’s worth to you.\n\nI think it’s very telling that if you look into the correlation between therapy and the rates of suicide and suicidal ideation, therapy causes as substantial decrease in both of those activities, as you would expect. A [2019 meta analysis of the subject](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6389707/) found “Out of 1578 papers, 40 original observational studies fulfilled our selection criteria. The most used psychotherapeutic treatments were dialectical behavioral therapy (DBT, 27.5%) and cognitive behavioral therapy (CBT, 15.0%) in patients with a diagnosis of borderline personality disorder (32.5%) and depression (15.0%). Despite the between-study heterogeneity, interventions lead to a **reduction in suicidal outcomes, i.e., suicidal ideation (55.0%) and suicide attempts (37.5%).** The content and reporting quality varied considerably between the studies.”\n\nThe worst thing that you can do in regards to untenable behavior, be it suicide, homocide or child abuse, is to make it so those with thoughts of doing those things are unable to express those thoughts. If we treat pedophiles - again, not sex offenders - with sympathy and understanding, then their path to rehabilitation becomes much more clear. Pedophiles are never going to wake up one day and stop being pedophiles. Expecting that of pedophiles is just as reasonable as expecting it from an LGBTQ person. Not to say that being a pedophile is comparable to being gay, bi or trans on a moral level, but they are similar in the sense that the feeling is never going to disappear.\n\nIn fact, despite what I have said, there isn’t really a known “cure” for pedophilia. The therapy I have been alluding to only works to decrease instances of pedophiles acting on their feelings, there has been no evidence that a sexual preference for children can be altered - at least not consistently. I would argue this all the more reason to support people with these feelings. If you’ll indulge an appeal to emotion, imagine being in their position. These are individuals who are unable to act out one of the most natural human urges, sex. Additionally, and I don’t have evidence for this but I don’t think it’s a stretch, a great number of them very likely feel disgusted with themselves for these feelings. And then, imagine not being able to express the position that you are in without being totally ostracized. \n\nEven if we totally remove the well-being pedophiles themselves out of this, don’t you think that’s a social climate that breeds more cases of children being assaulted, rather than less?\n\nPedophiles have an urge that should not be acted upon under any circumstance. To me, this is precisely why they require support. If not for their own benefit, then to the benefit of the people who could be their victims. \n\nI want to close this out by clarify not everyone who sexual assaults children is a pedophile, just as not all pedophiles assault children. There’s definitely some overlap, but I’m not going to act as though reaching a hand out to pedophiles would eliminate this type of assault.": [
        {
            "id": "h9ms9tr",
            "score": 1,
            "text": "Reminder for all users that calls to violence are prohibited by Reddit's TOS and will **not** be tolerated.  \n\nFind DeltaBot's comment [here](https://www.reddit.com/r/changemyview/comments/p7eqst/cmv_pedophilia_should_be_treated_as_a_mental/h9jmjwz/)",
            "title_similarity": "0.78688014",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9j8sxt",
            "score": 2,
            "text": "Many serial murders cannot help who they are. What they have is also a mental disease especially with your line of thinking but I don't think we should start treating the John Wayne Gacys and Ed Geins or the world any differently than we have.\n\nPedophiles harm innocent people. That may be because they have a mental disorder but that shouldn't change that they need to be locked up, it may be inhumane to them but it's more inhumane to put children at risk",
            "title_similarity": "0.85247856",
            "sentiment_compound": -0.8996
        },
        {
            "id": "h9jnf6u",
            "score": -4,
            "text": "To much people in the world. Why keep the bad ones?",
            "title_similarity": "0.4756304",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9j89je",
            "score": -4,
            "text": "Your opinion is like saying rape is a disorder and should be fixed through therapy.\n\nYou compare issues that are treated with forms of therapy that are internal issues that don't harm others \n\nYou even have the audacity to compare pedophile to LGBT  as it they are born that way.\n\nPedophiles are disgusting and harm innocent children they deserve to be removed from this world.\n\nEveryone has feelings that they don't act upon and if you need help with those thoughts go get it but no sympathy here.",
            "title_similarity": "0.9071683",
            "sentiment_compound": -0.6798
        },
        {
            "id": "h9jllw6",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jd275",
            "score": 1,
            "text": "Jail is meant for those unfit for society. It is a subjective decision made by those in power, whether elected or forcefully there. At this time, pedophilia is something many societies deem unfit. Rehabilitation can occur in prison in some of the ways you suggest, but having them have potential access to children is, in my opinion, irresponsible and detrimental to society. \n\nI think it would suck if pedophile was your thing, I don't know if it is a decision or not I just know it is not my thing and the thought of it makes me sick to my stomach. I would vote we keep those people as far away from society as possible.",
            "title_similarity": "0.81525046",
            "sentiment_compound": -0.936
        },
        {
            "id": "h9k7ymu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9j5d1g",
            "score": 0,
            "text": "I won’t give them sympathy because they have a high potential to be dangerous. Also, many may lie to you and say they have never offended, but they just haven’t been caught. It’d be like someone telling me that they have an urge to murder people, but they want help so I should just give them sympathy. I can’t sympathize with someone who has a desire to harm others.\n\nThe best treatment for pedophilia is chemical castrations. If they would do this then I will have sympathy for them.",
            "title_similarity": "0.84519774",
            "sentiment_compound": 0.8972
        },
        {
            "id": "h9jumk4",
            "score": 2,
            "text": "Just to clarify, being queer has nothing to do with being a pedophile. Queer people feel attracted to consenting individuals, whereas pedophiles are attracted to children, who are not mature enough to consent to any kind of sexual activity.",
            "title_similarity": "0.72804415",
            "sentiment_compound": 0.6331
        },
        {
            "id": "h9jcsf8",
            "score": 0,
            "text": "I think the biggest problem is, since it won’t ever go away, they shouldn’t ever be integrated into normal society. I don’t want a known pedophile, even if they never acted on it, at the park, working at the grocery store, or next door. One way around this could be some sort of pedophile list (like the sex offender list), but if that’s the case no pedophiles would try to get help.",
            "title_similarity": "0.7600733",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h9jfvsi",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jqb7v",
            "score": 0,
            "text": "The issue with treating those that have an urge to abuse children (and that is the *only* acceptable interpretation of any adult who desires to perform sex acts to children) with sympathy and understanding is the understanding part.\n\nThere is no understanding that desire, any more than there is an understanding of a psychopath's potential desire to kill people. Psychopathy, by the by, is also a mental disorder.\n\nI can sympathize with a pedophile struggling to not do these things, but I sympathize more with the children that are sexually molested each year. The number of children assaulted, raped, and scared into silence.\n\nAnd ultimately? Mental disorder treatment (indeed, most medical intervention) is something to be discussed with qualified medical professionals. Therapists, psychologists, and psychiatrists can sympathize and offer support network, and such medical intervention should be accessible and available.\n\nI am not such a professional. I am someone who is blatantly against the unknown and potentially deeply damaging effects of normalizing, on any level, pedophilia. Child abuse and those who desire committing it don't need sympathy. They need treatment. And if that fails to manage or eliminate that desire, they need a humane execution.\n\nYes, we can't treat an LGBT person. Because that is a legitimate and valid sexual orientation involving sexual desire among consenting peers. That is wholly different than pedophilia, which, by definition, involves the desire to sexually molest children with no ability to consent. It is no more valid an orientation than a desire to rape blackout drunk victims, or coma patients.\n\nThe desire to do those latter things? Should not receive support. Of any kind. In any way.",
            "title_similarity": "0.8316508",
            "sentiment_compound": -0.9898
        },
        {
            "id": "h9k0chp",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.26965585"
        },
        {
            "id": "h9kiqvl",
            "score": 1,
            "text": "No. As a person who dealt with being raped as a child on several occasions i can eithout a doubt say that there mental illness should be stomped out. They get zero sympathy. They are a blight on humans and i dont care if irs there choice they should be beheaded and thats that. Occasionally people will be born with this inclination and i dont care. I dont care if they didnt chose it.. They are predators and there only sexual desire is rape based and and twards the most innocent of people..",
            "title_similarity": "0.8228179",
            "sentiment_compound": -0.9381
        },
        {
            "id": "h9j424d",
            "score": -28,
            "text": "I think they should be given nothing but a bullet to the head. \n\nYou owe nothing to pedophiles. They should not be treated as normal human beings, they have only played the sympathy card on social media because that is what they do; they manipulate, they find their way to children so they can abuse them. They want you to “help” them because they want chances to participate in their sick fantasies.",
            "title_similarity": "0.83633876",
            "sentiment_compound": -0.4932
        },
        {
            "id": "h9jy79g",
            "score": 1,
            "text": "You cannot change sexual preference though, and finding children attractive is exactly that. We know this because therapy can not make a homosexual straight. This is why conversion therapy has been banned in many countries. Being gay obviously isn’t a problem and can be left alone, finding children attractive is a problem and the only way we can remove the danger from the children is by physically blocking pedophiles access to children via incarceration.",
            "title_similarity": "0.8236475",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h9kr6ni",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jdgxr",
            "score": -4,
            "text": "Is being gay a choice? \nA mental disorder?\n\nReplace pedophilia with gay in every  argument.  Pro and con.  see if that changes any of your argument, Pro or con.",
            "title_similarity": "0.6223842",
            "sentiment_compound": -0.7941
        },
        {
            "id": "h9kuuhb",
            "score": 0,
            "text": "It’s the devil, don’t listen to him, go to a Catholic Church, tell the priest, tell God, he will heal you and rid you of these demons.  Never give in to them, no matter what, rape, murder, etc, never give in.",
            "title_similarity": "0.63426",
            "sentiment_compound": -0.9297
        },
        {
            "id": "h9jky8v",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9k0n1l",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jj0lb",
            "score": -2,
            "text": "By following your logic and arguments you are making a case that LGBTQ people have mental disorders.\n\nWe used to consider LGBTQ people to all have mental disorders and we treated them accordingly.  Ask a gay man if he wants society to go back to considering his sexual attraction a mental disorder. \n\nI don't consider someone's sexual attraction to be a mental disorder. In ancient Greece it was socially acceptable and expected that old men have sex with young boys. Was every old man attracted to those boys in ancient Greece a pedophile? \n\nWe as a society today have deemed sexual attraction to children to be wrong because we have decided that children are too innocent to make sexual decisions for themselves. Those people that have sexual attraction to children are just as natural and normal as two straight people the same age being attracted to each other, or two gay men being attracted to each other.",
            "title_similarity": "0.7852626",
            "sentiment_compound": 0.946
        },
        {
            "id": "h9jlrc8",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jmwyv",
            "score": -1,
            "text": "Do we feel sorry for thieves? What about people who want to steal, but don’t?\n\nJust because they want to do something, and they don’t do it, doesn’t really make them sympathetic. They’re just being good citizens because that’s what you’re supposed to do.",
            "title_similarity": "0.7014315",
            "sentiment_compound": 0.805
        },
        {
            "id": "h9jrfqk",
            "score": -2,
            "text": "Yeah, that'll be a nope from me. \n\nIs being a rapist a mental disorder? No? Okay then.",
            "title_similarity": "0.7477127",
            "sentiment_compound": -0.7059
        },
        {
            "id": "h9jv7fn",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jvsht",
            "score": -2,
            "text": "So what are the effective treatment modalities for pedophilia? Serious question.\n\n…..\n\nSerious Answer: a public hanging. Change my mind.",
            "title_similarity": "0.697214",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9k5i80",
            "score": 1,
            "text": "I disagree. they need to be removed from society.",
            "title_similarity": "0.5513722",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9kklsh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jk9vd",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9k0512",
            "score": 3,
            "text": "If I have a mental capacity to cause harm to society I need to recieve therapy in an isolated setting. Acting on their feelings is wrong but what’s just as wrong are the feelings. Being attracted to children is jot acceptable in any capacity whether you can control that desire or not. \n\nFurther, until you can prove that people with attraction to children can be (for lack of a better word) “cured” of their desires then they can not interact with the public. Everything you’ve stated have been tools for mitigating risk to children, not eliminating it completely. \n\nThe rights of children should be taken into account over the rights of people who have a capacity to think about getting sexual gratification from children. \n\nOther people born with debilitating health issues, mental or otherwise, do not get to live normal lives. There are people so allergic to the world they have to stay home forever. There are people who have such prevalent  thoughts of violence that they need to be kept within the confines of mental facilities.  \n\nI feel bad for people struggling with illness or mental states they have no control over. I have some level of empathy for people who can not control their desires. Ultimately, life just is not fair all the time and some people need to be kept isolated from the world so they can have the best quality of life available to them in spite of their condition. \n\nAll this to say I don’t think anyone who has the propensity to think of children sexually should receive therapy in a public setting mainly because their quality of life is not worth the risk of endangering any child’s life.",
            "title_similarity": "0.81685936",
            "sentiment_compound": -0.966
        },
        {
            "id": "h9j48kp",
            "score": 0,
            "text": "Can you explain why you think it isn't already treated this way? It is.",
            "title_similarity": "0.40374112",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9j8l4e",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9j9o72",
            "score": 2,
            "text": "I do agree with you although it creates an Interesting dilemma about our free will. \n\nIf someone has an attraction to children and doesn't act on it we may sympathise as this isn't really their fault, it's faulty wiring of the brain so to speak. We understand they didn't create their neural network creating these attractions they don't want so it's unfair to punish them.\n\nHowever if someone does act on their urges to what extent are they still in control of the things they have done? Just like the pedophilia, one's ability to control whether they act or do not act is just a product of their brain which has had influences from genes and it's environment so are they any more in control? Obviously it should be illegal do deter the crime and to protect children but I hope you see my point.",
            "title_similarity": "0.7835347",
            "sentiment_compound": 0.8169
        },
        {
            "id": "h9j9yvf",
            "score": -1,
            "text": "If you are sexually attracted to children, its not a mental disorder. This is from the same premise that being gay is not a mental disorder. You cannot treat it is a mental disorder, the concequences unlike adult sexual/relationships - are that a child always ends up being abused/hurt when the peadophile acts.",
            "title_similarity": "0.7772925",
            "sentiment_compound": 0.3309
        },
        {
            "id": "h9jjg66",
            "score": 1,
            "text": "Your view is that the current state should be maintained? To my knowledge, there's no law against being attracted to children and, as you note, it is treated as a mental health issue. Socially speaking, do you have an example of a non-offending pedophile being ostracized?",
            "title_similarity": "0.78597873",
            "sentiment_compound": 0.2406
        },
        {
            "id": "h9jx4sa",
            "score": 2,
            "text": "Is sympathy the name of a new form of castration or?",
            "title_similarity": "0.5096397",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9jxdul",
            "score": 2,
            "text": "I mean, I don’t really care if pedophiles kill themself. Would think this would be ideal. Am I the only one? Sounds harsh but f them",
            "title_similarity": "0.81936705",
            "sentiment_compound": -0.0909
        },
        {
            "id": "h9k1uwn",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.26965585"
        },
        {
            "id": "h9k2fff",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9k4dsk",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9k7arq",
            "score": 2,
            "text": "Uh no...they should get everything they have coming for them in prison. Personally I think if you prey upon a child and or sexually assault a minor in anyway, you should be castrated! I hate how some people think pedophilia should be allowed and yes I've met very far left wing people (acquaintances) who think pedophilia shouldn't be punished if it was consentual. Like WTF?!?\n\nI think by degrading something as heinous as pedophilia down to a simple mental disorder, rather than a horrible crime, you start to victimize those responsible for preying upon children, given time. They should be treated as criminals and should be castrated.",
            "title_similarity": "0.8477414",
            "sentiment_compound": -0.9834
        },
        {
            "id": "h9k8yxc",
            "score": -1,
            "text": "fuck that.  pedophiles deserve ZERO rights. Should be used as guinea pigs to cure diseases.",
            "title_similarity": "0.78639615",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9kdtxy",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9kmrgw",
            "score": -1,
            "text": "No they should be taken out back and have a bullet put in there brain",
            "title_similarity": "0.4435438",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9kuljt",
            "score": 0,
            "text": "Tell that to victims or their parents. Pedophilia ruins lives and the pedophile should be locked away permanently so they can’t ruin any one else’s life",
            "title_similarity": "0.79274744",
            "sentiment_compound": -0.8505
        },
        {
            "id": "h9kvm0y",
            "score": 0,
            "text": " Pedophiles are a disease. They are sick and need to be dealt with. I cant say what I really want to say.",
            "title_similarity": "0.69077456",
            "sentiment_compound": -0.4033
        },
        {
            "id": "h9kxogn",
            "score": -1,
            "text": "Nah. We should “treat it” like an illness then turn them over to the death squads and let them skin them alive or light them on fire or whatever means takes the longest for them to scream in pain and eventually die in the most horrific way possible. \n\nBut yeah, touchy feely feelings seems like a great idea. As long as they die screaming fir their mommy",
            "title_similarity": "0.6420382",
            "sentiment_compound": -0.7904
        },
        {
            "id": "h9kxyxc",
            "score": -1,
            "text": "There is no rehabbing these people. None. You don’t rehab them.\n\nYou kill them and move in like nothing happened. That’s justice",
            "title_similarity": "0.653913",
            "sentiment_compound": -0.8007
        },
        {
            "id": "h9l1wgu",
            "score": 0,
            "text": "Remove them from the gene pool... These kinds of toxic thoughts will blur the lines of society's morality. I can't believe this idealogy is becoming mainstream.. I saw the Ted talk on this, What a scary world.",
            "title_similarity": "0.737797",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9l3ilz",
            "score": 0,
            "text": "As a child I was molested multiple times and do not agree.  It is far too widespread for one thing.  It is frightening how many adult men have this inclination.  It is not like they can't help themselves. Teaching them to control themselves so they don't harm children is not realistic.  These mother fuckers aren't just giving in to a desire.  They have gone out of their way to plan out and enact a scenario where they are alone with the child.  Usually many times.  They are conniving,  selfish sociopaths and if they weren't child life destroyers they would still be assholes.\nEdit: sorry,  not just men.  A couple were women - just mostly men.",
            "title_similarity": "0.7310163",
            "sentiment_compound": -0.9531
        },
        {
            "id": "h9lcwya",
            "score": 0,
            "text": "The best cure for pedophilia is a bullet between the eyes. Pedos are some of the most manipulative dicks I ever met (I work with all kinds of offenders).\n\nMost of them are beyond saving. Just keep them away from your family at all costs.",
            "title_similarity": "0.7313996",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9lnc3s",
            "score": 0,
            "text": "I liken non offending pedophiles to rabid dogs that haven't bitten anyone yet. They might not have, but it's only a matter of time, and what do you tell the child that you let get \"bit,\" by not doing anything about it?",
            "title_similarity": "0.68780005",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9lrcxs",
            "score": 0,
            "text": "They should die",
            "title_similarity": "0.3851534",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9ltt19",
            "score": 0,
            "text": "I know they cure to pedophilia \n\n\n\n\n\n\n*a 9mm*",
            "title_similarity": "0.4799909",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lv0re",
            "score": 0,
            "text": "Hang em till they are dead",
            "title_similarity": "0.37517965",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9lvio6",
            "score": 0,
            "text": "They deserve death.",
            "title_similarity": "0.45213413",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9m0j77",
            "score": 0,
            "text": "Found the pedo",
            "title_similarity": "0.2255013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m0k8d",
            "score": 0,
            "text": "Nope. Fuck you and any pedophile. They all deserve the death penalty",
            "title_similarity": "0.62933254",
            "sentiment_compound": -0.6187
        },
        {
            "id": "h9m4v61",
            "score": 0,
            "text": "Let's settle on a \"No, but also HELL NO\".",
            "title_similarity": "0.5352307",
            "sentiment_compound": -0.859
        },
        {
            "id": "h9jkdg6",
            "score": 9,
            "text": "It should be treated as a biological sexual attraction that among current society is deemed unacceptable to act upon, first and foremost. \"Mental disorder\" gives the impression to most people that something is *inherently* wrong with someone. That there are avenues to be \"cured\". That it's a *personal* issue, rather than one based upon society.\n\nWe can have strong positions as a society that make certain biological drives unacceptable to be acted upon. We do that quite often. But that's unique from someone being \"lesser\" as a person for having that drive. There are elements of self-control in all of us that should dictate more of whom we are than any impulse we have, but choose not to act upon.\n\nThey shouldn't be given sympathy. Why would we feel sorry for them as we maintain the principle that such a desire should not be acted upon? They should be granted understanding, but not an emotion of pity. So I'd profess empathy, more so than sympathy.\n\nAs a further note, this should be an interesting thread. I've received a week ban from reddit itself before by saying that pedophilia is distinct from child sexual abuse.",
            "title_similarity": "0.7882564",
            "sentiment_compound": -0.7719
        },
        {
            "id": "h9kqs75",
            "score": 15,
            "text": "I was a victim of a pedophile for 10 years. From the moment he adopted me when I was 5. It started at the same time as when he married my mother. When I was 10-11 I was contemplating on how to best stop him, and I almost stabbed him with a knife. He never touched any other kid, never violated internet laws, never touched HIS kids. Just me. Logic dictates that I was simply a target of convenience. \nEven if pedophiles they are sick, sometimes the best treatment for a sick dog is for it to be put down.",
            "title_similarity": "0.653896",
            "sentiment_compound": -0.0852
        },
        {
            "id": "h9jrn3h",
            "score": 2,
            "text": "The problem here is that paedophilia has the real potential for others to get hurt. Many mental illnesses don't increase the risk to others.",
            "title_similarity": "0.7194592",
            "sentiment_compound": -0.8572
        },
        {
            "id": "h9k28jv",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jmq17",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jazrh",
            "score": 59,
            "text": "A lot of these responses don’t account for the fact that most people with pedophilic disorder got that way because they themselves were victims.  That may or not affect your opinion on the CMV but it’s worth considering before going straight to “put a bullet in their heads.” It’s worth also taking a breath and noting that OP drew a very firm line between perpetrators of violence against children and people who could be diagnosed with the disorder.  That Venn diagram is not a perfect circle.\n\n*Edit- should have said “many people” not “most people.” I don’t have any data to back up the use of “most.”",
            "title_similarity": "0.7758029",
            "sentiment_compound": -0.9209
        },
        {
            "id": "h9jd524",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jpmih",
            "score": 3,
            "text": "Remove them from society - feelings and sympathy mean jack shit if there’s a horrific practical outcome with them being part of the public.  The world isn’t fair - regardless of whether it is their choice, for the greater good they need to be sectioned off.  Frankly if you disagree, I assume you probably are one of them and posting this for some sympathy reason.",
            "title_similarity": "0.7902797",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9j31p4",
            "score": 1,
            "text": "**Note:** Your thread has **not** been removed.\nYour post's topic seems to be fairly common on this subreddit.  Similar posts can be found through our [wiki page](http://www.reddit.com/r/changemyview/wiki/sexualabuse#link) or via the [search function](http://www.reddit.com/r/changemyview/search?q=Pedophil&amp;amp;restrict_sr=on).\n\nRegards, the mods of /r/changemyview.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/changemyview) if you have any questions or concerns.*",
            "title_similarity": "0.390808",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h9ku9ug",
            "score": -1,
            "text": "So they can breed and pass that mutation on to offspring that might act on that? I'd rather see them all gassed, I'm sorry.",
            "title_similarity": "0.6029115",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h9kzt09",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9la96s",
            "score": 1,
            "text": "“Not everyone who sexually assaults children is a pedo” gunna have to disagree with you there champ.",
            "title_similarity": "0.7202212",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9m2xp7",
            "score": 1,
            "text": "If by sympathy you mean chemical castration. Then I 100% agree!",
            "title_similarity": "0.4233863",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h9j9kj3",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9j4or7",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.26965585"
        },
        {
            "id": "h9k3165",
            "score": 2,
            "text": "I notice that a lot of people are mentioning that if a pedophile acts on their desires and harms a child then it is wrong, but that if they do not then they deserve sympathy. But direct action against a child isn’t the only way to act on pedophilic desires. Watching child porn, engaging on pedophile forums, and talking about pedophilia in a way that attempts to normalize it are all actions that contribute to the harm that pedophilia brings. \n\nAnd honestly, it’s likely that even if a pedophile hasn’t directly harmed a child, that they have taken some action to support pedophilia in another way. Being disgusted with yourself doesn’t always stop you from doing things that you shouldn’t, especially if you can lie to yourself that you’re not harming anyone with this  action because it is seemingly distant from “the problem”. \n\nSo while being a pedophile is tragic, sympathy is not the only thing that a pedophile deserves. A lot of suspicion should also come into play. They aren’t babies; they don’t need to be coddled.",
            "title_similarity": "0.8157438",
            "sentiment_compound": -0.5739
        },
        {
            "id": "h9kwaxj",
            "score": 2,
            "text": "Is it worth risking ruining the life of even one child?",
            "title_similarity": "0.6134198",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9j9t27",
            "score": 22,
            "text": "'Pedophile' when used colloquially means 'a person who has molested/sexually abused a child\" and not the psychiatric diagnosis. Note not all colloquial pedophiles are psychiatric pedophiles and vise versa.\n\nWhen people hate on pedos it is mostly against the colloquial definition, although the psychiatric variety get caught up in the crossfire since there is insistence on using this now tarnished label.\n\nPsychiatry is full of labels which have been shed due to misuse by the public. This is another one that should bite the dust (retard, imbecile, cretin were all medically appropriate words which have now been discarded due to better understanding and misuse by the public.)\n\nYou might argue that people shouldn't use the word like this, but that is language for you. Even if the dictionaries do not seem to acknowledge this, the word pedophile is synonymous with \"child f***er\" primarily to most english speakers. The psychiatric definition is a surprise for many people.\n\nI think psychiatry will have to forfeit this one word if they wish to move forward with treating people afflicted with this tendency.",
            "title_similarity": "0.8466805",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h9jo048",
            "score": 3,
            "text": "Some people are born psychopaths and can’t help but have urges to kill. We should still feel bad about those people but still remove them from society… the cost of them acting on their urges is too great.",
            "title_similarity": "0.7868539",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h9j4ldc",
            "score": 244,
            "text": "How effective has gay conversion therapy been? I ask because depression is a temporary state of mind and suicide is an outcome of a lack of coping resources. Therapy is very good at getting you out of your own head and giving you the tools to heal. Sexual conversion is a whole other ballgame psychologically speaking.",
            "title_similarity": "0.75774556",
            "sentiment_compound": -0.4228
        },
        {
            "id": "h9jfx0f",
            "score": 40,
            "text": "I generally agree, but if we say that someone's innate attraction and tendency is the result of a mental disorder, then that will open the door to reevaluate homosexuality as a mental disorder (which it was also considered to be by the DSM until the 1980s).\n\nPlease note, I'm not equating the two on either a moral or legal sense.  All I'm saying is that if we are going to say \"that person's sexuality is disordered, and they either need to somehow change it, or a live a celibate life\" is pretty much the same argument many use against homosexuality.",
            "title_similarity": "0.76662743",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h9jlj1v",
            "score": 0,
            "text": "Having pedophilic thoughts is a mental disorder and should be treated as one. Whether it be viewing online or acting upon it irl is a completely different case and should be severely punishable. Using \"I have a mental disorder\" is not and never should be an acceptable excuses — there is no excuse at all. I agree with your main point here.",
            "title_similarity": "0.8722019",
            "sentiment_compound": -0.7732
        },
        {
            "id": "h9jodl3",
            "score": 0,
            "text": "What are the clear distinctions between those that are for instance psychopaths that act out their \"violent urges\", so to speak? There isn't exactly a treatment for it, and they wouldn't probably favor rehabilitative means when for instance incarcerated. Yet we kinda \"mercilessly\" throw them in jail. When we think of evil, I bet psychopathy would be high on the list. And I am not sure how one would go about asking for help if that were the case either.\n\nThey perhaps trive on manipulation, but regardless there isn't exactly a soft line for those that act out their violent urges. So to really stretch the hypothetical horror scenario, is it considered more morally corrupt to for instance kill or seriously injure a person or sexually abusing a child?    \n\nShould psychopaths be treated differently when they act violent in contrast to those that do not have psychopathic tendencies?",
            "title_similarity": "0.81825656",
            "sentiment_compound": -0.9892
        },
        {
            "id": "h9k1u1c",
            "score": 0,
            "text": "You are wrong and right at the same time",
            "title_similarity": "0.3173769",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9k4dxb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9k6qe5",
            "score": 0,
            "text": "They should not be given nothing but sympathy they should also be handled with extreme caution to keep our children safe first and foremost because we never know when someone will decide to start acting on their desires",
            "title_similarity": "0.73559713",
            "sentiment_compound": 0.2926
        },
        {
            "id": "h9kc2d8",
            "score": 0,
            "text": "Lol once life expectancy of the average human drop to same level it was back in middle ages . We’ll gonna be pedo",
            "title_similarity": "0.49532086",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h9kf865",
            "score": 0,
            "text": "This position is already held by mental health professionals.  Getting the same attitude into the general public would do more harm than good. \n\nThe therapy needed by people with pedophilia is not to normalize their condition as we do with ego-dystonic homosexuality.  It has to be very clear that **all** non-consentual sexual desires are part of an abnormal pathology.   Public acceptance of pedophilic *desires* might help a handful of these people to cope with their self-loathing, but it would entrench many of them in their self-justification.  \n\nFrom experience as a prison-therapist, I'm pretty biased:  most of the pedophiles I've spoken with were guilty of sex crimes.  I haven't talked the ellusive non-criminal pedophiles.",
            "title_similarity": "0.8256676",
            "sentiment_compound": 0.3468
        },
        {
            "id": "h9km4zr",
            "score": 0,
            "text": "Governments/healthcare really should offer euthanization services for anyone who wants to commit suicide. The cruel part is not allowing them to remove themselves in a safe and painless way.",
            "title_similarity": "0.7923944",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9kskiz",
            "score": 0,
            "text": "I am going to start my response by saying that I agree that pedophilia is a mental disorder and people with this disorder need to be addressed in some way. I do not agree that it is anything like being LGBTQ or that they deserve our sympathy, even if they never acted on it.\n\nSexual advances towards a child is sexual abuse. Doesn't matter if it's covert or overt. Abuse is a form violence. It causes trauma and permanent changes in the brain. Assuming there is no unusual circumstances such as power dynamic or any form of abuse, there is no trauma in a homosexual relationship. There is no one being hurt here. Pedophiles are people who are walking around with the urge to hurt children.\n\nIf there was someone walking around with constant fantasies of chopping up bodies, murdering people, etc, and they had to ACTIVELY suppress this urge just not to hurt someone... That when this person finally gets to act on this urge, they finally feel a release. That person would probably be considered a danger to society.\n\nWhy is it different when it comes to sex with children? You are talking about \"morals.\" This isn't about that. This is about shit that permanently destroys people for the rest of their lives. We are talking about people whose natural urges are telling them to be violent towards children, violate them, and destroy them for the rest of their lives. I couldn't care less if they don't act on it.\n\nI don't have sympathy for someone who has constant fantasies about hurting other people.\n\nWhile there is no cure for pedophilia, it's pretty common for pedophiles to have been sexually abused themselves as children. Maybe we should spend more time trying to prevent children from being victims of sexual violence. Maybe we should try to figure out why it's so common and why we aren't doing more about it.\n\nI support putting them into asylum, with intense therapy and counseling, until they prove they can be released into society without hurting anyone.",
            "title_similarity": "0.8934157",
            "sentiment_compound": -0.9952
        },
        {
            "id": "h9kurd5",
            "score": 0,
            "text": "I’ve come to the thinking that prison sentences should match the gravity of crime against another.  Do you have children?  This is one of the worst things that can ever happen to a child.  Worse than hunger or homelessness.  Why are people abandoning their homes and hiding their daughters in Afghanistan? Because that sexual abuse is a worse fate than having a roof over your head.  I suppose I have a much more hard-nosed opinion on this because I have a child and would want to die if she was ever abused.  I don’t think rehab alone is effective for people that get into such a sad depraved mental state.  For example, drug rehab is only effective on a small sliver of the population.  Like only 10% of opiate addicts truely recover and positively contribute to society.  Sometimes you have to reach rock bottom in order to set yourself straight.  A heavy prison sentence may not work for all but could set a person straight.  I think we have to have both approaches, else there is not enough of a deterrent.  Since prop 36 in CA, people go to rehab instead of jail and while I agree they should have a clean record I think sometimes they need the jail to WAKE UP!  Drug addiction is really bad still so it did not necessarily fix the problem, although gave them a chance if they we’re part of the select few that recovered by having a clean record.",
            "title_similarity": "0.81333923",
            "sentiment_compound": -0.8776
        },
        {
            "id": "h9ldw8c",
            "score": 0,
            "text": "It’s a popular myth most ppl who sexually abuse children are exclusively or even primarily interested  in them. People believe similar things about those who practice  animal sexual abuse . This isn’t the case   In fact there’s a lot of similarities personality wise and sometimes cross over between these two groups of people . \n\n(There’s a great kiwi farms about a leaked g chat of animal abusers from the furry community that highlights this . not for the faint of heart though )\n\n Exclusive pedophiles , at least self described ones do  exist but they are a tiny minority of offenders. Most often  It’s not about an “attraction “ or compulsion that won’t go away it’s about wanting to feel a sense of absolute sexual  control and power. \n\nThese individuals tend to exhibit a wide range of  abusive and controlling behavior. If you read extreme incel content  for example the they openly discus wanting child or teen wives specifically because they see adult women as not controllable . Other incels and even  child sexual abusers  in police custody  discuss perusing children simply because adult  men or women  aren’t  interested in their advances or are harder to seduce . Clearly they didn’t feel they had an uncontrollable “natural “ urge they made a conscious choice to more easily achieve their  sexual goals . \n\nExtreme religious communities with similar views as incels on relationships between men and women like certain Mormon splinter sects also advocate pedophilic marriage traditions.  I doubt these sects just happen to have a higher rate of people with a rare problematic sexual “orientation “ then the general population.\n\nPast empires across the world with an extreme sense of hierarchy and rank and a propensity towards sadism also had permissive attitudes towards sexual abuse of children of both genders . Look at how many ultra wealthy people today , a group known for its unusually high levels of narcissistic  and sociopathic tendencies seem to not just repeatedly  get caught  sexually abusing minors but socializing together around this abuse  .\n\nThe idea that the sexual abuse of children is due to an individuals specific distorted “sexual orientation “ like mental illness is actively harmful to both past and potential victims . It leaves the role of culture , which is massive , unexamined in why people offend . \n\nIt makes people not look out for the right people or personality types to be wary around. They might over look as a potential predator for example someone who is also attracted to adults even if they exhibit other troubling qualities. \n\nMost  heinously of all it suggests to victims that  their abuser on some level just couldn’t help themselves .",
            "title_similarity": "0.614607",
            "sentiment_compound": -0.9916
        },
        {
            "id": "h9looaj",
            "score": 0,
            "text": "According to Harvard, there is no cure besides Castration and Death",
            "title_similarity": "0.54407716",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h9lowo0",
            "score": 0,
            "text": "It's a mental illness they should go to the therapist about to keep from going to prison or worse (for their own good) but they'll get none of my sympathy.",
            "title_similarity": "0.79737395",
            "sentiment_compound": -0.697
        },
        {
            "id": "h9lozwh",
            "score": 0,
            "text": "They need help. They should be kept away tho...what if - we could have countries based on  different kind of people instead of just countries...wouldn't everyone be happy?",
            "title_similarity": "0.6092552",
            "sentiment_compound": -0.0767
        },
        {
            "id": "h9lpqfo",
            "score": 0,
            "text": "You can have your opinion, just as everyone else can. But in no way do I consider pedophilia is a mental disorder. These motherfuckers are out here running around saying it's a sexuality and they are part of that Lgb stuff and that love has no number or age. They don't need an excuse for these views of theirs.",
            "title_similarity": "0.7559697",
            "sentiment_compound": -0.0557
        },
        {
            "id": "h9m1jpj",
            "score": 0,
            "text": "I'm not give anyone who wants to fuck kids any thing but my boot up their ass.",
            "title_similarity": "0.64425564",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h9m9uwt",
            "score": 0,
            "text": "Do you think being gay is a mental disorder too?",
            "title_similarity": "0.58572364",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9mixad",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9mn447",
            "score": 0,
            "text": "Pedophiles don't deserve to live.",
            "title_similarity": "0.6586412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mnri5",
            "score": 0,
            "text": "Vilifying those who suffer from this is a simple indicator that you you have a long way to grow as a person.",
            "title_similarity": "0.34317786",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mo9gs",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9mqskw",
            "score": 0,
            "text": "Let me know when you get fiddled, see what you think of it come then. But I really do understand some of your points, it's such a touchy fucking subject. Hard to know what's wrong and what is wrong but can be fixed",
            "title_similarity": "0.61857104",
            "sentiment_compound": -0.8838
        },
        {
            "id": "h9mrjrs",
            "score": 0,
            "text": "There's a movement among paedophiles (and trolls) to equate homosexuality and paedophilia and unfortunately I think the reaction to that has been misguided.\n\nI think we should see Paedophilia in a similar light in one sense - I don't think they have a choice. I don't think they choose to be attracted to children one day, and I don't think they can just stop either. So from that perspective I would absolutely support a more empathetic approach to it. The key thing is obviously that we do not change our approach to offenders, but we should change our approach to non offending paedophiles.",
            "title_similarity": "0.8213744",
            "sentiment_compound": -0.5584
        },
        {
            "id": "h9mw7mw",
            "score": 0,
            "text": "You mention it yourself, there is no cure. Even though it is popular to say that all human life has equal i believe that is a bullshit hypocrite statement. \nA pedophile is worth less than a maggot and children are worth more than any adult. So to protect just one child would be worth executing all pedophiles.\n\nSince it is also a well known fact that pedophiles create new pedophiles, i.e. the abused become an abuser, the best way to lessen the vicious cycle would be to eradicate everyone with the symptoms.\n\nAnd no, I'm not talking about a 16 year old having sex with a 14 year old.",
            "title_similarity": "0.84756565",
            "sentiment_compound": 0.3353
        },
        {
            "id": "h9mxibz",
            "score": 0,
            "text": "As somebody who’s life has been impacted too many times by pedophilia, I share this opinion fully. It’s is wrong, and should be treated as a mental illness. It’s no ones fault who or what they are attracted to, therefore, rehabilitation needs to be available to manage and treat those with pedophilic preferences. My ex boyfriends dad was busted for child porn. But what if he never touched somebody? It’s still wrong that his desire for child porn overwhelms him to the point he downloads it onto his computer, but what if impulse control could be managed? What if he never touched a child inappropriately? People like him deserve to live peacefully if they can help themselves. I was molested as a child by my neighbor. I have done a lot of introspection and what it comes down to is that I sympathize for these people. It sucks to be a victim of this disturbing compulsion, but I imagine there’s something wrong with the people who entertain such a fantasy, and I wish there was help available to them. Just looking for a more compassionate society is all.",
            "title_similarity": "0.8374697",
            "sentiment_compound": 0.7862
        },
        {
            "id": "h9k5hop",
            "score": 45,
            "text": "You don’t have accurate information. \n\nFirst, to be considered as a pedophile or a person with Pedophilic Disorder, a person must have already acted on their urges (ETA: or have distressing difficulty with thoughts with the absence of guilt, shame, or anxiety related to the attraction) and this is in accordance to DSM-5. Those who have attraction to minors and generally abide by society’s rules against the action of urges are called *Minor Attracted Persons*. I recommend checking your data as well, because 9/10 times, any information regarding this matter have to do with pedophiles so any data that you may have is addressing an entirely different population of people. Those willing to act upon urges (ETA: or lack shame, guilt, and anxiety) are on an entirely opposing spectrum, especially since pedophiles have a high prevalence of having antisocial disorder and lack empathy- which a person who refrains for the safety of children, does not lack.   \n\nI agree overall in the humanization of minor attracted persons and resources and research crucially needed in order to have a better future for children, as well as people who have to live w continual urges that would harm others. Currently, the medical community is biased and does not want to work w these individuals, care is not accessible and there are huge concerns that these patients will be reported to police if they disclose their thoughts. The medical community is also still arguing if this condition is immutable, since most minor attracted persons refer to their attraction as a sexual orientation and this is generally considered immutable. General studies show that if a person believes they can change, they are more likely to go to therapy so we still need to get on the same page about all this. There is no way to start to fix anything if the general public is uneducated about the topic and lack to understand it’s for the safety and well being of everyone, including children.\n\nEDIT TO CORRECT PREVIOUS STATEMENT: a person can be diagnosed with Pedophilic Sexual Interest if they have not acted upon urges, as long as they have no guilt, shame, or anxiety associated with their attraction.",
            "title_similarity": "0.8143941",
            "sentiment_compound": 0.836
        },
        {
            "id": "h9j4k9l",
            "score": 1376,
            "text": "i agree with a lot of your points, the problem i see is that if someone was to assault a child then they would use the excuse of \"its a mental conditon\" as a way to justify it rather than being what it is.",
            "title_similarity": "0.76467675",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9jbfbi",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jf4zm",
            "score": 1,
            "text": "I agree with your general idea, but would challenge you on a few parts.\n\nFirst, how would you distinguish defining pedophilia as a mental disorder with defining people with other criminal inclinations as a mental disorder? You can classify basically any Inclination that is contrary to general society as a disorder. \n\n>should be given nothing but sympathy\n\nExpanding on the prior point, I don't see why - at a general level- someone should be given sympathy because they do not act on some criminal inclinations they have. I am not going to be extra sympathetic for someone who experiences a great deal of homicidal ideation. I am not going to blame them, it is their fault they are mentally sick, but I am not going to be more sympathetic to them than to anyone else - indeed I am going to be more concerned, depending on the specifics, for the people they may endanger. I don't think going around arresting people for homicidal ideation is a good idea and would advocate - instead - for them to recieve medical aid and for pedophiles to be treated the same way.",
            "title_similarity": "0.8565862",
            "sentiment_compound": -0.5678
        },
        {
            "id": "h9jogwb",
            "score": -1,
            "text": "The LGBTQ community could never agree to pedophillia as a mental disorder lest they destroy their very own arguments about their lifestyle.",
            "title_similarity": "0.76429534",
            "sentiment_compound": -0.8831
        },
        {
            "id": "h9jolco",
            "score": 1,
            "text": "So what I'm getting is:\n\nPedo behavior before you assault children = Metnal heath treament and meds\n\nPedo behavior after you assault children: Forceful rehabilitation",
            "title_similarity": "0.6286339",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h9jpda0",
            "score": 1,
            "text": "I agree with the majority of your points. However, is this not how society already deals with pedophilia? You cannot be locked up for being attracted to children as far as I know, and people can seek help for having pedophilic urges. \n\nHowever, I think we should be careful showing sympathy towards pedophiles. Sympathy has many definitions… Should we show sympathy towards people that have the urge to murder people? I think that depends on how we define sympathy.",
            "title_similarity": "0.85003865",
            "sentiment_compound": 0.9054
        },
        {
            "id": "h9jyss2",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9k5zrr",
            "score": 1,
            "text": "Hunt your local pedophile",
            "title_similarity": "0.4606502",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9k7h6u",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9khkc6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9kihyb",
            "score": 1,
            "text": "I have the exact same opinion. I assume everyone has fetishes or kinks they might really want. But I assume this is more like being gay but you can't do it so you marry and sleep with a woman. Okay I have no clue how either is but I ASSUME it's not satisfying, though I can be very wrong. Not acting upon that has my full sympathy. It's not your fault for having that on your mind, but it's your fight against it. Same for rape and whatever harmful things exist.",
            "title_similarity": "0.79111487",
            "sentiment_compound": -0.8775
        },
        {
            "id": "h9kjcge",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9kkzbs",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9kmgqn",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9kqszw",
            "score": 1,
            "text": "There isn't any cure for pedos, so no.",
            "title_similarity": "0.50720704",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kr13q",
            "score": 1,
            "text": "Boo. It might be a disorder but I'm not sympathetic. Babies and children are not sex objects and if you say \"they can't help it\" you are justifying it. If they enter therapy their doctors shouldn't have them arrested unless they are abusers but it is not something to normalize.",
            "title_similarity": "0.7995989",
            "sentiment_compound": -0.8708
        },
        {
            "id": "h9krcgt",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9kw8t4",
            "score": 1,
            "text": "I agree especially since most pedophiles were molested and traumatized themselves however once they act on it it’s game over, no more sympathy. To say otherwise would be like saying raping women is fine because men’s brains can’t help but be attracted to them.",
            "title_similarity": "0.73789126",
            "sentiment_compound": 0.0815
        },
        {
            "id": "h9kzj59",
            "score": 1,
            "text": "It has begun.... ..",
            "title_similarity": "-0.056621768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l0eth",
            "score": 1,
            "text": "Just because it is classified in the DSM it doesn’t excuse it. \nIt’s called self control. I don’t agree with the sympathy part. Stay away for my kids and everyone else’s kids. \nPsychopathy is in the DSM and they aren’t getting my sympathy either, same with necrophiliacs , get away from my dead mother.  \nYour argument is flawed",
            "title_similarity": "0.86944133",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9l0lvv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9l163d",
            "score": 1,
            "text": "Behavior is influenced, to some extent, by social forces like stigma. If we reduce the stigma of such a pathology we lose an effective tool.",
            "title_similarity": "0.6480082",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9l2bg8",
            "score": 1,
            "text": "Sexual preference is not a \"mental disorder\". Pedophilia just happens to be a sexual preference that the vast majority of society thinks is immoral. \nWith that in mind, no it is not okay for pedophiles to sexually express their true selves if they want to participate in society. As other people have said, if you treat it as some sort of disease it implies some lack of control. You don't get to choose what sexually attracts you but you do get to choose whether to act on it.\n\nMaybe your kink is rape. Sorry, find a different kink.",
            "title_similarity": "0.827138",
            "sentiment_compound": -0.8022
        },
        {
            "id": "h9l42f5",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.26965585"
        },
        {
            "id": "h9l6xdp",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9la8ki",
            "score": 1,
            "text": "Cool until it’s my kid the pervert touches",
            "title_similarity": "0.4742772",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9lfxzq",
            "score": 1,
            "text": "This was going great until the LGBT comment. There's already so much discrimination and fearmongering that LGBT = pedophiles so it's just...not a well thought out comparison that came out there.\n\nI get and agree with where it's coming from, the point that it just is and cannot be changed, but geez it made me physically cringe. I can hear an old woman in the back of my mind going \"if we can fix the pedophiles with therapy...we can fix the gays and keep those child predator tr****** out of ladies rooms!\"",
            "title_similarity": "0.7820456",
            "sentiment_compound": 0.63
        },
        {
            "id": "h9li2n4",
            "score": 1,
            "text": "Pedophilia is best treated with a 9mm right behind the ear.  You don't feel sorry for those who's natural inclination is to take advantage of the innocent.",
            "title_similarity": "0.75736535",
            "sentiment_compound": 0.884
        },
        {
            "id": "h9ljesm",
            "score": 1,
            "text": "People that are attracted to children should be chemically castrated at the very least, or just put down like the animals they are. There is no place in the world for people like that.",
            "title_similarity": "0.7577863",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9lk9b1",
            "score": 1,
            "text": "Is it’s genetic I don’t see why we need their pedophilic genes procreating.",
            "title_similarity": "0.48714355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lm8g6",
            "score": 1,
            "text": "Most if not all will/have hurt kids. Mentally and physically. I've spent 6 years with these monsters. It's how there brain is wired. It's not something they can change and not really there fault. That being said if I personally felt this way I'd like to think I would take my own life. Anyway, if you hurt kids in this way a bullet is the best thing for you.",
            "title_similarity": "0.69948614",
            "sentiment_compound": 0.8196
        },
        {
            "id": "h9ln9en",
            "score": 1,
            "text": "Nope. Pedophiles are subhumans that don’t deserve to be apart of society. They must be eradicated and never tolerated.",
            "title_similarity": "0.74539274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lo38w",
            "score": 1,
            "text": "As a victim of pedophilia, I say… fuck that. Pedos who have touched kids need to be in prison for ever",
            "title_similarity": "0.5981803",
            "sentiment_compound": -0.836
        },
        {
            "id": "h9lro12",
            "score": 1,
            "text": "Do unto others as you'd have done to you. If I touched a child inappropriately I'd expect a thorough beat down. Having known of 2 such sickos I have zero sympathy.",
            "title_similarity": "0.80431503",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9ltew0",
            "score": -1,
            "text": "Must be a qtard",
            "title_similarity": "0.11230678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9luiau",
            "score": -1,
            "text": "You're gross..",
            "title_similarity": "0.36883035",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9lwrmh",
            "score": -1,
            "text": "This is how you make pedophilia legal. \n\nSmall increments like this will slowly just turn it into a taboo sexual preference. \n\nFuck off with all this shit.",
            "title_similarity": "0.7855197",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h9lxc5k",
            "score": 1,
            "text": "Yep a mental disorder treated with castration",
            "title_similarity": "0.55291724",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9m2ely",
            "score": 1,
            "text": "There’s evidence that pedophiles and psychopathic sexual sadists are immune to therapy and cannot be cured. All pedophiles should be institutionalized foe life.",
            "title_similarity": "0.85228705",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9m3jv2",
            "score": 1,
            "text": "It's fucking gross if you don't protect kids what is the point of anything. Idc if it's a disorder or what they should hang by the neck till the feet stop kicking",
            "title_similarity": "0.7627758",
            "sentiment_compound": -0.8583
        },
        {
            "id": "h9m4kzd",
            "score": 1,
            "text": "Nah I say just throw the whole person away. If your a pedophile, serial killer, etc, etc. if your mental state causes you to harm others, then just delete. Erase that human and move on.",
            "title_similarity": "0.71603453",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h9m97nj",
            "score": 1,
            "text": "Let em burn. Murders and people that abuse women and children are broken. Just like cars and everything else that is made some have recalls because they are broken. Somethings cannot be fixed and need to be taken care of in a different way. This type of thought process is usually from someone with out kids and thinks that all people can change. Not everyone can or wants to change.",
            "title_similarity": "0.72238016",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h9m9uuw",
            "score": 1,
            "text": "Fuck off if your sexually satisfied with a child your a piece of shit end of story. Put them in general pop with a fucking bullseye is how you handle these scumnags",
            "title_similarity": "0.69504106",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9m9xi1",
            "score": 1,
            "text": "Not disagreeing with you OP at all, but I just wanna comment how eerily similar this sounds to the rhetoric around homosexuality way back when. I'm not making any conclusions, nor do I wanna make any extrapolations. Just an interesting observation",
            "title_similarity": "0.6131699",
            "sentiment_compound": 0.6209
        },
        {
            "id": "h9mcrsc",
            "score": 1,
            "text": "I welcome you to get off your intellectual high horse and get real. \nGo and volunteer in an NGO or facility for victims. Go and watch interviews of victims. Speak to them. Sit in the same room with them. \n\nTalk to the parents of victims. Watch the videos in some legal way if you can. Look at their faces. Talk to the authorities who clean up this shit. \n\nAll this intellectual garbage reasoning is some madturbatory exercise that's for your gratification. \n\nGet real. Get in the physical experience of it. Let it be an actual thing that happened to a loved one. Then let me know how you feel or think. \n\nOne of the horrors of reddit is how typically men have some lovely ideas of how life should work when they are not even in the space of the things they comment about. \n\nThere's nothing like being on ground zero. Be there and talk.",
            "title_similarity": "0.5704435",
            "sentiment_compound": 0.8312
        },
        {
            "id": "h9mde2x",
            "score": 1,
            "text": "Shoot all pedos",
            "title_similarity": "0.29496866",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9mhx95",
            "score": 1,
            "text": "Nah pedo’s should get the electric chair. There is no dancing around this. They ruined a child life forever.",
            "title_similarity": "0.69075465",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h9mizc5",
            "score": 1,
            "text": "Don’t touch kids. \nDon’t facilitate kid touchers. \nRocket science?",
            "title_similarity": "0.48466384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mmit7",
            "score": 1,
            "text": "Nope. \n\nAs the victim of child sexual abuse, no. Fuck that. They know what they are doing. They enjoy doing it and they want to keep doing it. Why are they more deserving of understanding? \n\nThere aren’t enough years in a life to fix what these predators broke, so no. Fuck that.",
            "title_similarity": "0.76169384",
            "sentiment_compound": -0.8739
        },
        {
            "id": "h9mq6hd",
            "score": 1,
            "text": "Death is the only justifiable punishment for people who diddle kids. Freak.",
            "title_similarity": "0.6971948",
            "sentiment_compound": -0.875
        },
        {
            "id": "h9mqa77",
            "score": 1,
            "text": "Nope you're literally defending pedophiles you disgusting excuse for a human.",
            "title_similarity": "0.6752585",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9mquzd",
            "score": 1,
            "text": "There’s a cure for pedophilia. It’s called a bullet. It’s unacceptable, the second they try to lay their hands on a kid they should be killed. They have the leeway of not looking at or touching a kid. That’s all the support they get from me. They break this then they are no longer humans but monsters.",
            "title_similarity": "0.80817807",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mwfdk",
            "score": 1,
            "text": "I'm still surprised why it's not considered a color in the Rainbow flag.",
            "title_similarity": "0.38756773",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9jbfmf",
            "score": -2,
            "text": "> with sympathy and understanding, then their path to rehabilitation becomes much more clear.\n\nby your own admission, \"those feelings are never going to go away\", that it is a mental disorder, likely a genetic disorder at the root of the mental disorder. \n\n\"rehabilitation\" is a term used for people who have been disabled by an injury or disease and can be brought back to a state of health. this term does not apply to people who are sexually attracted to the prepubescent.\n\nthe social rejection of pedophiles is what causes those people to be disgusted with themselves. it is possible that self-disgust is all that is preventing some of the pedophiles from offending.\n\ndespite our questionable history with eugenics, i know that eugenics (or possibly gene therapy in the not-so-distant future), is the fastest answer to some problems like these. any person caught sexually offending without any question of guilt, should be at least sterilized if not fixed (as in fixing a dog) or disabled in some other way that physically prevents them from reoffending. then also do the same to their immediate genetic relitives. the prevalence of this behavior within the gene pool would quickly be diminished in two generations to a level that would be of little concern going forward. even if it were learned behavior, or cultural, the results would be the same.\n\nthe same could be done for other disorders like schizophrenia, and sociopathy to clean up our gene pool for the benefit of future generations. \n\nwhile it is true that messing with the gene pool and an individual's genetics comes with its own set of negative consequences (designer babies, narrowing the gene pool, severe genetic mishaps) in some cases the results are worth the risk. as we identify the genes responsible for these disorders we will be able to be more specific and humane with which people are altered and how they are altered.",
            "title_similarity": "0.8610125",
            "sentiment_compound": -0.8914
        },
        {
            "id": "h9jgssi",
            "score": 2,
            "text": "Society has just recently become accepting of homosexuality as being something one is born with.  Transgender is still a gray area.   It will be a long time for society to accept pedophilia as a mental health illness.  Personally, I feel each is something that one is just born with.",
            "title_similarity": "0.6103429",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9jnaax",
            "score": 2,
            "text": "Ooh this is a topic I've been thinking about for a while, tho I'm not nearly as educated as you about it, hopefully there will be arguments that's not just \"it's simply disgusting and you're disgusting too for feeling bad for them\"",
            "title_similarity": "0.6264831",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h9kmd9b",
            "score": 2,
            "text": "The attraction is just unfortunate, but so long as they don't act on it, whatever. Same with rape fantasies. But the moment they act on it, it's not just a mental disorder, it's a god damn crime and they need jail and/or rehabilitation. As for presentative measures, hell if I know. But I see it similar to people with rape fantasies. It's a horrible thing, but it's not like they chose to be into it. So long as they don't do anything, it's fine. The key difference I see is that if they watch porn, while rape can be faked for video, a child is an actual child and watching that is supporting something absolutely horrible. The other difference being that for some god damn reason pedophilia is acceptable in some areas. They're CHILDREN they can't consent...",
            "title_similarity": "0.8446775",
            "sentiment_compound": -0.9938
        },
        {
            "id": "h9kpwda",
            "score": 2,
            "text": "Naw. Pedophilia is a bug in the software. Sometimes it’s easier to throw out the entire thing than it is to work out the bugs. I’m totally cool with castrating anyone who molests a child. If there is kidnapping involved, that’s not a bug, that’s a lack of empathy, I’m good with the chair. \n\nIs this “the moral high ground” no. Do I care? No. Do I feel like pedos deserve better? No. I understand the concept of therapy, but as of right now, we don’t even give therapy to the victims of these pedos. If, we as a society have systems in place to help those with other mental issues, sure we can talk about therapy for pedos, but as of right now? I cant bring myself to spare these people. \n\nHalf of our society thinks homosexuality is a choice. And homosexuals are choosing to “be evil” We can’t even start talking about “helping Pedos” until our society views on homosexuality change. I think you’re a generation too early on this.",
            "title_similarity": "0.7982398",
            "sentiment_compound": 0.8532
        },
        {
            "id": "h9kznyj",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9kjzjv",
            "score": -3,
            "text": "I like the idea just want to modify it a bit. How bout we are actuallypretending to want to help them only to so we can round them all up and lock them away or just kill them. These people are all mosters offending or non its like saying you can rehabilitate a serial killer they take pleasure in taking away and harming their victims they lust over the youth and innocence of children. Fuck them and fuck anyone will to defend and protect them. People who think like this literally disgust me.",
            "title_similarity": "0.75637704",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h9jsfj4",
            "score": 4,
            "text": "I wouldn't quite say nothing but sympathy for those that don't act on their impulse. I would argue sympathy with a healthy dose of respect similar to the respect one would have for a wild animal like a brown bear or Shark. They always have the potential to commit the crime and absolute sympathy can blind you to that aspect in some sense. Though I would also add the circle jerk about throwing pedophiles into woodchippers and some such nonsense is really tiring. Expressing the fact you don't like pedophiles to that extent doesn't make you special or really any more moral. Spend your energy towards doing something about the problem that actually prevents it instead talking about it.",
            "title_similarity": "0.79057115",
            "sentiment_compound": -0.3219
        },
        {
            "id": "h9juglk",
            "score": 5,
            "text": "I remember watching something years ago where a teen who was having desires to molest this brother attempted to seek help and had the police called on him. He had done nothing so there was nothing they could do but keep him in record. Ultimately he committed suicide because he viewed himself as a monster. He himself had been molested when he had been much younger.\n\nNo idea if the story was true but it struck me as such a sad situation where there is no help for people with the compulsions if they want it.\n\nAvailable treatment wouldn’t give the excuse of it being a ‘insanity’ defence, which requires you to not know right from wrong, nor would it be similar to gay conversion ‘treatment’.  It could be a place to help the person cope with something they are struggling with, a place where those who were offended against got the support they likely never got in the first place which could lead them away from the compulsion.\n\nYes there are many who treatment could never help but then they wouldn’t see it in the first place. But it could help those who would seek help and desperately need it.\n\nI seem to recall from the show them also speaking to someone who was part of an online group who had the desires but didn’t want to act in them who supported one another much in the way AA mentoring works. Though how they connected concerns me.",
            "title_similarity": "0.7630533",
            "sentiment_compound": -0.8827
        },
        {
            "id": "h9jjwt7",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jrn6d",
            "score": 5,
            "text": "I agree. I find that we should treat most crimes with more rehabilitation than punishment. If you look at Norway, they are doing something very similar. Before they reformed prisons, 60% of the offenders were back in prison at some time. When they reformed prisons, the re-offender rate dropped from 60% to 20%.  \n\n\n[Source](https://norwaytoday.info/culture/what-are-prisons-in-norway-like-really/)",
            "title_similarity": "0.5251101",
            "sentiment_compound": -0.6204
        },
        {
            "id": "h9jif4e",
            "score": 99,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jmjwz",
            "score": 12,
            "text": "/u/onelazysock (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/p7hc3y/deltas_awarded_in_cmv_pedophilia_should_be/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.3851518",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9jplux",
            "score": 13,
            "text": "I agree with a lot of your points.\n\nThere are more people than anyone knows who struggle with thoughts like this - what we see in the news are the depraved criminals. The ones who exploit children, the rapists, the assaults, and yeah, I don't have sympathy for them. They had a choice. They chose to break the law and ruin a person's childhood and adult life (TW for CSA but I was a victim myself) , ruin a family, do one of the most morally depraved things I can think of. \n\nPeople who struggle with thoughts (I'm talking about the DSM-5 criteria for the specific mental disorder, as well as other mental illnesses - a lot of people know nothing about OCD, for example, which can cause intrusive, inappropriate thoughts from everything to \"what would happen if I stepped out in front of the next car that passes me\", \"what if I took this spoon of dog food I'm holding and just ate it\", to every time you're trying to get yourself off, your brain spirals into inappropriate imaging. This is common in survivors of childhood abuse or people who witnessed something traumatic who then develop OCD or PTSD) are not seen and don't get the help they need because they don't know what will happen if they tell a doctor what goes on in their heads. A lot of people cannot control it. They will never act on it. A lot of people self harm, make attempts on their own lives, turn to drugs, etc. Because who can you tell? Who will understand? How can you rationalise that a medical professional will not judge you as a non-offending, mentally unwell person? Especially if you don't have the knowledge of how your condition works, if you don't have a pre-existing diagnosis, etc.\n\nI'm not naïve, though, I know there are offending people who would use \"it's a mental disorder\" once in court or something and that's all you'll see in the newspapers and then the stigma grows and there will never be a distinction.\n\nI also know there are people who probably have pedophilic thoughts, desires, attractions, whatever they would call it, and maybe it has nothing to do with being a co-morbidity of OCD or PTSD. Maybe it's just seriously an attraction. Maybe it's not, but the person doesn't realise it as a mental illness?\n\nI don't know. It's something I'd like to research more, for sure. In my head I know there's an innate difference between someone who wants to commit a crime and does, and someone who thinks about doing something which is illegal, and doesn't do it, because they know it's wrong and they don't want to inflict that damage, and then go on to loathe themselves for thinking that. I just don't know what it is about someone's brain, someone's upbringing, someone's makeup that decides whether they would do that, especially in a situation as extreme as CSA. Plus, there are probably so many people in the grey, that think they'd never do it, but then consume CP and don't realise that they're still breaking the law, still exploiting children, still bearing witness to the horror that had to happen for that content to exist. The type of person who would facilitate that content being available. And I imagine the % of people who spiral from the grey zone is a lot higher than the moral white zone.\n\nAgain, just food for thought. And yes, people definitely need support to stop them becoming abusers, especially if there are any indicators in their behaviour patterns, AND they need support to live a normal life if it causes them distress even though they are 99.9% unlikely to ever offend or even look at an image. I think I read something about a guy before that had thoughts, fleeting ones as far as I can recall, that seemed to hinge on morbid curiosity, but was clearly more than that since he started to spiral and get addicted to seeking it out. I can assume there are members of that \"community\" that suffer from a pure addiction to that side of things, but the slope seems really slippery from there.\n\nIf anyone reading this is struggling with scary thoughts regarding this topic, please, please try find a mental health professional in your area. They are trained to be non-judgemental. Medical confidentiality means that anything pertaining to your medical records are between you and your psychiatrist, so as a non-offending, genuinely scared/upset/depressed/anxious person with thoughts that exacerbate these feelings, you will be okay. There are treatments, you can get CBT, you can get medicated for depression and anxiety and it IS possible that these things will alleviate your symptoms. My best friend suffers from severe OCD and their medication has changed their life, it has drastically reduced terror dreams and intrusive thoughts about finding their whole family murdered, or very intense body horror thoughts, that kind of thing.",
            "title_similarity": "0.6873854",
            "sentiment_compound": -0.9984
        },
        {
            "id": "h9lnzth",
            "score": 14,
            "text": "A couple points.\n\nOne, I've had multiple friends confess to being attracted to minors. These people would absolutely never rape a child, but they were extremely suicidal because of it. They are good people. The majority of pedophiles, albeit from anecdotal evidence, are terrified that they will harm a child and would shoot themselves \"before they act\". This kind of thinking, among good people with an unwanted attraction, makes them a far, far bigger danger to themselves than others.\n\nTwo. I guarantee a massive number of self-professed pedophiles are just obsessive compulsive. Look up POCD. These people are actually the most trustable with children, as their thoughts are specifically because they fear hurting children. This condition affects people who are appropriately loving and caring to children of all ages, those who specifically care about the wellbeing of children as one of their main concerns.\n\nBoth of these populations are in extreme amounts of pain due to thoughts they cannot control. I sometimes even wonder if the lines between \"actual\" people attracted to minors and POCD is blurry. The closest thing to positive rhetoric they get is \"they need help before they act.\" It is completely erroneous to assume that because someone is attracted to someone else that they are a ticking time bomb for raping them. It's almost impossible to find studies on this, but in my own research I have found that it's likely above 90% (if not more like 95-97%) of people attracted to minors never once act on it.\n\nThe online consensus of \"skin them alive and set them on fire\" (and related sentiments) is absolutely a form of horrific abuse against people who have done nothing wrong, including people with obsessive compulsive disorder (which is likely caused by the cultural moral outrage). The hatred is always absurd, biased, and completely ill-informed, relying on cultural norms of punition-focused morality rather than on any sort of research or knowledge on the subject. My friends with either of these conditions live miserable lives, hating themselves because of an apparent unanimous online consensus that they deserve to be shot dead.\n\nMinor attraction is not be something that should be acted on—but the vast majority of people with that attraction are not in any way a danger to children in their life, and will never act on them, with or without therapy. Non-offenders attracted to minors are absolutely a minority, and deserve the same amount of love and respect as any other human. The treatment for these people absolutely should not focus on \"preventing\" them from acting—a shame-focused tactic which reinforces the false idea that one has to put significant effort into not doing what they obviously are not going to do—but, for the most part, helping them realize that their own empathy is sufficient for them to not rape people, which I would argue is the case for an overwhelming majority of these people.",
            "title_similarity": "0.77677476",
            "sentiment_compound": -0.9798
        },
        {
            "id": "h9jbrvq",
            "score": 299,
            "text": ">I want to close this out by clarify not everyone who sexual assaults children is a pedophile, just as not all pedophiles assault children. There’s definitely some overlap, but I’m not going to act as though reaching a hand out to pedophiles would eliminate this type of assault.\n\nI agree with you in most parts, but just to challenge or shift your perspective a bit: Keep in mind that the vast majority of cases of sexual child abuse are conducted by people who are (medically speaking) not considered to be pedophiles. So if you want to help children, focusing on \"actual pedophiles\" will do only a small part.\n\nI was working voluntarily for some youth organisation and we had some seminars to improve our work. There was one about child abuse: Like how to spot signs, who to call, how to help a child, how to approach this if you suspect someone might have done something, and so on. You get the idea.\n\nAnd one thing they told us was that of all sexual abuses of children (in Germany) it is estimated that over 90% of cases are technically not pedophiles, but people with disorderly insecurities/obsessions who seek validation they do not get from adults and start abusing children (also sexually) to feel powerful and validated, and apparently not really because they are \"sexually attracted\". Honestly, this is all pretty sick, but a different kind of sick than actual pedophilia it seems.",
            "title_similarity": "0.83709276",
            "sentiment_compound": 0.501
        },
        {
            "id": "h9jlpsz",
            "score": 597,
            "text": "Small amendment to your last paragraph. What you are calling pedophiles are sometimes called 'obligate' pedophiles, people who are exclusively attracted to minors. But many others are attracted to both minors and adults and choose to sexually abuse children because they are vulnerable.",
            "title_similarity": "0.7196095",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h9ja1jl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jlzye",
            "score": 35,
            "text": "It is my belief that if a pedophile could safely go to a doctor and express what they were dealing with, BEFORE they ever harmed a child we could help a lot of kids not be harmed. Probably hundreds of thousands of kids not be harmed. Annually.",
            "title_similarity": "0.59624016",
            "sentiment_compound": 0.785
        },
        {
            "id": "h9jn7ra",
            "score": 3,
            "text": "I listened to a podcast called Hunting Warhead about the infiltration of a child sex abuse video ring. The theory posited by one expert was that pedophilia is a sexual orientation toward children rather than mental disorder. What makes it abuse and a crime is the vulnerability of children and their inability to consent. I found that view interesting and unexpected.",
            "title_similarity": "0.74737966",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h9jpf9r",
            "score": 2,
            "text": "Also there is research that found out that pedophilia is from nature not nurture, meaning they were born with it.",
            "title_similarity": "0.7037749",
            "sentiment_compound": -0.2584
        },
        {
            "id": "h9js2lq",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jsto7",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9jvkkw",
            "score": 2,
            "text": "Acting on it is completely different.\n\nA dude with anger management issues gets my sympathy and should seek whatever help is nessecary for them to deal with those issues.\n\nA dude with anger management issues that bashes a dudes skull in with a hammer needs to be locked away from society for a long, long time.",
            "title_similarity": "0.7184349",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9jvr6o",
            "score": 1,
            "text": "So bassically treat it like alcoholism. It's fine to be someone who can't resist alcohol, but regardless of your disease, getting in a car and driving is still illegal?",
            "title_similarity": "0.72841895",
            "sentiment_compound": -0.4139
        },
        {
            "id": "h9jvzh1",
            "score": 1,
            "text": "People struggle with urges of different calibers all the time and know they are wrong and do not do them because they understand the consequences.   Though it may be some sort of disorder, they all know it's wrong and that's why they do not do it.   I would agree that if someone has pedo urges and gets help and doesn't act on them, that obviously is a good thing, but sympathy or praise is a bit much.",
            "title_similarity": "0.78239673",
            "sentiment_compound": 0.7878
        },
        {
            "id": "h9jx10f",
            "score": 1,
            "text": "I agree, people with all sorts of dangerous or immoral compulsions should be able to seek qualified help to improve their situation. That is helpful for the individual and society.\n\nOnce you sexually abuse a child though, it’s game over.",
            "title_similarity": "0.73918855",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9jy41t",
            "score": 1,
            "text": "I don't really have an answer but it's important to note that the OCD community also has a subset of pedophilia. It's very distressing and many self harm because of it. It follows along with intrusive thoughts. Many don't seek therapy for fear of being turned in/pit on a registry etc.",
            "title_similarity": "0.74204576",
            "sentiment_compound": -0.9159
        },
        {
            "id": "h9jzetf",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.26965585"
        },
        {
            "id": "h9k3pl0",
            "score": 1,
            "text": "Fair enough, but if they continue to offend they get chemically castrated, and if they continue after that either life in prison or the death penalty.",
            "title_similarity": "0.6319033",
            "sentiment_compound": -0.9513
        },
        {
            "id": "h9k5uih",
            "score": 1,
            "text": "just a thought. Would a \"treated\" pedophile be given access to children that untreated would not?  Like considered less a threat than non treated for job hiring?\n\nI think that would be a terrible effect.",
            "title_similarity": "0.7865194",
            "sentiment_compound": -0.8267
        },
        {
            "id": "h9k901v",
            "score": 1,
            "text": "dude i am not even kidding, but i was high today morning and i thought exactly this. you exactly put it in the right words.",
            "title_similarity": "0.22021315",
            "sentiment_compound": -0.0382
        },
        {
            "id": "h9k9h4v",
            "score": 2,
            "text": "I agree with you, and interestingly many pedophiles feel that their attraction has been encouraged by society's sexualization of young children. I listened to a really fascinating podcast discussing treatment of pedophiles: https://open.spotify.com/episode/5bHJ5Uo6hN9olH9O0QACrZ?si=ecb549ce1c4d4bbc (\"Forensic Pedophilia with Dr. Cummings\" by Psychiatry & Psychotherapy Podcast)",
            "title_similarity": "0.6042768",
            "sentiment_compound": 0.9259
        },
        {
            "id": "h9kb81b",
            "score": 2,
            "text": "I mostly agree that helping people before they harm children should reduce the number of children being harmed.\n\nBut for a CMV, do we have data from the US backing this up?  It seems like a reasonable assumption, but as far as I know due to US law and culture, there hasn't been any indepth studies.\n\nPerhaps before changing the culture's viewpoints, we should have a pilot project in a limited area and see what the results are.",
            "title_similarity": "0.7608329",
            "sentiment_compound": 0.0644
        },
        {
            "id": "h9kgjsv",
            "score": 1,
            "text": "But the thing is, it can hardly be treated and can't be cured. And I wish people wouldn't compare it to gay conversion therapy. There is a difference between 'attraction' to any entity that can't consent and attraction to those that can.",
            "title_similarity": "0.75207675",
            "sentiment_compound": 0.5157
        },
        {
            "id": "h9khofw",
            "score": 1,
            "text": "So is other sexual preferences a medical problem same with gender dysphoria",
            "title_similarity": "0.5413052",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9ki4i1",
            "score": 2,
            "text": "Wow! I actually agree with this.",
            "title_similarity": "0.09365666",
            "sentiment_compound": 0.7644
        },
        {
            "id": "h9kj7q5",
            "score": 1,
            "text": "Sympathy =/= treatment. Those people would need treatment.\n\nNote, I assume you're talking about grown a#$ adults being attracted to prepubescent children, not 19yrold dude bros sending taunting emails to their friend about his 17yrold sister or thirsty 45yrold women joking on Facebook about what they'd do with the 17yrold neighborhood yard boy.",
            "title_similarity": "0.61439526",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h9kjxvr",
            "score": 1,
            "text": "Technically speaking all crimes when seen from a point of understanding the why behind the perpetrators' shortcoming. And ideally speaking, reforming is far better than if they were to be hurt/punished/killed.\n\nBut justice is also about asserting confidence in the masses that they are safe. This is thing is taken seriously because people fear the safety of their children. If the government gave them sympathy it wouldn't deter many and people would be concerned for the safety of their children all the more.",
            "title_similarity": "0.7561172",
            "sentiment_compound": 0.9664
        },
        {
            "id": "h9kk9th",
            "score": 3,
            "text": "The scientist James Cantor has investigated this. Paedophilia being a deeply-rooted state and that there are many individuals who don't want to break the law by acting on their desires. Custodial sentences and prison can only accomplish so much. If professionals worked on investigating a cure that could lead to a solution for the betterment of society.",
            "title_similarity": "0.70347965",
            "sentiment_compound": 0.1969
        },
        {
            "id": "h9kl33q",
            "score": 1,
            "text": "Let's break this down because there a couple areas we need to distinguish.\n\n1. Being attracted to a child vs teenager\n2. The cause of the condition\n\nYour underlying argument is good, but I find it falls apart when examined in through these lenses.\n\n1. The different ages.\n\nIf sticking strictly to pedophilia then there is no real conversation here. Attraction to prepubescent vs postpubescent but still underage. If keeping to pure definition then pedophilia would only cover the former, while if we stick to most peoples use of the term we take both.\n\nIn the case of those that that prey on postpubecet underage kids, I find that those that commit these crimes, it's much less about the age or appearance. Like sure they may be attracted to \"younger looking people\" but anyone who spends enough time around teens knows how much a 15 yr old can look like a 19 year olds. They choose to target these women for a variety of reasons one may be the look like a child. I'm not seeing these epstine type break down over there \"urges\" these are abusers, taking advantage of there power and position.\n\n\n2. Causes of the condition\n\nWhile I might agree that it is a condition, I think it's important to ask how they came to have it. As many have pointed out, abusers have been victims before in the past. But I would like to content, that there may be some cases where it's almost.... self inflicted.\n\nMind you this is pure speculation, with no evidence but I'll lay bear the argument.\n\nWhat I've noticed, on my years of being on the internet, is that things like fetishes, and tastes, are often learn, or developed as much as they are discovered. Especially to the porn addicted, you often find them getting into more and more depraved stuff, things they may have found revolting years ago. With things like highschool hentai, and \"school girl\" porn already catering towards a barely legal angle, is it too surprising that some might go looking for younger. \n\nThe question becomes at what stage do we chop this up as completely out of your control, and at what stage do we say, you should have know better. Does it change how we should treat the issue? It some it may, to other maybe not.",
            "title_similarity": "0.7398606",
            "sentiment_compound": 0.983
        },
        {
            "id": "h9km5nq",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9kocs6",
            "score": 2,
            "text": "using the DSM as a guide for what is or what isn't a real mental disorder is probably not a good basis.   \n\n\nDSM has been run by and infiltrated by industry folk for a long time, there is a lot of discussion in the field of mental health as to whether or not the illnesses they are creating and naming and classifying are real or just byproducts of pharma needing and wanting more \"illnesses\" to sell medications for.",
            "title_similarity": "0.6142888",
            "sentiment_compound": -0.5819
        },
        {
            "id": "h9kpjal",
            "score": 1,
            "text": "This thread sickens me.",
            "title_similarity": "0.4074547",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9kqcnf",
            "score": 1,
            "text": "It's a complex topic.\n\nA disorder is someone who does something that reduces their well being, makes their life worse off.  If psychological disorder is based on action often from negative feelings, but not from negative feelings directly, then is pedophilia a psychological disorder?\n\nIs pedophilia purely an emotion, a fetish, like liking kids sexually, or is pedophilia more than that?  Is pedophilia suicide attempts from feeling horrible about having such a fetish, not being able to be open about it or comfortable with yourself or who you are?  Or is pedophilia a sex offender or worse?  Someone who abuses, rapes, or worse?\n\nAt pedophilia's root it's just a fetish.  It's not anything more than that.  That is not a psychological disorder.  What the DSM is referring to is what comes after that, the distress from having that fetish.  It could be argued either way what we define pedophilia to be.",
            "title_similarity": "0.8178328",
            "sentiment_compound": -0.9889
        },
        {
            "id": "h9kr222",
            "score": 2,
            "text": "There is a really interesting episode of This American Life that explores this topic: https://www.thisamericanlife.org/522/tarred-and-feathered",
            "title_similarity": "0.2936077",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h9kshg3",
            "score": 2,
            "text": "I agree; however, it is important to note that if one sexuality is widely regarded as a mental illness it is likely others would follow suit. Where that starts and stops is an interesting questions, might incest fetishes, BDSM, or furry fetishes be mental illnesses too?",
            "title_similarity": "0.67497146",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9kugef",
            "score": 1,
            "text": "I agree with the title, but suicide prevention with DBT and CBT work because they treat the specific condition the patients have (ie Borderline PD and Depression). Suicide among patients with schizophrenia and bipolar disorder and depression and anxiety is reduced with treatments of those conditions. Treating Schizophrenia patients with anti-depressants when they don't have Schizophrenia doesn't decrease their odds of dying by suicide. In the same vein, treating paedophiles with DBT or CBT won't reduce their risk of suicide. Gay conversion therapy would be the closest equivalent I can think of and it's not exactly evidence based.",
            "title_similarity": "0.77065265",
            "sentiment_compound": -0.9907
        },
        {
            "id": "h9kuukm",
            "score": 1,
            "text": "I think one would need to be careful with this approach. Similar arguments have been put forward in the past to justify treating homosexuality as a 'disease' or mental illness. \n\nNot that I am saying it is, or that pedophillia and homosexuality are in any way linked. [although they have been treated as such in the past] but I am saying that it could be used to justify abuse as 'treatment' such as has until recently been the case with homosexuality and 'conversion therapy' which was nothing more than insitualised abuse. \n\nIn addition, I think one might risk re-normalising the \"homosexuality as a mental disease\" argument since so many people still seem to cling to that idea, and erroneously think the two are linked.",
            "title_similarity": "0.7496408",
            "sentiment_compound": -0.9694
        },
        {
            "id": "h9kvf9h",
            "score": 1,
            "text": "can you explain what flaws you find with your view that you want changing?",
            "title_similarity": "0.5360927",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9ky7r5",
            "score": 1,
            "text": "I think like most unacceptable behaviours pedophilia likely escalates. E.g. starts with thoughts, then maybe exploring pictures, then physical or mental abuse. I don't believe someone just sees an opportunity and abuses their first opportunity. This process is likely accelerated for those abused as it can be normalised by their abusers.\nI provide therapy with clients and often their values do not reflect their behaviours. E.g. drug using, treating others poorly, stealing, etc. I have never treated a pedophile though.\nI believe some research and there was a good documentary by Louis Theroux on this topic often shows that they have the thoughts and urges however most of the time their values are not to do harm the others.\nI believe some cases can be treated through therapy, specifically Acceptance and Commitment Therapy where you learn to defuse from the thoughts and behave in a way that aligns with your behaviours. E.g. I have the thought to abuse someone however this contrasts with my values of doing no harm to others. I am not aware of any current research on this topic. Also I am sure some would even voluntarily give up some of their freedoms so they wouldn't offend. E.g. voluntarily not go near children or restrict internet access.\nI use it alot for drug users. They have the thought and urges to use drugs but by doing drugs it contradicts their values. They also try and control their environment by limiting their money, removing drug dealers contact information, not going to certain places.\nObviously the consequences of acting on pedophilia are much worse and they should be handled by the law if acted on.\nThose who are of the view that the only solution is punishment of offenders are basically saying wait for kids to get abused then punish them rather than trying to find solutions to preventing abuse which should be our first goal.\nThe second goal should always be punish those who do break the law given they have had opportunities to seek help.",
            "title_similarity": "0.7743841",
            "sentiment_compound": -0.9714
        },
        {
            "id": "h9ky9k9",
            "score": 6,
            "text": "I think those seeking treatment who have not acted on urges shouldn’t be vilified, you’re right there. But I agree with a lot of people on here who’ve been saying that if it’s treated as a mental disorder that could be used as a defense against criminal prosecution as well as social stigma. \n\nWe don’t want this to ever become normal, they’re not victims, it’s not some disorder that they can’t control, it’s a sexual attraction that 99.9999% of people are capable of controlling without the help of a therapist - you don’t see every man or woman assaulting members of the opposite sex just cuz they can’t get laid or find the right porn, that’s incel territory, and we don’t want that to ever become normal either.",
            "title_similarity": "0.8231944",
            "sentiment_compound": -0.1298
        },
        {
            "id": "h9kyhfj",
            "score": 5,
            "text": "100% with you. People who are sick need help.",
            "title_similarity": "0.3411516",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9kyjab",
            "score": 1,
            "text": "The legal system in north america is already overly leniant when it comes to sentancing child molestors and offering up an additional excuse for this cruel and socially irresponsible behavior will do absolutely bothing for the betterment of society. \n\nThis would also potentially serve as a legal foot in the door for those groups looking to find a case to devalue the lives of those living non-heteronormative lifestyles.\n\nYour view is not condusive to the needs of the many.",
            "title_similarity": "0.81680334",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9l0cte",
            "score": 1,
            "text": "You’ve perfectly articulated (and evidenced) a thought I have had for years",
            "title_similarity": "0.052849784",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9l0jzq",
            "score": 1,
            "text": "They said the same for homosexuality long ago. Its a slippery slope",
            "title_similarity": "0.4592595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l1yfc",
            "score": 1,
            "text": "I think this video connects well with the topic I think : https://youtu.be/ClRxuu-Pd4Y",
            "title_similarity": "0.198614",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9l26f6",
            "score": 1,
            "text": "I agree with OP, 100%.",
            "title_similarity": "0.07678892",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9l3anp",
            "score": 8,
            "text": "For those of you who need some research studies on the efficacy of this approach, look up  Project Dunkefield, there have been studies done on their patients since their opening :\n\n[https://en.wikipedia.org/wiki/Prevention\\_Project\\_Dunkelfeld](https://en.wikipedia.org/wiki/Prevention_Project_Dunkelfeld)\n\nAnd just anecdotally, as an adult who was molested as a kid by a guy who had to do some time because of it....His punishment did nothing for me, I would have rather  the molestation not happened at all, so anything that attempts to prevent IMHO is better than the current system where we just deal with them after the fact. I honestly don't think his jail time was justice for me at all, I still had to deal with and pay for my own therapy sessions while the state got some free labor for a few years out of him,  Seems like the state benefited more than I did smh",
            "title_similarity": "0.7643363",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9l4dtv",
            "score": 3,
            "text": "Of course being pedophile is not wrong. That's why it's not illegal. Wether you view it as a sexual preference or a mental disorder: When did anybody ever chosen a preference or disorder?\n\nIn fact, calls for violence against pedophiles are very harmful for the protection of children, because it decreases the probability for pedophiles who struggle with not becoming an offender to seek the help they need.",
            "title_similarity": "0.8566539",
            "sentiment_compound": -0.3637
        },
        {
            "id": "h9l4tiv",
            "score": 1,
            "text": "I would also like to see people using the word correctly.  Pedophile is more disgusting than the, \"OMG he/she likes 16 year olds\"(also mentally wrong).  But that word is for people who are lusting over \"prepubescent\" children.\n\nThats a special type of evil.",
            "title_similarity": "0.7672455",
            "sentiment_compound": -0.6482
        },
        {
            "id": "h9l4uu2",
            "score": 1,
            "text": "This is so confusing because sympathy in english doesn't seem to mean the same as sympathie in french yet those words are almost identical. In french, sympathie is having the same feeling as someone. I just wanted to say that because my blood was boiling because of this confusion lol.",
            "title_similarity": "0.64412355",
            "sentiment_compound": 0.2669
        },
        {
            "id": "h9l5yuu",
            "score": 3,
            "text": "As someone who was assaulted as a child I agree. There are many pedos who don't act on their urges. (Good for them.) I believe it's close to intrusive thoughts. Idk, it's just like ocds intrusive thoughts to hurt others or yourself or do impulsive things. I also agree with your ideas for rehabilitation/punishment.",
            "title_similarity": "0.7326896",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9l5zvf",
            "score": 3,
            "text": "What we think of as paedophiles often just means rapists. I'm a generic heterosexual but I don't rape women. \n\nI imagine there are a lot of people sexually attracted to children but never mention it.",
            "title_similarity": "0.69318557",
            "sentiment_compound": 0.7996
        },
        {
            "id": "h9l6bok",
            "score": 1,
            "text": "My concern here is I don’t think we should set up a difference between pedophiles & sex offenders. Their actions, if the decided to act, are grounded in the harm of another for self gratification. \n\nFor those who have these ideologies and don’t act on them, I don’t think we should give them sympathy because they are acting as they should. Rather, I agree, if someone has these ideologies they go for treatment. They would be save under their doctors confidentiality and work on ways to live “normally”.  Yes, it’s awful to have those thoughts but I think the taboo is there to set the severity of these acts. \n\nI disagree sympathy should be socialized in a way that we’re saying “I am so sorry you have to deal with these sexual desires”. This rhetoric I think should not be normalized. The more people talk about and normalize these discussions, their is a risk social ideologies will start to blur and we could easily start justifying “treatment” that borders ideologies of the ancient Greeks. \n\nAlso to your point about sex is natural, these individuals also can have sex. It’s not like this ability is taken from them. They can have urges and release themselves in a child free zone. \n\nIn addition, sexual deviant ideologies is not just limited to pedophiles, so would this sympathy extend to all or just this group? \n\nI think the change that is needed in our society is to move away from the sexualization of young men and women. Stop making shows like Riverdale where you portraying a 16 year old as “dominatrix” or doing 20+ things. Make our media and child representation realistic. Our society should shift to caring for these kids, not projecting ideologies that allow men/women to sexuality teens… take the media around “Billie Eilish finally legal” ridiculousness. \n\nPeople, in general, experience dark thoughts or weird things. If people get OCD about an ideology, I00% support talking to a doctor. People may have differences in their mental makeup but I don’t think that justifies changing this particular taboo in the larger social context to be sympathetic.",
            "title_similarity": "0.8723086",
            "sentiment_compound": 0.9829
        },
        {
            "id": "h9l788t",
            "score": 1,
            "text": "I can agree, but they must be willing to identify their problem and seek help, which I think a large majority would not do out of fear/labelling/embarrassment/shame. And I feel like its almost a ticking time bomb to just give sympathy without forcing them to get mental help and embrace it to change. \n\nFWIW though, I remember reading a study that analyzed the brain activity of pedophiles and they concluded that it DOES have a mental component. That when pedophiles look at children, the brain registers the child's face as an older, more mature face - and therein lies their problem. They are seeing/attracted to an adult face, but in reality it is a child.\n\nI don't necessarily know if this study is more the exception than the rule, though. I know there are a ton of sickos out there that simply do not have a mental illness when it comes to pedophilia and are well aware of their actions.",
            "title_similarity": "0.7606089",
            "sentiment_compound": 0.664
        },
        {
            "id": "h9l8op2",
            "score": 1,
            "text": "I agree, 12yo me on cod once came to the realisation that things like “i will lick your little sister” will one day sound pedophilloic when my voice deepens. I also agree pedophilia is nothing but just not changing “your type” since you were a child. It okay for a 15yo to like the 15yo body type but once they become 23 and keep that view they need help.",
            "title_similarity": "0.6256271",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h9lb76b",
            "score": 1,
            "text": "Equating therapy effects on suicidal ideation with depression and bipolar disorder as evidence that it would help with pedophile therapy is disingenuous. In fact LGBT conversion therapy is associated with increased risk of suicide. You have to compare apple to apples. I agree with everything else though",
            "title_similarity": "0.7266572",
            "sentiment_compound": -0.9042
        },
        {
            "id": "h9lcfmv",
            "score": 1,
            "text": "Look up virtuous pedophiles. These are pedophiles that don't abuse minors.\n\nThere is also a vice video that talks about this bizzare sexual orientation.",
            "title_similarity": "0.7125663",
            "sentiment_compound": 0.7762
        },
        {
            "id": "h9lclnd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9le0c2",
            "score": 1,
            "text": "If a person has a pc full of child porn, and has raped multiple kids its to late and they should get life in jail, but people who didnt do anything that bad need help.",
            "title_similarity": "0.7049723",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h9le8ep",
            "score": 1,
            "text": "I think we treat it socially as a mental disorder but legally as a crime.",
            "title_similarity": "0.65915334",
            "sentiment_compound": -0.631
        },
        {
            "id": "h9le8v9",
            "score": 1,
            "text": "Stay away from my family",
            "title_similarity": "0.44251418",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lew3b",
            "score": 1,
            "text": "No need for that OP there's already a cure, it's called a bullet.",
            "title_similarity": "0.4837682",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9lf64d",
            "score": 1,
            "text": "A lot of actual sexual agrression agsainst children are pedocriminal not pedophils. A lot of it are crimes of \"opportunity\" within families.\n\nOften its about dominating someone they can easily subdue.",
            "title_similarity": "0.63755035",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9lgklb",
            "score": 1,
            "text": "People make this argument as if pedophiles aren’t currently capable of seeking “treatment”. Therapists are bound by law to confidentiality, as long as you pose no immediate threat to another person. So we really aren’t talking about treatment; we’re talking about social acceptance of “non-offending” pedophiles. Let’s stick to the point without obfuscation.",
            "title_similarity": "0.7542268",
            "sentiment_compound": 0.5108
        },
        {
            "id": "h9lh48u",
            "score": 2,
            "text": "Absolutely, as long as it stays a thought and not an action, they are individuals that need help.",
            "title_similarity": "0.41102585",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9lhmlq",
            "score": 1,
            "text": "This would never work, people would apsolutely never go to a doctor and admit they like kids and need help, they only ever do that if they get caught in the act.",
            "title_similarity": "0.70819163",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h9lhox3",
            "score": 4,
            "text": "Who knows, if people who had thoughts of pedophilia were able to get help, maybe I wouldn’t have been raped as a kid. I have to point out, that many rapes happen due to a sense of power. I would imagine many people with thoughts of pedophilia try very hard to keep them away. People who want to use abuse to show power, however do it at any chance",
            "title_similarity": "0.706643",
            "sentiment_compound": -0.8999
        },
        {
            "id": "h9lhpyi",
            "score": 1,
            "text": "yes",
            "title_similarity": "-0.13170728",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9li0yj",
            "score": 2,
            "text": "The fact that pedophilia even exist is just straight up weird",
            "title_similarity": "0.5953314",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h9li2x4",
            "score": 1,
            "text": "This is weird bc this exact argument was posted either here or in r/unpopularopinion recently.",
            "title_similarity": "0.3456123",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9liirh",
            "score": 1,
            "text": "Check out podcast “ Hunting Warhead “",
            "title_similarity": "0.2231803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lika7",
            "score": 5,
            "text": "This isn't really even argued in circles where people have brains. Societal norms project made up things like age of consent the morality of sex.\n\nPsychological abuse is tide to societal norms. If it was normalized that every year on your birthday we replaced one of your adult teeth with a permanent prosthetic, it might be seen as abuse not to do so.\n\nAbuse isn't a universal imperative, and people are idiots who think it is. The fact of the matter is, we base our distaste of pedophilia off current societal trends.\n\nYou can normalize anything. We normalized torture, normalized environmental waste, and are currently normalizing anti-vax. There's no universal morality of any of this. From some perspectives, promoting anti-vax is a horrid misuse of our first world technology. From another, it's a great way to cull rising population growth. Both are right, both are wrong, and neither have any objective morality to them.\n\nWanting to fuck kids is just that, wanting to fuck kids. Do I want to fuck kids? No. Do I want someone fucking my kids? No. Do I want laws against fucking kids? Yes. Do I think that makes me morally superior? No. I just want it. \n\nI have no evidence to prove that a society that normalizes the sexualization of children is inherently detrimental to their development. I have plenty of research that shows that when children are sexualized and the sexualization of these children is considered abusive by the majority population, children exhibit signs of abuse. \n\nWhen a child is hurt and you freak out, the child freaks out and experiences trauma. But if the pain isn't inherently traumatic and you handle it like a fucking adult, the child is fine. \n\nIt's just weird that people can't accept that maybe their worldview isn't some objective truth, but rather the culmination and evolution of humans as social creatures. Which by the way, you can do while maintaining that the majority of our social norms are optimal. You just can't argue that they are infallible.",
            "title_similarity": "0.7553516",
            "sentiment_compound": -0.9533
        },
        {
            "id": "h9lirw6",
            "score": 1,
            "text": "“Those with feelings of pedophilia who have not acted upon them should be given nothing but sympathy”\n\nOP you should change this.  Clearly your view is to have more options for therapy.  The way you wrote it kinda comes off creepy and can be mistaken as projecting.  \n\n“Those who have pedophilia should seek therapy and have more options to discuss their feelings”.\n\nCause no one should really sympathize with this shit lol.  Empathize maybe…",
            "title_similarity": "0.84561825",
            "sentiment_compound": -0.6171
        },
        {
            "id": "h9ljxfl",
            "score": 3,
            "text": "High velocity lead poisoning is the only cure for these people.",
            "title_similarity": "0.5406161",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9lk55x",
            "score": 2,
            "text": "Naw",
            "title_similarity": "-0.018955726",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9llgdl",
            "score": 1,
            "text": "Some of the stuff that get upvotes on here amazes me considering most the sensical stuff I post get downvotes. My feelings on pedophilia are that it is a mental Illness that does require counseling and treatment, and the majority of people who have this illness have been victims of it themselves. But that doesn't make it right. Them knowing what was done to them was wrong and a violation and just going and doing it themselves to another child, proves that they are just monsters. I do not feel sorry for them.",
            "title_similarity": "0.83761287",
            "sentiment_compound": -0.8905
        },
        {
            "id": "h9lmbpk",
            "score": 2,
            "text": "I'm wondering if anyone would ever admit they are a pedophile when they have never acted on it. Do people go to a psychiatrist and admit feelings of pedophilia even deep down they know they've never acted on it? Wouldn't that be a red flag that that person is possibly contributing to child pornography or has already molested someone?\n\nI can agree that it is a mental disorder, but it is so stigmatized that it I can't imagine anyone having sympathy for them. It would take a long time for the general public to think, \"This person is attracted to minors, but it's not their fault. It's a chemical or physical abnormality in their brain that they can't control.\"\n\nI think they should definitely be treated in an attempt to avoid sexual assault. But we should not risk having children be exposed to people like that. \n\nIt's hard to sympathize with people who do harm to others whether or not it's related to a mental disorder. I mean it sucks that they are suffering, but my focus is on the victim who has been traumatized by it.\n\nBut it would be really great if we can decrease stigmatization in order to help people before they act on it. Prevention is key.",
            "title_similarity": "0.79478645",
            "sentiment_compound": -0.6203
        },
        {
            "id": "h9lmzqg",
            "score": 1,
            "text": " I once read an article by someone who found themselves attracted to children and discovered this when they were still a teenager, and tried to seek help because they knew that they didn't want to abuse any children, they were criticized and ostracized for it by the professionals they sought help from. That article and some of the experiences I've had in life that involved sexual assault, is why I agree with you. The thoughts themselves may disgust the person having them, but it does not mean that they are predators.\n  I found that those who actively sought to victimize children, were either those who had been victims themselves and we're attempting to take what had been taken from them, probably as a means to regain control of what has happened to them; or those that wanted power and control over those who couldn't fight back and choose children or those who cannot stop what is happening. \n Pedophilia is thoughts that have yet to hurt others and should be treated to give the pedophile a chance to control their thoughts and urges. Sexual predators are those that act on those thoughts, or those that just don't give a damn and do what they want to the easiest prey around them. Similar to the difference from someone struggling with violent thoughts seeking help versus someone murdering for fun or because of untreated mental issues.",
            "title_similarity": "0.7791006",
            "sentiment_compound": -0.7241
        },
        {
            "id": "h9ln8m1",
            "score": 2,
            "text": "Ive always had this view. It clearly isn’t normal for people to think like this so in my mind they need help. I’d argue they’re usually victims of trauma themselves so it wouldn’t be right to just condemn them. Obviously condemn their actions but from what I’ve seen many don’t want those urges and try to fight it because they know it’s wrong.",
            "title_similarity": "0.70824826",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h9lp7sa",
            "score": 1,
            "text": "Out of those studies, how many were “cured”?",
            "title_similarity": "0.16680285",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lq15l",
            "score": 1,
            "text": "People with mental disorders are not “given nothing but sympathy”",
            "title_similarity": "0.569872",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lqawh",
            "score": 3,
            "text": "I think the most important thing to stress that the sympathy should only go towards non-acting pedophiles. If they touch one child in an inappropriate way their ass needs to see a jail cell.",
            "title_similarity": "0.835781",
            "sentiment_compound": -0.4033
        },
        {
            "id": "h9lqd8h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9lqrkb",
            "score": 2,
            "text": "It is incurable and once acted upon the only choice imo is to destroy the defective unit.",
            "title_similarity": "0.64657557",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h9lr1f0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9lrbj1",
            "score": 1,
            "text": "You never give anyone with any illness nothing but sympathy",
            "title_similarity": "0.48788896",
            "sentiment_compound": -0.5446
        },
        {
            "id": "h9lsfjq",
            "score": 1,
            "text": "If pornography isn't in the DSM why the fuck should pedophilia be.",
            "title_similarity": "0.70313084",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9lsfm8",
            "score": 1,
            "text": "What op is describing in terms of prejudice is very real. I am a lawyer and in my state people can be civilly confirmed foreseeably forever if proven by a civil standard to have an attraction to children. It seems like that should not be constitutional but it is. The government doesn't even have to justify continuing to lock them up, just has to show that they haven't improved and the science says that pedophilia can't really be cures so many are never let out. Off course people don't want to sit they have a problem. The penalties for should obviously be very harsh for anyone who has hurt a child but the penalties can be very harsh even for unproven offenses or offenses that didn't involve an actual child.",
            "title_similarity": "0.7735463",
            "sentiment_compound": -0.9804
        },
        {
            "id": "h9lsveg",
            "score": 1,
            "text": "There's pedophiles and there there's pederasts, pederasts are the ones who actually go through and abuse children, I think this is something most people don't know.\n\nMore than changing your view, it's our society's view as a whole when it comes to pedophiles.  \nI think it was a video from the Atheist Experience where a dude who called to tell them about his pedophilic behavior and I think he also thought about taking his own life because he couldn't find the help he really needed and wanted.\n\nAnd the sad part is that we don't have an easy option for those people, because we as a society have ingrained in our minds that bullets are somehow the \"cure\" for pedophiles.  \nIt's hard for them to get the help they need because society wants to kill them, and if some of them don't get help quickly, it can end real bad.  \n\n\nAlcoholics and drug addicts would never get or find help if society wanted to kill them, and their situation would just get worse and worse until they hurt or kill someone.\n\nAnd in the end, you have the church.  \nThe church that has a history of sexually abusing children and protecting said abusers for centuries, yet somehow it can't be touched by the law for whatever reason.",
            "title_similarity": "0.7726873",
            "sentiment_compound": -0.9923
        },
        {
            "id": "h9lt3gu",
            "score": 1,
            "text": "let them alone with children then, lets see what happens. Is this another way to defende pedo? f\\*ck that",
            "title_similarity": "0.6237718",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9lt8sx",
            "score": 2,
            "text": "I don’t disagree with your premise, but it won’t happen in probably my lifetime. Just look at how Simone Biles has been treated. How mental health is regarded for the most part is atrocious, and that’s for non morally reprehensible things. Not hard to see how something like pedophelia would not be accepted",
            "title_similarity": "0.8036658",
            "sentiment_compound": 0.1712
        },
        {
            "id": "h9lwhzx",
            "score": 2,
            "text": "This is nothing new, I've heard this talked about on science and skeptical podcasts 5 or more years ago.\n\nGood luck getting people to change their views though.",
            "title_similarity": "0.38587773",
            "sentiment_compound": 0.5945
        },
        {
            "id": "h9lwzv3",
            "score": 1,
            "text": "Peds should move to Afghanistan where it's considered normal by their newly welcomed government.",
            "title_similarity": "0.36840525",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9lx1j8",
            "score": 1,
            "text": "I agree with what you're saying and want to add, many pedophiles were abused in their childhood. So I think there is a possibility of change.",
            "title_similarity": "0.6018381",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9lx6j5",
            "score": 1,
            "text": "Have you heard of \"man love Thursdays\" in the middle east? Men have sex with each other and little boys. They only do this on Thursdays which makes them exempt from the \"gay laws\". They don't think they're doing anything wrong. It's part of their belief system. Or away around their moral beliefs. What do you think about those motherfuckers?",
            "title_similarity": "0.66426015",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h9lx7e5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9lxkit",
            "score": 1,
            "text": "While we’re at it, belief in religion should be treated as a mental disorder…because it really is.",
            "title_similarity": "0.7402422",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lxsfg",
            "score": 1,
            "text": "Hard no.",
            "title_similarity": "0.23883967",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9lxy3t",
            "score": 1,
            "text": "I think there should be varying degrees. If someone is 17 meh lesser charge. But under that, no mercy",
            "title_similarity": "0.43333745",
            "sentiment_compound": -0.4243
        },
        {
            "id": "h9lyr7i",
            "score": 1,
            "text": "They should get all the help before they commit the act just like homicides. After, you should be punished according to the law.",
            "title_similarity": "0.64577913",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h9lzwdh",
            "score": 2,
            "text": "My sister used to attend sex-addicts anonymous and told me about a few people there that shared that they are attracted to children but have never acted on it. They felt disgusted by themselves and even though my sister was abused as a child, she felt a \ntremendous amount of empathy for them.",
            "title_similarity": "0.673658",
            "sentiment_compound": -0.8151
        },
        {
            "id": "h9m0d88",
            "score": 1,
            "text": "This opinion is going go be predominant in 50-100 years. It is a mental disorder, a lot of convicted pedos go to jail and say, “keep me locked up cause I’ll do it again.” They know they are sick and they know they cannot be fixed in this society.",
            "title_similarity": "0.6005488",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h9m48lr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9m4xbv",
            "score": 1,
            "text": "If you voluntarily get help and have NEVER ACTED ON IT IN ANY WAY,  I don't think it should be viewed as criminal. \n\nBut that's a big if..",
            "title_similarity": "0.58597344",
            "sentiment_compound": -0.09
        },
        {
            "id": "h9m6150",
            "score": 2,
            "text": "I work in a jail, with several units full of them. The ones I have to deal with do and say horrible ass shit and have done things that most people really just probably don't think happens, they also talk about all the things they plan when todo when they get released. I think they all should be given to pharmaceutical companies and maybe the military for any sort of experimental testing they want. \n\nThat said, the ones I mean are the ones who it's beyond a shadow of a doubt have acted, and are not planning on changing. Not sure if the last part matters but i dno maybe they deserve a second chance but I don't think so. \n\nAs for the ones who have not acted, they deserve all the help they need and its probably more than what is offered by many places. Not only have they done nothing wrong but I'm sure they have a multitude of issues dealing with their sexual desires and what it means and how to handle and cope.",
            "title_similarity": "0.65088415",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9m6d0u",
            "score": 1,
            "text": "Would you say that we are dealing appropriately with offending pedophiles?",
            "title_similarity": "0.67420983",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h9m6wri",
            "score": 1,
            "text": "No",
            "title_similarity": "0.17060319",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9m8h8q",
            "score": 1,
            "text": "Clown.",
            "title_similarity": "0.083900034",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m8s7z",
            "score": 1,
            "text": "I agree that we need to treat pedophilia as a potentially dangerous medical disorder. However, there are a number of obstacles. I'll just cover the two big ones off the top of my head.\n\nOne, the mental health systems in the US aren't great. I'm US based, and can't speak for other countries, but I've heard extensive horror stories about experiences in psych wards. Frankly, a lot of mental health resources in the US seem to focus on containment and medication, and I don't know that pedophilia is a medication-treatable disorder. Everyone I know who has been in a psych ward, typically for severe depression, lovingly (/s) refer to them as \"suicide prison\" because conditions can be fairly similar in a lot of respects even if the staff aren't shitty. Outside of locking them up, it's a little difficult to enforce seeing a psychologist or other mental health professional. Not only that, but the cost can be astronomical. Low end of the price range in my experience is 50$ per hour session. Even people who want help might not be able to afford it.\n\nTwo, and this is really fucking gross, pedo pride is absolutely a thing, especially on social media like twitter. They refer to themselves as MAPs (minor attracted persons) and many aggressively defend pedophilic urges and fictional child porn (writing, fanart, 'loli/shota' hentai, etc.), usually doing their damnedest to groom minors into interacting with them and parroting their arguments for them. They're trying to give pedophiles \"good public image\". This sort of push for pride is going to pose a huge difficulty in getting the point across to them that yes, it's wrong and yes, they need mental health help desperately. (And yes, I know the MAP shit started on 4chan as anti-lgbtq+ sentiment. It absolutely looks like actual pedophiles have adopted it and are using it.)\n\nWe need to treat pedophilia like a mental illness, absolutely. The issue is that, well, a lot of mental illness with manageable symptoms gets ignored until it boils over and someone gets hurt- oftentimes the mentally ill person harms themself, but in the cases of pedophile, likely children. Between broken mental healthcare systems and the social change brought on by the internet... I don't know that treating it like a mental illness will do much to prevent things at this point.",
            "title_similarity": "0.75795996",
            "sentiment_compound": -0.984
        },
        {
            "id": "h9m94ud",
            "score": 2,
            "text": "The exploitation in collecting photos etc of children creates a market.  Just looking for or at pedo photos means some child has been harmed for money.  Children are victims before anyone \"acts.\"",
            "title_similarity": "0.6032665",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h9m9gk5",
            "score": 1,
            "text": "Pedos who seek help before they act on it deserve support. Chomos deserve the wall after having their genitals caved in with a big rock.",
            "title_similarity": "0.56414646",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9m9mfp",
            "score": 1,
            "text": "This reminds me of an episode of Chicago Med: https://www.youtube.com/watch?v=5YNyaVBtGmQ",
            "title_similarity": "0.24131015",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9magh8",
            "score": 1,
            "text": "I think people with paedophilic inclinations should be able to get good non judgemental mental health support, and this would include those who are have thoughts about committing rape.\n\nIs rape caused by mental illness? I think not often.\n\nMany who sexually abuse children are opportunists. \n\nWe have recently heard of the social norm in some areas of Afghanistan where the rape of male children is deemed as acceptable. They don’t have mental illness they live in a society where this abuse is tolerated. \n\nIn our society incest often happens when a husband believes his wife is not doing it for him, so his daughter must take her place. Even if she is a child and no matter how much the child is damaged.\n\nIn churches for many years the priests were the ultimate power and many used this power to rape children. It seems many priests saw this as a perk of the job.\n\nMy point is that children are most often raped when societies allow this to happen. So the solution is often not therapy but to provide more child protection and for lawmakers to be very explicit that the society does not tolerate the rape of its children.",
            "title_similarity": "0.7806581",
            "sentiment_compound": -0.8893
        },
        {
            "id": "h9marwm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9mbja1",
            "score": 1,
            "text": "I both agree and disagree. Pedophiles who undergo intensive treatment often have high levels of recidivism despite that treatment. My own therapist worked with adults who committed sex crimes in a very intensive in patient program, but the rates of recidivism were still sky high. Therapy isn’t a perfect solution. \n\nRegardless, I think understanding pedophilia is key to fixing it—if that’s possible. But if we discourage conversations about that, then it impedes our own progress. That being said, keeping the social stigma against pedophilia in place is important for preventing assaults imo.",
            "title_similarity": "0.7600343",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h9mbz59",
            "score": 1,
            "text": "I agree. if you actually sexually assault a child as an adult  you are a terrible person. However there are people with these desires, and their inability to talk about it with people without being thought of as awful simply for having the thought leads to them just bottling up the emotions and potentially acting on them later. I think being open about it being a real mental disease and giving them therapy for it would both help them live better and keep children safer.",
            "title_similarity": "0.83669907",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h9mcikd",
            "score": 1,
            "text": "Some people have thoughts about killing people. Their minds give them positive feedback from the thought of eliminating other humans. They have killophilia.  They should be treated with sympathy despite their despicable actions.  What is wrong with you that you can’t forgive and overlook this one flaw?\n\nNo. Just no.",
            "title_similarity": "0.740323",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h9mdbqy",
            "score": 1,
            "text": "I agree. Once they've taken advantage of a child, they're in the garbage. I'd happily hurt the monsters myself.\n\nBut if they've never acted on it and never want to?  If we ostracize *those* people, then the only people they can turn to for love and support are the abusers who embrace and encourage their darker predilections. \n\nIf we want to protect kids, we need to place compassionate, understanding support in these people's lives to help them be the best they can be and encourage them to protect others from their harmful impulses and desires.",
            "title_similarity": "0.8179226",
            "sentiment_compound": 0.992
        },
        {
            "id": "h9me2ao",
            "score": 1,
            "text": "there is no rehabilitation for pedophilia. once identified, they need to be institutionalized.",
            "title_similarity": "0.6719998",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9mef5k",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9meugz",
            "score": 2,
            "text": "Mental disorder is an excuse man it’s an aberration you give people an inch they take a mile.",
            "title_similarity": "0.49555123",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9mezls",
            "score": 2,
            "text": "Hang em high",
            "title_similarity": "-0.029079592",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mf0dl",
            "score": 2,
            "text": "Jail em",
            "title_similarity": "0.26275995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mfzho",
            "score": 1,
            "text": "Shh youre not allowed to say that",
            "title_similarity": "0.3748836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mgdsi",
            "score": 3,
            "text": "As a mom, I couldnt agree more.\n\nMy first priority is to stop that kind of thing before it happens and it's been shown that human react better to understanding, empathy, and treatment rather than demonizing them.  Stoping future pain is more important than anyone's agenda or anger. Let's keep kids safe first. \n\nNo matter your feeling on it, they are still human.  They didn't choose to have their attraction stop growing with them. It doesn't excuse acting on it obviously but those that have put their own desires behind the welfare of children should be treated. They have hope as they have already shown to have enough empathy to not always place their desired first. \n\nIts an unpopular opinion but I feel the way we are treating this stuff now makes it worse and creates more victims, and no amount of right is anger is worth a child being hurt.",
            "title_similarity": "0.69500273",
            "sentiment_compound": -0.905
        },
        {
            "id": "h9mh8yv",
            "score": 1,
            "text": "It's hard to give sympathy to someone who's desire causes another unwilling participant harm?\n\nIf a guy wants to kill someone should we feel bad for him?",
            "title_similarity": "0.70114475",
            "sentiment_compound": -0.8504
        },
        {
            "id": "h9mhaou",
            "score": 1,
            "text": "i can’t really provide much sympathy to a predator, even if they’re non offending. it just seems like the likelihood of them having *never* carried out a sexual assault is very low.",
            "title_similarity": "0.6916969",
            "sentiment_compound": -0.6404
        },
        {
            "id": "h9mhfvb",
            "score": 1,
            "text": "No. To all. To everything. Specially to the people saying “it should be treated like a sexual attraction”.\n\nWhat the fuck is wrong with y’all? No. \nNo.\nNo. \nWhat the fuck?\nNo.",
            "title_similarity": "0.68525624",
            "sentiment_compound": -0.8385
        },
        {
            "id": "h9mhvl3",
            "score": 1,
            "text": "Heard a prison shrink say the average pedo has 500 encounters. She didnt clarify and I didn't ask. Got sick of the conversation and left.",
            "title_similarity": "0.58674085",
            "sentiment_compound": -0.1526
        },
        {
            "id": "h9mi3md",
            "score": 1,
            "text": "yeah ok but... you try get them to come forward and receive help.",
            "title_similarity": "0.2665736",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h9mihk6",
            "score": 1,
            "text": "Cant i be closed minded about anything?",
            "title_similarity": "0.44605404",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9milx6",
            "score": 1,
            "text": "No they should we executed sick bastards we got enough normal people to start getting rid of you weirdos",
            "title_similarity": "0.62400305",
            "sentiment_compound": -0.891
        },
        {
            "id": "h9mjcgt",
            "score": 1,
            "text": "Mental condition or not, I want them off the street",
            "title_similarity": "0.54427075",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h9mjlyi",
            "score": 1,
            "text": "Go have kids of your own… that will change your view",
            "title_similarity": "0.46132347",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mjmzz",
            "score": 1,
            "text": "Mental illness in that sense, is really a word for deviations from the norm.  Some deviations are illegal, some aren't.",
            "title_similarity": "0.6914549",
            "sentiment_compound": -0.743
        },
        {
            "id": "h9mk6uj",
            "score": 1,
            "text": "Sociopaths who fantasize and get sexual excitement from killing or violently raping a women are no less or more guilty than a pedophile who sexually abuses a child.  Are you then saying we should approach the murderers in a more kinder and empathetic approach.  \n\nIs there a difference?\nMan #1. Standing at a bar, shows everyone his gun and say he needs a fix so he is going to violently rape  someone tonight \n\nMan #2 Standing at a bar, tells everyone he has been imagining naked children all day so he is going to go out and sexually assault a child.\n\nBoth are crimes of the highest degree. Both haven't acted yet but clearly have to be stopped.  I do not think playing nice with the pedophile is going to deter him jyst as I don't think playing nice with a rapist will deter him.\n\nYou still think there is a difference?\n\n\nPedophiles are master manipulators.",
            "title_similarity": "0.62665117",
            "sentiment_compound": -0.9852
        },
        {
            "id": "h9mkake",
            "score": 1,
            "text": "I agree with you.",
            "title_similarity": "0.053838536",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mkhvg",
            "score": 1,
            "text": "Do you think we should spay/neuter them so they can't pass on their disease?",
            "title_similarity": "0.73564315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mkjzb",
            "score": 1,
            "text": "Getting real fucking sick of sick fucks coming on here and defending pedophiles. Get the fuck out of here with that shit.",
            "title_similarity": "0.68341744",
            "sentiment_compound": -0.9542
        },
        {
            "id": "h9mkpha",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9ml80b",
            "score": 1,
            "text": "Wrong, they should receive electro therapy.",
            "title_similarity": "0.50970143",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9mln8e",
            "score": 1,
            "text": "Posts like this are why Reddit sucks",
            "title_similarity": "0.5784155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mlr68",
            "score": 1,
            "text": "What a fucking idiot.",
            "title_similarity": "0.33876377",
            "sentiment_compound": -0.5563
        },
        {
            "id": "h9mltxl",
            "score": 1,
            "text": "You changed my view.\n\nIf someone is mature enough to understand that they have feelings of pedophilia, but not act on it, they should most definitely have access to treatment.\n\nAnd if they do act on those feelings, toss them in prison and then give them treatment.\n\nI think this won't happen because of stigma",
            "title_similarity": "0.8184986",
            "sentiment_compound": 0.1128
        },
        {
            "id": "h9mlz3s",
            "score": 2,
            "text": "1. Pedophilia is already treated as a mental disorder first and foremost. A major sign of lack of remorse/empathy. probable indicator of Antisocial Personality Disorder. also as you mentioned, the DSM includes the niche “Pedophilic disorder”—which i personally believe is inextricably linked to another broader personality disorder involving lack of empathy. the pedophile and the serial killer are of the same breed. they both have desires for violence, which they *logically* know are “wrong” but are incapable/struggle extremely and unnaturally to shake these desires bc the desire does not *feel* wrong to them—only logically do they “feel” that this desire is wrong. \n2. Pedophilia, the Oedipus Compex, there are many “legitimate” paraphilias that an ethical psychologist that follows the DSM would validate and treat—neutrally from a clinical standpoint. *But witholding “judgement” does not necessitate sympathy.* Consider: a physician treating the flu neither judges nor sympathizes with the patient’s chance case of the virus.\n3. Just because paraphilias such as pedophilia are “legitimate”/real—and could benefit from therapy—does not mean they “should” be given sympathy. ironic that you say the pedophile, who lacks or at least had a significantly reduced capacity for *empathy,* “should” be given *sympathy.* as if to fill this void, or “teach” them something they are incapable of. Consider: does the serial killer fantasizing about brutally murdering someone else “deserve” sympathy, just because they lack empathy? the pedophile and the serial killer are of the same breed. they have desires that they know are wrong but are incapable/struggle extremely and unnaturally to shake these desires bc the desire does not *feel* wrong to them—only logically do they “feel” that this desire is wrong. \n3. further, i believe offering sympathy to the pedophile is impossible, unless you are also a pedophile. it may seem im getting into trivial semantics here, but the difference between sympathy and empathy is important in itself and central to an issue such as pedophilia. sympathy implies you can put yourself into the shoes of the pedophile and comprehend logically how hard it is to not act on the pedophilic desire. paradoxically, all the non-pedophile can offer the pedophile is *empathy* (what the pedophile must lack to some degree) bc each can relate generally to the mindset of feeling helpless/out of control, and share in the pain of that mindset, without understanding the logic generating that mindset (sympathy). im no psych pro obviously, but this dynamic is probably a major component in the development of Stockholm Syndrome. the only beneficial effect of the victim having *empathy* for the pedophilic predator is *forgiveness*—so that the victim can (try to) free themselves from any remaining claws the pedophile has on their emotions. \n4. again not a psycho pro (edit: fateful typo, meant *psych* pro, but leaving…), but abiding by this logic, the only viable path of therapy i see for a pedophile is not offering them sympathy, but teaching them to apply and strengthen their own capacity for sympathy—a logical process that requires no feeling/empathy. help them find a way to function peacefully in society and forge a brain pathway that disincentivizes pedophilic thoughts. train the pedophile to *sympathize* with themselves for their valid desire, then 2) apply this to each possible victim when their inappropriate desires arise—sympathizing with the effects of the trauma on the victim (as if the pedophile were the victim and had to deal with those effects for the rest of their lives)—even the purest “psychopath,” with zero capacity for empathy, does not feel “positive” 24/7 and knows the difference between satisfied and dissatisfied mental states—and can thus *sympathize* with the logical idea that their victim might have to exist in a perpetual dissatisfied/negative state. IMO the therapist should focus on the underlying empathy dysfunction, not the symptomatic pedophilia. you cant fix their dysfunctional empathy, or delete their pedophilic desires—effectually, pedophilia itself is untreatable, but the underlying empathy dysfunction is. \n5. to fully address the second sentence of your post, take a moment to sympathize, not empathize, with the child victim of the pedophile—you cant. and the thought that you could know what it feels like to be molested by a pedophile makes you sick. all you can do is *empathize* by imagining that the child victim’s feeling of helplessness/pain may exceed your worst memory of feeling helpless/in pain. in conjunction with remembering how you felt as a innocent small child in the face of giant adults, who you depended on and needed to trust but slightly, and naturally, feared as an ant fears a shoe. *so in my opinion, the world needs to be as clear with pedophiles as we are with serial killers: we cannot and thus will not offer sympathy or excuse such violence on the grounds of any disorder…* whether it be ADHD, anxiety, depression, schizophrenia, or Antisocial Personality Disorder or Pedophilic disorder. the only beneficial strategy against brutality is brutal honesty: it is inexcusable, and will not—or at least *should* not—receive false sympathy and go unpunished.",
            "title_similarity": "0.8623971",
            "sentiment_compound": -0.9961
        },
        {
            "id": "h9mmk8t",
            "score": 2,
            "text": "Thoughts are not crimes. Actions are crimes. If they don't act on it they can and should be treated for it. If they act on it they should be punished just like every other crime.",
            "title_similarity": "0.7332739",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h9mo7x7",
            "score": 1,
            "text": "dude you're just wrong, not everyone who sexually assaults a child is a pedophile? yeah ok,  and comparing not being able to stop being a pedophile to not being LGBTQ? like what? so many offensive statements are made that I can't look past to even consider the original argument",
            "title_similarity": "0.77511543",
            "sentiment_compound": -0.9141
        },
        {
            "id": "h9moa0r",
            "score": 1,
            "text": "A sick choice",
            "title_similarity": "0.39966446",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h9mp4ga",
            "score": 2,
            "text": "there's no way you have kids to say some of the things you said",
            "title_similarity": "0.4858778",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9mpbio",
            "score": 2,
            "text": "NO! NO! AND NEVER,  COME NEAR MY KID , YOU DIE , DONT GIVE  A FUCK!",
            "title_similarity": "0.53154504",
            "sentiment_compound": -0.4796
        },
        {
            "id": "h9mpfg5",
            "score": 2,
            "text": "Nah, I’m good with not having a Pedo pride day and shunning them.",
            "title_similarity": "0.62545097",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9mpg07",
            "score": 1,
            "text": "[ Removed by Reddit ]",
            "title_similarity": "0.409804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mphtb",
            "score": 1,
            "text": "In some parts of modern society today, we accept that a man or woman can have a natural attraction to the same sex and have learnt to accept that we aren’t really in control of whom or what we are attracted to. What you mention is just the next rashnull step. As to when any part of modern society accepts it for applying to any form of attraction and figures out a more humane solution to their existence, is anyone’s guess. How about robot children? Does that resolve the moral dilemma or is the problem that there exists a segment of our species that is attracted to yung’uns and should be eradicated!",
            "title_similarity": "0.6510264",
            "sentiment_compound": 0.9669
        },
        {
            "id": "h9mpi9x",
            "score": 1,
            "text": "Amazing how many people here seem to have missed the \"have not acted upon it\" part of the title.\n\nBut yeah, if they haven't actually attacked anyone ye,t then they should absolutely be offered whatever help they need. Recognizing a problem and attempting to fix it is a good instinct. Some people are built broken, and I have great sympathy for them and their plight. \n\nRight up until they attack someone. Then they can fuck right off to prison forever.",
            "title_similarity": "0.72730863",
            "sentiment_compound": 0.2663
        },
        {
            "id": "h9mpo6q",
            "score": 1,
            "text": "I don't disagree with your point, but what undermines the validity of it for me is that the evidence that you have provided  refers to *reduction in suicide rate*. Of course we don't want people ending their lives, but I think we should be thinking about *evidence that shows that interventions reduce likelihood of acting harming children*",
            "title_similarity": "0.8498642",
            "sentiment_compound": -0.9432
        },
        {
            "id": "h9mpzqz",
            "score": 1,
            "text": "No one is going to out themselves as a non acting pedo, so we all know they exist in some way, shape, or form.  The best policy for a non acting pedo is to keep their mouth shut.  In no universe is any form of pedophilia acceptable.  Trying to gain sympathy as a pedo is a bad take and terrible look.  \n\nI'd have zero qualms about doing time for murder if someone touches my children.  So I'd suggest they find a way to keep that shit in check.",
            "title_similarity": "0.8326032",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h9mq9ln",
            "score": 2,
            "text": "Because pedophilia causes lifelong PTSD to victims the punishment to perpetrators must be severe to deter their actions.\n\nThose that have those feelings and do not act on them have not committed a crime and certainly are deserving of privacy and treatment.",
            "title_similarity": "0.8513499",
            "sentiment_compound": -0.6872
        },
        {
            "id": "h9mqczo",
            "score": 2,
            "text": "Giving sympathy is just enabling. Maybe showing an understanding about why they feel the way they do if they were abused as a child because apparently statistics say if you were abused the chances you carry out that same behavior is 1 in 4. But never show sympathy, it needs to be drilled into that persons head that, that’s not okay. I sympathize for other peoples mental illnesses when they aren’t affecting the lives of others around them in such a terrible way. Just because your life is fucked up from sexual abuse doesn’t mean you have any right to fuck up some innocent child’s life and take something so precious from them. Sick",
            "title_similarity": "0.8614993",
            "sentiment_compound": -0.9798
        },
        {
            "id": "h9mr1lv",
            "score": 1,
            "text": "I agree, but I see pedophiles as mentally ill just like serial killers are mentally ill. You have my sympathy and help until you act on your emotions Dexter",
            "title_similarity": "0.7645093",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h9mr30e",
            "score": 7,
            "text": "Exactly. It's refreshing to see this opinion becoming more common. \n\nMy go-to example is this: You can want to murder a man with every god damn fiber of your being, every day imagining how great it would be to finally be able to. But until an action is taken...they're not a murderer. Or a criminal at all. They're mentally unwell and that's it. People forget this fact with pedophilia and somehow think it's right to punish people who have done nothing wrong. And may do nothing wrong ever. \n\nA friend of mine committed suicide back in high school, and the big reasons for it were alcoholism and being sexually attracted to young girls. He wasn't able to really tell anyone and couldn't get therapy for it, or any professional help. If he could he might still be here today. \n\nWe miss you Teemu.",
            "title_similarity": "0.6992172",
            "sentiment_compound": 0.6916
        },
        {
            "id": "h9mr94a",
            "score": 1,
            "text": "Lolita, light of my life, fire of my loins. My sin, my soul. Lo-lee-ta:   \nthe tip of the tongue taking a trip of three steps down the palate to   \ntap, at three, on the teeth. Lo. Lee. Ta. She was Lo, plain Lo, in the   \nmorning, standing four feet ten in one sock. She was Lola in slacks. She  \n was Dolly at school. She was Dolores on the dotted line. But in my arms  \n she was always Lolita.",
            "title_similarity": "0.34274268",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9mrbck",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2494455"
        },
        {
            "id": "h9mrk7o",
            "score": 1,
            "text": "There is no treatment that removes the desire except death. Never give a pedo a second chance.",
            "title_similarity": "0.5430915",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9mrzhn",
            "score": 1,
            "text": "First you say it should be treated and in the next sentence you say they should be given nothing but sympathy.\n\nTfw you can't even make up your mind in the title.",
            "title_similarity": "0.72288036",
            "sentiment_compound": -0.3643
        },
        {
            "id": "h9ms344",
            "score": 1,
            "text": "Pedophile detected",
            "title_similarity": "0.43760073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9msxte",
            "score": 1,
            "text": "No.",
            "title_similarity": "0.17669228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mt5s3",
            "score": 1,
            "text": "If the point of your post is that you sincerely wonder if your view can be changed then I will tell you why I do not agree with you and perhaps my perspective will be a little contagious, perhaps not:\n\nI understand, have long contemplated, and fully respect your position. I do not blame ANYONE who holds your position and I feel genuinely terrible for true pedophiles because, like you say, they do not control their sexuality anymore than anyone else. It sucks for them. \n\nSo given the above why do I disagree with you? (Completely) \n\nI suspect you do not have children. Perhaps I am incorrect. I say this because you have to viscerally understand how innocent and helpless children are in the presence of an adult. \n\nIt is unfortunate but as you also say pedophilia is monstrous. The factors on either side of the question, the equation, do not matter. It is the fulcrum that matters: the act itself. There are thousands of Pedophiles who suffer and face hate from society. These are the people who you and I both feel bad for given their what is essentially a medical condition. All of their suffering having been born the way they are is minuscule in consideration against a single act of pedophilia. A stepfather raping his daughters at night for years is FAR FAR worse than the suffering or social discomfort, or imprisonments, of a million pedophiles as is a grown man having sex with a toddler. It doesn’t matter how good or bad they are we don’t have the luxury of taking risks with medical treatment. If the course or medication prescribed doesn’t work the way you expect it to the impact isn’t dizzyness and diarrhea, it is a child being raped. A child being raped sir. \n\nTHE FACTS ON EITHER SIDE OF THE EQUATION ARE MINUSCULE WHEN CONSIDERED AGAINST THE ACTS THEMSELVES. The acts are monstrous, and therefore are performed by real life monsters. Monsters don’t know they’re monsters they’re just hungry. It isn’t their fault that they are monsters, I acknowledge that but that doesn’t make less monsters that is just WHAT MONSTERS ARE. \n\nYou cannot wrap academia around it and take the risks necessary for unfettered science to take place. \n\nWe are NOT talking about pedophiles when we’re talking about pedophiles; we’re talking about children and child rape. That is where you are looking at it so differently from me",
            "title_similarity": "0.8474571",
            "sentiment_compound": -0.9974
        },
        {
            "id": "h9mv6jo",
            "score": 1,
            "text": "How to you define pedophilia? I understand the  people who are attracted to young kids and not act on it and people who are abusive, there is a big difference in it. coming from a third world country, where marriages for girls could happen 15/16 in like 20 years ago. And a girl from my town who got married when she was 17 even though the marriageable age in the country was set as 18 in 1950s. This is part traditions that has been followed for hundreds if not thousands of years, so how do you define something that has been part of culture.",
            "title_similarity": "0.5181308",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9mxggx",
            "score": 2,
            "text": "I saw this post a couple of days ago. Whats with the recent pro pedo agenda?",
            "title_similarity": "0.27793437",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mzzwx",
            "score": 1,
            "text": "I 100 percent disagree with you, if you rape a child, you should be at least given a LONG prison sentence, like I think murderers should",
            "title_similarity": "0.7134967",
            "sentiment_compound": -0.9201
        },
        {
            "id": "h9n10wc",
            "score": 1,
            "text": "This stuff was a long time coming\n\nPeople who have sexual feelings for children should get help and support to deal with it, rather than be demonised.\n\nFuck sexual predators though",
            "title_similarity": "0.6945869",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9n2jty",
            "score": 1,
            "text": "u/schwiftymcvlohz !!!",
            "title_similarity": "0.17439638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n37t1",
            "score": 1,
            "text": "here is the weekly repost of the same post",
            "title_similarity": "0.093684524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n492o",
            "score": 1,
            "text": "I don’t think this is a view I’d want to change. But society dictates a very different sentiment, unfortunately.",
            "title_similarity": "0.5889323",
            "sentiment_compound": -0.518
        },
        {
            "id": "h9n97x2",
            "score": 1,
            "text": "I don’t know if I would call it a mental disorder, maybe I’d be up for calling it a sexual orientation because you don’t choose who you’re attracted to and I don’t think it’s a curable thing - just like homosexuality can’t be ‘cured’ however hard some people try. HOWEVER, the point remains that under no circumstance should a person act on such attraction, because of the consent factor, obviously. I agree that people who have these feelings and absolutely do not want to act on them deserve to receive any help they need / want to learn how to deal with those feelings in a healthy way that isn’t harmful to children. \n\nI just don’t know if it makes sense to classify it as a mental disorder full stop. If and when someone feels that it’s okay to act on those feelings, then yes, I will absolutely argue that some kind of mental disorder is likely there. But just the feelings of attraction, while also being adamant that acting on these feelings is unacceptable? I feel like that’s a pretty sane way of looking at a part of yourself you can’t make disappear.  \n\nThat said, I do not think it’s smart to go so far as to allow pedophealia as a sexual orientation to take part in any kind of pride movement, as that would just encourage those who are already trying to convince themselves that it’s okay to act on it.\n\nThis shit is complicated though.",
            "title_similarity": "0.84774536",
            "sentiment_compound": 0.8692
        },
        {
            "id": "h9nc86e",
            "score": 1,
            "text": "I can bring a unique perspective here.\n\nPedophilia is most often caused by a lack of a real intimacy in someone's life for an extended period of time reaching back into their own childhood. This usually happens to men much more often than women.\n\nAs a child, they received affection and intimacy just for existing.\n\nThen they grew some, and that went away, but like every human, we all want these things for our full lives.\n\nThen, after a decade or two, they're an adult... *And the only place they ever usually receive non-judgmental intimacy is during SEX*.\n\nBut even grown men want to be INTIMATE (NOT SEXUAL) with kids. It's validating in a much different way, and ALL men want to have the chance to express affection and love.\n\n***Starting to see where some of the wires get crossed?***\n\nTHEY INADVERTENTLY WIRED SEX AND INTIMACY TOGETHER, AND THE NATURAL CHILD-INTIMACY DRIVE IS THEN WIRED INTO THE SEX DRIVE. :)\n\n...Keep tellin' y'alls that I'm a VERY good Empath. ;)\n\nWe want to fix this, we have GOT to start treating EVERYONE as being worthy of intimacy and following through on that without making people feel like burdens... even if we don't want to have sex with them. ;)\n\nSex is fun! And validating!\n\nBut the seeking of it WILL become (and remain) ***pathological*** IF IT REMAINS THE ONLY ACCEPTABLE TIME AND PLACE A MAN CAN FIND INTIMACY.\n\n**In fact, the only reason men avoid intimacy with kids is because they kind of need to avoid being called \"pedophile\" at all costs.** \n\nKind of a literal threat to your survival if that happens.\n\nThere's a cruel irony in that. We resist their formation so much that we cause more of them to form.\n\n--Ki, the Empath King",
            "title_similarity": "0.5460562",
            "sentiment_compound": 0.9927
        },
        {
            "id": "h9ncrlb",
            "score": 2,
            "text": "Say that to the father of a victim. Be real you idiot.",
            "title_similarity": "0.54299295",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9ne1s2",
            "score": 2,
            "text": "Christ on a bike. A good pedo is a dead one. I don’t give a fuck if I get downvoted.",
            "title_similarity": "0.59542996",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h9ne8or",
            "score": 1,
            "text": "Whilst I can see your POV, your argument is based on pedophilia being predominantly based on sex. I think we need to differentiate here between those individuals who have a genuine sexual attraction to children and those who use child sexual abuse (CSA) as a means of control, which is the underpinning foundation of almost all violence, exclaiming that used for self defence. \n\nA sexual orentiation, regardless of who it is towards, is not a mental illness *unless* it causes severe distress to the concerned individual, even then it’s not always clear as they may have depression but no other diagnosable mental illness. To assume otherwise is dangerous and allows mental illness to be defined by our political stance and laws (do r forget that homosexuality was only recently decriminalised and is still illegal in many countries, it was also only a few years after this that it was declassified as a mental illness).\n\nWhilst I believe that those with sexual urges towards children should be helped to avoid acting on them and therefore protect our vulnerable children, I do not believe that classifying it as a mental illness is the right path to go down. Your example of BPD is vastly different and you cannot lump sexual orientation *of any kind* in with personality disorders, psychosis, depression or other illness.",
            "title_similarity": "0.8506664",
            "sentiment_compound": -0.9911
        },
        {
            "id": "h9negj3",
            "score": 1,
            "text": "Pedophilia isn’t like being LGBTQ+. Not sure why you’re making that comparison. If a gay or bisexual person acts on their desires, no one gets hurt like when a pedo does.",
            "title_similarity": "0.7058328",
            "sentiment_compound": -0.374
        },
        {
            "id": "h9rsez2",
            "score": 1,
            "text": "They shouldn't describe specifically their preferences in bio( describe them to your doctor).  CP should be baned. They shouldn't call themselves \"childlovers\".",
            "title_similarity": "0.75989705",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9sxows",
            "score": 1,
            "text": "Fu k off",
            "title_similarity": "0.18061891",
            "sentiment_compound": -0.6908
        },
        {
            "id": "haccea7",
            "score": 1,
            "text": "Best cure for pedophilia is a little 9x19",
            "title_similarity": "0.46758014",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbvyycg",
            "score": 1,
            "text": "substitute “serial killing” for each instance of “pedophilia” in the post title. then reconsider.",
            "title_similarity": "0.6289145",
            "sentiment_compound": 0.0
        }
    ]
}