{
    "CMV: voluntarily unvaccinated people should be given the lowest priority for hospital beds/ventilators\nI firmly believe that healthcare should be denied to no one regardless of their economic or social conditions.\n\nHowever, what boils my blood the most is that we have so many perfectly good vaccines against Covid that are readily available and accessible in most first-world countries, and yet people refuse to take them.\n\nIf you have the chance to take a vaccine and still don’t, then whatever happens when you get Covid is on YOU.\n\nYOU are being a burden on an already overloaded (in some places) healthcare system, which could have been avoided by taking a goddamn shot.\n\nTo allege that it is all a ‘conspiracy’ by (insert ‘Fauci’, ‘Bill Gates’, ‘Communists’, whatever other figure the right likes to bash) is irresponsible and poses a danger not only to themselves, but to the community at large (as more cases = more risk of mutation = more new variants = less effective vaccine)\n\nEDIT: I don't think all the obese/smokers/alcoholics arguments work, because:-   fixing all of those conditions entails significant lifestyle changes as opposed to vaccination, which is a one-off event.- they don't directly affect anyone other than that specific person.- they take up a maximum of one bed, as opposed to covid patients, who can infect others and lead to more people taking up beds.": [
        {
            "id": "ha4p4qr",
            "score": 1,
            "text": "/u/LordSaumya (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/p9gald/deltas_awarded_in_cmv_voluntarily_unvaccinated/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.44470525",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9y60la",
            "score": 1,
            "text": "To /u/LordSaumya, **your post is under consideration for removal under our post rules.** \n\n* You are required to **demonstrate that you're open to changing your mind** (by awarding deltas where appropriate), per [Rule B](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_b). \n\n---\n\n**Notice to all users:**\n\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\n\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \n\n\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\n\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\n\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\n\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.57944995",
            "sentiment_compound": 0.6452
        },
        {
            "id": "h9wpa5o",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9wsjw4",
            "score": 1,
            "text": "Ethically speaking a vaccinated individual does have priority over an unvaccinated person because of their higher survival likelyhood. Otherwise you might just end up with 2 dead patients",
            "title_similarity": "0.6320173",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9x34zk",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9x1lax",
            "score": 36,
            "text": "I've chosen not to get vaccinated for a few reasons, but I'll spare you my arguments as I'm sure you've probably heard them already and remain unconvinced. Instead let me try something a bit unusual.\n\nAssume I'm an idiot. Iq of 80, barely able to read if at all, let alone understand the ins and outs of the medical field. Maybe as a consequence of my low iq I'm prone to conspiracies like Alex jones kind of stuff. (im not btw) It could be very easy for me to be propagandized by misinformation.\n\nIf the above were true, do I deserve to be given sub par medical care for a mistake made out of ignorance? When that mistaken thinking is being purveyed by many the talking heads on TV.\n\nMy overall point is that I think its unfair to punish people in this way for having the wrong opinion. Even if you disagree with the anti-vaxxers you can't simply assume they are ill motivated.",
            "title_similarity": "0.80573833",
            "sentiment_compound": -0.979
        },
        {
            "id": "h9wyhf3",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.12311891"
        },
        {
            "id": "h9ws5hl",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9wzcnh",
            "score": 0,
            "text": "Question….Drunk driver slams into another vehicle, literally killing the family in the car he hits. He is injured. Do you take him to the hospital for treatment or let him die on the side of the road?",
            "title_similarity": "0.5002563",
            "sentiment_compound": -0.9001
        },
        {
            "id": "h9wzs72",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.12311891"
        },
        {
            "id": "h9wmhyo",
            "score": 856,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x7kfb",
            "score": 9,
            "text": "So interesting to watch the supposedly “everyone is equal”, “freedom”, virtue-signaling bloc of people quickly showing their true, disgusting, tyrannical plans.  Advocating for segregation based solely on their notion of what’s “the right thing to do” is the exact opposite of what they claim to represent…",
            "title_similarity": "0.640159",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h9x1tq0",
            "score": 50,
            "text": "When I got the Janssen vaccine, there was a warning on the sheet of paper I had to sign, reminding me that the vaccine is untested and could have severe long-term side effects. Essentially, WE'RE the human guinea pigs doing the human trials. I was told that the situation is the same for the other vaccines as well. Although I did get the vaccine, I respect anyone's decision not to be part of human trials of a completely untested medication, and they should not be pressured by their peers, or the system, to do something that could be very harmful to them in the future.",
            "title_similarity": "0.84897757",
            "sentiment_compound": 0.2182
        },
        {
            "id": "h9wnecc",
            "score": 16,
            "text": "Should we also not treat people in car accidents who didn’t wear their seatbelt?",
            "title_similarity": "0.5162488",
            "sentiment_compound": -0.5511
        },
        {
            "id": "h9x2p5n",
            "score": 4,
            "text": ">- fixing all of those conditions entails significant lifestyle changes as opposed to vaccination, which is a one-off event.\n\nAll I want to add right now is that vaccination is not a one-time event, especially considering that we're getting ready for COVID-19 vaccine booster shots.",
            "title_similarity": "0.7907114",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9x0sp6",
            "score": 0,
            "text": "Blacks and Hispanics have high vaccine hesitancy rates. Prioritizing them last is a pretty messed up thing to do.",
            "title_similarity": "0.67032325",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h9x41mj",
            "score": 0,
            "text": "This is RACIST because black population has been most hesitant. You people are sick.",
            "title_similarity": "0.5522487",
            "sentiment_compound": -0.8841
        },
        {
            "id": "h9ww0bd",
            "score": -13,
            "text": "Vaccines should be mandatory for everyone who can get them. Or if you don't wish to be precived as an authoritarian just tell people they won't get covid relief if they are unvaccinated.",
            "title_similarity": "0.7977581",
            "sentiment_compound": -0.5442
        },
        {
            "id": "h9wupkv",
            "score": -2,
            "text": "The term 'voluntarily unvaccinated' is based on a fallacy, therefore, your entire argument is invalid.\n\nThe starting point of this discussion should not be *vaccinated* but rather *unvaccinated*\n\nYou can only be 'voluntarily vaccinated' because in order to become vaccinated you must relinquish the prior status of being unvaccinated.",
            "title_similarity": "0.7687925",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h9ws355",
            "score": 2,
            "text": "I will skip what others have pointed out and just say that our society has its own mechanisms already in place to achieve the effect you desire.\n\nOne of our political parties decided some time back that \"at will employment \" would be a good idea.\n\nIn this case that law means many will find they can't work without the vaccine. \n\nIt is a matter of time before it becomes mandatory in public schools like many other vaccinations are.\n\nEven the virus itself will help weed out those that won't get vaccinated, right Phil Valentine and about a hundred thousand like you? (Rest in Peace,  no disrespect intended, he wanted to  reverse his opinions on air but never got the chance to broadcast again.)\n\nI bring these somewhat unrelated issues up to point out that there is no need to alter the triage system that has been in place and working effectively for quite some time now to achieve the goal you desire.",
            "title_similarity": "0.7692975",
            "sentiment_compound": 0.9275
        },
        {
            "id": "h9wnk98",
            "score": 16,
            "text": "So by your logic fat people should be low priority. Same of smokers, type 2 diabetics, sport injury, and those who drink. People like doctors, nurses, and philanthropists should be given top priority.\n\nI hope you can see why this is such a bad idea. This will kill more people. If your interest is actually less corpses rather than imposing your morals on someone than this is a foul idea. Even if we limit it to covid I know I’d just lie and say I had the vaccine in this situation because I’d have literally nothing to loose. What are they going to do when they find out I lied? Hang me? If I am so bad from covid I need to go to the er than if I don’t get medical help I’m dead anyway so I may as well do it.",
            "title_similarity": "0.8407052",
            "sentiment_compound": -0.906
        },
        {
            "id": "h9wn2e7",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9ws3gq",
            "score": 18,
            "text": "Ok, in that case anyone who is overweight (60% of people in many countries) should be given low priority for all hospital treatments since they are a burden on their country due to their laziness and gluttony.",
            "title_similarity": "0.78752404",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h9x5hq0",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x7jsq",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9wpvr0",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9wwt54",
            "score": 3,
            "text": "So if a drunk person willingly drives and crashes their vehicle into a family, do we deny them medical treatment based on their actions? I don’t see paramedics making those decisions when trying to save lives. Bottom line, they don’t get to choose who gets to live based on the irresponsible actions of those addicts.\n\nHow about those that break into someone’s home and get shot, should they be denied healthcare since they intentionally broke the law? \n\nThere is no legal recourse for any company injecting me with a drug that isn’t FDA approved. I do not consent. If I die or get something poisonous injected in me, my family is screwed.\n\nIf this were about health, we should encourage dieting, exercise, not smoking, no alcohol intake, and eating low sugar/sodium foods. Instead we have medical employees (last years heroes) getting fired for not complying. There has to be a good reason those fired nurses and doctors are refusing vaccines. I trust their judgment over our inept government.",
            "title_similarity": "0.76269436",
            "sentiment_compound": -0.9529
        },
        {
            "id": "h9wxc7r",
            "score": 1,
            "text": "I agree, this might make me an asshole but as other people ask \"should others get low priority too?\" YES! Smokers should get lower priority when they get diseases that are caused by smoking. Obese people should get lower priority in the same case. I know thats not something that will ever be in place but I like to imagine that if you treat your body like shit on taxpayers backs you should not get to take away space or time from people that aren't responsible for their hospital stays.",
            "title_similarity": "0.7811644",
            "sentiment_compound": 0.214
        },
        {
            "id": "h9wyzy9",
            "score": -1,
            "text": "I agree with you in general but disagree with your reasons. I say this as the spouse of a physician that treats covid patients and has several friends working in the ICU. The reason the vaccinated should get a bed over unvaccinated is not for vindictive reasons, it's because if you end up on a vent with covid and you're unvaccinated, your chances of survival are incredibly low. I can't tell you how many stories I've heard of \"pray for my cousin in the ICU\" and I already know the outcome. I dont need any other details - I dont need to know name, age, weight, or anything. If they're in the ICU and they're being intubated or put on a vent, their odds of survival are minimal.\n\nSo there they are, unvaccinated, fighting a futile fight that could take days, weeks, a month, or even longer. Most doctors and nurses know they won't make it but they try anyway. Meanwhile you have vaccinated patients with a much higher likelihood of survival waiting. You have car accident victims and those with heart attacks and they can't get a bed because the ICU is full of unvaccinated patients who probably won't be saved taking up precious time and resources. Think of it this way - the faster you can move people out of the ICU, the more people you can save. \n\nAt the end of the day it's not about taking personal responsibility - there are plenty of arguments about that (obesity, smoking, etc). It's really about the patient's chance of survival. Is it great that we're in a place where we have to make choices like that? No. It's awful. No doctor wants to have to do that, but that's where we are in many places around the world. They have to make a choice based on who is most likely to survive and unfortunately, that is not the unvaccinated.",
            "title_similarity": "0.8492019",
            "sentiment_compound": -0.6992
        },
        {
            "id": "h9wv7xs",
            "score": 82,
            "text": "If you're paying for the medical assistance you are receiving, why does it matter? Giving them access to hospital beds and ventilators will only burn their own wallet and health.\n\nIt's not up to hospitals to take that additional step to deny healthcare to a subset of the population.",
            "title_similarity": "0.84313065",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9wptdt",
            "score": 717,
            "text": "I like this idea so let me ask.\n\nShould voluntarily obese people be given lowest priority in hospitals as well?   They are more likely to have severe covid illness as well as other health issues.\n\nWhat about people who voluntarily go in the sun and later get cancer?  Should they be lower too?\n\nWhat about people who voluntarily drink alcohol?  Or eat red meat?  Or have smoked a cigar?  Or who don't exercise regularly?",
            "title_similarity": "0.68759865",
            "sentiment_compound": -0.8677
        },
        {
            "id": "h9wudy5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x211r",
            "score": 0,
            "text": "At a certain point,  insurance companies are going to refuse to cover these people leaving them destitute if they get sick.",
            "title_similarity": "0.6638583",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9x6k6d",
            "score": 0,
            "text": "\"I firmly believe that healthcare should be denied to no one\". Proceeds to explain why we should deny some people healthcare",
            "title_similarity": "0.74758434",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h9x6u79",
            "score": 0,
            "text": "You know it’s a genuinely good view when half of the comments aren’t really even arguing against it",
            "title_similarity": "0.33776665",
            "sentiment_compound": -0.0972
        },
        {
            "id": "h9x83pe",
            "score": 0,
            "text": "On the surface I want to agree with you. I genuinely do. People that choose to not get vaccinated kind of deserve what happens to them. However if we start drawing the line that a personal choice should affect when or if you get healthcare, where does that line get drawn and who decides? I ride a motorcycle. I ride with full gear: full helmet, armored jacket, gloves, boots, armored and Kevlar jeans. I took a motorcycle riding class before ever getting on my bike and I ride very safely. But what happens when a group decides that motorcycles are dangerous (they are) and therefore I should go to the back of the healthcare line if I'm in an accident (basically car accidents get treated before me)? I don't have to ride a bike, I know the dangers, and I'm making the choice. I know that's not a direct analogy because I'm not making my choice based on misinformation, but the point is at what point do we start penalizing people for their choices? I can't stand anti-vaxxers, but I don't think withholding healthcare is the answer (in fact, the hypocratic oath prevents doctors from even doing that). I think education and discussions are the way to move people in the right direction.",
            "title_similarity": "0.6607479",
            "sentiment_compound": -0.9472
        },
        {
            "id": "h9xjc53",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.12311891"
        },
        {
            "id": "h9xdwtq",
            "score": 8,
            "text": "voluntarily unvaccinated people should be given the lowest priority for hospital beds/ventilators\n\nWell, then they should also have their healthcare-oriented taxes and pay-cuts reduced, or removed entirely.",
            "title_similarity": "0.7716042",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9xfef6",
            "score": 15,
            "text": "Honestly the lack of empathy people here can have is crazy. If you take the time to try to think about why people aren't getting the vaccine, it's often gonna be that they're scared, or have been misled into wrong ways of thinking. To say these people are less deserving of life is just horrible.",
            "title_similarity": "0.77847135",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h9x093s",
            "score": 2,
            "text": "I wonder if your reasoning is coherent. Do you also think active homosexuals who contracted HIV/AIDS should be given the lowest priority for hospitalisation and health care? We have so many perfectly good options against potential lethal STDs that are readily available and accessible in most first-world countries, and yet people refuse to take them.\n\nIf you have the chance to avoid getting AIDS and still don’t, then whatever happens when you get HIV or AIDS is on YOU.\n\nYOU are being a burden on an already overloaded (in some places) healthcare system, which could have been avoided by putting on a goddamn condom.\n\nTo respond to your counter-argument:Argument 1: significant lifestyle changes as opposed to vaccination, which is a one-off event.  \nSignificant lifestyle changes is an irrelevant factor. In the end it is up to an individual how much of an impact a vaccine can be. The first question for you to be asking should be \"Who am I to decide for another person how much of a deal a vaccine is?\"If people choose to be unvaccinated because their religious belief, this can easily be a significant lifestyle change uncomparable to for example stopping being homosexual active without condoms or being an alcoholic, or obese person with an unhealthy diet.Argument  2: The claim that obese/smokers/alcoholics don't directly affect anyone other than those persons is very incorrect. Are they not a burden as well on the healthcare system by voluntary decision? Why not? Smokers directly harm people in their direct vicinity, alcoholics directly harm their relationships, etc. etc.\n\nArgument 3: They may take up a single bed, their hospitalization entails much more than a bed, examination, different expertise like cancer research, heart/vasculair disease checks, smokers can increase the chance of cancer in people nearby them.",
            "title_similarity": "0.8747474",
            "sentiment_compound": 0.4512
        },
        {
            "id": "h9x82dl",
            "score": 4,
            "text": "If you are vaccinated, why do you care if I am?\n\nAren't you protected?\n\nIs the immune system no longer a thing?\n\nWhy do you want to hurt people for not trusting big pharma as much as you do?\n\nYou should educate yourself on all the harmful chemicals they have produced and distributed in the last 20 years.\n\nEmployer health and life insurance do not cover adverse reactions or long term effects due to vaxx, why should I risk my life insurance policy to be part of this experiment?\n\nUn-vaxx are not the bad guys, we are not profiting off this experiment. You can have my vaxx and take the next 10 boosters if that makes you feel better- ME TAKING THE INJECTION DOES NOT HELP YOU IN ANY WAY.\n\nLook at who is grossly profiting from this, they are immune to any responsibility of adverse reactions from product. I don't trust corrupt politicians and big pharma, their track record speaks for itself.",
            "title_similarity": "0.84125453",
            "sentiment_compound": -0.7228
        },
        {
            "id": "h9xd9v2",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9xdkoh",
            "score": 35,
            "text": "At this point the people pushing the vaccine are becoming anti science. All it does is protect yourself from serious illness, it doesn’t protect others and it’s not a miracle end to covid. We have to learn to live with it like the other diseases in the world. \n\nIt’s ridiculous people seriously want to restrict healthcare when they don’t even understand what the vaccine does. If you are fully vaxxed, healthy and still afraid, you’ve been brainwashed into reclusion",
            "title_similarity": "0.8706294",
            "sentiment_compound": -0.4928
        },
        {
            "id": "h9wudrs",
            "score": 1,
            "text": "Vaccines reduce the severity of the disease, so the patients who are more likely to be hospitalized, put on a ventilator, or die will be the unvaccinated. The overall point of the vaccination campaign, along with the lockdowns and everything else, has been to save lives, Now, you say we should change our priority out of spite, allowing people to lose their lives who might otherwise be saved while prioritizing treatment for the more protected? Hospitals save people who self-inflict their wounds/condition doing dumb shit all the time, spite is not a criteria medical professionals use in the emergency room, for the good reason that their priority is to save lives. On the bright side, the choice you're putting forward is rarely going to have to be made since breakthrough cases are rarely severe enough to need hospitalization, a ventilator, or to result in death.",
            "title_similarity": "0.82382685",
            "sentiment_compound": -0.6071
        },
        {
            "id": "h9wv6eu",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9ww4js",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9wx5ku",
            "score": 1,
            "text": "I wouldn't necessarily say \"lowest priority\", but this is essentially what is happening during the triage step right now.\n\nTriage isn't about what's fair or whose first in line, it's about prioritizing who had the best chance at survival. If a vaccinated and a non vaxxed person arrive at the same time showing similar symptoms, since we currently have limited supplies the vaxxed person definitely would take priority since it's been shown overwhelmingly that vaxxed individuals have a higher survival rate.",
            "title_similarity": "0.7252904",
            "sentiment_compound": 0.8359
        },
        {
            "id": "h9x3w07",
            "score": 1,
            "text": "Great, ventilators kill people just like the tens of thousands dead from your “vaccine”. You do know that those who’ve experimentally jabbed themselves also transmit the virus.",
            "title_similarity": "0.59640026",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9xfqb4",
            "score": 1,
            "text": "Ok then rock climbers should be lowest priority of physical injuries in hospitals because they put themselves at a much higher risk that they could have easily avoided by no rock climbing. Stupid logic, this also basically means people in the military would be the lowest priority for gunshot wounds because they chose to put themselves at risk",
            "title_similarity": "0.8223752",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h9y5y5b",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xdjsk",
            "score": 22,
            "text": "I worked in healthcare all my life and I can tell you the same thing was said about gay men with AIDS back in the day. It was wrong then and you are wrong now. We treat the sick and injured regardless of how they became  a patient.",
            "title_similarity": "0.6538707",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h9wmuax",
            "score": 160,
            "text": "Kinda opens the door for other stipulations too. Like having health insurance gets you higher priority over the uninsured.",
            "title_similarity": "0.5071359",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9x0rt3",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.123118915"
        },
        {
            "id": "h9wno7j",
            "score": 447,
            "text": "This is a dangerous road to go down.",
            "title_similarity": "0.2809383",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9wumnm",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x590w",
            "score": 34,
            "text": "Deal, as long as this also applies to every other complication caused by voluntary actions or lack thereof. \n\nAre you gay and don’t practice safe sex? Oops, no AIDS treatment for you until every other patient is healthy. \n\nAre you a dumb teenager who got in an accident while texting? Sorry, no emergency surgery until the guy with a flu gets treated. \n\nOverdosing on fentanyl? Tough luck, back of the line. \n\nYou can say the obesity thing takes too much time to solve, but putting on a condom or not doing drugs takes less time than getting a vaccine. So either we completely restructure the medical priority procedure, or we treat people with Covid. \n\nSorry you can’t pick and choose who to deny healthcare to based on who’s more likely to share your worldview.",
            "title_similarity": "0.82383007",
            "sentiment_compound": 0.4362
        },
        {
            "id": "h9xbhg7",
            "score": 8,
            "text": "“Perfectly good vaccines” that don’t work well and you still can contract covid 19",
            "title_similarity": "0.67463887",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9x8kn2",
            "score": 4,
            "text": "\nYour view is pretty clearly racist and classist.\n\nMinorities and poor people are disproportionately unvaccinated.",
            "title_similarity": "0.5326136",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9x2j0i",
            "score": 2,
            "text": "This is a form of retaliatory behavior. Does that patients life have less value than the other patients, simply because of their choices? No. Their life is just as important as anybody elses- but you want to retaliate against them based on their choices and force them to wait until very last to get treatment.\n\nDoctors are supposed to treat everybody equally regardless of sex, gender, beliefs, politics, life choices, etc... A life is a life, and they prioritize based on the severity of their patients conditions. What you are suggesting is doctors begin to discriminate against patients and base their prioritization on something other than the severity of conditions.\n\nThat would be simply awful. Doctors work to save lives- it's not their job to make choices based on morality. Allowing that would be opening a serious can of worms.",
            "title_similarity": "0.81305146",
            "sentiment_compound": 0.7007
        },
        {
            "id": "h9x7xo5",
            "score": 2,
            "text": "Edit 1 - bullshit.  All it takes is to stop, much easier than going somewhere to get a vaccine.  It is also free.\n\nIn your nightmarish dystopian fantasy they should be relegated to death as well.",
            "title_similarity": "0.70213515",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9xa471",
            "score": 1,
            "text": "What about smokers, morbidly obese people, alcoholics, or people injured doing extreme sports?\n\nThey brought it on themselves.",
            "title_similarity": "0.4949013",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9xdrl1",
            "score": 1,
            "text": "The vaccine is typical of the healthcare industry with not actually solving the problem.  I got the vaccine back in January and now will have to get a booster soon and then a booster after that, etc.  They keep saying the vaccine shots are free, but they’re not.  These companies aren’t giving them away for free.  Governments are having to buy them which means you will pay for them through taxes at some point.  If people are actually committed to the social good, they’ll get in shape, stop eating crappy food, and follow every other recommendation for a healthy and safe lifestyle.  That would free up so much capacity in the healthcare system and bolster the resistance to viruses that Covid would be a blip on our radar and not the huge condemnation on what the medical field has become over the past several decades which isn’t about curing or prevention but repeat business.",
            "title_similarity": "0.78791183",
            "sentiment_compound": 0.964
        },
        {
            "id": "h9xlhal",
            "score": -1,
            "text": "They shouldn’t even be given admittance. I think their two favorite phrases are “fuck around and find out” as well as “play stupid games win stupid prizes”. So they should die by their own mantra. They’re a parasitic leech on the healthcare system by intentionally ignoring precautions. Take away the safety net from them.",
            "title_similarity": "0.7649412",
            "sentiment_compound": -0.4522
        },
        {
            "id": "h9x1at2",
            "score": 101,
            "text": "78% of Covid deaths are in overweight and obese people. This makes leading a healthy lifestyle at least as effective as the vaccine.\n\nSo, by your logic, we can say that those who choose unhealthy habits every day should be given lower priority for hospital beds as well.",
            "title_similarity": "0.71424925",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9wtypy",
            "score": 20,
            "text": "The problem here is the legal definition of \"voluntary\". On what grounds would a doctor base his decision to not treat a patient? on facebook posts? On twitter discussions? Do those who refuse the vaccine have to be signed into a database of anti-vaxxers? How do you know if and why someone refused? This has to be legally solid and well defined because otherwise doctors and hospitals will get sued a lot.\n\nAlso I see a lot of ppl comparing it to obesity and smoking: absolutely not the same. Not even in the same ballpark. Obesity doesn't kill others, smoking is an addiction.",
            "title_similarity": "0.8412745",
            "sentiment_compound": -0.2453
        },
        {
            "id": "h9x3kfu",
            "score": 13,
            "text": "Shortly (about 9 hours) after I got my second shot of the miderna vaccine I'm told I stopped breathing.    my wife told me this, because I was unconscious for about 20 hours, give or take.  \n\nI have applied for a medical exemption from getting a booster because the last time I got the jab I almost died, it has been refused by government bureaucrats.\n\nshould I be made to wait to get on a ventilator or hospital bed if I end up with covid?",
            "title_similarity": "0.68235904",
            "sentiment_compound": -0.7512
        },
        {
            "id": "h9wx8dp",
            "score": 16,
            "text": "I wonder to what extent this is already happening.  When hospitals don't have enough beds they implement triage policies where those with the greatest chance of survival are given priority access to care.\n\nAlmost everyone *dying* of Covid is unvaccinated, so if a hospital got so full they had to go into triage I'd be surprised if they weren't prioritizing care for those most likely to survive, i.e., vaccinated people who still got sick.\n\nThe thing that really grinds my gears is that the unvaccinated are taking up space and time in hospitals that would previously be used for cancer patients etc.  Their selfishness is killing other people by putting unnecessary strain on the system.",
            "title_similarity": "0.81941855",
            "sentiment_compound": -0.8089
        },
        {
            "id": "h9xa48u",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xb7bx",
            "score": 187,
            "text": "Weaponizing healthcare is just fucking evil. Stupid shit like this will cause more people to be against universal healthcare, or use healthcare for their own self-serving purposes.\n\nFine, you don't want to provide healthcare for unvaccinated people, then I say no liver transplants for those that fucked up their own liver. Fuck em, right? \n\nHow about we triage patients based on whether or not their choices led to their situation? One ambulance, four patients? Go for the responsible one first who paid their health premiums, then the more healthy one....",
            "title_similarity": "0.85520166",
            "sentiment_compound": -0.9477
        },
        {
            "id": "h9wv60i",
            "score": 0,
            "text": "I'll try a different approach. It doesn't make sense to give non-vaccinated people the lowest priority because the only reason you would do this, is as revenge.\n\nWhen ventilators are sparse and triage needs to take place, vaccination is already a factor in the decision-making. However, it's not the ony factor. In this situtation, as a doctor, you do not want to go on a revenge spree. You want to save as many lifes as possible. And you do this by prioritizing those who have the highest chance to make it out alive. Again, vaccination is a factor here. But so is age, other diseases (e.g. obesity) and so on. There is no reason vaccination should be the only factor or that unvaccinated people should receive lowest priorization, because as the person making the decision, it's about saving lives and not politics.\n\nShould we really force a doctor to always deprioritize unvaccinated people although the doctor knows this will lead to more people dying and not less? This goes against all a doctor stands for (hippocratic oath and such).",
            "title_similarity": "0.8531059",
            "sentiment_compound": -0.6967
        },
        {
            "id": "h9wvpng",
            "score": 0,
            "text": "Is the number of vaccinated people going into ICU units cor COVID actually that high to make this argument?",
            "title_similarity": "0.5321462",
            "sentiment_compound": -0.3767
        },
        {
            "id": "h9ww76e",
            "score": 0,
            "text": "Triage was developed in response to large amounts of simultaneous arrivals, such as in the case of an attack or natural disaster. We have a complex and thought-through hierarchy for who gets treatment when you *have* to choose between multiple individuals. \n\nIt’s not all first-come, first-serve either, not in the case of emergencies. Low-stakes, low-treatment patients are absolutely dismissed early in the case of an emergency to make room.\n\nI want you to zoom out a little bit, and again, consider the ethical nature of a hospital doing what you would want them to do. Think about what it would mean to live in a world in which they actually did refuse unvaccinated patients rather than sitting in the harm caused by the fact that they can’t. \n\nThe key factor here is the character of the patient. There’s the fact that they’re a structural block - but I don’t think anyone wanted COVID patients to be ejected from hospitals in April 2020, because we understood they were victims of a natural disaster. So it’s not the structural block that’s the deciding factor. There’s the fact that they’re unvaccinated, which is both a character flaw and a medical vulnerability. The vulnerability would suggest that they’re *more* worthy of treatment, so clearly that’s not coming into play. \n\nSo you need to ask yourself: would you *actually* be comfortable with a system that allows hospitals to reject patients *not* based on their current condition, but on the character flaw that caused their condition? Do you think that the medical system should be trusted to make those sorts of judgments of character?\n\nIf personal character and responsibility are factored into triage, hospitals will be forced to make all sorts of difficult *moral* calls. What do we do with addicts, or people who contract severe STDs? Someone who attempts suicide? These are cases in which the ideas of personal responsibility and decision-making, viewed objectively, make the patient responsible for their condition. \n\nBasically, if we twist the rules of a system in a *knowingly unfair* manner simply because we understand the affected parties to be bad people, we would have to reckon with that systemic change. We can’t be like “character and responsibility are irrelevant to triage, except for in this one very specific context”.",
            "title_similarity": "0.7613901",
            "sentiment_compound": -0.9624
        },
        {
            "id": "h9x02u0",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9x0xpq",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x31xh",
            "score": 4,
            "text": "Patient triage should be left to medical experts",
            "title_similarity": "0.54977",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9x3cdp",
            "score": 0,
            "text": "I think it's not an exaggeration to say that humanity is in the midst of a tower-of-babel sort of crisis. We struggle to make sense of the world, there's two much information to effectively process. In this kind of environment people make mistakes, but there's no reason they should pay for them (potentially) with their lives. \n\nThe rise of social media with its echo-chambers and in parallel the erosion of trust in established institutions (in particular mainstream media and politics), are all social, not individual, phenomena. Yet they make it very difficult to make sense of complex issues and leads people to make bad decisions. \n\nIf instead of denying health-care we could try and address the underlying problem - how to help people make sense of the world - that would be better.",
            "title_similarity": "0.7136666",
            "sentiment_compound": -0.8685
        },
        {
            "id": "h9x3vto",
            "score": 0,
            "text": "So, our society now has placed a “morality” on vaccination status.  I’m not talking a religious one, etc., I’m talking about just a simple us-vs.-them morality.  A pseudo-caste system is developing in the minds of people and it is harming others much more than this virus.  While, yes, we do have some vaccines, (keep in mind that the vaccinated are getting sick with the variant and still being hospitalized), but we also have some cheap and very effective treatments available.  I know this from the personal experience of family and friends.  I’m not alleging any kind of conspiracy, I’m saying that vaccination is not our only, or even our “cheapest” option.",
            "title_similarity": "0.8284701",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9x58s7",
            "score": 0,
            "text": "I checked out after reading your edit. My significant other is an OR nurse and 90% of people in there are due to their shitty lifestyle choices",
            "title_similarity": "0.59214103",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9x66on",
            "score": 0,
            "text": "Same with women who use abortion as birth control, they should have the worst care, rookie doctors, most unclean hospitals with uncleaned medical equipment.   Because I disagree with their life choices.   Am I right?",
            "title_similarity": "0.8261645",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9x6mhc",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x84xh",
            "score": 0,
            "text": "Too generous still, they should be given no priority… \n\nUnvaccinated people should not be allowed to fill up hospitals. They put their health in “God’s hands” so go to your church or whatever… stop straining the system and causing innocent people to suffer because you can’t not be a selfish prick.",
            "title_similarity": "0.83665216",
            "sentiment_compound": -0.5181
        },
        {
            "id": "h9x877q",
            "score": 0,
            "text": "\"we have so many perfectly good vaccines against Covid\"  \nAll of which were developed in record fast time, and none of which have been thoroughly tested yet.  Go get your vaccine if you want and leave other people alone who have trepidation about this miracle vaccine.",
            "title_similarity": "0.79260194",
            "sentiment_compound": 0.9051
        },
        {
            "id": "h9x8n8e",
            "score": 0,
            "text": "They should be sent to field hospitals full of Google experts who did their own research.",
            "title_similarity": "0.47941795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9x95wo",
            "score": 0,
            "text": "As well as the least experienced, least educated, the freshest employee, and the lowest scutty denomiworker there. Help us help you. Or don't, and get treated like you treat yourself. I fully believe Veteran status should be for the sick and needy, not the selfish and wanty.",
            "title_similarity": "0.65199184",
            "sentiment_compound": 0.7144
        },
        {
            "id": "h9x97db",
            "score": 0,
            "text": "At least in my state people cannot donate blood if they have been vaccinated with COVID-19.  If you're donating blood You're doing more than most people and should be given priority if anything.",
            "title_similarity": "0.8416257",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9x9axb",
            "score": 0,
            "text": "If you think the records of this are comprehensive and accurate, you're just wrong. \n\nSo basically, there's literally no way to do what you want that doesn't end up \"deprioritizing\" some percentage of people who actually *did* get vaccinated... \n\n...or, for that matter prioritizing unvaccinated people who were dishonest enough to have forged or black market vaccination cards. Which is actually possibly the *worse* problem. \n\nIt might or might not be a valid thought... It's just a completely unfeasible one to actually do in a way that doesn't generate *massive* liability for hospitals if they're wrong... and they will sometimes be wrong (in both directions).",
            "title_similarity": "0.8056605",
            "sentiment_compound": -0.9517
        },
        {
            "id": "h9x9lzr",
            "score": 0,
            "text": "A hospital isn’t supposed to judge any choices at all when treating patients. Priority is assigned based on need-most serious cases get the most resources. Prisoners, drunk drivers, lightning strike victims, the homeless, drug addicts, obese people, all have equal opportunity for treatment. For them to be treated differently would mean that someone in the hospital would have to use bias to prioritize one population over another. Wouldn’t that clearly be more unethical than just helping those most in need, which is a hospital’s express purpose? I get that it boils your blood, as I’m sure it does most nurses, techs, therapists, doctors, etc. But that’s still not what a hospital is for and it shouldn’t start here either",
            "title_similarity": "0.8702321",
            "sentiment_compound": -0.3955
        },
        {
            "id": "h9xcg05",
            "score": 0,
            "text": "agree, but I would exempt the African American community from this. their distrust of the medical community is deserved.",
            "title_similarity": "0.7020614",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h9xdj6t",
            "score": 0,
            "text": "My wife can't get a TUMOR removed from her uterus because of these motherfuckers not here to change you're view just to tell everyone attempting to to eat my turds.",
            "title_similarity": "0.8090884",
            "sentiment_compound": 0.4071
        },
        {
            "id": "h9xdjzx",
            "score": 0,
            "text": "Not going to change your view, just to point out that’s not how Western medical ethics or ethics based on Western classical liberalism works. However, that is exactly how medical ethics based on founding principals of National Socialism works. Not saying you’re wrong, just that you’re aware of the moral foundation of your position.",
            "title_similarity": "0.6954747",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h9xdmjn",
            "score": 0,
            "text": "I don’t think your answer to the obese/smoker/alcoholic argument works. You’re saying that it’s *easier* to get a shot than to make the lifestyle changes necessary to prevent diabetes, obesity, heart disease, etc; but I don’t think it’s a question of what’s easier to *do* but a question of what’s easier to *know.*\n\nPeople don’t know if getting the vaccine is the right choice or not. The vaccines are still not FDA approved (as of today at least,) and people are unsure what the consequences of getting vaccinated will be.\n\nPeople with obesity/diabetes/heart disease/etc, on the other hand, generally knew all along that their lifestyle choices were unhealthy. We know that having a diet high in saturated fat or sugar, smoking, and not exercising leads to disease, and we’ve known this for a lot longer than the vaccines have even been around.",
            "title_similarity": "0.775722",
            "sentiment_compound": 0.6599
        },
        {
            "id": "h9xdsfj",
            "score": 0,
            "text": "> fixing all of those conditions entails significant lifestyle changes as opposed to vaccination, which is a one-off event.\n\npoor argument. one can argue quitting is a one-off event, and health effects of a vaccine could last a lifetime. we honestly dont know the long term effects of the vaccine. we cant possible know until the time has passed. \n\nthat said, some hospitals are going to put unvaccinated people at the end of the wait lists. some projections put this delta variant as getting really bad. much worse than it has been...mainly because the stupid ass government pushed people off of unemployment and into contact with the public, while also telling people they dont need to wear masks anymore.",
            "title_similarity": "0.85295737",
            "sentiment_compound": -0.9646
        },
        {
            "id": "h9xdvqo",
            "score": 0,
            "text": "\"people who don't agree with me deserve to die\"\n\nNo everyone no matter if it's a terrorist that just blew up a kindergarten should get the best medical help they can and that is available. If unfortunately they make it that far.\n\nDoctors swear an oath for a reason.",
            "title_similarity": "0.80073583",
            "sentiment_compound": -0.778
        },
        {
            "id": "h9xdwv1",
            "score": 0,
            "text": "Shouldn't obese people, drug addicts, alcoholics or smokers be the lowest priority? You claim that the choices unvaccinated people is on them and they should suffer the consciences but that is far more true of smokers drug addicts, alcoholics and obese people. \n\nThe aforementioned groups are a constant burden on the healthcare system constantly draining resources unnecessary and are all more susceptible to covid than anyone who makes good lifestyle choices. Why should someone who eats right and exercises regularly be a lower priority than someone who constantly poisons themselves? It makes a certain level of sense to not want to take an emergency drug that hasn't gone through the proper testing due to a lack of time if you're not in an at risk group and if you just happen to lose the genic lottery and covid hits you particularly hard I don't see why you should be lower priority than someone who constantly poisons their body and even if they survive covid are just going to OD, or die of a heart attack or lung/liver cancer next week or year because of their horrific life choices.",
            "title_similarity": "0.7872644",
            "sentiment_compound": -0.9928
        },
        {
            "id": "h9xefca",
            "score": 0,
            "text": "Something I haven't seen mentioned here is people being disinformed. Most people know someone who isn't vaccinated. Some have degrees, and good jobs, and are smart people. But they still fall for the disinformation and buy it whole heartedly. To me there's a clear line between someone caught up in disinformation and someone peddling that disinformation for gain. \n\nUnfortunately humans aren't always programmed for rational, logical action. There's more information and content out there than ever. And better and better algorithms to figure out what gets you to click and serving you more of that. People should get vaccinated. It's frustrating we're in this spot because people refuse to. But I don't think we should just start letting people die because they were given bad information.",
            "title_similarity": "0.68805015",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h9xepx7",
            "score": 0,
            "text": "This really makes no sense.  You want to deny unvaccinated purple healthcare because they are taking resources from vaccinated people but you claim obesity, drugs use etc “doesn’t affect other people.”  How does unduly deflecting healthcare resources from others not affect others?  This “view” is just a veiled way to say you want to punish people when convenient for you.",
            "title_similarity": "0.8175378",
            "sentiment_compound": -0.7535
        },
        {
            "id": "h9xgi3l",
            "score": 0,
            "text": "Refusal to take a Vaccine should exclude you from hospital care period!. Go home, Hug your gun and bible wrapped in your confederate flag and good luck!",
            "title_similarity": "0.719347",
            "sentiment_compound": 0.8585
        },
        {
            "id": "h9xgog2",
            "score": 0,
            "text": "Trying to maintain a healthy and balanced lifestyle is more difficult than getting two shots. \n\nDifficulty in maintaining a healthy lifestyle and diet, and being obese, are issues that are way more mental than they are physical. \n\nCovid is a disease. People who refuse to get vaccinated are people who consciously make a straight-up decision to say, \"Yeah nah I'm not doing this,\" either because they're stupid or believe in conspiracy theories, and are indirectly helping the transmission of the virus.\n\nNow, I do not think that being stupid is considered a mental issue. Being stupid and ignorant is a choice. It's not comparable to addiction and all mental health issues.",
            "title_similarity": "0.808657",
            "sentiment_compound": -0.9286
        },
        {
            "id": "h9xgtk0",
            "score": 0,
            "text": "If the vaccine is supposed to at least be effective enough to not put you IN a ventilator… why wish anyone else a lesser priority when their lives are at stake?",
            "title_similarity": "0.72602165",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h9xhs6z",
            "score": 0,
            "text": "Not FDA approved and brand new technology. More people die of cancer and hear disease a year separately than covid. So would you like to have a non FDA approved drug that is brand new technology forced upon you for cancer and heart disease, two diseases which affect similar age groups as covid? Because i sure as hell wouldn’t",
            "title_similarity": "0.74390227",
            "sentiment_compound": -0.9161
        },
        {
            "id": "h9xifia",
            "score": 0,
            "text": "I am voluntarily unvaccinated but I always take all precautions possible (e.g. wearing masks everywhere I go, keeping at least 6 ft from everyone, not going out unless absolutely necessary like for groceries or other medical appointments and staying home at all other times). I have my own reasons for not trusting the vaccine relating to terrible experiences from medical professionals and the medical research field that have made me question their honesty. I also have chronic illnesses that may or may not give me long-term side effects from these very new vaccines. There’s a reason that vaccines normally take around a decade or more for approval and no legislation can change science. \n\nI understand damn well that the pandemic is completely real and not some “conspiracy.” I come from a culture that is very accepting of mask-wearing,  so it’s not at all politically controversial to me. So if I get infected from the rare occasion that I go out (or get my mail) despite taking all the precautions possible, why should I be blamed? Additionally, people who are fully vaccinated can still infect others (and still get infected themselves, albeit more likely with less severe symptoms). So if you think you’re invincible and no longer have to take precautions and stop wearing masks or social distancing just because the government “allows” you to, and you end up infecting other people, that’s still on you. \n\nNow, I share your frustration with the anti-maskers and COVID deniers who refuse to do anything to avoid spreading COVID-19 to others. While I also think they’re less deserving of medical attention than those of us who take this pandemic seriously, they’re not the only kind of people who are voluntarily unvaccinated and there are more reasons to not get vaccinated than just not giving a fuck about other people’s safety. \n\nI know that it’s a double edged sword where I could risk suffering complications from either COVID-19 or from the vaccine, but I just cannot bring myself to trust such a new vaccine and that’s my own decision to make with the bodily autonomy that I have the right to. In the meantime, I’m taking all the same mandated precautions (and more) that I’ve been taking since before the vaccines became available. I’ll happily take it in 20 or so years when enough time has passed to see how it really affects people long-term.",
            "title_similarity": "0.85398835",
            "sentiment_compound": -0.9587
        },
        {
            "id": "h9xix5p",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xj22h",
            "score": 0,
            "text": "People in need of emergency medical help need it faster than it takes to assess whether they deserve to live or not.\n\nAlso, playing God / deciding who lives and who dies is generally frowned upon because people are fallible and make wrong judgements constantly.\n\nMore evil would be done than a system like than one that helps all regardless of value judgements.",
            "title_similarity": "0.783693",
            "sentiment_compound": -0.5572
        },
        {
            "id": "h9xj5d5",
            "score": 0,
            "text": "But it’s never are clean cut as Person with 4th McDonald’s has 7th heart attack and person having their first has none. \nIn the real world it will be the person without McDonald that would be having the 7th vs person with 4th McDonald’s having their first heart attack. How do you choose?\n\nI don’t agree that hospitals normally don’t have to prioritise. Every hospital the world over prioritise every single day.",
            "title_similarity": "0.76075685",
            "sentiment_compound": 0.7835
        },
        {
            "id": "h9xj6gl",
            "score": 0,
            "text": "We should give the same  consideration to obese people or smokers.  They made themselves sick on purpose.  We should make OD patients wait in the waiting room, they OD'd themselves.  If your like 90 or over you shouldn't go to the hospital at all. They've lived long enough. See where I'm going. You can't prioritize healthcare that way. If you did nobody would only get care or only rich people.",
            "title_similarity": "0.838117",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h9xj9qt",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xjsby",
            "score": 0,
            "text": "As long as they are paying equal amount of taxes, they should be granted same level of services that are financed by said taxes.\n\nIf hospitals are not refusing to treat lung cancer in smokers, or sexually transmitted diseases in sex workers, or diabetes in obese, they shouldn't refuse treatment in other areas.",
            "title_similarity": "0.71301115",
            "sentiment_compound": -0.3637
        },
        {
            "id": "h9xjx2p",
            "score": 0,
            "text": "As much as I want to agree with you I'm going to go with the slippery slope argument but in a different way.  \n\n- Do we refuse care to someone who  thought they could jump off their roof for laughs?  \n\n- Do we refuse care for someone trying to bomb a hill on a skateboard even though they dont have the skill level for it? \n\n- Do we refuse care to someone in a motorcycle crash even though they were not wearing a helmet/gear?  \n\n- Do we refuse care to those who tried to emulate stuff you would see on Jack ass? \n\n- Do we refuse care for someone who was going way to fast in a car and crashed?\n\nAll of those are one off decisions that unlike being obese/smoking/addiction are not major lifestyle changes.  They all involve being a dumbass where common sense should have been present and it wasn't.   So if we can deny or delay care for someone just because they were stupid where does it end?  \n\nWhen denying care/delaying treatment who gets to decide what is and is not stupd?  Did they jump off a roof?  Were they drunk?  If they were drunk are they an alcoholic who falls into your category of \"major lifestyle changes?\"   Do you take into account how they were raised and if this behavior was taught to them?  Do you call their family physician to get the answers to these questions while they are bleeding out in the ER? \n\nThat is why its a slippery slope.  \n\n***********************\n\nSecond reason... there have been more than a few people who got the delta variant, were anti-vax, were cared for and then went public to say they were wrong and everyone should get vaxed.  \n\nYes it falls into the \"until it happens to them\" category but their stories will get more and more people to get the vaccine.  They wont change everyone's minds but some of the survivors can end up being allies in the end.",
            "title_similarity": "0.675555",
            "sentiment_compound": -0.9521
        },
        {
            "id": "h9xkae6",
            "score": 0,
            "text": "I think the major issue here is lack of trust in the government, and personal experience. I have been misdiagnosed 4 times with mental illness. I have been treated for adhd with adderall despite a history of addiction, and was hospitalized 3 times for related issues. I do not believe the vaccine is some tracking device, or some sort of chip, yet I reacted badly to medications created over 30 years ago. Also, I have had COVID. I got over it in a week, maybe it’s cause I’m young. Regardless, you shouldn’t worry about the people not getting vaccinated. For one, those vaccinated are protected, so you should be good if you run into a few people with COVID. Secondly, those who don’t trust enough to GET the vaccine likely won’t want to be “treated” by the very people they don’t trust. Thirdly, you know the vaccine is gonna start requiring a booster shot every 6 months or so? Also, you can still pass COVID on if you’ve been vaccinated, therefor it can mutate regardless of whether people are vaccinated. “FDA approved” means nothing to me. Look at the foods that have been approved by the FDA? The FDA is a joke. Oh and if you’ve had COVID, you’re also protected for months after. I believe we have immune systems for a reason, and if modern society fails for any reason, or if a new virus comes into existence, then our immune systems will have been broken by taking something for every little thing. We evolve through disease, and we have become very stagnant a society indeed.",
            "title_similarity": "0.7211104",
            "sentiment_compound": 0.9146
        },
        {
            "id": "h9xkxy9",
            "score": 0,
            "text": "Science may be infallible, but it is interpreted by humans who are not.",
            "title_similarity": "0.36242646",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xlhof",
            "score": 0,
            "text": "Exactly the opposite. It's the vaccinated that are spreading the virus.\n\nhttps://americasfrontlinedoctors.org/frontlinenews/immunization-expert-unvaccinated-people-are-not-dangerous-vaccinated-people-are-dangerous-for-others/",
            "title_similarity": "0.7373722",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xmcp5",
            "score": 0,
            "text": "Sorry you are wrong.\n\nThey should be rejected entirely. The party of personal responsibility needs to face some consequences.",
            "title_similarity": "0.5223343",
            "sentiment_compound": -0.575
        },
        {
            "id": "h9xmlbv",
            "score": 0,
            "text": "Agreed, let them die.",
            "title_similarity": "0.21587828",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9xniov",
            "score": 0,
            "text": "> it’s a one-off event\n\nIt’s not a one off event, for the majority of people it’s currently a two-off event with boosters coming soon. \n\nAdditionally, unless you are not only speaking about COVID, there are substantially more vaccinations that people should have. \n\nOther point: for critical care/intubation, finding out what the patient’s vaccination records are is probably time better spent intimating them/giving them the care they need but I don’t actually know how long this would take.",
            "title_similarity": "0.72187996",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9xnpz4",
            "score": 0,
            "text": "Makes sense since all the people needing beds ventilatiors are going to be not vacancinated, right...",
            "title_similarity": "0.767801",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xo4xu",
            "score": 0,
            "text": "Other commenters have brought up analogies using other “unhealthy” behaviors in order to get you to concede that this type of policy would have bad consequences. They’re not wrong, but they are forgetting the point. Our system relies on people, all people to get the treatment they need, without prejudice.\n\nImplementing a system where now people are given priority/have priority taken away brings up one glaring problem: who makes this decision? The hospital? The government? Moreover, what about those who cannot receive vaccines due to health issues? What about those who do not take the vaccine due to religious reasons? \n\nEssentially, implanting this policy is opening a can of worms that I don’t think you’ve thought out. I get you’re mad about vaccine hesitant folks, but policies like this give off serious authoritarian undertones.",
            "title_similarity": "0.82518697",
            "sentiment_compound": -0.7529
        },
        {
            "id": "h9xoitg",
            "score": 0,
            "text": "Having been the  victim of vaccine reaction cover-up I don't trust the vaccines.\n\nSo, are you willing to take personal responsibility for all negative reactions to the vaccines? If not, then shut the hell up.",
            "title_similarity": "0.7798742",
            "sentiment_compound": -0.936
        },
        {
            "id": "h9xowy6",
            "score": 0,
            "text": "Should be very simple, if you can’t maintain a healthy lifestyle then you don’t deserve a bed if your actions contribute to your health problems. PERIOD",
            "title_similarity": "0.72092223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xozj1",
            "score": 0,
            "text": "I mean your debate is literally not even up for debate as refusing treatment for someone is a direct violation of the hippocratic oath and various state and federal laws. Do you propose all of these laws and guidelines be broken because you don't approve of people's decisions? \n\nOf more importance is the demographical breakdown of people who aren't getting the vaccine. The media likes to portray this as a bunch of white republican anti vaxxers but the reality is that a large portion of the unvaccinated are black and Hispanic individuals. These are groups of people that are already at significantly higher risk of infection due to being in jobs that don't offer WFH, living in multi generational housing, and a very high rate of diabetes, obesity, etc.\n\nCouple all that with the US government having well known instances of purposely infecting and testing experimental injections (via vaccines) specifically on minorities, lower average education levels among minorities and I have to say your viewpoint goes from being woefully misguided and ignorant to being downright evil and essentially a form of eugenics. Treatment should never be withheld for any reason. A doctors job is to treat people not be a judge and jury.",
            "title_similarity": "0.8497412",
            "sentiment_compound": -0.9232
        },
        {
            "id": "h9xp2yj",
            "score": 0,
            "text": "same with everyone with severe illness, diabetes, and especially the obese, as obese people are 75% of all hospitalizations.  so looks like most of reddit is at severe risk of death with your plan.",
            "title_similarity": "0.5960134",
            "sentiment_compound": -0.8785
        },
        {
            "id": "h9xp87l",
            "score": 0,
            "text": "No. Priority should always go to those who are in the worst situation, no matter what. Doctors don’t get to pick and choose who they treat because they don’t agree with that person’s choices. That’s disgusting and could set a very dangerous precedent",
            "title_similarity": "0.8190152",
            "sentiment_compound": -0.7761
        },
        {
            "id": "h9xphyr",
            "score": 0,
            "text": "I pay shitload money over my whole life for hospital insurance. I could pay whole house with those money so I think I can get things I'm paying for right?! Insurance is not optional at our country and it's fucking expensive.",
            "title_similarity": "0.64495265",
            "sentiment_compound": -0.2714
        },
        {
            "id": "h9xq2nk",
            "score": 0,
            "text": "Legitimately, let them die.",
            "title_similarity": "0.31683403",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9xq4jj",
            "score": 0,
            "text": "I would think everyone's health insurance would be the forceful one in this whole thing. Positively like a discounted rate for being vaccinated or negatively like charging more for unvaccinated.  Do health insurance companies make the same money either way or am I missing something?",
            "title_similarity": "0.663761",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h9xqamq",
            "score": 0,
            "text": "The precedent is already there with organ transplants, I'm game",
            "title_similarity": "0.41901815",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xr7vi",
            "score": 0,
            "text": "The vaccines do not prevent infection or transmission, and the claim that is reduces symptoms is dubious as the vast majority of positive cases in 2020 were mild or asymptomatic.\n\nAt this point, getting the vaccine is like taking antihistamines for hay fever. You can take them to reduce symptoms or you can just suffer through it. Either way, you're going to get hay fever again in the future.\n\nThe simple fact is these vaccines are still in clinical trials. Leaked documents clearly state that the efficacy and risk of side effects are still unknown. Data regarding these issues is being suppressed or misrepresented by the manufacturers.",
            "title_similarity": "0.7819914",
            "sentiment_compound": -0.1714
        },
        {
            "id": "h9xr942",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xrhn9",
            "score": 0,
            "text": "True, but... Idk healthcare execs make so much damn money that I'd they gave themselves a payout they could totally be staffing departments appropriately so that one nurse doesn't have to do the job of 6 nurses. Antivaxers are a huge issue but I think greedy execs are an even bigger one. Or maybe the two are equally as bad.",
            "title_similarity": "0.72902334",
            "sentiment_compound": -0.8562
        },
        {
            "id": "h9xrjpg",
            "score": 0,
            "text": "CMV: You didn't come here to have your view changed. Your mind is not open to the matter at all.",
            "title_similarity": "0.49059433",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9xrovi",
            "score": 0,
            "text": "I have the vaccine, and when my employer (I work in IT in healthcare) offers me a booster I will take that as well.\n\nThat being said, vaccinated people are catching the original and the delta strain of Covid.\n\nMasked people are catching the original and delta strain of Covid.\n\n\nGiven this, and the spread of the delta variant, I cannot support at all what you are saying here.\n\nChoosing for people to die because they didn’t take a vaccine that causes some side effects and that does not confer immunity is a bad look.",
            "title_similarity": "0.83572555",
            "sentiment_compound": -0.6551
        },
        {
            "id": "h9xrzeq",
            "score": 0,
            "text": "Honestly I hope you burn in hell",
            "title_similarity": "0.33278906",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9xsek6",
            "score": 0,
            "text": "\"Children who voluntarily do dangerous things and injure themselves should be given the lowest priority in hospitals, because it's their own fault.\"\n\n\"People who voluntarily get in cars and drive should be given the lowest priority in hospitals if they have a crash; they know the risks\"\n\nWhere does it end?  Medical care has to take those who are medically highest priority first, and impartially, otherwise a) where does it end? b) you're putting doctors in an untenable position and c) you're most probably wasting time and resources that could be spent on time-critical patient care on working out vaccination status (unless, ya know, you want to give people some kind of govt mandated permanent marking to prove it, maybe a number tattooed on the arm, or something...).",
            "title_similarity": "0.81544024",
            "sentiment_compound": -0.879
        },
        {
            "id": "h9xt7q5",
            "score": 0,
            "text": "I don’t think people indoctrinated by propaganda and echo chambers from far right media deserve to die for being ignorant and misguided. Human life should be valued equally no matter what in my opinion.",
            "title_similarity": "0.7509557",
            "sentiment_compound": -0.6782
        },
        {
            "id": "h9xt7zx",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xt9hn",
            "score": 0,
            "text": "sick people seeking care should not be de-prioritized for not taking a drug they believe to be potentially harmful. even if you assume them to be idiots, being stupid shouldnt be the basis for de prioritization. \n\nthis is anecdotal but the most common thing i hear from vaccine hesitant people is that these vaccines were rushed; which they were. they were produced in world record time compared to any other vaccine humanity has ever made. i can't in good conscience support that a vaccine hesitant person who thinks the vaccines are rushed and/or are potentially harmful be denied healthcare over someone who was vaccinated. i think normal prioritization should apply.",
            "title_similarity": "0.8728755",
            "sentiment_compound": -0.8644
        },
        {
            "id": "h9xtc5e",
            "score": 0,
            "text": "'Perfectly good vaccines'\n\nYou have NO WAY of knowing that. There is NO LONG TERM DATA.",
            "title_similarity": "0.59623194",
            "sentiment_compound": 0.3036
        },
        {
            "id": "h9xtef2",
            "score": 0,
            "text": "We should also prioritize those who contribute more towards Medicare, as well.",
            "title_similarity": "0.39701778",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9xtjd6",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xtn80",
            "score": 0,
            "text": "... and what would you do if in 10 years every vaccinated people will need a hospital bed ... the same treatment ?",
            "title_similarity": "0.49673945",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xtyv0",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xuck0",
            "score": 0,
            "text": "So the hospitals are caring for vaccinated people that have Covid? There are so many that unvaccinated people shouldn’t get help? I am vaccinated but according to this it seems like the vaccinations are not all that effective or there would be plenty of room and care for unvaccinated patients. Makes me wonder?",
            "title_similarity": "0.8165219",
            "sentiment_compound": 0.8275
        },
        {
            "id": "h9xuynr",
            "score": 0,
            "text": "Covid long haulers are in a bad spot....",
            "title_similarity": "0.39020258",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9xvbzb",
            "score": 0,
            "text": "no just higher insurance rates. No hospital should ever give anyone less care due to personal choices.",
            "title_similarity": "0.7915834",
            "sentiment_compound": -0.1263
        },
        {
            "id": "h9xvixp",
            "score": 0,
            "text": "This would further segregate POC and exclude them from medical treatment. Not a great plan, but I understand where you are coming from for sure.",
            "title_similarity": "0.6950536",
            "sentiment_compound": 0.0908
        },
        {
            "id": "h9xvlgv",
            "score": 0,
            "text": "And people wonder why people on the right were bringing up, \"death panels\".",
            "title_similarity": "0.4529745",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9xvstx",
            "score": 0,
            "text": "Vaccinated people shouldn’t  need hospital beds",
            "title_similarity": "0.6760167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xw0vw",
            "score": 0,
            "text": "All good, are you following the news out of Israel? The vast majority of new infections and hospitalizations are amongst the fully vaccinated. They are a few months ahead of the curve when it comes to Vaccination and one of the highest vax rates in the world. They are the canary in the coal mine, why would it be any different here? You'll be soon required to vaccinate every 6-8 months, are you OK with that?",
            "title_similarity": "0.6109008",
            "sentiment_compound": 0.7486
        },
        {
            "id": "h9xw6pg",
            "score": 0,
            "text": "People of color have significantly lower vaccination rates so this is really just a racist idea",
            "title_similarity": "0.6445209",
            "sentiment_compound": -0.7553
        },
        {
            "id": "h9xw8fq",
            "score": 0,
            "text": "But this implies that there are many people who WERE vaccinated that will need those beds and ventilators.  If getting the vaccine still leads to a high chance of needing those things, don’t be surprised when vaccine skeptics aren’t totally convinced of efficacy.",
            "title_similarity": "0.7365011",
            "sentiment_compound": 0.8042
        },
        {
            "id": "h9xw92y",
            "score": 0,
            "text": "I firmly believe that healthcare should be denied to no one… BUT",
            "title_similarity": "0.6745558",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h9xwe59",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xwjrb",
            "score": 0,
            "text": "It doesn't matter who is dying, more deaths from this panini will result in more stress to our economy and society. Yes unvaxxed folk are frustrating but many of them are in world of misinformation fed to them from their friends and family, it is in misinformation that they feel safe and compassionate communication is necessary for that to change the slightest.",
            "title_similarity": "0.7847965",
            "sentiment_compound": 0.7365
        },
        {
            "id": "h9xwt6m",
            "score": 0,
            "text": "See, this falls under the line of reasoning that \"Healthy people should be prioritized for healthcare\" It blames the victim. These people are victims of a lifetime of indoctrination and disinformation. The people and groups they grew up trusting are the very ones giving them these worldviews.\n\nMedical professionals are there to save as many lives as they can, and on paper, it shouldnt matter if you made the choice that got you in the hospital, just whether they can put you back together. \n\nWe don't turn people away from emergency rooms, because they tried to do a stunt on a bike and broke their arm, or prioritise someone who has a less-immediate injury, just because the biker got himself into that mess.  Currently, people who are vaccinated are suffering less from  the effects of positive cases, and that unfortunately means that yes, the \"idiots\" out there are probably going to get treatment pretty quickly.\n\n&#x200B;\n\nAnd just remember. All these idiots are people too, with families who care about them, people who will lose a part of themselves when they die. Parents who will outlive their kids, and kids who will grow up orphaned. Like it or not, it's our societal duty to try to protect people who make bad decisions, and to teach them where they went wrong.",
            "title_similarity": "0.8301403",
            "sentiment_compound": -0.7576
        },
        {
            "id": "h9xydfj",
            "score": 0,
            "text": "Lol OP is a terrible person, especially if you read their replies in the thread.",
            "title_similarity": "0.5364084",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h9xyhbv",
            "score": 0,
            "text": "Some people choose not to vac because of the risk of side effects. It’s proven that it takes over 7 years to have an effective vac and it’s also proven that you can still get Covid 19 with the vac whether the new strand or not. Example my job offered free vac and within a week over 20+ people were positive and sent home and one died. Sorry not sorry. My body my choice.",
            "title_similarity": "0.68606913",
            "sentiment_compound": 0.6395
        },
        {
            "id": "h9y07pe",
            "score": 0,
            "text": "People think like you do here, and it's scary.",
            "title_similarity": "0.3077752",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9y2gkb",
            "score": 0,
            "text": "You want to create a world in which medical treatment is withheld from people unless they take experimental drugs? That's an interesting precedent to try and set. I'm sure that won't end badly.",
            "title_similarity": "0.6874387",
            "sentiment_compound": 0.8383
        },
        {
            "id": "h9y600d",
            "score": 0,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.  We will try and do this quickly so discussion can continue though the amount of time will vary based on moderator availability.\n\nThank you for understanding.",
            "title_similarity": "0.6779922",
            "sentiment_compound": 0.2066
        },
        {
            "id": "ha1i7hn",
            "score": 0,
            "text": "Since medical and cultural ethics make it prohibitive to deny medical care, responsibility might be satified by not having government or insurance pay for the medical bills until the persona has exhausted all assets. I would also support legislation to remove their right to vote or own/possess firearms until all debts are paid.",
            "title_similarity": "0.79146934",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha1unku",
            "score": 0,
            "text": "the biggest problem I have with this is, shouldn't the reverse be true as well?  If it's unfair for an anti-vax person to take up a hospital bed, then shouldn't it be also unfair for an anti-vax person, who are likely the people providing valuable contributions to the economy, to pay or support people for staying home and doing nothing at all - such as the stimulus payments? \n\nI would argue that by paying for others who ARE afraid of the virus to be able to stay home and avoid it, anti-vaxers justify their right to medical treatment.",
            "title_similarity": "0.8469573",
            "sentiment_compound": -0.5514
        },
        {
            "id": "ha21p3k",
            "score": 0,
            "text": "Seeing that medical error is the third most common cause of death in the untied States, I see little downside to being given lowest priority for medical care.",
            "title_similarity": "0.67002887",
            "sentiment_compound": -0.7722
        },
        {
            "id": "ha23pzt",
            "score": 0,
            "text": "It's like smokers who refuse to stop smoking should be on low prio, same goes for accidents due to alcohol. A total nonsense",
            "title_similarity": "0.72961015",
            "sentiment_compound": -0.807
        },
        {
            "id": "ha37xmf",
            "score": 0,
            "text": "I know right! So many obese people are taking up CCU! we should also deny them beds, like god damn just stop eating. I hope they introduce BMI passports after the covid vaccine ones.",
            "title_similarity": "0.76709855",
            "sentiment_compound": 0.1984
        },
        {
            "id": "ha3a1p1",
            "score": 0,
            "text": "Why hasn't this been taken down? Clearly the op is not of open mind and is solely seeking validation for their own beliefs.",
            "title_similarity": "0.59903723",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha4fe58",
            "score": 0,
            "text": "Yes, we should also refuse treatment to people who didn’t wear their seatbelts in a car accident",
            "title_similarity": "0.6434761",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ha6m04l",
            "score": 0,
            "text": "The issue though with some is is how effective or ineffective. The third booster thing, for example, suggests that the original wasn't as effective. The logic some use is \"if we have to get a new one every 4 months, it's easier just to use a mask until a more effective one gets made\" argument\n\nThe only vaccine I know of that has been effective against all variants with no side effects is the Russian one.",
            "title_similarity": "0.7157143",
            "sentiment_compound": 0.7869
        },
        {
            "id": "hab3wa8",
            "score": 0,
            "text": "This is the equivalent of saying restaurants shouldn’t feed people who didn’t eat breakfast.",
            "title_similarity": "0.6863216",
            "sentiment_compound": 0.0
        },
        {
            "id": "had2f78",
            "score": 0,
            "text": "This is one of the problems you get when you socialice health care. People should be responsible for their actions.\n\nWhat do you do with people that's overweight?What do you do with people that stays inside their house and develops a D vitamin Deficiency?\n\nThis 2 factors alone are bigger indicators on wheter you will develop complications and transmit the virus than being vaccinated.\n\nDo we mandate exercise and sun for everyone? Stop eating processed food wich develops metabolic syndrom and leads to obesity?\n\nI think people should stop poiting the finger and telling others what to do, they are abusing the fact that most of the people don't like to point fingers.  \n\n\nAlso, MY main problem with the vaccine is another one.   \nI don't care if it works or not, there's already extremelly well studied drugs and incredibly more cheap than the vaccine with WAY more studies on figthing the virus than this vaccines. It's insane.  (Check the podcast from joe rogan and eric weinstein where they speak about this, they cite all the studies).\n\nThe whole vaccine thing just seems to be a way to handle very very large amounts of money to some companies.",
            "title_similarity": "0.76238585",
            "sentiment_compound": -0.9081
        },
        {
            "id": "had9rf9",
            "score": 0,
            "text": "That's an awful question. Everyone should get healthcare, it's a human right.",
            "title_similarity": "0.62600565",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hafdlrm",
            "score": 0,
            "text": "Well I wouldn't call it a conspiracy. People have reasonable suspicion to believe that this thing is not what it advertised as. For one this is the only vaccine in history they want you to have in the worst way incentivizing so many things, just to get it. Two, we dont wanna take this thing because its got no track record. It hasn't been out very long nobody knows what happens in the long term with this thing. Honest to God I hope I'm wrong about this vaccine. If your not skeptical and you can't see a sinister silhouette behind the CDCs, FDAs, and Democratic and Republican party's curtain then I'd fear for your survival. I dont get the blindy trusting doctors and scientist because of their profession there's institutions these folks work for. I know doctors, and nurses and anybody in Healthcare means no harm by recommending this thing. I dont personally believe anyone who has already taken this vaccine has given anythought as to what could happen in the future with this thing. I sure as hell dont wanna find out.\n\n[Note] My sister has been working in the covid ward since the height of the pandemic, and because of the information that's being spread in those hospitals just told my father yesterday that she will no longer come and see any of us. Now I'm sure that makes alot of people happy, and a kind of (good for you, fuck off antivaxxers) sort of stigma. But to me if you can't see that we're being pinned against each other based on if we get a shot or not, then you need to stop watching the news, and open your eyes.",
            "title_similarity": "0.86800194",
            "sentiment_compound": -0.1072
        },
        {
            "id": "hafx4o6",
            "score": 0,
            "text": "And when this disaster is done and we move onto the next, who's to say we won't move down the relevant list. I don't like my chances.",
            "title_similarity": "0.60555154",
            "sentiment_compound": -0.8214
        },
        {
            "id": "hahsiku",
            "score": 0,
            "text": "Mmmm idk. Ideally thats like saying if a woman chooses not to get a hpv shot and finds out later that she has some form of ovarian cancer that the shot could of prevented should be treated less of a priority.\n\nThe point of the example is when a person goes to school to be a doctor the goal if anything is treatment, not mistreatment.\nContrary to your belief this opinion would put plenty if legal suits against the hospital’s.\nContrary to your belief there are people from other countries that do not even have a vaccine \n(look them up) and if they were to become ill before receiving a shot i find it malice to go well thats life die now. \n\nI  attended college where my college requires students from aboard to have been vaccinated and i have come across a few where they had to do it here instead of in there country.\n\nI don’t believe they deserve to be low priority due to the fact they are unvaccinated or chose to come here and do it…or chose to wait to do it….\nor couldn’t find time to do it…\nor didn’t want to wait in line around a bunch of unvaccinated people to get one.",
            "title_similarity": "0.7773223",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hakt8b6",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "hal2m0z",
            "score": 0,
            "text": "So you're saying that people should get quadruple jabbed because it takes less time than actually taking care of themselves? If most symptomatic infections happen in obese people, then obese people are super spreaders. So not only are they taking up ICU with heart disease (since over 600k die of heart disease every year: https://www.cdc.gov/heartdisease/facts.htm), they are also taking up covid beds (https://www.cnbc.com/2021/03/08/covid-cdc-study-finds-roughly-78percent-of-people-hospitalized-were-overweight-or-obese.html). \n\nI think its time to deny the gestapo logic. Being obese is the number one risk factor for symptomatic covid. Those who die from covid have a total of 4 co-morbidities (https://www1.racgp.org.au/newsgp/clinical/study-identifies-four-main-comorbidities-associate) 3 of the 4 of those are entirely preventable, with the exception of Type 1 diabetes. \n\nSo, if the main cause of hospitalizations and deaths from covid are in obese people and those with three or more comorbidites that are pretty preventable, then you're saying that really, the hospital should treat no one. Which is fine. They do a shit job anyways.",
            "title_similarity": "0.73289114",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hal77dw",
            "score": 0,
            "text": "Same, but for those who are voluntarily obese.",
            "title_similarity": "0.18185106",
            "sentiment_compound": 0.0
        },
        {
            "id": "halqe0a",
            "score": 0,
            "text": "What is your BMI?",
            "title_similarity": "0.027560312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hao73p5",
            "score": 0,
            "text": "Okay. As an unvaccinated person (I had covid in January so I have the antibodies) I'll accept this. But using this logic, obese people, smokers, heavy drinkers, and addicts should also be at the back of the queue. I mean, I lift weights 6 hours a week and run 3 miles a day, when I work hard to stay healthy why should they get priority treatment when they care so little about their health?",
            "title_similarity": "0.70325035",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hapnkwm",
            "score": 0,
            "text": "Disgusting take, you should be ashamed tbh. You would like to see sick people die purely for political reasons, because they disagree with taking an unproven experimental vaccine. Conspiracy theories aside no one should get mad over the fact that people dont want to take the vaccine and people who share your POV should try to understand that rather than thinking you are morally superior for taking a vaccine that is less than 40% effective at this point. Realize that there are bigger things to worry about than covid. If its a big deal to you than you get the vaccine dont try to come after others who would rather not take a vaccine that is an admittedly unproven new technology. Not to mention the potential side effects are horrific and if you are a healthy person under the age of 70 its been proven that covid is around .002% likely to be fatal. Come back to reality and stop allowing yourself to agree with these fascistic ideas.",
            "title_similarity": "0.8660764",
            "sentiment_compound": -0.9722
        },
        {
            "id": "hbnzne1",
            "score": 0,
            "text": "I can understand where you are coming with this and even share your frustration but this is not workable. There is no fast foolproof way of separating the vaccinated from the unvaccinated.\n\nAssuming that this could be done, how do we separate unvaccinated patients who have made an informed choice and those who have medical conditions or even severe past life experiences which prevents vaccination or impairs their choices or have been forced or plain lied to? These are life and death decisions and have to be 100% accurate. \n\nI believe we have to treat all equally in the hope that most will eventually change their minds due to a combination of carrots and sticks. E.g. Carrot: you can go to football match or concert with negative test result and vaccination. Stick: You cannot travel abroad on a plane on holiday without vaccination and a negative test result. Some students in the uk were even given cash discounts to be vaccinated by their universities.",
            "title_similarity": "0.82285583",
            "sentiment_compound": -0.9715
        },
        {
            "id": "hbz8l77",
            "score": 0,
            "text": "If the vaccine is effective as advertised, only unvaccinated should require hospitalization. The others in the hospital should be non covid patients. There shouldn't be a need to discriminate against the unvaccinated.",
            "title_similarity": "0.763538",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hc2rdlh",
            "score": 0,
            "text": "Nurse here - As much as I'd love to say \"You haven't followed CDC guidelines, so you don't get the same treatment as the people who did their part to mitigate the virus,\" I have to show you some other examples of how we don't/can't do this:\n1.) Diabetics often don't follow the recommended diets and lifestyle changes to either prevent or reverse Type 2 diabetes. However, we still need to provide care for them, because many would die if we didn't. Most patients, especially the elderly, have chronic diseases that are preventable. Many, if not most, have diseases like coronary artery disease, heart disease, COPD, chronic kidney disease, etc..  Most of these can be prevented by proper diet and exercise. We still provide care. If we didn't, the average life expectancy would tank. \n2.) When we become Healthcare workers, most take an oath promising benevolence and to help. We vow not to discriminate and provide sub-par care. We are held liable for the care of each patient, and if we provide care that is below the industry standard, that could be deemed discriminatory practice.  \n3.) Many people, especially the older population, aren't well-versed in COVID-19 and have poor health literacy. Is it fair to deny care to someone who doesn't know any better? If so, that means we'd also have to deny care to children that don't know any better. \n4.) Many people lack critical thinking skills. The average IQ is relatively low. I would say that a large portion of our society gets their \"facts\" from Facebook, Instagram, and tiktok. I've seen some of the BS that floats around on those platforms, and I'm absolutely shocked that people buy into this crap....but they do! I live in Maine, USA and they have made vaccines mandatory for all Healthcare workers. I've been flabbergasted by how many of my coworkers are anti-vax. I'd guess that around half of my co-workers don't believe in the COVID vaccine, and many are only getting the vaccine because they either get the vaccine and keep their job, move to a state that hasn't mandated the vaccine, or leave the Healthcare field entirely. Approximately 30% of the employees are planning to leave once the mandate goes into effect. If people who supposedly believe in science are unwilling to get the vaccine, how can we expect uneducated, non-scientific people to believe in them? \nJust my 2 cents.",
            "title_similarity": "0.8234692",
            "sentiment_compound": 0.9648
        },
        {
            "id": "hc6jein",
            "score": 0,
            "text": "I've stumbled in here long after the debate is dead, but there's an additional pragmatic factor I haven't seen brought up which is relevant. \n\nDenying medical care to such a substantial portion of the population would result in public unrest and violence. Those denied care would see that as an act of aggression towards them and retaliate in kind. This would be pouring kiloliters of gasoline onto the already raging forest fire of American political polarization. I'm not endorsing violence, I'm simply saying it would likely occur.",
            "title_similarity": "0.75245357",
            "sentiment_compound": -0.7104
        },
        {
            "id": "hc87t49",
            "score": 0,
            "text": "I dislike the argument that obesity, smoking, drinking doesn’t affect anybody and therefore isn’t comparable to getting vaccinated. I think it’s affects people the exact same way as not getting vaccinated, by taking up hospital beds. \n\nVaccinated people can still spread covid, so the argument that obesity for example isn’t contagious also doesn’t hold water because the vaccine doesn’t stop it from being contagious. \n\nPrioritizing hospital Beds based on life decisions is a dangerous road to go down.",
            "title_similarity": "0.89095014",
            "sentiment_compound": -0.943
        },
        {
            "id": "hckds14",
            "score": 0,
            "text": "I get your point, and to a limit I agree. But the logistics of doing this would most likely result in slower response, and more deaths simply from trying to enforce it. Being injured via a broken leg and not being vaccinated isn't the same as getting COVID and seeing the effects of COVID.",
            "title_similarity": "0.7380321",
            "sentiment_compound": -0.7876
        },
        {
            "id": "hd96yp4",
            "score": 0,
            "text": "I completely agree! Oh wait most unvaxced are young and healthy so unlikely to need a ventilator! \n\nAlso, they would be probably the ones who would benefit most from a ventilator and most itu doctors would rather ventilate the 30yr old unvaxxed than the 80yr old vaccinated triple bypass.",
            "title_similarity": "0.77356815",
            "sentiment_compound": 0.8433
        },
        {
            "id": "h9x7soj",
            "score": 125,
            "text": "It's astonishing to me how we're so forthcoming about dividing society into a live or die metric based on our personal feelings.\n\nMaybe we can get to the point where anyone who has a speeding ticket be denied hospital care because they're a \"bad citizen\".\n\nWe save and treat as many as we can. Period. Everyone has a life worth living no matter the choices they've made in getting a vaccine, drinking beer, smoking or sitting idle behind a computer desk getting a fat ass. \n\nMaking the world work is messy. It's complicated. But the moment we make choices on the value of lives based our optics and prejudice is when we become our own enemy. \n\nThe vaccine SHOULD be divisive. That's good for society because it means we question authority.",
            "title_similarity": "0.85492575",
            "sentiment_compound": -0.7173
        },
        {
            "id": "hakhusu",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xaltk",
            "score": 62,
            "text": "Firstly, it is unethical and cruel to prioritize care like that. Sometimes it is important to ration care, such as in triage - but triage works the opposite of what you suggest in order to minimize suffering and death - the riskiest cases get treated first. Honestly, vaccinated folks have a much lower mortality rate so of course in a triage situation they will be less sick and need less urgent care on average.\n\nIn a distant second, consider that anti vaccination and anti science sentiment is a cultural and political problem that cruelty in health care won't ever solve. In fact, if people see people unable to prove vaccination status die from lack of care, I bet that would increase anti vaccination sentiments, making the problem worse in the future and confirming the often held antivax belief that vaccination is being used as a method of social control to undermine civil liberties.\n\nThese sentiments exist for reasons beyond individual responsibility, as well. People stand to benefit from misinformation which fuels the issue, whether it be politically or financially. Antivax misinformation sources would not be a [billion dollar industry](https://www.independent.co.uk/news/uk/home-news/coronavirus-social-media-anti-vax-misinformation-vaccine-conspiracy-a9604481.html) if that money wasn't getting a return on investment - and you can bet that most of that money is spent by cynical actors that themselves have taken the shot.\n\nPlease also weigh that [everyone is susceptible to propaganda](https://theconversation.com/youre-probably-more-susceptible-to-misinformation-than-you-think-129171), even people who think they are rational and above the fray. These are reliable, battle tested communication techniques to achieve social outcomes regarding perception and beliefs which drive behavior, not a shoddy scam to trick dumb rubes.\n\nI think frustration and even anger are justified feelings in the face of individuals who won't get the jab. However, I moreso think the people most accountable and deserving of your rage are the people cynically monetizing and politically benefitting from the surge of misinformation fueling this horrible, dangerous movement.",
            "title_similarity": "0.81581587",
            "sentiment_compound": -0.996
        },
        {
            "id": "h9ww1xo",
            "score": 1,
            "text": "How do you determine if someone is voluntarily unvaccinated? Just because someone is unvaccinated does not necessarily mean their voluntarily so. Do the immunocompromised and those who have an allergic reaction also get lowest priority to hospital beds/ventilators? How do you tell if someone’s been vaccinated if they lost/don’t have their card? If it’s based of intent of vaccination, that’s an extremely difficult standard to prove. This is a gigantic can of worms best left closed.",
            "title_similarity": "0.8231048",
            "sentiment_compound": -0.4466
        },
        {
            "id": "h9wwrab",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9wyq7s",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9wzpdm",
            "score": 1,
            "text": "While I agree with the idea in principle, there are two problems I can see with it:\n\nIf you give lower priority to unvaccinated people, you will shift the statistics of COVID mortality and you are giving ammunition to vaccine deniers to say \"the higher mortality rates are because they won't treat unvaccinated people\", even when it is was proven that before priority was given, people who are unvaccinated are at a higher risk, they will ignore facts and spew their misinformation and disinformation in their communities.\n\nAnother problem is that when these sick patients are denied a bed because they don't have enough beds, they are going back to their communities full of more unvaccinated people instead of in the hospital which will lead to more infections.",
            "title_similarity": "0.8130406",
            "sentiment_compound": -0.9528
        },
        {
            "id": "h9x2dk6",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9x47wo",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9x4hoe",
            "score": -1,
            "text": "What about someone who’s willingly unvaccinated, but pays for their healthcare vs someone who’s vaccinated, but doesn’t? Does the person who helps pay into healthcare and insurance deserve less priority than someone who doesn’t contribute but got the free vaccine? \n\n\nMy answer is no, they both deserve equal access to care, because healthcare **should** be accessible to everyone, even if there isn’t a universal healthcare platform(in the US). That includes the idiots spouting anti-vaccine bullshit, and the person social distancing, wearing a mask, and who got vaccinated. Hospitals and healthcare staff deal with the worst of people, even before covid hit. Doctors, nurses, EMS and everyone else who works in healthcare, signed up to help save lives, not just **certain** lives. \n\n\nThere’s a reason we still treat smokers who develops cancer, obese people who’ve had multiple heart attacks, and a plethora of other health issues that have reached a boiling point, whether it’s their own fault or not.",
            "title_similarity": "0.84534377",
            "sentiment_compound": 0.4835
        },
        {
            "id": "h9x4lp6",
            "score": 1,
            "text": "While I sympathize with your view (it is an outrage), there is a practical reason why they continue to be admitted--we cannot allow the unvaccinated sick person continue to wander around, spreading the disease. They must be removed from the population; especially now that cases are breaking through in vaccinated individuals.",
            "title_similarity": "0.83190143",
            "sentiment_compound": -0.8056
        },
        {
            "id": "h9x4oc7",
            "score": -1,
            "text": "This logic is slippery because it can be extrapolated out to a whole range of issues punishing people for decisions that go against majority opinion or the consensus of the medical community. For example, what if we apply this to the AIDS epidemic in the 80s- 90s? The same logic can be framed as: we all know gay sex spreads AIDS and gay people can just stop having sex, so why should the medical community help or treat them in hospitals? By treating them we expose the brave doctors and nurses to the disease and if we let them all die out, then the disease will be gone. \n\nHow about unwanted pregnancies and abortions? Women know unprotected sex can get them pregnant. It’s their own fault they got pregnant. It’s not the fetus’ fault. They should deal with the consequences of their actions and have the baby instead of killing an unborn child that could be put up for adoption if they can’t take care of it. \n\nWhile I believe the vaccine is safe and everyone who can should get it, I also firmly believe in the right to choose what happens to your body even if I disagree with it. We shouldn’t give people the power to decide who’s life is worth a bed vs not based on if they followed public opinion.",
            "title_similarity": "0.8007134",
            "sentiment_compound": -0.7834
        },
        {
            "id": "h9x5l3r",
            "score": 1,
            "text": "No, that’s fucked up. They have rights. People very close to me haven’t been vaccinated and you’d have them denied help at a public hospital? Burn in hell scum.",
            "title_similarity": "0.81015885",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h9x5ujl",
            "score": 1,
            "text": "Well yes, but people who deny getting vaccinated are most likely healthy normal young people and don’t have underlying health conditions so the chances of them ever going on a ventilator is very slim in the first place.",
            "title_similarity": "0.70161945",
            "sentiment_compound": 0.7082
        },
        {
            "id": "h9x7fie",
            "score": -1,
            "text": "Bro at this point, I agree. Play stupid games win stupid prizes.",
            "title_similarity": "0.37496883",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9xaogu",
            "score": 1,
            "text": "Gusranteed to be loved by Reddit: \nPeople who actually pay for their insurance instead of getting it for free thru the state or subsidies should be highest priority. And those who have been paying the longest are prioritized higher. \nSome of us have been paying our own money every month for decades and haven't even been to the doctor. Others of us, I.E. some of the people I've  worked with at min wage jobs, have free Healthcare and have used it more in one month than I have in my entire life.... check that: more in one WEEK than I Have in my entire life",
            "title_similarity": "0.66865754",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h9xavro",
            "score": 1,
            "text": "I am in the healthcare field, and I feel like one of the biggest issues about this debate is that all the blame is targeted toward the individual when it comes to the choice of whether or not to be vaccinated. \n\n\nIn an ideal world, everyone would be presented with all the current research, information and then make a rational decision after weighing the risks and benefits. Unfortunately, most people are very limited in the information they receive because of their personal beliefs and I believe this is exacerbated by the politicization of COVID-19 and because of social media algorithms which increasingly push people into \"bubbles\" or social circles which only reaffirm their prior beliefs. \n\n\nI can look at a patient, look at their background information including education status, where they're from, where they received their education, religious/political beliefs and predict with probably 90% accuracy whether they are vaccinated or not and the MAJORITY of those factors which influence their decision are purely dependent on where they born and the environment that happened to surround them as they grew up and developed values. My question for you is, should we punish people for basically being born and growing up in the wrong environment if they were never given a realistic opportunity to consider the other side of the issue? Bottom line is I would argue most humans make decisions based on emotional responses, based on the values they grew up which depend on the environment they happened to grow up in, and are not making rational decisions with all the information in front of them. It would be too difficult for health care personnel to parse who had a \"fair\" shot at deciding whether or not to get the vaccine, and therefore everyone should be treated equally.",
            "title_similarity": "0.813632",
            "sentiment_compound": 0.6133
        },
        {
            "id": "h9xbg67",
            "score": -1,
            "text": "Personally I don’t think they should be allowed in at all. But yes they should be given lowest prio.",
            "title_similarity": "0.7013212",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h9xe3pk",
            "score": 1,
            "text": "Medical help is based on non discrimination. Triage is first and foremost. If you need help the most you get it first.",
            "title_similarity": "0.59059745",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9xe50s",
            "score": 1,
            "text": "Having read your response on cigarettes, obesity, etc., it sounds like you’re conflating 2 points and doesn’t even really seem like you’re sure which you’re making. \n\n(1). People who could’ve prevented their ailments should be given less priority to healthcare than those who couldn’t have\n(2). Withholding healthcare should be a possible punitive measure to anyone who’s behavior is putting someone else at risk, at least if there’s other people engaging in less risky behavior that need health resources. \n\nFor the first point, i do think cigarettes and obesity hold up. You’ve seemed to express that it’s easier to get vaccinated than it is to lose weight (easier still to not start smoking cigarettes), but who gets to decide what level of preventability disqualifies or deprioritizes you from care? Would you have been comfortable letting the trump admin make those decisions? What if someone suffers a serious bungee jumping accident? They could’ve just prevented it by not partaking in such a dangerous activity. Should the rare people who suffer vax injuries not be treated? They were aware of the risk when they chose to take the vax. \n\nThe second point seems even more scary. You do things every day that put others at risk. By driving a car you’re raising the likelihood someone else dies in a car accident. What about vaxxed people who go to nightclubs, or travel? Given vaxxed people still can catch and spread covid, would you be comfortable denying a vaxxed person healthcare if they didn’t adequately protect themselves/others? And again, ask yourself if you’d be comfortable with the trump admin making these decisions on who gets healthcare and who doesn’t to punish behavior that they don’t like.",
            "title_similarity": "0.7342957",
            "sentiment_compound": -0.9327
        },
        {
            "id": "h9xg1my",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9xgw0u",
            "score": 1,
            "text": "That policy would probably end up being racist.",
            "title_similarity": "0.31205118",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h9xhnzq",
            "score": 1,
            "text": "I personaly think that if someone gets into a serious accident and doesnt want the vaccine they shouldent be left to die because someone came in with a broken arm.\n\nBut maybe im just humane unlike op.",
            "title_similarity": "0.7701111",
            "sentiment_compound": -0.7014
        },
        {
            "id": "h9xhy4k",
            "score": -1,
            "text": "This is almost as disturbing as cuomo and witmer shoving sick people into nursing homes because their TDS wouldnt allow them to use resources provided by Trump.",
            "title_similarity": "0.81520575",
            "sentiment_compound": -0.7898
        },
        {
            "id": "h9xi45t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9xiric",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9xjtok",
            "score": 1,
            "text": "They should be hit with all possible fines & restrictions.",
            "title_similarity": "0.3538542",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xjx4e",
            "score": 1,
            "text": "Hospital space isn’t reserved for those who “deserve” it, it’s for those who need it. Would you prevent someone with type 2 diabetes from getting insulin, because they should have done more to stop it?",
            "title_similarity": "0.76811445",
            "sentiment_compound": -0.3353
        },
        {
            "id": "h9xkz8u",
            "score": 1,
            "text": "My sisters are antivax, at least two of them. One works as a nurse at a nursing home and it sounds like she will quit if she is forced to get vaccinated. The other one has gone down the conspiracy spiral. She is now currently pushing the \"mothers who died because of the vaccine\" one. She at least took down the one video of the girl faking the seizures when someone pointed out the inaccuracy and that they (the person) had seizures as a kid and she was totally falsifying everything.",
            "title_similarity": "0.6932378",
            "sentiment_compound": -0.8834
        },
        {
            "id": "h9xl1o9",
            "score": 1,
            "text": "What hospitals ought to do, and many do this (sadly too many don’t), is give priority to those most in need of treatment, regardless of their personal beliefs.",
            "title_similarity": "0.70043075",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h9xldwv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9xm9pg",
            "score": 1,
            "text": "So fat people should be the last to receive care because of their diabetes.   Fat people with heart conditions should have to wait to get service also.  Smokers with COPD should not get oxygen before others.  Younger Fat people should not get electric wheel chairs before all of the older people have had the opportunity.  Women who choose to get pregnant and are experiencing a medical emergency should have to wait until all of the non-planned pregnancy women experiencing a medical emergency have been treated.  Motorcycle accident victims need to wait because it was a choice to be on that bike.  The list goes on mate...there are many reasons why people do not get the vaccination.  Choice is but one of them.",
            "title_similarity": "0.75706804",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9xn9ck",
            "score": -1,
            "text": "1. The vaccine is proven not to work...so it is not perfectly good...first flaw in your argument\n\n2. The vaccine has proven side effects that are alarming in itself...so if I had a choice between a non fda approved vaccine and its unknown side effects and a virus with a 99.99 percent survival rate...im choosing no vaccine\n\n3. These are the same vaccines all the democrats urged amaericans with every chance they had not to take because they were \"trumps rushed\" vaccines...im not one to assume but I feel like your the same type of person who thinks all trump supporters and anyone who agrees with him is racist and stupid...so I'll leave the irony right there\n\n4. Down here in Texas nobody is wearing masks...all business's are open...nobody cares about covid anymore...tons of people \"get covid\" around us all the time and they quarantine for 14 days then return to work...the worse it ever is, is like the flu\n\n5. If what I've said doesn't change your mind then there is no changing your mind...you are to far brainwashed by the media to see the truth...the covid death numbers were blown way out of proportion...the test can't tell between the flu and covid...if someone died in a hospital it was from \"covid\"...it's known hospitals pumped those numbers up for money",
            "title_similarity": "0.87227774",
            "sentiment_compound": -0.958
        },
        {
            "id": "h9xrdkv",
            "score": 1,
            "text": "I am not going to try and change your view,  as we share the same. Just don't let these that are trying to use arguments regarding obesity or lifestyles distract. This is in regard, in my opinion, only unvaxxed COVID patients, theu are the immediate problem. They try and make these argumebts without realizing EVERYONE ELSE is currently being put behind unvaxxed assholes. Personally, I believe there should be a date on the calendar that says \"Unvaxxed cut-off date\" and after that date, they won't even be permitted in a hospital regardless of why they are there. This of course would not apply to those that can't due to legitimate medical exemptions, as long as they have a doctor's note indicating the condition.",
            "title_similarity": "0.8538841",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h9xwpms",
            "score": -1,
            "text": "I had covid and it was barely worse then a bad cold, weird sickness.",
            "title_similarity": "0.5103133",
            "sentiment_compound": -0.791
        },
        {
            "id": "h9xwww6",
            "score": 1,
            "text": "Fuck CYV. I wanna co-sign it",
            "title_similarity": "0.25046527",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9xy9rw",
            "score": 1,
            "text": "Just remove the post this idiot didn’t come to have his mind changed",
            "title_similarity": "0.4582422",
            "sentiment_compound": -0.596
        },
        {
            "id": "h9y5g0p",
            "score": 1,
            "text": "Please ask yourself why so many people who never had problems with vaccines before are opposed to this one? If your instinct is telling you that there is something wrong about this one what would you do? Are you 100% sure that you made the right choice and the government have said the truth and nothing but the truth? No alarm bells whatsoever so far? Time will tell for sure. \nGood luck to all redditors whatever choice they made.",
            "title_similarity": "0.80428255",
            "sentiment_compound": 0.9371
        },
        {
            "id": "h9y5z3o",
            "score": -1,
            "text": "I think a nicer to way to put it would be to consider this upon triage. You're looking for those who have the highest chance of survival. In this case that would be the vaccinated, and is a sneaky way of doing what you're proposing.",
            "title_similarity": "0.58161545",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9xcf83",
            "score": 7,
            "text": "I understand where OP is trying to head here, but I think we’re looking at an enormous Hippocratic oath violation. Doctors are not Gods (though some of them think they are) and don’t get to choose who does and does not receive treatment based on the decisions they have made in their lives. \n\nI see a lot of the overweight argument here, which I think is not totally valid because, as OP mentioned, that doesn’t directly affect the health of other people. I could argue though, that it does *indirectly* affect the health of others. For example, if an overweight person is hospitalized due to something other than COVID (let’s say this overweight person is vaxxed up) - that is still taking a bed away from a COVID patient. Regardless of the capacity the hospital is running, not every single bed will be occupied by a COVID patient. \n\n Circling back to my initial point, though - Doctors don’t get to choose who does and does not receive healthcare, especially in life saving situations, regardless of if it’s affecting one person or the entire population. Drug addiction costs this country HEAPS of money, and in some instances, other people’s lives. I’d argue that drug addiction, while not directly harmful to other people’s health, is definitely indirectly harmful as well (or can be). You’re not going to see a doctor that won’t save a patient who’s OD’d because of the choices they made. \n\nSorry for formatting, I’m on my cell phone. I’ll happily admit that I’m not overly informed on these issues, so if anyone wants to learn me, I’m all for it!",
            "title_similarity": "0.84005266",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h9y5xf6",
            "score": 6,
            "text": "Pretty sure ideals like this put you in some real interesting historical company, the kind you probably loudly exclaim you utterly despise.",
            "title_similarity": "0.62391835",
            "sentiment_compound": 0.9044
        },
        {
            "id": "h9wn4pp",
            "score": 64,
            "text": "\nI think the first issue is in regards to authority; who gets the authority to do this and how can we have such who determines this without concerns of bias (voluntary or not) and alternative motive? \n\n\nOverall though, hospitals, as an institution that is built, staffed, and equipped for the diagnosis of disease; for the treatment, both medical and surgical, of the sick and the injured; and for their housing during this process. The modern hospital also often serves as a centre for investigation and for teaching. These are the purposes, as opposed to a reinforcement if responsibility. What this is to mean is the person who is in the less favourable circumstance, while having a higher survival rate overall due to state beforehand and other various factors, assuming that the hospital has the abilities to treat said person, should get priority. By your logic, a suicidal individual who is around ten minutes away from death/ young individual who got hit by a car by being idiotic or someone who got injured by playing sports awaringly irresponsibly would be cast aside for an individual with a mangabable, but broken leg, no? That is going against what the hospital is, which is optimization of mass survival and treatment. Instead, it should be based on the latter, not way you propose (basically holding someone responsible for the cause of death); the goal and purpose of such establishments is (or at least should be) to save the most people. \n\nWhen resources are extremely limited, it tends to go towards those who have a more likely chance of survival, while being in more severe situations (for example- it's going to be observed and why there's more prioritization of young people for heavy treatment in hospitals with limited resources, as opposed to elderly indviduals), in comparison to those who don't because of said circumstantial limitation as it's a more closer association to what the hospital's purpose is in the first place. If it happens to be indviduals who have gotten vaccinated who fit this relation, then that is fine. In fact, I do acknowledge that is the more likely of cases. However, if not, this should also be applicable. Opposite to this, for starters, means we would live in a society with less productivity where there'd likely be more dead people. Once again though, this is simply for starters. \n\nImplementation would also basically be partially changing the purposes of hospitals, which is opening other doors for major issues in the future (besides likely increase of death due to decrease of emphasis regarding system which focuses on optimization regarding the amount of individuals who are treated and recovered in general), including lack of fair treatment because the involuntary/voluntary bias, skewed sense of obligation to make decisions based off of personal perception of responsibility for actions and what is warranted (which in some cases can hold malicious intent, become extremely warped due to the various rabbit holes that idealogies associated to responsibility can be and/or cause increase of unneeded loss for life, where there was ability to save one), etc. This is not a great road to take when we are taking about hospitals. Also, if individuals feel they're not going to be able to get great treatment at the hospital, some may be less inclined to go to an established one because of lack of hope in the first place or some alternative use of justification. Also also, can people not lie, claiming they did not have time to collect resources to place there vaccination status in system during time of vaccination and official establishment with health providers?",
            "title_similarity": "0.6415991",
            "sentiment_compound": -0.8065
        },
        {
            "id": "h9x4h9i",
            "score": -2,
            "text": "It’s a good idea no doubt but it seems that the unvaxxed will go to the hospital first and hog all the machines which creates a dilemma: does the hospital take a ventilator away from an unvaxxed person and give it to a vaccinated patient when that arrive? \n\nI’m short, great idea but impossible to implement.",
            "title_similarity": "0.85939497",
            "sentiment_compound": 0.8675
        },
        {
            "id": "h9x5e44",
            "score": -2,
            "text": "We should develop a caste system!",
            "title_similarity": "0.15614536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xmkqy",
            "score": 2,
            "text": "\"It's the pandemic of the un-vaccinated.\" Why are you blaming/ridiculing? Question, when we are all vaccinated what's next? Are you going to go to every other country that isn't vaccinated and tell them the same thing? Do you travel?  Are you alright with health passports and proof of vaccination/s?  You hardly saw anyone at the airport in Afghanistan and I certainly did not see a single Taliban have a mask on in their little political picture.\n\n  Now, we have citizen's coming back from Afghanistan and are unvaccinated. I'm all for human rights and opinions, but I also like to see the whole perspective of things. I deffinitly don't like belittling and disrespecting ANY U.S  citizen. But to decline healthcare or give them last priority sounds like you would be a better fit living in China. As long as your ok with ALL of your rights taken away.",
            "title_similarity": "0.80972236",
            "sentiment_compound": 0.9509
        },
        {
            "id": "h9xyukl",
            "score": 2,
            "text": "I just want to give a shout out to r/changemymind and the mods here. This is the best discussion thread I’ve seen on covid concepts and it really proves this subreddit facilitates meaningful free speech that cuts past the BS of politics.\n\nCongrats and thank you!",
            "title_similarity": "0.506632",
            "sentiment_compound": 0.9336
        },
        {
            "id": "h9y5tof",
            "score": 2,
            "text": "Even though I despise the fact that people who need treatment for other conditions that they had no control over (cancer, etc.) are having their hospital beds given up to anti-vax COVID patients, I think it’s vitally important that medicine remain morality-neutral. Access to medical care should be based on need alone, not how much a person deserves treatment. \n\nA person who breaks their arm doing a stupid stunt should get the same level of care and priority as someone who broke their arm rescuing a pet from a tree. A person who got lung cancer after a lifetime of smoking cigarettes should get the same priority and treatment as a person with a healthy lifestyle who develops cancer. A morbidly obese over eater should get the same access to a knee replacement as a marathon runner who took better care of their body. \n\nThat being said, I think the main motive for this “let them face the consequences” line of thinking is to force a consequence and not let anti-vaxxers off the hook for their shitty behaviour. I find it pretty likely that insurance providers may begin refusing coverage or charging extremely high prices for COVID-19 treatment for those who are unvaccinated. And THAT I agree with.",
            "title_similarity": "0.8402678",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h9x0k9e",
            "score": 3,
            "text": "So, I'm going to give you a systems answer to this question: what you're proposing likely won't help.\n\nSometimes in resource pooling / parallel processing, you notice that a certain type of task is takes a really long time. What you end up with is all processors being occupied by long-taking jobs, and jobs that should be able to move through quickly are piling up because they can't get resources allocated. You can't just not do the slow jobs, but how do you set it up so that the quick jobs can get through in a timely manner? Often, people's first thought is to de-prioritize the slow jobs, so they won't get started if there's a faster job also waiting.\n\nThis doesn't work, because eventually the slow jobs do get picked up, one by one each of the processors gets stuck with a slow job, and you end up in the same situation, where all the resources are allocated to slow jobs and everything else is queueing up behind the jam. Sure, when one slow job finally finishes, the quick jobs can get through before the next slow job gets picked up, but nevertheless they still spent a ton of time waiting.\n\nIf you actually want to keep the quick jobs moving, you have to either set aside a certain amount of resources that will *never* be allocated to slow jobs (even if this means they sit idle a lot of the time), or you have to be willing to prematurely kill a slow job every once in a while in order to keep things moving. (Or you have to buy a lot more resources.)\n\nObviously in this analogy jobs are patients, and compute resources are hospital beds/staff/supplies/etc. It's not a perfect analogy (I don't think unvaccinated covid patients necessarily stay in the ICU that much longer than other patients), but we're already dealing with relatively long residency times, and there are just so many more covid patients than others. Even if you always prioritize giving beds to non-covid patients, you'll still end up with mostly covid patients because there's so many more of them than everyone else.\n\nShould we rip a covid patient off a ventilator if someone else comes in and needs it? Should we set aside a certain number of ICU beds that cannot be used by unvaccinated covid patients? The former seems inhuman (and an awful thing to ask nurses to do), and the latter requires hospitals to turn away people that they *could* be helping, which is also a hard thing to ask of people who took the hippocratic oath. They're also both a lot bigger steps to take than simply shifting triage priority.\n\nBut barring doing one of those things, from a statistical level, it just won't make much of a difference how you triage; the volume is the problem. There are edge cases where it would make a difference (e.g. if you and a non-vaccinated covid patient are both waiting for a bed and one happens to open up in time to save one of you), but in most cases what'll happen is that both you and the covid patient would end up having to go without, regardless of who's at the front of the line, because the real problem is that the average turnover time for beds is longer than the frequency of people needing them.",
            "title_similarity": "0.6412207",
            "sentiment_compound": -0.8408
        },
        {
            "id": "h9x5fe2",
            "score": 2,
            "text": "Prioritizing healthcare has been tried before and found to be unethical: [https://journalofethics.ama-assn.org/article/oregons-experiment-prioritizing-public-health-care-services/2011-04](https://journalofethics.ama-assn.org/article/oregons-experiment-prioritizing-public-health-care-services/2011-04)\n\nWe in healthcare have licensures and insurance but I sure as hell am not going to lose my license or go through a lawsuit for your idea.",
            "title_similarity": "0.78256357",
            "sentiment_compound": -0.7238
        },
        {
            "id": "h9x7tlh",
            "score": 3,
            "text": "I feel like your edit discredits overall being healthy because it's hard. The vaccine only stops you from getting covid whereas being obese/smoking/alcoholic introduces a whole magnitude of issues that are a burden on our system (including covid). \n\nTo put it more directly, do you think people that are unvaccinated are more likely to be take up resources than those that are morbidly obese? Even just taking covid into consideration [78%](https://www.cnbc.com/2021/03/08/covid-cdc-study-finds-roughly-78percent-of-people-hospitalized-were-overweight-or-obese.html) of people that required hospitalization were overweight or obese.",
            "title_similarity": "0.82387733",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9wuv4i",
            "score": -3,
            "text": "This is a call for actual, rampant discrimination in a field that pledges ar every level not to do so. It's a bad look when you claim to live in a free country.",
            "title_similarity": "0.71038955",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9xgn67",
            "score": 4,
            "text": "My issue is in my family (My Mother and Father) both got Myocarditis from getting the vaccine (Doctor Confirmed) and my cousin has been having regular seizures since getting the vaccine, so the reason I’m not getting it is due to the impact I’ve seen on my own family, and I’d rather risk just staying home and staying clean and talking the rest of getting really sick from Covid then get the vaccine and have a permanent heart condition or seizures",
            "title_similarity": "0.7924094",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h9xmn6a",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9xuf45",
            "score": 4,
            "text": "As another reply mentioned, going down this road is a dangerous proposition. I'd like to elaborate on that.\n\n&nbsp;\n\nThe practice of medicine in many places around the world is morally informed by certain principles of bioethics. Every hospital and major health organization will (or should) have a bioethics committee that tackles some of the very difficult cases that can arise in the practice of medicine, including the issue you brought up in this post. The ongoing pandemic and its strain on the hospital system probably has these committees working overtime (one would hope they're being widely utilized, at least).\n\n&nbsp;\n\nSo, what are these principles? I'll briefly define them below first, and then apply all of them to the issue of unvaccinated individuals and their access to critically limited resources. They are as follows:\n\n&nbsp;\n\n**Patient Autonomy:** Every patient has the fundamental right to make decisions about the course of any and all medical treatments. One is always free to decline any kind of treatment, ***even*** against medical advice and widely accepted science. Thus, one may empower an individual to exercise patient autonomy by providing them with all of the information they need to make *informed* decisions about their healthcare. Whether the patient chooses to allow that information to inform their decisions still falls under their autonomy.\n\n&nbsp;\n\n**Benevolence:** The goal of any and all medical treatment should be to: Improve one's health, quality of life, level of comfort, and so on. Basically, it's meant to be employed in good faith and with the aim of improving the patient's life and/or health in some meaningful way. This principle also has a very notable \"sub-category\" known as 'good stewardship.' Here, good stewardship means the benevolent distribution and utilization of resources that employs other principles, such as ensuring fair and equal access (namely justice, more on this one in a bit).\n\n&nbsp;\n\n**Non-Maleficence:** \"Do no harm\" is part of the Hippocratic oath every physician (and many other healthcare workers) takes in order to practice medicine. At its core, it determines medicine should never, ever be used with ill-intent or as a form of punishment.\n\n&nbsp;\n\n**Justice:** Where good stewardship covers fair and benevolent allocation of resources, justice is a bit more broad in that it ensures equal access to medical care, though both go hand-in-hand as you may have noticed. \n\n&nbsp;\n\nNow let's apply all of these to the issue at hand. We'll call this unvaccinated patient \"Tom.\"\n\n&nbsp;\n\nTom is exercising patient autonomy in deciding whether he wants to be vaccinated or not. The reasons behind his decision do not matter in the context of whether he can choose to be vaccinated or not. Any and all medical care that Tom is afforded as a COVID-19 patient must be aimed at improving his health and quality of life.\n\n&nbsp;\n\nThat was the easy part. Here's where it gets really complicated and you'd need a committee of ethicists to work out the minutiae, though the end result is pretty clear to me, personally.\n\n&nbsp;\n\nShould employing good stewardship provide a fair, benevolent distribution of resources (ie beds and ventilators) ***EVEN*** to a patient that chose to leave themselves vulnerable to the ailment that now threatens their lives? I would personally say that it does. Here's why: To deny Tom access to a ventilator ***SOLELY*** on the basis of the exercise of his patient autonomy is a form of punishment that violates the principle of non-maleficence.\n\n&nbsp;\n\nShould employing the principle of justice provide Tom equal access to medical care in spite of his choices, at the cost of another patient who might need it? I would also argue that it would for the same reason good stewardship would apply. \n\n&nbsp;\n\nIn summary, to deny a patient access to medical care and/or any resources based on personal choices they made -- an almost unalienable right every patient is afforded -- would be to employ medicine as a form of punishment through deprivation of crucial medical treatment.\n\n&nbsp;\n\nThe matter of the hospital bed and ventilator that Tom is using that another vaccinated patient needs is a logistical one, not necessarily something that physicians and nurses ought to be employing on the hospital floor. \n\n&nbsp;\n\nWhere you're coming from is a very common perspective, for what it's worth, because we recognize resources are limited and the tough choice of who gets access to what needs to be made. Correct me if I'm wrong, but it's based on the idea that we should allocate resources to maximize the amount of life-saving treatment we can apply, in an ***effective*** manner, right? Allocating resources to the greatest amount of good to the greatest number of people is just one take on the issue, namely a utilitarian one. There's myriad other ways to look at this issue, most of which are outside of my scope of knowledge.\n\n&nbsp;\n\nHere's a few disclaimers I want to add, in closing: I took several ethics and bioethics classes in college as a prospective medical student out of fascination for the subject matter. I've since read a lot of publications on the matter, but am still no expert by any stretch of the imagination. This subreddit has lots of amazing people and probably quite a few that know scores more than I do about this. Please feel free to chime in if I got anything wrong or my arguments weren't as sound as they could be. Thanks for reading!\n\n&nbsp;\n\nOP, I have a pdf copy of a bioethics textbook that explores these topics at length. I'm 99% sure I can't just place a link to it here but if you're interested in learning more I'd be happy to PM it to you.",
            "title_similarity": "0.72634375",
            "sentiment_compound": 0.9979
        },
        {
            "id": "h9wvtu2",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xhh1i",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xek8d",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xaxkq",
            "score": 10,
            "text": "How do you define voluntarily unvaccinated? \n\nFor example, my aunt doesn't get the vaccine because she has a multitude of allergies and has made bad experiences with vaccines before. I would argue these are valid health concerns.\n\nWhile I myself, am vaccinated I can still understand people who are not vaccinated. A few years ago I almost died because I got injected the wrong dosis/my body reacted differently. I think it is valid to not take the vaccine for these reasons and therefore it is a little unfair to get lower priority for hospital beds.",
            "title_similarity": "0.84628844",
            "sentiment_compound": -0.9461
        },
        {
            "id": "h9wtwm5",
            "score": 2917,
            "text": "Hospitals operate under the principle that what constitutes urgency is need, not culpability. If two patients come in from a car crash, the responsible one barely alive, ribs shattered, organs haemorrhaging while the innocent party has a sprained wrist and mild whiplash, you don't treat the innocent one first because he's not culpable, you treat the culpable one first because his need is more dire. That way, overall more lives are saved (this principle is the guiding philosophy of triage which is a protocol which saves a shitload of lives) and you remove personal value judgements of blame as a factor in doctor's actions, which is a bias nobody want healthcare professionals to be influenced by.",
            "title_similarity": "0.73279965",
            "sentiment_compound": -0.404
        },
        {
            "id": "h9wwq88",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9wx9sp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9wxbxw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x0ie1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x0yqy",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x11db",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9x3gkc",
            "score": 1,
            "text": "While I understand the premise.  Unvaccinated people that get sick are less likely to address their illness using appropriate protocols.\n\nI do not mean treatment protocols, but rather they are more likely to go to the store for OTC treatments exposing others.  They are more likely to get support from other like minded people or just enabling people causing a broader more rapid spread.\n\nSince these people were not preventative taking them out of population into a controlled environment reduces the damage they can do to the community.\n\nWouldn't mind seeing cuffs on them after they get better, though.  Or their insurance claims denied.",
            "title_similarity": "0.73054236",
            "sentiment_compound": -0.4854
        },
        {
            "id": "h9x7mm6",
            "score": 2,
            "text": "Overall health - metabolic and correct weight proportion are at least as effective against covid as the vaccine. therefore by your own logic, fat people should not get treatment either - or anyone with poor metabolic health.",
            "title_similarity": "0.82693803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9x7tod",
            "score": 5,
            "text": "I disagree in large part because there is a different way it should be done. \n\nIf there is truly not enough of an essential healthcare item to go around - like if there are not enough ventilators, and this cannot be ameliorated by things like transfers and using alternative devices - then triage should be done similar to a [mass casualty event](https://www.mayoclinic.org/medical-professionals/trauma/news/mass-casualty-triage-guidelines-revised/mac-20512735). That includes a back tag for people who are very unlikely to survive.  Those people should get the lowest priority.\n\nNow vaccination status is part of that. Unvaccinated individuals are more likely to die, and we have lots of data about what happens when unvaccinated individuals get covid. We have less data about what happens when vaccinated individuals get critically ill with covid (in part because it is a rare event, in part because it was not seen until recently based on vaccination timings and the delta variant), so there is less certainty about those who will end up with poor outcomes.\n\nThere is also the fact that many patients requiring hospitalization are there ultimately in part due to poor healthcare choices (smoking, drugs, alcohol, diet - although I do think there is a difference between an addiction and a choice not to get a shot).",
            "title_similarity": "0.75816035",
            "sentiment_compound": -0.921
        },
        {
            "id": "h9x9xpi",
            "score": 1,
            "text": "How would you regulate that though? If someone who is unvaccinated is in a bed or ventilator and a person who is vaccinated comes  or has another ailment comes in they should just kick the non vaxed out? The hospital would be at risk of malpractice by discharging the patient too early.",
            "title_similarity": "0.7310455",
            "sentiment_compound": -0.3527
        },
        {
            "id": "h9xbwqh",
            "score": 1,
            "text": "There appears to be a lot of overweight unvaccinated people here.",
            "title_similarity": "0.20850155",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9xc13j",
            "score": 2,
            "text": "But they are the ones most likely to die. Others take huge health risks by being fat, drinking too much, smoking who could also be deprioritised which would increase the death rate.",
            "title_similarity": "0.60306233",
            "sentiment_compound": -0.8704
        },
        {
            "id": "h9xc3pl",
            "score": 1,
            "text": "I have to attempt to change your view in one way:\nYour premises is about the unvaccinated, but fails to mention those on immunosuppressants that can not be vaccinated.\nSo I would hay that your view needs changing to be inclusive of those that can not be vaccinated vs those who will not be vaccinated.",
            "title_similarity": "0.7451196",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9xd9zd",
            "score": 3,
            "text": "COVID may be creating an acute strain on our healthcare system, but compared to diabetes and diabetes related conditions, covid is a raindrop compared to a diabetic ocean.",
            "title_similarity": "0.58167857",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9xdd1g",
            "score": 1,
            "text": "Not trying to change your view, but in the case that hospitals are overloaded and forced to triage, the unvaccinated will be given lowest priority, as their chance of survival would be considered lower than that of a vaccinated person.",
            "title_similarity": "0.7655523",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h9xdnuu",
            "score": 1,
            "text": "So how are you going to test that? Are you going to take their word for it? Are you going to send someone to search their home for the vaccine card? What if it's an extreme case and you're not able to ask them or wait for them to provide proof?",
            "title_similarity": "0.65456295",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xfciy",
            "score": 1,
            "text": "The Hippocratic oath says \n\n>do no harm\n\nThis would never happen...even if it makes sense.",
            "title_similarity": "0.47972566",
            "sentiment_compound": 0.431
        },
        {
            "id": "h9xfcvs",
            "score": 1,
            "text": "What about people that are into vaccines but not into that one vaccine? World is not only black and white mate",
            "title_similarity": "0.6274501",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xfdr7",
            "score": 1,
            "text": "Generally speaking, ignoring the rest of the arguments, there’s not enough unvaccinated people needing vents for this to be an issue. I can understand beds, but that’s why we have different wards based on markers like fiO2 and such. One ward has a good prognosis. Another is usually ICU transfers out, then our 2 ICUs caring for the really sick, those needing ECMO and such. I don’t think we have had an unvaccinated person in the ICU recently. I work at an 800 bed hospital in highly conservative place.",
            "title_similarity": "0.7528188",
            "sentiment_compound": 0.5873
        },
        {
            "id": "h9xftcn",
            "score": 1,
            "text": "I get what you’re saying, but also if an antivaxx person gets covid and needs immediate attention I’m not gonna reject them over some petty karma complex.",
            "title_similarity": "0.5327452",
            "sentiment_compound": 0.1747
        },
        {
            "id": "h9xg33g",
            "score": 1,
            "text": "Okay now do fat people",
            "title_similarity": "0.16840002",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9xh3do",
            "score": 1,
            "text": "Organ transplant matching protocols are currently excluding the non vaccinated.",
            "title_similarity": "0.6151538",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xhiv9",
            "score": 1,
            "text": "A lot of comments I've seen so far revolve around deprioritising people who suffer from obesity, diabetes, lung cancer, and other serious conditions that others have judged to be self-inflicted - in some cases regardless of whether they've been vaccinated or not. This is shitty, and reeks of class privilege. Just because someone doesn't live the way you want them to, doesn't give you the right to pass judgment on them, or assume that you know why they're ill, or that they have the ability to treat it themselves. \n\nI agree with OP - we should triage the voluntarily unvaccinated lower than others who are participating in the free program. This argument stands on its own insofar as they are refusing medical treatment. However, I don't think we should put lower priority on people who have been vaccinated simply because they're sick in other ways.\n\nOne thing gives me pause - if we apply this logic, do we deny surgery to obese people needing amputations? Or access to oncologists because they've got lung cancer? Or access to psychiatrists because they're not taking their medications? This again smells like classism, because the wealthy will inevitably be more eligible, or can pay for private care, while the impoverished suffer.",
            "title_similarity": "0.7939465",
            "sentiment_compound": -0.9084
        },
        {
            "id": "h9xhp7b",
            "score": 1,
            "text": "You’re assuming that vaccinated people are also being hospitalized, which is generally false. This is now a pandemic of the unvaccinated so your argument is void.",
            "title_similarity": "0.78268087",
            "sentiment_compound": -0.4173
        },
        {
            "id": "h9xi3re",
            "score": 1,
            "text": "This becomes extremely difficult to administer and very quickly can cause issues. How do you decide that goes? Bring someone in on an ambulance is it at the ER that you tell them to wait in the hall way while their lungs fill up with liquids? Is it after you stabilize them and need to send them off to a room in the hospital? \"sorry sir, but we see you are unvaccinated so we are going to have to send you home. I know you have a high chance of dying but we need space for someone else\".\n\nhow do you decide if the vaccination status matters? If children under 12 couldn't get the vaccine yesterday but can get it today do you treat them as unvaccinated? What about someone with MS who hasn't been cleared by their doctor to get it yet? Does a 'real' religious exemption count? How do you decide if it counts or not?\n\nBut the real big issue is how you turn these people away after you have already agreed to take them in. The ER can't turn you away, it is literally illegal almost everywhere to turn patients away from the ER.\n\nThere are way too many variables that you really don't want to get into, and a hospital definitely doesn't want to get into on their own. The lawsuits could be horrible to deal with.\n\nAnd no liberal leaning government is going to mandate this by law, which is the only place that would \"consider\" it.",
            "title_similarity": "0.7375202",
            "sentiment_compound": -0.8168
        },
        {
            "id": "h9xi4sc",
            "score": 1,
            "text": "Are you talking about the rules of Universal healthcare, where society determine what healthcare a person gets or is denied? Doesn't the government already deny people enough healthcare options? Maybe we should restrict all risky adventures/habits that drain the health care system, insurance and taxpayers.",
            "title_similarity": "0.8093518",
            "sentiment_compound": -0.7059
        },
        {
            "id": "h9xi4te",
            "score": 1,
            "text": "Illegal drug users who overdose should be the bottom of the barrel. Taking up hospital bed space.",
            "title_similarity": "0.6883098",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9xi8r0",
            "score": 1,
            "text": "The main argument against that is if you start putting conditions on receiving care,  you open everything up for subjective interpretation. \n\nCar accident victims who weren't wearing seat belts should get lower priority,  the person who caused the accident should get lower priority behind the person who got hit.  No helmet on a motorcycle?  Last priority in the neuro unit. \n\nHow about people who had COVID before the vaccine came out and should be more immune than prior with the vaccine,  but got it again?  \n\nWhat if you were in the hospital when there was room,  then it filled up. If a vaccinated patient comes in,  do you get discharged until room opens up again?\n\nWhat about people with a medical exemption for the vaccine? \n\nA Corona virus is always mutating, hence why we don't have a vaccine for the common cold.   Will you have to have had every vaccine for the last 10 years for each variant when you get the Epsilon-6 infection in a decade?\n\nAlcoholics still get in line to get liver transplants the same as people with other liver diseases.",
            "title_similarity": "0.805508",
            "sentiment_compound": -0.7516
        },
        {
            "id": "h9xia5o",
            "score": 2,
            "text": "You could simply say that people with the highest chance of survival will be prioritized. This accomplishes what you're suggesting for the most part. Far better than digging through someone's social media posts. \n\nVaccinated people hospitalized with covid have a much, much higher survival rate.",
            "title_similarity": "0.61923575",
            "sentiment_compound": 0.8068
        },
        {
            "id": "h9xk87h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xkenn",
            "score": 1,
            "text": "Here's the thing - these people have been lied to. They've been told by the unstoppable right wing media juggernaut that this is unsafe, or doesn't work, or affects their freedoms. In general, these anti-vax people are high-school educated, surviving in poverty, and born and bred in an echo chamber. We cannot completely blame them for not pulling themselves out of that environment. \n\nDo they deserve to be denied care because they're gullible? Maybe not. The people who deserve scrutiny are those that have been fanning these flames and distributing the bad information.",
            "title_similarity": "0.75603193",
            "sentiment_compound": -0.7748
        },
        {
            "id": "h9xkn34",
            "score": 1,
            "text": "So a 2 year old wants juice she's gonna be fine lol",
            "title_similarity": "0.2979657",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9xks5c",
            "score": 1,
            "text": "There are thousands of unvaccinated people, meaning not just Covid. Should this logic apply there as well? Unvaccinated people have existed for many years, and it hasn’t been a major problem yet.",
            "title_similarity": "0.3950006",
            "sentiment_compound": -0.2247
        },
        {
            "id": "h9xkskb",
            "score": 1,
            "text": "You'll find many who agree with you on r/nursing.",
            "title_similarity": "0.2861722",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9xlsgb",
            "score": 1,
            "text": "I’d agree, except left untreated/unvaccinated, those same people will be the biggest spreaders of the virus in general population. Taking the opportunity to treat and vaccinate them when you have the chance is good for everyone else  too. This assumes that you can make vaccination a condition of or part of treatment, which I have no idea if you can do",
            "title_similarity": "0.81240404",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h9xlvp5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xlwb5",
            "score": 1,
            "text": "This will be weaponized for racism.",
            "title_similarity": "0.28883976",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9xlxqi",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xm6m4",
            "score": 1,
            "text": "What people fail to understand about the unvaccinated in America is that a significant percentage are poor and have viewed the American medical industry as an enormous ripoff/borderline scam their whole lives. They don’t see doctors when they get sick and without a nuanced understanding of science they are unlikely to participate in the American medical industry. Their position is entirely reasonable, why would they trust the government regarding medicine now? And they should not receive lower priority/have lives at risk simply for not partaking in a scam - it’s the governments fault there are so many unvaccinated not the peoples. (At least where I live)",
            "title_similarity": "0.86918116",
            "sentiment_compound": -0.9468
        },
        {
            "id": "h9xmajo",
            "score": 1,
            "text": "Well that’s discrimination which hospitals don’t go by. Everyone deserves to live no matter what is general the way it goes.",
            "title_similarity": "0.677542",
            "sentiment_compound": 0.2561
        },
        {
            "id": "h9xmgn8",
            "score": 1,
            "text": "The USA , in a way, is an example of why prioritizing health care doesn't work.\n\nThere, money gets you a priority treatment, maybe not in terms of 'first in line' but definitely in terms of quality of care.\n\nIn socialized healthcare countries I could see some merit in having anti vax people pay for their complete covid treatment out of pocket, or at the very least part of it. \n\nIn the USA though.. that obviously does nothing.",
            "title_similarity": "0.8093728",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h9xmvxs",
            "score": 1,
            "text": "Why stop at unvaccinated? Smokers, obese, people doing stupid stunts, drug addicts, I could go on and on. If your going to start down this road, it's easy to start adding more people to the list.",
            "title_similarity": "0.47196692",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9xod0j",
            "score": 1,
            "text": "I've got a client who's in the tail end of a complicated pregnancy who can't get the shot. There are legitimate reasons not to, though rare. Would you have her lumped in with antivaxxers? To take it a step farther, should young adults whose parents have homeschooled them wrong on this be blamed for their ignorance?",
            "title_similarity": "0.6836958",
            "sentiment_compound": -0.8426
        },
        {
            "id": "h9xoipn",
            "score": 1,
            "text": "What if the reason is not Covid related?",
            "title_similarity": "0.20938951",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xpcq4",
            "score": 1,
            "text": "Btw I agree with you and They’re starting to do it:\n\nhttps://www.forbes.com/sites/nicholasreimann/2021/08/19/vaccination-status-may-be-considered-to-get-icu-beds-at-dallas-area-hospitals-if-covid-spread-worsens/",
            "title_similarity": "0.5645338",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9xpgrc",
            "score": 1,
            "text": "Would you also say the same about people who consume animal corpses and secretions as food? Covid 19 is a zoonotic disease, and zoonotic pathogens have caused nearly every pandemic in human history. Such diseases can be prevented by eating only plant-based foods.",
            "title_similarity": "0.6872498",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9xpnoh",
            "score": 1,
            "text": "Lay em next to the bums in the alley.",
            "title_similarity": "0.22613426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xpvc7",
            "score": 1,
            "text": "Of maybe you can have some humanity and do it based on first come, first served and severity levels.\n\nBut if you're willing to expand your idea to anything unhealthy one chooses (no more bullshit excuses allowed to dodge it), sure.",
            "title_similarity": "0.5184879",
            "sentiment_compound": -0.7461
        },
        {
            "id": "h9xpvpq",
            "score": 1,
            "text": "My uncles best friend had an appointment to get the vaccine, tested positive and is almost dying. I’m glad he was made a priority. That’s why it should be impartial",
            "title_similarity": "0.6665704",
            "sentiment_compound": 0.9292
        },
        {
            "id": "h9xpx7q",
            "score": 1,
            "text": "I agree, to an extent. There is a quiet subset of nonvaxxed who have still done everything but. They wear masks, social distance, and often times continue the extreme isolation from the early days of the pandemic (because of being unvaxxed mostly). But for certain reasons that have nothing to do with a being a Freedom Bro antivaxxer decide not to get vaccinated yet. Those reasons could be anything from health related to just that they aren't ready yet. But they still continue to follow all the rules otherwise, because the concept of \"mah freedoms\" doesn't even factor in and they take the virus seriosuly. I admit it would be hard to weed out the willful deniers from those who have real reasons for not being vaxxed, but being unvaxxed doesn't necessarily equate Freedom Bro pandemic denier who willfully puts others at risk.",
            "title_similarity": "0.8111398",
            "sentiment_compound": -0.7316
        },
        {
            "id": "h9xq49j",
            "score": 1,
            "text": "Y'all: \"Healthcare is a RIGHT!\" \n\nAlso y'all: \"Healthcare should be merit based!\"",
            "title_similarity": "0.46139246",
            "sentiment_compound": 0.5242
        },
        {
            "id": "h9xqavl",
            "score": 1,
            "text": "So do you honk a vaccinated person who follows no covid guidelines and gets covid should have priority over someone who doesn’t have it and follows every health and safety guideline to avoid it? No one life is worth more than another’s regardless of the choices we make. Whether they make good or bad choices who are we to decide who should and shouldn’t be first in line for help?",
            "title_similarity": "0.8688072",
            "sentiment_compound": 0.1431
        },
        {
            "id": "h9xqfh8",
            "score": 1,
            "text": "I think you touched on this with \"if you have the chance\" but the only thing I would ask (of course, with the circumstance being a full hospital) is what would you say about people with pre-existing health complications that make the vaccines unsafe for them?",
            "title_similarity": "0.7946881",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9xqj3s",
            "score": 1,
            "text": "Has nobody mentioned that we do this with organ transplants? Another situation with limited resources where people who engage in harmful behaviors are disfavored to healthier people",
            "title_similarity": "0.71837556",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9xqj9a",
            "score": 1,
            "text": "Sounds like a hospital policy. If they’re privately funded, sure, but the government has no place deciding who can get treatment and when.",
            "title_similarity": "0.7238387",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9xqrt0",
            "score": 1,
            "text": "How can you can opinion that should be law.",
            "title_similarity": "0.29800156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xqxon",
            "score": 1,
            "text": "I think they should be given the highest priority actually",
            "title_similarity": "0.21336961",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xr1rc",
            "score": 1,
            "text": "I cannot believe how many upvotes this post has…",
            "title_similarity": "0.25812948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xr1xc",
            "score": 1,
            "text": "People that have been vaccinated shouldn't need ventilators or hospital beds due to covid...",
            "title_similarity": "0.7764672",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xrctu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xrmro",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xrydz",
            "score": 1,
            "text": "Discrimination.",
            "title_similarity": "0.15639472",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xs395",
            "score": 1,
            "text": "They pay for the service, either thru tax, or thru insurance, so they have every right to the service as anyone else, regardless of wether or not they accepted certain chemicals into their bodies.",
            "title_similarity": "0.4813967",
            "sentiment_compound": -0.4639
        },
        {
            "id": "h9xsar4",
            "score": 1,
            "text": "So if you voluntarily don't wear your seat belt and you are in worse condition in a car accident than the ones that were wearing a seat belt, they should get priority treatment?",
            "title_similarity": "0.60285383",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h9xscqn",
            "score": 1,
            "text": "I think there should be some type of way",
            "title_similarity": "-0.013931371",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xsu6c",
            "score": 1,
            "text": "Let me just point out that there are doctors now saying they will refuse to treat patients that choose to remain unvaccinated as well as hospital staff saying empathy is waning for those sustaining themselves on misinformation and later being admitted with severe covid and begging for the vaccine. These healthcare workers have been pleading with the public since the start of the pandemic to do their part to keep themselves and those they love safe, but when you have so many people willfully undermining proper safety precautions and ignoring science, these people don’t just endanger themselves but run the risk of making the virus more virulent and rendering the vaccines completely ineffective. And then what? Another worldwide lockdown? Diabetes, smoking, obesity, etc., I’m sorry to say, will not cause the same",
            "title_similarity": "0.8599716",
            "sentiment_compound": -0.903
        },
        {
            "id": "h9xt0j3",
            "score": 1,
            "text": "How about no priority?",
            "title_similarity": "0.15887915",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9xt9ad",
            "score": 1,
            "text": "I don't think we want to encourage medical professionals to base who gets treated first on their own moral judgments--even if they coincide with ours. That seems like a bad direction for society to go. (What if, one day, doctors feel *you* don't have the moral character that's deserving of priority treatment?) Just as everyone has the right to legal council when charged with a crime, everyone should (even if, alas, they don't) have the right to receive medical attention when they needs it. \n\nPriority should go to those who need it most, and if two people equally need it--and there's only the ability to treat one, I'd favor a coin flip over doctors becoming judges of who's the better person. \n\nIf we want to place sanctions on folks refusing to be vaccinated, it should be maybe done by laws, tax codes, businesses refusing to serve/employ, and so on. Doctors should simply be doing their best to cure the sick.",
            "title_similarity": "0.7872603",
            "sentiment_compound": 0.3773
        },
        {
            "id": "h9xtcgi",
            "score": 2,
            "text": "Voluntarily unvaccinated people should have a tent set aside for them with none medical professionals' help.",
            "title_similarity": "0.6658803",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h9xtffr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xtge7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xtho2",
            "score": 1,
            "text": "Well, in that case the hospitals should prioritise people with healthy life style, exercise, no smokers etc etc. Because that's also for free, available to everyone and stupid thing not to do.",
            "title_similarity": "0.7265781",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9xtm9o",
            "score": 2,
            "text": "Even less than that, they should be sent home.",
            "title_similarity": "0.30953965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xtuoh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xu2y2",
            "score": 1,
            "text": "This is not how medicine works. You start doing this, and the entire system of \"help someone who needs it, regardless of who they are\" breaks down, and you give people far too much power over the lives of others. \n\nEveryone was warned that the US healthcare system would be overwhelmed, but y'all fuckers didn't take it seriously. You just wanted to get back to normal life so you could shop when you want to do, and not wear a mask, and not feel uncomfortable about telling others wear masks.\n\nY'all posted stupid fucking memes and jokes and didn't say anything when your relatives or friends or coworkers said something stupid or didn't wear a mask or didn't get a vaccine. You didn't step up, and you let the misinformation continue.\n\nThis is where we are right now, and it's not just the fault of the people who continued to live in ignorance, It's also the fault of everyone that didn't try to stop them, or ignored the opportunities to say something, or didn't have enough fucks to argue back with their stupid family. This was a collective effort.  This is why public education fucking matters, and why voting matters, and why you should care whether some random person you don't know gets the education they need to be a better person.  This is why everyone should have universal healthcare, With access to preventative healthcare.\n\nFuck, why isn't basic human healthcare information publicly provided by our government? Why can't we go to healthfacts.us.gov and have access to basic preventative healthcare information? \n\nFuck. Greedy, selfish bastards.",
            "title_similarity": "0.86049366",
            "sentiment_compound": -0.9821
        },
        {
            "id": "h9xu8yc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xua0m",
            "score": 3,
            "text": "This supports your view.\nTheres a drastic difference between lifestyle or having a mental illness causing you to behave poorly and those who act AMA (against medical advice). I have a really hard time feeling bad for people who go ama and then get significantly worse or have the health thing they where warned about happen.",
            "title_similarity": "0.7107446",
            "sentiment_compound": -0.8329
        },
        {
            "id": "h9xub1f",
            "score": 1,
            "text": "Absolutely agree. You make a good point with mentioning McDonalds and people smoking a pack a day too - this isn’t just a covid issue. There should be a priority for people who actively take individual responsibility i caring for their health. If you aren’t doing anything to help yourself get more healthy, then you should be given low priority. Especially with the vaccination though where it takes minimal effort to book and get your shot; if you voluntarily choose not to then you’re bottom of the priority list IMO.",
            "title_similarity": "0.7375313",
            "sentiment_compound": 0.9298
        },
        {
            "id": "h9xujum",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xuloo",
            "score": 1,
            "text": "That's a really dangerous precedent to set.\n\nAnd why just vaccination?\n\nPerson one is a hermit, lives alone with cats, works from home, gets groceries delivered, and is unvaccinated. \n\nPerson two is vaccinated, but is going to all sorts of packed parties, drinks, smokes, has diabetes and heart disease from living off fast food.\n\nSo person one automatically gets bumped?\n\nWhat about someone who is a taxpayer vs someone who owes millions in back taxes?\n\nWhat about a person in jail for a minor crime vs serial rapist and murderer?",
            "title_similarity": "0.7271428",
            "sentiment_compound": -0.9361
        },
        {
            "id": "h9xuq4m",
            "score": 2,
            "text": "I agree, it's super cruel that unvaccinated people are more likely to get it and everyone who did everything right, masks always on got the vaccine may not be able to get help because some person who said it wasnt real took their spot.",
            "title_similarity": "0.8237089",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h9xvhph",
            "score": 1,
            "text": "I too believe in breaking the Hippocratic Oath.",
            "title_similarity": "0.4819379",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xvu7a",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xvy16",
            "score": 2,
            "text": "I think a better alternative would be for insurance companies to deny their claims, rather than hospitals denying treatment.",
            "title_similarity": "0.5909346",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h9xw1t8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xwled",
            "score": 1,
            "text": "Inhumane",
            "title_similarity": "0.17327061",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xwnv3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xwnye",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xxa8y",
            "score": 1,
            "text": "One probably violates HIPA, two if the vaccine works why isn’t it working, three it isn’t FDA approved nor will manufactures be held liable",
            "title_similarity": "0.6977289",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9xxk8r",
            "score": 1,
            "text": "I'm not going to argue against the idea that vaccine hesitancy increases the burden on the system by comparing it to other decisions. Because the obvious counter is that covid is a special case with stretched resources. That point is irrelevant.\n\nThe simple reason to not do this is that if you decide that you as a doctor can violate the Hippocratic oath and play God in who you save, simply because you have a strong non medical reason against a group of people, you can bet your boots that tomorrow, some other doctor will play God with a strong non medical reason that excludes YOU or someone you love.\n\nThis is the entire reason why the Hippocratic oath exists. You swear to treat everyone, irrespective of race, religion, criminal status, terrorist status, it doesn't matter. That's the moral buy in price you pay, in exchange for the power to save or not save someone's life.",
            "title_similarity": "0.8328879",
            "sentiment_compound": 0.9049
        },
        {
            "id": "h9xxkft",
            "score": 1,
            "text": "Yes, start triaging people. If they haven't gotten vaccinated yet, let them die. It's apparent that Delta has evolved to be vaccine resistant and vaccinated people can get sick. They played by the rules treat them first.\n\nI said something similar at the start of the pandemic when wearing a mask became political. I was fine with people not wearing a mask, as long as there was an understanding that they wouldn't be prioritized when they got sick\n\nAnyone over the age of 18 that hasn't gotten vaccinated yet is a conscious decision to not get it and they should go to the back of the line or just stop treating them and let them die.\n\nAlso, we should give our excess supply of vaccines to areas that need it. If you haven't gotten it yet, then you obviously don't want it, which is fine, but let's give them to other parts of the world that need it.",
            "title_similarity": "0.81038916",
            "sentiment_compound": -0.5734
        },
        {
            "id": "h9xxnq4",
            "score": 1,
            "text": "When rationing care there are lots o factors considered. Survivability is one of them. It is lower in the unvaccinated. It certainly should factor in.",
            "title_similarity": "0.49717227",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h9xxpbp",
            "score": 1,
            "text": "The vaccine is more deadly than the virus for me",
            "title_similarity": "0.5856626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xxu8d",
            "score": 1,
            "text": "My wife is an ER nurse and I will gladly say fuck anyone not vaccinated and that has the succ that goes to the ER. You should be kicked out and refuses service because you are the problem. People who cannot get vaccinated are obviously different, but where I live, 98% of cases in the ER are unvaccinated people. Grow up, get the shot or gtfo. You can’t refuse the advice of medical professionals then require their service for what you refused. You can’t have your cake and eat it too.",
            "title_similarity": "0.8678881",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h9xxueg",
            "score": 1,
            "text": "Right now that would be immigrants crossing our southern border. I don't think you would refuse them access to health care.",
            "title_similarity": "0.5737003",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9xxx1g",
            "score": 1,
            "text": "Sure put the non vaxxed at the end of the line, but realistically the vaccine is only to protect yourself, you can still contract covid YOU just don’t get bad symptoms, you can still be a carrier. People who don’t get the vaccine are 2 types of people; covid non believers or people who think they are healthy enough to survive covid on their own",
            "title_similarity": "0.7673124",
            "sentiment_compound": 0.431
        },
        {
            "id": "h9xxyb1",
            "score": 1,
            "text": "The other day I drove by a hospital near me and saw and massive a crowd of anti-vaxxers and Trumpers standing near the hospital entrance. Obviously, no masks, no vaccines, no social distancing. It made me wonder how many of those same people would likely contract COVID from the event and end up in the same hospital they were protesting outside of. I couldn't believe how disrespectful such a display was to the healthcare workers and patients trying to go to the hospital.",
            "title_similarity": "0.77114075",
            "sentiment_compound": -0.3013
        },
        {
            "id": "h9xy7h5",
            "score": 1,
            "text": "Medical treatment priority should absolutely not be used as a way to punish those who do not do what you think they ought to do. I agree that the evidence is so overwhelmingly clear about the safety and efficacy of the vaccine that you'd have to be a moron not to get it.\n\nBut I can assure you that deciding not to treat somebody as payback for doing something dumb is so unfounded from an ethical and moral standpoint. It's just downright childish and immature.\n\nIt is also very dangerous. I believe that's due in large part to the breaking of these ethical and moral standards. Standards which are the foundation for modern medicine.\n\nLet me explain why.\n\nFirst, I believe this would break the hippocratic oath (\"first, do no harm...\" or something like that), and doing so would be a slippery slope. How else would they decide to withhold treatment if they do that? I can assure you that what you're saying is not that far off from outright eugenics. \n\nI'm sure that most medical problems are caused by a patient doing something they really shouldn't have, so I really hope that if you're ever in the emergency room for something you could've  prevented that you'd see why covid induced case of ARDS still has to be treated for every dumbass who believes the vaccines will hook them up to some 5g spy network.\n\nDoctors have an obligation to treat anybody and everybody who needs it, and that's why you have medical centers with emergency room treatment that cannot turn someone down no matter what the reason is for their medical emergency.\n\nAnyways, the point is that stupid patients often require additional emergency aid when they don't listen to doctors, but that doesn't mean they should be turned away from medical care.\n\nAnother part of this slippery slope is that a medical professional who is overworked, lacking sleep, and running solely on the decades of training and practice they have aren't of the mind to decide that somebody doesn't deserve treatment. Their best abilities are in deciding how to treat sick patients, not in deciding whether that person is worthy of said treatment. \n\nI can only imagine the shit show in malpractice cases that would ensue when doctors falsely believe the patient did something or believed something that made them more sick. What if somebody has a genetic disease that causes severe clotting of the blood? What if they have a pretty solid reason for being concerned about the vaccine in an anecdotal and well informed situation? Doctors make mistakes, and you don't want that mistake to be based on an opinion about deserving treatment. That's how people die.\n\nNobody is perfect, so even doctors will have moments of closed-minded decision making, and will subconsciously alter their treatment if they don't like a patient, but that's why hospitals and medical practitioners have so many ethics based rules, regulations, and standards, along with boards of trained, veterans and professionals to enforce and guide practitioners away from the bad medical practices you suggest here.\n\nNot only is it that a medical practitioner shouldn't be deciding how to treat someone based on perceived worth, but the biggest reason in my mind has to be the epidemiological consequences of tiering treatment in the way you describe.\n\nCOVID-19 is a serious disease because it is so highly infectious. If somebody who was too dumb to get the vaccine has treatment withheld, what you're saying is that doctors should put these dumbasses back out into the world to spread the disease far more than if they actually received medical care.\n\nFrom this, I'd even say that the dimwits who think the vaccine will hook everyone up to a 5g spy network should get precedence in treatment, because I do not trust them to understand how a virus smaller than the cells in their body could be transmitted through the air, nor do I trust them to understand how to prevent that from happening.\n\nThis encapsulates the entirety of my viewpoint: failing to uphold the hippocratic oath to treat those who are sick regardless of whether you deem them worthy or not has serious, ethical and moral contradictions that have wide-ranging, negative consequences for overall public health. \n\nI truly believe that you have no idea how difficult the medical profession is, and I would kindly ask that you keep your viewpoint to yourself on the matter, because the last thing we need is medical vigilantes making an already bad crisis any worse.",
            "title_similarity": "0.8596271",
            "sentiment_compound": -0.9792
        },
        {
            "id": "h9xygw9",
            "score": 1,
            "text": "Just in practical terms it would be such an utter waste of time and resources, and lead to avoidable inefficiencies if decisions to triage treatment had to go through some (any) additional parallel metric not relating to need and availability. Not to mention the sort of auditing you'd have to do to work out reliably who was vaccinated and who wasn't and who of the people who weren't were given the opportunity to be so, had no medical reason not to, and didn't anyway. No one has the time or resources to mount that kind of inquiry in a crisis situation.",
            "title_similarity": "0.8018654",
            "sentiment_compound": -0.6913
        },
        {
            "id": "h9xyhsi",
            "score": 1,
            "text": "I think they already are in some places. Like, if 72 yo vaccinated Dorothy needs an x-ray for a possible broken hip, she's going to get it before 36 yo unvaccinated Brent who's coughing up a lung.",
            "title_similarity": "0.6223507",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9xylsh",
            "score": 1,
            "text": "You and doctors agree. We're not wasting resources on people who chose to not get vaccinated here.",
            "title_similarity": "0.64435625",
            "sentiment_compound": 0.5801
        },
        {
            "id": "h9xyoka",
            "score": 1,
            "text": "Go take some cow dewormer and leave the ICU beds for the people who want them, not people who talk shit and ignore a life saving vaccine and then lose their conviction when their lungs stop working and suddenly beg for the wonderful doctors to save them and for all the prayers Facebook friends can pray",
            "title_similarity": "0.80074584",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9xyusi",
            "score": 1,
            "text": "Just to add one more thing: I’d they get COVID, the insurance should not cover the costs.",
            "title_similarity": "0.65858036",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xz241",
            "score": 1,
            "text": "We have so many good vaccines? According to who? You? Who the fuck are you? Get your head out of your ass you scum bag piece of shit.",
            "title_similarity": "0.6752646",
            "sentiment_compound": -0.8549
        },
        {
            "id": "h9xz3ua",
            "score": 1,
            "text": "People who volunteer not to take a vaccine because they have an autoimmune condition that could cause a harmful reaction and their doctor has advised they not take it should be given the lowest priority for hospital beds/ventilators.\n\nAnd next...\n\nPeople who volunteer not to take a booster shot eight months after their second shot should now have lower/the lowest priority for hospital beds/ventilators.",
            "title_similarity": "0.79494",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h9xz8cd",
            "score": 1,
            "text": "Obese people should be given lowest priority for heart disease treatment.\n\nSmokers should be given lowest priority for cancer treatment.\n\nMotorcycle riders that don't wear helmets should be given lowest priority for head trauma.\n\nAddicts should be be given lowest priority for therapists.\n\nHow the fuck did this stupid virus cause so many people to be disgusting towards people that have a different opinion?",
            "title_similarity": "0.7522174",
            "sentiment_compound": -0.9709
        },
        {
            "id": "h9xzera",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9xzh7m",
            "score": 1,
            "text": "Honestly. Anybody who doesn’t take care of themselves and then wants medical attention to solve all of their problems should get fucked. \n\nI’m in favor of a better health care system in America if it doesn’t prop up these lazy pos who want things to be take care of for them. I’m all for having my teeth cleaning being less than 200$ per visit. That shits dumb. I don’t want to pay for someone else to have gastric bypass surgery bc they eat to much and never exercise. I’m fine helping someone who gets breast cancer randomly, they obviously need help. I don’t support the person who gets lung cancer after smoking for 40 years.",
            "title_similarity": "0.8762498",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h9xzjzl",
            "score": 1,
            "text": "I see you arguing that people who are obese etc are separate from those who choose to be unvaxxed because it is something that is harder to change. I think you have to consider it from an unvaxxed persons perspective. They truly believe the vaccine will hurt them or even kill them. \n\nBecause that’s the case, perhaps we should look at them with more of a mental illness or delusion type stance in mind. If they seriously have delusions then they are definitely candidates for that “hard to change” category. \n\nExplains how some people can see their family die from covid and still not get the vaccine.",
            "title_similarity": "0.78641915",
            "sentiment_compound": -0.93
        },
        {
            "id": "h9xzqnt",
            "score": 2,
            "text": "So with this school of thought, should those experiencing seizures, GI bleeding, drug induced encephalopathy due to a drug overdose, should they be sent to the back of the line for his/her “bad decision” oppose to someone with the same condition from unknown causes? Again, consistency here is key\n\nYour precious statement of other people decisions affecting others health- how about a drunk driver in a MVA needing hospital care in a loaded ER",
            "title_similarity": "0.6643989",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9xzz0f",
            "score": 1,
            "text": "Y’all will need the room when ADE really kicks in this autumn.  Enjoy!",
            "title_similarity": "0.29201373",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h9y046v",
            "score": 1,
            "text": "I'm gonna need someone to change my view too, bc I'm right there with you.",
            "title_similarity": "0.3193032",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y0bu0",
            "score": 1,
            "text": "I'm afraid that as peeps have said, its a potentially slippery slope. Where do you draw the line on health choices? Specifically, other vaccines, for example? Secondly, you mention not using social / economic systems as a metric: but it's quite easy to make data connections between poor health choices and socio-economic status. So even if you don't, you still kinda are.",
            "title_similarity": "0.72273207",
            "sentiment_compound": 0.1279
        },
        {
            "id": "h9y0c40",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09221054"
        },
        {
            "id": "h9y0cbr",
            "score": 1,
            "text": "Yeah the anti Vaxxers are idiots and piss me off too but this isn’t the right way to punish them. Everyone deserves the right to free healthcare when they are in need.",
            "title_similarity": "0.8173351",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h9y0hb2",
            "score": 1,
            "text": "Your gonna catch/spread covid with or without a vaccine, so what's the purpose of a vaccine that offers no protection? Don't let government and private entity's control your body, especially with zero liability for BIG PHARMA/GOVERNMENT/EMPLOYERS, they are exempt  from being held legally liable(PREP ACT) for long term side effects the vaccine may cause...ie....enlarged hearts and blood clots.",
            "title_similarity": "0.85578465",
            "sentiment_compound": 0.4284
        },
        {
            "id": "h9y0l5s",
            "score": 1,
            "text": "Vaccinated people aren’t taking up bed/ventilators and if they are than what was the point of them getting the vaccine?",
            "title_similarity": "0.7081001",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y0o9c",
            "score": 1,
            "text": "I agree 100% with OP.",
            "title_similarity": "0.09387107",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9y0vwq",
            "score": 1,
            "text": "By this same token, people who don’t own guns should be given the lowest priority for police assistance. Or people without fire extinguishers or smoke alarms should be a low priority for the fire department. Or if you don’t take care of your car, a mechanic shouldn’t help you when it inevitably fails catastrophically. \n\nAfter all, if one won’t take responsibility for themselves, why should expert services help them?",
            "title_similarity": "0.7331767",
            "sentiment_compound": -0.0936
        },
        {
            "id": "h9y0vwr",
            "score": 1,
            "text": "Yes.",
            "title_similarity": "-0.17013693",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9y10uo",
            "score": 1,
            "text": "The problem with everyone’s “slippery slope arguments” is that at no time in the history of modern medicine has a single demographic (the willfully unvaccinated in this case) or disease (covid) overrun the medical system such that others could not be treated. Obese people don’t get turned away for heart attacks, even if you could argue they brought it upon themselves, because the resources existed to treat both them and the poor kid who was accidentally stung by a bee and is having an allergic reaction. \n\nThat is why we’re at a point of “punishing” (or rather, holding accountable) anti-vaxxers - because others are suffering as a result. Trust that if eating tide pods ever got to a point that gun shot victims could not receive emergency care, people would be calling for the same type of discrimination against tide pod eaters. But the fact of the matter is that, absent covid, we have never - and it is very unlikely that we would ever - reach that point with any other disease/ailment.",
            "title_similarity": "0.87478125",
            "sentiment_compound": -0.7329
        },
        {
            "id": "h9y138w",
            "score": 1,
            "text": "Doctors and nurses don’t get to (and shouldn’t get to) make a moral judgement about whether or not someone deserves to get adequate treatment or not (and potentially die). Their job is to save lives. No matter who the patient, the hospital shouldn’t get to assign what could be a death penalty because of a conflict of beliefs.",
            "title_similarity": "0.79791915",
            "sentiment_compound": -0.2565
        },
        {
            "id": "h9y18l6",
            "score": 1,
            "text": "Why not just refuse service to them… we’ll really thin the herd",
            "title_similarity": "0.5854485",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h9y1bz4",
            "score": 1,
            "text": "I disagree. I believe the old and especially the very fat should be the ones given last priority. We are being lockdown cause of them, this is a pandemic of the unhealthy. Make gyms free and force fat people to lose weight, then you will see how quickly this virus \" goes away \"",
            "title_similarity": "0.74469125",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9y1hua",
            "score": 1,
            "text": "Yea and fat people should be forced to park in the back of the Walmart parking lot",
            "title_similarity": "0.49371946",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9y1mrv",
            "score": 1,
            "text": "Give them a tent on the hospital lawn with the internet cure of there choice. Save the ICU beds for those they infect",
            "title_similarity": "0.5658981",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9y1nvk",
            "score": 2,
            "text": "A lot of people are comparing your argument to refusing to treat obese people which is a terrible comparison. What about the aids epidemic, should people who have unsafe sex be refused treatment for aids because they are effectively super spreaders? It's common sense to not share needles or use protection during sex yet theres still people who refuse and will spread diseases. I think it's cruel to refuse treatment to people who didn't get the vax or people who share needles. You are just looking at is as a politcal issue \"these stupid drumpf fans dont want vaccine\" instead of seeing it as \"uninformed people are afraid to get vaccinated\". Also Your argument is discriminatory against poor people and minorities because they're less likely to trust the vaccine, do you think they should be refused treatment?",
            "title_similarity": "0.82491714",
            "sentiment_compound": -0.9396
        },
        {
            "id": "h9y1ula",
            "score": 1,
            "text": ">I firmly believe that healthcare should be denied to no one regardless of their economic or social conditions.\n\nAnd then OP then denies healthcare for someone's social conditions suggesting that since they have a 99.996% of not needing a hospital bed they may not like the idea of the completely experimental shot with a 4% requires-a-hospital-stay rate. So they try to pass on their American privileges and hope the vaccine production can be forwarded to people in who need it in a 3rd world country worth no real access to ICU levels of healthcare.\n\nHmmm... Fascinating.\n\n> YOU are being a burden on an already overloaded (in some places) healthcare system, which could have been avoided by taking a goddamn shot.\n\nYou realize that list of \"you\" is about [23,000 people](https://www.worldometers.info/coronavirus) in the USA right now and none of them care about Reddit enough to hear you right? Plus we're overlooking the fact that some of them in that number are there due to getting the vaccine or they are already vaccinated.\n\nAlso, there are about [919,559](https://www.aha.org/statistics/fast-facts-us-hospitals) staffed beds in the USA. So those serious cases of COVID19 represents about 2% of the patient capacity. The problem is, like a airplane, hospitals are only built with the minimum number of beds they expect to use. Why pay the staff to stand next to an empty bed and why build a room to house an empty bed?\n\n>EDIT: I don't think all the obese/smokers/alcoholics arguments work, because\n\nYour medical degree and extension research has convinced you smoking doesn't affect the people around the smokers and COVID patients are none of those?\n\n>Too many comments!\n\nYeah, quickest way to learn something is to post something wrong on the Internet. Read them as fast as you can through, Reddit Mods will delete any comment providing citable research for reasons not to. And the user base will bury everything that doesn't agree with the paid-for media trend.",
            "title_similarity": "0.91693455",
            "sentiment_compound": -0.9542
        },
        {
            "id": "h9y1ywl",
            "score": 1,
            "text": "I am unvaccinated and I gladly accept this. Like 90% of hospitalizations are for fat people, and the rest are for people who are already over life-expectancy age. I'm young and healthy. Already got it and it wasn't that bad. My 87 friends who already got it were young and healthy and it wasn't that bad. Now let me die in peace you busybodies!",
            "title_similarity": "0.6483687",
            "sentiment_compound": 0.9617
        },
        {
            "id": "h9y207v",
            "score": 1,
            "text": "Get fucked buddy, poor people who refuse to pay for healthcare should get lowest priority. Especially the ones who complain on social media from their 1400 dollar smart phones",
            "title_similarity": "0.7526127",
            "sentiment_compound": -0.91
        },
        {
            "id": "h9y221a",
            "score": 1,
            "text": "I think they should go right next to smokers and anyone who has medical problems resulting from being overweight. Also, anyone who has any injury or illness as a result of intoxication or drug use. If you ever committed any violent crime as well, you should also have a pretty low priority since you are obviously a danger to others. I think we could really refine this list to prioritize care for the wealthy and healthy as they most likely have the most to offer society.",
            "title_similarity": "0.7242967",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h9y23ua",
            "score": 1,
            "text": "Sing a new song already",
            "title_similarity": "0.17565714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y25b7",
            "score": 1,
            "text": "People who are vaccinated still get Covid. If you carry a viral load, it still replicates. Lockdowns do not work. Sweden is unequivocal proof. Iceland is 100% vaccinated still has cases. I am in no way against vaccines. The actual truth is there is no cure, and very few people seem to remember the AIDS hysteria, and how many people infected were treated like monsters. If you get this vaccine, that is your choice and acceptable, keep in mind however, it will never be foolproof, and given the examples in action, even with everyone vaccinated, we all run a risk of carrying this. There is no scientific method being applied due to rampant fear mongering on all sides. No control groups or long term studies. “Life finds a way” is evolutionary standards, when a predator cannot take ahold of prey, it becomes stronger. We gave antibiotics in overuse, creating more resilient strains. Using vaccines with dead virus strains would be more logical in any sense. When viruses mutate, there are thousands of strains that appear. Pinpointing a specific strain is not done with a pcr test. It is absolutely impossible to isolate the strain type with that type of test. We simply need to treat each other with dignity, and stop living daily in fear. Until they can actually agree on treatment options, just like pneumonia, the flu and a myriad of sickness, the court of public opinion in any area is just causing people to be depressed or angry. I hope everyone remains well, the CDC has changed month to month, and Fauci has given horrible advice during the AIDS epidemic and recently Covid. A stranger to most of us, why would we hate or cause harm to anyone over a perfect strangers word? Please be kind out there. If you need the vaccine take it, if you cannot take the vaccine due to underlying health issues, you aren’t a demon. It is enough for us all to care for one another.\nThis isn’t Burger King folks, can’t expect a perfect answer in less than two years. And I would be hard pressed to believe the same people getting paid by manufacturers and remain on boards for them get approved for the Heath and concerns for everyone. And it is odd that every government leadership is not mandating vaccines for their parliament. \nMen and women who work in medical fields worked months in Covid units. If they aren’t vaccinated, why aren’t they all dead? If they had it, they carry immunity. The scientific method is being ignored completely because of hysteria.",
            "title_similarity": "0.8678752",
            "sentiment_compound": -0.9809
        },
        {
            "id": "h9y25mj",
            "score": 1,
            "text": "But vaccinated people can still get sick and transmit the virus.  Being vaccinated isn’t guaranteed protection.  IMO we lifted restrictions too early and relied too heavily on a vaccine.   This pointing fingering and playing the blame game isn’t getting us anywhere.   Quite frankly, I think the view of prioritizing healthcare is disgusting and low.  It’s scary how we can quickly dehumanize people when they don’t do what we want.",
            "title_similarity": "0.85023904",
            "sentiment_compound": -0.9688
        },
        {
            "id": "h9y2d6s",
            "score": 1,
            "text": "Doctors take an oath to do no harm. Implicit in that oath is that they will not choose who to give their best effort at medical treatment to based on that persons beliefs or previous mistakes.",
            "title_similarity": "0.7177207",
            "sentiment_compound": 0.6757
        },
        {
            "id": "h9y2dyq",
            "score": 1,
            "text": "So many emergency approved, safety test skipping vaccines being pushed like the corporations making them are fucking immaculate when they have some of the shadiest pasts.\n\nI won't play guinea pig for Pfizer or Johnson and Johnson.",
            "title_similarity": "0.86674947",
            "sentiment_compound": 0.5345
        },
        {
            "id": "h9y2g3o",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "h9y2i2y",
            "score": 1,
            "text": "Why should we change your view when you're right. There are some people who really can't get the vaccine, while still being \"voluntary,\" but those are very few cases. I also think someone's social media can be a factor, that if people are actively advocating against the vaccine, or covid deniers, the hospital should have an option as to whether or not this person should be admitted at all. Each new covid patient poses a serious risk to all the other patients on a covid floor.",
            "title_similarity": "0.842814",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9y2mn5",
            "score": 1,
            "text": "If you're going to do this you need to do it with all medical related things. Obese people who eat bad get low priority over someone who eats well etc. very slippery slope.",
            "title_similarity": "0.6939889",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9y2o5t",
            "score": 1,
            "text": "Now do obesity. And smoking. And drug and alcohol abuse.",
            "title_similarity": "0.31706718",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h9y2ppe",
            "score": 1,
            "text": "Its just the stupidity I cannot wrap my head around. I got into an argument with my niece about it yesterday. She isn't getting vaccinated because \"it doesn't feel right\" and she believes she will become infertile, while admitting to having not one reliable source. She is a kindergarten teacher... Yesterday there was an article in the paper about how pregnant women are put on their belly for oxygen, how the risks of them getting serious covid infection are much higher... I just don't understand at all",
            "title_similarity": "0.7207774",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h9y2pt6",
            "score": 1,
            "text": "I don’t get this post — it’s already how it works. It’s called triage. If you have only 20 respirator units, and 25 people need it, and 7 of those are unvaccinated, well it means the unvaccinated are much more likely to die from complications, thus the respirators will be prioritized towards the vaccinated.\n\nSame thing with hospital beds, and any other resource.",
            "title_similarity": "0.76182103",
            "sentiment_compound": -0.4703
        },
        {
            "id": "h9y38cx",
            "score": 1,
            "text": "No vaccine? No ventilator. Morgue is downstairs. Wait outside till they come get you.",
            "title_similarity": "0.5781763",
            "sentiment_compound": -0.0803
        },
        {
            "id": "h9y3bbx",
            "score": 1,
            "text": "Keep drinking that koolaid",
            "title_similarity": "0.21347158",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y3bct",
            "score": 1,
            "text": "What about improving the healthcare",
            "title_similarity": "0.27923465",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9y3dse",
            "score": 1,
            "text": "If someone is unvaccinated but ends up in the ER for a non-Covid related issue, they should be sent to the back of the line?  Someone's vaccination status has no bearing if they suddenly have a heart attack, stroke, or gets hit by a car.  The person could even test positive and have symptoms as well, but that still doesn't change the fact that they slipped in the shower and hit their head.\n\nAre there exceptions? Who decides what should and shouldn't be an exception?  Now you have lawsuits.  The hospital system is extremely taxed, and the last thing you want is an army of lawyers charging in demanding why Bob was pushed to the back of the treatment line.",
            "title_similarity": "0.7970511",
            "sentiment_compound": 0.7303
        },
        {
            "id": "h9y3e68",
            "score": 1,
            "text": "Thanks for giving an arguments against UBI.\n\n>\"It's universal... but some just get it faster than others.  This person can wait... and wait... and wait some more... oh look, the problem fixed itself!\"\"",
            "title_similarity": "0.5149025",
            "sentiment_compound": -0.4664
        },
        {
            "id": "h9y3em4",
            "score": 1,
            "text": "And fat people should get low priority for heart problems, smokers for lung problems, crackheads for overdoses, bikers for scrapes and bruises. Fear made you a fucking sociopath my friend.",
            "title_similarity": "0.6691966",
            "sentiment_compound": -0.2585
        },
        {
            "id": "h9y3hhj",
            "score": 1,
            "text": "I'll agree with you of you'll agree with the following\n\nLet's suppose in ten years time, people who were vaccinated are found to have developed MS, crohns disease or some other ailment that requires treatment.\n\nIf this happens then for those who argued that everyone should have the vaccine or suffer some form of ostracism from society or their health needs should be refused or given lower priority will in turn have their health needs given a lower priority.\n\nNow of course I hope this is never going to be the case because  also vaccinated, but should it turn out to be the case and given your advocating for punishment against those who aren't you're totally secure and safe in the knowledge that should something be discovered with the long term effects of the vaccine the pharmaceutical companies cannot be sued and governments cannot also be sued for financial aid for those affected.\n\nI assume that you're also happy with that knowledge.",
            "title_similarity": "0.75238574",
            "sentiment_compound": 0.1195
        },
        {
            "id": "h9y3jjm",
            "score": 1,
            "text": "/r/TopMindsOfReddit",
            "title_similarity": "0.14567992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y3jxs",
            "score": 1,
            "text": "Fat + older + unvaccinated = expected",
            "title_similarity": "0.2576284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y3l9i",
            "score": 1,
            "text": "Different angle, consider who's not getting vaccinated. \n\nhttps://www.nytimes.com/2021/08/12/nyregion/covid-vaccine-black-young-new-yorkers.html\n\nI struggle to see how it could be ethical to deny black and Latino/a persons access to medical care.",
            "title_similarity": "0.6755432",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9y3px0",
            "score": 1,
            "text": "Nope. People are prioritized according to who needs treatment the soonest, and who is most likely to benefit from treatment. Using your logic, they shouldn't treat people who do stupid things on skateboards.",
            "title_similarity": "0.6457547",
            "sentiment_compound": -0.3387
        },
        {
            "id": "h9y3voe",
            "score": 1,
            "text": "The hospital itself is a place where 90% of the population are there because of bad choices 🤣🤣🤣\n\nSo basically you’re saying 9-10 in a hospital should be moved to the back of the line. Then how do you prioritize those people? \n\nI need more dialogue",
            "title_similarity": "0.66313446",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h9y413x",
            "score": 1,
            "text": "I strongly agree with this sentiment to the point where I would flat out deny them Covid related healthcare. Don't turn to science to save you after shitting on the science for 15 months and screaming at the top of your lungs ''MuH RiGhTS'' and ''iTs A HOaX - a SkETcHy YouTube ViDeo TolD Me So''. The thing is - the crazies that think everything is a conspiracy are not getting the vaccine as a fuck you to all of us. Like not even because they dont believe it works - they legit are not getting it to make a point because they have the maturity of a 5 year old and the critical thinking skills of a warm carrot. And obviously their reply to the argument that the healthcare system is already overloaded is '' its not my problem that the healthcare system is overloaded that's something they should figure out''.   \n\n\nWhat I'm getting at is - these people are utterly selfish in every possible way and would WITHOUT A DOUBT take the spot of a cancer patient or similar. Its the same people that don't want their tax money to help kids or anyone else for that matter, but they're the first to file for PPP money from the government. Its the garbage of society that's holding the human species back with their stupidity and there is no winning with them just have to hope that natural selection takes its course because they have proven more than ever that no amount of access to education & information will change the idiocy.",
            "title_similarity": "0.82799864",
            "sentiment_compound": -0.7555
        },
        {
            "id": "h9y42qn",
            "score": 1,
            "text": "If your main focus is lowest priority then I would say people who knowingly ignore the health recommendations to prevent the spread of covid should have that place reserved. You can still have people who abide by said recommendations and yet don't want to take the vaccine. Anyway, priority should not be determined on past choices. It should be determined by the severity of current condition.",
            "title_similarity": "0.79289675",
            "sentiment_compound": -0.5938
        },
        {
            "id": "h9y45zp",
            "score": 1,
            "text": "So what’s next older, obese, developmentally disabled. Sorry you feel so passionate about the non vaxxers. Dictating who gets what care and when is exactly what the conservatives are worried about. Thank god this isn’t a thing .",
            "title_similarity": "0.75171494",
            "sentiment_compound": 0.8647
        },
        {
            "id": "h9y48dh",
            "score": 1,
            "text": "This view would ultimately disadvantage people who are already most mistreated by the medical system. It would most impact poor people and ethnic minorities, even if that isn't your intention that would be the outcome. I imagine you are thinking of people who buy into and spread conspiracy theories but those people still deserve medical care and the majority of the people you would be targeting would not be militant 'anti-vax' types, they would just be hesitant people who haven't got round to it yet, or can't risk feeling ill for a few days and missing work or not being able to look after their kids.",
            "title_similarity": "0.81401956",
            "sentiment_compound": 0.1468
        },
        {
            "id": "h9y4cvz",
            "score": 1,
            "text": "I would agree with this, but only for COVID treatments. If an unvaxxed person is going into labor, having a stroke, or some other emergency unrelated to COVID, they should receive the same priority as if they were vaccinated.",
            "title_similarity": "0.681249",
            "sentiment_compound": -0.3919
        },
        {
            "id": "h9y4eyd",
            "score": 1,
            "text": "Why not go one step further? Unvaccinated do not deserve the right to live. We must eradicate all unvaccinated as soon as possible!",
            "title_similarity": "0.6370846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y4f71",
            "score": 1,
            "text": "vaxxed people should really get of their high horse - you are not a hero or better than those unvaxxed. you have not done anything special, or usefull for that matter. just because someone tests positive does not mean they'll take up a hospital bed, in fact only a tiny percentage end up un the icu",
            "title_similarity": "0.79979134",
            "sentiment_compound": 0.3438
        },
        {
            "id": "h9y4iva",
            "score": 2,
            "text": "We have a system that brainwashes people, it's cruel to then punish those who are brainwashed. We absolutely need laws that hold news channels and media accountable for spreading misinformation. Right now, the news channels just pump out fear and anger 24/7, because it sells ad space. It is profitable to terrorize Americans with misleading news. How do we both reduce the terrorism of so-called news, without giving more power to propaganda? And the fine line is: how do we do that without eroding the Freedom of Speech? Because Freedom of Speech with the Right to Assemble was how women got the right to vote, how non-white people got the right to vote. If we cannot peacefully organize, we cannot fight for change in the future. It is a very tough problem, and I have not heard a perfect solution as of yet.",
            "title_similarity": "0.7025475",
            "sentiment_compound": -0.9863
        },
        {
            "id": "h9y4qn2",
            "score": 1,
            "text": "You’re basically just advocating for pendulum theory",
            "title_similarity": "0.2597949",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y50dj",
            "score": 1,
            "text": "Yes. I been wanting to make a petition for this",
            "title_similarity": "0.19498886",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9y53go",
            "score": 1,
            "text": "So you are saying/pontificating that the unvaccinated, which is the category I fall under due to a potentially life-threatening medical issue I have been battling where my body is immunologically attacking itself, deserves to basically die or be denied treatment because I did not cow-tow to what has been proven to be ineffective gene therapy?  Where one shot begets one booster after another?  Is this what I am reading and trying to comprehend?  Because I am afraid and have been counseled to not put something that is foreign in my body that could conversely trigger a death knell to my already overwrought immune system?  Did I get that right?  That I should be punished for already fighting for my life?\n\nWho fucking died and made you Hitler?  Get help, or get God or some sort of spiritually-grounding guidance, you malfeasant, puss-filled boil on the ass of humanity.  If I do die from my illness, you can be sure I will find your soulless meat shell  and haunt you for all eternity.",
            "title_similarity": "0.79850346",
            "sentiment_compound": -0.9851
        },
        {
            "id": "h9y55sw",
            "score": 1,
            "text": "Why would a hospital turn away a paying customer. No hospitals are overrun right now so what are you even getting at.",
            "title_similarity": "0.76280886",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9y56mu",
            "score": 1,
            "text": "People who use tobacco are still treated for lung problems, people who use Alcohol are still treated for liver problems, people who are obese are still treated for heart disease.\n\nYou aren't even saying unvaccinated people should be last for COVID-19 related problems. There are people who literally attempt suicide and are treated at the hospital. You're completely wrong in saying people who are taking risks or even bringing about their own demise don't deserve healthcare. It's wrong and it's gross.\n\nYou're simply scared of the latest boogey man and are willing to see people who die as a result.\n\nYour statement is equivalent to people who overdose on heroin shouldn't be treated because it's their fault.",
            "title_similarity": "0.829538",
            "sentiment_compound": -0.9846
        },
        {
            "id": "h9y5cp7",
            "score": 1,
            "text": "If you had the vaccine, why are you in the hospital? If the \"perfectly good\" vaccines you claim exist worked properly, this would be a non issue.",
            "title_similarity": "0.7090826",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h9y5gv9",
            "score": 1,
            "text": "As long as we can do the same to obese people who still eat fast food, diabetics who still eat carbs, and so on and so forth.",
            "title_similarity": "0.46333593",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y5ia8",
            "score": 1,
            "text": "If so they should also pay less taxes",
            "title_similarity": "0.40809494",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9y5l10",
            "score": 2,
            "text": "It’s almost like health care is not a right, but a privilege.",
            "title_similarity": "0.5176357",
            "sentiment_compound": 0.7024
        },
        {
            "id": "h9y5nww",
            "score": 1,
            "text": "What else would you suggest we could discriminate for? Maybe if someone is too old and they’ll probably die soon anyway? Maybe it’s a homeless drug addict on his 5th narcan trip this week? If we are willing to invoke medical apartheid there doesn’t seem to be a limit…",
            "title_similarity": "0.6444397",
            "sentiment_compound": -0.6641
        },
        {
            "id": "h9y5ny3",
            "score": 1,
            "text": "My only thought would be the crucial time wasted and energy tax placed on already overwhelmed hospital systems when faced with having to determine a) who is vaccinated and meets criteria op’s post suggests, b) who is being *honest* about the details shared (let’s be real, this is and will continue to be a problem) (are ICUs going to have time to search people in systems prior to admission or triaging - usually that comes during or after admission, correct?), and c) what happens when vaccinated beds are available but unvaccinated beds are at a crisis low point?… etc.\n\nI do truly see your point. But these are likely substantial flaws preventing from moving things forward in this manner.\n\nAlso, I could easily see certain hospital systems or those in certain regions opting to not make these same changes, which would then open them up for even worse space shortages due to implications of the systems that do choose to adopt these kinds of triaging mechanisms (EDIT: overflow moving to already full other areas).\nSo, from a non-moral-focused but more practical angle: wouldn’t this just be spreading around the problem instead of resolving anything?\n\nAgain, abstractly I see your thinking. But the specific applications would be less doable in practice.",
            "title_similarity": "0.79916465",
            "sentiment_compound": 0.327
        },
        {
            "id": "h9y5pvh",
            "score": 1,
            "text": "How about insurance refuses to cover them.",
            "title_similarity": "0.41924864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y5w91",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "ha2q287",
            "score": 1,
            "text": "No, i don’t think healthcare should discriminate against anybody for any reason",
            "title_similarity": "0.56984484",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha302wd",
            "score": 1,
            "text": "I think anyone who has refused to have the vaccine, become ill with the virus, should be made to pay for their hospital care here in the UK 🇬🇧 but also know these people no what a pushover the government here is, that they know they will receive the best care for free, takes the piss out of all of us for sure",
            "title_similarity": "0.90105283",
            "sentiment_compound": 0.9109
        },
        {
            "id": "ha35dfe",
            "score": 2,
            "text": "TBH fuck lowest priority, I think if you distrusted all the doctors begging you to take the vaccine and refused it, and because of that \"personal freedom\" you get covid and need a hospital ICU, you should stick to your choice and enjoy the same \"personal freedom\" to deal with covid freely on your own AT HOME, without doctors and nurses telling you what to do. After all they \"diD ThEIr OwN rESeArCh\" and know more than the experts, right? That's what they're all about, right?  \n\nWhy now that your antivaxx ass is dying should you trust the doctors to save you? And why should doctors risk their lives for you? When you selfishly endangered them and others by making a darn pandemic worse. I'm so done with these antivaxxers. So yea, I'd go further than OP: un-vaccinated should be refused at hospitals IMO.  \n\nHippocratic oath is \"do no harm\" but with these harmful antivaxxers that's akin to the \"tolerance Paradox\" -  the fallacy of being tolerant of intolerance. As soon as you're tolerant of intolerance, everything breaks down.",
            "title_similarity": "0.901727",
            "sentiment_compound": 0.6893
        },
        {
            "id": "ha4n1qc",
            "score": 2,
            "text": "I agree. In some places, the ICU beds are full. If you have a heart attack or a car accident, you're out of luck because morons don't believe in science. I also think that if you're on Medicare or Medicaid, unvaccinated, they shouldn't foot the bill if you wind up in the hospital with covid. If they don't believe in science to get a shot, then they shouldn't benefit from science when they need it to survive.",
            "title_similarity": "0.84872234",
            "sentiment_compound": -0.0721
        },
        {
            "id": "hahgbhc",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "hajt8wf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "haku6v1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0922106"
        },
        {
            "id": "haq9c5u",
            "score": 1,
            "text": "Even if you get the vaccine you can still get Covid so your point is invalid.",
            "title_similarity": "0.7656139",
            "sentiment_compound": 0.0
        },
        {
            "id": "haul5ov",
            "score": 1,
            "text": "I am an ER doc. We diagnose and  treat sick people. We decide if the treatment we can offer is of benefit to the patient, ergo placing a 96 yo with clapped out lungs on a ventilator may only prolong their death, not their life and so may not be offered.\n\nWe do not decide who is more deserving of care. Society does this and I have no problem with society encouraging adults who are taking a stand against the vaccine to double down and stay home rather than come to hospital. Once they arrive though, we are going to treat them- we are not judges, jurors nor executioners.",
            "title_similarity": "0.81010014",
            "sentiment_compound": 0.8527
        },
        {
            "id": "hazpq5q",
            "score": 1,
            "text": "Would you apply the same logic to people who continue bad diets, smoke, drink, and go to hospital for the same problems?",
            "title_similarity": "0.605575",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hb3t1tu",
            "score": 1,
            "text": "I’ll give 3 reasons. I, oddly enough, agree that as a society individuals still have a responsibility to use resources (medical and otherwise)…just because I can buy food and waste it doesn’t mean I should. And similarly, just because I don’t have to reduce my likelihood of getting hospitalized doesn’t mean I shouldn’t:\n\nPrioritizing care based on behavior becomes…slippery (you’ve already mentioned observing/smoking so I’ll use different examples). With the way abortion restrictions are happening in the US, should we prioritize rape victims over people who had BC fail over people who made a drunk mistake? Similarly, should we deprioritize people who take risky behavior (say an extreme sport player or hell, a person who wanders to dangerous areas drunk)? I’d wager more people go to the ER for drinking related injuries than almost any other cause. \n\nI’m vaccinated but didn’t expect to be until the one dose J&J vaccine came out. I have a severe needle phobia…I avoid medical care (and when I do, I’ll decline any IVs or pain management injections), I can’t even watch it in movies, and it causes me to faint. This isn’t an “I’m uncomfortable” thing…my heart rate and blood pressure drop. An estimated 10% of people have varying levels of this phobia so it seems unfair.\n\nMore importantly though, my parents aren’t vaccinated because they are minorities who lived through the revelation of the Tuskegee Syphilis Study. There are valid reasons that people are fearful of medical care (ie, governments/medical providers aren’t infallible and have behaved poorly).",
            "title_similarity": "0.8011502",
            "sentiment_compound": -0.9708
        },
        {
            "id": "hbqilps",
            "score": 1,
            "text": "💯. Fuck em.",
            "title_similarity": "0.17817518",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hcu3feq",
            "score": 1,
            "text": "By this logic then HIV patients who caught the disease from drug use or unprotected detected sex should not be allowed or given low priority",
            "title_similarity": "0.7227996",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hdqrzko",
            "score": 1,
            "text": "Sort of like the nazi’s made Jews the lowest priority",
            "title_similarity": "0.5168298",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hjbwukj",
            "score": 1,
            "text": "It’s like when there’s a hurricane or forest fires. You are ordered by the state to evacuate your home. If you choose not to follow those protocols, then you also understand no one will be coming to rescue you WHEN you need it. \n\nOr the inverse where experts are telling you of the danger. You choose to ignore it. And we still lose good people and heroes trying to save your stupid ass from the wreckage.",
            "title_similarity": "0.74449784",
            "sentiment_compound": -0.3612
        }
    ]
}