{
    "CMV: It should be illegal for a company to post they are hiring for a job without saying how much they are paying.\nThis should be the basic requirement for a Employer Employee relationship, The Employer says how much they are willing to pay for their position and the applicant's decide if they are willing to that job for the compensation.\n\nNone of this bullshit of either not saying the pay or requiring copious amounts of searching to find how much they are willing to pay.\n\nEmployees have to take time off of work or off their weekend go though a whole load of bullshit that is in applications like full work history giving references and other time consuming crap like getting a whole host of documents together, go though orientations and interviews and deserve to know that they are signing up for.\n\nMaking someone go though all that just to say \"We're paying a few bucks over the minimum oh and it's nonnegotiable, should be criminal.": [
        {
            "id": "hbmvmwy",
            "score": 1,
            "text": "/u/Andalib_Odulate (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/pi3j6x/deltas_awarded_in_cmv_it_should_be_illegal_for_a/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.54219955",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hbmt5e2",
            "score": 1,
            "text": "illegal? as in you can be imprisoned or executed for violating that law? \n\nI'm convinced that no government has the legitimate power that its people haven't given it. and if the people don't have the authority to give the government then the government cannot have that authority.\n\nthe best way to stop employers from keeping the wages secret is to convince people to ignore those positions.\n\nthat all being understood, sometimes the employers have no idea what your wage should be until after your interview. this is especially true for specialist positions and manager positions. it may actually be a really good thing that they don't specify a wage that will turn you off when if you actually applied you'd be offered much more.",
            "title_similarity": "0.82493734",
            "sentiment_compound": -0.5883
        },
        {
            "id": "hbn2kch",
            "score": 0,
            "text": "At the same time, if these job postings had to have the pay posted upfront, it makes the job search much more competetive for job seekers.\n\nGood paying jobs would get a lot of applicants, making it harder for people to get the job, and making it more work for the employer to sort through all those applications.\n\nI think by allowing employers to NOT give the pay rate up front, it gives a benefit to the prospective employee that they'll be more likely to get the job, and the employer who might not have the resources to sort through so many applications.",
            "title_similarity": "0.7169112",
            "sentiment_compound": 0.7
        },
        {
            "id": "hbn3zrn",
            "score": 0,
            "text": "Posting a range has bit us in the ass before. We pay very well, but people usually overinflate their value and expect they should get the top of the range. When they don’t get this amount, the employment relationship is resentful from the start because they inevitably feel snubbed. \n\nIn a lot of cases, we discover talents and skills during an interview so the candidate is hired above what the range would even be noted as.",
            "title_similarity": "0.6972407",
            "sentiment_compound": -0.154
        },
        {
            "id": "hbmoypu",
            "score": 20,
            "text": "This seems incredibly difficult to enforce.  Also, many places don't know how much they're willing to pay.  Especially for jobs that are more than a basic retail or fast food, pay is often commiserate on experience.",
            "title_similarity": "0.6190768",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hbmpwwn",
            "score": 131,
            "text": "The pay may be highly variable based on who is applying to the job. Someone with more experience would get more than someone without any. It wouldn't be fair to post either the low end or the high end as people would not apply (the highly qualified wouldn't apply if they marketed the low end). \n\nAlso, if you are looking for work your third paragraph is not true. If you are taking time off to go through \"a whole load of bullshit... like getting a whole host of documents together\" you are unprepared in general to be in the job market. You should have a resume prepared, as well as a list of references. Modifying it should take minimal time to meet the job you are aiming for if you are actually qualified. Also, I've never done an orientation without accepting a job.",
            "title_similarity": "0.80080616",
            "sentiment_compound": -0.8115
        },
        {
            "id": "hbn07ql",
            "score": 56,
            "text": "The government should only really be able to make things illegal if they are doing harm to people. \n\nPosting that they are hiring for a job without having that possible wage set in stone does not inherently harm anyone. \n\nNothing stops an applicant from asking what the wage would be right off the bat. Maybe some companies frown on that, but to me it is a courtesy. If they are not willing to consider my desired pay range, than why waste either of our time?\n\nIt also makes a lot of sense to be open to less experienced hires that will require more time and resources to train. Paying those people less than they would someone with several years of experience and proven skill is appropriate. But if they advertise the bare minimum wage that they will offer, it will likely prevent more experienced applicants from applying. \n\n&#x200B;\n\nNow I've responded to a job listing that did say how much it would pay, only to find out in the interview that it was significantly less than advertised. That is dishonest and a waste of people's time which could result in harm, and so I would support that being illegal.",
            "title_similarity": "0.84305465",
            "sentiment_compound": -0.9566
        },
        {
            "id": "hbno4vu",
            "score": 1,
            "text": "Employer-employee relationships are freely entered into and freely negotiated.  I think what you are saying is that you want employers to give up their negotiating position before the discussion begins.  This diminishment seems unworthy of any society that values liberty.\n\nI am opposed to **forcing** an employer to pre-disclose their salary range, for the same reason that I am opposed to a law that would require an employee to disclose what they earned in their last jobs.  Either side can ask for information and either side can disclose or not as they choose.",
            "title_similarity": "0.8992245",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hbmr4v1",
            "score": 7,
            "text": "There is no fixed salary to list.\n\nThey negotiate with each candidate. One with a ton of experience and a high level degree in the field will command a much higher wage than someone fresh out of college who only barley passed their class.",
            "title_similarity": "0.6853115",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hbn276m",
            "score": 8,
            "text": "You have stated in replies to some comments that a pay range would be acceptable. If this is the case there would be standard language stating that the pay range for xyz job is min wage to 400k a year (something that conveys little to no real information). This is similar to how most places have a 'xyz is an equal opportunity employer' at the end of job postings. \n\nI would also say that you're overestimating the time needed for an application. Slight adjustments to one's resume generally only takes a few minutes. Some places make you input a bunch of stuff but a lot of that is due to gov requirements for contractors, not the company. Don't send your references with you resume, say that they are available on request. Your references don't want a boat load of spam.",
            "title_similarity": "0.664019",
            "sentiment_compound": -0.4393
        },
        {
            "id": "hbmpdy7",
            "score": 633,
            "text": "Lots of jobs have negotiated salaries and aren’t hourly wage work. Why should they be required to not negotiate?",
            "title_similarity": "0.7705371",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbmzbz2",
            "score": 0,
            "text": "> requiring copious amounts of searching to find how much they are willing to pay.\n\nWhat is copious?\n\n> full work history giving references\n\nThose should already be prepared.",
            "title_similarity": "0.6179947",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbnbb0v",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.14975195"
        },
        {
            "id": "hbnhmcf",
            "score": 0,
            "text": "If your job is a commodity, you'll be paid as a commodity. It's the lowest that they can pay and still hire someone, and no, it's probably not negotiable. If you are applying for a job that requires knowledge, experience, and talent, then the wage is going to depend a lot on your knowledge, experience, and talent. Part of that knowledge is knowing your worth.  You need to be responsible for ensuring that you negotiate the highest salary or wage possible from the start, because once you're with the company, it's probably only going to be cost of living increases unless you advance within the company.   \n\nThat said, if they post the salary or range, it will only hurt you. Now they've taken away you're negotiating leverage because they can't go past that single or high number posted.  It wouldn't be \"fair\" to other employees.  \n\nThe only employer that should be required to post a range is government. Private companies should have the flexibility to pay based on need, merit, and current availability of talent.  Everybody wins this way. Except, of course, for those that refuse to demand their worth.",
            "title_similarity": "0.783974",
            "sentiment_compound": 0.9069
        },
        {
            "id": "hbni7ov",
            "score": 0,
            "text": "Here is the problem with that philosophy.\n\n3 candidates hired for 3 identical positions.\n\n1st candidate. Fresh out of community College, barely meets job requirements for education, no practical job experience.\n\n2nd candidate. Bachelor's education, meets recommended requirements for education, 3 years experience.\n\n3rd candidate. Same as 2nd, except with 10 years experience and relevant positive industry references.\n\nShould a company be required to pay all three of those the exact same wage, because they had to disclose it?\n\nIt is on you, the employee, to know your worth, and to ask relevant questions during the interview. If you are having an issue with taking time out of your schedule to interview without guarantees that the company is right for you, bear in mind, *that is the point of an interview*. They don't know if you'll work out either.  Interviews go both ways. They are seeing if you're worth hiring, and you are seeing if they're worth working for.\n\nGood questions that show you are thinking long term include asking about employee retention/churn, company culture, and compensation.\n\nThey don't owe you their budget range before you apply any more than you owe a car dealership yours as soon as you walk on the lot.",
            "title_similarity": "0.7062168",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hbnpixp",
            "score": 0,
            "text": "It is understandable to feel as if companies are being unjust to the working man/woman. But we are talking about a business, one that needs to negotiate salary in order to stay afloat. This is not meant to cheat people out of a good salary but what they can afford to pay. If you want to blame someone, blame corporate they are the ones that make the rules. Going through the long process of filling applications is part of life my friend, be happy that you have rights unlike workers had in the past. A lot of jobs let you use your LinkedIn for work history too",
            "title_similarity": "0.8178563",
            "sentiment_compound": 0.8726
        },
        {
            "id": "hbnqlvw",
            "score": 0,
            "text": "Colorado did that.. resulted in businesses leaving",
            "title_similarity": "0.40715972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbo5atd",
            "score": 0,
            "text": "You should know how much value you have. Do not let someone else set that value. End the end, you will not be happy, and they will not be happy.\n\nOf course, if you have to education and skill, then you get the minimum that the government states I should pay you.",
            "title_similarity": "0.78916216",
            "sentiment_compound": -0.381
        },
        {
            "id": "hbo7eqe",
            "score": 0,
            "text": "Are you going to be more upset that many companies don't post a pay range so you apply for an interview to decline the job?\n\nThen they sell the data you entered on their website to other companies to spam offers at you based on your information you provided.\n\nThere's websites that will tell you the pay ranges of places you are interested to as well as people leaving reviews of the company.  \n\nDon't ever go blind into an interview.  Read the reviews and ask them about their benefits.  Do they have a 401k match, HSA match as well as vision and dental?\n\nI'd take less money if a company offered me better benefits which saved me or gave me more money from the matches.",
            "title_similarity": "0.81169707",
            "sentiment_compound": 0.9315
        },
        {
            "id": "hbn3aqi",
            "score": -1,
            "text": "Should you have to post how much you are willi to be paid on your resume tou submit? How about you post what you'd take, and the employers decide if they want you or not?",
            "title_similarity": "0.7659128",
            "sentiment_compound": 0.168
        },
        {
            "id": "hbndgcm",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.14975195"
        },
        {
            "id": "hbmvrkh",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.14975195"
        },
        {
            "id": "hbn63yh",
            "score": -2,
            "text": "If you have to ask then you cant afford it. Same rule as restaurants with no prices.",
            "title_similarity": "0.65998226",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbnkr6q",
            "score": 2,
            "text": "If you force companies to do that, what you’re also forcing them to say is, “you are not worth the maximum amount we’ve budgeted for this position.” Its a conversation that no one wants to have. It also prevents you from negotiating higher. If you knew what the range was, you are, in a sense, consenting to a cap on your salary. \n\nWhat you are implicitly saying is that you don’t want to be lowballed, but in my opinion the way you should be thinking about it, is that you should be arguing why you should get more for your work.",
            "title_similarity": "0.85645604",
            "sentiment_compound": -0.7494
        },
        {
            "id": "hbmvdl3",
            "score": 49,
            "text": "I have a position I'm hiring for in a pretty niche market and skill set. There isn't a range of pay rates listed because I can fill the position with either an entry level person who we would train, or someone with a particular expertise and there is such an difference in the productive value of the work those two groups can do for me that I don't want to scare away an expert with a minimum or attract arrogant novices who think their worth the top of my range. \n\nI pre-screen applicants by phone before offering an interview to make sure there aren't any insurmountable road blocks. As you point out, going through the whole process to find out at the end that i can't pay them what they want is a waste of everyone's time and I don't want that. My time is valuable of course, but on a human level it matters to me that my employees understand that I respect them and their time, and that starts before they ever walk in to my front office. \n\nVery early in the screening process I ask what expectations they have for compensation as well as try to assess their level of experience. If they ask for more than I think their experience warrants, I'll say something like \"based on what I'm seeing on your resume and hearing from you now, I don't think we're going to make this work for those numbers. I'd still be happy to offer you an interview, you can show me your portfolio and we can talk in depth about the job and your experience. I'm happy to either be wrong or negotiate to a number that will work better for both of us.\"\n\nDoes this address your view or are you talking specifically about entry level jobs with cookie cutter interviews and offers?\n\nIs it acceptable to leave off compensation under some specific circumstances or is it your view that it is always wrong?",
            "title_similarity": "0.772074",
            "sentiment_compound": 0.9743
        },
        {
            "id": "hbmwd7j",
            "score": 12,
            "text": "Where I work we have salary ranges for salaried positions. People don't get hired at the low end of the salary range  and people don't get hired at the high end of the salary range. The high end is there only so existing employees who choose not to get promoted into higher responsibility roles can still receive raises.\n\nIf we simply just put salary ranges on postings without additional context it would confuse people. \n\nOur interns as internal employees have visibility over our salary ranges. When we make them offers for after graduating,  they often  ask for salaries on the high end of our ranges without knowing that's not really obtainable.",
            "title_similarity": "0.8345884",
            "sentiment_compound": -0.6522
        },
        {
            "id": "hbmqqe8",
            "score": 1,
            "text": "Then prospective employees should tell employers what they expect.  Employers go through interviews do background checks check references etc all while someone may turn down the job because it doesn't pay what they want \n\nAlso many jobs pay on experience.  One candidate has no experience another 5 years they may not get offered the same for the same job.",
            "title_similarity": "0.75645417",
            "sentiment_compound": -0.2509
        },
        {
            "id": "hbmrrez",
            "score": 71,
            "text": "Several states have taken action against this [issue](https://lewisbrisbois.com/blog/category/labor-employment/growing-nationwide-emphasis-on-pay-transparency-what-employers-need-to-know). I can't say how well the states can enforce the laws but I've noticed wages being advertised more frequently as well as states being excluded from national job offers.",
            "title_similarity": "0.7073487",
            "sentiment_compound": -0.1183
        },
        {
            "id": "hbmsvnv",
            "score": 1,
            "text": "Many companies have confidentiality clauses for salary so employees don't get mad when someone is hired at a higher wage. Also, it's nobody's business what I make and a simple search of employment ads would tell any what my salary is.",
            "title_similarity": "0.82701933",
            "sentiment_compound": 0.3875
        },
        {
            "id": "hbmt3rz",
            "score": 1,
            "text": "if they are looking for the perfect cog that they already know where it will fit, that makes sense.\n\nIf responsibilities of the job are negotiable with applicant experience and skillsets, determining what a fair offer would be in advance is difficult.",
            "title_similarity": "0.59759974",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hbn13c4",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.14975195"
        },
        {
            "id": "hbn36qn",
            "score": 1,
            "text": "The vast majority of jobs that have postings have negotiated salaries not a fixed salary. Because of this your type of all would have no benefit to people as every job would list the minimum salary possible and it would be upon everyone to negotiate for higher, which is already what they do.",
            "title_similarity": "0.8034687",
            "sentiment_compound": -0.357
        },
        {
            "id": "hbn7w9u",
            "score": 1,
            "text": "If you are in the industry with experience, then you should have an idea of what you are worth and what the going rate in the area is for your sort of position. After the interview process, they make you an offer. You have to negotiate and convince the prospective employer of that your value.",
            "title_similarity": "0.67695487",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hbn9sr6",
            "score": 1,
            "text": "what if they all just say they pay at least the legal minimum wage?",
            "title_similarity": "0.5740481",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hbnc365",
            "score": 1,
            "text": "The best you can do, if you think it is decent company, is just call or email the HR dept, or hiring manager. Ask them what the salary/wage range is before submitting your resume. Assume you won't get the top of the range they are offering, but do your calculation from the top, minus any experience you may be missing. If they don't respond or you don't like the answer, move on to the next job. All you can do.",
            "title_similarity": "0.8238857",
            "sentiment_compound": -0.2408
        },
        {
            "id": "hbndd4c",
            "score": 1,
            "text": "As someone who hires I would say that posting the salary would mean we wouldn’t have hired half the folks that work for us now. There isn’t always the person we are looking for but there maybe someone good. We get a wide range of people each time we post a position. Makes sense that we would have a wide range of offers. Right?",
            "title_similarity": "0.7219657",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hbndj6z",
            "score": 1,
            "text": "Am I the only one who asks what the pay range is for the position before I agree to an interview? Why would I want to waste both of our time?",
            "title_similarity": "0.7688806",
            "sentiment_compound": -0.1926
        },
        {
            "id": "hbne7wr",
            "score": 1,
            "text": "I would like if they would stop doing this but then again when they don’t I’m always going to go to the moon with my offer.",
            "title_similarity": "0.52701265",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hbnfkpr",
            "score": 1,
            "text": "CO passed that law this year.",
            "title_similarity": "0.22616784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbng61i",
            "score": 1,
            "text": "Should it also be illegal for an applicant to apply without including their actual salary requirement from the start?",
            "title_similarity": "0.7577522",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbngedq",
            "score": 1,
            "text": "It’s not impossible. I’ve worked as a hiring manager in Russia and Ukraine and you are required to state the salary up front in those countries. \n\nPeople are shocked when they learn that Americans have to negotiate salaries. \n\nDifficult to say if it’s a net positive or negative. Generally speaking, there is way more job security and worker protections in those countries but much less productivity. \n\nUltimately, many of their best and brightest seek to work in the U.S. even with the pro-management labor laws",
            "title_similarity": "0.72176504",
            "sentiment_compound": 0.9134
        },
        {
            "id": "hbnhkjg",
            "score": 1,
            "text": "More \"for the better good nonsense\"",
            "title_similarity": "0.23514855",
            "sentiment_compound": 0.5209
        },
        {
            "id": "hbni21g",
            "score": 6,
            "text": "There's been plenty of folks pointing out already why a listed range isn't always possible, so I would like to suggest a different tack: nothing says you can't be blunt and upfront with a hiring manager on the salary range you are looking for and get them to commit to an approximate go/no go up front. You can save everyone a good deal of guesswork and avoid the BS if it won't be a good match. I've found this works a lot better with recruiters than the actual managers. The danger, of course, is accidentally lowballing yourself. But this is where Glassdoor can be a really invaluable tool.",
            "title_similarity": "0.80775714",
            "sentiment_compound": 0.2332
        },
        {
            "id": "hbniqgh",
            "score": 1,
            "text": "They may be wondering what the available market is willing to take. There's a business here which has had the same ad in the paper for a year. People I know are saying it's because they're not offering enough money for the position. They are putting the pay in the ad. We think that he needs to be more open to what people are hoping to earn.",
            "title_similarity": "0.7437664",
            "sentiment_compound": 0.34
        },
        {
            "id": "hbnizu2",
            "score": 1,
            "text": "It's weird.. When we apply for a job, we are agreeing to trade hours of our lives for X amount of money. Is it rude to want to know how much money they're willing trade for our time?",
            "title_similarity": "0.7795427",
            "sentiment_compound": -0.25
        },
        {
            "id": "hbnkwc6",
            "score": 1,
            "text": "They'll just lie to your face about it later. Or you'll ask and they'll say it's negotiable but really it's for $7 less than what you're making now and they've wasted everyone's time, including yourself, the hiring manager, and the team lead along with their manager. All they had to tell you was what they wwre hiring at for the position and so much time could have been saved.",
            "title_similarity": "0.82895046",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hbnmlqe",
            "score": 1,
            "text": "It should also be illegal for a company to advertise how much you can make, by saying \"up to\" when they know that they start all new employees at a reduced rate and you need years of seniority to make the actual wage they advertised. And there's no guarantee that you can even hold that job, unless a bunch of people retire.\n\nLooking at you U.P.R.R.",
            "title_similarity": "0.86805296",
            "sentiment_compound": -0.6531
        },
        {
            "id": "hbnmlvq",
            "score": 1,
            "text": "My company does this and it's infuriating. \nCouple that with shit job titles and descriptions and there's no way we're getting quality applicants.",
            "title_similarity": "0.6825901",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hbnmmxb",
            "score": 1,
            "text": "I agree, but now I am curious.\n\nIs it legal to have things for sale in a shop without a price on them? (May depend on what country you live in.)",
            "title_similarity": "0.5975187",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hbnmo17",
            "score": 2,
            "text": "This is a law in Colorado now. So companies are like “you can work anywhere in the country except colorado” for remote jobs. It’s so fucked up.",
            "title_similarity": "0.60649765",
            "sentiment_compound": -0.593
        },
        {
            "id": "hbnoi6e",
            "score": 1,
            "text": "I kind of agree due to bias in my own field.\n\nNegotiations are one thing.  But unless I see a minimum, I am rather annoyed going in.  Especially in the social work field (which is my career path) where no pay listed could be a sign of really garbage pay for salaried work.\n\nI don't think it should state a set pay.  More of a possible range like \"Between 40k - 65k\" or a \"\\_\\_\\_k minimum\" so there is room for negotiation, but also some salary in a certain range guaranteed.",
            "title_similarity": "0.79629743",
            "sentiment_compound": 0.1852
        },
        {
            "id": "hbnoj5c",
            "score": 1,
            "text": "Colorado has done this.  Now we shall see if certain companies refuse to play ball, or what other fallout may ensue.  Im optimistic it will be good for workers.\n\nEdit: a word.",
            "title_similarity": "0.68008244",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hbnp120",
            "score": 1,
            "text": "Only improvement I can offer is that they should have to post the salaries of your hiring committee, your potential managers, and anyone else in your position or one like it, and be prepared to communicate discrepancies.\n\nBut also I'm a communist",
            "title_similarity": "0.7663709",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbnrp6x",
            "score": 1,
            "text": "Not liking something isn't enough of a reason for it to be outlawed. You can't just say something is unfair therefore it should be illegal",
            "title_similarity": "0.5811051",
            "sentiment_compound": -0.8384
        },
        {
            "id": "hbnt52e",
            "score": 1,
            "text": "This always comes up. Fair enough for lower paid jobs. But when you’re going for something well paid I don’t see the problem - salary bands can very quite wide.",
            "title_similarity": "0.6227546",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hbnt61p",
            "score": 1,
            "text": "Not all employees are worth the same pay.",
            "title_similarity": "0.43457952",
            "sentiment_compound": 0.128
        },
        {
            "id": "hbnuhgc",
            "score": 1,
            "text": "I disagree that it should be illegal - It should be the norm for job postings to list pay range, and posting a job without listing pay should be frowned upon by the business community and considered a generally shitty practice, but I wouldn't go so far as to legally mandate it.\n\nYou can always call a company and just ask them what the pay is for the posted job. I've saved myself a lot of time with recruiters by asking right off the bat what the pay is, finding its not to my liking, and telling them no thanks.",
            "title_similarity": "0.87984705",
            "sentiment_compound": -0.8099
        },
        {
            "id": "hbnutqa",
            "score": 1,
            "text": "In country I live in, it's required by law to show how much job pays. There are some jobs off market who doesn't say, but on the market it's a no go. Often you see a range of what you can make depending on  qualifications and ofc, the way you sell your self.",
            "title_similarity": "0.7897552",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hbnv49o",
            "score": 1,
            "text": "I like job postings that have range in them, a good company that understands their budget will put a range up, from min to max. Ive had a lot of moments in past jobs where I had reached the max pay without knowing it, asking for more then generally just made things bad and me leaving for something else. Just more transparency is all I ask from more companies and teams, startups etc.",
            "title_similarity": "0.6671069",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hbnwalu",
            "score": 1,
            "text": "I am looking for people with AWS skills I will pay 100-150k based on experience... I will pay up to 175 for the right person with the right skills. And in Australia at the moment it is hard to get anyone to apply and then to turn up for an interview. I guess I could put out 5 different roles but at the moment it is just a fishing expedition. I will employ any compedent person. The last person I did employ left for more money after 6 weeks. It's really just based on the skills of the person there is no way I could set an amount....",
            "title_similarity": "0.6211273",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hbnwfdz",
            "score": 1,
            "text": "It shouldn't be illegal but it should be how you judge the job poster",
            "title_similarity": "0.6002892",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hbnx9r2",
            "score": 1,
            "text": "Technology already solved this problem. Wage ranges for every job, with few exceptions, are available online. Know the market and know your worth. Take responsibility, don’t force others to give you the answers.",
            "title_similarity": "0.59647346",
            "sentiment_compound": -0.0323
        },
        {
            "id": "hbnxopf",
            "score": 1,
            "text": "I want to buy a TV. I'll post exactly that and see what offers are available with various prices and qualities. I know it's simplified and objectification  much. People are way more different than tv's are. I'm not going to say i'll buy a tv for 1000 bucks only because I might miss out on decent tv's for less or great tv's for what I would be willing to pay more for.",
            "title_similarity": "0.61174834",
            "sentiment_compound": 0.4804
        },
        {
            "id": "hbnxvhr",
            "score": 1,
            "text": "It is in Colorado, all job postings that someone in Colorado can fill including remote work but excluding jobs at sites exclusively outside Colorado must include a pay range and all benefits tied to the position, it is a law i would love to spread everywhere,  but it won't because its only good for workers, not corporations",
            "title_similarity": "0.7366181",
            "sentiment_compound": 0.9253
        },
        {
            "id": "hbny5ka",
            "score": 1,
            "text": "In the tech industry it's common for a company to not know how much it's going to pay someone ahead of time.  If someone comes in looking for an internship, meets that bar during the interview, then they might make a position for them.  If someone comes in with management experience and a lot of seniority they might make an exception for them.  If it's a smaller company they will have to go to the board and make a case for the higher pay.\n\nThe cool thing about this is it gives the employee leverage over the employer when it comes to negotiating.  Companies that have a price range up front almost always hire contractors or juniors, because very few people are willing to work for that pay range.  It's easier to negotiate higher than the company originally intended once you've got some experience under your belt.  This is one of the reasons tech jobs pay so well.",
            "title_similarity": "0.78040236",
            "sentiment_compound": 0.6418
        },
        {
            "id": "hbnzt6b",
            "score": 1,
            "text": "how about making the employer pay for the time spent interviewing",
            "title_similarity": "0.6872666",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hbo0aab",
            "score": 1,
            "text": "Many I have seen say something \"Pay per hour: DoE\", meaning \"Depends on Experience\".\n\nI still think that's bullshit and they should give an example acceptable range.",
            "title_similarity": "0.69489074",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hbo0g3a",
            "score": 1,
            "text": "It shouldn't, because there's free speech and they have the right to do that",
            "title_similarity": "0.4102753",
            "sentiment_compound": -0.4023
        },
        {
            "id": "hbo1nqw",
            "score": 1,
            "text": "If I’m interested in the job, I’ll call the recruiter and ask, It’s no big deal.\n\nWhat I hate is when they advertise a rate and then offer you the job at a lower rate with a BS excuse.. I’ve had that happen twice now and walked away on both occasions, including when they came back offering the advertised rate.  I’m not interested in playing games",
            "title_similarity": "0.82374215",
            "sentiment_compound": -0.7876
        },
        {
            "id": "hbo2vnp",
            "score": 1,
            "text": "When they say they pay ‘competitive’ rates, the competition isn’t between other people in other companies doing the same job. The competition is between you and your prospective colleagues, with the company seeing how little they can get away with paying you.",
            "title_similarity": "0.7966399",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hbo80fo",
            "score": 1,
            "text": "Know your worth. Employers are desperate for workers at this time. If you are experienced and with many skills, you have the upper hand in negotiating a higher rate of pay. Those with little to no experience, you still have the upper hand due to nobody wanting to work and living off of welfare. \n\nI asked for a raise and was given a dollar raise and was offended and with drunk courage demanded a ten dollar raise or I would immediately resign. We met half way.\n\nAgain, know your worth.",
            "title_similarity": "0.7546083",
            "sentiment_compound": 0.2682
        },
        {
            "id": "hbo970k",
            "score": 1,
            "text": "It doesn't really make sense from an employer's perspective to state a specific wage. They might be prepared to pay more for an exceptional candidate or less for a more average candidate.\n\nThey are operating within a job market, the wage is often dictated by the price that someone is willing to do the job for, within reason.\n\nE.g. the worth of a graphical designer is set according to supply and demand. A skilled graphical designer may only be worth minimum wage if the market is flooded with graphical designers. Conversely, if graphical designers are rare and highly sought after, their worth goes up.\n\nThe market is in flux, a company doesn't want to pay more than the going rate. Likewise a job-seeker doesn't want to accept less than the going rate...the tension between the two is what creates the market.",
            "title_similarity": "0.7301556",
            "sentiment_compound": 0.2887
        },
        {
            "id": "hboa4kv",
            "score": 1,
            "text": "Having been in the job market recently, I realised that if a job doesn't advertise the salary and instead uses phrases like 'market rate' or 'competitive', then they're paying at least 10% below what the actual market rate for that role is.",
            "title_similarity": "0.6380978",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hboe636",
            "score": 2,
            "text": "I am currently involved in helping to hire someone at my company. We were recruiting anyone from undergrad students, to masters student, to phd students, to graduates or above. What we absolutely needed of someone wasn't much, the impetus for making this job was for one specific project, but the more skills the better. While the person's experience and/or degree would matter in terms of pay, what would really matter is their capability in terms of which projects they would be able to contribute to. I think they went with the lowest number they were willing to pay, but I was kind of worried that people with more skills wouldn't apply.  \n\n\nThere were about 2 required skills, 10 desired skills, and 10 preferred skills. If you gave a salary for each of the possible combination of skills that would be over one million possible salaries!",
            "title_similarity": "0.7614214",
            "sentiment_compound": 0.2818
        },
        {
            "id": "hboi9mw",
            "score": 1,
            "text": "Agreed",
            "title_similarity": "-0.08453344",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hboigcj",
            "score": 6,
            "text": "Colorado has law on books that requires job postings to include wage range with min and max range for position. Connecticut is introducing somethung similarshortly. From a hiring perspective everything is negotiable.  Most applications will ask and employers will screen out if rate of pay is too high. Rate of pay is almost always discussed on first interview or phone screen to set future expectation.  Rate of pay is always presented to new hires when accepting position and most states require, wage, rate frequency of pay, be presented to new employees.  Best practice for employers is for wage notice to be signed by employee in case there is dispute later.",
            "title_similarity": "0.71714246",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbois3m",
            "score": 1,
            "text": "Why would you want to change a correct view?",
            "title_similarity": "0.32287353",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hboj5za",
            "score": 1,
            "text": "and the applicant is decide",
            "title_similarity": "0.24596033",
            "sentiment_compound": 0.0
        },
        {
            "id": "hboja1m",
            "score": 1,
            "text": "Yeah, great idea, let's regulate the world even more! REGULATE EVERYTHING!",
            "title_similarity": "0.3325925",
            "sentiment_compound": 0.7835
        },
        {
            "id": "hbokget",
            "score": 1,
            "text": "Lets say I have space to hire 5 people to meet 30 different technical scpecialties among all of them. If they were all to be equal, each person would cover 6 of those 30 technical specialties. Job is listed for 60k, 10k for each of their technical specialties.  \n\n\nJohn applies and meets 15 of the technical qualities. If I hire John, I now have space for 4 people to meet 15 qualities. I can probably fill those 15 qualities in 2 people instead of the 4.  \n\n\nIf I list the job at 60k, and John is clearly worth 15 qualities instead of 6, I want to compensate him more - but I cannot because the job listing limits me.",
            "title_similarity": "0.46310738",
            "sentiment_compound": 0.3506
        },
        {
            "id": "hbokps8",
            "score": 1,
            "text": "And they’ll get mad if you ask them, they don’t want to admit that it’s minimum wage.",
            "title_similarity": "0.71107674",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hbokyxg",
            "score": 1,
            "text": "There's an unfortunate lack of follow through laws about this kind of thing. Even a US job listed on a federal website, that gets paid through federal funding and operates as a piece of FAFSA, has zero obligation to honor the payment listed in the job listing. You can say the job is tier 2 and pays $10.05-$11.80/hour, and once you get an applicant pool you can drop the job to tier 1 and pay students $7.25. It's gross and predatory, and honestly leaves room for embezzlement, but it is currently 100% legal.\n\n\nForcing job listings to have a number listed on them doesn't really fix the underlying issue of opaque wage/benefit discussions and predatory hiring culture.",
            "title_similarity": "0.82593226",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hbol8s4",
            "score": 1,
            "text": "Some jobs pay different rates based on experience. We had a candidate at my firm who was, frankly, unqualified. He lacked the skills needed to do the job and lacked the ability to figure things out when given time. At the same time, he seemed to have a good work ethic and maybe could learn if given time. So we decided to offer him an \"entry level\" salary, not for the job he was actually applying for. That would have given him at least the opportunity to go somewhere he could learn.",
            "title_similarity": "0.7929188",
            "sentiment_compound": 0.765
        },
        {
            "id": "hbomu1l",
            "score": 1,
            "text": "But if they do that, other people working at the company will know salaries, and we just CAN'T HAVE THAT",
            "title_similarity": "0.793859",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbon1d8",
            "score": 1,
            "text": "What should happen is like in other nations where they force everyone’s pay to be public. What better way to negotiate your pay than to see what others in the company are currently making for the same position.",
            "title_similarity": "0.7955191",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbonddo",
            "score": 1,
            "text": "Depends on experience, availability, willing to travel... \n\nMany factors can't set a specific wage.",
            "title_similarity": "0.4680708",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbonsez",
            "score": 2,
            "text": "\nMy current employer advertises and interviews for openings in my department. The majority of us are experienced and can be counted on to produce X amount at Y cost. There is a pay scale for experienced people based on their amount of experience because the learning curve is expensive for the employer. We do, on occasion, hire people with the right attitude that interview well but have no experience. They have a couple years of training, working, learning ahead of them before they can be counted on to produce X amount at Y cost. For that time period they will go from a financial liability…to a neutral producer…to a profitable employee. The company is paying for that the entire time. Another issue is applicant quality. If I post an opening with a salary range I get tons of applicants who don’t know anything about the job, don’t care about the job, they just saw the high end of the range and decided that looked good. Truly a waste of everyone’s time. It is the job poster’s version of spam…so blame your fellow job seekers who are hyper focused on $$$ and stop reading after that. I need applicants who see the posted position, either know about the job requirements and the company or are willing to do some research and vet themselves out a little, then apply. \n\nIf we posted that the job pays (made up numbers) $50k to $100k depending on experience it would not attract serious applicants. The range is too wide and it would look unfocused. Plus it’s silly. The inexperienced who are hired are getting a shot at a job they really don’t qualify for traditionally and the company knows it not only gets to pay them, but also gets to pay for them to learn. Some have more perceived potential than others or more transferrable skills than others…so they are offered a higher starting wage. \n\nWhat I recommend for anyone looking at a job is to ASK about the salary range BEFORE you get too invested in the process. I have no problem disclosing the range once I know someone’s relative level of experience or skill set.",
            "title_similarity": "0.7461018",
            "sentiment_compound": 0.8129
        },
        {
            "id": "hbonsmu",
            "score": 1,
            "text": "One up you. All salaries and pay should be public info. This information a-symmetry gives employers a huge upper hand to pay people less and leads to discrimination.",
            "title_similarity": "0.7846554",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hbopb1m",
            "score": 1,
            "text": "What about those companies who just post a range of wages even though they will for sure only offer you the lowest end",
            "title_similarity": "0.71335536",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hboqp5a",
            "score": 1,
            "text": "Ive been looking for a new position in my field.  There are sooooooo many postings that don’t include the salary range.  I applied for one and got the job but when We discussed salary they were offering 20k under market.  I refused to budge and it ended up wasting everyone’s time.  I hate that companies are using this as a bait and switch. It’s about lowballing good candidates.",
            "title_similarity": "0.76437366",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hbovvqh",
            "score": 2,
            "text": "This is a terrible position for 2 reasons. 1st the government shouldn't be regulating things like this in any way. 2nd a lot of the time the position isn't really that well defined and it really depends on what sort of person you get and you pay them for the amount of value they bring.  In nearly every position I've ever hired for I would be more than willing to pay 10% more for a 10% more skilled candidate. I think you have this position because you have an underdeveloped understanding of how economics and prices work.   that's not intended as an insult so sorry if it comes off that way",
            "title_similarity": "0.7345283",
            "sentiment_compound": -0.7237
        },
        {
            "id": "hbox47t",
            "score": 1,
            "text": "Stop trying to make everything you don’t like illegal.",
            "title_similarity": "0.53736687",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hbp1s9w",
            "score": 1,
            "text": "\\-The level of salary is based on the level of knowledge and experience that candidate could bring to the company.\n\n\\- Without revealing the details about salary gives employer more  bargaining power. employers want to find out as much as possible about candidates before revealing details about salary. For example, remote workforce who live in small towns are satisfied with low-paid while other candidate whose have a high living standard may not accept that, thought they have same skill.\n\n\\- Employer want to avoid competition about talent acquisition between other companies within industry. Competing oganizations could use salary informations to win candidates by offer higher income or other benefits",
            "title_similarity": "0.8123702",
            "sentiment_compound": 0.8487
        },
        {
            "id": "hbp2612",
            "score": 1,
            "text": "How do you account for the variability within a role?\n\nTake a project manager. \n\nOne is managing $4M in projects, that went on for 1 year. \n\nOther people manage $500k, in 1 year. \n\nThe ability to manage more work, has nothing to do with the boss giving one more work to the other. It all has to do with the one person’s own personal competence, and ability to manage multiple projects. \n\nHow exactly should an employer post a new hire position? One PM is objectively 8x as valuable as his peers. Shouldn’t their compensation reflect their value?",
            "title_similarity": "0.6707784",
            "sentiment_compound": 0.9009
        },
        {
            "id": "hbp5768",
            "score": 1,
            "text": "Most salaried positions have a range based on experience and specialties.  If a law was passed it would probably include that specifying a range is acceptable since it would be necessary.  Employers would have wide ranges and it would be useless anyway.",
            "title_similarity": "0.7038765",
            "sentiment_compound": -0.128
        },
        {
            "id": "hbp72st",
            "score": 1,
            "text": "As others kinda pointed out, I feel like you're coming from a good place, with good intentions, but you/others need to come up with a better argument.\n\nI will agree with you perhaps when we're talking set jobs at under $20ish/hour maybe. If you have a set pay scale based on skills, that's fine.\n\nBut there are a ton of jobs for more than half the economy that details like that don't work. How do you decide what you pay an engineer with ten years VS a PhD with one year that will do slightly different things depending on what's open? Maybe if they are replaceable cog #5 like in some programming or engineering firms it gets easier to be clear. Maybe their site posts a rate schedule. But then you just have to be savvy enough to guess markup if it's cost plus - if they have a 2x markup on rates they bill to the customer then you can see you will make 1/2 of what they charge and know the range just from searching their site.\n\nBut it gets deeper in when you're making a possible team of masters/PhD and bachelor engineers. What if you have a BS with 20 years of exp and a masters with 0 years? Pay is going to be vastly different, and made more complicated by area cost of living.\n\nDoing the same job doesn't mean doing the same job in reality! Experience matters and adds up to double the salary.\n\nAdditionally I had one job post the salary requirements. I went back to them and said I needed more. To meet federal guidelines that meant it took weeks more where they had to get signatures, reapprove things, reopen the listing, and other people wasted their time applying when it was a job written off my resume that they'd already decided to give me! All because they listed the wrong salary and didn't leave the right room to negotiate because HR undervalued me VS the engineering group.",
            "title_similarity": "0.70189905",
            "sentiment_compound": 0.9241
        },
        {
            "id": "hbp9xso",
            "score": 1,
            "text": "Don't apply to jobs that don't seem promising.  No one is being forced against their will to apply to any particular job.",
            "title_similarity": "0.65923",
            "sentiment_compound": -0.522
        },
        {
            "id": "hbpcuog",
            "score": 1,
            "text": "Let me take a stab at this by attacking the niche scenarios. Since you presented your case as a universal requirement, any exception ought to change your view. \n\n1. CEO’s of public companies. The pay is not really salary or wages. It’s a little bit of salary + performance bonuses, stock options, and golden parachutes. These things cannot be disclosed because compensation packages for executives depend on the executive in question. They are tailored to encourage more or less risk taking, for instance. Merely disclosing the salary wouldn’t be very helpful. Most of the money a CEO makes comes from growing the company, not their base pay. And in any case, the salary will usually vary to balance the other forms of compensation depending on the ceo in question. So a “minimum” number is quite useless. \n2. Jobs with highly variable pay. The problem here is that if a range is provided, the range is practically useless, as it would be so vast. For instance, if I told you that you would be paid somewhere between 20k a year and 200000k a year, would that really be that meaningful? Almost all jobs fall in that range anyways. \n3. General partners in Partnerships. When taking on new partners, their income is proportional to their ownership. They will come in and work to make an already known amount of money based on the performance of the business.",
            "title_similarity": "0.8340863",
            "sentiment_compound": -0.5308
        },
        {
            "id": "hbpcw4p",
            "score": 1,
            "text": "Hospital I work for does not post pay on positions",
            "title_similarity": "0.500095",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hbpfwl9",
            "score": 1,
            "text": "It is a hassle for potential employees to go through a lot of work to only get minimal pay for their efforts. But you also have to realize that some people are willing to go through all that work for minimal amounts of pay. Ambiguity and suspense can cause more people to apply especially when the job sounds good on paper. On top of this, not putting a specific amount allows for negotiation of pay. From the employer's perspective, they can hire the best candidate for the least amount of money. But it sucks from the vantage point of many potential employees.",
            "title_similarity": "0.7673507",
            "sentiment_compound": 0.802
        },
        {
            "id": "hbpgny7",
            "score": 2,
            "text": "So how does this work for positions that are just about to open up and are mentioned in conversation?\n\nWhat would be the penalty?  \nWho would have the right to sue?\n\nWhat happens if the candidate is found to be better than the role they're hiring for?  \nWhat happens if the candidate is found to be worse than the role they're hiring for, but still want to hire them for a lower role?\n\nSome companies (especially startups) are combatting the current job market by posting their ranges as a competitive advantage, and it works.\n\nThat said, noone is preventing you from going into the interview process asking about the compensation range. If they refuse to tell you, you can walk away without having gone through the process.",
            "title_similarity": "0.78393525",
            "sentiment_compound": -0.5873
        },
        {
            "id": "hbph147",
            "score": 1,
            "text": "I honestly agree. What if candidates were like “Oh you’re interested in hiring me? I’ll let you know if I can work five days a week after the end of the interview”",
            "title_similarity": "0.43500584",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hbphbsj",
            "score": 1,
            "text": "Agreed. It would be like workers applying for jobs but not telling the employer what hours they can do.",
            "title_similarity": "0.81794035",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbphi4k",
            "score": 1,
            "text": "Colorado has this law",
            "title_similarity": "0.14362305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbpipbr",
            "score": 2,
            "text": "You have the power to change this to standard practice. If people only apply to jobs where the wage is listed, then companies will start listing their wages. We don’t need more onerous regulations to make it happen.",
            "title_similarity": "0.75422776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbpjypx",
            "score": 1,
            "text": "I won't even apply to these usually",
            "title_similarity": "0.36789846",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbpk5nn",
            "score": 1,
            "text": "It has been tremendous a waste of time applying for positions based on what I think the salary is, only to find out they are way less than my current wages.",
            "title_similarity": "0.734179",
            "sentiment_compound": -0.4728
        },
        {
            "id": "hbplegu",
            "score": 1,
            "text": "Years ago in jobs I was looking at there were actually pay ranges. Then at some point there were regulations about not asking/requiring current pay and my fuzzy memory has the shifting to no more posted pay ranges around the same time. \nLast I applied a couple years ago they all asked for desired pay and if I didnt fill it in they ask that first and wont say anything unless I answered. They wouldnt answer a fluff answer of it depends on specific details of the or anynof the other phrases people were saying to use so to a few I just asked to be removed from consideration and thanked them for the call.",
            "title_similarity": "0.8024295",
            "sentiment_compound": 0.1575
        },
        {
            "id": "hbpmour",
            "score": 1,
            "text": "As someone who recruits and hires ( I don't set pay) I will note that while we may advertise for a certain role, if a candidate comes in slightly higher or lower in experience we will consider putting them into a new role. So pay bands obviously changes then. All fine and good for more experienced folks, but that's uncommon, usually it's putting people into a slightly lower position to get them settled and then move into the role within a year. That can cause issues with pay discussions.",
            "title_similarity": "0.70367277",
            "sentiment_compound": -0.2056
        },
        {
            "id": "hbpnpb8",
            "score": 1,
            "text": "Absolutely. I applied for a cashier job at a pet shop yesterday and they required me to fill out an hour long personality test (I have up halfway through and clicked neutral on everything), list all my addresses I've lived at in the last 10 years, upload my resume and then retype/edit all that information a second time around, fill out some tax related information, etc and yet I still know shit about the details/benefits of the job. No clue how much pay I'm applying for, what my duties might be, or what benefits might receive and yet simply for applying they must know every detail about my entire existence. Seems fair.",
            "title_similarity": "0.6069627",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbprrfk",
            "score": 1,
            "text": "I agree, but I think one of the staple logic used by companies is that \"time is money\". Since on a job application we will not get compensated for our time investment, not knowing how much it pays means that the company is objectively wasting that person's time, and stringing them along to uncover the wage may cost them the opportunity of applying for the appropriate position on another company because they were instead wasting time with the one withholding the salary information.\n\nSo yeah, making it illegal would be ideal, it would also mean that more competitive wages would appear, instead they keep it cryptic to pay less than what the position should earn.",
            "title_similarity": "0.8579632",
            "sentiment_compound": 0.4096
        },
        {
            "id": "hbq0nsg",
            "score": 1,
            "text": "I think the GS system that the US federal government sounds similar to what you are suggesting. Everybody knows what pay to expect when they apply for a job based on experience, location, and how long someone has worked for the government. \n\nWorking for a private company has advantages though. You can always apply somewhere else and argue that you should be paid more if the company is a particularly good fit for your skills. Private companies are more responsive to changes in the economy as well. You can always use your current wages as a base and refuse to work for less if you already have a job.",
            "title_similarity": "0.78919846",
            "sentiment_compound": 0.8108
        },
        {
            "id": "hbqc5yl",
            "score": 1,
            "text": "That's why my cover letter includes my expected salary range.\n\nIf they can't hang, they can just bin my application. I'll already be on to the next one at the next company anyway.",
            "title_similarity": "0.7530857",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbqfu9a",
            "score": 1,
            "text": "Should it also be illegal for a job applicant to apply without saying how much they are looking for?  Companies spend copious amounts of time and money in the recruiting process. Having a bunch of people apply that won’t say how much they require wastes time and money.",
            "title_similarity": "0.7808403",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbqh8wd",
            "score": 1,
            "text": "Just don’t apply if they don’t post a salary. Yeah they’ll be some missed opportunities along the road, but fuck it, you save time in anything you actually do apply for because you know you aren’t going to be met with a stupidly low salary suggestion - and it means that your time isn’t wasted with pricks in interviews.",
            "title_similarity": "0.8074483",
            "sentiment_compound": -0.9178
        },
        {
            "id": "hbqjdnd",
            "score": 1,
            "text": "They would only be fair if potential employees would be legally required to disclose the amount they're willing to accept.",
            "title_similarity": "0.6375176",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hbss8eb",
            "score": 1,
            "text": "I hire people. I would hope for someone with a PhD and 20 years of experience but I'm willing to take a BSc in physics that is interested in the work but has no experience if that's all I can get.\n\nI might be willing to pay 60k for the fresh grad physicist that will need to be taught everything or 300k for a professor.\n\nEveryone is unique and you can't have exactly the same pay for everyone. If someone worked their ass off in college and spend time studying on weekends etc. and someone else just wants to do 9-5, they don't deserve the same pay.",
            "title_similarity": "0.6918854",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hck6tsd",
            "score": 1,
            "text": "Agree with this so much, I spent 2 months on interviews in the end nailed it but was offered way too low, they already knew my expectations,  complete waste of time",
            "title_similarity": "0.70002383",
            "sentiment_compound": -0.6808
        }
    ]
}