{
    "CMV: If you believe abortion should be illegal on the grounds that a life is being ended, then that fetus should get FULL protection under the law, including being an American citizen and all the perks that come with it\nIf we are going to consider those fetus' human beings which need protection from \"murder\" or whatever form of child abuse you want to call it, then that fetus should be legally treated exactly as a child. This means it is a citizen and it's parents are protected from deportation.\n\nIt means child support should start at 6 weeks, or whenever we consider it \"life\".\n\nIt means mothers who need it should be getting additional welfare benefits once determined to be pregnant.\n\nFrom a tax standpoint, yes a fetus should be treated just the same as a child. Let them be claimed as a dependent because they are. If they could earn income then it would be reported all the same, too.\n\nIf the parents are forced into a legal obligation to care for the child then they absolutely need to also be given the same benefits that parents of \"birthed\" children can enjoy.\n\nThis post is about logical consistency more than it is moral superiority. I'm not making a claim on what is morally right, only following a line of logic where if A is true, then B must also be true to maintain consistency.\n\n>EDITS AND ADDITIONS\n\n-Okay here are some other ideas I've seen that should also be included here\n- Pregnant women in the carpool lane\n- compulsory kidney donations? Hey it's an interesting convo even though it's not exactly the same thing\n- Criminal punishment for pregnant drug use\n- Fetus life insurance\n-Pregnant muder=double homicide\n\nEdit: I am going to reinforce that this post operates under the assumption that an abortion is the end of a human beings' life. If you don't believe that is true then any arguments would fall outside the scope of this post.\n\n-Additionally, to all the people calling this a \"gotcha\" post, I don't personally believe that a fetus is deserving of the right to have it's existence legally protected. That being said, if we were to decide as a society that fetus existence is worth protecting, then I believe that we would also need a host of other protections in concert with an abortion ban in order to maintain logical consistency.\n\nBut again I'm trying to deal in logic here and not moral superiority.\n\nFor the people who say children already have exemptions from the law, I would argue that they actually are the benefits of additional laws to protect a vulnerable population and not a sub class of human who's rights are being taken away, in MOST cases\n\nLeaving this line here for informational purposes but my mind has already been changed : \"Also, if a job provides paid maternity leave benefits then those should be allowed to start as early as 6 weeks into pregnancy.\"": [
        {
            "id": "hbzvfqm",
            "score": 1,
            "text": "/u/why_doineedausername (OP) has awarded 10 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/pjz1t0/deltas_awarded_in_cmv_if_you_believe_abortion/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5628319",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hbzrnjf",
            "score": 160,
            "text": "Welfare isn’t a right so that logic makes no sense. Besides pregnant women do get benefits and protections due to being pregnant. Off the top of my head I can think of reasonable accommodations at work and WIC",
            "title_similarity": "0.60106933",
            "sentiment_compound": 0.296
        },
        {
            "id": "hbzsue9",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.056496207"
        },
        {
            "id": "hbzvjje",
            "score": 2,
            "text": "While I believe in open borders and am pro life and anti-welfare in general, that's beside the point.\n\nSomeone being born is just a convenient point for entry into the system. Doesn't mean they aren't alive before that.\n\nThe assumption is that \"entry point into system\" = being born from the mother\". Which is incorrect. Why should it be so?\n\nIn some cultures, kid's births and names aren't registered for weeks after they are born- they have naming ceremonies and stuff that take place when the kid is like two weeks.",
            "title_similarity": "0.73291767",
            "sentiment_compound": 0.0813
        },
        {
            "id": "hbzq9a7",
            "score": 509,
            "text": "Child support and extra welfare money stop when the child reaches adulthood. This is because at that point the parent is assumed to no longer have additional expenses due to the child.It is logical, then, that they would start at the point when the extra expenses increase, which for the most part is at the birth of the child. (I realize pregnancy has additional costs as well) The citizenship part would also be very difficult to carry out because it is far easier to prove where a child is born than proving where it was conceived.",
            "title_similarity": "0.6996031",
            "sentiment_compound": 0.4417
        },
        {
            "id": "hbzs6nx",
            "score": 211,
            "text": "I think this view you espouse is a popular misunderstanding of pro life views. The idea is that fetus = alive, so killing a fetus = murder. You can be against murder without any of the other views you highlighted. As for caring for a fetus from 6 weeks, the issue here is that there isn't really much care needed. Sure there are doctors visits, small changes to diet and lifestyle, but otherwise women can work long into their pregnancy. Giving maternity leave from 6 weeks is neither logical nor economically viable for this reason, as maternity leave is for the aspects of pregnancy which make it difficult to work, not just because there's a child in your belly. As far as I'm aware, there are social services available to pregnant women and mothers. Just to clarify the initial point because it's the most important, just because someone disagrees with murder itself does not mean the person believes in state benefits for children that would otherwise have been aborted: these are two positions that don't necessarily always overlap.\n\nEdit: clarity.",
            "title_similarity": "0.7667976",
            "sentiment_compound": -0.8416
        },
        {
            "id": "hbzqeet",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hbzyeg5",
            "score": 3,
            "text": "We have these things. It’s called being in a relationship with the other parent. Preferably a marriage.",
            "title_similarity": "0.44167423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc04fxh",
            "score": -2,
            "text": "This is actually a great idea OP. And I guarantee you that if mom's got extra money for not killing their baby then leftists would ban abortion.",
            "title_similarity": "0.7912692",
            "sentiment_compound": 0.7198
        },
        {
            "id": "hbzszaz",
            "score": 81,
            "text": "Anyone born on American soil is an American citizen. We have birthright citizenship. It feels like you’re trying to catch someone out as a hypocrite but I’m not sure who. Being anti-immigrant and anti-abortion aren’t really opposites.",
            "title_similarity": "0.7437513",
            "sentiment_compound": -0.1761
        },
        {
            "id": "hc0pqzh",
            "score": 0,
            "text": "According to that logic, masturbation should be mass genocide.",
            "title_similarity": "0.56476486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbzrxoo",
            "score": -5,
            "text": "Just to give a real answer\n\nNot everything has to follow \"perfect logical consistency for everything\". That's dumb. These are different things. \n\nIt's okay to flexible in some areas and not others. \nThinking the heartbeat dictates you shouldn't get an abortion doesn't suddenly mean child support should start then lmao. \n\nYou can have some nuance in your opinions and beliefs. You can be pro choice only up to a certain about a time. You can pro life and pro death penalty. You can have a lot of nuance anywhere as long as you have a legitimate reason to do so. Of course you should be able to explain yourself if asked. But this notion that you have to take every argument to it's \"logical conclusion\" is ridiculous.",
            "title_similarity": "0.78613067",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hbzt1g2",
            "score": 22,
            "text": ">If we are going to consider those fetus' human beings which need protection from \"murder\"\n\nI'm curious why you put murder in quotation marks.  Do you believe that If somebody murders a woman who is pregnant deserves to be charged with a double homicide?",
            "title_similarity": "0.7098052",
            "sentiment_compound": -0.9313
        },
        {
            "id": "hbzw4gb",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hbzpoly",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hbzy17x",
            "score": 3,
            "text": "An abortion is the end of a human beings life. How could you possibly have any other view even if you are pro choice, which I am",
            "title_similarity": "0.73174834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc0ds3k",
            "score": 6,
            "text": "You don’t treat a fetus like a child, just like you don’t treat a child like a young adult, or a young adult like an elderly person. The pro-life person believes that these all have the same moral consideration, not that they are all the same thing. \n\nMost pro life people probably don’t believe in childbirth granting citizenship or any other special benefit anyways, so your examples don’t align with what they view should be an entitlement of anyone regardless of their stage in life. \n\nYoure saying A=B and B deserves C so A deserves C. In the pro-life view, A does not equal B unilaterally, only morally. Even if it did, A nor B deserve C.",
            "title_similarity": "0.6627822",
            "sentiment_compound": 0.9657
        },
        {
            "id": "hbzyudg",
            "score": 1,
            "text": ">It means child support should start at 6 weeks, or whenever we consider it \"life\".\n\nWhat about people who are against child support?",
            "title_similarity": "0.5907695",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hbztx0l",
            "score": 63,
            "text": "> Also, if a job provides paid maternity leave benefits then those should be allowed to start as early as 6 weeks into pregnancy.\n\nThis one doesn’t track. Maternity leave is primarily to recover from labor and bond with your newborn.",
            "title_similarity": "0.68799835",
            "sentiment_compound": 0.296
        },
        {
            "id": "hbztfvb",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.069711246"
        },
        {
            "id": "hc00sqq",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0173j",
            "score": 0,
            "text": "Giving the foetus personhood and citizenship and those bells and whistles from 6 weeks isn't necessarily logical - is the foetus entitled to their own benefits? Pre-birth, the foetus doesn't even have the agency to accidentally kill itself.\n\nWhat's true of benefits should also, logically, follow that the foetus is subject to (and a subject of) the law.\n\nShould the mother be charged with gross negligence if they partake in any act (from drugs to dietry changes) that *may* result in (unspecified) harm (or defects) to the foetus?\n\nShould the foetus be allowed to be charged for coersion should the mother make any decision \"for the good of the baby\", or be allowed to be responsible for the mother's post-partum depression?\n\nIf the mother dies as a result of childbirth despite all medical care given, should the child be allowed to be charged for manslaughter by their father? Of course the law would have to change the consequences to allow for their age.",
            "title_similarity": "0.8212147",
            "sentiment_compound": -0.8515
        },
        {
            "id": "hc0rj0b",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc165i9",
            "score": 0,
            "text": "This makes little sense. I believe abortion should be illegal, I also don't believe in welfare. Why would I agree to welfare benefits to the mother? You make a good case regarding child support, pregnancy requires finances - just not from the state budget, as I and many others would say.  \nOP misses a key point that rights don't have to be absolute. Protecting a fetus's right to life does not necessarily mean valuing it the same as a born child or an adult. Law doesn't work that way. If you believe in positive rights, you have to agree that not every group of people has the claim to those rights, unless we're talking about universal healthcare, education and police protection - even here different people get different kinds of deals. Those groups are often distinguished by many characteristics, like gender, age, ethnicity, etc. So while a fetus might only enjoy it's negative rights being protected, as it becomes a baby and eventually a 18 year old it will gain more rights.",
            "title_similarity": "0.7631913",
            "sentiment_compound": 0.9482
        },
        {
            "id": "hc1x6gx",
            "score": 0,
            "text": "Logical consistency?  We don't have that now, so why would you expect the change you were talking about would suddenly bring consistency?  In case you don't know which inconsistencies I am talking about:\n1.  Abortion is legal, based on the idea a woman can do what she wants with her body.  However prostitution is illegal in 49 states.  That prohibition keeps people from doing want the want with their body, without purposely killing someone while doing it.   The same applies to drugs being illegal.\n\n2.  A woman can completely escape the responsibility of motherhood, by either killing it, or giving the baby up for adoption.  She can completely escape both emotional or financial parental responsibility.  The man can't force either on her.  Yet a man can be forced into parental financial responsibility, based on the decision of the mother.   \n\nI wouldn't mind some logical consistency also, but I don't see that happening.",
            "title_similarity": "0.85551405",
            "sentiment_compound": -0.4073
        },
        {
            "id": "hc22ps6",
            "score": 0,
            "text": "Child support, receiving welfare, and these other points are not basic human rights. They are not afforded to every citizen. Those are all things that only certain citizens qualify to receive so in my opinion they are logically consistent with the basic “Human” right to live. Murder is illegal in every country/nation on the planet. The right to live is fundamental regardless of citizenship. Without due process in a legal system child support is non existent. That doesn’t have anything to do with the child. That is an issue of the parents and their own needs as seen by the courts. Women don’t just magically receive money, food stamps, or welfare by giving birth to a child. They must qualify and then apply. The majority of women do not qualify in America so that doesn’t apply. \n Also, your thoughts on deportation are actually wrong. If illegal immigrants give birth to a child on U.S. soil, only that child is an American citizen and the parents are both still here illegally and subject to deportation. The child is the one who may stay being that they are legal citizens. So the deportation issue doesn’t apply either. \n  It’s also important to remember that nobody is legally forced into making babies, EVER! Under any circumstances! If two people have a child and choose to not abort it there are adoption agencies and foster homes and other agencies that exist that will take guardianship if the parents do not feel they are able to provide a healthy, safe, loving environment for the child. In fact, there are even agencies such as CPS who will remove your child for you if the state believes that you are unfit for parenthood and for providing a safe healthy loving home for the child. So there is no forcable legal obligation to care for ones child. So it seems that I can’t see even one of your logical consistencies as you say, to have any validity whatsoever even for the sake of argument and conversation. \n   But dammit I wish there were some that held up because I believe it’s a conversation that should definitely be had even for just conversations sake. \n    I can’t make babies personally so I don’t have a dog in the fight whatsoever. I don’t care either way. HOWEVER, I DO think that the “my body, my choice” position that women argue is an intellectually lazy stance and can be easily ripped apart and be used to show how incredibly hypocritical women who say that are. But sticking to the topic of this post, I don’t think the points made in the original post have any merit because of the reasons I said. But love the conversation thats for sure!",
            "title_similarity": "0.7310997",
            "sentiment_compound": 0.978
        },
        {
            "id": "hc39475",
            "score": 0,
            "text": "Why do you want absolutely want to  decide instead of concerned women?",
            "title_similarity": "0.45451468",
            "sentiment_compound": 0.2247
        },
        {
            "id": "hc39jl6",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc646ax",
            "score": 0,
            "text": "I see the mod prefers the abortion ban lol just removed my comment.",
            "title_similarity": "0.67608917",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hbzvpj7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc09cyx",
            "score": 1,
            "text": "Start child support at 6 weeks then, sure. Just make sure the costs are in line with what the baby needs. AFAIK, it’s pretty much nothing that early, but will increase over time. Also, do a paternity test to make sure that baby is in fact the “father’s”.  \n  \nWelfare (as it exists today) shouldn’t exist, whether you’re pregnant or not.  \n  \nNo non-American who is legally here should be free from deportation. The law says born here, not conceived nor be in the womb while here. I think that’s a stupid ass law to begin with, regardless.",
            "title_similarity": "0.83833987",
            "sentiment_compound": 0.801
        },
        {
            "id": "hc14m25",
            "score": -1,
            "text": "people who want abortion to be illegal dont want this because murder is illegal. They want this because murder is wrong.\n\nWhatever about your opinions on birthright citizenship, those are separate.",
            "title_similarity": "0.7081513",
            "sentiment_compound": -0.9653
        },
        {
            "id": "hc2lezg",
            "score": 1,
            "text": "Forget arguing with the republican view on prolife.  They are also pro death penalty.  Can't argue with twisted logic.",
            "title_similarity": "0.6871561",
            "sentiment_compound": -0.8678
        },
        {
            "id": "hbzytgo",
            "score": 61,
            "text": "I think most of the pro-life movement would be ok with what you've outlined here.",
            "title_similarity": "0.4049227",
            "sentiment_compound": 0.296
        },
        {
            "id": "hbzzub7",
            "score": 37,
            "text": "[deleted]",
            "title_similarity": "0.069711246"
        },
        {
            "id": "hbztijo",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hbzy0a0",
            "score": 2,
            "text": "As someone who is pro life I would say I agree with your points on child support and benefits being provided the same as a child, but they should match the cost of pregnancy because although pregnancy is expensive it is generally not as much so as raising a child. \n\nAs for the deportation issue, I don’t think that makes much sense mostly because that would be hard to prove.",
            "title_similarity": "0.6527052",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hc03k8h",
            "score": 2,
            "text": "With respect to the payments, I think this breaks down to the function of support payments provided by the state.\n\nThe function of the support payments, of all of the above you've mentioned, is to supplement income that is lost due to raising the child. Whilst the woman is pregnant, she has no lost income, and so doesn't require that income supplement.\n\nWith respect to citizenship, I imagine it is merely a matter of bureaucratic impossibility. How do you unambiguously determine that a woman was impregnated whilst on US soil? The measures required to do that probably wouldn't sit well with most mothers, or citizens. So whilst I'd probably agree with you logically, the trade-offs required probably don't make it politically viable.",
            "title_similarity": "0.73012877",
            "sentiment_compound": 0.9011
        },
        {
            "id": "hc058tp",
            "score": 2,
            "text": "The 14th Amendment:\n>All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.",
            "title_similarity": "0.5809918",
            "sentiment_compound": 0.8789
        },
        {
            "id": "hc1s87x",
            "score": 2,
            "text": "The thing is… not having an abortion does not mean that the woman is forced to raise the child. She can drop the baby off at the fire department and wipe her hands clean. \n\nWe hold two key principles in western civilization. The right to life, and body autonomy. Abortion is an issue where these two principles challenge each other. The abortion issue is body autonomy vs. the right to life. Does the fetus’s right to life outweigh the woman’s body autonomy? Does the woman’s body autonomy outweigh the fetus’s right to life? \n\nThe whole issue is subjective. I don’t believe there are any right or wrong answers. \n\nPersonally, I think abortion is a selfish decision but I think it should be up to the woman because government over reach scares me more than abortion does. Other than complications that could cause the mother’s death, I can’t see a credible reason to have an abortion. Becoming pregnant is always a risk you take when you have sex.\n\nNo money to pay for child? Adoption. \n\nNo time to raise child due to job? Adoption. \n\nEmployer pissed that your pregnant? Law suit. \n\nToo young to be an effective parent? Adoption. \n\nPregnant from rape? God that one is tricky. I couldn’t imagine having to carry a constant reminder of such a traumatic event for 9 months plus recovery, and the permanent changes to the body. But on the other hand, the fetus is innocent and it could be argued that ending the pregnancy is adding an additional victim to the rape. If I was a woman I’d probably abort in this situation. \n\nBut ultimately the decision should be up to the person carrying the child. Let’s keep the government out of our bodies. Let’s mitigate the reasons why women would choose to have an abortion. Let’s encourage adoption. Abortions are going to happen legal or not, so if you hate abortion then seek change the right way.",
            "title_similarity": "0.79123163",
            "sentiment_compound": -0.9924
        },
        {
            "id": "hc0ky65",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0yn3n",
            "score": -3,
            "text": "Actual solution from an atheist Republican: \n\nAbortion is 100% legal, but it’s a two way street. \n\nWomen, you can choose to abort a baby whenever you want. Fine. Your body, your choice. Congrats. \n\nThe catch? \n\nMen get the right to “financially abort” (disown) a child within 9 months of learning there is a child/9 months after learning woman is pregnant (9 month time due to possibility that a woman doesn’t tell the man until child is already born). If a man decides he f***ed up and wants back in the child’s life, he can at any time opt to “buy back” into the child’s life with retroactive child support due. \n\nOnce the child turns 18, their father’s info will be given to them no matter what to do what they see fit as a grown adult human being. \n\n\nJustifications: \n\nA man has no say in a woman getting an abortion or not. He could lose a child he desperately wants, just because she doesn’t want one. \n\nA man has no way to get an abortion obviously. Therefore “financial abortion” (disowning) a child is an option. This allows the man to relinquish his right to be in the child’s life, similar to an abortion. \n\nA man can “buy back” into the child’s life at any point because frankly a father that is willing and wants to be in the child’s life should be if he’s willing to make payments and restitution for not being there at the start. A woman can abort a baby a man wants (and he can do nothing about it), so in fairness to men we will allow them to get the opportunity to realize they have made a mistake and correct it. This is a way to level the playing field between men and women, plus it’s beneficial for the child in most cases. \n\nOnce the child turns 18: They are a grown ass adult. If they want to meet the father who disowned them, that’s their call. If they don’t, their call. No interference from the mother or the government. Info on the father will be readily available and accessible from the government if the child so chooses to obtain it.",
            "title_similarity": "0.79804933",
            "sentiment_compound": 0.9017
        },
        {
            "id": "hc0eie6",
            "score": 16,
            "text": "\"this post operates under the assumption that an abortion is the end of a human beings' life\"\n\nI think this assumption is itself worthy of being examined and serves as a good starting point. I'm just going to lay out the reasoning behind the assumption, as I understand it, to demonstrate some issues with providing a fetus citizenship. That assumption starts to get really deep into the philosophical weeds once you begin to question what the distinction is between what is *actually* human vs. the *potential* to be human. To do this, you have to answer questions that don't really have \"logical\" answers - like, what is the *essence* of human life? That, in line with pro-life views (i.e. abortion is the termination of a human life), raises a necessary distinction between the *potential* human and the *actual* human. For example, sperm and eggs, in their respective owners' bodies, has the *potential* to be human, but its *form* is not realized. For example, if one uses a condom, no one would consider this to be the termination of human life - the *form,* sperm and eggs, never reaches a new, distinct stage. But, the line has to be there somewhere. For your assumption, the new, distinct stage comes during conception; acting as a point to distinguish \"murder\" from, well, \"not murder\" lol. Thats where the weeds thicken further, as one must distinguish questions about consciousness. When does the *form* enter into a distinct stage that differentiates between *potential* human life and *actual* human life? I.e., \"Pulling the plug\" on a loved one is not murder, so is murder the killing of a conscious human life? But, necessarily, one must define what is consciousness? Response to external stimuli? Heartbeat? Brain function? Birth? And there aren't really any answers. There must be a transition, at some point, from *potential* to *actual.*  But there is no specific time, post-conception ,where you can say, \"No, that is not a human life\", then, a second later say, \"yes, that is a human life\". Because of this, under these assumptions, where is the logical chokepoint for *actual* human life? Conception. \n\nBut, FULL protection under the law is, literally, not possible for a fetus of any age. If a pregnant woman decides to \"abuse\" this *actual* human life (drinking alcohol, using drugs, or anything else that causes *potential* physical or emotional damage), Child Protective Services can't exactly remove the child from the care of the mother. Granting a fetus the status of citizenship doesn't quite track with prior assumptions either, because there is no way to prove that a fetus was conceived in Country A as opposed to Country B. So there is no provable transition from *potential* to *actual* where a government can identify the fetus as a citizen. \n\nYour other points are focused on support/welfare for the mother. If a mother carrying a fetus has transitioned from *potential* mother to *actual* mother, she should receive all according support from the law. But, that's not exactly how those laws work (at least in the US, can't speak on anywhere else). For example, if a pregnant woman were to apply for additional SNAP benefits (food stamps), why would any logical government rule in the mother's favor? She is still only eating one-person's worth of food. \n\nUnder the assumptions, carrying a fetus makes her the mother of another *actual* human life. SNAP, like all other welfare programs, is decided based upon a long list of factors; one is \"how many eligible citizens are in your household\", and seeing as how there are cut-offs for all different types of eligibility, a fetus in the household, although an *actual* citizen, does not necessarily mean the additional SNAP benefits should be provided. That's not to say there aren't other cases (like you mentioned, financial obligations of Child Support Payments) where the legal status of an *actual* human life and citizen would provide additional support to help a mother pay for the \\[expensive\\] cost of pregnancy; only to point out that granting a fetus FULL protection of the law doesn't necessarily equate to \"more support\" or even \"better treatment\". \n\nNote: I appreciate that you asked for logical reasoning rather than moral arguments. I believe sound logic leads the way for moral health. I also don't really mind adding that I am definitely pro-choice, for a whole bunch of reasons; but your post caught my eye because the proposition of identifying a fetus as a fully protected member of society made me curious enough to do some digging. I also attached some Resources below, the *italics* follow the definitions set by Plato and Thomas Aquinas, and the other links are just to provide support for my claims about welfare / benefits. \n\nResources:\n\n[Plato's Form and Matter](https://plato.stanford.edu/entries/form-matter/)\n\n[Thomas Aquinas's On Being and Essence (extension of logic from Plato)](https://faculty.fordham.edu/klima/blackwell-proofs/MP_C30.pdf)\n\n[HHS' Definition of Child Abuse](https://www.hhs.gov/answers/programs-for-families-and-children/what-is-child-abuse/index.html#:~:text=What%20is%20the%20definition%20of%20child%20abuse%20and%20neglect%3F,-Just%20as%20there&text=%22Any%20recent%20act%20or%20failure,imminent%20risk%20of%20serious%20harm.%22)\n\n[Page from Cornell Law on Child Support Law](https://www.law.cornell.edu/wex/child_support)\n\n[Different Child Support Case Types](https://www.verywellfamily.com/ivd-and-non-ivd-child-support-case-differences-2997988)",
            "title_similarity": "0.8032167",
            "sentiment_compound": 0.9953
        },
        {
            "id": "hc082t9",
            "score": 81,
            "text": "Personhood is not the same as citizenship. They entail different sets of rights. \n\nFor example: A tourist visiting the US has certain rights under the law as a person, but that doesn’t mean they can vote or exercise all the same rights as a US citizen.\n\nAlso for example: not all countries, in fact the minority of countries, have birthright citizenship, meaning that even if you are born in that country, you are not automatically entitled to become a citizen.\n\nHopefully these examples illustrate that the concepts of personhood and citizenship, and the rights belonging to each respectively, are separable.",
            "title_similarity": "0.58599645",
            "sentiment_compound": 0.7166
        },
        {
            "id": "hbzvvg9",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc050bb",
            "score": 8,
            "text": "We already give people double homicide charges for killing pregnant women so sure go for it",
            "title_similarity": "0.6264868",
            "sentiment_compound": -0.5437
        },
        {
            "id": "hbzyo4z",
            "score": 2,
            "text": "At what age can a fetus be tested for paternity?  That's when child support should begin.  The mother should be required to disclose the father.  The taxpayers shouldn't have to shell out welfare since there is a father out there.",
            "title_similarity": "0.7627449",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbzzrhw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc022pn",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc05g9z",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc06jh8",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc06nq7",
            "score": 22,
            "text": "Why treated as a child? It would just be defaulted to another ‘stage’ of life, like the difference between adults and children. I get your point, but I dont understand why a fetus would need to equate to child status.",
            "title_similarity": "0.6763786",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hc06up6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc07b15",
            "score": 14,
            "text": ">Also, if a job provides paid maternity leave benefits then those should be allowed to start as early as 6 weeks into pregnancy\n\nActually they already do!  Maternity leave (not including great companies that have separate maternity leave benefit) is just FMLA, and that can start right away.  You can have intermittent FMLA for needed doctor visits or due to health issues from pregnancy, or even to care for a family member who has an illness or are pregnant.  \n\nTake a look at the actual [FMLA](https://www.dol.gov/sites/dolgov/files/WHD/legacy/files/WH-380-E.pdf) (1) / [forms](https://www.dol.gov/sites/dolgov/files/WHD/legacy/files/WH-380-F.pdf) (2) to see.\n\nWhen you give birth, you qualify for short term disability.  If you have a vaginal delivery this would be 6 weeks, and a c-section would be 8 weeks (may be state dependent).  FMLA is otherwise unpaid leave, and there are other qualifiers, such as must work at your company for a year first, and, based on company size.",
            "title_similarity": "0.70566",
            "sentiment_compound": 0.3178
        },
        {
            "id": "hc07rrk",
            "score": 2,
            "text": "You’re assuming we all think of America as our frame of reference, for starters… Many Americans don’t tend to think with global scope without an explicit reminder",
            "title_similarity": "0.5362165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc0azx2",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.056496207"
        },
        {
            "id": "hc0b2z0",
            "score": 3,
            "text": "You can start you paid maternity leave before the kid is born. You just only get so many weeks, so if you start before the kid is born you are getting less after the kid is born. \n\nWith the exception of welfare, unborn kids do get the same benefits as live people.",
            "title_similarity": "0.5179151",
            "sentiment_compound": 0.34
        },
        {
            "id": "hc0bdn5",
            "score": 1,
            "text": "I dont think many prolifers would necessarily disagree with you so I am not sure where this gets you in terms of making a grand point.",
            "title_similarity": "0.314838",
            "sentiment_compound": -0.1436
        },
        {
            "id": "hc0bixr",
            "score": 10,
            "text": "Being alive is necessary, but not sufficient for many of those other things you describe, while the definition of murder is the intentional unlawful killing of another with malice aforethought. One must be alive to be killed, so if the fetus is a human life, then it can be killed. It makes no difference whether the human life has other rights to citizenship, welfare, child support, etc. so long as it is alive. However, if logical consistency is your aim, I think many pro life people would likely agree with your proposals to some degree. \n\nAdditionally, there is legal precedent for a fetus to have rights. In every state I believe, suppose a man does without a will. He has 3 kids and a girlfriend, who he had sex with the day before his death. His estate will pass to his children in even shares. However, if the girlfriend gets pregnant with child number four, that child will have a right to take from the estate so long as it was in gestation at the time of the man’a death.",
            "title_similarity": "0.76484287",
            "sentiment_compound": -0.9782
        },
        {
            "id": "hc0c2fr",
            "score": 3,
            "text": "I’m not “pro life” camp as it includes things I don’t believe in but I do believe abortion is killing babies and I have no objections to what you are saying. The citizenship question is debateable because there are too many what if’s.  Like us citizens getting pregnant in Canada does that mean you aren’t a US citizen when you are born? So at birth is easier to verify, if you ask me  I think it’s silly to grant citizenship on a technicality of being born on US soil by chance (canadian parents simply on vacation in Miami for example) \nSo those complications aside I’m for a life is a life and deserves all the protection that includes.",
            "title_similarity": "0.8068992",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hc0c7fs",
            "score": 3,
            "text": "I agree with your logical statements, and would support at the ballot box, and the 1040.\n\nHowever, I will call you out for the bigoted perspective that people on welfare want abortions (3rd paragraph). Given that minorities are significantly more likely to use welfare than people that identify as white, your argument is pretty racist and belittling of those of us that are minorities.",
            "title_similarity": "0.7118374",
            "sentiment_compound": 0.296
        },
        {
            "id": "hc0cd7q",
            "score": 1,
            "text": "I think you shouldn't kill people even if they aren't american citizens. So I don't think your analogy makes sense.",
            "title_similarity": "0.6101217",
            "sentiment_compound": 0.5773
        },
        {
            "id": "hc0cnzg",
            "score": 1,
            "text": "I get the intimation that this is a ‘gotcha’ post. I just want to push back on you that most of the pro-lifers will have no qualms with this and already support things like tax credits for the unborn and for them to be considered for stimulus checks.",
            "title_similarity": "0.66560304",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hc0eij0",
            "score": 3,
            "text": "I am pro life and I would love for mostly everything you mentioned to be the reality. One confusing issue is your example on citizenship would mean people would have to prove where the baby was concieved? I think the citizenship being given at birth just makes sense logistically but I'm not against your idea if there is a reasonable way to prove where the life began. Someone else mentioned the maternity leave issue so I won't get into that as it would have been my only other issue. In fact I would love to make the process much easier for expectant mothers and the baby.",
            "title_similarity": "0.76141655",
            "sentiment_compound": 0.9072
        },
        {
            "id": "hc0fhda",
            "score": 3,
            "text": "Well if you attack a pregnant woman the charge \"battery of a pregnant woman\" already exist and is a harsher sentence than a non pregnant woman, so this already exist to some extent.",
            "title_similarity": "0.6483686",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hc0h8bs",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056496207"
        },
        {
            "id": "hc0hjr6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.056496207"
        },
        {
            "id": "hc0hn26",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.056496207"
        },
        {
            "id": "hc0iwf0",
            "score": 1,
            "text": "Ok so I’m assuming you’re pro choice. If I say yes to all of your statements, are you now going to be pro life?",
            "title_similarity": "0.50776565",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hc0jbjv",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.069711246"
        },
        {
            "id": "hc0jrca",
            "score": 3,
            "text": "Probably already said somewhere but I didn't fully read through every comment.\n\nI see what you're getting at, but your conclusion of what is necessary to be \"logically consistent\" is false. Specifically, you can be pro life and believe killing a fetus is \"murder\" but not believe the fetus is an American citizen with all the rights that confers. Those are perfectly consistent positions to hold. Why? Well, I believe killing an illegal immigrant is still murder. I believe killing a foreign national is still murder. I believe killing a visiting diplomat is still murder. I believe killing a consultant here on a temporary work visa is still murder. I believe killing the janitor on your European vacation is still murder. Etc.\n\nThe point obviously being the right to life is something we as Americans believe is intrinsic to everyone, not just a privilege acquired once American citizenship is gained. A fetus need not be a citizen for me to still consider the intentional killing of one wrong",
            "title_similarity": "0.7719969",
            "sentiment_compound": -0.9984
        },
        {
            "id": "hc0km4j",
            "score": 1,
            "text": "You’ve drawn a line that makes all of this irrelevant because a fetus isn’t a child but okay.",
            "title_similarity": "0.578151",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hc0kroz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056496207"
        },
        {
            "id": "hc0lsko",
            "score": 1,
            "text": "I don’t know how deportation works, but I agree that women (and men) should get the parental care needed while pregnant. However, a minor technically had no/ very few rights. You wouldn’t let a one year old pay taxes, because it doesn’t need to. It wouldn’t make any sense. So some things just don’t apply. You don’t need an umbrella when it isn’t raining. And yes, paid maternity leave should be available, but it should also be warned against, as it is 6 weeks of healing from an operation, so it isn’t really about bonding, it is for companies so that their employee is not distracted and underperforming.",
            "title_similarity": "0.7618693",
            "sentiment_compound": 0.878
        },
        {
            "id": "hc0lw31",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0m9af",
            "score": 1,
            "text": "Citizenship, legally is granted by virtue of being born in the US or born to US citizens. \n\nIt’s not bestowed by virtue of being alive…\n\nI’m not saying that’s how it should be. I’m saying that’s how it is. It’s totally acceptable to want to Cha GE this law, but the fact is that being alive and in America (in a uterus) is not sufficient to establish citizenship.",
            "title_similarity": "0.72224486",
            "sentiment_compound": 0.7515
        },
        {
            "id": "hc0mevj",
            "score": 1,
            "text": ">It means child support should start at 6 weeks, or whenever we consider it \"life\".\n\nThis has a very hard time tracking because it is very difficult to determine parenthood before birth as the tests that they can give aren't often considered legally binding.  Nor is that kind of stressful activity valuable to a pregnant woman.  Carrying a child is enough of a burden without forcing them to go to court multiple times, often having to rearrange doctors visits because courts are not sympathetic to your schedule.",
            "title_similarity": "0.66167986",
            "sentiment_compound": -0.8007
        },
        {
            "id": "hc0mkac",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0msfe",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0nea4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056496188"
        },
        {
            "id": "hc0nm5f",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056496188"
        },
        {
            "id": "hc0nqro",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056496188"
        },
        {
            "id": "hc0oy0p",
            "score": 5,
            "text": "Yes absolutely.  I’m 100% anti-baby murder, and I’m 100% in support of that being treated like a human.\n\nI also support criminal punishment for fathers who leave their children (obviously with the stipulation that “leaving” isn’t just not being in a romantic relationship with the mother anymore, but pulling financial support etc.)",
            "title_similarity": "0.7558155",
            "sentiment_compound": 0.5346
        },
        {
            "id": "hc0p7jh",
            "score": 4,
            "text": "the parent should have the choice to remove the child and it put in an incubator on the state's dime as soon as it's feasible.",
            "title_similarity": "0.72134364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc0palt",
            "score": 1,
            "text": "Yes, that is the argument.  You missed abolishing the death penalty and coming down harder on absentee dads.  On the other side, education and building a culture of community and family is important to the child's life as well.",
            "title_similarity": "0.6752547",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hc0pk9y",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0qvju",
            "score": 1,
            "text": "Your position is changing the determinant of citizenship from place of birth to place of conception, \n\nIf place of birth is no longer used to determine where a baby get it’s citizenship from and now would be location of conception, it would make the baby an illegal alien under US law.",
            "title_similarity": "0.79714036",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hc0rxic",
            "score": 2,
            "text": "I agree with most of your points. The only thing I would say is that the citizenship argument doesn't exactly hold water. Let's say a pregnant woman is spends some time in more than one country. Should citizenship be granted by any country a fetus happens to be in? I say no. If a child visits Canada it doesn't make them a citizen. Citizenship is initially based on where a person is born.\nSo for a fetus we would need an analogous defining moment in time to determine citizenship. You could argue this would be conception (or 6wks or life defining moment) but as this is normally an unobserved event this is almost impossible.\nOne could argue that citizenship simply matches that of the mother until point of birth but then the deportation argument is nullified.\nI'd like to see what you think of this solution.",
            "title_similarity": "0.7136867",
            "sentiment_compound": 0.0355
        },
        {
            "id": "hc0ss9t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0ssm0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0twz0",
            "score": 1,
            "text": "Deal. You go out and pay for someone’s kid right now.",
            "title_similarity": "0.4095816",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hc0uwe1",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.069711246"
        },
        {
            "id": "hc0vejz",
            "score": 1,
            "text": "Literally no pro-lifer disagrees with you",
            "title_similarity": "0.30343696",
            "sentiment_compound": -0.0613
        },
        {
            "id": "hc0vnyn",
            "score": 1,
            "text": "So be it....this is supposed to be bad becausseeeeeee......",
            "title_similarity": "0.30945852",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc0wm0d",
            "score": 1,
            "text": "I agree except child support should be taken away",
            "title_similarity": "0.51279354",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc0wpvp",
            "score": 1,
            "text": "Sure he/she does. They would have those rights and protections in a few months left alone anyway.",
            "title_similarity": "0.4456768",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc0wyc0",
            "score": 2,
            "text": "I accept your conditions.",
            "title_similarity": "0.026910443",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hc0xd2f",
            "score": 1,
            "text": "If the foetus is awarded citizenship as an independent entity then what happens to its mother, including deportation, is independent of that. They're only a package deal in your opinion. \n\nYou can have an interest in the preservation of life independently of citizenship. Personhood awards rights in the law ahead of citizenship, which is how the law of the land applies to everyone in it regardless of citizenship.\n\nIf a woman cannot provide for her child then it should be placed with the father, or if that isn't viable in the custody of the state. Your opinion that a child is synonymous with a stipend for the mother (whether from a man, or all men in the form of the state) is a only that. Her choices, her consequences.\n\nIf a woman gets pregnant that's on her. Where action is married with consequence the situation is just. I understand that we live in a society that refuses to treat women like adults but that will never change unless we want it to. Women have an array of options to prevent or terminate pregnancy without using abortion, yet for some reason we are always expected to ignore that and just treat them like irresponsible imbeciles that bump into sperm by accident. It just isn't true.",
            "title_similarity": "0.801304",
            "sentiment_compound": -0.1022
        },
        {
            "id": "hc0xfjl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0xln2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc0yifc",
            "score": 1,
            "text": "You’re advocating for anchor babies?\n\nThose already exists?\n\nWhat view am I supposed to change exactly?",
            "title_similarity": "0.53025836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc0ymq1",
            "score": 1,
            "text": "Healthy men should also be required to donate a kidney and lung to anyone who needs it and might die without it.",
            "title_similarity": "0.5840268",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc0z077",
            "score": 1,
            "text": "If you’re born in America you do get citizenship.",
            "title_similarity": "0.4704951",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc0ztlr",
            "score": 1,
            "text": "Yes, BUT does this mean that if states did provide these services that you wouldn’t oppose anti-abortion legislation?",
            "title_similarity": "0.67497885",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hc114ui",
            "score": 1,
            "text": "One point you missed. If this was the case, if a mother is found to be smoking, drinking, or taking harmful drugs during pregnancy. They should be criminally charged with Child abuse and any crime that fits causing physical and mental permanent damage.\n\nI would rather see this in some form with abortions being legal.",
            "title_similarity": "0.8129969",
            "sentiment_compound": -0.9246
        },
        {
            "id": "hc11wu6",
            "score": 1,
            "text": "Texas killed over 400 people with the death penalty. Why do they care about unborn babies when they don’t give a shit about people at any age",
            "title_similarity": "0.5943091",
            "sentiment_compound": -0.9153
        },
        {
            "id": "hc13vjd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc1592e",
            "score": 1,
            "text": "What are anchor babies?",
            "title_similarity": "0.25401127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc15krs",
            "score": 1,
            "text": "Yeah I agree, abortion bad, fetus is a baby and is human, it should have human rights. A worthy deal",
            "title_similarity": "0.76853573",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hc16ki4",
            "score": 1,
            "text": "....”perks”.....?",
            "title_similarity": "0.011804763",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc189lk",
            "score": 1,
            "text": "All rights are not given immediatly in other cases. Why should they now? A 14 year old does not have the right to vote and get married for example.",
            "title_similarity": "0.54335463",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc196rc",
            "score": 1,
            "text": "The law, as written, requires the child to be born. The 14th Amendment of the USC holds both due process and privileges and immunities claims for citizens. The triggering events are born or naturalized. The text specifically does not claim P&I or due process for gestative children. That is why your statement is wrong. These children, whether balls of cells or full fledged human beings, are not yet citizens and should not get the P&I or Due Process thereof.",
            "title_similarity": "0.753082",
            "sentiment_compound": -0.128
        },
        {
            "id": "hc19xm3",
            "score": 1,
            "text": "Its not logically consistent to believe in human rights to life is the same as arbitrary laws on citizenship. One is universal truth, the other is as meaningful as tax law. But you’re right, abortion is a human rights issue.",
            "title_similarity": "0.75766814",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hc1a3uc",
            "score": 1,
            "text": "thats just the start. go deeper.   \n\n\nif you think you can force a human being to be some sort of host to another parasite-human, than you should also consider forcefully removing organs from everyone if someone else needs it to live. (of course just organs where you have multiples or parts can be taken out.",
            "title_similarity": "0.6524896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1afdv",
            "score": 1,
            "text": "I love this line of thinking.  Imagine putting dudes on the sex offender registry for screwing a pregnant woman?  Listing your fetus as a dependent on tax forms?  Carpool lane?",
            "title_similarity": "0.65582216",
            "sentiment_compound": 0.327
        },
        {
            "id": "hc1awim",
            "score": 1,
            "text": "You could use the same argument against vegetarians and that would be pretty stupid. So there must be a flaw somewhere in your argument.",
            "title_similarity": "0.5449108",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hc1d65y",
            "score": 1,
            "text": "Not to mention, a pregnant woman should be able to drive in the HOV lane since she is carpooling.",
            "title_similarity": "0.57804555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1dqfh",
            "score": 1,
            "text": "the gop would never really put a real challenge, it will lose. That's not their reason tho, they just want to appear to keep fighting their good fight so the mindless clutist will keep hanging in there. They have no impetus to actually outlaw abortions.",
            "title_similarity": "0.6269858",
            "sentiment_compound": -0.8261
        },
        {
            "id": "hc1e1ck",
            "score": 1,
            "text": "[Especially the right to bear arms ](https://images.app.goo.gl/yUJn7jQPGfSK3vh88)",
            "title_similarity": "0.39697096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1e57c",
            "score": 2,
            "text": "You are conflating human rights with personhood and citizenship.\n\nAll humans have a right to life. Just as murder doesn't become acceptable because the victim is foreign, murder remains wrong regardless of the age of the human. Once we determine the fetus is alive, it gains human rights.\n\nBut citizenship and personhood are not human rights. Nobody has the right to be an American, nor to claim benefits. These are PRIVILEGES, not rights. Denying welfare to the unborn is simply denying welfare to non-citizens. Citizenship is granted at birth, and it is then the privileges of personhood and citizenship apply. There is neither reason, nor benefit to extending either of these titles to the unborn.\n\nAs a final point, as many others have pointed out, there are numerous benefits available to pregnant women to help mitigate the cost and complications of pregnancy.",
            "title_similarity": "0.81981033",
            "sentiment_compound": 0.8857
        },
        {
            "id": "hc1fx6v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc1g2i1",
            "score": 1,
            "text": "If I say okay to all this, would you support a federal ban on abortion?",
            "title_similarity": "0.7181469",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1gtc8",
            "score": 1,
            "text": "Can pregnant women drive in the HOV lane?",
            "title_similarity": "0.385251",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1ipki",
            "score": 2,
            "text": "LIFE INSURANCE FOR MY FETUS !!!",
            "title_similarity": "0.60246146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1j1vf",
            "score": 1,
            "text": "Additionally the birth mothers should be held responsible for abusing drugs that harmed the baby in utero. I have seen too many times, pregnant women abusing drugs then at delivery DCF gets involved and the child is placed for adoption while the birth mother walks away clean as a whistle. Meanwhile the baby is left alone in the NICU suffering from withdrawal.",
            "title_similarity": "0.7275834",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hc1jzsy",
            "score": 1,
            "text": "This is a bad take if you believe that abortions should be legal simply because you're giving in\n\n\nAlso those people believe life starts at conception so good luck with '6 weeks'",
            "title_similarity": "0.8188641",
            "sentiment_compound": 0.7521
        },
        {
            "id": "hc1kaq0",
            "score": 1,
            "text": "Tax write off starts at 6 weeks.",
            "title_similarity": "0.27661985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1lyet",
            "score": 3,
            "text": "I am pro life and I agree with almost 100% of what you've argued. Fathers should be required to pay child support if they aren't married to the mother as soon as she knows she's pregnant. And any material benefits a mother could accrue because of born children (maternity leave, welfare, etc) should apply to pregnant mothers as well.\n\nMy one objection is the deportation protection argument. The 14th Amendment clearly states: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" We could have a Supreme Court ruling or additional amendment which modifies the ruling to include \"any person conceived,\" but that's not currently the language. Also, there is significant debate on how Birthright Citizenship should apply to the children of illegal immigrants. Because a strong argument can be made that children born to women who entered the country illegally are not \"subject to the jurisdiction thereof\" and therefore violate the second clause. \n\n&#x200B;\n\nLike I said, I'm 100% for full application of treating the child as alive in every sense of the law, except for this one specific application which is still up for debate.",
            "title_similarity": "0.83298373",
            "sentiment_compound": 0.7311
        },
        {
            "id": "hc1m44t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc1nwvt",
            "score": 1,
            "text": "As being generally against abortion in most cases, I can agree with this.",
            "title_similarity": "0.53539455",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc1opn0",
            "score": 1,
            "text": "Sounds good",
            "title_similarity": "-0.07660314",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc1p1r2",
            "score": 1,
            "text": "If a person is pregnant when murdered, the assailant is charged with the murder of the unborn child. If they have a miscarriage, their friends cry and give condolences and the baby is considered an American citizen if it is born on American soil even if the parents aren’t. Three examples of autonomy without the biological reasons which are immutable.",
            "title_similarity": "0.776175",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hc1pfoh",
            "score": 1,
            "text": "Yes",
            "title_similarity": "-0.11269669",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc1pkxn",
            "score": 1,
            "text": "How about the parents take responsibilty for their actions through hard work and daily self improvement?",
            "title_similarity": "0.43385398",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hc1qbsf",
            "score": 1,
            "text": "Okay sounds good to me! \n\nWhy so angry op? Do you normally get this angry at not being able to get take innocent lives?",
            "title_similarity": "0.50028396",
            "sentiment_compound": -0.5527
        },
        {
            "id": "hc1qkec",
            "score": 1,
            "text": "Ok to everything besides maternity leave. That is horrible economics and horrible for women overall. When it comes to the economics you have an entire group of people who are still very much capable of work just staying at home or going out to places soaking up money. Maternity leave is meant for when you can no longer work for this very reason. And when it comes to it being bad for women, well now instead of every so often you have an employee gone for a few months tops, they will be gone for almost a full year if not more. Doesn’t make sense for a company to hire a group who can pretty much randomly be gone for an entire year and then have to pay them during that time.",
            "title_similarity": "0.56057286",
            "sentiment_compound": -0.2075
        },
        {
            "id": "hc1qwko",
            "score": 1,
            "text": "I'm not anti-abortion, but I think I am more against it then the average person because I see it as a life, and as such a totally agree that the baby should have full legal righs even before birth and that the mother deserves maternity pay starting at an earlier point. However, I know very little on the subject so I'm not the most well qualified to comment.",
            "title_similarity": "0.7628063",
            "sentiment_compound": 0.3167
        },
        {
            "id": "hc1sfho",
            "score": 2,
            "text": "The foetuses should have to attend school and do chores like other children, it’s about time they pulled their weight around here.",
            "title_similarity": "0.5944801",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc1ut3e",
            "score": 2,
            "text": "1. Yes, it does. Pregnant mothers are given full protections under US civil and criminal law as well as can it be deported when the child is born.\n2. Child support does start earlier as the father is responsible for part of the medical bills.\n3. Expecting mother’s do get additional welfare benefits in addition to those described above. They have access to state funded healthcare, dietary supplements, clothing, parenting classes, and even specific shelters designed for expecting and new mothers.\n4. By “benefits of do you men’s rights and responsibilities? It is a right to have children and you have a responsibility to that child. What other “benefits” are you granted with children?\n5. If you want this to be a logical discussion, you really should go back and take a second look at the ground you are building this upon. You really don’t understand what you are talking about and are horribly misinformed.",
            "title_similarity": "0.7345829",
            "sentiment_compound": 0.5661
        },
        {
            "id": "hc1utog",
            "score": 1,
            "text": "Citizenship thing is a bit of a tricky one because it would be difficult to prove where the baby was conceived, but deporting a mother can incur stresses that can potentially cause her to miscarry, so I do agree that maybe we shouldn't be deporting the pregnant. But everything else is pretty based in my opinion. A life is a life and we should do what we can to take care of the lives of others, even the unborn.",
            "title_similarity": "0.7524448",
            "sentiment_compound": 0.8018
        },
        {
            "id": "hc1v5ux",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056496188"
        },
        {
            "id": "hc1vdqd",
            "score": 1,
            "text": "Yeah ok",
            "title_similarity": "-0.13517761",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hc1vp2x",
            "score": 1,
            "text": "What are these *perks* you speak of?",
            "title_similarity": "0.12963948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1wbfn",
            "score": 1,
            "text": "OK....so then a woman playing sports who has a miscarriage due to an a physical impact from the sport....that's manslaughter?",
            "title_similarity": "0.509991",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hc1x6ey",
            "score": 1,
            "text": "Idiots are pro life until they have to take care of the child.",
            "title_similarity": "0.5251874",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc1xg1r",
            "score": 1,
            "text": "Citizenship is currently assigned at birth either because the parents are American or because of birthright citizenship.  So there is an easily definable event behind this right.\n\nThis question fundamentally fails to clarify that.  What is the Constitutional Amendment that you are proposing to make this happen?  For birthright citizenship, how can you tell where the baby was conceived?  What is the \"event\" at which citizenship is assigned?  Are we just saying anyone of any nationality who just asks a doctor to confirm they are 6 weeks pregnant is automatically carrying an American citizen now?\n\nDoes it mean we remove birthright citizenship altogether?  Does it mean that if someone is visiting the US while pregnant that their fetus is accorded no rights until it is born as a birthright citizen?  Does it mean that non-US citizens could technically get an abortion here but citizens could not?",
            "title_similarity": "0.8330341",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hc1y15m",
            "score": 1,
            "text": "Ok",
            "title_similarity": "-0.11980517",
            "sentiment_compound": 0.296
        },
        {
            "id": "hc1y3s3",
            "score": 1,
            "text": "Yes. I agree. I oppose abortion on the fundamental value of life being precious and rare, I also support systems of support for those who are living. Some people who oppose abortion are more nuanced than “Bootstrap bootstrap you can’t kill that baby.”",
            "title_similarity": "0.73583144",
            "sentiment_compound": 0.875
        },
        {
            "id": "hc1ymrz",
            "score": 1,
            "text": "If, *as they did*, the Supreme Court rules that there is a state interest in protecting the potential life of a fetus, does that mean they decided Roe v Wade incorrectly? That their balancing of such with the privacy of the woman shouldn't exist and SCOTUS should have laid the groundworks for what you laid out as the constitutional practice?",
            "title_similarity": "0.84724617",
            "sentiment_compound": 0.7882
        },
        {
            "id": "hc1ysqs",
            "score": 1,
            "text": "You assume they think parents and children deserve those benefits…",
            "title_similarity": "0.4110824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc1yucd",
            "score": 2,
            "text": "Scientifically speaking, they are fully human beings.  Most folks try to argue from a philosophical standpoint, which is odd since that’s just arguing by opinion.\n\nSo yeah, I agree.  They and their parents should get all the normal legal protections and that includes all the full supports that would normally be allowed any other human being.",
            "title_similarity": "0.6723173",
            "sentiment_compound": 0.2335
        },
        {
            "id": "hc1zk40",
            "score": 1,
            "text": "I'm not American thank goodness. But I don't understand why pro lifers only seem to care about fetuses but once a child is born don't believe in free or affordable health care or any kind of help to make sure that person stays alive. Like it's ok to charge astronomical prices for life saving medicine but noooo universal health care is the devil. It's pathetic control dressed up as pro life.",
            "title_similarity": "0.7173064",
            "sentiment_compound": 0.8863
        },
        {
            "id": "hc20rs0",
            "score": 2,
            "text": "You have a really good point that progresses the conversation, even if it may have been presented to show how absurd that would be. \n\nSo legally speaking we often create a third category for exceptions. \nFor example: the executive branch executes the law and the legislative branch makes the law...however, we have federal agencies that are created to execute mandates of the legislature, but also write their own rules - This would be an exception to the dichotomy that otherwise exists. \n\nAnother example is children. When youre a minor, you're definitely a human being but you are treated a little differently. For example, generally speaking, contracts cant be enforced against minors against their will. Thats why parents have to co-sign. Minors can also be removed from abusive homes, the government can and very often does tell parents that they arent fit to be parents and the child is taken away. Minors are treated differently - theyre an exception. \n\nIf i were pro-life, I wouldnt argue for the notions you put forward because that's absurd (which was your point, i think). Instead id probably refine them and say fetuses past a certain gestational age are provided certain protections along the line of minors, but obviously not to that extent. It would require some time to flesh out the rights, but one of them would obviously be to not be killed. \n\nTl;dr\n youve created a false dichotomy in your question. Fetuses can still be protected while not being given all the rights a minor has. Just as minors can be protected while not having all the legal responsibilities a fully grown adult has.\n\nEdit: too many hyphens not enough commas",
            "title_similarity": "0.6111098",
            "sentiment_compound": 0.9676
        },
        {
            "id": "hc22k9y",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc22ogx",
            "score": 1,
            "text": "I would add that child support not end at 18 but continues through college age 22 and the child directly receive those payments no longer the parent that received it before. At 18 basically whatever mommy or daddy was getting from child support goes directly to the child as well as an equal portion from the other parent.",
            "title_similarity": "0.61277354",
            "sentiment_compound": 0.6428
        },
        {
            "id": "hc234ga",
            "score": 1,
            "text": "You know what your right about this I honestly never considered the child support pay. Someone get those things into law. Someone should probably iron out bits and pieces of the law but this is a good idea even.",
            "title_similarity": "0.66799915",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hc2539x",
            "score": 1,
            "text": "I'll just take these one at a time:\n\n> This means it is a citizen and it's parents are protected from deportation.\n\nTechnically speaking, I am not aware of any philosophical principal which states that people are a citizen of the country they are born in.  Indeed, it seems to me that the child inherits their parents citizenship.\n\nIf a country wishes to extend this offer of citizenship to any children born within its borders, that is fine.  But that is not inherently tied to the fetus becoming alive, but rather to the event of birth.\n\nAlso, from a practicality perspective, it is far harder to determine at what point a fetus was conceived/has a heartbeat/is conscious/etc... than it is to determine at what point the child was born.\n\n> It means child support should start at 6 weeks, or whenever we consider it \"life\".\n\nIf you support child support, then yes.  If you think that paternal rights are sorely lacking, you probably would insist that fathers rights be fixed before this were to be changed.\n\n> It means mothers who need it should be getting additional welfare benefits once determined to be pregnant.\n\nIf you support the welfare system, then yes.  If you don't, then you'd probably not support it's expansion.\n\n> If the parents are forced into a legal obligation to care for the child then they absolutely need to also be given the same benefits that parents of \"birthed\" children can enjoy.\n\nSome benefits are arbitrary (which must be justified on their own, separate from the person-hood of the fetus), and some are a consequence of natural rights (which should be granted immediately).\n\n> If the parents are forced into a legal obligation to care\n\nMinor nitpick: pro-lifers do not believe they are forcing someone to care for their child, they believe they are preventing them from killing them.  While this may seem like a restatement of the same thing, it is important to bring up because there is a difference in moral culpability between causing death by stabbing someone vs causing death by failing to provide them food.\n\n> \"Also, if a job provides paid maternity leave benefits then those should be allowed to start as early as 6 weeks into pregnancy.\"\n\nThis is a private negotiation between the employer and employee.  But it is there for a practical reason: right after birth the child becomes a significantly larger burden on the mother in terms of her time and energy, so she is less able to continue working.  This practical reason is why maternity leave is available (and because an employer would rather be out an employee for 6-8 weeks than permanently lose them).  This does not change regardless of the person-hood status of the fetus.\n\nIf a woman wants maternity benefits earlier she can negotiate that with her employer.  But it will likely result in a lower salary since she is asking to recurve extra pay without providing extra work, or the same pay for less work.",
            "title_similarity": "0.78233457",
            "sentiment_compound": 0.9888
        },
        {
            "id": "hc26rbj",
            "score": 1,
            "text": "If I went into a hen house and crushed all their eggs all I gotta do is explain to the hens , oh it’s not murder it’s abortion! Then all the hens were 100% ok with it.",
            "title_similarity": "0.6524519",
            "sentiment_compound": 0.5315
        },
        {
            "id": "hc26xxz",
            "score": 1,
            "text": "Trick step. You don't want to change from land to blood.",
            "title_similarity": "0.44368294",
            "sentiment_compound": -0.1083
        },
        {
            "id": "hc27lj5",
            "score": 1,
            "text": "Everyone is against abortion until their 13 years old daugther gets raped and gets pregnant.",
            "title_similarity": "0.6242652",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hc27tb4",
            "score": 1,
            "text": "Your terms are acceptable (except welfare but I don’t agree with welfare in the first place so it’s not just because she’s pregnant)",
            "title_similarity": "0.5663998",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hc282gy",
            "score": 1,
            "text": "I think the problem is that you're assuming they make this argument in good faith, and actually give a shit about human life.",
            "title_similarity": "0.5760832",
            "sentiment_compound": -0.5385
        },
        {
            "id": "hc28l5a",
            "score": 1,
            "text": "Why does everyone find these absurd things to keep justifying being allowed to kill babies.",
            "title_similarity": "0.6050385",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc294v0",
            "score": 1,
            "text": "Well yes I agree, if a woman is expecting a child does it not make sense to provide welfare so that she may be able to take care of the child in the future. This would actually fix a lot of problems of people wanting an abortion because they're unable to take care of the child, but we all know something like this in America is nothing more than a pipedream.",
            "title_similarity": "0.82251894",
            "sentiment_compound": 0.8294
        },
        {
            "id": "hc298r4",
            "score": 1,
            "text": "Wait until you find out what insurances consider “life.”",
            "title_similarity": "0.4436575",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc29ba3",
            "score": 1,
            "text": "You assume a life form is entitled either to absolutely zero protections or all the rights of US citizenship. Consider a family pet or an endangered species. They enjoy protections under the law without personhood.",
            "title_similarity": "0.6400771",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hc29o3g",
            "score": 1,
            "text": "Shouldn't the mother's rights be respected? The embryo does not own the mother.",
            "title_similarity": "0.65629166",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hc29qke",
            "score": 1,
            "text": "Done and done...totally fine with that.",
            "title_similarity": "0.05891505",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hc2aj4v",
            "score": 1,
            "text": "Your terms are exceptible",
            "title_similarity": "0.13823542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc2ca2d",
            "score": 1,
            "text": "OP is right.  No need to CV",
            "title_similarity": "0.17377508",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc2cbk1",
            "score": 1,
            "text": "Your first point of the fetus being legally treated as a child and therefore not deporting the mother might not work out so well. If we take that standard to its end we will need the mother to provide proof that conception occurred within the borders. Same with all \"anchor babies\", etc, their parents need to cough up the conception details with proof or it's back to Mexico with them! (where the fetus can then be aborted, but that's another topic) \n\nOverall, I'm pretty sure the racists will support your efforts on this.",
            "title_similarity": "0.85603786",
            "sentiment_compound": 0.8132
        },
        {
            "id": "hc2chsi",
            "score": 1,
            "text": "I agree. Yes he/she should! With all the funding necessary to help it grow healthy and educated",
            "title_similarity": "0.32596934",
            "sentiment_compound": 0.8718
        },
        {
            "id": "hc2crmu",
            "score": 1,
            "text": "Sounds good.",
            "title_similarity": "-0.081119396",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc2d83y",
            "score": 1,
            "text": "Legally treated as. Child? Why child? Baby comes before child, toddler comes before child.\n\nWhy do you arbitrarily choose child to compare it to?",
            "title_similarity": "0.59935397",
            "sentiment_compound": 0.2359
        },
        {
            "id": "hc2dzy8",
            "score": 1,
            "text": "Let women do what they want with their bodies. Is it yours? Then leave it alone.",
            "title_similarity": "0.4714395",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hc2ef6n",
            "score": 2,
            "text": "OP is right. Get that fetus a gun and a Facebook account.",
            "title_similarity": "0.5311373",
            "sentiment_compound": -0.34
        },
        {
            "id": "hc2f4gx",
            "score": 1,
            "text": "Yes I like this take",
            "title_similarity": "0.033874415",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc2f642",
            "score": 1,
            "text": "This is literally what people believe. It's sorta funny you are mocking it and missing the point\n\n>It means child support should start at 6 weeks, or whenever we consider it \"life\".\n\nYeah these same people want responsible parents to raise a child together since having two parents is better for the child. I would take it one step further and require both parents to be present in the child's life. You can't just throw money at this problem\n\n>It means mothers who need it should be getting additional welfare benefits once determined to be pregnant.\n\nMaybe, but they think you should be personally responsible enough to not have a kid when you can't even afford to live yourself. Maybe people like OP think \"oh shit I'm pregnant, get rid of the baby\" these people think \"be responsible, don't get pregnant, own up to your mistakes if you do\"\n\n>From a tax standpoint, yes a fetus should be treated just the same as a child. Let them be claimed as a dependent because they are.\n\nMight be different where you are but I believe many baby related expenses are tax deductible. A dependent without a social or corporeal manifestation isn't going to look good on an audit. Are you going to pay the money back if you don't carry the \"dependent\" to term? Only takes 9 months to make a baby so you get your dependent in that year. Just gotta say your whole mentality in this is exactly what the people you are mocking don't like. You should plan to have a baby because you genuinely want one and can give it a good life. Sorta feels gross talking about getting monetary benefits of a baby. \n\n>If they could earn income then it would be reported all the same, too.\n\nAny money \"earned\" by an unborn baby was labor of the parents. obviously taxable\n\n>f the parents are forced into a legal obligation to care for the child then they absolutely need to also be given the same benefits that parents of \"birthed\" children can enjoy.\n\nYou can give up a child for adoption. It seems weird that no one wants to talk about personal responsibility. No one wants to talk about how women are haunted by abortions later in life. Abortion is no longer uncommon. The government doesn't owe you things for making bad choices. You claim to be logical but this whole post is an illogical money grab that sounds like the ramblings of eric cartman.\n\n>This post is about logical consistency more than it is moral superiority. I'm not making a claim on what is morally right, only following a line of logic where if A is true, then B must also be true to maintain consistency.\n\nI would say some of your logic isn't well thought out, but it's just sorta funny how disconnected you are in general. I would say you at least need some understanding of the people you try to mock in order to be effective. as well as just general knowledge on ethics and the other things you suggest\n\n>Pregnant women in the carpool lane\n\nmakes sense\n\n>compulsory kidney donations?\n\nhuh? This is an ethical issue first of all. Going back to the Nuremberg trials, you can't force unwanted medical procedures unless you want to be a literal nazi \n\n>Criminal punishment for pregnant drug use \n\nabsolutely. nicotine and alcohol as well. I think caffeine or any legal drug as well, personally. Why expose the baby to all that?\n\n>Fetus life insurance\n\nWhy couldn't you do this now? They insure race cars, so i assume they will insure anything if you pay them enough. \n\n> if a job provides paid maternity leave benefits then those should be allowed to start as early as 6 weeks into pregnancy.\"\n\nwhat job provides infinite paid maternity leave? It's usually a given amount of time. You can take more and your job will still be there, obviously, you just don't get paid for it. You can take your maternity leave whenever you or your doctor think you need to",
            "title_similarity": "0.7932474",
            "sentiment_compound": 0.9738
        },
        {
            "id": "hc2fch3",
            "score": 2,
            "text": "I understand we are our own country but we should have just said \"All Americans are created equal\" instead of \"All men are created equal\" because apparently non-american citizens do not have the first amendment.",
            "title_similarity": "0.6879504",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hc2fglg",
            "score": 2,
            "text": "Yes, those are acceptable terms. Just don't kill them.",
            "title_similarity": "0.3167712",
            "sentiment_compound": 0.8289
        },
        {
            "id": "hc2g7oa",
            "score": 1,
            "text": "I don't see any problems giving unborn babies full protection under the law.  But are you saying that anyone who enters in the United States pregnant, and then leaves the country before birth, gives birth to an American?  At what point would citizenship attach to the unborn baby?",
            "title_similarity": "0.79336023",
            "sentiment_compound": 0.7498
        },
        {
            "id": "hc2h052",
            "score": 1,
            "text": "You have two main types of anti abortion people. \n\n1. People who don’t actually care and just want power and control over others. \n\n2. People who actually think it’s murder and would have no problem counting them as living citizens.\n\nThe politicians goal is to pander to both groups, while belonging to the first group.  But ultimately they don’t want to successfully overthrown or outright ban anything because that would take away their golden goose rallying cry for donations and votes.",
            "title_similarity": "0.7257298",
            "sentiment_compound": -0.7114
        },
        {
            "id": "hc2hww0",
            "score": 1,
            "text": "This would mean an end of birth right citizenship for those conceived outside the US.\n\nE this would also be incredibly hard to prove location of conception for those that travel or recently immigrated. “Conception Certificates” sound like a mine field to try to implement",
            "title_similarity": "0.65898323",
            "sentiment_compound": 0.204
        },
        {
            "id": "hc2i1a6",
            "score": 1,
            "text": "No",
            "title_similarity": "-0.035175256",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc2j9al",
            "score": 2,
            "text": "Yep. They are demanding preservation of life without truly facilitating the how. At the expense of the human life that has already been established (the mother). \n\nMy unpopular opinion is that yes, a fetus is basically human and a baby. We have to stop semantical nonsense to avoid how hard a choice it is (but must always be available). We have to be mature enough to understand that, but ALSO still understand the right to terminate before it is born BECAUSE no infrastructure exists to make sure both lives involved are safe. Eg. the mother wont die or become financially destitute, and the fetus will have all rights and support to ensure a quality of life on their own. Including the option to incubate in an artificial womb. \n\nWe aren't there yet, so abortion MUST be an option. When/if we ever get there, I doubt abortion will be used as often. Unlike what the Republican terrorists want everyone to think, an abortion is horrific for everyone. But it should still be there as an option. We must do our level best to fight and give more options.",
            "title_similarity": "0.7751138",
            "sentiment_compound": 0.5812
        },
        {
            "id": "hc2jw0f",
            "score": 1,
            "text": "As someone who is pro-life: yes to all. If you don’t support the establishment and upkeep of a nurturing environment for children and their families, you don’t support their life. I’ll further add that birthdate would have to stop being the determining start point for age, with it instead legally beginning when the pregnancy is first medically observed. Everyone alive would legally become about 6-8 months older than they are if laws were passed in this manner.",
            "title_similarity": "0.8251368",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hc2kuiq",
            "score": 1,
            "text": "Go for it. Give them all of the benefits and support that can rationally be in common between a fetus and a minor. Maternity leave? Yes! Funding? Yes! Etc? Yes!\n\nJust don’t kill the baby. I know there are situations where the baby can be aborted like harm against the mother’s life in certain conditions, but generally, let him live.",
            "title_similarity": "0.732555",
            "sentiment_compound": 0.6923
        },
        {
            "id": "hc2l1lf",
            "score": 2,
            "text": "As a pro life person I agree completely with the post. I believe they are humans from the start which doesn’t mean pro life ends at birth. There should be support for pregnant women. Better healthcare. Tax breaks, pregnancy support. We should support women who are pregnant during AND AFTER their pregnancy.",
            "title_similarity": "0.66521674",
            "sentiment_compound": 0.91
        },
        {
            "id": "hc2lbf0",
            "score": 2,
            "text": "There is absolutely no middle ground on this one. Either: 1) the fetus is a life starting at 6 weeks and gets everything that any other life in this country would get; or 2) it isn’t and doesn’t.",
            "title_similarity": "0.56809694",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hc2lwvu",
            "score": 1,
            "text": "Well, and death benefits when there's a miscarriage.",
            "title_similarity": "0.46233052",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hc2n76h",
            "score": 1,
            "text": "This post shows a major lacking of understanding when it comes to what laws even are",
            "title_similarity": "0.29148617",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc2nism",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc2nyju",
            "score": 1,
            "text": "No view to change here...that is exactly what happens to a baby horn on American soil....they are automatically American, and receive all the perks that come with it. (One if the reason many travel to the US expressly to try and have a kid here....).",
            "title_similarity": "0.6775537",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc2oepm",
            "score": 2,
            "text": "Well a book of fairy tales that was written by someone that we can't prove actually existed who was born to a woman who was a virgin at the time of birth said it was wrong? \n\nWhat more do you need? It's in the book brah",
            "title_similarity": "0.61271065",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hc2p3yq",
            "score": 1,
            "text": "I think this is a good thing to be turned into a law.",
            "title_similarity": "0.4006459",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc2pj8l",
            "score": 1,
            "text": "The US has unrestricted Jus Soli, which means citizenship is granted at birth, not before. \n\nChild support should start when paternity has been established in cases where the mother would like to keep the child and the father would not. This can be a pre- or post- natal test, or when the father signs the paternity papers.\n\n\nThe flip side of this, is that if a woman can choose to abort a child, the father should have the same right to abort their responsibilities before birth if the mother chooses to keep the child.",
            "title_similarity": "0.85331607",
            "sentiment_compound": 0.3054
        },
        {
            "id": "hc2pyi4",
            "score": 1,
            "text": "The most straight forward response would be posting the \"Your terms are acceptable\" meme... \n\nIn interest of this sub's rules I'll expound a bit. \n\nLiterally nothing on your list (except for the kidney thing in your expanded list) is a problem, some of it even already exists (such a killing a pregnant person being a double homicide). \n\nNot everything is an absolute logical necessity (e.g. a country can draw the citizenship line at birth, rather than conception and nothing logically changes) but it is all reasonable. \n\n I think you could get pretty good buy-in from the pro-life crowd if these things were the flip side of banning in-utero baby killing.",
            "title_similarity": "0.73486084",
            "sentiment_compound": 0.1893
        },
        {
            "id": "hc2q08j",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056496188"
        },
        {
            "id": "hc2qe46",
            "score": 1,
            "text": "“Pregnant murder = double homicide” \n\nInteresting and reminds me of the \n[Scott peterson case](https://www.google.ca/amp/s/abcnews.go.com/amp/US/decades-convicted-pregnant-wifes-murder-scott-peterson-seeks/story%3fid=77665735)",
            "title_similarity": "0.5973275",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hc2qml1",
            "score": 2,
            "text": "Also pain and suffering for the woman forced to carry to term. Life-time support to deal with the potential trauma, both physical and mental.",
            "title_similarity": "0.42951214",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hc2rkt0",
            "score": 1,
            "text": "Assuming that a fetus is a person then all those things you said are already true, they’re just on hold for 9 months",
            "title_similarity": "0.5488758",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hc2rp5y",
            "score": 1,
            "text": "The problem with that concept is those are federal rights and protections not state.  With that being said those states that allow abortion up until birth would just allow people who to take in extra welfare while pregnant for 9 months then abort. You are conflating federal and states rights.",
            "title_similarity": "0.78182495",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc2rukl",
            "score": 2,
            "text": "They should be able to vote and own a gun.",
            "title_similarity": "0.4650129",
            "sentiment_compound": -0.34
        },
        {
            "id": "hc2rwzm",
            "score": 1,
            "text": "You’ve seen it quoted a lot, but fetuses are the best group to advocate for. It’s the easiest with the littlest personal responsibility, and the best part, when they’re born you can stop giving a shit",
            "title_similarity": "0.5938602",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hc2s1os",
            "score": 2,
            "text": "I’m pro life and I agree",
            "title_similarity": "0.18171659",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc2s3iq",
            "score": 1,
            "text": "Im pro life and i like this alot it makes perfect sense to have this enforced",
            "title_similarity": "0.23971823",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hc2t06d",
            "score": 1,
            "text": "I broadly agree with the premise in the OP (as a pro-lifer).  I think already in some countries the death of the unborn child is considered in the offence if a pregnant woman is killed or the child harmed during pregnancy.",
            "title_similarity": "0.75285304",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hc2ug6q",
            "score": 1,
            "text": "Legal obligation haha . Maybe just don’t have sex then murder a baby",
            "title_similarity": "0.6997076",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc2wczk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056496207"
        },
        {
            "id": "hc2wqtm",
            "score": 1,
            "text": "Some but not all. I just think you are using hyperbole to make an idea seem sillier than it might be. Or, you're rigging the argument by presenting the cases for the other side of the debate. Frankly, you're being a little ridiculous. \n\nYes if someone is looking to protect human life by making abortion illegal then they should apply the logic fairly. But I think that many do already. Maternal drug use could/should be a crime against a person (this has happened, so have car accidents with pregnant women, etc). Double homicides for pregnant women have been tried. Many pro life people push for these things. In addition to frowning on assisted suicides, suicides, etc. The issue is about protecting life equally regardless of age. \n\nFor what it's worth here, I do not want abortion to be illegal, I am just using the voice of reason here, as you are also trying to so. \n\nBut some of your ideas are just reaches. Insurance can make separate rules for fetuses, or plain ignore them. They have their own policies. Carpool lane rules, again, can surely be situational. Their intent is curbing emissions, not protecting human life. Tax law and citizenship are not the same as human life. Child support dan define terms outside of conception just because abotrion is legal or illegal, again it is a totally separate entitity. We can protect a migrant worker or a tourist (non-citizen) with our laws regarding homicide without taxing them, anyone claiming them as dependents or granting them citizenship. Slow down a little bit here... kidney donations??? Maternity leave is a corporate rule mostly, the gov just guarantees you keep your job if you leave it for a set number of weeks. You often can actually apply for it to start early or shift it later.",
            "title_similarity": "0.7704352",
            "sentiment_compound": -0.9193
        },
        {
            "id": "hc2xz7v",
            "score": 1,
            "text": "If we are arguing from a logical consistency standpoint, then advocating for pro-life laws without the other legal protections you mentioned would only be inconsistent IF those laws were advocated for born children. \n\nAs an example to debunk your logic:\n\nP1: It is possible to be pro-life and not support welfare as a general fiscal policy \n\nP2: If one does not support welfare at all, there is no logical case why they then must support welfare for unborn children. \n\nP3: It is not inherently illogical to be pro-life and not support welfare for unborn children.",
            "title_similarity": "0.7255579",
            "sentiment_compound": -0.8245
        },
        {
            "id": "hc31us6",
            "score": 2,
            "text": "The concept of feticide is actually read and it is considered a double murder if someone kills a pregnant woman.\nThat being said, I actually agree they should be given all those rights as well, that would probably help decrease abortions and show women they are not alone in they pregnancy, which is a popular cause for abortions. Except the kidney thing, I didn't quite get that. \n\nSo yeah, these are great points. We should strive for that.",
            "title_similarity": "0.78521395",
            "sentiment_compound": 0.8228
        },
        {
            "id": "hc35anr",
            "score": 1,
            "text": "> This means it is a citizen and it's parents are protected from deportation.\n\n\nNope.  Look at the 14th Amendment's definition of Citizenship:\n\n> All persons *born* or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. [emphasis added]\n\nAnd honestly, using a *long duration* scenario for citizenship is... messy, legally speaking.\n\nThink about it: if they were granted citizenship of any nation they were in between conception through birth, that would make Pregnancy Tourism a thing.  I would take my pregnant wife on a world tour, specifically hitting up basically every OECD country (including the current applicants).\n\nIn the course of a month (with studious documentation) I could guarantee my child citizenship in something like 3 dozen countries.",
            "title_similarity": "0.8160137",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hc36iir",
            "score": 2,
            "text": "You may not realize, but welfare DOES start benefits for the mother when she has a confirmed pregnancy. The moment you have a doctor's confirmation, you can get benefits that you are eligible for, including medicaid programs that you wouldn't be able to get without children, and WIC, etc",
            "title_similarity": "0.6487744",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hc36ov8",
            "score": 2,
            "text": "I dont really see what points youve outlined which are intrinsic opposites to the stance of a pro lifer, in fact I'm sure most would agree with this. the conception part seems extraordinary difficult to determine, there's a reason not a single country in the world does this. you claim its not a gotcha post but it really does seem like that",
            "title_similarity": "0.526191",
            "sentiment_compound": 0.6635
        },
        {
            "id": "hc37p73",
            "score": 2,
            "text": "1. This *does* feel like one of those \"trap\" posts.  \n2. Actually, most hard-core pro-life types agree with you, at least mostly.\n\nA lot of people on the left thing that pro-life people believe things that they don't, or they think they have other motives.  \n\nWhile there's certainly pro-life people with hypocritical policy positions and inconsistent beliefs, those exist throughout the spectrum.  \n\nBut let's break down your specifics:\n\n*This means it is a citizen and it's parents are protected from deportation.*\n\nThat assumes you agree with our immigration laws to begin with. \r  \n\r  \n*It means child support should start at 6 weeks, or whenever we consider it \"life\".*\n\nThat assumes you agree with the entire concept of of child support.  (Note that generally hard-core pro life types are also pro-\"kids within marriage\" types)\r  \n\r  \n*It means mothers who need it should be getting additional welfare benefits once determined to be pregnant.*\n\nThat assumes you agree with welfare in general.  Though I don't see a lot of people having issue with benefits for pregnant women.\r  \n\r  \n*From a tax standpoint, yes a fetus should be treated just the same as a child. Let them be claimed as a dependent because they are. If they could earn income then it would be reported all the same, too.*\n\nI don't think you'll find too many who would disagree on the pro-life side.\r  \n\r  \n*Pregnant women in the carpool lane*\n\nFew would disagree.  \n*compulsory kidney donations? Hey it's an interesting convo even though it's not exactly the same thing*\n\nThat's not a thing in the US. At all.  Are you from a different country where that is a thing???\n\n  \n*Criminal punishment for pregnant drug use*\n\nMost would agree.  \n\n\n*Fetus life insurance -Pregnant muder=double homicide*\n\nMost would agree.\n\nAlso, please note that we basically have two political parties in this country that are both by requirement coalition parties.  Few people agree with every stance of their party, but they pick the arguments most important to them and go along with whatever else.",
            "title_similarity": "0.63632077",
            "sentiment_compound": 0.9931
        },
        {
            "id": "hc38bel",
            "score": 1,
            "text": "Yes",
            "title_similarity": "-0.11269669",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc39w6p",
            "score": 1,
            "text": "Not to nitpick, but to better get my point across, let's look at the post title: \n\n\"If you believe abortion should be illegal\". This implies it should be illegal at least under some conditions and/or in some circumstances. \n\n\"... on the grounds that a life is being ended\". This is the circumstance. In other words, this is why abortion should be illegal.   But this is precisely the issue, IS a life being ended?  I take this to mean \"Life with both (a) the capacity to feel pain and (b) has some rudimentary sense of self-awareness\".  I disagree with both. \n\n[From: www.ncbi.nlm.nih.gov](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1440624/)\n\n\"\"\"These observations suggest thalamic projections are the minimal necessary anatomy for the pain experience.  These projections are complete at 23 weeks gestation. The period 23 to 25 weeks is also the time the peripheral free nerve endings and their projection sites within the spinal cord reach full maturity.  By 26 weeks' gestation the characteristic layers of the thalamus and cortex are visible, with obvious similarities to the adult brain, and it has recently been shown that noxious stimulation can evoke haemodynamic changes in the somatosensory cortex of premature babies from a gestational age of 25 weeks. Although the system is clearly immature and much development is still to occur (fig 1), good evidence exists that the biological system necessary for pain is intact and functional from around 26 weeks'   \ngestation.\"\"\"\n\nThus, I don't even see a fetus before certainly the 7th week and very likely the 26th week as being a person in a morally relevant sense. \n\nThe rest of the sentence (the \"then...\" part, the conclusion) depends on the first parts I addressed, and so I see no point in addressing it.",
            "title_similarity": "0.7868532",
            "sentiment_compound": -0.9437
        },
        {
            "id": "hc3as8q",
            "score": 1,
            "text": "I mean, yeah. I agree with all of this. But I don’t think people would still find it acceptable if abortion was illegal.",
            "title_similarity": "0.6689434",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hc3c700",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05649616"
        },
        {
            "id": "hc3l9nb",
            "score": 1,
            "text": "This would also mean for the 9 months the baby is in the womb, it counts as a child for tax benefits.\n\nI do believe that you can make a separation between fetus and child and consider both alive, just as a child is different than an adult.",
            "title_similarity": "0.67684394",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc3mnky",
            "score": 1,
            "text": "Yes.",
            "title_similarity": "-0.101103924",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc3qq4f",
            "score": 2,
            "text": "Internet, the fetus is going to need access to internet, it’s a human right.",
            "title_similarity": "0.53193396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc3yhq8",
            "score": 1,
            "text": "Yes sir",
            "title_similarity": "-0.091703326",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc3zb8o",
            "score": 1,
            "text": "This all sounds about right. In some ways parts of it are either already true or not applicable (eg. fetus' income).\n\nI'm completely lost on the kidney donation connection, but I'm not going to try and find it in 7000+ comments.",
            "title_similarity": "0.604007",
            "sentiment_compound": 0.0267
        },
        {
            "id": "hc403k3",
            "score": 1,
            "text": "As a pro-lifer, I agree with you",
            "title_similarity": "0.2582245",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc46qgo",
            "score": 1,
            "text": "I want to get paid for not having kids. I want men to take birth control pills that kill sperm before take off.",
            "title_similarity": "0.69799364",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hc4bu94",
            "score": 1,
            "text": "Killing a pregnant woman in most states is a double homicide.",
            "title_similarity": "0.49823892",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc4rga9",
            "score": 1,
            "text": "As a woman with extremely high risk pregnancies that wants desperately to have more babies, yes please to all of the above ❤",
            "title_similarity": "0.5269658",
            "sentiment_compound": 0.6969
        },
        {
            "id": "hc5etbi",
            "score": 2,
            "text": "Your terms are acceptable.",
            "title_similarity": "0.020233544",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hc5k1ye",
            "score": 1,
            "text": "I’m pro life to the core so much in fact I’ve been called radical by other pro life groups \n\nAnd I actually agree with you 100% \n\nBy recognising the unborn child effectively as what it is would also help plenty of women under the poverty line to effectively afford the recourses to adequately take care of their son or daughter",
            "title_similarity": "0.69022024",
            "sentiment_compound": 0.872
        },
        {
            "id": "hc5qxvb",
            "score": 1,
            "text": "What are the perks of being a U.S citizen? Forced statism and tax slavery? But to the abortion part, Im not really scientifically inept but it's pretty immoral and selfish and a consequence not a solution. Funny that in the US at birth a infant is legally considered civilly dead. That being said thats on the parents conscience.",
            "title_similarity": "0.79400945",
            "sentiment_compound": -0.9639
        },
        {
            "id": "hc699xp",
            "score": 1,
            "text": "The fetus does deserve to have its existence legally protected. They're not a different species, just as an elderly man also isn't a different species from a young adult man or a teenaged girl. Fetuses are just as human as you and me.  \n\n\n>Criminal punishment for pregnant drug use  \nFetus life insurance -Pregnant muder=double homicide\n\nWe already do have laws against pregnant drug use, whether it's banned outright or interpreted that way under current statutes.  \n\n\n38 states also already have fetal homicide laws.  \n\n\nLike, the only thing a fetus isn't entitled to is citizenship (which opens up a whole host of immigration fraud and birth tourism issues), but if that's the thing that's keeping you from murdering a fetus, then (piggy-backing off the assertion made up above) the logical conclusion is the open murder of illegals and non-citizens, which is the most far-right and white-nationalist position you can have.",
            "title_similarity": "0.8150463",
            "sentiment_compound": -0.9623
        },
        {
            "id": "hc6ijnp",
            "score": 1,
            "text": "The only thing I disagree with is you prescribing other people's beliefs for them. Outside of that, I don't really see any of these as particular downsides, what you're describing is basically just having the child's legal status 8ish months earlier than before. Protections should be helpful to the child and to the parents (especially the mother) to provide support.",
            "title_similarity": "0.6844202",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfyovce",
            "score": 1,
            "text": "I think you completely misunderstand the argument for fetal rights. Exactly what you said is what we want. Fetus to be treated like the human it is. You're coming sideways with all these \"winning\" arguments except what you fail to realize is that is what we all want. We can have this one of two ways, tell me which way you prefer.\nWoman can have an abortion and the man (if woman chooses to have the child on her own) is not legally or financially obligated to do anything (if a mother can choose to not be a mother a father should be able to choose the same). Women cannot have abortions and both parties are equally responsible for the child's health and well-being.\nI'm not exactly sure how this is supposed to be a CMV as it seems more accusatory than it does a viewpoint.",
            "title_similarity": "0.825987",
            "sentiment_compound": -0.3642
        }
    ]
}