{
    "CMV: To restrict abortion on purely religious grounds is unconstitutional\nThe 1796 Treaty of Tripoli states that the USA was “in no way founded on the Christian religion.”\n\n75% of Americans may identify as some form of Christian, but to base policy (on a state or federal level) *solely* on majority rule is inherently un-American. The fact that there is no law establishing a “national religion”, whether originally intended or not, means that all minority religious groups have the American right to practice their faith, and by extension have the right to practice no faith.\n\nA government’s (state or federal) policies should always reflect the doctrine under which IT operates, not the doctrine of any one particular religion.\n\nIf there is a freedom to practice ANY religion, and an inverse freedom to practice NO religion, any state or federal government is duty-bound to either represent ALL religious doctrines or NONE at all whatsoever.\n\nEDIT: Are my responses being downvoted because they are flawed arguments or because you just disagree?\n\nEDIT 2: The discourse has been great guys! Have a good one.": [
        {
            "id": "hc34j8i",
            "score": 1,
            "text": "/u/MoreLikeBoryphyll (OP) has awarded 5 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/pkfsrb/deltas_awarded_in_cmv_to_restrict_abortion_on/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.50176203",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hc3jnr3",
            "score": 0,
            "text": "In other words, after reading all of OP's replies: \"I hate religion\"",
            "title_similarity": "0.61416924",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hc445j4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc3ivm6",
            "score": -3,
            "text": "We all agree killing children is wrong. Developed countries agreed since Roman times a fetus has right as long as he would have been born healthy. The abortions argument people are having today does not *depend* on religion. Its just that religious politicians use that argument.\n\nEveryone has a different concept about being alive, and how that impacted them. The thing no one considers is that even if you don't like living, you cant decide what that is for others. This goes both ways as a shitty life might not be worth living by youe standards but might be by someone elses standards.",
            "title_similarity": "0.81531215",
            "sentiment_compound": -0.7259
        },
        {
            "id": "hc39mvi",
            "score": 13,
            "text": "This line of thinking is inherently flawed. First, it ignores that there is a large secular subsection of the pro-life movement. Second, religious people don’t want to ban abortion on religious grounds.\n\nThe Catholic president supports abortion. Every Democratic president since Roe has been religious and pro-abortion. There are many reasons why religious people tend to be pro-life, but it’s a consequence of their worldview, not that they’re religious.\n\nIf you believed that God had a hand in making every person with a unique sense of creation and purpose, would you consider it acceptable to kill one of those creations? The Bible doesn’t explicitly condemn abortion, but it acknowledges personhood in the womb, and obviously child murder is a no no.\n\nSo if you’re a Christian, you aren’t required to be pro-life. However, if you’re reading the actual book, you can’t make a compelling argument that a fetus isn’t a human life with inherent value.\n\nAnd on the side, there is a translation of the Bible frequently cited by the pro-abortion movement that could be construed to permit abortion. However, the translation itself is flawed and this sentiment is not reflected in any other version.",
            "title_similarity": "0.83526695",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hc4b9is",
            "score": 0,
            "text": ">The 1796 Treaty of Tripoli states that the USA was “in no way founded on the Christian religion.”\n\nI'm not sure what that has to do with anything. A treaty has no bearing on what is and is not Constitutional. Not to mention that line was only added in to appease Mohammedans, their words and not mine, who believed that piracy against Christian states was both legal and their duty as Muslims (again, their words and not mine). This is a nitpick, not a part of my argument. \n\nHowever the \"doctrine\" of the government is reflective of the will of it's people, not the other way around. The will of the people includes their political ***and*** cultural views. There is no state level government that has not been inclusive to this and survived very long, historically speaking. Even the Roman Empire and Chinese dynasties knew this to be true. While nations that tried to eliminate their religious populations, ideologically or physically, have so far been unable to accomplish this objective and have been survived by the religious communities (See: Orthodox Christianity and the Soviet Union). \n\nSo this means that no matter what, policies will *always* reflect the views of their citizens. Which is absolutely fine and acknowledged within the Constitution itself. On the contrary limiting religious persons and groups on their views on abortion would directly be unconstitutional. Per the 1st Amendment;\n\n\\- Congress shall make no law respecting an establishment of religion... \n\nTherefore it's a very sticky subject. That's why such rulings as Roe -V-Wade are still debated. Even just a legal brief from Cornell Law School I attempted tried to read, and reminded me why I don't ever wish to become a lawyer no matter what age and how boring I am, can leave you with more questions than hard line answers. However when it comes to what is constitutional based on cultural or religious views we have to rely on precedence. Even Roe -V- Wade had an issue with the application of the 14th Amendment in the case. \n\n>If there is a freedom to practice ANY religion, and an inverse freedom   \nto practice NO religion, any state or federal government is duty-bound   \nto either represent ALL religious doctrines or NONE at all whatsoever.\n\nThat is not how legal cases work, one does not cancel out the other or vice versa. This isn't a math problem after all. The government just doesn't enforce rules that specifically respect or prohibit free exercise. Think of it like King Bumi from Avatar, he says to the effect of \"...and Neutral Jing, when you do ***nothing***.\" That's the intent. Remember a government crafted from a political and social evolution of Enlightenment ideals at it's core is *not* supposed to ***decide*** all on it's own without regard for the people's will. It's not a machine where one input automatically means an guaranteed result. So basically this:\n\n>If there is a freedom to practice ANY religion, and an inverse freedom   \nto practice NO religion, any state or federal government is duty-bound   \nto either represent ALL religious doctrines or NONE at all whatsoever.\n\nIs a fundamental flaw in your reasoning. The government is not \"duty bound\" to do anything beyond the absolute basic of protecting the natural, or god given if you wish to describe as such, rights of the citizen *while staying within the boundaries* of the role and scope of government that the citizens themselves have decided is the relationship they wish to have with said government. \n\nSo as you can see this not an easy if X=1 then Y=0 kind of problem.",
            "title_similarity": "0.8857119",
            "sentiment_compound": 0.9794
        },
        {
            "id": "hc3le40",
            "score": 5,
            "text": "The problem isn't legislating religion, it's legislating morality. Many anti-choice voters and proponents will tell you, they consider it a moral issue rather than a religious one. A \"this is murder\" argument, rather than a \"it has a soul\" argument. Whether that's genuinely true or if it's oriented in their religious beliefs is fundamentally unprovable, and thus why this is even an argument these days. Whether the restrictions are on \"purely religious grounds\" is not something we can actually verify, and therefor contest. Even if the primary argument offered is \"the bible says so\" (which it doesn't, of course), it takes only half a second to pivot away from the religious claim when it's contested and claim it's a moral stance. So, ultimately your qualm with it being a religious behavior is not one we can really focus on or address.  \n\n\nUltimately, law shouldn't be legislating morality, it should be legislating ethics; that is to say, we shouldn't seek to define what is \"good\" or \"evil\" or what is \"right\" or \"wrong\" or what is \"good\" or \"bad\" on a fundamental level, rather to define what is \"good for society\" and \"bad for society\".   \n\n\nBecause the former definition, what is \"moral\", is completely dependent on the individual. Even within a religion or a belief system or a family, individuals hold themselves at different standards for what is moral; let alone in a society at large.  \n\n\nWe must seek to legislate based on what serves the society as a whole. Murder is bad for society, because it creates fear which breeds instability. Theft is bad for society because it enables conflict which escalates to violence and again instability. Abortion is... indifferent to society. We aren't in dire need of forced births, nor are we in dire need of population control (though an argument can definitely made more for the latter than former). Abortion itself doesn't create disorder or instability, and likewise banning it hasn't *as yet* bred instability. This ambiguity about its impact on society is why it falls into so much controversy based on individual opinions - if it were clearly disruptive one way or another it would be an obvious law we wouldn't need to discuss.   \n\n\nThat said, there's building momentum and unrest on the side of pro-reason and pro-choice, which suggests that bans *are likely* to cause instability, violence, revolt, and other harm to society. If this becomes the case, it'll become obvious that the best law is one codifying legality (which, to all of us who have ever considered it sincerely through the lens of legal bodily autonomy, seems the obvious choice already).",
            "title_similarity": "0.7747008",
            "sentiment_compound": -0.9926
        },
        {
            "id": "hc2zua4",
            "score": 801,
            "text": "[deleted]",
            "title_similarity": "0.15869501"
        },
        {
            "id": "hc36gev",
            "score": 1,
            "text": "You would be correct in saying that the argument to restrict abortion on purely religious grounds is unconstitutional. But the constitution, though influenced by Christian beliefs also separates law and religion. The anti abortion argument as I understand it, is that the fetus is a life and it has a right to live. The 14th amendment mentions that the state may not deprive any person of life, liberty, or property, without due process of law. After saying that, All persons born or naturalized in the United States.....are citizens... of course non citizens have the right to life so it seems that this will all fall to the question of when is a fetus a life? Because a life is certainly protected and not on religious grounds. Next question to look for on the change my view subreddit is when is a fetus a life.....",
            "title_similarity": "0.9016676",
            "sentiment_compound": 0.8964
        },
        {
            "id": "hc3p6mn",
            "score": 1,
            "text": "Some people just find it morally reprehensible to kill another human being. You’re just giving a bunch of jargon about why religion shouldn’t be involved (I agree). But I find that most people who are against abortion are just against killing another human being. Not because some scripture says it’s bad.",
            "title_similarity": "0.7611928",
            "sentiment_compound": -0.9224
        },
        {
            "id": "hc457l7",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc4btms",
            "score": -1,
            "text": "The constitution clearly states that \"Congress shall make no law respecting an establishment of religion\".  To restrict abortion purely on religious grounds would be making a law respecting an establishment of religion.  Therefore it's unconstitutional  FOR CONGRESS to restrict abortion on purely religious grounds.\n\nLocal governments could still pass such laws without it being unconstitutional.\n\nHope that changed your view.",
            "title_similarity": "0.8978508",
            "sentiment_compound": -0.0588
        },
        {
            "id": "hc4c0hv",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc4g0ne",
            "score": -1,
            "text": "My religion teaches rape is a sin. If we pass a law against rape because people like me, who are opposed to rape on religious ground, hold office, is that law unconstitutional?",
            "title_similarity": "0.78957653",
            "sentiment_compound": -0.9531
        },
        {
            "id": "hc5asej",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc5ff9p",
            "score": -1,
            "text": "Humans are not so divine that they deserve protection from abortion. Human history is full of atrocities. While there is supposed to be a separation of church and state in the constitution, making religious interference in laws unconstitutional. Pharoh ordered the death of Israelite first born and God ordered the death of Egypt's first born. Jesus never pointed to pregnant bellies when he said suffer little children. Religious denial of abortion seems hypocritical.",
            "title_similarity": "0.8638854",
            "sentiment_compound": -0.9507
        },
        {
            "id": "hc5oou3",
            "score": -1,
            "text": "look at the American bank note;\n\n*\"in God We trust\"*",
            "title_similarity": "0.37616318",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hc6ejlj",
            "score": 1,
            "text": "I agree fully, separation of church and state. I’ll go a step further with: all politicians and judicial members should have NO religious affiliation",
            "title_similarity": "0.7166109",
            "sentiment_compound": -0.1111
        },
        {
            "id": "hc34n6d",
            "score": 91,
            "text": "I think it’s one thing to say it’s unamerican, but it’s definitely not unconstitutional. There’s nothing in the constitution that says politicians can’t use their religion to inform their political views",
            "title_similarity": "0.75253",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hc37bpe",
            "score": 3,
            "text": ">The 1796 Treaty of Tripoli states that the USA was “in no way founded on the Christian religion.”\n\nThis treaty was broken in 1801, and was then replaced by another treaty which did not have the same wording. Even if that was not the case, you are taking this one line out of context. It simply meant the US would not go to war or consider the treaty broken over only religious differences. Even if none of that was true it's still just a treaty.\n\nWas the United States founder on Christian religion? In many ways yes. In Europe during this time there was basically civil war going on between different groups of Christians. Many people fled Europe to get away from this, although different denominations of Christians were still killing each other when they reached America. \n\nThis is the main reasoning behind freedom of religion, so that Christians were not persecuted by other Christians. Separation of church and state was meant to keep government from corrupting religion. Also to keep any one Christian denomination from being too powerful within the government. \n\nFor the most part there weren't any non Christian religions among the early American settlers and early US citizens. Would you really expect a bunch of Christians to create a government intended to be free from Christian influence?",
            "title_similarity": "0.88218373",
            "sentiment_compound": 0.8346
        },
        {
            "id": "hc3o5lm",
            "score": 3,
            "text": "I'm pro-life and an atheist. \n\nThe reason I'm pro-life is because with so much birth control widely available, why do we need the one that could potentially kill an innocent human being, why can't we just be responsible and avoid the systematic slaughter of potentially millions of lives? \n\nThe majority of people who are pro-life aren't purely on religious grounds. They are because they interpret a fetus as a life (or in my case, aren't sure if it counts as a life or not, and don't want to risk committing mass genocide of infants).\n\nThere has been no restriction of abortions on purely religious grounds, not in the United States at least.  \n\nThe only instance where religion has even been brought onto the conversation are individual practitioners refusing to perform abortions due to their religion. But any practitioner can refuse to perform an abortion, regardless of religion or lack thereof.",
            "title_similarity": "0.77850163",
            "sentiment_compound": -0.8317
        },
        {
            "id": "hc3v093",
            "score": 4,
            "text": "Who’s restricting abortion on religious grounds?  The recent Texas bill doesn’t mention religion or god anywhere in the text.  I think you’re assuming that anyone who is pro-life is backing that stance with their religion.",
            "title_similarity": "0.8350624",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hc3eaw4",
            "score": 57,
            "text": "You are mischaracterizing the situation.\n\nNot all pro-lifers are religious, as you know. So, at least for them, its about morals and not about god, as you know.\n\nI read you wrote \"biased because of\" and \"influenced by\" religion. That is where you are making my point for me. Being influenced by something, by definition, means that its not \"purely because of\" but instead a mere factor among others.\n\nAn artist can be indirectly, historically, influenced by Mozart. But Mozart is only one influence, they dont make music \"purely because of Mozart\". They make music because they like it, because its relaxing, etc.\n\nThat is why you are being downvoted.",
            "title_similarity": "0.77360576",
            "sentiment_compound": 0.7645
        },
        {
            "id": "hc2zrlk",
            "score": 157,
            "text": "Not all pro-lifers are religious, and not all religious people believe abortion is wrong. It’s more of a moral argument than a religious argument.",
            "title_similarity": "0.7122919",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hc30ekv",
            "score": 268,
            "text": "The premise that laws are advocated for or implemented exclusively because of religious doctrine is off imo. Theft and murder are both illegal, but not because Christianity says it’s wrong. Nowhere in the law does it cite religious doctrine as its basis. \n\nFor the abortion debate, one does not have to be religious to subscribe to the idea that terminating a pregnancy arguably equates to terminating a life. I don’t agree with that position, but I know people who are atheist who do. Stalin, for example, enacted an abortion ban, and the USSR’s government was not at all based in religious doctrine.",
            "title_similarity": "0.86784714",
            "sentiment_compound": -0.9253
        },
        {
            "id": "hc3w2lv",
            "score": 20,
            "text": "I don’t think most people actually justify it with a purely religious ground. Here’s what I mean. \n\nWould you say that a Christian saying “stealing is bad” is them trying to push anti stealing legislation on religious grounds because the Bible says “thou shall not steal”? Of course not\n\nI don’t think I’ve heard a serious person use the arguement “because god said so” in an abortion debate. \n\nThat religious arguement is a straw man, because most of the people pushing against abortion are religious. \n\nHowever the arguement is that the child is a human being, and should be afforded the same protections as you, or I, under the law, including bot being able to be “murdered” with impunity. \n\nSo pro-lifers believe that the fetus is a human with rights, and because it’s biologically alive, it’s unfair to impose an arbitrary distinction upon when it can and can’t be killed at that moment in gestation. \n\nVersus the pro choice arguement that the baby is an intruder in the woman’s body, and it isn’t her duty to carry that baby to term. The reason she has no duty is partially because the baby is not considered a full human with rights, and therefor not afforded the same protections as a mature adult. \n\nSo yes, restricting ANYTHING including abortion on the basis of religion is wrong, 100%, but Christians aren’t justifying their anti-abortion rhetoric from a legal stand point, with religion, but the argument that the baby is a person with rights. \n\nI think it’s important to distinguish that simply because something exists within a religious text, does not mean it now cannot be enacted into law. \n\nThe Bible says thou shalt not kill, that doesn’t mean that murder is a religious talking point.",
            "title_similarity": "0.83884656",
            "sentiment_compound": -0.8869
        },
        {
            "id": "hc34jt9",
            "score": 26,
            "text": "There is freedom to practice any ideology or no ideology.  We have no national ideology.  We can still totally pass laws on purely Utilitarian concerns.",
            "title_similarity": "0.603968",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hc3mfot",
            "score": 36,
            "text": "Your responses are being downvoted because your arguments are poor and you’re being combative. That’s not what this sub is about",
            "title_similarity": "0.49194303",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hc3p3go",
            "score": 66,
            "text": "Hello friend. Friendly lawyer here happy to respond.\n\nFirst, you need to draw a distinction between what you think SHOULD be unconstitutional and what actually violates the constitution.\n\nA few initial points:\n\nThe 1796 Treaty of Tripoli is not part of our constitution.\n\nSomething being \"inherently un-American\" doesn't make it unconstitutional.  A law is only unconstitutional if it conflicts with the constitution.\n\nFor example, if your state passed a law saying the punishment for stealing a pack of gum was being kicked in the balls ten thousand times continually for a week that pretty clearly would violate the constitutional prohibition on cruel and unusual punishment.\n\nPlenty of laws are motivated by religion and they always have been.  From the earliest days here businesses were required to be closed on Sundays in many/most places because the people who passed the laws were religious and thought that was what their god wanted.  Their motivation doesn't invalidate a generally applicable law.\n\nFor more than 200 years it was literally a crime in many states to be gay.  It wasn't until 1986 that our Supreme Court \"found\" the right to gay sex.  And when they did it was somewhat iffy -- meaning that there isn't anything in the plain text of the constitution but rather they \"found\" the right as a consequence of other rights to privacy.\n\nThe simple fact is that the \"intent\" of lawmakers generally does not matter.  If someone's religion tells them that there should be a stop sign at every side street intersection and they get a law passed requiring stop signs that's generally fine.\n\nWhere generally applicable laws get into trouble is when they violate OTHER people's religious rights.  So for example if a government passed a law prohibiting wearing hats in public for some reason, that would be found to violate the religious rights of people whose religions require them to cover their heads. \n\nIn the case of abortion, many people who oppose it are unquestionably motivated by religion.  They think that fetuses have souls and should be protected.  But they also think that 1 day old newborns should be protected and nobody claims that we should be allowed to murder newborns because they cry too much.\n\nSomething that would be clearly unconstitutional would be REQUIRING religious people to have abortions.  Because that law requires them to violate their religious beliefs without a strong counterbalancing reason,\n\nIf there is a religion that requires people to have abortions then arguably a law that prohibits them from doing so violates their religious beliefs.  That is an approach the Satanic Temple is taking now, I believe.\n\nSo, in conclusion, we may hate anti-abortion laws all we want, and the fact that they're mostly motivated by religious people trying to force their views on us sucks.  But your points above are simply not applicable.  \n\nYou say \"If there is a freedom to practice ANY religion, and an inverse freedom to practice NO religion.\"  But unless having abortions is part of your religion, a generally applicable law prohibiting abortions does not violate your rights. \n\nP.S.  The constitution does not explicitly say there is a right to abortions. The court \"found\" that right in the early 70s as they explained in Roe v Wade.  If we amend the constitution again we could put in lots of new protections of the type you like.",
            "title_similarity": "0.7317966",
            "sentiment_compound": -0.9583
        },
        {
            "id": "hc3kmg3",
            "score": 84,
            "text": "In another comment you said:\n\n>politicians are (in my view) duty-bound to legislate based on secular reasoning and not have any religious bias. \n\nI think this is really what your whole post is about, and I think it's flawed. \n\nYou cited the Treaty of Tripoli, which has no legal effect whatsoever when it comes to domestic issues--especially lawmaking. \n\nWhat you should be analyzing is article 6 clause 3 of the Consitution, which says no religious test shall be required to hold public office. This means that there cannot be any legal bar to a person holding office due to their religious beliefs, or lack thereof. It is just a fundamental human truth that those beliefs are sure to influence their policymaking, and the founders, by drafting art. 6 cl. 3, expressly chose to acknowledge and permit that, and no allow the government to throw up any barriers against public officers because of their belief system.\n\nSo then, to put a check on that, we have the first amendment. Congress shall make no law respecting an establishment of religion. So we can't make laws that impinge religion, but we also can't make laws flagrantly promoting it. So you have to be able to provide at least some sort of reasonable basis for a law (the most lenient judicial standard when analyzing whether a law violates constitutional proscriptions); but that doesn't mean that you can't admit that your religious beliefs are what make you support it. \n\nEssentially, you can say, \"the Bible does not permit abortions, so I don't support the right. But also, here is why the government has an interest in protecting fetuses...\"",
            "title_similarity": "0.84472585",
            "sentiment_compound": -0.0124
        },
        {
            "id": "hc2yqpe",
            "score": 4,
            "text": "I am not sure what you mean.\n\nWhen assessing whether a law is based on religion, courts look to whether there is a valid state interest.  Our courts have already recognized a valid state interest in the \"potential life\" of the fetus.\n\nSo even if legislators voted on an individual level based on their religion, the law itself would advance a valid state interest (and would satisfy the other criteria courts use).",
            "title_similarity": "0.7367768",
            "sentiment_compound": 0.8761
        },
        {
            "id": "hc3fobd",
            "score": 4,
            "text": "If this is in regards to the Texas abortion law, your premise is simply incorrect.  That's not the purported reason, as written in the law, for the restriction of abortion.  If you're referring to another abortion law that cites religion in the statute, I would agree.  If you are, can you please link that legal document?",
            "title_similarity": "0.8235637",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc3jscd",
            "score": 1,
            "text": "The argument for pro life is often not religious but rather that it is uncondtitutional to prevent the life liberty and pursuit of happiness of an individual, and abortion of a child would prevent that child from all three of the above. The argument is mainly when do constitutional rights apply to humans.",
            "title_similarity": "0.75679266",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hc3k72l",
            "score": 1,
            "text": "> to base policy (on a state or federal level) solely on majority rule is inherently un-American.\n\nCan you show any policies that were enacted for the stated purpose of being the majority rule? As in, the law's intent was solely to appease the majority of Americans. Or in this case, the law was enacted because Christianity says so. \n\nYou won't be able to find a law like this because it doesn't exist. Your argument is flawed because abortion is not being restricted on purely religious grounds, and you cannot prove that it is.",
            "title_similarity": "0.9104786",
            "sentiment_compound": 0.5851
        },
        {
            "id": "hc3lxob",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc3m4vj",
            "score": 2,
            "text": "What do you mean by religious bias? It comes across as if you believe that if someone is religious their perception is inherently wrong. It's perfectly reasonable to adhere to everything that science proposes to be true and still be a Christian or a member of any of the other major religions.",
            "title_similarity": "0.74489737",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hc3n22y",
            "score": 1,
            "text": "You don't have to be religious to support restricting the practice of abortion.  Here's one argument that makes no reference to a religious belief:  https://leftfootforward.org/2013/07/abortion-is-a-tragic-choice-no-woman-should-have-to-make/",
            "title_similarity": "0.75514746",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hc3ok63",
            "score": 1,
            "text": "The problem is, you would have to prove that restrictions on abortions are for religious reasons and then you would probably need to have the supreme court rule it unconstitutional. Now, it's obviously about religion and many politicians even talk about it that way. If they needed a backup excuse, they could just say it's not about religion but rather about human rights for the fetus. And then the argument becomes at what point does the fetus have human rights. They don't seem to need a backup reason though. The supreme court gets to decide weather it's constitutional. They were meant to be the check for this type of situation.",
            "title_similarity": "0.8307926",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hc3pc26",
            "score": 3,
            "text": "Ok now I disagree with half of what you said but let me explain why. It basically comes down to the constitution and voting, as a fact it isn’t unconstitutional to do what you are suggesting which is why on that basis you are wrong but, as far as do I think we should do it purely on a religious base no. We should all have a say it what happens our religions come in to play for what we believe but ultimately are just an influence nothing more ( besides some religions but those are few and most are illegal anyway or have small following anyway. The voting system is set up to allow people to vote on what they believe no matter the reason why. You could vote to do almost anything for any reason because we have a freedom of belief. And because I think it’s fair I am just going to say that I am a pro-life Christian so if you don’t listen to me because that i could see why but I think it’s fair for you to know that also I don’t base any of my political views on my religion but they do factor into them. I won’t say for sure what will happen in the future as I think it’s stupid to do so but even if I weren’t religious I highly doubt any of my political values would change because I think if you don’t have a good reason for things you do and believe  you don’t think about you position on those things good enough. Hope you understand and don’t get to caught up in politics cause it tears people apart. Have a good one.",
            "title_similarity": "0.76420784",
            "sentiment_compound": 0.9561
        },
        {
            "id": "hc3rici",
            "score": 1,
            "text": "Pro-life is not a religious stance. While religious people often align with it, that is because religious people tend to be against murder, and view the child as a human (ergo, they are for banning murder).\n\nNo part of that chain is religious.\n\nThe entire stance is that at conception, there is an organism that is growing, living, and human, and to take away its life is a premeditated killing of a defenseless human, which is murder. Following that, in order to live in a functioning society, we should not be in favor of murder.\n\n—\n\nI used to be pro-life, so I’m very in tune with the whole point. I’m still incredibly against abortion, but from a utilitarian perspective - if people are still going to perform them, and do that dangerously, and data has shown that a pro-choice land ultimately reduces total number of abortions, then there’s no use fighting against the people who really want them if that society ultimately drives closer to my goal of completely ridding them.",
            "title_similarity": "0.7499577",
            "sentiment_compound": -0.9519
        },
        {
            "id": "hc3skvf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc3vt1o",
            "score": 1,
            "text": "Secularism is not anti-theism, it's the government and the law being religiously neutral. People, including politicians, can have whatever beliefs they want, push for whatever values they believe in, and have whatever motivations to do so, and none of this would hurt the integrity of secularism. Do you know why? It's because this is considered freedom of expression, it's not an element of theocracy. If somebody is religious, they can have religious motivations to push for a religious values that they believe in, and as long as the thing they're advocating for is explicitly favoring one religion over another or restricting a religion in some way, then it's secular. The abortion law in Texas is a secular law by all definitions.",
            "title_similarity": "0.66190636",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hc3wdib",
            "score": 3,
            "text": "I mean, even most religious people would probably agree with that. But people trying to do that aren't really doing it based in purely religious reasons. Religion may be driving force for why they want to, but it's not like they don't have secular arguments. Whether those arguments are good enough is another matter. But this isn't a religion-only concern the way that say, homosexuality is.",
            "title_similarity": "0.7095846",
            "sentiment_compound": 0.4352
        },
        {
            "id": "hc3wt3b",
            "score": 1,
            "text": "It is entirely possible for someone to believe that a fertilized egg or an embryo is living from a completely secular viewpoint. Applying religion to ones belief is a strawman argument on your part and assumes to be able to read minds.",
            "title_similarity": "0.6270354",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc3wvyh",
            "score": 1,
            "text": "To respond to your edit, the arguments are flawed to the point that it appears you are arguing from bad faith.",
            "title_similarity": "0.49073622",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hc3xtxu",
            "score": 1,
            "text": "I still think many Christians would think “killing a baby” is wrong to do. \n\n\nThey think of it as killing a possible healthy human life, that’s just immoral to them, no matter what god they believe in.",
            "title_similarity": "0.7390975",
            "sentiment_compound": -0.7766
        },
        {
            "id": "hc3zbdy",
            "score": 1,
            "text": "A government’s role is to protect its people from harm.\n\nIf most of the country agrees that unborn children are people who ought to be protected, then this is the government’s role. \n\nThe constitution never says Christians can’t make laws based on their beliefs.",
            "title_similarity": "0.7808154",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hc3zd38",
            "score": 1,
            "text": "I've never actually met a pro-lifer who said they are prolife just because of religion. They truly believe that abortion is the ending of a human life.\n\nI am prolife, but I agree with you that we can't just cite someone's religion as the reason for a law to pass.",
            "title_similarity": "0.8216201",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc3zoki",
            "score": 4,
            "text": ">EDIT: Are my responses being downvoted because they are flawed arguments or because you just disagree?\n\nYour responses are being downvoted because you are soapboxing.  There are dozens of answers on here that adequately explain why abortion isn't strictly a religious dogma, essentially invalidating your leading question.  \n\nOr in other words, a world where abortion is restricted purely on religious grounds is completely hypothetical so you can't apply it to the thinly veiled Texas abortion law you are soapboxing against.",
            "title_similarity": "0.8198327",
            "sentiment_compound": -0.875
        },
        {
            "id": "hc40gvi",
            "score": 1,
            "text": "\"Religious\" is a poorly defined term.  Professional scholars of religion can't agree on it's meaning (or even on whether it has a meaning in the first place).  The supreme court is no better.  Crosses, nativity scenes, and the national motto are all obvious violations of the establishment clause... obvious to everyone who is not a judge.\n\nIf we can announce the truthworthiness of God on our national currency and invade countries because God privately spoke to the president, then anything goes.  There is no rational ground upon which to build any meaningful statement about religion and constitutionality in America.",
            "title_similarity": "0.85405254",
            "sentiment_compound": -0.0041
        },
        {
            "id": "hc41p3y",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc41ssw",
            "score": 1,
            "text": "It's actually quite simple   if the female doesn't want the child, give it to the father.  Why is it always the female that needs to decide.  Let the father raise the child. Let him give up his education, jobs , football scholarship, etc.  Maybe if men were solely responsible foe the raising of then child , then and only then  wlli rich white men stop making laws that affect women.  When their precious baby boys aren't able to go to university and take that scholarship and they see what single mother go through at a young age, that's when they will sit up and take notice.",
            "title_similarity": "0.62714005",
            "sentiment_compound": 0.646
        },
        {
            "id": "hc42w3t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc43big",
            "score": 1,
            "text": "I think that you make the flawed assumption that abortion is a religious matter and not one of morality",
            "title_similarity": "0.74357593",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hc43uyw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc43wio",
            "score": 1,
            "text": "I think people are focusing too much on the abortion aspect of this CMV. \n\nThe truth is government can pass whatever law they can as long as they get the votes, and as long as the law itself don't violate the Constitution. It doesn't matter what their reasoning is. \n\nCongress could right now pass a bill and say they're doing it for Jesus. The president then could sign that bill for Jesus. And as long as whatever the actual bill itself was was Constitutional, that bill is law. The Supreme Court could not overturn it solely because it was passed for Jesus.",
            "title_similarity": "0.7659733",
            "sentiment_compound": 0.8153
        },
        {
            "id": "hc44d16",
            "score": 1,
            "text": "There is a segment of the vegan/animal rights crowd that is pro-life for entirely non-religious reasons. I respect their consistency because pro-choice doesn't make sense if your lifestyle consists of trying to protect every living thing.",
            "title_similarity": "0.6761327",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hc44vpy",
            "score": 3,
            "text": "I noticed you used this terminology once below but since the argument wasn't clearly laid out here I thought this approach might be appropriate. \n\nThe US has freedom of religion, or the right to worship as we all know, but the term \"freedom of religion\" and \"freedom from religion\" are not interchangable terms, and religious iconography and practices adhering to a religious belief are treated very differently in countries that maintain the latter. \n\nFrance is an example of a country that has a \"Freedom from religion\" doctorine. This manifests in practice in the form of bans of religious items in federal buildings including articles of clothing such as the hijab, and extends to jewelery such as crosses etc. You have the right to not face religion should you not want to. In a country like this, freedom to turn someone down based on your religious beliefs would NOT exist.\n\nThe United States does not have \"freedom from religion\" we have a freedom to worship, the difference of which manifests as the right to be as religious as you want without being restricted. In this case it is very controversial whether or not freedom of religion gives someone the right to refuse service in their private business or in the case of a Doctor, their own medical practice, as the government shouldn't force those individuals to violate their own religion, which in this case would be forcing them to perform abortions. \n\nYou have the freedom to NOT practice a religion, but you do not have the freedom to make others NOT practice their own.",
            "title_similarity": "0.77356905",
            "sentiment_compound": 0.9813
        },
        {
            "id": "hc44xll",
            "score": 1,
            "text": "Let’s not forget that religions are not monolithic, and within them there are disagreements as to the permissibility and morality of abortion.\n\nTo follow the OP, justifying an abortion ban using a religious argument could be seen as not just elevating one religion over others, but as elevating one sect (or a group of sects) over others.",
            "title_similarity": "0.7585132",
            "sentiment_compound": -0.5599
        },
        {
            "id": "hc49oq5",
            "score": 1,
            "text": "I don’t know of anybody who objects to abortion because it’s a religious principle. They object to abortion because they see it as murder, and laws against murder go beyond religious prescriptions.",
            "title_similarity": "0.82251245",
            "sentiment_compound": -0.886
        },
        {
            "id": "hc4ai78",
            "score": 1,
            "text": "That treaty isn't the constitution so violating it is not synonymous with being unconstitutional. Likewise, the right to an abortion is only constitutionally protected until fetal viability so one could apply restrictions after that for religious reasons and still be constitutional.",
            "title_similarity": "0.79074895",
            "sentiment_compound": -0.38
        },
        {
            "id": "hc4czfw",
            "score": 1,
            "text": "You are getting downvoted because people are fighting the question and not actually answering.",
            "title_similarity": "0.4557891",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc4ja5e",
            "score": 1,
            "text": "No anti-abortion laws cite religion as the cause.",
            "title_similarity": "0.72855717",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc4kcoi",
            "score": 1,
            "text": "Your legal reasoning is a little suspect here. Treaty if tripoli has absolutely zero to do with whether something is constitutional. The constitution and first amendment would be a pretty good place to start for that.",
            "title_similarity": "0.6542624",
            "sentiment_compound": 0.6901
        },
        {
            "id": "hc4kt8p",
            "score": 1,
            "text": "This doesn't make sense. I'm pro choice and atheist but the fact that I could link making murder and theft illegal based on religious context doesn't make them illegitimate. Now I understand where you're coming from but the concept of \"when does life begin\" has no real objective answer. It's subject to the individual. By the same token, nobody can say \"it's my religious right and freedom to kill this person because they're gay and the bible/Quran says I should\".",
            "title_similarity": "0.8126931",
            "sentiment_compound": -0.9517
        },
        {
            "id": "hc4l0yw",
            "score": 1,
            "text": "In theory, the Treaty of Tordesillas divided the New World into Spanish and Portuguese spheres of influence. The treaty amended papal bulls issued by Pope Alexander VI in 1493. These declarations had granted Spain an exclusive claim to the entirety of North and South America.\n\n2 continents were claimed on the Christian religion.",
            "title_similarity": "0.6307739",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc4muqm",
            "score": 1,
            "text": "The 1796 treaty of tripoli lmaoooo wtf",
            "title_similarity": "0.2842296",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc4nb6y",
            "score": 1,
            "text": "The actual legal argument might be unsatisfying. But here we go. Constitutionality is a legal question, remember. You are only claiming religious reasons alone can’t justify a statute. The establishment clause, which bans establishment of religion, was incorporated against the states through the 14th Amendment. That is what you would trace your argument to.\n\nNow, the establishment clause has many varying interpretations; Jefferson, for example, coined the phrase that there should be “wall of separation” between religion and the state. The current Supreme Court, as of now (and this might change), uses the secular purpose test for legislation. That is, legislation must have a valid secular purpose outside of religious motivations. This doesn’t need to be reasonable. The state has the power to pass legislation, even when unreasonable or seemingly arbitrary as long as it does not violate a right.\n\nNow, the word purpose is tricky, because are we looking at any purpose the statute might serve, or what the specific legislators had in mind? What about legislators that voted in legislation for different reasons? Divining legislative purpose is extremely hard.\n\nAs a result, many constitutional scholars would not pay attention to the motivations of the legislators, but rather whether it CAN serve a secular purpose. Most judges are resistant to overturning a legislature, voted in by the people, all alone. Therefore, they often are looking at how a statute might be justified rather than struck down.\n\nEven if the state’s legislature passed a law banning abortion purely on Christian beliefs of life at conception, if this belief can also be secular, than the law may stand. There is extensive scholarly literature that is secular and pro-life. But the secular purpose doesn’t even need to be prevention of murder. It could be something as simple as protecting pre-natal life/human life. I am not religious, and I still find some secular value in protecting pre-natal life. I’m still pro-choice, but my sympathies are indicative enough that a valid secular purpose exists for a statute restricting abortion, even if the legislature was entirely motivated by religion.\n\nThat is why abortion isn’t a right under religious exercise. People acting on completely secular values still can rationally think that abortion is bad. That is why we need the right of privacy in Roe v Wade to protect abortion, because states and the federal government can’t pass willy nilly unreasonable laws that violate a constitutional right. But if we didn’t have that right, it probably wouldn’t be struck down under the establishment clause for these reasons.",
            "title_similarity": "0.82295114",
            "sentiment_compound": -0.6914
        },
        {
            "id": "hc4nchv",
            "score": 1,
            "text": "It's up to the Supreme Court to decide what is constitutional. People can twist, misconstrue, and interpret whatever meaning they want from any written text - for example, the Bible. As long as five justices agree that something is constitutional, it is by definition constitutional.",
            "title_similarity": "0.62371564",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hc4od17",
            "score": 1,
            "text": "Ultimately, their reasoning for it might be religious, but the arguments for and against it in our legislature have to do with arbitrary definitions of when life begins; conception, viability or (rarely) birth?",
            "title_similarity": "0.6774564",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hc4of3r",
            "score": 1,
            "text": "While I agree with your statement it’s based on the flawed premise that it’s impossible or unlikely to be pro life non religiously which I belive is untrue\n\nMany pro lifers myself included have an issue with killing what we see as a human simple as that you don’t have to be religious to see a fetus as a human nor to see murder as wrong",
            "title_similarity": "0.74581337",
            "sentiment_compound": -0.6555
        },
        {
            "id": "hc4rdxy",
            "score": 1,
            "text": "so is trying to force people to take a dose of whatever to fight a strain of flu",
            "title_similarity": "0.46934944",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc4rl1y",
            "score": 1,
            "text": "The principle is simple: the unalienable right to life. You, like the supreme court did in Roe v Wade, can suggest that a human being at an early developmental stage is not life, but you would be asserting something which is counter-factual to biology and common reasoning.",
            "title_similarity": "0.6703432",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hc4szy4",
            "score": 1,
            "text": "Can we just ban questions about abortion already?",
            "title_similarity": "0.62182236",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hc4tdip",
            "score": 1,
            "text": " I’m an atheist and support Texas’s decision. You don’t need religion to think murdering babies is wrong.",
            "title_similarity": "0.68985647",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc4trvx",
            "score": 2,
            "text": "Using the Bible as a source for a political philosophy that is then accepted by the reader, who then uses said philosophy to shape governmental policy is *not*  a violation of the theory of \"separation of church and state\". \n\nThat principle idea came from a desire to not have religious leaders be governmental leaders. To separate those institutions. Not that a religious person couldn't be a politician, but that their position in the church wouldn't be a position in government.\n\nTo deny the Bible, a book written by man (even if others believe otherwise), would be an attempt to ban any expression made by anyone. It's not just religions that promote a \"doctrine\" of truth. We'd be able to make the case that nothing should be imposed on others through policy as it requires compliance to a theory or idea that others may reject whole others believe is truth.",
            "title_similarity": "0.7973261",
            "sentiment_compound": 0.0765
        },
        {
            "id": "hc4tzh3",
            "score": 1,
            "text": "Good thing it's based on science and morality rather than religion. I mean, unless you think all murder should be legal.",
            "title_similarity": "0.6437172",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc4vi6n",
            "score": 1,
            "text": "This is a kind of inherently flawed argument as what is religion if not a moral guide. Lawmakers will use what they think is ethically right or wrong to impose laws and religion will always be a factor in what someone thinks is ethical.",
            "title_similarity": "0.71596944",
            "sentiment_compound": -0.765
        },
        {
            "id": "hc4yc3z",
            "score": 1,
            "text": "This is such a straw man argument, and I'm extremely pro-coice. Very very few who advocate for pro life policy argue that abortion should be illegal because of religion, they're argument is that a fetus is a human person. Again, I'm pro choice, but this post is pointless",
            "title_similarity": "0.80080783",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hc4yj8g",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14025205"
        },
        {
            "id": "hc4zfqo",
            "score": 1,
            "text": "Abortion is not a religious issue, it’s a morality issue. Abortion is not even in the Bible.",
            "title_similarity": "0.7444649",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4zm1r",
            "score": 1,
            "text": "I agree with you but the issue imo is more that lots of people aren’t just going with their religion they legit believe it.  Which makes it hard to draw a line between religious and nonreligious beliefs",
            "title_similarity": "0.6144947",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hc4zn96",
            "score": 1,
            "text": "I don’t care one way or the other legally. I just would like see more people with a better reason than “It’s not a living person”",
            "title_similarity": "0.5108801",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hc50oae",
            "score": 1,
            "text": "God, moral beliefs- it is case law that presides.  Established case law is what matters- so revisit Roe vs Wade.  Now if you want to say they got it wrong, than that is one thing.  But choosing which laws you want to follow because the align with your beliefs is the farthest and most un-American stance to take.\n\nThat is the problem with both sides.  You know where this is going- liberals will now revisit expanding the Supreme Court by adding more justices or making DC a state.\n\nUltimately you are correct.  Restrict abortion prior to the first trimester goes against established case law.  But the heartbeat law goes against the constitution as it violates privacy.  Think about it- if a woman misses her period- she only then has a max of not even two weeks to get an abortion.  So what, should women taken pregnancy tests every week.  What about a false negative.",
            "title_similarity": "0.7859118",
            "sentiment_compound": -0.9294
        },
        {
            "id": "hc52nye",
            "score": 1,
            "text": "75%? Shiiit, either I make extreme subconscious efforts to avoid religious people or this stat is made up by christians",
            "title_similarity": "0.728796",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc53g9j",
            "score": 1,
            "text": "Pro choice atheist here. You are approaching this completely wrong. Something can correlate with someone's religion without being an instance of that religion. Many Christian's are against murdering humans specifically because it is part of their religious belief. By your logic, enforcing anti-murder laws would be a violation of the separation of Church and state if the majority of the adult population stated they were against murder because of Christianity.\n\nAlso, there are plenty of non-religious reasons to oppose elective abortion. If someone is against the suffering of sentient beings, and believes that fetuses are (or may be) sufficiently sentient to suffer, then it's entirely logicality that they too would be \"pro-life\" without a belief in God.\n\nAs I said, I'm pro-choice so obviously my understanding of the utility calculus differs from someone who is pro-life, but I'm certainly not going to pretend they could ONLY arrive at that conclusion because of belief in a deity.",
            "title_similarity": "0.8560723",
            "sentiment_compound": -0.7907
        },
        {
            "id": "hc546sc",
            "score": 3,
            "text": "This argument feels like its based on the false premise that you need to adhere to a religious doctrine, *any* religious doctrine, to find abortion an important topic.  With the move towards increasing abortion options made by some parties, not strictly political in nature, the issue naturally drew anti-abortion groups to form.  Early pregnancies, as well as exceptions in the cases of rape, incest or threat to the mother, were something the majority of parties agreed upon.\n\nAmerica was not founded on the principle that the majority must adhere to minority rule.  We would have been a monarchy, were that the case.",
            "title_similarity": "0.8187045",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc56xl1",
            "score": 1,
            "text": "If you really want to see something interesting: https://www.rollingstone.com/culture/culture-features/satanic-temple-abortion-rights-supreme-court-1048833/",
            "title_similarity": "0.5756674",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hc5a6bo",
            "score": 3,
            "text": "Weird strawman.",
            "title_similarity": "0.1916706",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hc5btcj",
            "score": 1,
            "text": "no shit.",
            "title_similarity": "0.17544311",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hc5c7nu",
            "score": 8,
            "text": "The premise of pro-lifers is “The unborn baby needs protection from murder.”\n\nProtection from murder is a non-religious, generally universal stance.\n\nThe concept of when it’s a “person” with legal rights has no uniform definition, which leaves it up to interpretation.\n\nThe counter arguments I’ve seen are body autonomy, but that does not address the murder claims.  \n\nThe counter to that has been that you can kill someone for breaking into your house, but that’s a false comparison.  \n\nIf you killed your rapist, you’d get a lot more sympathy.  If your rapist left a toddler in your house, you don’t get to kill the toddler.  If a toddler were trapped in your house, you would be obligated to keep it alive to the best of your ability.  We don’t have the technology to move a fetus from one womb to another.\n\nUntil the murder claims are addressed, there will be no consensus on abortion rights.  One way might be to define when a fetus has human rights (like TX is trying to do in a really messy way), and another might be to justify when you can kill a person legally (least suffering doctrines, or ability to survive outside the womb, or others).\n\nSo while your assertion is true about policy and religion, it’s a straw man argument.  The anti-abortion movement is not innately religious, even though that is how it’s largely aligned.\n\nJust to be clear, we’re a pro-choice household, and understand the weight that choice has on someone regardless of their stance.  \n\nThis is purely a logic decinstruction as best as I can see it.  I honestly do not think this will ever be resolved universally, just like many other similar arguments.",
            "title_similarity": "0.73475385",
            "sentiment_compound": -0.9549
        },
        {
            "id": "hc5ea3s",
            "score": 1,
            "text": "Considering abortion completely contradicts basically any relevant scientific theory on life makes this a non issue",
            "title_similarity": "0.72885776",
            "sentiment_compound": -0.4005
        },
        {
            "id": "hc5eos5",
            "score": 4,
            "text": "True. Thats why its not restricted on religious grounds, but on ethic grounds.",
            "title_similarity": "0.4332041",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hc5fc87",
            "score": 1,
            "text": "Can people on both sides quit quoting the treaty of Tripoli, if any of you actually took the time to read the entire thing and learn the history behind, you would find out pretty soon that it doesn’t mean what you think it means \n\nThe treaty of Tripoli is not even the right name it is a summary for the treaty of peace and friendship between the United States of America and bey and subjects of the Tripoli Barbary \n\nIt was a treaty between the newly formed United States and the country of Tripoli or modern day Libya, this treaty had nothing to do with religion or secularism it was strictly a commercial and maritime trading agreement \n\nFirst of all whether or not the US was founded on Judeo-Christian values or not would depend on our constitution it would have nothing to do with shipping agreements with other countries \n\nFurthermore John Adams specifically added that part in the document to avoid American ships from being raided by Islamic pirates, as Great Britain had stopped Paying protection money for US ships for obvious reasons and the Islamic pirates would specifically target trading ships of Christian nations such as France",
            "title_similarity": "0.7566458",
            "sentiment_compound": 0.9726
        },
        {
            "id": "hc5g4gp",
            "score": 1,
            "text": "To make literally ANY law in America on religious grounds is unconstitutional",
            "title_similarity": "0.81470066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5hwxe",
            "score": 3,
            "text": "Just because something lines up with the Bible doesn’t necessarily make it a religious issue, sure most Christians are pro life but that has nothing to do with why abortion is being restricted \n\nThe Bible also says it’s wrong to steal things, I think most people religious or not would agree that theft is generally a bad thing to do \n\nThe Bible also says that it’s wrong to commit adultery, Adultery isn’t illegal but again I think most people religious or not would frown upon cheating on your husband or wife\n\nThe reason abortion is being restricted has nothing to do with religion. The reason it is being restricted and in some places banned altogether is because it never should have been legalised in the first place \n\nThe entire pro choice side heavily depends on dehumanisation and de personalising someone who has been scientifically proven to be alive from the moment of Conception \n\nThe deciding vote of Roe vs Wade Supreme Court justice Henry Blackmun even admitted during the case and I quote  \n“If pre natal personhood is established the case for abortion collapses for the foetuses right to life would then be guaranteed by the fourteenth amendment”\n\nThat’s right according to Roe vs Wade itself the entire abortion debate revolves around dehumanisation\n\nIf you still disagree with me I’ll make you a deal, name one instance in human history in which an entire group of people were dehumanised for the benefit of someone else and the overall result was anything close to something good\n\nI’ll answer this for you, you can’t whether it be slavery, the holocaust, when your entire argument for abortion is that it’s not alive or that it’s nothing but a clump of cells. Both of which have been proven false by the way. That should be a pretty big red flag that your on the wrong side of history\n\nAbortion is evil and barbaric on every level, it has nothing to do with religion, it has nothing to do with politics it has everything to do with whether or not you believe human life is expendable or not\n\nThe only reason abortion has remained legal for so long is that the vast majority of people don’t understand the issue very well and the ones that do are either desperately trying to censor the truth in order to stay in business or their desperately trying to abolish the practice of abortion in their country",
            "title_similarity": "0.81565094",
            "sentiment_compound": -0.9942
        },
        {
            "id": "hc5jmhl",
            "score": 1,
            "text": "How about we restrict it based in race then?  Would that make you happy?  \n\nAlso we can add in post partum abortion clause so people who aren't sure if they want to be a parent or not can give it a shot for a year or so to see if they like it.",
            "title_similarity": "0.5806228",
            "sentiment_compound": 0.5103
        },
        {
            "id": "hc5lz3k",
            "score": 1,
            "text": "Yep. But all laws are based on morality, and restricting abortions for moral reasons is fine.",
            "title_similarity": "0.60827714",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hc5mclh",
            "score": 1,
            "text": "Not only that it is only against Equal Human Rights. \n\nFetuses do not have equal human rights therefore fetus’ rights are more belief and philosophical debate.",
            "title_similarity": "0.6799369",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5p3wq",
            "score": 1,
            "text": "We all know this isn’t a view that can or should be changed. In fact, it’s not a view at all. What do you want us to reply with lol\n\nI guess we can say “it’s not on religious grounds” but that’s not the view you’re wanting challenged.",
            "title_similarity": "0.5590602",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hc5pftc",
            "score": 1,
            "text": "Im a christian and i admit that if there were only a bunch of cells abortion would be nothing wrong.\nBut thinking that a soul will pass all eternity in hell and had no choice about it just because on earth they considered him a bunch of cells makes me stands pro life.",
            "title_similarity": "0.75435483",
            "sentiment_compound": -0.8411
        },
        {
            "id": "hc5tcpm",
            "score": 1,
            "text": "I don't think anyone will technically change your view because that's literally true.\n\nHowever that isn't what pro life proponents think they are doing.  Most genuinely believe they have science on their side and its simply evil feminism and leftist selfishness that keeps the law from recognising what they see as murder for what it is.\n\nLet me explain. \n\nFor most pro life people, it is self evident that when a sperm and egg meet, fuse and form unique new human DNA, aka conception (perhaps with a few days fuzziness either side depending on your view of the exact biological processes), that a new living human now exists to which the same quality of values exist as to any other living human.  \n\nThe deeper thinking ones can then apply the same human rights analysis that pro choice advocates favour to this scenario, identify the conflict of the right of the mother to bodily autonomy and the right of the \"child\" to life and conclude the latter is higher in the hierarchy of rights and thus 'trumps' the mother's choices.\n\nNow this all has its own consistent internal logic until you dig a bit deeper and ask why we ascribe humans rights,  or more specifically, what quality of a human is it that entitles them to rights.  Saying \"they are human therefore they have rights\" simplistically is just a semantic argument about the meaning of human and not very interesting unless you dig to this deeper question. \n\nSo the question of what makes an entity entitled to human rights is a much more interesting one with many possible takes.   Pro lifers are, at least implicitly,  taking the view that novel human dna with the potential to form an independent person should immediately have these rights, but for me arguments based on future potential are fraught with difficulty, not least because they potential can only be fulfilled in very precise circumstances with a lot of passive and some active assistance from the mother.  Logically those taking this view should (but don't always or even usually) take the view that IVF or storage of fertilised embryos is also murder, and (even less commonly but no less logically) that a woman who miscarries after doing activities that increase chances of miscarriage might be guilty of a crime (though less than murder).\n\nThe existing law in most sensible countries has taken an easy to understand view, which I think is ultimately poorly conceived albeit worlds better than the pro life view, of saying it is viability that should determine the point at which the foetus becomes an independent human and has rights, absent a threat to the superior right to life of the mother.  This is problematic because he point of viability is a moving target, determined by medical technology and science. There's no reason to think that it won't in the near future be possible to go from independent egg and sperm all the way to breathing infant in a lab absent mother.  This makes it an odd philosophical choice to hang rights on; its a purely practical division.\n\nA better but harder to explain distinction, in my view, is that the thing that makes Humans worthy of rights is our executive higher brain function.  Just as a body which loses all higher brain function is pronounced irrecoverably brain dead, a foetus before about 22 weeks has no regular higher brain patterns at all and should not be considered yet \"brain alive\".  This distinction is closely tied to the idea of rights attaching to personhood rather than humanity, with the former different from the latter semantically in the sense that one must have personality or animus to assert rights.\n\nHigher brain function can also be measured by EEGs, and thus this distinction is both philosophically and practically satisfying.\n\nI went a bit off topic but i hope I've at least informed if not changed your views",
            "title_similarity": "0.75068414",
            "sentiment_compound": -0.8529
        },
        {
            "id": "hc5uy0u",
            "score": 1,
            "text": "If you are against abortion then don’t have one.",
            "title_similarity": "0.5963125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5viv3",
            "score": 1,
            "text": "Shouldn't we be more worried about proper sexual education and availability of contraceptips instead of abortions.  The only only time abortion should be even thought of is rape, incest, and under age pregnancy.",
            "title_similarity": "0.7436805",
            "sentiment_compound": -0.8016
        },
        {
            "id": "hc5wkho",
            "score": 1,
            "text": "another day, another abortion post..... sigh...",
            "title_similarity": "0.3620971",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc5xx0b",
            "score": 1,
            "text": "Too bad it wasn't restricted on religious grounds; otherwise, that view would matter",
            "title_similarity": "0.44686955",
            "sentiment_compound": -0.2996
        },
        {
            "id": "hc5zs1o",
            "score": 1,
            "text": "Because abortion is not a religious viewpoint, it is a moral viewpoint.\n\nSociety makes many laws based on common morality.\n\nIt is against the Christian religion to commit murder, and we have that as a crime. Should we say that it should be legal just because the Bible says it is wrong?",
            "title_similarity": "0.79704016",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hc60avh",
            "score": 1,
            "text": "Disclaimer: I am not Republican nor democrat. I have no specific bone to pick with either party or their people outside of specific things about specific people and *their* actions outside of what party they affiliate with. Additionally, I am neither for nor against abortion. I really am undecided and haven’t really come to a conclusion on how I feel about it. In some cases I feel it is immoral, in others I recognize the right of people to do what’s best for them and their own (a heavy emphasis on the child’s quality of life, and medical reasons). This is not a post about whether or not I agree or disagree with it, but just my interoperation of abortion restrictions.  \n\nAs everyone is so quick to remind the right, however, we are a democratic republic. We the people give our collective power to those we vote into office. If the people we vote into office set a policy based on a religious belief it is technically the will of the people that voted them in there. \n\nAt that point you would need to challenge the policy on…\n\n1. Does it violate the constitution? *IMO* it doesn’t. Nothing in there really touches on the concept of abortion itself. Now before you get upset, be reminded that at the time of its conception it wasn’t super common for people to terminate pregnancies willingly as the technology/medical field for it wasn’t really there at the time. However, there is nothing wrong with amending the constitution to add abortion rights in there if the majority today feel inclined to do so. There is a process already in place to do something like that, and it is a sure fire way of guaranteeing abortions be legal. Again, IMO, it is not currently a guaranteed right under the constitution, but it could be made to be so. \n\nOr\n\n2. Recall/vote out the policy makers of the police the people disagree with. Vote in people who would strike down the law if it’s failed to be removed on constitutional grounds. \n\nAlthough now that I think about it there is technically a third option. Contact the policy makers and voice your opinion. If enough of their constituents say “hey, I don’t like this” they *should* be amenable to striking the law, despite their own personal beliefs on the matter. If they fail to do so, they are a bad representative and option 2 should be utilized to remove them from office. \n\nThe left side of the aisle has been very keen on “we are a DEMOCRATIC republic, and if the people voted someone in then the people have spoken”. It would be, imo, hypocritical to try and strike the policy down simply because it has a partially religious root. Especially when taking into consideration what I’ve said above as ways to get it struck down exist outside of “but it’s a religious thing.”",
            "title_similarity": "0.7716915",
            "sentiment_compound": -0.922
        },
        {
            "id": "hc625jz",
            "score": 1,
            "text": "I think women should be the only ones to vote on any laws that “control” their bodies. Backed by science/medical experts & ethics committees.",
            "title_similarity": "0.5685326",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc63azy",
            "score": 1,
            "text": "I’m not religious and I don’t believe in abortion. I do believe in exceptions for rape,incest, risk of mother’s life and debilitating illness for the baby.  I believe in the child’s right to live and the father’s right to his child. What about the women’s right? She had a choice previously to have sex. Sex is an adult choice with adult consequences. If abortion is legal, I also believe you shouldn’t  enforce child support from the father. If a father doesn’t have the right to decide if his child has the right to live or die, he shouldn’t have to pay his income for the next 18 years.\n\nAlso religious freedom means that the government shouldn’t encourage a religion nor should a  government discourage a religion . It should be neutral. I also disagree 75% of Americans identify as Christian. It’s much less especially these days.",
            "title_similarity": "0.7717434",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hc676gy",
            "score": 1,
            "text": "Main reason is birth rates.",
            "title_similarity": "0.2651703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc67fil",
            "score": 1,
            "text": "I think the right wingers are arguing that it is murder and we have to save kids actually",
            "title_similarity": "0.55522764",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hc67od7",
            "score": 1,
            "text": "Don't recall many people defending anti-abortion based off of religious views. I think they base their stance on the fact that killing a human being is probably pretty bad?",
            "title_similarity": "0.76645195",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc6a8ht",
            "score": 1,
            "text": "Concerning the Edit, as you state 75% of the us population is **coo co0 for coco puffs** crazy, and yes, they are downvoting you, you can only try to educate the stupid and misinformed, eventually Darwin will prevail.",
            "title_similarity": "0.6762107",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc6a9kz",
            "score": 1,
            "text": "Tell that to the native Americans!!!! They couldn't even dance !!!!  and of course were not a Christian nation, we love MONEY AND WAR!!! 2021",
            "title_similarity": "0.7081424",
            "sentiment_compound": -0.382
        },
        {
            "id": "hc6besi",
            "score": 1,
            "text": "> The 1796 Treaty of Tripoli states that the USA was “in no way founded on the Christian religion.”\n\nThe treaty is lying.  Remember, it was a treaty with Muslim countries, so it was important to try to establish neutrality.  Technically speaking, the US wasn't founded on the Christian religion, but *practically* speaking, it absolutely was.  It was founded mostly by Christians with a mostly Christian population, whose insistence on religious liberty was to practice their own versions of Christianity.  Pretty much every protection non-Christians have gotten has been by using the First Amendment in court, because we didn't get them by default.\n\n> to base policy (on a state or federal level) solely on majority rule is inherently un-American\n\nHah, welcome to democracy, where the other 49.9% don't matter.  You can call whatever you want un-American, but in our democratic system, it's simple majority rules for the most part.  There *are* some issues that need more than a simple majority, but we also have to remember that the people of Texas (going back to the actual issue here) voted, by simple majorities, to elect their state legislators, and those legislators were the ones who did this shit.\n\n> The fact that there is no law establishing a “national religion”, whether originally intended or not, means that all minority religious groups have the American right to practice their faith, and by extension have the right to practice no faith.\n\nThat's guaranteed by the First Amendment, not by not having a \"national religion\".  We *could* have a \"national religion\" and still maintain the rights of minority religious groups and nones, but we don't.\n\n> A government’s (state or federal) policies should always reflect the doctrine under which IT operates, not the doctrine of any one particular religion.\n\nI mean... maybe?  But the doctrine under which the Texas legislature operates is that it does what its members vote on, and if those members want to criminalize murder like it says in the Ten Commandments, they can do that, but if they wanted to criminalize polytheism, like it also says in the Ten Commandments, they *can't* do that because of the First Amendment.  In other words, they can *absolutely* have a religious basis to their laws, but they still have to pass all the relevant tests (rational basis, is that one?).  Like, if someone challenges the anti-murder law in court for whatever reason, they'll need a lawyer to argue in court that the anti-murder law is important for some reason other than religion.  But when passing the law, they absolutely *can* just say \"my religion tells me to vote yes\" or whatever.\n\n> If there is a freedom to practice ANY religion, and an inverse freedom to practice NO religion, any state or federal government is duty-bound to either represent ALL religious doctrines or NONE at all whatsoever.\n\nThis is just bad logic.  No.  First, \"religion\" is undefined here.  What's a religion?  Can I just make up my own religion that requires me to murder someone every Thursday morning and then argue that, hey guys, I need to murder someone, you can't put me in jail for following my religion?  The answer is clearly no, not because I can't make up my own religion but because the government has a separate duty to protect people from being murdered.  In doing so, the government is specifically disfavoring my religion.  Meanwhile, a bunch of other people believe, in their religion, that murder is *not* cool, and the government is representing *their* doctrines.  Fact is, some religions are right about some things.\n\nOf course, none of this relates to abortion.  The forced-birthers argue that abortion *is* murder, so everything I said about murder applies to abortion too.  Thing is, that's not really a religious perspective, really.  It's just a question of definition.  And it's really up to the Supreme Court to stop that bullshit, and they decided not to because Republicans.  Nothing really improper has happened here, though we'll see where the Satanic Temple's challenge leads, because they're arguing for religious freedom to perform abortions.  Hopefully it works!",
            "title_similarity": "0.89366317",
            "sentiment_compound": -0.9837
        },
        {
            "id": "hc6bmnu",
            "score": 1,
            "text": "Of course it is",
            "title_similarity": "-0.0970054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6c4ov",
            "score": 1,
            "text": "...therefore it should be only restricted to religious groups.",
            "title_similarity": "0.5325697",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc6ez3g",
            "score": 3,
            "text": "I hate that the issue of abortion has been boiled down to \"pro life\" and \"pro choice\". I'm religiously agnostic. I'm not pro life when it comes to rapists or murderers, I think they should all be afforded their right to a speedy trial and if found guilty, hung outside the courthouse and left to swing for a couple days.\n\nI'm pro choice when it comes to freedom. If you're an adult of sound mind, you should be free to do whatever the fuck you want with your body. The problem is, that baby inside you, it's not your body. I've had the misfortune of being in two submarines in my life (I'm pretty claustrophobic) and I was not a part of the submarine, though I did rely on it to carry me safely to my destination.\n\nMy daughter was born after a full term pregnancy. My sisters second child was born at 28 weeks. They are often confused as twins when they're seen in public. Both beautiful and healthy little girls. The idea that either of them could have been cut into tiny pieces and vacuumed out the minute before they were born is absurd.\n\nHaving said that, instances of rape/incest, or if the pregnancy will jeopardize the mothers health seem like reasonable exceptions. There are simply too many forms of accessible birth control for women to be able to kill babies for no good reason.",
            "title_similarity": "0.81433517",
            "sentiment_compound": -0.8593
        },
        {
            "id": "hc6g128",
            "score": 1,
            "text": "Thomas Jefferson one of the major founders BTW . He didn't follow any church. I heard he had his own translation of the Bible.  He for one would be disgusted with Texas' laws. There is a Jeffersonian society that annually issues Muzzles to those who put any restrictions on freedom of speech.",
            "title_similarity": "0.7787111",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hc6izqp",
            "score": 1,
            "text": "The pro life argument is secular",
            "title_similarity": "0.418854",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc6lozi",
            "score": 1,
            "text": "While the constitution guarantees the right to freedom of religion, and the establishment clause states the government cannot establish a national religion (which has been interpreted to include any action putting one religion above others in various cases), there is nothing in the constitution saying the government can't take a *permissible action* simply because it is influenced by the religion of those running government. \n\nFor example, assume Roe v. Wade and the cases that follow (namely PPH v. Casey) never were written. Without these cases, a ban on abortion is in effect constitutional. The government may pass laws that are within their purview, including a ban on abortion. The fact that the law may be inspired by religion is of no consequence because the constitution did not so limit the government's power. \n\n>75% of Americans may identify as some form of Christian, but to base policy (on a state or federal level) solely on majority rule is inherently un-American. The fact that there is no law establishing a “national religion”, whether originally intended or not, means that all minority religious groups have the American right to practice their faith, and by extension have the right to practice no faith.\n\nThere is only no law establishing a national religion because the establishment clause explicitly says we can't. We almost certainly would have during the red scare, to show those \"godless commies.\" We added \"under God\" to the pledge of allegiance around that time for the same reason. Calling the US a Christian nation at the time would not only have been a more accurate description of the population, it would have been a popular move. \n\n>A government’s (state or federal) policies should always reflect the doctrine under which IT operates, not the doctrine of any one particular religion.\nIf there is a freedom to practice ANY religion, and an inverse freedom to practice NO religion, any state or federal government is duty-bound to either represent ALL religious doctrines or NONE at all whatsoever.\n\nThe thing with abortion is it is a secular issue. While Christians may be informed by their beliefs that a particular worldview is correct on the issue (that a fetus is life and you should not be able to end it) is not necessarily a religious view. Again, there are plenty of secular arguments against abortion, and there's even an atheist anti-abortion group. The problem with your view is that you, like many, presume that because a policy position is *informed by religion* that it is a *religious policy*. It's not, abortion itself has nothing to do with religion until people inject religion into it.",
            "title_similarity": "0.8738142",
            "sentiment_compound": -0.2086
        },
        {
            "id": "hc6vown",
            "score": 1,
            "text": "I love when OP scurries off with a second edit.",
            "title_similarity": "0.178736",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc709gj",
            "score": 1,
            "text": "I think some on here has addressed that non religious people can also be anti-abortion. Personally though I think if the argument for abortion only revolve around the question of morals, we will get nowhere. Why don't we try to approach this from a different, logical and cold calculative view?\nHere is why I think we can measure why pro-abortion is the way to go.\nFor the fetus, the only humanitarian term I've heard so far is that because it's life. Assigning a value for something just because it is that way naturally is just pointless. There is nothing special, and nothing valuable, about human lives. We are an endless self-propagating and consuming species. What is the difference this one fetus won't get born will make? Another baby is born a minute later somewhere in the world. What is this value of human lives that people talk about. Is it monetary value or resources value? The only value human lives has is sentimental value to the ones that love that human being. But enough of that, let's look at it from some other angles.\n1. Economics, if the mother is not in a very desirable economic situation, forcing her to have a baby is just placing more economic burden on her, making her life worse, that's not humanitarian at all. Even more so for the baby, if the parents is poor and is incapable of providing adequate needs to the baby growth, is that not inhumane as well? And if the parents have to work long hours to make ends meet, and not have enough time with the child, the loneliness that can cause will impact the child deeply in the long term.\n2. Social. The societal situation that the mother is in, it can be safe, it can be dangerous. What if there's a civil war going on? What if the current social situation is temporarily not safe or undesirable to have a child? \n3. Personal, what if this person conceived because she lacked sex education? Or because accident happens and the condom broke or the pill didn't work in time? Or maybe she was raped? Personal development? Maybe people don't realize this, but giving birth to a child is just the most basic and simple step. The years or raising the child is more difficult. Where I'm from, we say everyone can make a child, but not everyone knows how to raise a child right. Your mental maturity and parental skill is ABSOLUTELY essential in raising a child. We've seen too many people whose parents simply didn't raise them right. Some people are simply not fit to be a parent.\nAll in all, pro-abortion holds much more utilitarian and humanitarian values than pro-life.",
            "title_similarity": "0.7927737",
            "sentiment_compound": -0.9866
        },
        {
            "id": "hc7806q",
            "score": 1,
            "text": "Child support is unconstitutional.",
            "title_similarity": "0.560048",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc8y6m5",
            "score": 1,
            "text": "I'd put moral grounds first.   Especially those who equate abortion with retroactive birth control.",
            "title_similarity": "0.5477775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9rk0x",
            "score": 1,
            "text": "We as a society have determined that you cannot take a life without what it deems as sufficient justification. Situations like self defense or defense of another are such justifications. With the issue of abortion we as a society are in conflict as to when/if it is justifiable killing of a human life (or even the killing of a human life with some). \n\nThe recent restrictions on abortion are not from a religious point of view, they are from philosophical viewpoints that conception is when human life begins and thus ending that life has limitations just like legally killing an adult has limitations. Texas for example has decided that said limit is when the fetus starts to have a heart beat (roughly 6 weeks) unless there is a medical threat to the mother's life at which point it can be done later in the pregnancy.",
            "title_similarity": "0.7635047",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hcjsx1t",
            "score": 1,
            "text": "Religion or not !!  It is wrong to be so careless with yourself by getting pregnant in the first place!! Then to decide to End the Life of another SOUL , one in which you helped create...\n\nThose who think GOD is a religion ..Man created religion...We all know inside what is right\n\nyet, we choose to fight it with our worthless \"man made knowledge\" because we disagree?  .. Well, when the time comes \n\n you will have to answer to GOD like every other soul will .. I hope for your sake its one hell of a compelling argument.. Time goes by so fast it be best not to waste your heart in heartless things and if that is who you really are then ... I pray for you....",
            "title_similarity": "0.77001435",
            "sentiment_compound": 0.7667
        },
        {
            "id": "hfaqugw",
            "score": 1,
            "text": "Very true. Pro life arguments based on religious morality is a dead on arrival discussion and holds no weight. Pro life legislation based on religious morality simply shits on the constitution. The only pro life arguments that I’ll listen to are ones based on a ethnics, issues around human rights, and what defines a human. That’s where the meat of the debate really is.",
            "title_similarity": "0.80776185",
            "sentiment_compound": -0.8981
        },
        {
            "id": "hsp68i2",
            "score": 1,
            "text": "This is a straw man I see a lot. While polls do say that the majority of pro-lifers are religious, correlation doesn't imply causation. Most pro-lifers in my experience are pro-life because of secular reasons that have nothing to do with religion. There are entire secular pro-life groups like \"Secular pro-life\" that are atheists who think that abortion should be illegal.",
            "title_similarity": "0.78098524",
            "sentiment_compound": -0.2732
        }
    ]
}