{
    "CMV: Biden’s vaccine “mandate” has a multitude of precedence. It will not send the US into some authoritarian regime.\nThe Supreme Court already ruled 7-2 on the side of compulsory vaccines in 1905. The court decided that the right to individual liberty in regards to vaccination is not above the rights of the collective. This is just one case of precedence out of dozens.\n\n[Jacobson vs. Massachusetts](https://en.m.wikipedia.org/wiki/Jacobson_v._Massachusetts) didn’t change the US into a big authoritarian regime. \n\nThe Court held that \"in every well ordered society charged with the duty of conserving the safety of its members the rights of the individual in respect of his liberty may at times, under the pressure of great dangers, be subjected to such restraint, to be enforced by reasonable regulations, as the safety of the general public may demand\" and that \"real liberty for all could not exist under the operation of a principle which recognizes the right of each individual person to use his own liberty, whether in respect of his person or his property, regardless of the injury that may be done to others.”\n\nMassachusetts was allowed to enforce their fines on those who chose not to receive the small pox vaccine. \n\nPeople need to chill. You still have the right to not get the vaccine. They’re not even fining you like they did in 1905. You just have to get tested weekly. If your employer decides they don’t want to keep you around as a result of your refusal, that is the right of the business.": [
        {
            "id": "hcdroui",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\n\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\n\nWe are actively cleaning up the thread now, and will unlock it shortly.  We will try and do this quickly so discussion can continue though the amount of time will vary based on moderator availability.\n\nThank you for understanding.",
            "title_similarity": "0.5794063",
            "sentiment_compound": 0.2066
        },
        {
            "id": "hca3le3",
            "score": 3,
            "text": "At what point do you just consider yourself a slave? You don't own your body, you don't own your wages. If you don't even own your own body then what are you?",
            "title_similarity": "0.3959548",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcahig6",
            "score": 6,
            "text": "Well if nothing else I'm glad that you agree a private company can do as they please, assuming you truly mean that then you also agree that a private company can refuse to serve anybody for whatever reason, say a Christian baker refusing to bake a cake for a gay wedding, that's perfectly justified because they are a private business.\n\nOn a second note, I'm also sure that you are aware that big pharma are starting studies into how RNA vaccines affect the human body in the long term. \n\nYou're also aware that the biggest indicator of being affected by covid is obesity, you're also aware that there is a survival rate of 99.8%. \n\nI'm sure you'd also agree then given that bird flu and SARS was much more dangerous as well as swine flu and there wasn't a lockdown, wasn't a mask mandate and no social distancing and no vaccine produced, it seems a bit suspect that a far more dangerous set of viruses should be largely ignored but this one isn't, even though the vast majority of people who get it won't even know about it. \n\nAnd finally given your so clear that a government can force it's people to be vaccinated you'll also have zero trouble accepting a government bill that forces you to take opiates for pain relief or lithium for mental health issues, of course you might not have either but then again it won't matter because if the government says it's ok you'll be happy to take both. \n\nYou see here is the issue, you're making the assumption that governments are acting in the best interests of the people, not in their best interests, you're assuming that pharmaceutical companies who have been caught in scandal after scandal since the 1970s are operating in the best interests of the people and not themselves. \n\nHere's the rub though, a vaccine needs to fullfil 3 basic demands\n\nIt must be safe and not kill the vaccinated person\nIt must stop or slow the spread of the virus\nIt must be effective and long lasting\n\nThe vaccine carries enough side effects that death is an accepted side effect but classed as very rare. \n\nThe vaccine is not stopping the spread of the virus, in many cases it might actually be enabling mutations of the virus and making the virus more dangerous\n\nGovernments are already talking about booster shots every 8 months and even lower to six months, that's hardly long lasting and hardly effective.\n\nNow I'm very much in the vaccinate camp, I'm also very much in the camp that thinks if I'm vaccinated then I should have nothing to worry about, I mean if I'm vaccinated and the vaccine works right. So if I'm vaccinated then I'm protected, I have nothing to worry about, if somebody choses to not vaccinate then it should be their choice.\n\nOf course we have a small number who cannot have the vaccine for health reasons, however it cannot be argued that we have the vaccine to protect them, as it has been shown we vaccinated can still catch the virus, still pass it on.",
            "title_similarity": "0.74081266",
            "sentiment_compound": 0.99
        },
        {
            "id": "hca0bcd",
            "score": 37,
            "text": "OP you said multitude but only cited the one example no living American was around for. \n\nOn top of which, remember like three days ago when y'all were like \"They're a private business they can do what they want!\" and in the span of one announcement y'all did a complete about face.  That's textbook authoritarianism. \n\nThank God Trump's supreme court is going to laugh this out of the room.  Republicans are probably going to shout conflict of interest since Pfizer donated a ton of money to Biden's campaign.",
            "title_similarity": "0.6248622",
            "sentiment_compound": 0.9761
        },
        {
            "id": "hca0mp4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hca9k1h",
            "score": 11,
            "text": "Sounds a bit like fascism, with extra steps. /s",
            "title_similarity": "0.26165733",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hcalld8",
            "score": 145,
            "text": "SCOTUS will get the last word.\n\nI'm vaccinated, but feel this is a clear abuse of power.    What will be the next thing the Feds try to mandate?    America is losing its freedom.",
            "title_similarity": "0.6073536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hca06z0",
            "score": 70,
            "text": "If a president circumvents the entire legislative branch to enact a order that may violate 1/3 of the citizens bodily autonomy, you should be alarmed. \n\nThis would not have passed in congress.\n\n“People need to chill”\nNo. Do not comply.",
            "title_similarity": "0.6563557",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hcaud47",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.0867783"
        },
        {
            "id": "hcak206",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcaddt4",
            "score": -5,
            "text": "..he's literally doing the same thing people hate in texas, using monetary fines to impose a mandate on bad behavior and doing it in an extra legal way. Apparently when it's something people like, its ok then!",
            "title_similarity": "0.49851912",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hca0dka",
            "score": 682,
            "text": "The major issue here is federalism.  This is basically the federal government usurping a traditional state power.  States have general police power for stuff like this.  The federal government does not.\n\nEDIT:  I am aware of the existence of OSHA.  OSHA itself raises federalism issues for some (myself included), and there is a nonnegligble contingent of people in the legal industry/academy who question the validity of SCOTUS's New-Deal-era Commerce Clause jurisprudence.",
            "title_similarity": "0.68164945",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hcav0fr",
            "score": 5,
            "text": "\\> You just have to get tested weekly. If your employer decides they don’t want to keep you around as a result of your refusal, that is the right of the business.  \n\n\nMask wearing was \"just\" 15 days to slow the spread.",
            "title_similarity": "0.55339414",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hcakl6g",
            "score": 72,
            "text": "Do you think authoritarian regimes just \"poof\" into place out of nowhere?\n\nDo you think people just live normally and next day decide to exterminate a race?\n\nObviously no. Society and regimes are not built by dropping a huge bomb, they are built by making slight changes, allowing people do adapt, and then after they've adapted, they push that a bit further every step. That's how you create authoritarian regimes. You make one tiny step at a time.\n\nAnd before you go \"slippery slope argument\", find out what \"fallacy fallacy\" is.",
            "title_similarity": "0.6936694",
            "sentiment_compound": -0.3939
        },
        {
            "id": "hcbq9v6",
            "score": 1,
            "text": "People complaining about it. Why not complain about Florida withholding pay from teachers who want to mask up? \n\nYou can't be forced to do something unless I force you to do it = every conservative alive \n\nGod damn the hypocrisy is getting old. \n\nWhere is our early 40s tech entrepreneur who made his money himself without some trust fund who believes in progressive policies and isn't in bed with corporations or the military industrial complex?",
            "title_similarity": "0.6291293",
            "sentiment_compound": 0.3287
        },
        {
            "id": "hca1k63",
            "score": 18,
            "text": "Well I guess if 7 judges said so in 1905, there's no arguing with that. /s",
            "title_similarity": "0.6342406",
            "sentiment_compound": 0.5544
        },
        {
            "id": "hcbzjbx",
            "score": 0,
            "text": "I’m a lawyer and I’m not going to attempt to change your view because it’s correct. There are scores of precedent allowing vaccine mandates. Nothing unconstitutional about it.",
            "title_similarity": "0.7020766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9ylur",
            "score": 362,
            "text": "[deleted]",
            "title_similarity": "0.0867783"
        },
        {
            "id": "hca4bh3",
            "score": 127,
            "text": "*Jacobson* was the main justification for *Buck*: since the government can vaccinate citizens against their will, it can certainly sterilize people against their will:\n\n> The principle that sustains compulsory vaccination is broad enough to cover cutting the Fallopian tubes. Jacobson v. Massachusetts, 197 U. S. 11. Three generations of imbeciles are enough.\n\nDo you see a shining line between compulsory vaccination and compulsory sterilization?  Even if you do, *the government doesn’t.*",
            "title_similarity": "0.8038496",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hca48aa",
            "score": 70,
            "text": "[deleted]",
            "title_similarity": "0.0867783"
        },
        {
            "id": "hca8g11",
            "score": 2,
            "text": "Can you define \"authoritarian regime\"?",
            "title_similarity": "0.3174318",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcb2htw",
            "score": 1,
            "text": "To all who have already been vaccinated:\n\nAre you willing to take a vaccine every 6 months for the rest of your lives? Because that's where we are headed. \n\nThis is not what I signed up for and it was not part of the deal going into this.",
            "title_similarity": "0.7029176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcc2oth",
            "score": 2,
            "text": "I am not a Republican. I am not a Trump supporter. I am a leftist who has organized socialist organizations within the United States and I am a member of Democratic Socialists USA. I want to provide this preface so people understand this is not a black and white issue or Republicans vs Democrats. This is freedom vs autocracy. Mass hysteria vs rationality. \n\nFirst of all, you are operating under the assumption that the United States is not already an authoritarian borderline fascist regime. This is a false assumption. \n\nThe United States has the worlds highest incarceration rate, and it's not even close. [The United States has about 25% of the global prison population.](https://worldpopulationreview.com/country-rankings/incarceration-rates-by-country) This of course disproportionately affects minority racial groups in the country, a textbook authoritarian signifier. It also routinely guns down its own citizens in the streets for routine violations, disproportionately affecting minority groups.\n\nThe US Media system is not a crude state run propaganda machine, but it is a highly sophisticated corporate run propaganda machine. See Noam Chomsky's seminal work, [Manufacturing Consent: The Political Economy of the Mass Media](https://www.abebooks.com/Manufacturing-Consent-Political-Economy-Mass-Media/30996036203/bd?cm_mmc=ggl-_-US_Shopp_Trade-_-product_id=COM9780375714498USED-_-keyword=&gclid=CjwKCAjwhOyJBhA4EiwAEcJdcfJO3dP5G6dP4CaL3dGe3R4gNgY72FwTp8dj7_MP9u5A5rVAmzXQ5RoCBoUQAvD_BwE). If you would rather not read a book, which is understandable, there are countless articles on this subject. Six corporations control practically the entire media system, a textbook signifier of oligarchy.\n\nThe US has military bases all over the globe, has committed numerous war crimes and human rights abuses, directly supported genocide (Indonesia being perhaps the biggest beyond the Indigenous genocide) and continually implements regime changes that favor US corporate interests. The US \"democracy\" is a giant corporate lobbying hell hole which is bought by the ultra rich oligarchy who can afford to pay the lobbyists. I could go on here but I am not interested in spending all day citing sources, again google searches if you are not already aware of this.\n\nGetting to the topic of health, the US and US Corporations has a history of violating its citizens rights when it comes to health:\n\n\\- [The Tuskegee Experiments](https://www.cdc.gov/tuskegee/timeline.htm)\n\n\\- [Project MK Ultra](https://www.npr.org/2019/09/09/758989641/the-cias-secret-quest-for-mind-control-torture-lsd-and-a-poisoner-in-chief)\n\n\\- [Henrietta Lacks, a great book about her exists](https://www.npr.org/2010/02/02/123232331/henrietta-lacks-a-donors-immortal-legacy)\n\nAgain, there's so much more here an entire wikipedia page exists for this topic [https://en.wikipedia.org/wiki/Unethical\\_human\\_experimentation\\_in\\_the\\_United\\_States](https://en.wikipedia.org/wiki/Unethical_human_experimentation_in_the_United_States)\n\nNow, getting specifically to what is going on with this vaccine. It is not within the authority of the president to overstep federalism and mandate a vaccine. Even if it were, it would be unethical to do so. Each person should have the right to make their own medical choices. \n\n[Already, 67% of the US population has received at least one dose of the vaccine according to the CDC.](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/covidview/index.html) The vaccine does not stop transmission of the disease. Death occurs in about 3% of cases. Death occurs in about 1% of flu cases. You are more likely to die if you have pre-existing health conditions. Therefore, it is reasonable for a healthy person to decline to take a vaccine that is not guaranteed to stop transmission, has not undergone long term study, and which will not eliminate the need to take other common sense safety precautions. Even if you personally believe it is unreasonable for someone to decline the vaccine, you do not have authority to override someone's bodily autonomy. I understand very well that collective well-being outweighs individual freedoms in some instances - that's why I am fully vaccinated against diseases like Polio. That vaccine is actually effective and has an abundance of evidence. I do not take the flu shot for the same reason I have not yet gotten the COVID vaccine: my risk is extremely low as a healthy individual, the vaccine is not shown to be effective against an ever evolving disease... objectively and within my own subjective experience where I know many who have COVID and have gotten the vaccine. \n\nI do not trust that the government of the United States, the number one global aggressor and violator of human rights, has my best interest at heart. I do not trust that corporations who are immune to prosecution have my best interest at heart. I do not believe overruling local representative bodies to force any health measure on individuals is ethical. The more we allow authoritarian action to be taken, the more what little freedom is left in this world will erode. We are well on our way to a Cyberpunk style dystopia already. [The more we allow some people to labeled as \"others\" based on their views, the easier it becomes for the average person to justify taking extreme action against \"the other.\"](https://othersociologist.com/otherness-resources/) This is how every single conflict or genocide starts. Once you believe people should be left to die because they made a personal medical choice [\\- see this reddit thread from yesterday where exactly that happened -](https://www.reddit.com/r/nottheonion/comments/pkztz8/howard_stern_says_antivaxxers_should_be_denied/?utm_source=share&utm_medium=web2x&context=3) you have become an extremist ruled by fear who is not acting rationally and viewing the objective factors at play.",
            "title_similarity": "0.7316645",
            "sentiment_compound": 0.9907
        },
        {
            "id": "hca4h93",
            "score": 615,
            "text": "[deleted]",
            "title_similarity": "0.0867783"
        },
        {
            "id": "hcahcnq",
            "score": 17,
            "text": "The govt isn't prone to relieving themselves of power. If we give then this power it will continue to get worse. A social credit system is in the works for 2022 right now. That doesn't sound authoritarian at all right? Works well for China, why not the US.",
            "title_similarity": "0.69594425",
            "sentiment_compound": -0.1306
        },
        {
            "id": "hca51bs",
            "score": -9,
            "text": "I think a lot of people are ignoring the fact that the mandate isn't even a hard mandate. You can choose to opt for regular testing instead. Such a choice means that it's not in any sense of the term violating bodily autonomy",
            "title_similarity": "0.6553094",
            "sentiment_compound": -0.7099
        },
        {
            "id": "hcbc4mk",
            "score": 2,
            "text": "Lots of great comments here already. But if this is about collective health and the greater good, then why are we ignoring natural immunity? Ignoring natural immunity from prior infection is not science based at all. There have been recent studies showing that the vaccinated are 13 times more likely to get covid than those with prior infection.  \n\nWhy should these people be forced to get vaccinated when there is no benefit to themselves or society? If we want to be science based, we really need to start talking about natural immunity.",
            "title_similarity": "0.771018",
            "sentiment_compound": 0.7087
        },
        {
            "id": "hcazrte",
            "score": 14,
            "text": "Trump mandates that all employers force their employees to get injected with a medicine that his friends in big pharma swear is for their own good. Now tell me, which side are you on now. \n\nThe government has no right to make private medical decisions for people.",
            "title_similarity": "0.61599493",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hca1gx9",
            "score": 25,
            "text": "*\"People need to chill. You still have the right to not get the vaccine.*   \n*They’re not even fining you like they did in 1905. You just have to get*   \n*tested weekly. If your employer decides they don’t want to keep you*   \n*around as a result of your refusal, that is the right of the business.\"*  \n\n\nIn a sense yes we still have the right to not get vaccinated, but that is changing drastically. While the government might not force you to take it, they will still take part in coercion or implicit coercion. Private businesses will be pressured into mandating vaccines and the government wont speak up against that even though it infringes on a lot of peoples rights.  We're already seeing this happen in France.  \nI do think though that there will come a time where people are forced into taking the vaccine, the main argument for this will probably be \"you're doing it for the common good\". When the common good is mentioned, that's when i'll start considering the country a somewhat socialist country. Who even decides who the common good is, and what happens to those who don't comply?",
            "title_similarity": "0.7579487",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hcaxri9",
            "score": 36,
            "text": "Smallpox had a death rate of 30%, and covid has a death rate of around 1% in the unvaccinated. Regardless of your opinion on vaccine mandates these two diseases are not remotely comparable in terms of the threat they posed. \n\nI am vaccinated and I think all should get vaccinated, but I support bodily autonomy. The fact is that the vaccine is so effective against severe covid infection that an unvaccinated person is not a major risk to a vaccinated one. We should not be forcing people to get a medical procedure over a disease with a 1% mortality rate and an idk 0.00001 whatever % mortality rate in the vaccinated. \n\nI would support a vaccine mandate if covid was 30% mortality and if vaccinated mortality was substantial, but the fact is the unvaccinated are more likely to hurt themselves. And I believe in people’s fundamental right to make bad decisions as long as they are not directly measurably taking away another’s freedoms/life. There is a such a small chance of vaccinated people getting seriously ill from covid that I do not believe unvaccinated people are infringing upon our freedom",
            "title_similarity": "0.791068",
            "sentiment_compound": -0.092
        },
        {
            "id": "hcb03oa",
            "score": 1,
            "text": "Every Republican right now: I told you Biden would mandate the vaccine",
            "title_similarity": "0.5372288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcbfur9",
            "score": 1,
            "text": "States are just that, states and the US is made of them. Biden is playing a dangerous game with what he has planned and what he is going to do to undermine governors’ authorities of their states. \n\nThere is much that I don’t agree with Biden mandating people to be vaccinated and precedence be damned. It’s the message it sends across to the American people, which will only further divide the country if not spark civil unrest to be mandated by a federal power, which people already dislike and distrust, seeing how Biden is at an all time low in approval ratings and Congress right there along with him with piss poor approval ratings, you can see that mandating such a thing in this strained political environment, people may potentially rise up. Governors are preparing to sue Biden and his administration for overreach into the governor mandates towards masks or no masks and how states manage their local schools. What he is demonstrating is blatant federal overreach and micromanagement which are the fist signs and steps of an authoritarian environment. Even those on Capitol Hill aren’t following either mask mandates set by Biden himself, nor are they required to be vaccinated, yet he is willing to demand governors to step out of the way or to implement a mask or vaccination mandate in the people, which is an overreach. It’s a “rules for thee not for me” situation! Politicians throughout the country are displaying such actions from Obama holding a massive 300+ birthday party without masks to Biden being seen without masks and not mandating or at least enforcing vaccinations in his office. It’s blatant hypocrisy",
            "title_similarity": "0.59013754",
            "sentiment_compound": -0.9298
        },
        {
            "id": "hcbn6q3",
            "score": 1,
            "text": "This policy seem pretty racist since POC have the highest unvaccinated rates. Has Biden considered this?",
            "title_similarity": "0.463273",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hc9zzoa",
            "score": 10,
            "text": "/u/brainsandshit (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/plemro/deltas_awarded_in_cmv_bidens_vaccine_mandate_has/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5898266",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hcaqcvs",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcbtrua",
            "score": 2,
            "text": "Ignoring the fact that the United States has pretty much always been an authoritarian state (the police response to Occupy Wall Street should have been a clue), mandating experimental vaccines without full informed consent is illegal under the Nuremburg Code, which is codified into U.S. law, and the Universal Declaration of Human Rights. \n\nJacobson v Massachusetts occured before the Nazis started using prisoners to conduct unethical human experimentation. After we learned of the horrors that occurred during WWII, we passed laws prohibiting involuntary human experimentation. \n\nAt the moment, it is not possible to give our informed consent to participate in a clinical trial of mRNA treatments because the medium and long-term data regarding efficacy and safety simply does not exist yet, and the short term data is very contradictory.\n\nTl;DR: it is simply illegal to mandate these mRNA vaccines.",
            "title_similarity": "0.8160168",
            "sentiment_compound": -0.9308
        },
        {
            "id": "hcai2rw",
            "score": 23,
            "text": "The areas the federal government has power over are explicitly laid out in the constitution. This isn't one of them. You can just read it yourself. It will be struck down in five minutes by SCOTUS.",
            "title_similarity": "0.5812029",
            "sentiment_compound": -0.25
        },
        {
            "id": "hcas235",
            "score": 24,
            "text": "Comparing CoViD to smallpox is an enormous exaggeration by any standard. I’m not arguing that CoViD can’t cause serious harm, it’s just not nearly as deadly by the numbers.\n\nFurthermore, the outcome of the page explicitly states that this applies to mandatory FREE vaccines, of which CoViD is not.\n\n“In 1902, faced with an outbreak of smallpox, the Board of Health of the city of Cambridge, Massachusetts adopted a regulation ordering the vaccination or revaccination of all its inhabitants.[2]\n\nCambridge pastor Henning Jacobson had lived through an era of mandatory vaccinations back in his original home of Sweden.[3] Although the efforts to eradicate smallpox were successful in Sweden, Jacobson's childhood vaccination had gone badly, leaving him with a \"lifelong horror of the practice\".[3] Jacobson refused vaccination saying that \"he and his son had had bad reactions to earlier vaccinations\" as children and that Jacobson himself \"had been caused great and extreme suffering for a long period by a disease produced by vaccination\".[2]”",
            "title_similarity": "0.85742605",
            "sentiment_compound": -0.3356
        },
        {
            "id": "hcayfyu",
            "score": 10,
            "text": "The problem is that freedom to make your own choices (primary freedom) is different than freedom from consequences of other people’s choices (secondary freedoms).\n\nPrimary freedoms often come with curbs on secondary freedoms. Arguments can almost always be made that curbing a primary freedom can remotely increase secondary freedoms.\n\nBut that isn’t the main issue I have with vaccine mandates. I just consider it unfair to force my neighbor to get a vaccine against his will so that I can be a bit safer while the global bottleneck is production rates. Something like 97 percent of those in the third world are unvaccinated. I have an ethical issue with giving priority to someone who has to be forced to take it before everyone else has had a chance to say no. Every procurement order the US doesn’t have to make is an order that can be pushed out to those lower on the procurement totem pole.\n\nAnd it doesn’t make us any safer from variants, as the global bottleneck is still production rates, not hesitancy rates. Variants arise globally. Most of what it does is make the vaccinated less likely to have a breakthrough infection, which isn’t a large enough risk to justify forcing people to put anything into their body, even saline if it were that.\n\nI don’t even want to buy the first model of a car, because I know that more likely than not, there will be issues with the first iteration. I don’t download the first version of a major iOS update until the patches come out for the same reason. There are always unforeseen issues. We shouldn’t be taking that judgement away from individuals for a threat as low as covid presents to vaccinated people. Especially not when those who are worried or at enhanced risk of covid have PPE available to them that could very well be just as effective if not more effective than a vaccine when used properly.\n\nCovid also isn’t in the same league as smallpox. In terms of magnitude of threat. Not even close. So this would be the very definition of a slippery slope.",
            "title_similarity": "0.7492342",
            "sentiment_compound": 0.7637
        },
        {
            "id": "hcaab0b",
            "score": 89,
            "text": "Can I give an outsider's view here to try to change part of your view?\n\nThe USA is socially and politically very diverse and always has been. Different states really are very different, hugely different. This only works because its a federal system where the states can govern with the consent of their citizens and only the powers that must be operated at a national level are exercised at that level. The differences between states are the way that the constitution handles the need to rule with consent while dealing with a nation so large and diverse in outlook.\n\nThe issue with this - and Biden is not the first president to overstep the mark in this way - is that it pushes down from federal level something that could and should be handled at state level. The precedent you quote is at state level - the supreme court has upheld that states can regulate in a manner that is appropriate to their local circumstances and in line with the consent of those they legislate for.",
            "title_similarity": "0.6840522",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hcao1b0",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcazoys",
            "score": 5,
            "text": "You had a very specific state law at issue in Jacobson, not an unelected executive branch making an emergency rule without much notice and comment. There are significant issues with OSHA overstepping their enabling statute, not to mention APA issues.\n\nAlso, Jacobson might not be the precedent you think it is. The constitutional landscape was much different than it is now - it precedes any modern due process cases.",
            "title_similarity": "0.72447497",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hcb4pvy",
            "score": 4,
            "text": "I just don’t like how much companies like Pfizer, Moderna, and J&J will profiting from this",
            "title_similarity": "0.51986253",
            "sentiment_compound": 0.765
        },
        {
            "id": "hcb79xo",
            "score": 0,
            "text": "Talk to Australia",
            "title_similarity": "0.16408315",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcbaxph",
            "score": 0,
            "text": "Yes in the case you listed the fine was $5 on individuals which was the equivalent of $150 fine today. Bidens mandate will charge businesses thousands of dollars for each violation. Business' vs individuals is the core difference here. This is an important distinction. Because if I don't want the vacune I will be happy to pay the $150. Bidens mandate will get me fired and fining businesses is completely different.",
            "title_similarity": "0.4551856",
            "sentiment_compound": 0.3352
        },
        {
            "id": "hcbcknx",
            "score": 0,
            "text": "Where’s the acknowledgement of acquired immunity? Bonkers to not include that as ‘immunized’ given all the science showing it’s far superior to vaccination.",
            "title_similarity": "0.72237253",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hcbf0wi",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.0867783"
        },
        {
            "id": "hcbidqm",
            "score": 0,
            "text": "\"No one could \"confidently assert that the means prescribed by the State to that end has no real or substantial relation to the protection of the public health and the public safety\".\"\n\n\ni think since vaccinated people are still able to catch, carry, and transmit covid, it is up to debate on whether or not it has a substantial relation to the protection of the public health and the public safety.  As there are also reports that users who have already caught covid are less susceptible to re-infection than people who have been vaccinated but not infected, it could be argued that the existence of covid antibodies should exempt you from the mandate.",
            "title_similarity": "0.80349517",
            "sentiment_compound": 0.5784
        },
        {
            "id": "hcbn11o",
            "score": 4,
            "text": "This isn't about safety, it's a power grab from biden and his dipshit handlers.",
            "title_similarity": "0.5363087",
            "sentiment_compound": -0.6632
        },
        {
            "id": "hcbqi72",
            "score": 0,
            "text": "Would it be fair to say vaccines are like seat belts? In Britain, wearing a seat belt used to be advisory and then from 1983 onwards they were mandated by law on grounds of individual and collective protection.",
            "title_similarity": "0.6403544",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hcbqoez",
            "score": 0,
            "text": "You’re horribly mistaken.",
            "title_similarity": "0.12786067",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hcbukbb",
            "score": 0,
            "text": "I really need to take a break from Reddit man.",
            "title_similarity": "0.3467089",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcbuni5",
            "score": 0,
            "text": ">an unvaccinated person is not a major risk to a vaccinated one.\n\nBut that’s the point right? An unvaccinated person is a major risk to an unvaccinated one. Furthermore, there are children who haven’t had the chance to get the vaccine yet.",
            "title_similarity": "0.7177818",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hcbusdl",
            "score": 0,
            "text": "It might, if Trump announces his candidacy for 2024.",
            "title_similarity": "0.35872608",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcbwqpr",
            "score": 0,
            "text": "The government shit on our freedoms before, therefore they should do it again and we shouldn’t lift a finger to stop them.",
            "title_similarity": "0.6647383",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hcbz8jy",
            "score": 0,
            "text": "Perhaps you could have posted the part where SCOTUS said it was a STATES right to require vaccines.",
            "title_similarity": "0.63768995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcbzp1d",
            "score": 0,
            "text": "Using the supreme court precedent to justify your view is like a racist saying all black people should go back to picking cotton because of Dredd Scott v Sanford in 1857.",
            "title_similarity": "0.5200361",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hcbzugi",
            "score": 0,
            "text": "Americans are just stupid because of all the lead paint in 87% of the houses built before 1940. Nobody cares about your health here. Profit first. This is the result.",
            "title_similarity": "0.64130676",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hcbzv90",
            "score": 0,
            "text": "This is the prevailing opinion it seems that in the court of public opinion your validated already.",
            "title_similarity": "0.3531434",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hcbzywi",
            "score": 0,
            "text": "They have no interest in learning changing advancing them self. \n\nIt is wasted breath on those that have not already taken the poke.",
            "title_similarity": "0.47336307",
            "sentiment_compound": -0.6888
        },
        {
            "id": "hcc0hbq",
            "score": 0,
            "text": "I think it's a bad idea mostly because people who dont want the vaccine will simply not get it. They will find ways to lie about how they got the vaccine. Fake vaccine cards will flood the market and our data of who actually got vaccinated will no longer be reliable.",
            "title_similarity": "0.6359002",
            "sentiment_compound": -0.8411
        },
        {
            "id": "hcc0ne8",
            "score": 0,
            "text": "My whole life you had to get vaccines to go to school. What changed",
            "title_similarity": "0.50728613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcc1vfd",
            "score": 0,
            "text": "Reminder:  Southern states refused to free the slaves.  Then they refused to desegregate.  \n\nRationale:  Anti-federalism\n\nConsequence:  Harsh Action.\n\nLesson:  Southern states are historically harmful to their citizens and refuse to change for any reason except when consequences are enacted.",
            "title_similarity": "0.63795245",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hcc2xj4",
            "score": 0,
            "text": "Whew okay so it has happened as recently as 115 years ago! Things certainly haven’t changed at all since then, I’m sure things will work out exactly the same. Plus the tests are cheap, where I’m at it only costs me about 100 dollars plus the doctors visit and I live in a fairly poor place so it should be an easy fit into most budgets honestly. I’m actually completely relieved that the government compelling you to do something with your personal self won’t become an issue because it happened in 1905 there.",
            "title_similarity": "0.6313379",
            "sentiment_compound": 0.9356
        },
        {
            "id": "hcc2y1h",
            "score": 0,
            "text": "**Stockholm syndrome**\r  \nStockholm syndrome is a condition in which hostages develop a psychological bond with their captors during captivity.\n\nIf you think this is aight but when abortion is on the line you chant \"my body my choice\" - you might be a hypocrite.",
            "title_similarity": "0.5105624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcc4bor",
            "score": 0,
            "text": "\"Subject to police power of the state.\" \n\nThere is no Federal Precedent.  Its the states authority.",
            "title_similarity": "0.61074305",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hcc4na3",
            "score": 0,
            "text": "I guess I'm concerned that this is an overstep for public health purposes. It seems like a slippery slope of appealing a few of our rights for the name of public health. Could you imagine if they enforced a ban on transfats to prevent heart disease or banned opioids to prevent overdoses. \nJust because there was precedent in the past doesn't mean we should re-enactment new ones when it suits us. I mean heck, in the 1940s the US established Japanese internment for public health/ safety.",
            "title_similarity": "0.72965574",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hcc4sqi",
            "score": 0,
            "text": "I think the risk is the current state of the country/world as a whole is in a very volatile and fragile state, with most issues moving further away from middle ground and to the extremes of both sides. I think there are many more middle to conservative people out there that have been blending in, with their liberal associations likely thinking they are liberal. I’m in Los Angeles and recently public schools will require all eligible children be vaccinated by nov. this to me is the turning point as those who have been able to fly under the radar will put their foot down when it comes to (in their eyes) protecting their kids. So I think we will see a lot of ostracizing when they have no choice (again, in their view) but to go public with their views. I don’t think the mandate will automatically make authoritarian regime, but then you have to ask…where does it end? Will anti vax suddenly grow tired and give up? Or will it come out that there was some sinister intentions on the governments part and we do away with the system? I think we are in a bubble that is bursting At the seams with even the smallest thing having the potential to burst it. I’m not sure I’m answering this appropriately for the sub but I think I had to get out.",
            "title_similarity": "0.6004212",
            "sentiment_compound": -0.9537
        },
        {
            "id": "hcc4xqt",
            "score": 0,
            "text": "I can't imagine how antivaxxer's would react to Abraham Lincoln if he were alive today.  He suspended the writ of habeas corpus, yet he's a gold standard for presidential comparisons on both sides of the isle.  Now here we are, with established Supreme court precedent for mandatory vaccinations that didn't lead our country into a totalitarian regime in 1905 and I have the strong suspicion it won't today. \n\nI think people are just addicted to outrage and need something to hitch their wagon on. Personally, I don't see how you can live in constant fear or hyper awareness that at any moment, the government is going to usurp all your liberties.",
            "title_similarity": "0.775884",
            "sentiment_compound": -0.296
        },
        {
            "id": "hccbse9",
            "score": 0,
            "text": "I wouldn’t mind an authoritarian regime as long as the dumb people are the first to be culled",
            "title_similarity": "0.4902395",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hccckbs",
            "score": 0,
            "text": "Yea no precedence ? Ummmm CIVIL WAR sound about right . Absolute idiots . Thats whats coming .",
            "title_similarity": "0.5122577",
            "sentiment_compound": -0.7804
        },
        {
            "id": "hcci8r0",
            "score": 0,
            "text": "In Buck v. Bell (1927) the supreme court upheld the right to forcibly sterilize mentally disabled women for fear that they might have mentally challenged babies and that would be bad for society. Part of the legal justification came for the 1905 vaccine ruling. Some states still have these laws on the books.\n\n  \n\n\nIn 1901 police in NY conducted health raids on tenement buildings at night, kicking in doors and holding people down while they are vaccinated. (Freash Air, 2011, How the pox epidemic changed vaccination rules)\n\n  \n\n\nThere is a slope and it is slippery once the state decides it has the right to take away a citizens bodily autonomy.",
            "title_similarity": "0.7175399",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hccskat",
            "score": 0,
            "text": "I cannot in good conscience agree with the federal mandate. I am 100% pro vax. I will mercilessly mock and shame those who refuse to vaccinate against this disease (if they are able). However, if we agree that bodily autonomy is an important value, then we just have to accept the fact that legislating the issue isn’t they way to resolve it. \n\nYes, being non-vaccinated has negative consquences, but this can be resolved through the increasing social and corporate pressures to require vaccinations for continued employment and participation in public spaces. The Biden administration would be arguably better served attacking the anti-mask mandates and other anti-mitigation measures preventing local governments and businesses issuing out their own restrictions. \n\nNote that I am using some discretion here. Covid is indeed a very serious problem, but it isn’t a population annihilating level existential threat. If it becomes that way due to mutation or whatever, then yeah, a “nuclear option” like mandatory vaccinations at the federal level might be appropriate. I am just very hesitant to jump to that level at this time.",
            "title_similarity": "0.69593906",
            "sentiment_compound": -0.8968
        },
        {
            "id": "hccyefu",
            "score": 0,
            "text": "Vaccinate now, deal with debilitating side effects 10 to 20 years down the road. It's a later problem.",
            "title_similarity": "0.48795235",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hcczb63",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd3bts",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd3t63",
            "score": 0,
            "text": "Bypassing two branches of government and defying a ruling from SCOTUS. It’s already an authoritarian regime…",
            "title_similarity": "0.49257126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcd89tw",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd93ca",
            "score": 0,
            "text": "I’m whole ordeal is stupid beyond belief. People act like children when you need them to do better",
            "title_similarity": "0.4325505",
            "sentiment_compound": 0.25
        },
        {
            "id": "hcda2pr",
            "score": 0,
            "text": "It’s a total Chad move. It rids the federal government of crazy conservatives that are probably acting making the government an evil organization.",
            "title_similarity": "0.50883484",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hcdgn86",
            "score": 0,
            "text": "We already live in an authoritarian regime and Biden is a failed leader. He didn't create a community outreach program for vaccinations in the spring, made a silly deadline(July 4th) hoping it would help him politically instead of caring about what the public wanted. He made vaccinations sound like a cure and didn't discourage the public from traveling. The Media and the Democrats politicized, lied and censored all discussions and concerns about Covid which turned off a large portion of the public. Now Biden wants to blame, ostrasize and bully the unvaccinated for his failures. \n\nThis isn't 1905, the public has access to more information. Biden is not going to easily dig himself out of the mess he created by trying to turn one group of Americans against another.",
            "title_similarity": "0.7036307",
            "sentiment_compound": -0.5744
        },
        {
            "id": "hcazdis",
            "score": 13,
            "text": "I'll start this by saying I'm fully vaccinated as everyone is in our house.  But.....   If there's true authority behind Biden's mandate then he should do his Constitutional duty to pass it through congress so that it actually becomes federal law.  Where or not he can circumvent and override State Constitutional law, via executive order, isn't clear, and would most likely fail when it's inevitably  challenged in the Supreme Ct.  \n\nThe fact that Biden hasn't done this, and continues to make nonsensical statements about his \"power\" doesn't help the situation and indeed makes it worse.   It gives his detractors much power to say such things as he's doing it to detract from his disaster in Afghanistan.   \n\nSo in terms of your CMV, IF Biden is to be in line with the court case you cite, then it's his duty to get it passed through Congress to make it actual federal law.  Else it doesn't apply.",
            "title_similarity": "0.7685596",
            "sentiment_compound": -0.9214
        },
        {
            "id": "hcba4m5",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.0867783"
        },
        {
            "id": "hcav2k1",
            "score": 58,
            "text": "There’s a lot of parroting of this case in 1905 without really understanding what it was and what it said and didn’t say, and what the law was like at the time. As others have pointed out the 1905 case was a state issue, and they did not compel employers to do certain things or make it compulsory to get the vaccine, rather they imposed a penalty for not having it. In addition the disease was different with different factors, and due process and human rights were not what they are today. The decision also said nothing like your summary, it simply said it wouldn't get involved if there was no clear violation of the constitution.\n\nIn other words, that’s an incredibly weak precedent for the mandate Biden just issued. I see no way courts uphold this. Listen to this podcast from a few weeks ago for more interesting info and debate (revolving around an Indiana case at that time): https://constitutioncenter.org/interactive-constitution/podcast/are-vaccine-mandates-constitutional",
            "title_similarity": "0.81808615",
            "sentiment_compound": -0.4149
        },
        {
            "id": "hcb9khu",
            "score": -1,
            "text": "Small pox had a 30% mortality rate, Covid has a 0.1%. That's quite a jump in precedence. So should we also add in mandatory Flu shots? Planter Wart screenings? \n\nSmall Pox was actually a threat to disrupt the country and the economy and hindered our national ability to protect our country. With Covid it's all the draconian preventative measures that's doing the harm, not the virus.",
            "title_similarity": "0.68354475",
            "sentiment_compound": -0.6868
        },
        {
            "id": "hcbd3v6",
            "score": 1,
            "text": "I was pleasantly suprised by seeing civil nuanced conversations in the comments, I like this place.",
            "title_similarity": "0.23645741",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hcbjax5",
            "score": 1,
            "text": "There are always loopholes and exceptions",
            "title_similarity": "0.15745662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcbk0tg",
            "score": 1,
            "text": "That exact same 1905 court case was used as precedent to rule that it's legal to forcibly sterilize 'imbecile' women in 1927. That sounds authoritarian to me. There has been a lot of change since then thanks to human rights advocates. Going back to mandatory vaccines is counter to all the civil rights progress we've made since 1905.",
            "title_similarity": "0.7188486",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hcbnxx6",
            "score": 1,
            "text": "> The court decided that the right to individual liberty in regards to vaccination is not above the rights of the collective. \n\n>You still have the right to not get the vaccine. \n\nThe doublethink on Reddit is astounding. \n\n>If your employer decides they don’t want to keep you around as a result of your refusal, that is the right of the business.\n\nDo you realize the difference between a company choosing not to employ you, and government banning a business from employing you?",
            "title_similarity": "0.81560576",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hcbotcf",
            "score": -1,
            "text": "We are the frog in the pot, slowly being boiled. This is the new world order, the great reset. Everyone needs to give their heads a shake, now - before its too late.",
            "title_similarity": "0.43768734",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hcbrcmu",
            "score": -1,
            "text": "While Jacobson v Massachusetts is indeed the precedent I want to push back on the idea that precedent is automatically the end of the conversation on legitimate use of state power. There are many many examples of horrible precedent that legitimized suffering and human rights violations. \n\nAnd I don’t even need to bring up the low hanging fruit of the Dred Scott decision. The very case you are referring to was used to legitimize the compulsory sterilization of the “unfit” (intellectually disabled) in Buck v Bell. And use of this precedent isn’t even a relic of the past. Texas relied on this precedent in its recent abortion restrictions as well.",
            "title_similarity": "0.76742446",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hcbtfrt",
            "score": -1,
            "text": "I think anti-vaxxers are just scared of needles.",
            "title_similarity": "0.46929756",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hcbuxrz",
            "score": 1,
            "text": "But if your vaccinated then your not in danger so this does not apply.",
            "title_similarity": "0.57768774",
            "sentiment_compound": 0.5667
        },
        {
            "id": "hcbv0lb",
            "score": 1,
            "text": "This isn't a great example.  \n\n1. It upheld the state ability for a mandate, not federal, and that's not a small difference in the structure of the US.  The belief that the State should have greater power on things like this is base don the founding belief that you could still then go to other states if you don't like it.  At the time of this case, there were only 11 states with mandates.\n2. If you look under \"Subsequent developments\" section, this case has absolutely been used for some authoritarian decisions.  The right of the government to sterilize your child due to mental issues is not autoritarian?  Hello?",
            "title_similarity": "0.8267897",
            "sentiment_compound": 0.3085
        },
        {
            "id": "hcbvzoi",
            "score": 1,
            "text": "It could be argued that Roe vs Wade overturned Jacobson vs Massachusetts by establishing a right  of medical privacy from the federal government.",
            "title_similarity": "0.7090925",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hcbzqy6",
            "score": 1,
            "text": "It's simple: If Trump did this he'd have been called a fascist.",
            "title_similarity": "0.5261922",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hcbzw1k",
            "score": -1,
            "text": "Great danger… umm covid has a 99.9% survival rate. Smallpox was 1 in 5 people were dying. All the people on reddit ridiculing and calling anyone stupid for questioning this mandate or not taking a Covid vaccine immediately need to be called stupid and ridiculed for comparing a harsh flu to smallpox. Don’t make apples and oranges comparisons just to satisfy your viewpoint",
            "title_similarity": "0.6523733",
            "sentiment_compound": -0.872
        },
        {
            "id": "hcc0kci",
            "score": -1,
            "text": "I support vaccine mandates in general, but this particular one seems like an overreach.\n\n1. Employers should not have any authority in your personal life beyond that required for job performance.\n2. Though an authoritarian regime is unlikely, there are many lesser evils that are also unacceptable, e.g. employers having access to personal medical information and abusing it. In a power relationship, we don't want to give the one on top unnecessary power.\n3. The restriction to corporations over 100 is based on convenience rather than regard for public safety. The mandate is a way to accomplish a goal that is not being accomplished through other channels. This is what \"overreach\" means: to twist existing systems such as OSHA towards unintended purposes. This has been done in the past but should be resisted every time. It is an antipattern in our democracy.\n\nAs someone who is not a lawyer, I don't know if this mandate can be used as a precedent in the future, but I want to change your view that this mandate is harmless. In it's current form, it seems excessive.",
            "title_similarity": "0.74589765",
            "sentiment_compound": -0.5893
        },
        {
            "id": "hcc2eze",
            "score": -1,
            "text": "To me it feels like an awesome counter-punch to what Texas did because people are going to say this authoritarian BS and scream about their rights and freedoms meanwhile you have Neanderthals in Texas reporting their neighbors or a Doctor for a cash prize.",
            "title_similarity": "0.4840645",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hcc4oz3",
            "score": 1,
            "text": "At this point just a real survival of the fittest. If your too dumb to listen to science and want your freedom enjoy the consequences. Vaccines have been mandatory for a long time but because trump fucked up the response and it's now political it's a big deal",
            "title_similarity": "0.70325077",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hccaygg",
            "score": 1,
            "text": "liberals will log onto reddit and ask people to push their opinions further to the right",
            "title_similarity": "0.47169697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hccgsfz",
            "score": 1,
            "text": "I'm full bleeding heart liberal have my vaccines and think you're a selfish pos if you don't get the vaccine. You should also be put in low priority for hospitals if you get covid without the shot so actual emergencies aren't blocked. That being said this shit ain't ok. Leave it up to businesses to mandate it or individual states. This is spooky. This is like the NSA using child safety as an excuse to have full access to your devices and files. Hate to use the r/conservative term but this is definitely a slippery slope.\n\nIf you're ok with this you're ok with electronic snooping because \"you have nothing to hide\"",
            "title_similarity": "0.7658163",
            "sentiment_compound": 0.8494
        },
        {
            "id": "hccl5oi",
            "score": 1,
            "text": "I’m all for vaccines but this one is a glorified cough drop, you still can get the coof and spread it your symptoms are just better. This leads to more unseen vectors. I’d rather see the illness coming than get snuck up on by it. Also cdcs own minimum for vaccine trials is a 15 year testing period, no telling what these vaccines will lead to later on due to the lack of testing but who cares anymore. I’m personally fine with working from home wearing masks and washing my hands.",
            "title_similarity": "0.7115065",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hccp712",
            "score": 1,
            "text": "It’s a constitutional infringement. A trampling of unenumerated fundamental rights. \n\nAs with abortion, the USSC has decided to let legislators and the will of the people decide, even when there is a constitutional infringement upon the right of choice, as with masks and vaccines.",
            "title_similarity": "0.7180295",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hcctyml",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccukz8",
            "score": 1,
            "text": "Small pox had a fatality rate of 30%. . . COVID has a fatality rate of 1%. The precedent in which we mandated vaccines for smallpox was that it was a global killer - literally wiping out a third of the people who contracted it. \n\nPolio vaccine developed in 1953 was like the vaccines we have for COVID- they didnt stop transmission as a result we moved away from them a decade later which allowed us to finally start combating the issue. Polio also had a very high fatality rate for infants - like 10-15%  fatality rate.  There is a lot of variables at work and what happened in the early 1900s and other vaccines and its not parallel to what is going on now. I dont need to convince anyone you can do your own dam research on the matter - just sick of this fucking argument. Look into it people. Look into smallpox and polio and why we cann attack those differently than COVID. Look into the way those vaccines work in comparison to how the mrna vaccines work. They are not the same.",
            "title_similarity": "0.63416153",
            "sentiment_compound": -0.9827
        },
        {
            "id": "hcd3uwq",
            "score": 1,
            "text": "I think Biden knows his presidency was screwed from the get go. I think he's taking on a \"gotta clean the house\" attitude and legacy be damned. ANYONE who came in after Trump was just doomed. \n\nI admire his willingness to sacrifice everything for this. I just wonder what he will do next. This whole thing is just a dumpster fire.",
            "title_similarity": "0.5318446",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hcd87k2",
            "score": 1,
            "text": "What's next, after this won't work?\n\nCheckpoints and caste systems, good luck to the city folk...",
            "title_similarity": "0.44527653",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hcb33qe",
            "score": 21,
            "text": "Had they mandated masks they would have had my full support.  Masks are just a good practice:  they work and they work on *more* than just one strain of one virus.  OSHA does have the ability to regulate protective equipment.  If they had said, “masks all the time for anyone unvaccinated or face fine/liability” I could go along with that.  If the ruling was, “either enforce good practices (masks, vaccination, testing) in your workplaces OR potentially be held liable for employees who get sick” I would have said a OK to that too.  We already get fined if an employee’s hearing degrades and we get no control over how loud there stereo in their car is or what they do one the weekends.  \n\nMandating medical treatment and testing is a bridge too far.  Others have made the bodily autonomy argument so I’ll focus on the testing side.  These are fines - the cost to test and time spent getting tested are expended resources.  It’s not, “vaccine or test or fine”, it’s “vaccine or fine”.  The Feds are trying to make employers into their vaccine police for free by imposing costs arbitrarily (yes, 100 employees is arbitrary) in the hopes that lost profits drive pressure from employers onto employees who can now be worried about losing their jobs even if they’re risk profile is no greater than a self employed electrician\n\nIt’s fine to bring up court precedent but let’s be honest about how little it really takes for one or two states in 250 years of history to make a supportive ruling.  Even the Supreme court’s decisions are questioned in terms of accuracy they certainly don’t equate to a moral *reality*.  When the Supreme Court crushes this in a few months, will you be satisfied with the new truth?\n\nPeople own their bodies.  Collective goals do not usurp that without the strongest of cases and the effectiveness of this vaccine along with the low mortality rate of the virus just doesn’t justify it.  You don’t have a explicit right to live free of risk and impose your risk mitigation on these.  Banning drunk driving is trivial compared to a vaccine mandate.  If someone knowingly attempts to expose you to the virus I don’t care if you, or the police on your behalf, shoot them because that is an *attack* but I wouldn’t put someone out of a job if they wanted to wear a mask forever instead of getting vaccinated.",
            "title_similarity": "0.599089",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hcaz8y4",
            "score": 8,
            "text": "Just because something has happened before doesn’t make it okay",
            "title_similarity": "0.3459114",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hcabou9",
            "score": 215,
            "text": "If I'm not mistaken, Jacobson v Massachusetts upheld that **states** have the authority to determine and implement mandatory vaccination laws for constituents in their territories. Had this been just California mandating vaccines just for Californians or Texas mandating vaccines only for Texans, I would agree with your argument.\n\nExcept, what Biden has done is instructed the federal government to mandate vaccinations for a huge number of people (80M+) across the entire United States which is a completely different scenario. People are calling it government overreach because what Biden is doing is usurping and exercising a power which has historically only belonged to States.\n\nBiden's vaccine mandate will be determined on a state-by-state basis and if he wants it to be effectively enforced, it looks like he will need to get the states on board with his plan. What he can't do, however, is just ram through a mandate and expect everyone to comply.",
            "title_similarity": "0.7939369",
            "sentiment_compound": 0.9314
        },
        {
            "id": "hcbh6rm",
            "score": 2,
            "text": "Are people not worried about what this is going to do to the economy and especially small businesses?\n\nAll of these big companies are going to follow through with the mandate, and just fire the non-vaccinated to save money on the testing. If you don't like it, Amazon can just hire another worker or replace you with a robot.\n\nWhat are the small businesses (greater than 100 employees isn't a large company) going to do in the states where vaccination rates are low? If 50%+ of their employees aren't vaccinated hypothetically, what can they do beyond pray that their employees take the vaccine willingly? If they lose employees to the policy, there at a disadvantage and have a smaller pool of new employees to hire. If they keep un-vaccinated employees, they have to pay for weekly testing and might not be able to afford it and still be competitive.",
            "title_similarity": "0.6194953",
            "sentiment_compound": -0.4552
        },
        {
            "id": "hcbrws4",
            "score": -2,
            "text": "Aren’t vaccines freely available for everyone? Why mandate it? If you get the vaccine nothing to worry about right? How are these droves of dumb anti vax going to harm anyone if those willing to get the vaccine simply do so?",
            "title_similarity": "0.75154144",
            "sentiment_compound": -0.696
        },
        {
            "id": "hcchkiz",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd8x05",
            "score": 2,
            "text": "It won’t by itself but Biden is clearly the most authoritarian president the US has seen in a long time.  Ranging from his COVID policy, trying to block evictions without the authority, removing “political enemies” form non-political appointments, etc.\n\nHe’s also grossly incompetent as we saw with his disastrous handling of Afghanistan.  He’s trying to run a victory lap after directly claiming things wouldn’t happen that did happen.  There were kids falling from airplanes, hundreds wounded and dead, etc as a direct result of his incompetence and poor planning.  He left Americans to die so he could meet a political deadline.  And the best part is that he lied the entire time, claiming the events were entirely unpredictable and that not a single person or source of intelligence suggested the situation could play out that way.  \n\nThe OP of this thread is also wildly Ignorant.  Why should only unvaccinated people have to get tested weekly?  This is pure anti-science.  It doesn’t account for natural immunity from infection which is just as good if not better than vaccination, and seems to completely ignore the fact that vaccines don’t last forever and people can still get infected and transmit.  It also ignores the fact that some vaccines develop less immunity, such as moderna generating over double the antibody response as other brands.  An unvaccinated person could quite literally have a stronger immunity than a vaccinated person.  So why aren’t we requiring antibody testing or negative tests for vaccinated people?  Because it isn’t based on science, it’s based on power.",
            "title_similarity": "0.6209753",
            "sentiment_compound": -0.9898
        },
        {
            "id": "hcbdhk4",
            "score": -4,
            "text": "I wonder if 20,000 reported 11,000 confirmed deaths from mRNA vaccines happened back then. Or 55,000 hospitalizations, I wonder if they said the science shows 1 dose, sorry I meant 2 cough cough 3 and a booster and more next year. Yea the science didn’t support our lies in the beginning, do you need a map to find the goal post. We have brochures at the propagandastand down that hole on the far left!",
            "title_similarity": "0.6661836",
            "sentiment_compound": -0.1759
        },
        {
            "id": "hcbdkq5",
            "score": 3,
            "text": "Jacobson v Massachusetts upheld the right of the *states* to enforce vaccine mandates. The court decided this based on the policing powers of states, which the federal government does not have save for federal crimes. \n\nBiden’s order does not create any federal crime as the executive of the law cannot create the crimes he enforces. Since there isn’t a crime, the federal government does not have the police powers that the courts cited in Jacobson. \n\n*Maybe* if Congress passed legislation on a national mandate, it would stand. But because there is no precedent for overriding governors to enforce public health mandates through labor laws, this will not hold up in court. \n\nMuch like the eviction moratorium, Biden knows this won’t hold up. He’s just hoping to scare enough people into getting vaccinated before the courts strike it down. Similarly, with the eviction moratorium he was hoping the court battle would take long enough that renters could find other options if they get evicted after the moratorium got struck down. \n\nKnowingly violating the constitution just to buy yourself some time is wrong, in my opinion. Especially considering that the President swears under oath to uphold the constitution. We’ve impeached presidents for less.",
            "title_similarity": "0.88408923",
            "sentiment_compound": -0.9795
        },
        {
            "id": "hcbg0wc",
            "score": 4,
            "text": "The supreme Court has overturned itself in the past which is weird but has definitely gotten favorable decisions.\n\nRemember in 2020 when Biden said he wouldn't mandate the vaccine.\n\n\nAlso it's definitely not a vaccine per the CDC's own definition of what a vaccine is (seeing as how it's widely known and publicized that you can take the vaccine and still get covid and transmit it)\n\nPer the CDC\nVaccine: Listen media icon[MP3]\nA suspension of live (usually attenuated) or inactivated microorganisms (e.g. bacteria or viruses) or fractions thereof administered to induce immunity and prevent infectious diseases and their sequelae. Some vaccines contain highly defined antigens (e.g., the polysaccharide of Haemophilus influenzae type b or the surface antigen of hepatitis B); others have antigens that are complex or incompletely defined (e.g. Bordetella pertussis antigens or live attenuated viruses).\n\nAlso the subject of authoritarianism keeps coming up in government because usually the entire government would be on the ruling president's side. I mean think about it, they appoint everybody. And everybody they appoint says green light.\n\nThis is why all modern-day presidents appoint federal judges so quickly. In modern day the law basically doesn't matter because we are no longer getting decisions based in law on a lot of levels, we're getting political decisions based on whatever side that federal judge happens to lean.",
            "title_similarity": "0.8357391",
            "sentiment_compound": 0.887
        },
        {
            "id": "hcbbqtp",
            "score": 4,
            "text": "This is a pretty clear violation of federalism.\n\nThe constitution reserves for the states any power that is not explicitly given to the federal government. As a result, only states have the power to enact health mandates.\n\nI see a lot of people saying that Biden can do this and they point to Jacobson v. Massachusetts. But that doesn’t apply here- Jacobson v. Massachusetts decided that **states** have the power to make health mandates, whereas as Biden is in the federal government.\n\nI expect this to be brought to court and found that Biden is overstepping his authority here, and subverting a power reserved for the states.",
            "title_similarity": "0.82874984",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hcb3rl1",
            "score": 35,
            "text": "Allowing Biden or any president for that matter to impose fines on people for something that isn't against the law is already a huge power reach. \n\nI doubt that it will actually be enforceable for this reason, but the fact that nobody in the government has struck him and his madate down yet is a pretty big red flag that this is a president that they want to set at best.\n\nOn top of that more and more power is being taken from the states and given to the federal government. A lot of people are mad at SCOTUS in the last 2 years for taking very few cases but they're the only major government players keeping more federal precedents from taking more power. But thats really the ONLY example that i can find of the federal government self regulating.",
            "title_similarity": "0.6965552",
            "sentiment_compound": 0.7469
        },
        {
            "id": "hcayr0k",
            "score": 21,
            "text": "There are a ton of important differences here from Jacobson v Mass.\n\nFirst, Jacobson was based on a law passed by a state legislature. That doesn't mean that the federal government has this power, and it certainly doesn't mean that this power is in scope of executive orders. If the federal congress had passed this law, it would be way too less authoritarian than a single man deciding to mandate it when he knows that he couldn't get it through congress.\n\nThe other part of this that is extremely troubling is the mechanism. The idea that the president can order that all American workers must do X or become virtually unemployable seems incredibly abusable. It's a new backdoor into mandating all sorts of draconian policies that could never make it through congress.",
            "title_similarity": "0.7831955",
            "sentiment_compound": -0.1513
        },
        {
            "id": "hcb99vx",
            "score": 8,
            "text": "Quoting that case is a false equivalencey. It did not say that mandatory vaccines are constitutional, it said that *compulsory* vaccines did not violate religious freedom. By compulsory, it means that there was a $5 fine enacted if you didn't take the vaccine. That's $155.12 when accounting for inflation. A $150 fine is absolutely not comparable to having your ability to work or enter public spaces taken away entirely.\n\nLet's be real, that's what this is about. For now it's only required to work at larger companies, but claiming that similar policies won't expand to everyday life is asinine. Anybody who predicted even this policy was called a conspiracy theorist less than a year ago, but they were right. You can't definitively say that it won't expand. Already I see people every day saying thag if you're unvaccinated you shouldn't be allowed to participate in society. It's only a matter of time before more mandates are crammed down.\n\nAlso, that court ruling is contradicted by [McFall v. Shimp](https://graduateway.com/mcfall-v-shimp-right-to-bodily-security-2/), which ultimately says that an individuals bodily security is a priority regardless of if it endangers another human, i.e. a persons right to refuse vaccination is more important than another's safety. The judge specifically spoke about how if the government has the ability to overrule an individual's own bodily autonomy that it was an incredibly slippery slope.",
            "title_similarity": "0.8151964",
            "sentiment_compound": -0.1846
        },
        {
            "id": "hcbf75m",
            "score": 9,
            "text": "How does it make sense that unvaxxed need weekly testing when being vaccinated doesn’t stop you from contracting and spreading covid? So shouldn’t everyone still need to be tested weekly regardless of vax status? Make it make sense.",
            "title_similarity": "0.69051254",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hcawpc6",
            "score": 26,
            "text": "The 1905 case was a $5 fine. Not restricting peoples movements, job opportunities or access to services. I am sure most vaccine hesitant people would prefer a $5 fine over what is currently being proposed.",
            "title_similarity": "0.63984925",
            "sentiment_compound": 0.7511
        },
        {
            "id": "hcb9lu7",
            "score": 13,
            "text": "The issue with these arguments is that it continues to confuse the entire concept of a Union or a Republic. The US is not a \"Country\" with \"Regions\" or \"Provinces\". The states are not administrative subdivisions of the federal government. The states are semi-autonomous sovereign entities by themselves, and the federal government's purpose is to regulate relations BETWEEN states, not within states. When North Carolina wants to make a pact or agreement with South Carolina they don't have to ask the federal government, but the feds do have the power to limit those agreements so that N and S Carolina don't have disproportionate power that is a detriment to other states. However, if N Carolina wants to do something within its own state then the feds have zero control over that. ZERO! And this is why the feds cannot force state police to collaborate with ICE. This is why the FBI cannot tell the local police to step out of the way in a murder case where all parties are sole members of that state and doesn't involve any interstate matters. But it is also why the FBI can and will take control the moment that an abducted child is taken across the borders of that state. It is why drugs are still market as fully illegal in the federal government but states are able to legalize drugs to their content. But also why they can not allow for said drugs to be transported across state lines lest the federal police powers get involved. It is why insurance companies ask the state for permission to change their fees and offerings, but the moment that the insurance company sells in multiple states then they are subject to federal regulations as well. It is why some states have income tax and some don't, instead of just the feds charging taxes and spreading to states as necessary. It is why when a state entity doesn't comply with federal mandates the most that the feds can do is coerce them by denying federal moneys to go to them. The federal government doesn't fine a state school for violating federal mandates, they can only deny the school federal funds. Because the school is under state control and they answer to the state, not to the feds.\n\nWith all that said, the federal government has no business telling anybody solely within their state what they are allowed to do or what they must do unless it directly affects interstate matters. With that said, it can create regulations upon Tysons Foods which produces Chicken in West Virginia but ships it to Virginia and tell them that to continue interstate commerce that they must have 100% vaccination. But it can not tell a restaurant that buys food locally and serves customers locally that it has to do anything. The local government on the other hand, can tell both entities what they need to or can't do.\n\nSo now to the authoritarian angle. If a state becomes tyrannical and authoritarian then that's fine. The people in that state have the power to achieve such a culture. But what they can not do is hinder matters of interstate regulation, meaning that they will not be able to prevent people from leaving their state. And they also cannot force other states to do business with them directly. That authoritarian state will swiftly crumble. This is one of the checks and balances that the founders left us with. However, if the federal government starts usurping the autonomies of the states and starts imposing direct control of intrastate matters, then this creates a body that has appointed itself as the overseer of autonomous states. When the states start having to ask the federal government for permission to do something within their own borders then they have given up their autonomy. And then all states fall to the mercy of the feds. This is an erosion of that ultimate checks and balances that we had in place specifically to prevent this.\n\nThere is a reason why the saying that 'we have a republic...if we can keep it' is so prevalent in this point in time. The federal government has increased it's own powers over states continuously for centuries. We even had a civil war to keep these autonomies in place, but the states that wanted autonomy lost and the ones that wanted union won. It was a win for the people and for the future, but it was the start of the fall of the federation and the growth of the union state. This is not the same as authoritarianism but it is a step in that direction.\n\nIn government formation you have different levels. I'll stay with the larger scale models:  \nAutonomous, Confederation, Federation, Union State, Authoritarian, Tyranny. Each one flowing to the right carries a higher level for propensity of abuse of power. This doesn't mean said abuse will happen, but it does mean that it is a more likely probability. The UK is a Union State and they're not tyrannical. But they also have more power over the people concentrated at the very top, and where the leaders are more encumbered by what they owe each other than what they owe the people.\n\nAnyway, I'm veering from the topic. In the order it was mentioned that the OSHA would issue fines of up to $14k per violation. But try to understand the regulatory powers of the OSHA is to prevent that companies place their employees at risk in the conduct of their employees as it pertains to their business. This is why the OSHA might demand that an employer not allow a worker to walk around a construction site without a hardhat, but they cannot fault the employer if the employee brings a poisoned sandwich to lunch and gives it to the coworker that is sleeping with their wife. These are matters that occur at the workplace but not within the scope of the business interests. Similarly, placing restrictions on health care corporations makes sense since they are in the business of health. But placing regulations on a company that sells bottle caps to prevent one employee from inadvertently getting another one sick is an overreach. Especially when still to today there has been zero success in adequately defining exactly where an infection was actually transmitted. \n\nIn essence, this is a power that the federal government does not have but is giving itself power to enact anyway. If the federal government wants this power there is a way to go about it. It is through Congress, but more importantly it would come from a constitutional amendment. However, as a society we have continuously allowed the feds to give themselves power by not challenging them, or by turning the Judicial Branch into yet another political entity. But that's a different topic and it's why Republicans voted so hard just to keep the SCOTUS as an entity that will protect the checks and balances that we had in place to keep our Republican Federation in place without shifting further towards centralized corruption.",
            "title_similarity": "0.75650495",
            "sentiment_compound": 0.2661
        },
        {
            "id": "hcbf321",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcbjvpt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcbniwq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcbscmk",
            "score": 1,
            "text": "Unfortunately, we no longer live in a civil society that values critical thinking skills…",
            "title_similarity": "0.43360937",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hcc37q1",
            "score": 1,
            "text": "The only people that would try to change your view are ignorant and wrong.",
            "title_similarity": "0.42320654",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hcc5f9o",
            "score": 1,
            "text": "“Well ordered society” - now I understand why the American south can’t comply",
            "title_similarity": "0.41510803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcc5vfz",
            "score": 2,
            "text": "It won’t send us into an authoritarian regime because the authoritarian regime already started. Remember when only parlar got removed for the Jan 6th insurrection, and not twitter? Remember how Instagram legally listens and records every noise you make, even while you sleep? Remember how the SEC supported massive crimes of fraud in wall street in 2008… then 2021? Weve been in the authoritarian-left regime for quite some time now.",
            "title_similarity": "0.73283446",
            "sentiment_compound": -0.3899
        },
        {
            "id": "hcc62jg",
            "score": 2,
            "text": "The Massachusetts decision allowed the imposition of a small cash fine, not taking away someone's livelihood.\n\nBy the OPs logic, a speeding violation by any employee would be grounds for shutting down a business.",
            "title_similarity": "0.5905773",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hcc6wx9",
            "score": 2,
            "text": "Just the use of \"some\" in your title tells me you haven't looked into anything",
            "title_similarity": "0.4348084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcc7slf",
            "score": 1,
            "text": "I agree, but I believe precedence is a singular noun and the phrase you are looking for is \"multitude of precedents\".",
            "title_similarity": "0.38819516",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hcc7xkb",
            "score": 2,
            "text": "Something something 10th amendment, something something separation of powers.\n\nThere is no precedent for an *executive order* to do such a thing at the *federal level*.",
            "title_similarity": "0.56434596",
            "sentiment_compound": -0.296
        },
        {
            "id": "hcc81jl",
            "score": 5,
            "text": "From Jacobson v. Massachusetts:\n\n“If a person should deem it important that vaccination should not be performed in his case, and the authorities should think otherwise, it is not in their power to vaccinate him by force, and the worst that could happen to him under the statute would be the payment of $5.”\n\nI would gladly pay the modern equivalent ($100) one time... The problem with Biden's plan is that I have to pay $100 a week and consent to having a swab shoved up my nose each time I pay.\n\nAlso wasn't Jacobson v. Massachusetts later used as the precedent for eugenics sterilization laws? Kind of a bad look if you ask me.",
            "title_similarity": "0.7117288",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hcc8jzg",
            "score": 2,
            "text": "What next they are going to make me put a silencer on my pistols",
            "title_similarity": "0.3687868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcc8kbs",
            "score": 1,
            "text": "It’s just a fucking vaccine. People need to stop acting like we’re suddenly being stripped of our rights and being held prisoner",
            "title_similarity": "0.5793338",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hcc9odj",
            "score": 1,
            "text": "Would not the right to privacy contradict this? If a right to privacy protects someone’s ability to get an abortion, how would it not protect someones ability to refuse the vaccine? In simple terms, the right to privacy is the right to be left alone so would it not also prohibit the alternative option of mandatory testing?",
            "title_similarity": "0.7419456",
            "sentiment_compound": -0.647
        },
        {
            "id": "hccaf4t",
            "score": 1,
            "text": ">. The court decided that the right to individual liberty in regards to vaccination is not above the rights of the collective\n\nThis couldn't be said any better or any less, mutual rights overcome singular rights",
            "title_similarity": "0.77662337",
            "sentiment_compound": 0.743
        },
        {
            "id": "hccbct1",
            "score": 1,
            "text": "States probably can, but what's far from clear is that the executive can have an agency mandate a business process that actually mandates an individual action like this.\n\nA lot of people claim that vaccine mandates are commonplace, and they really aren't.  Most in the past have been quite limited in scope, and this one is not.\n\nIt's certain that OSHA will be sued on this, and it's far from clear where this goes.",
            "title_similarity": "0.7355336",
            "sentiment_compound": 0.7218
        },
        {
            "id": "hccckxq",
            "score": 1,
            "text": "In 1865 some people were considered 3/5ths of a person. Laws and the constitution were meant to be changed.",
            "title_similarity": "0.40217885",
            "sentiment_compound": 0.0
        },
        {
            "id": "hccdec7",
            "score": 2,
            "text": "The USA is an authoritarian regime. Just look at how they treat whistleblowers. Look at the number of people we have in prison. We've been bombing and killing brown people the world over since 9-11 in the war on terror. Any rights we had disappeared twenty years ago when we let our elected reps choose fear (the Patriot act) over a more nuanced response.",
            "title_similarity": "0.49894145",
            "sentiment_compound": -0.9524
        },
        {
            "id": "hccdiix",
            "score": 1,
            "text": "Except for the fact this isnt actually a vaccine.  If it was, my brother, who is vaccinated, wouldn’t have just gotten it.  It’s more like the flu shot.\n\nAlso, H5N1 is deadlier.",
            "title_similarity": "0.7537003",
            "sentiment_compound": -0.0183
        },
        {
            "id": "hcceb3o",
            "score": 1,
            "text": "Private business until politics",
            "title_similarity": "0.2697428",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcceib7",
            "score": 1,
            "text": "Well it could potentially save the life of many Republicans, Talibangelicals and Trumpers who would otherwise naturally be filtered out of the gene pool. They could angrily avenge their saviors by going on wild murderous rampages and eventually seize power. Then they would have their authoritarian regime.",
            "title_similarity": "0.48887774",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hccg0jd",
            "score": 1,
            "text": "The US has already been an authoritarian regime forever. Half the population was barred from voting until the 1900s, we had slavery and Jim Crow, COINTELPRO, and these days we have more prisoners per capita than anyone else.",
            "title_similarity": "0.48507756",
            "sentiment_compound": -0.8553
        },
        {
            "id": "hccgcar",
            "score": 2,
            "text": "You cite Jacobson vs. Massachusetts, but I don't think that supports a Federal mandate.\n\nThe primary issue in Jacobson vs. Massachusetts was whether the State of Massachusetts could, using its police power, compel compulsory vaccination of its citizens^(1). However, the opinion states very early on:\n\n>The authority of the State to enact this statute is to be referred to what is commonly called the police power -- a power which the State did not surrender when becoming a member of the Union under the Constitution. Although this court has refrained from any attempt to define the limits of that power, yet it has distinctly recognized the authority of a State to enact quarantine laws and \"health laws of every description;\" indeed, all laws that relate to matters completely within its territory and which do not, by their necessary operation, affect the people of other States. According to settled principles, the police power of a State must be held to embrace, at least, such reasonable regulations established directly by legislative enactment as will protect the public health and the public safety.\n\nThis runs into the Tenth Amendment:\n\n>The powers not delegated to the United States by the Constitution, nor prohibited by it to the states, are reserved to the states respectively, or to the people.\n\nHowever, here this is more direct: the Supreme Court had held that **the States** can compel vaccinations based on their police power, but Jacobson vs. Massachusetts does NOT grant that power to the Federal Government. \n\nFurthermore, towards the end of the opinion, it reads:\n\n> The safety and the health of the people of Massachusetts are, in the first instance, for that Commonwealth to guard and protect. They are matters that do not ordinarily concern the National Government. \n\nIn short, if today Massachusetts were to have a COVID vaccine mandate, then Jacobson vs. Massachusetts shows that Massachusetts has that right. I would personally support such mandates on the state level. But that does NOT mean the Federal Government has that right over all citizens, though it does have that right in certain areas (such as federal employees).\n\nI can easily see Jacobson vs. Massachusetts being cited to throw out parts of vaccine mandate, as is confirms this is the right of the States. \n\n^(1) I note that the end of the opinion carves out exceptions in certain cases. \"[W]e are not inclined to hold that the statute establishes the absolute rule that an adult must be vaccinated if it be apparent or can be shown with reasonable certainty that he is not at the time a fit subject of vaccination or that vaccination, by reason of his then condition, would seriously impair his health or probably cause his death.\" The court then said this was not related to this case. It would be interesting to see how this is treated in a more modern case on the subject.",
            "title_similarity": "0.8192178",
            "sentiment_compound": 0.9905
        },
        {
            "id": "hccgkwc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcchdh4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcchr2i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcchyn7",
            "score": 1,
            "text": "Wasn't that in regards to Smallpox which had a death rate of higher than 0.59% among the most vulnerable?",
            "title_similarity": "0.42054644",
            "sentiment_compound": -0.7264
        },
        {
            "id": "hcci8ya",
            "score": 1,
            "text": "Who gives a shot about what the Supreme Court says.  \n\nAt this point we do not recognize their authority.  They have no ownership over any individual.  Period.  End of story.",
            "title_similarity": "0.51893944",
            "sentiment_compound": 0.291
        },
        {
            "id": "hcck9u1",
            "score": 1,
            "text": "You really think repugs will read and believe this?",
            "title_similarity": "0.28168276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcckghz",
            "score": 6,
            "text": "I'm going to try change your view on why its not fascist. Pfizer paid millions of dollars to the biden campaign. Therefore it's in Biden best financial interests to push for mandatory vaccines to raise stock higher. This isn't the start of some authoritarian novel. Its just normal paid politics.",
            "title_similarity": "0.70027393",
            "sentiment_compound": 0.8939
        },
        {
            "id": "hccl6l0",
            "score": 1,
            "text": "Perhaps in a time when we weren't already Authoritarian as fuck, with another \"democratic nation\" having already done this thing, I'd agree. But at this point, liberty is under attack from every single angle and being vigilant is better than being slaves.",
            "title_similarity": "0.6506286",
            "sentiment_compound": 0.705
        },
        {
            "id": "hcclgqf",
            "score": 1,
            "text": "As a Brit, I wouldn't want to see something like that here but I recognise that the issue has become so polarised in America and vaccination rates are so low in some areas that it needs to be done to curb the pandemic.",
            "title_similarity": "0.64952904",
            "sentiment_compound": -0.4539
        },
        {
            "id": "hccllhr",
            "score": 5,
            "text": "All I can say is look at Australia. That is not a good position.",
            "title_similarity": "0.38405952",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hccm34z",
            "score": 1,
            "text": "I don’t understand how it can be mandated so quickly without other areas of testing. They tried to find multiple other cures/ailments for polio before that vaccine was mandated. The same goes for other vaccines that are mandated today. Why does there have to be so many questions when it comes to covid and it’s origins or cures. If it was as deadly as they say it is, wouldn’t they be truth be simple?",
            "title_similarity": "0.6472322",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hccmbfl",
            "score": 2,
            "text": "Oh it won't? So whats to stop them from implementing a national vaccine passport, or a Chinese style social credit system? Biden spoke like a dictator last night and you'll never change my mind on that.",
            "title_similarity": "0.7025341",
            "sentiment_compound": 0.4582
        },
        {
            "id": "hccn6ax",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccofiq",
            "score": 1,
            "text": "Whole lot of coulds and shoulds and \"traditionally\"s in here",
            "title_similarity": "0.16062002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hccogel",
            "score": 1,
            "text": "the guise of workplace safety…\n\nI can assure you my safety at work is impacted by others actions, including vaccination status.",
            "title_similarity": "0.42228428",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hccov8u",
            "score": 1,
            "text": ">You still have the right to not get the vaccine.\n\nWhen there is an ultimatum, you no longer have the \"right.\" For healthcare facilities, public or private, you are mandated to get vaccinated without option of getting tested.",
            "title_similarity": "0.75206274",
            "sentiment_compound": -0.296
        },
        {
            "id": "hccq2h4",
            "score": 1,
            "text": "I would argue that both sides of the current political spectrum are more extreme than 1905 and this could be due to internet changing how this world works.",
            "title_similarity": "0.47437996",
            "sentiment_compound": -0.34
        },
        {
            "id": "hccqrjn",
            "score": 1,
            "text": "What I take from this is Americans fight over who they want as president for the last 5½ years and then say that they'd rather local and state government have the power.\n\nLol",
            "title_similarity": "0.54070824",
            "sentiment_compound": 0.128
        },
        {
            "id": "hccqvwn",
            "score": 3,
            "text": "First of all, this was a case regarding states rights. Further, it also protected the forced sterilization of woman, forced lobotomies, and eugenics. I’m sure most of us will agree these were severely harmful practices. Thus, the 1905 precedent had to be vastly reassessed.",
            "title_similarity": "0.5946064",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hccqzmj",
            "score": 1,
            "text": "I read something like 2/3 of those vaccinated are whites. It stands to reason this mandate will have very negative effects on African Americans and Hispanics. Republicans don't traditionally play the race card but.... If they did....",
            "title_similarity": "0.6103103",
            "sentiment_compound": -0.3104
        },
        {
            "id": "hccr18w",
            "score": 2,
            "text": "Jacobson vs. Massachusetts was for a smallpox outbreak and was only mandated for individuals over the age of 21 (who were subject to a $5 fee if they refused to get one, not with unemployment).  \n\nThe current pandemic is small potatoes when compared to the impact smallpox had on the world: approx. 300 million people died from smallpox in the 20th century (when Jacobsen vs. Massachusetts took place) whereas  4 million people have died from the current pandemic. \n\nObviously it would be ideal if we can prevent further deaths, but creating a federal mandate (as opposed to state mandates) will only push people further away from considering the vaccine. People who are on the fence need time to gauge the situation and see what the long-term effects of the vaccine will be - they have that right. \n\nSo yes, Jacobson vs. Massachusetts didn’t change the US into a big authoritarian regime; but giving our current government the ability to do so certainly would. Not to mention the pushback that will occur.",
            "title_similarity": "0.71323496",
            "sentiment_compound": 0.9362
        },
        {
            "id": "hccrbcr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccrogh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccrxqa",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccsgtx",
            "score": 1,
            "text": "Honestly, im all in for job hunting now that higher positions are opening up. Might make more money because of this rofl.",
            "title_similarity": "0.2884376",
            "sentiment_compound": 0.8113
        },
        {
            "id": "hccspkn",
            "score": 1,
            "text": ">\tIt will not send the US into some authoritarian regime.\n\nThere has been “vaccine hesitancy” in many European countries but now near to the extent and level of America. With the capital riot in January, perhaps BLM at a stretch it’s pretty obvious that division and intolerance is growing in America and whilst Bidens current attitude isn’t authoritarian yet (what you’re saying), it could still escalate further for any number of covid or non covid reasons.\n\nA black guy getting shot for wearing a face mask could start a riot that leads to lockdowns, curfews and police on the street.",
            "title_similarity": "0.6819572",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hccthlb",
            "score": 3,
            "text": "This was a state (MA) enforcing a mandate, presumably enacted by the legislature. \n\nThe executive branch of the federal government doesn’t have the authority to enforce a vaccine mandate. That would be the purview of Congress, and even then it would be a stretch under the Commerce Clause.",
            "title_similarity": "0.7364516",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hccu67j",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccv5fz",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccvk52",
            "score": 1,
            "text": "This is the government literally persuading you with fake accounts writing shit about this... Nobody is okay with this mandate... The survival rate is so high they won't even show it on CNN lol",
            "title_similarity": "0.6180103",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hccvnbw",
            "score": 1,
            "text": "My issue is enforcement. If the federal government just wants to not give a business X item because of not upholding mandates, imo that is fine. The federal government punishing businesses or citizens is another issue as a whole.",
            "title_similarity": "0.6667178",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hccwily",
            "score": 3,
            "text": "Rule by decree is NOT the American system of governance.",
            "title_similarity": "0.47300696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hccwin5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccws3h",
            "score": 1,
            "text": "People and people with diseases cross state lines making this a federal issue just like the FBI takes jurisdiction of criminal cases that cross state lines.",
            "title_similarity": "0.5306494",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hccwthf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccx0ch",
            "score": 1,
            "text": "Seriously as a person who lives in South America, The US really looks like a first world country with a third world population. The amount of paranoic thinking that comes out of the US is really imppresive",
            "title_similarity": "0.5091851",
            "sentiment_compound": 0.2682
        },
        {
            "id": "hccx0tv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccx4l2",
            "score": 1,
            "text": "So youre fine with a president overuling state power (which is unconstitutional) with threats of war? What about those who will die from the vaccine?",
            "title_similarity": "0.6978538",
            "sentiment_compound": -0.8715
        },
        {
            "id": "hccxlxk",
            "score": 1,
            "text": "It's more about, \"You can't tell me what to do!\" I'm proud of Biden and others who are on the right side of history. Real true leaders make hard unpopular decisions. Weak lame losers crumble under the pressure of weak fearful people.",
            "title_similarity": "0.5031073",
            "sentiment_compound": -0.9041
        },
        {
            "id": "hccxto5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hccyis8",
            "score": 1,
            "text": ">that is the right of the business.\n\nIs it also the right of the business not to hire vaccinated people?  No, that would be segregation. You see, we have come a long way since 1905.",
            "title_similarity": "0.7893208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hccz402",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcczr5e",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcczrmt",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcczyh7",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd005a",
            "score": 1,
            "text": "How many mandates would you say slips a government into a dictatorship? 3? 20?\n\nIt's 1",
            "title_similarity": "0.49758738",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcd04yh",
            "score": 1,
            "text": "We should just start UBI and have it tied to whether you are vaccinated or not. 🤷🏼‍♂️",
            "title_similarity": "0.5408288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcd0jq6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd0nbn",
            "score": 1,
            "text": "Doesn't matter. There's the idiocy of the Supreme Court to not take up the challenge to undo the dumbass lower court's opinion of overturning it.",
            "title_similarity": "0.6694279",
            "sentiment_compound": -0.2439
        },
        {
            "id": "hcd0sj6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd116s",
            "score": 1,
            "text": "The people crying about authoritarianism would absolutely love to install there chosen leader as an authoritarian ruler so I dont really care what the latest phony sobfest is about.",
            "title_similarity": "0.5342889",
            "sentiment_compound": -0.1159
        },
        {
            "id": "hcd138k",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd1902",
            "score": 1,
            "text": "Would you feel the same way if the states had chosen to legalize abortion and then the federal government came in to make it illegal?",
            "title_similarity": "0.6545884",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hcd1o87",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd2ao5",
            "score": 1,
            "text": "The Jacobson case is for a states rights to do something (in that case enforce a health order). It is irrelevant to the President’s rights to issue the same thing. The President’s rights/powers are limited by another section of the Constitution entirely.",
            "title_similarity": "0.7399727",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hcd2epz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd2ymw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd31kw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd3c81",
            "score": 1,
            "text": "Court is going to say Congress has to pass it.",
            "title_similarity": "0.43719655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcd3cua",
            "score": 1,
            "text": "Considering what OSHA exists for, it would be inherently against their own purpose to not impose a vaccine mandate. Most people also want to feel safe at work. If you have a problem with OSHA as an entity, then this conversation isn’t really for you. But, if you understand that OSHA does more good than it does over reach, then it’s hard to deny that this type of regulation is exactly what they are here for. OSHA holds every employer in the U.S. to its own standard; \n\n“The general duty clause of the OSH Act officially reads: \"Each employer (1) shall furnish to each of his employees employment and a place of employment which are free from recognized hazards that are causing or are likely to cause death or serious physical harm to his employees; (2) shall comply with occupational safety and health standards promulgated under this Act.\"\n\nThe act also states: \"Each employee shall comply with occupational safety and health standards and all rules, regulations, and orders issued pursuant to this Act which are applicable to his own actions and conduct.\"7\n\nThis was a great decision, in my opinion, to move us in the direction of getting the hell out of this pandemic. \n\nIn addition, OSHA has been used as the enforcement arm of all of these mandates since the beginning of the pandemic, and this is no different.",
            "title_similarity": "0.682377",
            "sentiment_compound": -0.1741
        },
        {
            "id": "hcd3huc",
            "score": 1,
            "text": "Government shouldn't be deciding what I do with my body. They do enough of that as it is and those antiquated court cases come from a really fucked up period of targeted ethnic cleansing and abuse of those with mental health needs. \n\nThat said, you're a moron if you don't get the vaccine voluntarily.",
            "title_similarity": "0.7071052",
            "sentiment_compound": -0.92
        },
        {
            "id": "hcd4kpg",
            "score": 1,
            "text": "The decision of Roe vs Wade from 1973 was ignored recently despite several recent appointees claiming to believe in precedent, so I don’t really have much faith in a ruling from 1905.",
            "title_similarity": "0.7007123",
            "sentiment_compound": 0.1935
        },
        {
            "id": "hcd4msr",
            "score": 1,
            "text": "Smallpox-30% death rate, far more contagious than COVID\nCOVID- less than 1%\n\nBig difference.\n\nIf we had a smallpox outbreak or Ebola outbreak there would be a HELL of a lot fewer hesitant folks. Also, if you already recovered from smallpox you wouldnt need the vaccination unlike the crap they are pushing about COVID. The reason natural immunity isn’t accepted isn’t because it’s less robust, it’s because you can’t charge for it.",
            "title_similarity": "0.748702",
            "sentiment_compound": -0.8961
        },
        {
            "id": "hcd5agu",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd5jbd",
            "score": 1,
            "text": "They also ruled it was ok to forcefully sterilize females that where in state mental hospitals.",
            "title_similarity": "0.51478815",
            "sentiment_compound": 0.296
        },
        {
            "id": "hcd5mnm",
            "score": 1,
            "text": "The US is already an authoritarian country, from foreign policy to its domestic police force and incarceration rate. Instead of worrying about it becoming something it already is. Take the damn vaccine so you and your family have less chance of dying.\n\nIf you are scared of an authoritarian gov. Get some class consciousness and do something about it.",
            "title_similarity": "0.7281061",
            "sentiment_compound": -0.7425
        },
        {
            "id": "hcd6aub",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd6iad",
            "score": 1,
            "text": "Very simple. Fed boys protect and regulate interstate commerce. If you want a vaccine mandate talk to your governor. We’re supposed to be 50 independent states under the feds. Not one state divided up by names alone",
            "title_similarity": "0.7056934",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hcd6ta1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd71ou",
            "score": 1,
            "text": "You said that’s the right of a business to fire you but aren’t businesses being forced to do it or get fined by the government?",
            "title_similarity": "0.6039071",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hcd7gcd",
            "score": 1,
            "text": "I wonder if the justices will give consideration to this portion \"...under the pressure of great dangers...\" Current deaths in US are 658k out of 40.8M cases or a 1.6% mortality rate. At what rate is it considered a great danger to society?",
            "title_similarity": "0.48915017",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hcd8stg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd8xml",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd90kw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd9576",
            "score": 3,
            "text": "This crap post got 10k thumbs up? COVID is far, far less deadly than smallpox and the small pox vaccine actually prevent the spread of disease...The mRNA gene therapy shot does NOT prevent the spread of covid. So tell me again how this is in the interest of protecting others?",
            "title_similarity": "0.7446092",
            "sentiment_compound": 0.1989
        },
        {
            "id": "hcd9isc",
            "score": 2,
            "text": "What is the “multitude if precedent” you speak of? You named one court case from 1905 that speaks little on governmental power and more to State’s power.",
            "title_similarity": "0.67711467",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcd9rtn",
            "score": 1,
            "text": "It upheld states rights not federal mandates",
            "title_similarity": "0.5311248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcd9wmr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcd9y2x",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcda189",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcda43s",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcdaxe4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcdb0w2",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcdbpcn",
            "score": 1,
            "text": "\"authoritarianism\" is a made up term used by people who don't understand democracy and prescribe to the dubious notion known as tyranny of the minority.",
            "title_similarity": "0.39153042",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hcdbucz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcdc7f3",
            "score": 1,
            "text": "Look, this country has been mandating a variety of different vaccines for decades. Ever wonder why ya don't get polio? Or measles? And then there's idiots in the military who will \"leave if they force them to take the vaccine\", while staying silent about the other required vaccines people in the military are required to get. They're all idiots, and they all talk like idiots. No, we will not become an authoritarian regime, we will become overall healthier and maybe THEN we can go back to normal.",
            "title_similarity": "0.70745444",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hcdc82g",
            "score": 1,
            "text": "Most businesses won't enforce it and you can't constitutionally force them to. People who really believe that this law is really going to to through are idiots.",
            "title_similarity": "0.6019049",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcdcljw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcdcms3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcde146",
            "score": 1,
            "text": "Good ol' Supreme Court also. Where the hell where you when we need you, just like OSHA wanting to step up now?\n\nMy issue is more with the fact the Supreme Court could collectively give two shits about what the collective U.S. actually thinks. They only step in when things start affecting their bottom dollar and bigger businesses.\n\nThat's what's so upsetting about the pandemic, it wasn't ever about caring about the people or our needs and actual safety. Only when Businesses started to truly hurt from this, did we see such a push like this from everyone.\n\nAs someone who worked in the service industry before and during the pandemic, OSHA is awful. We were shown very clearly, that making sure things like burgers and coffee were still available, are far more important than our well being..\n\nI'm just dead tired of all this underhanded strategic political bullshit.",
            "title_similarity": "0.6484786",
            "sentiment_compound": -0.4466
        },
        {
            "id": "hcdecrk",
            "score": 2,
            "text": "Yeah I mean..\nHaving an authoritarian regime that forces you to inject a product.. And it is a product designed to forever require you top it up..\n\nAnd requires you carry papers to travel. Or be allowed admittance to government venues. \n\nI'm thinking the irony is the vaccinated should be \"B\"  class citizens required to carry papers proving they are up to date.\n\nIf you contacted covid and your body beat the virus. You have the best immunity you can get. And should never be forced to inject anything into your body, ever.\n\nIf you are afraid be afraid. But your fear does not give you any rights over my body.\n\nTake one moment and imagine the mrna produced unforeseen byproducts in a process that has been ongoing and being refined for millions of years. We didn't even know what DNA was 60 years ago..  Opps it causes leukemia or liver cancer after 5 - 10 years.\n\nSorry world.. Our bad..\n\nWhat you have done for future generations is ensure a succeptability to this class of virus and a dependancy on a corporate product to ensure survival....",
            "title_similarity": "0.72627056",
            "sentiment_compound": -0.8466
        },
        {
            "id": "hcdg2x6",
            "score": 2,
            "text": "While case law is certainly important especially to someone like myself who is studying to go into law enforcement, it's not the divine arbiter or ethics. There has been quite a few SCOTUS decisions where it was objectively wrong such as the Dred scott case as it flat declared that states don't have the authority to govern themselves on the issue of slavery, ignoring the reason why slavery was even orginally allowed by the Constitution (which was as a compromise), and the explicit racist logic that it is better to declare your fellow man property than allow him to exercise his natural rights with explicitly the right to keep and bear arms being mentioned by one of the majority justices.",
            "title_similarity": "0.7010664",
            "sentiment_compound": -0.9059
        },
        {
            "id": "hcdg509",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07470693"
        },
        {
            "id": "hcdgyps",
            "score": 1,
            "text": "But a business can't fire based off race and sex etc? I'm naturally unvaccinated.",
            "title_similarity": "0.62240565",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hcdlb9l",
            "score": 1,
            "text": "What about everyone who’s up in arms over the abortion ban in Texas?  This can be seen as “my body, my choice” issue as well by many.",
            "title_similarity": "0.43699005",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hcdldxg",
            "score": 2,
            "text": "People always bring up Jacobson v Massachusetts like it’s some clever sleuthing on their part and the rest of us are rubes. That case concerned state mandates. Don’t conflate it with a federal mandate. People do this all the time. I’m vaccinated and I’m conservative. I encourage people to get the vaccine because it’s as harmless as the childhood vaccinations I had to get in order to go to school. I have no problem with mandates in principle, but the feds have no constitutional authority to impose one. It must be struck down, and I suspect it will be. There are separation of powers problems here, at a minimum.",
            "title_similarity": "0.79565036",
            "sentiment_compound": -0.8296
        },
        {
            "id": "hcdlfat",
            "score": 1,
            "text": "How about you this: because unlike measles and small pox vaccines, the covid vaccine cannot sterilize people from the disease. So the comparison on measures and policy is likewise irrelevant.",
            "title_similarity": "0.77393615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcdlgar",
            "score": 1,
            "text": "I don’t give a fuck what a court system says. They don’t get to legislate what anyone gets to do with their own body.",
            "title_similarity": "0.5146874",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hcdon3g",
            "score": 2,
            "text": "Big difference this time. We have malevolent forces on each side playing us against each other. It started out a lie, and has only gotten worse. It’s not this in and of itself. When you look at the macro picture of what is happening, it’s the straw that broke the camels back.",
            "title_similarity": "0.5190699",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hcdpdvv",
            "score": 1,
            "text": "Most of us that don't have smooth brains are painfully aware of this.",
            "title_similarity": "0.17819947",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hcdqbh1",
            "score": 3,
            "text": "So the business can fire someone for non-compliance and that’s “the right of the business” but if a businesses wants to exercise its right to not require vaccinations they’ll be fined and shit down?\n\nHow do you reconcile these two contrasting ideas?",
            "title_similarity": "0.5624498",
            "sentiment_compound": -0.7882
        },
        {
            "id": "hcdqx1w",
            "score": 2,
            "text": "Definition of precedent:. Some fucking moron made a decision decades ago and for some stupid reason people think they are stuck with it.",
            "title_similarity": "0.47723532",
            "sentiment_compound": -0.8357
        },
        {
            "id": "hcdrhxs",
            "score": 2,
            "text": "I simply ask this. If Trump was president and issued the exact same mandate...would you still be supporting it?",
            "title_similarity": "0.52735794",
            "sentiment_compound": 0.4404
        }
    ]
}