{
    "CMV: Being in the military doesn't make you a hero. It make you a strong-arm enforcer of corporate interests\n I am a military veteran. I served during the Vietnam war. I see nothing  heroic in military service. I see mostly kids from disadvantaged  socio-economic backgrounds joining the military to escape their dead end  lives. And the military offers that, there is no doubt. I served and  I'm glad I did. The service helped me out of poverty, but I had no  illusions about who and what I was serving. We haven't been involved in  an existential war since the 1940s. All of our actions after that, and  most of them before, have been to protect and promote the American  corporate hegemony. We want docile trading partners, that's it. If you  are in the military your only job is to keep the spice flowing. You  don't protect Americans. You protect American business interests abroad.": [
        {
            "id": "hd8kees",
            "score": 1,
            "text": "/u/Zappavishnu (OP) has awarded 4 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/pq5tob/deltas_awarded_in_cmv_being_in_the_military/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.55025315",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hd82zjw",
            "score": 38,
            "text": "The military doesn’t have to act to serve a purpose. Its mere existence deters violence from other nations. \n\nIf you don’t believe me, let’s shut down the military completely and see how long it takes North Korea to bomb the US",
            "title_similarity": "0.66134477",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hd81gw2",
            "score": -2,
            "text": "I understand where you are coming from, but the reality is... if we had no military, we'd have no power. Someone with power would come and take control of our country/government. \n\nIs the military often used to push agendas or help certain people profit? Absolutely. Does that mean volunteers to help defend our country are strong-arm enforcers of corporate interest? No. \n\nIf we need military (we do)... it's voluntary, it's risking your life for others.. then yes, those people are \"heroes\" imo.",
            "title_similarity": "0.6980305",
            "sentiment_compound": 0.9607
        },
        {
            "id": "hd8py6l",
            "score": 16,
            "text": ">You don't protect Americans. You protect American business interests abroad.\n\n\nPeople are always saying things like this, as if it’s businesses vs Americans. you do realize that if businesses suffer, everyone suffers right?  Businesses are intrinsically linked to how well off everyone is. Just look at 2008 for an example, businesses fails and leaves particularly the middle and lower classes worse off. At other periods, businesses have done quite well and most people are much better off because there is more money to go around. \n\nSo the military may not actually be actively directly protecting Americans, but they are definitely indirectly protecting them, (as well as passively but others have already addressed that).",
            "title_similarity": "0.69919264",
            "sentiment_compound": 0.3556
        },
        {
            "id": "hd82jdv",
            "score": 667,
            "text": "The best way I have ever heard it explained by a service member “I’m serving so you don’t have to”. If it weren’t for people like him joining the military, we would all be subject to the draft. In my mind, he is a hero. He is doing the shitty job and taking the responsibility so others do not have to risk their lives for the security of the country and it’s interests.",
            "title_similarity": "0.7714819",
            "sentiment_compound": 0.8982
        },
        {
            "id": "hd82sxa",
            "score": 110,
            "text": ">We haven't been involved in an existential war since the 1940s.\n\nThe United States has **never** been involved in an \"existential\" war. \n\nNot being \"existential\" does not automatically make a conflict \"in corporate interests.\" Fighting existential threats is also not mutually exclusive with defending corporate interests. Fighting existential threats is literally a corporate interest. \n\n>All of our actions after that, and most of them before, have been to protect and promote the American corporate hegemony\n\nWhich corporation did you fight for in Vietnam?\n\n>We want docile trading partners, that's it. If you are in the military your only job is to keep the spice flowing.\n\nFor the *country*, not any corporation. You aren't keeping the spice flowing to prop up any particular company. American companies rise and fall all of the time. \n\n>You don't protect Americans. You protect American business interests abroad.\n\nNot mutually exclusive. Anyways, what were the business interests in Iraq and Afghanistan? Kosovo? Syria?",
            "title_similarity": "0.8533044",
            "sentiment_compound": -0.8065
        },
        {
            "id": "hd8bvtz",
            "score": 14,
            "text": "What about Korea?  Because of the war we fought there 52 million people don't have to live in shithole North Korea.\n\nWe went there to fight the communists, why we fought them isn't really that important especially since there wasn't just a single reason.\n\nI think Korean war vets are heroes, they risked their lives to fight North Korea to a stalemate.  Given what a shithole North Korea became, and how little the war itself had to do with it's sharp decline into shithollery, I think those men deserve some credit.",
            "title_similarity": "0.8432089",
            "sentiment_compound": -0.9518
        },
        {
            "id": "hd8sq5b",
            "score": 35,
            "text": "Honestly? You're both wrong. How do I know this? This: \n\n> We want docile trading partners, that's it. \n\nis as much a fundamental misunderstanding of US foreign policy as thinking we're the ultimate heroes. We don't want anyone docile, we just don't want them to be conniving douche-canoes. I mean if we wanted docile partners then Japan wouldn't have any say in where we want to build bases and the French would just go along with everything we say instead of complaining every five seconds and acting like they're still an empire. \n\nThe truth is somewhere in the middle. They're both heroes in their own right ***and*** they do protect business interests. One does not make the other false, this is not a zero sum game. A person can die heroically defending an oil rig that will not only benefit a corporation but the nation they're serving as a whole. They protect Americans by protecting our interests as well. That's just a catch all phrase for anything that isn't a direct action to save lives. After all, ***everyone*** loses if a city is destroyed. \n\n>All of our actions after that, and  most of them before, have been to protect and promote the American  corporate hegemony\n\nWe've tried the exact opposite of what you believe we have. It only turned out worse for not only us but the world. It's personally very annoying to me when Redditors have the balls to tell us we are the world's police because god I wish we were. Then we could have stopped the multiple world wars, since WWI and WWII were not the first world spanning wars, that we keep getting dragged in to. Especially between you France, Britain, and Germany. Being non-aligned and isolationist is not something that works in any place other than in imaginations. So here we are. Having to deal with a world so violent and hypocritical that we can't be neutral and we can't stop others from killing each other because of things so stupid like a prince pissing on the wrong patch of land 2,000 years ago. \n\nSo really, believe what you want. It doesn't change the nature of the beast. A beast that doesn't fit in to the cage of corporate hegemony, nationalism, globalism, or every other fancy term a suit in an air conditioned room tells you explains the world.",
            "title_similarity": "0.65432155",
            "sentiment_compound": -0.9853
        },
        {
            "id": "hd84akj",
            "score": -1,
            "text": "You're sorta right.\n\nThose corporations that people love to vilify. Are the reason why people have a much higher standard of living in America compared to a lot of places in the world. It is by far the richest big country in the world (population over 120mil). It is by far the richest country with such a diverse ethnic make up. Most richer countries have heterogenous societies. Look at the demographics of any nordic country.\n\nHaving our military be the strongest in the world definitely helps our economy. It gives us an edge in many negotiations. Lots of companies do business with us even though they could make more pure $ from working with other Russian or Chinese firms. Simply because they want to be on US's good side. \n\nOur Military = A huge reason why we live well\n\nDoes it make you a hero? I dunno I suppose not. The military itself is a hero. You're just a part of it.",
            "title_similarity": "0.50495887",
            "sentiment_compound": 0.9888
        },
        {
            "id": "hd90iaq",
            "score": 0,
            "text": "Finally someone said it. Your not a hero cuz you wanted to go kill brown people for uncle sam. Your actually *drum roll please* a dick. Who can’t think for himself. And you know what prisons and homeless camps alike are filled with? Veterans. Oh you mean teaching them nothing but how to shoot a gun didn’t set them up for life?!? Shocking.",
            "title_similarity": "0.7092807",
            "sentiment_compound": -0.9422
        },
        {
            "id": "hd9hw0d",
            "score": 0,
            "text": "Even assuming everything you are saying is true. Haven’t you thought about what happens when the “spice” stops flowing? That’s bad for everyone.",
            "title_similarity": "0.41524094",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hd8470n",
            "score": 1,
            "text": "Can I just disagree with the second portion of your view? I don't think anyone thinks military automatically means hero. \n\nI was just talking to someone who joined the Air Force so that they could pay for his medical school. During that time, they flew him out to assist in medical treatment for people around the world. He wasn't a strong-arm enforcer of corporate interests. \n\nAnother person I was talking to last week joined the military because he was kicked out of his house and was homeless. He joined just the basic army because he didn't know what else to do. They trained him to listen for emergency signals for evacuation efforts. Again, it doesn't seem like he joined to be a hero, it also doesn't seem like a strong-arm enforcer.",
            "title_similarity": "0.80703664",
            "sentiment_compound": 0.0976
        },
        {
            "id": "hd89lj6",
            "score": -1,
            "text": "I feel like this is too large of a group of people to make such a definitive statement about. I’m sure there are people in the military who are assholes and there are people who are heroes. Thousands of people have sacrificed and risked their life for a purpose. So that sacrifice automatically gets negated based on the legitimacy of the purpose??\n\nDo the military service members have more input on the conflicts we get involved in than the standard voting American? I don’t think they should be blamed for us getting involved in wars we shouldn’t have ever been in. And regardless of the purpose they’re fighting for, it’s hard to deny that there have been heroic acts by members of the military. Sacrificing one’s life for the life of a friend or a complete stranger, makes that person a hero in my book.",
            "title_similarity": "0.6971271",
            "sentiment_compound": -0.327
        },
        {
            "id": "hd8gfu5",
            "score": 97,
            "text": "I agree with the spirit of what you are saying, but only to a certain extent. The oligarchy is real and a huge problem, but one that’s a problem for the entire world. I also think it isn’t a monolith and the oligarchy isn’t homogeneous across the whole planet.\n\nTo counter your point of view, I’d highlight the fact while US hegemony has brought forth evil and some destruction, it’s also brought forth a period of significantly reduced global conflict. It’s allowed for the global proliferation of technology and increased access to the sun of all human knowledge through the internet and such. The US is an Empire and even though it’s an imperfect one, I believe the US and the West would look very, very different if it weren’t for the US maintaining a certain level of stability.\n\nPeople seem to significantly undervalue our global military presence and capability of the US military. Not just presence, but ability to deploy and project force in very short order. It’s relatively unseen in human history.",
            "title_similarity": "0.537717",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hd8443r",
            "score": 7,
            "text": ">We haven't been involved in an existential war since the 1940s.\n\nWhen was the US's existence as a nation ever been threatened and we went to war to fight for it?\n\nIf you're referring to WW2, we entered the war because we were attacked.  Being attacked once doesn't equate to the existence as a nation was threatened in any meaningful way.  We weren't there yet and never got that far.",
            "title_similarity": "0.8051092",
            "sentiment_compound": -0.975
        },
        {
            "id": "hd8s0u3",
            "score": 49,
            "text": "[deleted]",
            "title_similarity": "0.023540208"
        },
        {
            "id": "hd83ma7",
            "score": -3,
            "text": "While I agree that being in the military doesn’t automatically make someone a hero, saying that it makes the individual a strong arm enforcer is going quite far. \n\nMost people in the military go because they feel they don’t have a better option in their life. That doesn’t make someone a hero, but they’re also not a villain for joining the military.",
            "title_similarity": "0.7558176",
            "sentiment_compound": 0.9069
        },
        {
            "id": "hd8pntu",
            "score": 0,
            "text": "It's true it's been a while since we've had to fight a truly existential war, but at the end of the day isn't that in part thanks to a strong military and many many volunteers who help keep our military strong?\n\nI think your premise is correct in part and the US isn't perfect, but I also think much of the prosperity the world currently enjoys is due to the fact that the US is able to deter even worse strong-arm aggressors throughout the world. Would the general state of peace and democracy seen in developed countries throughout the world be the same if China or Russia became the single most dominant military superpower?\n\nI'm curious, do you believe that all soldiers in all countries are also simply enforcers of corporate interests, or do you see this as particularly an American problem?",
            "title_similarity": "0.7419441",
            "sentiment_compound": 0.9562
        },
        {
            "id": "hd9sqdl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hd827km",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hd83clc",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hd8hyvr",
            "score": 0,
            "text": ">We want docile trading partners\n\n>Job is to keep the spice flowing. \n\nIs not it better for the world if everyone is just docilly trading with each other?",
            "title_similarity": "0.42478126",
            "sentiment_compound": -0.2746
        },
        {
            "id": "hd8nwbc",
            "score": 4,
            "text": "It's interesting that you recognize that many disadvantaged people join the military to escape their dead end lives, but also according to your title those people are 'strong-arm enforcers of corporate interests.\" How is that fair to those people? I would agree that joining the military doesn't make you a hero but I also think it's unfair to criticize people that join their military for something they have no control over (the military's goals/interests).",
            "title_similarity": "0.75649923",
            "sentiment_compound": 0.6542
        },
        {
            "id": "hd9a798",
            "score": 0,
            "text": "I think there are times and moments when the us military are seen as a great force for good... imagine being in afganistan recently.. while many do hate us.. quite a few hate the talaban far more and are currently wishing not only for the protections but the general life of america. while it is true we largely are fighting only successfully to keep our own security.. through doing that we are creating a world of stability that lives under our general rule of law.. or at least enjoys some semblance of it.. where in comparison much of the world is suffering greatly under extremely oppressive rule.\n\n russia, china, north korea, much of the middle east... much of the world.. is not free.. that is a truth that america has recently lost sight of.. but i personally as a citizen who did not and would not serve for some of the same reasons you say you aren't a hero.. still would consider you one. not for any specific act. and not specifically for serving in the us armed forces.. but for generally going to fight for the side that represents freedom. yes, no we have not (and likely will not) save the planet from dictators(heck our previous president even sided with many of them).. but that doesn't mean it was all for nothing. I for one salute not only your service but also your candor. people who think you get a free pass as soon as you put on camo are full of shit.",
            "title_similarity": "0.62816584",
            "sentiment_compound": -0.1275
        },
        {
            "id": "hd9fk4o",
            "score": 0,
            "text": "Bro, I was on the military and I did jack shit. No deployments. I enlisted to pay for school and chose an MOS that was unlikely to see combat. I'm not a hero. Quit thanking me for my service.",
            "title_similarity": "0.8263701",
            "sentiment_compound": -0.8891
        },
        {
            "id": "hda347v",
            "score": 0,
            "text": "Fellow vet here brother.  I think you are discounting how important \"business interest\" is to your fellow citizens.  The US is the largest and most profitable economic monster the world has ever seen.  Look at GDP and avg relative income of Americans vs world.  How is not protecting the \"corporate hegemony\" not protecting Americans?  You want to see pandemonium in the streets?  Stop the influx of the thousands of commodities that our economy depends upon to function.  \n\nThis pandemic has revealed just how vulnerable our global economy is due to JIT inventory manufacturing philosophy.\n\nLately...the last 20 years or so due to WOT, we've been nation building fools.  Bush, Obama, Trump fools to think we can accomplish what Arabs won't do for themselves.  I hope we've learned our lesson with this Afghanistan imbroglio. \n\nBut if you want the US to become some isolationist ostrich and let the rest of the world burn, so be it.  But I think we are all better off with our foreign policy acting in our (and our businesses) best interest.",
            "title_similarity": "0.6038131",
            "sentiment_compound": 0.9626
        },
        {
            "id": "hdaocee",
            "score": 0,
            "text": "You can see in real time what happens to a country with a shitty military.",
            "title_similarity": "0.40251142",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hdapdnb",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hd8umfj",
            "score": 8,
            "text": "I'm **very** anti-military but I don't think it's correct to demonize the average soldier. No one (or very few) join up specifically to \"serve corporate interests\", they join because they genuinely believe they are serving their nation, and I would argue that even if they aren't properly utilized that is still partially their role in society. \n\nIt's easy to criticize service members during a time when bloodless warhawks are forcing them to wage war in the middle east for seemingly no reason other than to claim oil reserves. What's important to remember is that if the war were a just one, like WW2 or the American Civil War, it would be the same people fighting it, and they signed up knowing that their life could be placed on the line for that very purpose.\n\nI do think it's a valid argument to say that information is available to us today that shows how the military is not what we think it is, and how they merely establish \"docile trading partners\", to use your words. But I don't think you should discount the very strong effect that propaganda plays in convincing us otherwise - the school system, the national anthem, every military or superhero movie in existence, etc. If you aren't *looking* for reasons to dislike the military, you're unlikely to find them.\n\nIn summation, I consider myself anti-military but pro-veteran. Obviously there are counterexamples of the latter part like those Marines who got outed for killing civilians, but by and large I think service members are just doing their best to serve their country.",
            "title_similarity": "0.7959048",
            "sentiment_compound": -0.8966
        },
        {
            "id": "hd86h2y",
            "score": 4,
            "text": "Being g in the military doesn't make someone a hero. It also doesn't make anyone a corporate enforcer. Hersheys isn't ordering our troops to do anything, our civilian government is. The civilian government that is fairly elected by the American people. Lots of people don't want to admit it, but ultimately the American people are responsible. \n\nThe wars we've fought has also been about anti communist hegemony and to keep the status quo, not trade. Trade is a side benefit from the much bigger strategic goal. For all the US bashing on reddit, most of our conflicts have been morally and practically justified if you set aside the \"US bad\" knee jerk reaction.",
            "title_similarity": "0.8021233",
            "sentiment_compound": -0.9239
        },
        {
            "id": "hd8k3o4",
            "score": 1,
            "text": "The military doesn’t get involved in corporate interests. \n\nThat’s law enforcement. Police. \n\nAfghanistan is not a corporate interest. Nor is Iraq.\n\nKorea and Vietnam were and are not corporate interests. They were ideological wars. Most wars have been for ideology.\n\nThe best chance for a credible corporate interest war would be desert storm. Even that’s shaky.\n\nThis doesn’t mean we haven’t had seemingly pointless wars, but they aren’t corporate interests.",
            "title_similarity": "0.7593009",
            "sentiment_compound": -0.6068
        },
        {
            "id": "hd8p4jt",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hd8qvw7",
            "score": 1,
            "text": "*government interest. The employer of the military is the government, not corporations. Government pays corporations and service members for partaking in the military.",
            "title_similarity": "0.6418736",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hd8ughy",
            "score": 1,
            "text": "As a veteran I know hero’s come in all shapes, sizes, and careers. I know I wasn't one because of what I did but I also know the civilians and politicians of my country are just as much responsible for the orders I'm given as I was for following them. There are no innocent men as I see it just a long line of compliance. We suck united not divided.",
            "title_similarity": "0.7640033",
            "sentiment_compound": 0.0634
        },
        {
            "id": "hd90ueu",
            "score": 1,
            "text": "Drafted? Shit sucks and I respect your service. Volunteered? Shit sucks but you went to work.",
            "title_similarity": "0.5602733",
            "sentiment_compound": -0.6608
        },
        {
            "id": "hd986d8",
            "score": 1,
            "text": "Based and two time MoH recipient, Smedley Butler pilled. \n\n&#x200B;\n\n>I served in all commissioned ranks from Second Lientuentant to Major General. And during that period, I spent most of my time being a high class muscle-man for Big Business, for Wall Street and for the Bankers. In short I was a racketeer, a gangster for capitalism. \n\n\\-General Smedley Butler.",
            "title_similarity": "0.49248993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9bawm",
            "score": 1,
            "text": "Your completely right it's the biggest honey pot in the history of mankind.",
            "title_similarity": "0.3041897",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9cnno",
            "score": 1,
            "text": "Nailed it! (6 years USN / SS)",
            "title_similarity": "0.14603657",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9dlpt",
            "score": 1,
            "text": "Never change this view because it is correct.",
            "title_similarity": "0.31687242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9e2l1",
            "score": 1,
            "text": "Nice hear this from an american",
            "title_similarity": "0.16738635",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hd9eopx",
            "score": 1,
            "text": "War is a racket - Major General Smedley Butler",
            "title_similarity": "0.2740677",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hd9g3ii",
            "score": 1,
            "text": "Right on. \n\nAfganistán and otter modern wars are for the sole purpose of feeding the machine and fill pockets of military complex and corporations. \n \nThe US government and military have a way of creating and monetizing citizens FEAR.",
            "title_similarity": "0.55212426",
            "sentiment_compound": -0.7456
        },
        {
            "id": "hd9labb",
            "score": 1,
            "text": "I agree with you but this is a difficult topic to discuss around some people. Do you know of any organizations that work to spread this message?",
            "title_similarity": "0.3471474",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hd9q0h5",
            "score": 1,
            "text": "You all would fall for a wolf in wolves clothes wouldn't you. This post isn't by a veteran and for sure not a Vietnam vet. Protecting Americans is what the military does and yes it protects our interest too. You like those cars, phones, computers, houses don't you. Being able to type on here and talk some dirt too I bet you enjoy that. SO yeah it protects everything you silly gooses. Protects Americans, and our interest because that is what keeps this machine going. You all want it to crash over some kind of false ideology of a utopia you'll get the Taliban running it or communist china running it, then you all be crying like babies when you are beaten and put in prisons. You guys are going to give up your freedom and you will regret it when you can not get on the internet anymore because its a bad things says the government. Just a small point.",
            "title_similarity": "0.6886264",
            "sentiment_compound": 0.9481
        },
        {
            "id": "hd8g9dn",
            "score": 454,
            "text": "I guess it's a question of intentions versus result. Imagine you see a child screaming from the window of a burning building and attempt to run in and save them, but it turns out you had unknowingly ran onto a film set with a controlled fire and firefighters on the premises and were never actually in danger. The film was rolling and they caught what you thought was your real attempt to save this child and used it in their viral marketing for the film. Are you not a hero, despite your purest intentions and selfless act, because it all turned out to not be real? \n\nYou may have had no illusions of what you were getting into when you joined the military. That doesn't mean that everybody who joins sees it as clearly as you.",
            "title_similarity": "0.6590506",
            "sentiment_compound": 0.4639
        },
        {
            "id": "hd8ifda",
            "score": 6,
            "text": "Well yes, Robert Heinlein says it best, force is the ultimate power from which all others are derived. Those those with them largest force command the most respect. \n\nBut I have to ask. You seem to say being in the military was good for you. But then say others shouldn't join the military. Care to explain your reasoning? You also seems to think that the open market principal is a poor choice for a country. But if the country doesn't defend its business interests, how can it expected to dominate the free market? I'm not making a claim on wether the interests are good or bad, this is merely to request you expand your reasoning. And what would you have us do, become global isolationists? While I much prefer that idea, I think others would disagree. So how can we defend and promote our country, and our values abroad, in countries that have a separate moral framework, In your opinion.",
            "title_similarity": "0.6857135",
            "sentiment_compound": 0.9643
        },
        {
            "id": "hd8utfl",
            "score": 8,
            "text": "So when the military is doing aid and relief missions to disaster areas are they still strong-arm enforcers of corporate interests?",
            "title_similarity": "0.5560565",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9qmwb",
            "score": 2,
            "text": "Not gone lie, you had me in the first half.",
            "title_similarity": "0.27611685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9yeg2",
            "score": 2,
            "text": "As career Marine Smedley Butler put it...\n\nI spent 33 years and four months in active military service and during that period I spent most of my time as a high class muscle man for Big Business, for Wall Street and the bankers. In short, I was a racketeer, a gangster for capitalism. I helped make Mexico and especially Tampico safe for American oil interests in 1914. I helped make Haiti and Cuba a decent place for the National City Bank boys to collect revenues in. I helped in the raping of half a dozen Central American republics for the benefit of Wall Street. I helped purify Nicaragua for the International Banking House of Brown Brothers in 1902-1912. I brought light to the Dominican Republic for the American sugar interests in 1916. I helped make Honduras right for the American fruit companies in 1903. In China in 1927 I helped see to it that Standard Oil went on its way unmolested. Looking back on it, I might have given Al Capone a few hints. The best he could do was to operate his racket in three districts. I operated on three continents.",
            "title_similarity": "0.63009405",
            "sentiment_compound": 0.8828
        },
        {
            "id": "hd8qbe0",
            "score": 3,
            "text": "I feel you have a bigger issue with those making the decisions at the top, not the rank and file that have to follow those orders.",
            "title_similarity": "0.41150358",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hd9q0xj",
            "score": -3,
            "text": "This is the most high schooler take I’ve ever heard in my life.",
            "title_similarity": "0.35018396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd8ju85",
            "score": 9,
            "text": "Army veteran 2013-2018. I mostly agree with you, certainly that serving in the military doesn't make someone a hero, or even good. I served with a lot of shit bags. That being said, I also think the military has changed a lot since the Vietnam era. \n\nFor starters, and this is a painful realization for me, I actually trust most military officials more than civilian leadership, especially political leaders. A vast majority of the officers I served with were pretty critical of the US war machine and how it is used. You saw this with veterans speaking out about abandoning the Kurds and certain groups of Afghanis. I think we also saw this with Gen. Milly's attempt to smooth over mounting hostility with China. I saw some other things while in the Army which showed me how the military has our backs more than the civilian population. After becoming a civilian again, I believe this now more than ever.\n\nI also agree that we have cynically used our military to maintain an economic status quo. I don't really think the military is to blame for this and I am seeing a bit of resentment because of it. I don't resent the Army nearly as much as I resent out politics and apathetic civilian population.",
            "title_similarity": "0.7769183",
            "sentiment_compound": -0.7566
        },
        {
            "id": "hd863uo",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hd8hsqi",
            "score": 1,
            "text": "What about ww2 or ww1, i would say the non german/japanese side were heros or we would all be talking german and hailing the mighty god that is hirler, a bit like the kim john family",
            "title_similarity": "0.5386324",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hd8k8si",
            "score": 1,
            "text": "I’d love to see your points towards “corporate interests”. If it’s simply oil, that’s clearly a military supply chain interest, as our oil reserves deplete and fracking gets more and more revealed as cancer causing/environmental awful. \n\nThere is a reason the Middle East has been proxy wars between the US and China/Russia vs the US between localized corporate interests. It’s bc oil reserves have strategic military value.",
            "title_similarity": "0.5620391",
            "sentiment_compound": 0.2585
        },
        {
            "id": "hd8mwir",
            "score": 1,
            "text": "Sir you got drafted these kids volunteered to serve for some this was there Dream job",
            "title_similarity": "0.43687332",
            "sentiment_compound": 0.25
        },
        {
            "id": "hd8sy15",
            "score": 1,
            "text": "Not in the USCG. I do search and rescue missions every day I go to work. I have assisted and rescued American life's in the course of my duties. I don't think of myself as a hero but many people who have been saved by the USCG think we are.",
            "title_similarity": "0.7878418",
            "sentiment_compound": 0.8422
        },
        {
            "id": "hd8w0ug",
            "score": 2,
            "text": "my mom from s.korea would definitely consider the UN action in korea (and the USA leading the landing at incheon) as a heroic thing. i'm here today because of the korean war and additionally ww2 pushing the japanese out of korea\n\n> protect and promote the American corporate hegemony\n\ni might be ignorant but i'm not sure what corporations the korean war benefited. maybe contractors and war machine producers, is that what you mean?",
            "title_similarity": "0.67895687",
            "sentiment_compound": -0.908
        },
        {
            "id": "hd8x8sy",
            "score": 1,
            "text": "I don’t think being in the military necessarily makes anyone a hero. For most people, it’s just a job like everyone else. However, that doesn’t mean the feats that some of the troops accomplish are not heroic. I wouldn’t say that the military is an arm for corporate interests. It is actually America’s interest, and sometimes those interests are shady. The whole reason that the country has been able to go trillions in debt is because countries use the dollar and we have a gun pointed the their heads to do so. Right or wrong, it is in America’s interest to keep them using dollars. But let’s be honest here, modern humans are really no different than our ancestors. The world is one big game of risk and if a country can find a way to advance their position on the board without wiping themselves out, they’ll do it. The number one goal of any empire is to expand and prosper. And in order to do that you’ll need a good military to ensure that happens. A witness can think poorly of that, and the optics may not be great, but if a country is able to expand their power and influence then they’re doing what any country has ever done.",
            "title_similarity": "0.7483235",
            "sentiment_compound": 0.8722
        },
        {
            "id": "hd8xzse",
            "score": 1,
            "text": "Being in the military doesn't automatically make you a 'hero', but many people certainly do join for what we would consider noble or \"heroic\" reasons (love of country, desire to defend the nation, do good across the globe, etc). One can also DO \"heroic\" things while in the military regardless of individual's personal motivation in joining. The Marine who jumps on a live grenade to save he buddies, or runs into a hostile area to retrieve his comrades is, IMO, a hero. The soldiers that went into Somalia to bring food-aid to starving men, women, and children were (again IMO) doing something noble and heroic. \n\nBeing involved in an \"existential\" war is entirely irrelevant. Why does a conflict have to be \"existential\" for it to be \"heroic\" or \"moral\" or a \"just war\"? But so much of this is entirely subjective as to what you define as \"heroic service\" so it's opinion. Where I will directly challenge you is your assertion here:\n\n>All of our actions after that, and  most of them before, have been to protect and promote the American  corporate hegemony.\n\nI don't think this even remotely close to accurate and I'm going to ask you to back this up with specifics. While there have been a *few* instances where the US military has been used to prop up corporate interests (notably the Central American \"Banana Wars\") I find it hard to attribute the majority of US actions to a desire to \"promote American corporate hegemony\". Bosnia, 1st Gulf War, bombing of Libya (both times), the aforementioned intervention in Somalia, Korea, etc. It's REALLY hard to draw any sort of line between those actions and corporate dominance. \n\nWhat might be more accurate would be if you dropped the \"corporate\" part, because a case can certainly be made that the vast majority of US military actions were undertaken to protect and promote US **national** hegemony. But then, that's just the US acting in its own national interest; being the hegemon is beneficial. Of course, economic interests are part of US hegemony and we value the international trading order we constructed after WWII, but it was by no means the ONLY thing we valued. If that were the case, the rational decision for the US would have been to drop support for Israel when the oil embargoes damaged the US economy in the 70s, but we didn't and continued to support Israel for a variety of reasons not easily explained by \"corporations made us do it\". \n\nI think you would be better off refining your statement as something like:\n\n \"The only moral use of the nation's military is in direct defense of US territory or US citizens (personal subjective premise). The US has not engaged in any such actions since 1945 (we can argue that). THEREFORE anyone serving in a the US military that conducts immoral actions is, and cannot be, a hero.\"",
            "title_similarity": "0.7517432",
            "sentiment_compound": 0.9969
        },
        {
            "id": "hd8z4uu",
            "score": 1,
            "text": "I fully agree with your first contention: people join the military for all sorts of reasons, and many or most are not heroic or even selfless.\n\nYour second point is highly debatable, and you haven't provided any evidence to support your claim so I hardly know where to start in debunking it. You imply that a war must be \"existential\" for it to be legitimate and not in the service of \"corporate hegemony.\" I don't see any reason why that should be so. Both the Korean War and the Gulf War, for instance, were fought with broad international support (the Korean War specifically under the UN banner) to push back on unprovoked aggression by one state against its neighbor. How this is about being a strong-arm enforcer of corporate interests... is not immediately evident. \n\nThe purpose of the military is to serve national interests, and it does that at the behest of elected civilian leaders, who have come from both major parties and a range of ideological backgrounds. To suggest that all of those commanders-in-chief and defense secretaries were somehow traitors to the national interest and instead driven by promoting \"corporate hegemony,\" whatever that means (you haven't defined it) is a bold claim that demands strong evidence. What do you mean by it, and what is your evidence that the U.S. military has served corporate rather than national interests?",
            "title_similarity": "0.781924",
            "sentiment_compound": 0.6122
        },
        {
            "id": "hd8zv3i",
            "score": 1,
            "text": "Yeah. Okay boomer.",
            "title_similarity": "-0.08304216",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hd91jn3",
            "score": 2,
            "text": "I brought water to a home devastated by a natural disaster, helped a mom find their baby, and made a young girl who lost her family laugh. If Bezos made a dollar so I could do that, fine.\n\nYou LITERALLY do protect Americans. Jumping on a grenade literally saves the lives of the Americans next to you.",
            "title_similarity": "0.6364857",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hd92x91",
            "score": 1,
            "text": "Being in the military doesn't make anyone automatically one of those two options.\n\nThat's a false dichotomy.\n\nA soldier can perform acts of heroism in the service of duty (extreme example, civilians are being slaughtered by an enemy nation and the soldier protects them at the cost of his own life), they can **also** perform acts that advance the corporate interests of their nation (like invading a third world nation to install puppet Presidents that will sign favorable oil contracts for your nation).\n\nIt's not a binary choice or exclusionary choice.",
            "title_similarity": "0.7755352",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hd930kg",
            "score": 2,
            "text": "Fundamentally I'm not sure anything can change your view. Like many others you've taken to viewing the world exclusively through the lens of these shadowy \"corporate interests\" and the \"evils\" of capitalism. \n\nI don't know where this idea comes from that without corporations and capitalism we'd all be living in a glorious equitable utopia. \n\nThat something might have a monetary aspect or some value that can be assigned to it doesn't mean that that's the suddenly the *only possible reason* for doing it. \n\nA company encourages employees to stay in good health. Along comes the \"corporate interests maaan\" man: \"Yeah well they're just doing that to *save MONEY* on insurance to protect *their BOTTOM LINE.\"* Like you literally can't do anything, even if it's positive and done for a reason that's not 100% money-related without someone jumping down your throat about \"corporate interests.\" \n\nWhich corporation was pulling the strings in Bosnia? In Korea? The US military has had many positive impacts throughout the world and for our allies. The US Navy protects international shipping lanes. \"Corporations tho.\" Yeah, sure. Without free and relatively safe global trade the world and your life, as well as mine, would look very different. And not in a good way. Nations protected by alliance with the US don't need to funnel money into their militaries for defense. Etc.",
            "title_similarity": "0.6798068",
            "sentiment_compound": 0.9908
        },
        {
            "id": "hd942by",
            "score": 1,
            "text": "Such a spicy, first year college take. Like it or not the United States Military is a force for good in the world. Those men and women are always where danger is. And not just in war zones. They assist with emergency aide and much more. Being in the military doesn't automatically make you a \"hero\" but its definitely a good thing and the world would be vastly worse off without the US military.",
            "title_similarity": "0.78577995",
            "sentiment_compound": 0.6865
        },
        {
            "id": "hd94f8l",
            "score": 1,
            "text": "Government has done an amazing job at providing unreal benefits. I might have joined had I known. I know people retiring very comfortably in their 40s. So jealous.",
            "title_similarity": "0.5825939",
            "sentiment_compound": 0.6835
        },
        {
            "id": "hd98a7j",
            "score": 1,
            "text": ">I see mostly kids from disadvantaged  socio-economic backgrounds joinin te military to escape their dead end  lives. And the military offersthat, there is no doubt. I served and  I'm glad I did.\n\nStop right there pardner.",
            "title_similarity": "0.7838582",
            "sentiment_compound": -0.5252
        },
        {
            "id": "hd9avxo",
            "score": 1,
            "text": "Nobody gets to pick and choose which war they will fight in. They get asked by their country to serve, and they do so without reservations. Their intentions are right and heroic. Your complaint is with the politicians sending us. You can't just sit back and pretend that one war is more noble than the last. They are all equally worthless. Shitting on those willing to give up their lives for their country is heroic. Hero literally means protector and defender. It doesn't mean anything else. By definition a solider is a hero whether they are proud what they have to do or not. Pride is for artists.",
            "title_similarity": "0.78755474",
            "sentiment_compound": 0.3521
        },
        {
            "id": "hd9az47",
            "score": 1,
            "text": "Show some respect",
            "title_similarity": "-0.067080215",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hd9bh8w",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hd9c4km",
            "score": 1,
            "text": "Serving in Vietnam and serving in the Middle East are like totally different ballgames imo \n\nfrom everything I’ve heard and read on Vietnam I can definitely see how you’d feel that way\n\nHaving served in the war on terror era, I can tell you that there is heroism in anyone who chooses to come fight this enemy. \n\nThank you for your service, I’m sorry people in your time didn’t recognize and appreciate your sacrifice sooner. With the utmost respect, I disagree with you entirely.",
            "title_similarity": "0.75241494",
            "sentiment_compound": -0.1593
        },
        {
            "id": "hd9ca9f",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.023540208"
        },
        {
            "id": "hd9cb9q",
            "score": 2,
            "text": ">We haven't been involved in an existential war since the 1940s. All of our actions after that, and most of them before, have been to protect and promote the American corporate hegemony. \n\nYou are understandably focused on all of the things that the US Military does as a way of defining it. However, with a brief pause after 1989 that is now solidly over, the things that the US Military does have only formed a relatively small part of its core mission compared to the much more important things that it conceivably could do. The [National Defense Strategy](https://dod.defense.gov/Portals/1/Documents/pubs/2018-National-Defense-Strategy-Summary.pdf) summarizes in 11 pages how the US Armed Forces have been designed to accomplish that much larger mission.\n\nThere are, right now, hundreds of millions of people who live in democratic countries where their votes matter, they have access to judicial recourse, and have access to prosperity because they live on the other side of a bright red line drawn by the US military. We live in a world where strong democracies are becoming fragile and fragile democracies are slipping into hybrid regimes, but not one where dictatorships project power or invade democracies because in spite of its many flaws the US military still effectively stops them.\n\n>We want docile trading partners, that's it. If you are in the military your only job is to keep the spice flowing. You don't protect Americans. You protect American business interests abroad.\n\nI'd ask to you consider what the world might look like without these things that you are snidely dismissing. As a result of trade that is docilely negotiated and spice that flows, extreme poverty around the world is plummeting with infant mortality and illiteracy. Famines today are isolated events defined by regional conflicts that separate people from global trade. The developing world is *rapidly developing.* You might not know what it is like to not eat for two weeks, but if your community lost access to global markets you would find out soon enough.",
            "title_similarity": "0.80954945",
            "sentiment_compound": -0.5885
        },
        {
            "id": "hd9drgm",
            "score": 1,
            "text": "Those people who join from disadvantaged lives enter a system that promotes on meritocracy,  rewards skill at the position and develops leadership skills that are marketable. You may think of them as victims of a uncaring corporate sponsored mcgovernment but I guarantee you, they do not.",
            "title_similarity": "0.6262193",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hd9dye8",
            "score": 2,
            "text": "I served because it was the easiest way to get medical care, guaranteed retirement and educational benefits without being European or in debt",
            "title_similarity": "0.49731433",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hd9eqa2",
            "score": 1,
            "text": "Bojack horseman?",
            "title_similarity": "0.12183027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9fhia",
            "score": 1,
            "text": "Our current state is reletively new.\n\nThe world for 4.4 billion years is chaos\n\nThe majority is military for some nation state.\n\nIt's one or another. That's just it. Go find another time where you can do you",
            "title_similarity": "0.56301975",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hd9fxnf",
            "score": 1,
            "text": "Depends on what era. If your talking from Cold War onward I agree. But, are you telling me that everyone's great grandpa who killed Nazis is not a hero?",
            "title_similarity": "0.64454955",
            "sentiment_compound": -0.734
        },
        {
            "id": "hd9gvcq",
            "score": 2,
            "text": "Agreed. I am a vet.",
            "title_similarity": "0.17905073",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hd9hcvl",
            "score": 1,
            "text": "Hate the game not the people.",
            "title_similarity": "0.3587527",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hd9hjzi",
            "score": 1,
            "text": "So was it bad to stop the Iraqis from raping and looting kuwiat?",
            "title_similarity": "0.36684382",
            "sentiment_compound": -0.8948
        },
        {
            "id": "hd9i0rd",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.023540208"
        },
        {
            "id": "hd9jddp",
            "score": 2,
            "text": "The path to hell is paved by good intentions \n\nThe US military isn’t heroic. Some people do heroic actions but the actual service isn’t. Some people actually want to serve their country but I would say most are there for the job. \n\nI would say the National Guard is a lot more heroic. Occasionally deploying and leaving your normal civilian life behind for a year is tough. One weekend a month on top of your civilian career is tough. Being called out from your civilian job to help in emergencies is tough.  Typically your biggest impact is in the state for those emergencies so I would dare to say that it’s less about corporate interests and more of the good will to the state and sometimes throughout the nation",
            "title_similarity": "0.7757898",
            "sentiment_compound": 0.9545
        },
        {
            "id": "hd9jm4l",
            "score": 8,
            "text": "I'm just here for Bojack Horseman quotes",
            "title_similarity": "0.31336004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9k5so",
            "score": 2,
            "text": "I think this also depends on country. You are viewing the military from the eyes of the US.  And I would have to agree with what you said from the American perspective. I am from Canada. Here the military has a bit of a bad rap, more from the pool of talent they draw from traditionally, but that is now changing with more roles that are technical and require an education. Our military is small, but mighty and we focus on defending our borders and peacekeeping missions. We don't start wars, and think long and hard getting involved with any. \n\nHere the military is quite hard to get into. Especially for more interesting posts like intelligence or MP. The military is seen as a great way to get a nice pension.  We have issues no doubt. We have a raging situation with sexual assault allegations... \n\nWe treat our military like any other government worker, there is a some \"thank you for serving\", but not as much as the rah rah in the US. Here the military is actually (for most trades) well paid compared to the private sector, plus a full pension after 20-25 years... it is attractive employer for many. So it is a job like many others.",
            "title_similarity": "0.6899682",
            "sentiment_compound": 0.9914
        },
        {
            "id": "hd9kkxz",
            "score": 2,
            "text": "I basically see the current military as a massive jobs program. I think there absolutely are heroes in the service. No doubt about that. I don’t really care for the fact that we’re supposed to treat every member of the service like a superhero for doing a job they chose to do. Service members get so many other benefits that the general public doesn’t have access to. I know plenty of people in the service who are bad eggs. I know more than a few who were a little too excited to be able to go overseas and kill others. I also don’t like how often certain political parties say if you do X, Y or Z you aren’t supporting the troops.",
            "title_similarity": "0.74042225",
            "sentiment_compound": 0.9543
        },
        {
            "id": "hd9kl4l",
            "score": 2,
            "text": "I don't think I would have worded it this way, but this is a valid point. If our military was truly about the defense of the homeland, then they probably wouldn't be so bad at all the other non-defense-related shit we ask them to do and their budget wouldn't have to be as large as it is, either. Since the tragedies of 9/11, we have cheapened the term \"hero\" by glossing everyone who wears the uniform as a hero. It really does a disservice to those who have truly gone above and beyond the call of duty.",
            "title_similarity": "0.7383381",
            "sentiment_compound": 0.5045
        },
        {
            "id": "hd9kpiv",
            "score": 2,
            "text": "I make it absolutely clear I joined for free healthcare, college and a steady income.   I outlay how corrupt our military is and advocate for change.  It is hard to argue w a vet to a civ when they havent done shit",
            "title_similarity": "0.7532804",
            "sentiment_compound": 0.7443
        },
        {
            "id": "hd9md2o",
            "score": 2,
            "text": "[Like Major General Smedley Butler (USMC) said:](https://en.m.wikiquote.org/wiki/Smedley_Butler)",
            "title_similarity": "0.29810396",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd9mspr",
            "score": 1,
            "text": "Nah it's just a job, like any other.",
            "title_similarity": "0.323162",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hd9na1q",
            "score": 1,
            "text": "Well, I served during one of the very few periods when the US wasn't at war.\n\nI worked in a hospital, fixed equipment, and handled a firearm for all of 1 day in basic training.\n\nWhile I in no way consider myself a hero, I was sure happy to fix the gear that allowed the doctors and nurses, who I do consider heros to do their jobs.\n\nAgain, this was '96-'00, sure there was Bosnia, and the SF never sleep, but we really had no major engagements, the vast majority of the Airmen through the hospital were minor training injuries, mothers giving birth, family stuff.",
            "title_similarity": "0.7919558",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hd9nwcx",
            "score": 2,
            "text": "We are cogs in the machine of war until a time when humanity decides to unite against the darkness of those politicians and corporate rulers who serve only themselves.",
            "title_similarity": "0.557376",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hd9pjo2",
            "score": 1,
            "text": "I feel like this is a bot with the random spacing. But I kind of agree.",
            "title_similarity": "0.33558616",
            "sentiment_compound": 0.5515
        },
        {
            "id": "hd9qtxu",
            "score": 3,
            "text": "Yep. This is pretty spot-on.",
            "title_similarity": "-0.06133974",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hd9si0n",
            "score": 1,
            "text": "Louis CK put it well. “This guy is giving his life for the country, he thinks.\n\nBut that’s good enough. That’s good enough. The fact that he thinks it.”\n\nSome guys joined because of that, some because money, some few because they’re fucked in the head and wanna hurt people.\n\nIt kinda doesn’t matter why we’re at war when in a particular circumstance someone risks his or her life to save another.",
            "title_similarity": "0.67921257",
            "sentiment_compound": -0.7729
        },
        {
            "id": "hd9tjhi",
            "score": 1,
            "text": "He’s doing the dirty work so the government doesn’t have to draft us all. They are all hero’s to me",
            "title_similarity": "0.6535435",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hd9u817",
            "score": 1,
            "text": "Agree for the most part, except that there have been no existential wars since 1940.  While  that's probably true of all our major long term wars, I'd say that the war too end the Bosnian Genocide, the first Gulf War, and parts of the war too defeat ISIS in Syria were also existential wars.  There were lots of mistakes in handling the aftermath, but that was true of WWII as well.\n\nSo if you are in the military you have a shot of being a part of a military engagement that really is about what the propaganda says it is.  Also, a lot of simple military might and time on basis really act as a deterrent for allies, so there's definitely that too.",
            "title_similarity": "0.7759082",
            "sentiment_compound": 0.6121
        },
        {
            "id": "hd9ufae",
            "score": 1,
            "text": "I feel as though many people -- perhaps even a majority -- who join the military do so because of poor earning prospects in the private sector. Are victims of poverty not due at least some compassion?",
            "title_similarity": "0.6566997",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hd9vgjr",
            "score": 2,
            "text": "Read the book, \"War is a Racket\" by Marine General Smedley Butler.\nDon't be a mercenary for Exxon.",
            "title_similarity": "0.6127478",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hd9wk3k",
            "score": 1,
            "text": "Or a welfare queen.  it is a jobs program too.",
            "title_similarity": "0.2070125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd9z8z5",
            "score": 4,
            "text": "I did it to get out of poverty. I’m not a hero.",
            "title_similarity": "0.5726048",
            "sentiment_compound": -0.7371
        },
        {
            "id": "hda0fxz",
            "score": 1,
            "text": "Very U.S. centric. My countries military doesn't serve your countries corporate interests.",
            "title_similarity": "0.62288505",
            "sentiment_compound": 0.25
        },
        {
            "id": "hda1jrf",
            "score": 2,
            "text": "Stay strong 💪",
            "title_similarity": "0.019572416",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hda1ve9",
            "score": 1,
            "text": "Word same with cops",
            "title_similarity": "0.14570192",
            "sentiment_compound": 0.0
        },
        {
            "id": "hda215q",
            "score": 1,
            "text": "Ok Bojack",
            "title_similarity": "0.0038968883",
            "sentiment_compound": 0.296
        },
        {
            "id": "hda2lm6",
            "score": 1,
            "text": "Seeing as how most people serve corporations one way or another, why not both?",
            "title_similarity": "0.37383065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hda5w5j",
            "score": 2,
            "text": "You're absolutely right. The CIA has been doing terrible things on behalf of 'The American People'. Took me until I was in my late 30s and George W Bush was president to realize that when the republicans say 'the american people' -- they mean the top 5%. \n\nif you keep that in mind, all their rhetoric lines up with reality. Tax cuts for 'The American People' means tax cuts for people making like $350k a year plus... \n\nAnd yet they somehow tricked a bunch of middle class and lower middle class white people into thinking democrats are trying to raise THEIR taxes... \n\nthat's some black magic fuckery for your ass right there.\n\nAnd so now, after decades of interfering in other nations' affairs, murdering democratically-elected leaders, and using economic power to bribe, strongarm, rob and cheat poor and middle class people in less fortunate countries into giving up the rights to their own natural resources -- so that a few countries in Europe, the US, and Canada can all enjoy the benefits... \n\nNow the whole world hates the REAL American people. Not just the 5%. All of us. \n\n Because they lied and said they were doing it in our name.",
            "title_similarity": "0.62352383",
            "sentiment_compound": -0.9552
        },
        {
            "id": "hda6e2j",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hda7381",
            "score": 1,
            "text": "You’re not necessarily wrong, but propaganda has made it so thousands, if not millions, of young people don’t understand. Many join thinking they are defending the United States or advancing admirable ideals. Many just join to escape poor social-economic conditions and don’t really have any strong ideological beliefs. Some people just want to legally kill someone. \n\nI think it is admirable and heroic for someone to serve in the military if they believe they will be defending their country or helping people in other countries. They aren’t any less heroic for being misled into serving and dying for corporate interests, although it is tragic. It’s a kind of tragic heroism, especially since those people usually find out pretty quickly it wasn’t what they thought, and then feel trapped and disillusioned.",
            "title_similarity": "0.7464861",
            "sentiment_compound": 0.9753
        },
        {
            "id": "hda79jf",
            "score": 1,
            "text": "Because that soldier doesn't pick where he goes or what he does. Our government may be full of scumbags, criminals, warmongers, and elitists but that person who signed up, whatever their personal beliefs, said \"I will voluntarily go wherever my country asks me to and do whatever my country needs me to, regardless of the risk to my own safety and wellbeing\"",
            "title_similarity": "0.75836736",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hda7zko",
            "score": 1,
            "text": "Hard fucking down-vote here, you sad old man. \n\nYou don't understand the modern-day implications of service due to you own fucked up modalities. Just because you were shouted at and called a baby murderer by your own generation for serving uncle Sam, doesn't mean you get to shit on the service of modern day heroes.\n\nI served, honorably too- unlike you. I didn't have to be coerced into signing up to serve my country, I did it willingly. \n\n\nHow dare you. Where do you get off thinking that this is a good idea?",
            "title_similarity": "0.7715192",
            "sentiment_compound": -0.875
        },
        {
            "id": "hda8jmw",
            "score": 1,
            "text": "https://en.m.wikipedia.org/wiki/M%E1%BB%B9_Lai_massacre",
            "title_similarity": "0.232712",
            "sentiment_compound": 0.0
        },
        {
            "id": "hda8v8p",
            "score": 2,
            "text": "The only thing that makes soldiers and anyone else in a combat position, heroes is when they put their own life in harms way to save the lives of those around them. That’s pretty damn heroic.",
            "title_similarity": "0.6567228",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hdaa1r4",
            "score": 2,
            "text": "I am a 20+ yr Veteran. A Senior Officer.\nUnfortunately we realize \"That War is a Racket\" and we have been swallowed by the all mighty Military Industrial Complex Eisenhower warned us about too late.\nThe USA is the most Belligerent and Bellicose country during the last century and certainly this one.\nI can't recommend Military Service to anyone with a clear conscience.",
            "title_similarity": "0.68918914",
            "sentiment_compound": -0.6715
        },
        {
            "id": "hdaadfz",
            "score": 1,
            "text": "Honestly I don't consider anyone in the military a \"hero\" unless they were in a combat zone. I have a friend who worked in shipping his whole career and acts like he did something noble. He never left the US 🤣 but don't get me wrong, if your life was in danger or you had to kill people? You are a hero and I appreciate your sacrifice.",
            "title_similarity": "0.8415528",
            "sentiment_compound": 0.8009
        },
        {
            "id": "hdaalwb",
            "score": 1,
            "text": "It doesn’t make you a hero or a bad person either, it’s a job. Fuck off with that talk.",
            "title_similarity": "0.53737",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hdaao5u",
            "score": 1,
            "text": "I'm sorry but you're wrong. Alot has changed since you were in. I can't talk specifics but we do alot to keep the homeland relatively safe and it is not for corporate interests. The mess we created by invading Iraq and Afganistan has created a great deal of hate, resentment, and grudges by the regions locals and it will remain that way for decades to come. If you've heard what I've heard about what they want to do to us. you'd be glad we were over there killing them before they had a chance to carry out their plans agaisnt the homeland",
            "title_similarity": "0.7184051",
            "sentiment_compound": -0.6381
        },
        {
            "id": "hdab3t8",
            "score": 2,
            "text": "It actually trains you to be a professional homeless person get it right nerd",
            "title_similarity": "0.53391826",
            "sentiment_compound": -0.296
        },
        {
            "id": "hdabjtn",
            "score": 1,
            "text": "Not all people who serve in the military, serve in the US military. In many countries having a military is necessary and some of the people who served in it are heroes. The us also has thousands of blue berets.",
            "title_similarity": "0.62007236",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hdabn52",
            "score": 1,
            "text": "IMHO\nEvery one, especially American Citizens, needs to Serve \nNot necessarily in the Military bearing weapons, but Serve the Country in a Myriad of Ways from fighting fires to teaching there are a million ways to Serve your nation.\nThe Israelis are but one example of National Service.",
            "title_similarity": "0.67730176",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hdac30x",
            "score": 1,
            "text": "It doesn’t make you either. It just makes you someone who is/was in the military.",
            "title_similarity": "0.5323724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdad03h",
            "score": 1,
            "text": "I disagree. Simply because we are not currently engaged in country-threatening wars doesn't mean that we won't be thrown into one at any given time, ESPECIALLY given that we change presidents every 4 years and the entirety of our foreign policy can change in a day.\n\nOur soldiers train to protect us and stand at the ready to sacrifice their lives in defense of this country. I don't believe that they need an opportunity to actually act on that in order for them to be heroes. Somebody needs to do it.",
            "title_similarity": "0.77881217",
            "sentiment_compound": 0.501
        },
        {
            "id": "hdad3vf",
            "score": 1,
            "text": "I don't want to change your view. It's good enough.",
            "title_similarity": "0.25305587",
            "sentiment_compound": 0.3975
        },
        {
            "id": "hdada3d",
            "score": 1,
            "text": "I joined knowing that there is bad in the good. Its peacetime tbh and all the conflicts we've faught since WWII can be justified and unjustified from multiple points of view and we now have hindsight to account for. Our military isnt even the largest in the world. We're just the most expensive. Usually, we'd draw down in peacetime. It happened between WWI and then pearl harbor happened and we spent the first years of WWII playing catch up with our capabilities. We drew down again but the cold war was used as justification for keeping our extensive overseas capabilities and presence, facilitating a larger military previous to WWI. Essentially the fear was WWIII happening and us getting caught with our pants down again like Pearl Harbor. When the cold war ended, we started drawing down again until 9/11 happened. In the military, it feels like the fear is that if we allow ourselves to draw down and cutback, we will lose the skills and capabilities we've acquired and learned until another major attack on US soil happens. Now in hindsight, the war on terror should not have been executed with large scale interventions in the middle east. Invading and controlling entire countries just isnt a feasible tactic in the era of organized insurgencies and are subject to manipulation by military contractors that actually reduce the efficiency of our military strategies in my opinion. A lot of our logistics and maintenance we do could be cheaper and more efficient if we kept it mostly internal. \n\nI cannot support a reduction in size because I honestly think that it's too late to reverse climate change and we can only mitigate its effects. Within the next ten years, more than two thirds of the worlds population will be at risk of drought and famine. We are now also seeing more severe and frequent weather phenomena. As a result, unrest in multiple countries are on the rise. Nationalism and division is all over the place. The worst case scenario is that the world is on the cusp of violent transition. I dont see it being any less violent unless something drastic changes, but we are just too divided. Rn, the military itself is pivoting away from focusing on the war on terror and more so towards another great power competition as major world powers realize that we will be competing for fresh water, food, and fuel. \n\nSounds apocalyptic, but it's already projected that the number of open conflict is projected to increase over the coming decades. The military must become financially leaner, tougher, and more ethically and morally inclined than our adversaries. \n\nIn short, I understand the frustration with the current way the military operates because I am also frustrated with it, but reducing capabilities at this critical juncture just isnt a viable option.",
            "title_similarity": "0.75459677",
            "sentiment_compound": -0.9969
        },
        {
            "id": "hdadrkb",
            "score": 2,
            "text": "I agree but i think it's actually worse than that. The USA military is in and of itself a mechanism for the theft of tax money. The people who make the decisions about where to go to war are deeply in bed with the people who supply the military at all levels and thereby make more money when the military is bigger and when wars are being fought. It's a blatant conflict of interest. The Bush family owned major stock in Colt Armalite, which supplied the military with many things. They also owned their ***own*** oil company. Two generations of Bush presidents went to war over oil. In business this would be clear cut insider trading / straight up corruption. The point is war is now a business. It works like this: If you have the means to keep the people divided and unhappy you can generally get support for pursuing wars as well as law enforcement and prisons ( another wing of this business model), and thus justify the ridiculous budgets for military and police, in which you own financial interest. War happens overseas, country is destroyed and as the conqueror you decide to rebuild. Using government approved contractors in which you own financial interest. And whatever resource your war has secured is now at the disposal of whatever government approved company you have financial interest in. All of this, every step, is paid for by tax money. None of it actually needed to happen, but the mechanisms for it to continue are now so entrenched that they will never be removed.",
            "title_similarity": "0.6108592",
            "sentiment_compound": -0.9705
        },
        {
            "id": "hdadw0u",
            "score": 1,
            "text": "ITT: Dude who was an army cook thinks that his experience as NON-COMBAT military personnel qualifies him to speak for the entirety of the military.\n\nAlso ITT: People in this thread enjoy the comforts and luxuries of freedom by bitching about said freedom, while living in luxury compared to other third world countries.",
            "title_similarity": "0.6744976",
            "sentiment_compound": 0.9274
        },
        {
            "id": "hdae6ai",
            "score": 1,
            "text": "Fucken preach",
            "title_similarity": "0.09304072",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdafaf9",
            "score": 1,
            "text": "call it whatever you want as long as that check clears",
            "title_similarity": "0.09156741",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hdafar2",
            "score": 1,
            "text": "The corporate interest is you.",
            "title_similarity": "0.19089659",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hdagmxr",
            "score": 1,
            "text": "I don’t know…I joined because I hated college and just wanted to do something. I was in the coast guard enforcing environmental regulations so I wasn’t doing the standard military thing everyone think of. So, I can’t speak to what the other services do but not all military operations push corporate agendas. \n\nI do see what you mean about recruiting people in low economic areas to serve as front line infantry and it was especially disgusting during Vietnam. I agree with you for the most part. I’d just be more clear about what military service your talking about I suppose.",
            "title_similarity": "0.79156256",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hdagtqn",
            "score": 1,
            "text": "I mean, if you’re a Corp… couldn’t that make them your hero then?",
            "title_similarity": "0.40214342",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hdahnis",
            "score": 1,
            "text": "Smedley Butler would agree with you and he was a 2 time Medal of Honor recipient. “War is a racket” is the book he wrote.",
            "title_similarity": "0.58777297",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hdai1i4",
            "score": 1,
            "text": "Whether we agree with it or not, peace through military strength works. That wouldn’t be possible without service members. And again, I completely understand if you think that ideology should be abolished and forgot but it definitely does work",
            "title_similarity": "0.63418794",
            "sentiment_compound": 0.6678
        },
        {
            "id": "hdaj18s",
            "score": 1,
            "text": "I joined to break a cycle of poverty in my family, I don't ever remember being a strong arm enforcer from my control panel. Everyone is entitled to their own views, but telling kids trying to escape poverty that they are \"enforcers\" does more harm than good. It will remove a pathway for alot of smart kids, whose only real option is heavy debt or military.",
            "title_similarity": "0.7997747",
            "sentiment_compound": -0.5414
        },
        {
            "id": "hdaj6pb",
            "score": 1,
            "text": "The job of the us Navy is primarily to secure the world economy and sea trade, I did public affairs for awhile as an MC and we constantly tried to preach it to gain awareness and support in south china sea.",
            "title_similarity": "0.5708693",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hdajgi1",
            "score": 1,
            "text": "I explicitly said there are no winners or losers.\n\nThere is a point being made.  The point is that humans aren't the center of the universe.  You can promote life and improving conditions for yourself, your family, your neighbor.. Maybe even your dog, while still admitting this fact.\n\nYou said, nobody wins when a town is destroyed.  There's an assumed 'humans' that always happens with statements like these.  It's a relative statement but nobody ever makes it relatively.\n\nYou have no idea whether an animal passes your criteria for a somebody.. or for that matter the sun.  You can just decide they don't.. which is what most humans so.. but then we're back to your box.. making incorrect statements.",
            "title_similarity": "0.7575985",
            "sentiment_compound": 0.2871
        },
        {
            "id": "hdajo8i",
            "score": 2,
            "text": "My dad served In Vietnam and it literally ruined his life.",
            "title_similarity": "0.63816243",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hdajshk",
            "score": 1,
            "text": "Not hear to change your mind but to just completely agree. Anytime i bring this up with others, no one sees it. Just think im anti america and stuff. Most are brainwashed by now of it. I cringe on flyovers. Like why do we need military aircraft flying over sports games? Very north korea like and cringy",
            "title_similarity": "0.6893912",
            "sentiment_compound": 0.7036
        },
        {
            "id": "hdak6om",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.021415051"
        },
        {
            "id": "hdalnvj",
            "score": 2,
            "text": "When I was a kid, this was something all adults seemed to know and openly tell me. Now it’s like blasphemy.",
            "title_similarity": "0.3996348",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hdalogm",
            "score": 1,
            "text": "Nah. Just makes me a guy trying to provide for my family the best way I know how. Never claimed to be a hero I just fix jets.",
            "title_similarity": "0.73223525",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hdalwvs",
            "score": 1,
            "text": "Well it depends. \n\nSomeone gave me an oversimplified view of war recently. \n\nWhen it comes down to it, **all** wars are essentially about acquiring and controlling land. Whoever keeps the land at the end, wins the war. Again, oversimplified, but it's also pretty hard to argue against that point. \n\nSo, if we look at it from that perspective. If a soldier is defending their countries land, they are a hero. If they are invading someone else's land, not so much. Even then, it all comes down to individual perspective anyway. I'm sure most people on every side think the other side is the invading force.",
            "title_similarity": "0.660558",
            "sentiment_compound": 0.7311
        },
        {
            "id": "hdamrf1",
            "score": 3,
            "text": "A few points as a current U.S. service member. I feel that in your particular case you were raised in a very unique era of world history particularly in the U.S. First off, we have the specter of WW2. Even at the time of your birth and adolescence a largely mythologized affair. The veterans of that war and Korea that came home largely did not share their experiences to anyone outside of the veteran culture. There may have been some exceptions. But to a large degree many people were discouraged from sharing the truth of their time in conflict. \n\nDue to this the prevailing propaganda and mythological build up did its work on the psyche of an entire nations youth. To put it generally the apple pie, white picket fence nazi and commie fighting moral guardian is born. Without diverging too much we can see WW2 as a unique situation in history. Due to the expansionistic nature of our enemies; not their policies. It became existential. However, we were fine to leave them be for quite some time. So even the sense of moral superiority is really a stretch. \n\nNow we take a bunch of 16-18 year olds raised in the U.S. by a generation of WW2 Vets and Korean Vets. Who at best may have mentioned the war in passing. If they themselves didn’t give in to the true believer make me feel better idealism. PLUS the effect of lots of propaganda and media mythology. That again generally follows “all service members are heroes!”.  Then Vietnam kicks off and its nothing like those conflicts AT ALL. It’s closer akin to the Spanish American war and conflicts that followed. \n\nThis is where we see the corporate interest talking point makes it into the modern discussion again.I say modern because Grant and Butler both held your same view.  But heres the rub is it better to be heroic or is it better to meet actual needs in the world we live in and keep the spice flowing? \n\nTl;DR: My personal belief is that National Interest is what Soldiers, Marines, Sailors and Airmen serve. Ostensibly this interest is dictated by our elected representatives; and therefore ostensibly the will of the people. Sometimes this may mean aligning with corporate This includes doing a lot of unheroic shit. Nation States are not inherently good.  So if the prevailing U.S. strategy of keeping trade going and not allowing anyone enough power to fuck with the flow of spice is our strategy because it keep the majority of people happy, fed and docile then we avoid another global catastrophe. At least warfare wise, were still fucked from global warming and climate change.",
            "title_similarity": "0.7844234",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hdan2zz",
            "score": 1,
            "text": "You are right on the money sir.",
            "title_similarity": "0.119568795",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdapkj1",
            "score": 1,
            "text": "Corporate interests? Who the fuck is investing in the middle east? And for Vietnam, they became a major us trading partner after we gave up and left lol",
            "title_similarity": "0.600272",
            "sentiment_compound": 0.168
        },
        {
            "id": "hdaq5jd",
            "score": 1,
            "text": "Why do they always send the poor?",
            "title_similarity": "0.3026433",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hdartim",
            "score": 1,
            "text": "Psst its the correct opinion",
            "title_similarity": "0.0106395865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdas6fb",
            "score": 1,
            "text": "I think it makes you a sucker given America's history for going into other countries and going through service members as if their lives mean nothing.\n\nHow can anyone see how Congress and the military wastes young people's lives like they're nothing and think going into the military is a good idea?\n\nIt really pisses me off when people say that soldiers in Iraq or Afghanistan or Vietnam or Korea died for our freedom.\n\nNo, they didn't die for our freedom. They were fed lies and propaganda to fuel the military industrial machine.\n\nOne of the few times I actually agreed with 45 when he said they were suckers and losers.\n\nWorld War II vets, you the real deal. Everybody else, except for those who were drafted And had absolutely no choice other than jail, are brainwashed or power hungry.\n\nOur military rarely protects us and Congress has proven time and time again that they don't care about America. We don't have nationalized healthcare, our police are adversarial, our schools are crap, roads and bridges are falling apart, school shootings are not only commonplace, but they're an excuse to buy more guns, abortion is made illegal to get more cannon fodder, and we are worked to death while being fed a steady stream of Madison Avenue lies of possible success and a happy future if we just buy stuff or look a certain way.\n\nWe are not a great country. We are the wealthiest third world nation the world has ever known.",
            "title_similarity": "0.7398702",
            "sentiment_compound": -0.8691
        },
        {
            "id": "hdasnd9",
            "score": 2,
            "text": "I served 10yrs in the Army in the infantry, 3 combat tours, and I agree. First tour in 2007 I realized we didn't fucking belong there. No reason for that, or the 20yr Afghanistan war other than the fact we are a war nation. Of our last 250 years, we have had 17 years with no wars.",
            "title_similarity": "0.7884004",
            "sentiment_compound": -0.8042
        },
        {
            "id": "hdasx78",
            "score": 1,
            "text": "There is imo always a reason to show people who gave some and those who gave all respect because even though we aren't right now, what if there where attacks to the US that had to be defended. These kids and their leaders are willing to defend their homeland. Most of em go through alot of difficult training to prove it. I have health problems, I would give one of my toes to be able to fire a shoulder mounted rocket launcher at something, or better yet where else could you fly and shoot? Excelsior my friend, always look into the light. I would have been proud to be able to serve not for shit corporate interest but for all those that did die trying to keep US safe in times of war. If a power as strong as Nazi's ever rises up again we'll definitely have the ability to keep ourselves safe.",
            "title_similarity": "0.6300384",
            "sentiment_compound": 0.8876
        },
        {
            "id": "hdattf8",
            "score": 1,
            "text": "This is a correct assessment.",
            "title_similarity": "-0.020309303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdau0qx",
            "score": 1,
            "text": "I think you want to say American military. If you disparage my branch again I'll eat the eyeballs out of your head old man.\nI've built hospitals, been the first on the ground after hurricanes or earth quakes, broken sex trafficking rings and destroyed thousands of tonnes of heroin and cocaine. Escorted the chemical weapons and nerve agents out of Syria, pulled expats out of warzones and gave a few high handed slaps to ISIS when the caliphate was still flying a flag war fighting wasn't as fun, but being fair I've never been in a fire fight that wasn't over 20 minutes after it started so it's not like I've had to take hills or anything.\n\nLike I said, your military and to be fair any organisation is only as good as it's people.",
            "title_similarity": "0.6874937",
            "sentiment_compound": -0.8254
        },
        {
            "id": "hdauept",
            "score": 1,
            "text": "This is probably why you are just a grunt and lack global vision. Protecting our interests abroad helps Americans at home. Our hegemony when repealed will make us less, not more safe. This world will wish we were still in charge.\n\nCollecting your veteran benefits and stop talking stupid.",
            "title_similarity": "0.7299421",
            "sentiment_compound": 0.1633
        },
        {
            "id": "hdavxjl",
            "score": 1,
            "text": "I was failing out of college and my little brother said he was joining the Marines. Realizing this was an opportunity to start a career, I joined. Completed my contract for 5 years and have a career in the aviation industry. I’ve now been in that industry for 17 years. The military and I both used each other, we both got what we wanted from each other. This doesn’t warrant a thank you for your service from a stranger. It generally just makes me feel awkward. I’ll pass on the free Applebee’s meal once a year, others might certainly appreciate it.",
            "title_similarity": "0.77463746",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hdawjmf",
            "score": 1,
            "text": "You're doing all this shit so I don't have to. You're dealing with the damage caused by poor politics and our own ignorance, you basically took the bullet for me. I appreciate that. I won't call you a hero if you don't want me to, but thank you for your service, even though I wasn't born before or during vietnam.",
            "title_similarity": "0.8051214",
            "sentiment_compound": -0.0608
        },
        {
            "id": "hdawjxk",
            "score": 1,
            "text": "Soldiers are only \"heroes\" in the US. Everywhere else they're just...soldiers.",
            "title_similarity": "0.66155636",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hdawkxw",
            "score": 1,
            "text": "Now, what say you about the coast guard",
            "title_similarity": "0.110907234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hday23y",
            "score": 1,
            "text": "for what it's worth, I'm sorry you had to go through this ordeal. It's a horrible feeling when you try to do good, but feel you left things worse or the same. Diplomacy can be a viscous cycle of trial and error, and technically we voted those politicians in, so we all share some blame. The sad part about the bipartisanship is that I don't see good vs. evil. I see, 2 factions that want to good, but they almost never see eye to eye. \n\nLearning from our mistakes is still progress. It's impossible to be perfect. But we can try to be better.",
            "title_similarity": "0.6378535",
            "sentiment_compound": -0.7943
        },
        {
            "id": "hdayovb",
            "score": 1,
            "text": "Thanking a stranger for anything outside of my personal interactions with them feels so phony to me. And why are military personnel specifically glorified? Only a fraction of them see combat. Every doctor deals with death and every janitor deals with shit but I’m not obligated to thank them.",
            "title_similarity": "0.7661841",
            "sentiment_compound": -0.7154
        },
        {
            "id": "hdazb9w",
            "score": 1,
            "text": "This is an incredibly popular opinion amongst normal people.",
            "title_similarity": "0.22414117",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hdb1qq8",
            "score": 1,
            "text": "The USA will always be fighting a \"war\" somewhere, because it's so profitable. The sad thing about it, is that young people and many innocents will keep dying for the \"cause\" and wasting their lives while few people make huge dollars. \n\nWe are a product of billions of years of evolution, countless random factors, against all odds and our life spans are so short. It's really saddening how the human being chose to live. We keep the vast majority  of us in extreme poverty, ignorance, hunger, pain, so a few fuckers can live like kings. Why? Will it ever change? Will we ever wake up?",
            "title_similarity": "0.6501426",
            "sentiment_compound": -0.9718
        },
        {
            "id": "hdb1xwq",
            "score": 1,
            "text": "I, too, do not think that military employees are heroes automatically. Having said that, there are wars worth fighting for, and I personally am glad that the USA fought them. Most prominent Germany/WWII and Balkan.",
            "title_similarity": "0.7071166",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hdb206p",
            "score": 1,
            "text": "Just putting this out there that USA spent roughly $2.2T on the war in Afghanistan. \n\nFor better context, that is $320M every single calendar day for 20 years straight.",
            "title_similarity": "0.4806362",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hdb3mrz",
            "score": 1,
            "text": "A bit to unpack here.\n\nThe Hero vs Defender of Corporate Interests is a false dichotomy, at least in theory and even in practice to a great degree. Like it or not, the military still exists to protect a nation from existential threats. Do you really think other nations would not attack us if we got rid of our military? \n\nEven in the case of Costa Rica, it exists only on either the good will of its neighbors (at most idealistic) or because other nation's own selfish interests deem it in their own interests for Costa Rica to exist.  Also, Costa Rica has no significant natural resources that I'm aware of. So that robs a lot of incentive to invade and conquer it. It's also protected by geography (like the USA, it has only two neighboring countries but otherwise surrounded by thousands of miles of fish from potentially hostile major powers).",
            "title_similarity": "0.71903753",
            "sentiment_compound": 0.7896
        },
        {
            "id": "hdb414s",
            "score": 1,
            "text": "In your situation i agree but for me my dad is a hero because he was ordinary man who had a family, job and good life when serbia attacked our country(croatia) and our city that was demolished completely and he stayed there till the end of the war so thats pretty badass when you defend whats yours",
            "title_similarity": "0.75510395",
            "sentiment_compound": 0.8542
        },
        {
            "id": "hdb7a0j",
            "score": 1,
            "text": "You don't enlist with any real say as to how exactly you're going to help the country. When you enlist, you take the oath of enlistment, which is the point of no return by which, in spirit, you pledged your life for your country if it ever came down to it, whether you're ever deployed to a situation like that or not. The hero status, to me, is not about what you're used for, it's about the choice you and none of your other countrymen made. You chose to potentially run towards danger so that no one else has to, sort of like police officers. And whether it's likely or not is irrelevant. You still made the choice to chance it.",
            "title_similarity": "0.7591663",
            "sentiment_compound": -0.2252
        },
        {
            "id": "hdb7s7f",
            "score": 1,
            "text": "I think if you were drafted it make you a hero for sure. Even if I don’t agree with that war. With that said, I get sick of the constant praise for every single service member these days. Most of them are not heroes in the slightest, but just people looking for a pay check cause they probably had limited options out of HS. Which is fine, but let’s stop acting like they are more American and noble than the rest of us when they are just children.",
            "title_similarity": "0.762273",
            "sentiment_compound": 0.6853
        },
        {
            "id": "hdb8oyz",
            "score": 1,
            "text": "So the 50,000 National guards who went to Katrina at a moment's notice arent Heros? Are the soldiers who went to all these Hurricanes hit places aren't heroes and don't protect American lives? \"Strong-arm enforcers\" what do you think keeps bad people from being bad? let's go ask the terrorist groups and NK to stop treating women as objects with an offering of hugs and kisses. it's funny to see someone bash the army then suggest no way of replacing it with something that will do equal or even bare minimum job. American soldiers protected Afghanistan women and kids but they aren't heroes because it wasn't American lives? People who think like this don't realize how the real world's work history needs enforcers to enforce laws. If the Army isn't around we will become the UN who get laughed at because they don't fight. if this is how people feel then when you see people being killed and hearing about war crimes in NK don't ask for the army. say UN go tell the Taliban to quit abusing women it's not nice.",
            "title_similarity": "0.74247706",
            "sentiment_compound": -0.9657
        },
        {
            "id": "hdb8xuz",
            "score": 1,
            "text": "Seems like a sucker to me",
            "title_similarity": "0.050797656",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hdba2bk",
            "score": 1,
            "text": "Are you living in a fantasy world???? In the global scale, there is neither eternal friends nor eternal enemies nor eternal good nor eternal bad only eternal interests.",
            "title_similarity": "0.54423887",
            "sentiment_compound": 0.5389
        },
        {
            "id": "hdba48d",
            "score": 1,
            "text": "Yeah, I know plenty of people that dodged a cell to dodge bullets. Didn't work out great for all of them.....",
            "title_similarity": "0.5456823",
            "sentiment_compound": -0.2718
        },
        {
            "id": "hdbav6l",
            "score": 1,
            "text": "probably",
            "title_similarity": "-0.22203386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdbcg6n",
            "score": 1,
            "text": "Not too long ago I saw an article about Pat Tillman for the 20th anniversary of 9/11. He was someone I looked up to so I wanted to share his story. Back then he was known as one if the most famous soldiers but these days I'm sure there are many people who never heard of him.\n\nHe was an NFL player who turned down a $3.6 million dollar contract to enlist in the Army after 9/11. He deployed to both Afghanistan and Iraq. He actually grew dissatisfied with his service, thinking that we invaded Iraq for the wrong reasons. He was killed accidentally by friendly fire and the military covered it up so it wouldn't hurt recruitment. They even lied to his family about how he died, including his brother who was deployed with him in the same unit.\n\nEveryone takes about someone different out of this story. There are a lot of people like him who join because they want to serve their country and not for money. Way I see it, no, being in the military doesn't make you a hero. However, even if we haven't fought a defensive war in a lot time service members are still responsible for us enjoying our freedom and way of life. Their existence is what deters enemies from attacking us. If we didn't have a military back in WW2 wouldn't we be having this discussion in German right now? Everyone joins the military for their own reasons, but they all sacrifice their time and put their safety at risk just by joining up. OP even if you feel dissatisfied with your service and how our government uses the military you should be proud of what you did by putting on that uniform, and what your were willing to do if it came down to it. Being in the military is still one of the most honorable professions our there. \n\nIf anyone has seen Attack on Titan think of the first episode. Where Mr. Hannes is sitting around with his buddies getting drunk and Eren yells at him for it. It's a good thing when our soldiers don't have to be out there fighting.",
            "title_similarity": "0.7515248",
            "sentiment_compound": -0.3857
        },
        {
            "id": "hdbclp0",
            "score": 1,
            "text": "Most people just want to go to college",
            "title_similarity": "0.4048739",
            "sentiment_compound": 0.144
        },
        {
            "id": "hdbcu51",
            "score": 1,
            "text": "Have your heard of isis, borders like a million and 1 more things",
            "title_similarity": "0.088607684",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hdbdwfl",
            "score": 1,
            "text": "Being in the military means \"I got D's in highschool and got tricked by a recruiter\" and nothing more.",
            "title_similarity": "0.591141",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hdbe13k",
            "score": 1,
            "text": "Win",
            "title_similarity": "-0.08790604",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hdbe56t",
            "score": 1,
            "text": "Soldiers work for a paycheck. Heroes are not often mercenaries.",
            "title_similarity": "0.60346377",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hdbebe8",
            "score": 1,
            "text": "Speaking es a militaritant disabled,  thank you for serving.",
            "title_similarity": "0.40219343",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hdbed2s",
            "score": 1,
            "text": "I’m with you so I’m not going to try and change your view. \nThey’re mercenaries.",
            "title_similarity": "0.46742746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdbetit",
            "score": 1,
            "text": "\"You want healthcare and education? Sorry, bud, you need to go murder some middle Eastern kids first, nothing personal, just the system we made.\"\n\n\nWorld terrorist USA has to be destroyed and then rebuilt into a proper country.",
            "title_similarity": "0.47838274",
            "sentiment_compound": -0.9274
        },
        {
            "id": "hdbg07q",
            "score": 1,
            "text": "This is the reason I don’t think you should be able to sign up at 18. That’s a child. It’s unlikely that someone that young fully understands what their enlistment means. Yes, if the opportunity arises you will protect your country. It’s unlikely that will ever occur because you are the aggressor and your enemy will be outmatched in every way. Your function will be to kill the people that the government orders you to kill. This can be under many different circumstances and you could be involved directly or indirectly. Your function as an enlisted man or woman will be to take life. If your an army meteorologist the function is the same. When will the weather be best to go kill the people? I just don’t think we should be taking people so early in life and turning them into government killing machines. Part of me thinks the very reason they encourage enlistment so early is so they can mold people before they realize that they’re going to be human terminators.",
            "title_similarity": "0.62773526",
            "sentiment_compound": -0.8731
        },
        {
            "id": "hdbi1go",
            "score": 1,
            "text": "I like my new job title “Strong Arm Enforcer of Corporate Interests” makes me feel like im James Bond or something.",
            "title_similarity": "0.45332417",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hdbidi2",
            "score": 1,
            "text": "Military doctors too?",
            "title_similarity": "0.23267007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdbimf0",
            "score": 1,
            "text": "Agreed. They haven’t protected anyone’s “freedom” since WWII. Every military action since, and also then, was spurred on by neoliberal policies and protecting corporate interests.",
            "title_similarity": "0.7684375",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hdbj72e",
            "score": 1,
            "text": "The heroism is in the eye of the beholder.  I’m sorry for your experience.",
            "title_similarity": "0.37416434",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hdbjmoj",
            "score": 1,
            "text": "Same with cops and you're 100% right.",
            "title_similarity": "0.2570598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdbktgm",
            "score": 1,
            "text": "Military vet here- 22 years\n\nThis post is 1000% correct.\n\nI “self soothed” away doubts about what I was participating in because I was a medic and thought what I did to help others was needed.\nBut I was just a cog in the machinery of war. A poor kid who joined because for kids like me where I came from, not a lot of better options existed and if they did, I didn’t have access to them. \n\nBut it could have been worse. I could have grown up and become a cop.",
            "title_similarity": "0.80612457",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hdbo3nn",
            "score": 1,
            "text": "You are 100 percent correct. That's why we can't have free college and healthcare. It's part of the recruiting formula. Then they tell you its an all volunteer military. Yes I volunteer to not starve or go to prison.",
            "title_similarity": "0.77623665",
            "sentiment_compound": -0.2254
        },
        {
            "id": "hdbprcy",
            "score": 1,
            "text": "It really depends on what you do in the military, when I was in the ANG, I never fought in a battle.  I really didn't do anything except see my friends once a month.  I didn't join to be a hero either, I just did it to pay for school.",
            "title_similarity": "0.8020449",
            "sentiment_compound": 0.5823
        },
        {
            "id": "hdbq4b8",
            "score": 1,
            "text": "Being in the military in and of itself may not make you heroic, but it sure gives a lot of people the opportunity and means to become heroes. A perspective I don't see many people grasping are the indirect ramifications of our service. The very existence of the US military, and especially our Navy, has I truly believe been a major reason why the world has enjoyed such relative peace since WWII. The US Navy is unparalleled, and its existence has ensured that regional threats have remained mitigated. Ocean trade routes have remained open and free, and that objectively is because of our Navy. Our failures in unconventional conflicts does not change that no nation on the planet holds a candle to us in conventional warfare. Every other nation on Earth could combine their Navy into one unified force and they would still be smacked down by our Navy, that's how ludicrous the power discrepancy is. The world knows this, and this means that the world has made geopolitical decisions based around this fact which has kept the peace. All this to say is that if we didn't have men and women willing to raise their right hand then we would not have the military we have, and without our military the world would be a much more violent place because our militaries simple existence prevents conflict.",
            "title_similarity": "0.77574444",
            "sentiment_compound": 0.9583
        },
        {
            "id": "hdbu9oh",
            "score": 1,
            "text": "I agree but I respect the military does have pure intentions and these kids are giving their lives up. I fucking hate that my tax dollars go to fund these wars and benefit a small group of people. I’m honestly tired of how my tax dollars are being spent. My tax money literally goes to the fucking Wuhan lab to fund a biological attack on the world and now I have to argue with these liberal retards all day who don’t understand that Fauci is a scam artist",
            "title_similarity": "0.7130715",
            "sentiment_compound": -0.9107
        },
        {
            "id": "hdbwthg",
            "score": 1,
            "text": "Does the same apply to the Ukraine forces that fought against the Russian invasion of Crimea? What about the British or Americans military in the 1st world war?",
            "title_similarity": "0.4439829",
            "sentiment_compound": -0.7622
        },
        {
            "id": "hdbyw8r",
            "score": 1,
            "text": "We call them heroes because it gives their life meaning if they die. No one wants to admit we’re letting them get killed for no good reason. There hasn’t been a justifiable war since WW2.",
            "title_similarity": "0.7883891",
            "sentiment_compound": -0.9154
        },
        {
            "id": "hdc0z8v",
            "score": 1,
            "text": "To this same argument, if American soldiers are protecting American interests, wouldn’t you also have to argue that American Interest they are protecting is also made up of “Hero’s”",
            "title_similarity": "0.49502265",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hdc1y4b",
            "score": 1,
            "text": "Being in the military doesn’t make you a hero automatically but having this viewpoint that you have is wrong as well",
            "title_similarity": "0.5681709",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hdc3mdv",
            "score": 1,
            "text": "2-",
            "title_similarity": "-0.13978219",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdc3nnx",
            "score": 1,
            "text": "Being in the **US military** to be exact. Don't extrapolate it on all other countries.",
            "title_similarity": "0.5314644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdc67bw",
            "score": 1,
            "text": "Fighting for one’s country is, in itself, a noble thing. But that doesn’t mean they can’t be garbage humans. My wife was a naval officer and she’s well aware of the problems the military and a lot of its members have.",
            "title_similarity": "0.62635803",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hdcbpfa",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.023540208"
        },
        {
            "id": "hdcilu7",
            "score": 1,
            "text": "You should look at Afghanistan on the news and be thankful you don’t live in a society like that. \n\nBut instead you have human rights, WiFi, an expensive smartphone and freedom of speech. \n\nIf the military are strong arm enforcers. They’re also protecting your current way of life.\n\nThe best quote on this is “People sleep peaceably in their beds at night only because rough men stand ready to do violence on their behalf.”",
            "title_similarity": "0.6961522",
            "sentiment_compound": 0.9711
        },
        {
            "id": "hde2tpd",
            "score": 1,
            "text": "just saying u def didnt serve during the vietnam war",
            "title_similarity": "0.5864178",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hdh3eq1",
            "score": 1,
            "text": "“I see mostly kids from disadvantaged socio-economic backgrounds joining the military to escape their dead end lives.” FACTS 💯 (I have a brother in the military rn overseas, and his life was going nowhere and still isn’t, so I’ve seen this so much.)\n\nYou nailed it in this post. Truth! It makes someone a selfish murderer, nothing more.",
            "title_similarity": "0.807162",
            "sentiment_compound": -0.9184
        },
        {
            "id": "hdkf12i",
            "score": 1,
            "text": ">I see nothing heroic in military service.\n\nRaising your hand and volunteering to potentially surrender your life in defense of your fellow citizens, the majority of whom you don't, nor will ever know, is heroic.\n\n>I see mostly kids from disadvantaged socio-economic backgrounds joining the military to escape their dead end lives.\n\nSeveral NCO's in my platoon had degrees. My PL was a West Point grad and our company commander had an Ivy League education. I had an upper middle class upbringing, I'm now a veteran cop and have a law degree.\n\n>We haven't been involved in an existential war since the 1940s. All of our actions after that, and most of them before, have been to protect and promote the American corporate hegemony.\n\nI disagree. This is a little picture argument.\n\n1949, Korea. Imagine Korea had we (and the UN) not intervened. South Korea is a major ally in Asia. It's also the 10th largest economy in the world. Russia is 11th.  Korea was a shitshow in '49, having just been repatriated after Japanese annexation. So I'm not sure how that promoted American corporate hegemony.\n\nVietnam. You were there, I won't preach on it.\n\nGrenada. 1983. I honestly don't understand the invasion of Grenada. \n\nPanama, 1989. Our complicated relationship with Noriega not withstanding, The Panamanian General Assembly actually declared war on the United States. PDF soldiers killed a US service member, and \"arrested\" (abducted) another, along with that service member's wife.\n\nGulf War, 1991. Why do you think we joined a coalition of a million troops in the desert? If you think  Iraq gaining substantial control over production of the world's oil ISN'T a nation security issue, I'm. I'm not sure what to tell you.\n\nSomalia, early 90's. One of the shittiest economies in one of the most lawless countries in the world, a scenario which persists to this day. Not seeing a Walmart on every corner, so not sure what the corporate hegemony gained from this. Coalition. Not just us. Mainly us, but not only.\n\nBosnia, early 90's. This was pretty massive ethic cleaning and mass rape. 100,000+ dead. Again, NATO, not just us.\n\nLate 90's, Kosovo. Another massive humanitarian crisis. Over a million refugees. War crimes, mass rapes. Trials for crimes against humanity. Bad shit. Again, NATO. Not just us.\n\nAfghanistan, 2001. 9/11.\n\nIraq, 2003. Weapons of mass destruction.\n\nSyria, 2015, ISIS.\n\n>you are in the military your only job is to keep the spice flowing. You don't protect Americans. You protect American business interests abroad.\n\nI don't believe this to be true. But even *partially* true it misses the mark. America's economic prosperity (and economic dominance) is based partly in its commitment to maintaining it's economic security.\n\nOil tankers getting hijacked in the Arabian Sea? We're going to send a $2b Arleigh Burke destroyer to fuck up somebody's day. Americans potentially paying $20/gallon for gas IS a threat to national security.\n\nBusiness interests and governmental interests can overlap.",
            "title_similarity": "0.8935",
            "sentiment_compound": -0.9952
        },
        {
            "id": "hdvqw0z",
            "score": 1,
            "text": "Wow, people are getting REALLY angry with you! I would think they would be welcome to the experiences of a Vietnam Vet. Then again, Reddit is full of Shills and Bots. Have you seen \"Reddits most addicted cities\"? Number 1 was a fucking AF base lol. I wonder also if it's the pendulum swinging from extreme patriotism, to anti war, back to extreme patriotism. However, I'm not sure. I appreciate your opinion and I think that also. War should be for defense only, because honestly in that scenario, we're all going to die anyways. My Uncle was drafted and was an artilleryman. I never knew until I was in my 20s. That's how much it did a number on him. I want to ask you what happened in Vietnam, but we're told not to ask those questions.",
            "title_similarity": "0.60951436",
            "sentiment_compound": -0.6037
        },
        {
            "id": "he6tbs1",
            "score": 2,
            "text": "I think people need to stop glorying the army in general because you’re picking vulnerable people and fighting bullshit wars in the name of “peace”. I think the best way to combat is is to empathise with veterans, but not glorify the military.",
            "title_similarity": "0.6827216",
            "sentiment_compound": -0.8624
        },
        {
            "id": "hehq74e",
            "score": 1,
            "text": "You served the Vietnam war? Doesn’t that mean you were drafted? You didn’t choose to fight that war and you were fed lies about it which influenced many peoples decisions on it.\n\nSurely it’s heroic to come back and tell people the truth about what you were being forced to do right? So you’re a hero. For telling us what happened in Vietnam.",
            "title_similarity": "0.74900866",
            "sentiment_compound": -0.622
        },
        {
            "id": "hgbfkec",
            "score": 2,
            "text": "I would agree, it doesn’t make you a hero. But for me, I automatically give someone in the military a healthy amount respect. Unless I find out they’re a baby-killer or something. \n\nIt takes a lot to knowingly (or unknowingly?) sign your life away, with the understanding that you could be sent off to die at a moments’ notice.",
            "title_similarity": "0.66502416",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hgdn9gd",
            "score": 1,
            "text": "If they weren't in the military then you would be.\n\nIt's the only thing keeping the draft away.",
            "title_similarity": "0.63257504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgu14ds",
            "score": 1,
            "text": "They had “little boy time” and I was told to ignore it. That was the moment I realized I was serving an empire of evil. Edit: The Afghans, not fellow infantrymen",
            "title_similarity": "0.6191745",
            "sentiment_compound": -0.7845
        }
    ]
}