{
    "CMV: Blues states should take a leaf out of Texas's book and pass a law allowing anyone who catches Covid-19 from an unvaccinated person to sue that person for 10k\nIt's simple, based on the \"your right to swing your fist ends where my nose begins\" principle, if someone exercising their freedoms incurs costs to someone else, the party responsible for the the harm should be held accountable.  Political reality may limit holding someone who refused to vaccinate responsible for all medical costs of those they spread Covid-19 to,  but using the law recently passed by Texas as precedent, blue states could easily justify a law allowing anyone who catches Covid-19 to sue the person they caught it from, as verified by contact-tracing, if that  person had chosen to refuse the vaccine and thus knowingly endangered others.": [
        {
            "id": "hdwdcjl",
            "score": 1,
            "text": "/u/Garushulion (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/ptiazw/deltas_awarded_in_cmv_blues_states_should_take_a/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.49802023",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hdwb5xp",
            "score": 11,
            "text": "[deleted]",
            "title_similarity": "0.05714776"
        },
        {
            "id": "hdws0ey",
            "score": 247,
            "text": "There's a bunch of reasons people refuse the vaccine that boil down to more than \"I want to be an asshole and don't care about others\".\n\n\\- Distrusting governments. See the Tuskegee experiment. \n\n\\- Distrusting large corporations. Pfizer has a bunch of lawsuits, even over basic stuff like cholesterol medicine. They don't care about you.\n\n\\- Getting a 100% mask rate and vaccine rate in the U.S. won't end the pandemic. Even if you somehow got the whole world to do that (good luck), the virus has mutated.\n\n\\- Nobody wants an authoritarian social credit score system like in China. Go read about it. It's fucked up; you can literally be ostracized from society if the government deems it. The vaccine passport system has the potential to turn into that provided you keep complying with the government's demands. They're always testing what they can get away with. Before it was getting rid of net neutrality, but they backed off. Now it'll be vaccine passports.\n\n\\- Vaccines have side effects. Blood clots and myocarditis are surprisingly common. Covid has way worse side effects, but this is supposed to be the freest country in the world, not one where authoritarians can force you to inject foreign substances into your body.\n\n\\- If covid killed even 1/10 people, we'd all be clamoring for it. The fact is that 600k deaths, most of which had serious comorbidities, isn't that bad. Covid isn't killing enough people to scare them into action.\n\n\\- A vaccine that protects you is out. If you care enough to sue someone, take the vaccine instead and it will protect you. If it won't protect you, then that explains why somebody wouldn't want to get it.",
            "title_similarity": "0.794443",
            "sentiment_compound": 0.585
        },
        {
            "id": "hdw9c8l",
            "score": 5,
            "text": "Ok, but only if I can charge fat people for being sick from fatness. Also, add skinny people for any diseases incurred for being too skinny as well.\n\nI'm tired of fronting the bill for all these people that are too fat or too skinny. Get in shape or me and the government get to choose for you to die!!!!\n\nIf you aren't in exactly the same health and shape as me, you deserve your suffering and are a drain on society!",
            "title_similarity": "0.74215543",
            "sentiment_compound": -0.9602
        },
        {
            "id": "hdygvqi",
            "score": 0,
            "text": "Yes, this would be a fantastic idea. The problem is that the Supreme Court would quickly overturn such a law as being unconstitutional without a hint of irony. \n\nThat's the problem with having a court full of partisan hypocrite theocrat hacks. They're not worried about law or precedent, only outcome. It doesn't matter if it contradicts 115 years of jurisprudence, a decision **they** made three months ago, or both. (See citations below) If it furthers **their religion** they'll ram it down our throats and call it \"originalism\".\n\n592 U. S. ____ (2020),\n590 U. S. ____ (2020),\n197 U.S. 11 (1905)",
            "title_similarity": "0.77018833",
            "sentiment_compound": 0.5739
        },
        {
            "id": "hdykzmq",
            "score": 0,
            "text": "“WAH DEMOCRATS NEED TO LEAD A GENOCIDAL COMMUNIST DICTATORSHIP” Part 885,635\n\nAnd isn’t it funny how this “right to swing ends where my nose begins” never applies to insurrectionary AntiFa terrorists or Only Black Lives Militants.",
            "title_similarity": "0.6541044",
            "sentiment_compound": -0.296
        },
        {
            "id": "hdwruc4",
            "score": -3,
            "text": "Contrary to what others have said, it's definitely possible to confirm who you've caught COVID from if you can obtain a small sample from each person. It is called genomic epidemiology. You use the genome sequences combined with known mutation rates to establish the \"genetic distance\" between the samples. You can determine if you caught it directly, or how many intermediary cases there were between their case and you case (if they're part of the same transmission chain).",
            "title_similarity": "0.5446409",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hdwg6k5",
            "score": 3,
            "text": "It’s stupid bc you can’t prove where you caught it..?",
            "title_similarity": "0.32494345",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hdwygli",
            "score": 62,
            "text": "[removed]",
            "title_similarity": "0.024148101"
        },
        {
            "id": "hdwbhio",
            "score": 35,
            "text": "[removed]",
            "title_similarity": "0.024148101"
        },
        {
            "id": "hdwugns",
            "score": 24,
            "text": "This is the dumbest thing I think I have ever read.  Vaccinated people can spread it just as much as the unvaccinated.  And how would you prove that you got it from so and so?  Can the unvaccinated sue the vaccinated too?  Because they can still spread it.  Go sue China and Faucci if you think that litigation is the answer.",
            "title_similarity": "0.73281556",
            "sentiment_compound": -0.6662
        },
        {
            "id": "hdwurh8",
            "score": 0,
            "text": "There is no legal precedent for this. May I ask why you would exempt the vaccinated from liability? You seem to be spiteful and a bit childish.",
            "title_similarity": "0.52335227",
            "sentiment_compound": -0.7068
        },
        {
            "id": "hdxeo3u",
            "score": 0,
            "text": "Texas law does not allow you to sue the individual who got an abortion, only people who provided or assisted in the abortion.",
            "title_similarity": "0.6011035",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hdyfswc",
            "score": 0,
            "text": "How would they be able to tell exactly where it came from? This is nothing but a witch hunt..",
            "title_similarity": "0.42045572",
            "sentiment_compound": 0.395
        },
        {
            "id": "hdyfzeo",
            "score": 0,
            "text": "Unfortunately we know when a baby is killed unlike proving a spreading like to covid. But agree, get vaccinated!",
            "title_similarity": "0.65117204",
            "sentiment_compound": 0.2124
        },
        {
            "id": "hdyg9s9",
            "score": 0,
            "text": "Don't do this, the court system is overburdened enough and there's no way to prove that you got a COVID from one person rather than another. I respect the sentiment but don't screw over your own state just to make a point about another's.",
            "title_similarity": "0.5740375",
            "sentiment_compound": 0.2249
        },
        {
            "id": "hdyh9ey",
            "score": 0,
            "text": "How are you ever going to prove that that particular person gave it to you ?  Ridiculous",
            "title_similarity": "0.32869703",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hdyin2o",
            "score": 0,
            "text": "Coming at it from another angle, tge reason they had to pass the law like that is because of previous laws wording and the way the courts work. A better solution would be to repeal and rework the bad laws (in my opinion) that require new laws to make citizens bounty hunters. Further doing it for a covid law would not only be impossible to prove but also arguably be worse as then there is no logical reason other than \"we want citizens to be bounty hunters\" to word it that way.",
            "title_similarity": "0.7340195",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hdyrvli",
            "score": 0,
            "text": "Laws like this are a useless waste of time, so every spiteful prick can waste money clogging the court system:\n\n- enforcing public health is a government role and the government ought to be able to do it better.  It needs a unified, overall approach.\n\n- you can’t really prove you caught a contagious disease from someone.  At best you can demonstrate they were reckless with their disease in your presence\n\n- peoples medical record are no one’s business but their own\n\n- this is typical Republican strategy: instead of addressing an issue, find a scapegoat for everyone to hate\n\nYou can’t be effective addressing public health one person at a time, you’d need their medical history which is none of your business, you’re reactive instead of proactive, the court can’t scale up for this, and you can’t prove it anyway.  So at best you get a few well publicized cases that don’t do anything useful, just waste money, and we’re probably started by someone who hates their neighbor or this is they are different looking",
            "title_similarity": "0.77985924",
            "sentiment_compound": 0.1893
        },
        {
            "id": "hdyyg60",
            "score": 0,
            "text": "Yes make the plague rats literally pay for their disgusting sins. Bankrupt them.",
            "title_similarity": "0.5601965",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hdz9p9d",
            "score": 0,
            "text": "If you're still catching covid after having taken the vaccine yourself, it isn't the person who is unvaccinated who is at fault.",
            "title_similarity": "0.57478744",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hehlxzx",
            "score": 0,
            "text": "There's a difference between Texas and the vaccine\nDeath in an abortion is 100% and is a premeditated act.\nDeath in the event of a covid contraction is less than 1% and is not premeditated or done on purpose (though there are the idiots who think coughing on people is funny and I agree they should be shot 🤷‍♂️)\nI don't agree with the interpersonal lawsuits as it sets a dangerous precedent. I do agree with fining abortion doctors tens of thousands on top of losing their medical license indefinitely.",
            "title_similarity": "0.82445437",
            "sentiment_compound": -0.8181
        },
        {
            "id": "hdwue6h",
            "score": 8,
            "text": "How would you prove who gave you a virus?\n\nAnd follow up question, if you caught the virus from a vaxxed person, as is very possible, would they be liable as well?\n\nI sense a spite toward people who don't share your understanding of the situation.  There is this really bizarre narrative going around that people not getting the shot don't care about human life and are selfish, etc.\n\nBut when it comes down to it, you're insisting on legislating a solution that doesn't work. (See israel) and this is coming from a place of a seed of hatred planted well well well before covid and watered very heavily by the media echochamber we have been exposing ourselves to on lockdown.\n\nJust take a step back and consider than you may be wrong. Clearly, the shots aren't stopping the virus, but you are being very heavily encouraged to believe that they are, and that those critical of them are all thats stopping us from defeating the virus. \n\nThat should alarm you.\n\nI get it. There is a lot to be angry about and you are seeing caricatures of people all over the place in the media.  But ... just really look at the numbers.",
            "title_similarity": "0.6788186",
            "sentiment_compound": -0.9496
        },
        {
            "id": "hdw9m5b",
            "score": 5,
            "text": "The really wild thing about the Texas law tho is that you don't even need to be directly involved in any way to sue.  So for an analogous COVID law, you would be able to sue anyone who makes anyone else sick, you don't need to be related to either party in any way.  You would just need knowledge of the facts to make the claim.  It's just such a recipe for disaster...",
            "title_similarity": "0.7255603",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hdx7a5m",
            "score": 7,
            "text": "\"Swinging your fist\" or getting an abortion are intentional acts. Contracting a disease (or spreading one) is not. These are categorically different things, thus the one doesn't apply when the other does.",
            "title_similarity": "0.54140615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwg8uw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.024148101"
        },
        {
            "id": "hdwhy07",
            "score": -1,
            "text": "Covid isn't the worst disease in the world. Not even close. Will you do the same for every disease as bad and worse than covid? Do you have any idea what that will do to the world?",
            "title_similarity": "0.63772494",
            "sentiment_compound": -0.567
        },
        {
            "id": "hdwiet6",
            "score": -1,
            "text": "There doesn't have to be a law. You can do this anyway. That law is just grandstanding. Either way, if you have proof that a sick person was knowingly sick and chose to be around you, and that is why you became ill, you can sue them and win.",
            "title_similarity": "0.75847",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hdwk6vs",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.024148101"
        },
        {
            "id": "hdwny81",
            "score": 1,
            "text": "I would hold your horses on the Texas law. The scotus could not rule against it yet, due to how it is structured. There is nobody for the government to act against as they usually would. In the lawsuit they used a judge, but a judge isn’t even the right person in that case. As soon as anyone tries to sue, that suit them gets acted upon. And that is where the scotus could get involved. Also it is where lower courts could rule against the law and set precedent used to eventually not even see the cases.\n\n\nAs to suing someone because you catch Covid from them, it isn’t that precise. I am vaccinated, and the vaccine doesn’t fully protect me from catching it or from spreading it. I could catch it or spread vaccine or not, or mask or not. Yes a vaccine and a mask helps to lessen the likelyhood, but the reality that you could catch Covid while you are vaccinated, spread it and die from it removes the standing in a case like this.",
            "title_similarity": "0.74361026",
            "sentiment_compound": -0.5643
        },
        {
            "id": "hdwv05x",
            "score": 1,
            "text": "I have thought this same thing about schools- if my kid legally has to attend school (obviously there are lots of school options, but school is legally mandated) and they catch covid there, shouldn’t I be able to sue for negligence in keeping kids safe? I would think this is especially true if you have a high risk child, and they got very ill… like schools have to be safe if kids are forced to be there? \n\nP.s I am not actually doing this before anyone jumps at me- and my kids go to a school that mandates masks, and follows social distancing- so at least they are trying to help slow the spread. I’ve just been wondering why no one has done this yet? It seems to me schools have to adjust for all abilities, and you would think medical risks would fall into that.",
            "title_similarity": "0.70771587",
            "sentiment_compound": 0.9152
        },
        {
            "id": "hdwzgl5",
            "score": 1,
            "text": "10k is too much. COVID doesn't cost everybody 10k I say the hospital bills are good enough most regular people don't even need the hospital. It's also pretty hard to tell who you got it from. A lot of unvaccinated people are also low class. This just doesn't seem very practical or enforceable at all.",
            "title_similarity": "0.542016",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hdxcbd3",
            "score": 1,
            "text": "Freedoms are not given, they are inherent. To charge one based on the exercise of freedom is an undue charge. \n\nI understand your frustration, but one is not responsible for a disease or pathogen. With all due respect, your view is reductionist and overly simplistic. Options for self-protection against infection are many and readily available.\n\n Take your action, think for yourself and leave others the right to do the same.",
            "title_similarity": "0.5543893",
            "sentiment_compound": 0.551
        },
        {
            "id": "hdy57t2",
            "score": 1,
            "text": "This is straight from CDC:\n\n>If you are fully vaccinated and become infected with the Delta variant, you can spread the virus to others.\n\nWould the same apply to the vaccinated?",
            "title_similarity": "0.5980073",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hdydz8x",
            "score": -1,
            "text": "Vaccines don’t prevent the spread of covid, so your argument is completely invalid.",
            "title_similarity": "0.51102227",
            "sentiment_compound": -0.3976
        },
        {
            "id": "hdypt3y",
            "score": -1,
            "text": "That shit would never and i doubt any judge in Texas has been like yeah that makes sense",
            "title_similarity": "0.36486557",
            "sentiment_compound": 0.2982
        },
        {
            "id": "he04peg",
            "score": 1,
            "text": "I agree with the idea of \"blue\" states passing laws similar to the Texas anti-abortion law so that it can be challenged and shot down.\n\nI don't think Covid is a good topic for it though.  This is actually real harm done by the unvaccinated.  If you infect me, you have actually done real damage, and that could be used to support the vigilanti laws.\n\nA much better target for \"blue state\" unconstitutional vigilanti enforcement law would be guns.  You could directly use the Texas law, strike out \"abortion\" and put in \"gun sales\".  Me buying and owning or selling a gun has NO direct harm to you, the same way you getting an abortion does no direct harm to me.....but Covid is different, and we need to be aware of that",
            "title_similarity": "0.8122662",
            "sentiment_compound": -0.2103
        },
        {
            "id": "hdwwdsb",
            "score": 23,
            "text": "Well your view is authoritarian and pro government power and limits the ability for citizens to exercise their freedoms. The coronavirus isn't going away, take precautions if the media has you so scared but other people are going to continue living like normal.\n\nThe authority has said to wear masks and therefore we all must and it's okay to hurt those who do not financially or even physically. It reminds me of the milgram experiment and is also quite sad.",
            "title_similarity": "0.74966973",
            "sentiment_compound": -0.5733
        },
        {
            "id": "hdx3ktt",
            "score": 108,
            "text": "OP, you do realize that fully vaccinated people can still pass the virus on to others, right?",
            "title_similarity": "0.47964835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwg6vf",
            "score": 2,
            "text": "You’re going to run into massive causation issues.",
            "title_similarity": "0.22918314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwjxg9",
            "score": 2,
            "text": "Normally I like to break into a long drawn out view changing debate when I read CMVs that interest me... but yours pulls a much simpler idea from me. Two wrongs don't make a right. The Texas law is a travesty. It'll probably get challenged multiple times in multiple ways until it falls apart or is amended into something that doesn't fly against democratic values and common sense. Many have called it a harmful form of political virtue signaling that will ultimately go nowhere. But even if it somehow stands the test of time, that doesn't make it a morally just or appropriate law, and neither would a COVID law like you suggest be appropriate or just. I shouldn't be able to sue someone for getting me sick with COVID anymore than the measles, the flu or a cold. Because despite their gross negligence, they did not attack me willfully any more than a person who wants an abortion willfully became pregnant beforehand. It's no justification for a lawsuit, in my opinion.",
            "title_similarity": "0.7109761",
            "sentiment_compound": 0.0675
        },
        {
            "id": "hdwz2ig",
            "score": 2,
            "text": "I've heard of an argument from an NPR episode that said if a blue state passed a law where you banned guns and allowed others to sue gun owners who didn't give them up, it would be a great litmus test to see if the supreme court is operating under political bias. (Context being that SCOTUS chose to let the Texas law pass because of a technicality despite its clear unconstitutionality). Perhaps the gun example would be an easier law to pass than your Covid-19 proposal because it can be hard to prove you got sick from someone especially when community spread is so high.",
            "title_similarity": "0.8513668",
            "sentiment_compound": -0.6229
        },
        {
            "id": "hdw9gmu",
            "score": 4,
            "text": "You can't prove that you caught COVID from a specific person. These lawsuits would never hold up in court. And what about people who can't be vaccinated because they're immunocompromised?",
            "title_similarity": "0.6087399",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hdylfzg",
            "score": 3,
            "text": "The vaccine is to protect you, and only you... Maybe you should sue your providers if you're getting covid out in the wild.",
            "title_similarity": "0.715271",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hdw9sx9",
            "score": 513,
            "text": "You can't track Covid to wherever you found it, it does not come with some kind of ID including the name of the person that you got it from.",
            "title_similarity": "0.28665194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdw9nqx",
            "score": 333,
            "text": "I'm not in a blue state but I am strongly pro-choice.\n\nI don't think this is a great idea. We should not be passing \"spite\" legislation. We should be passing *good* legislation that helps people. I don't believe increasing litigious activity is a good idea. You're basically just writing lawyers' fees into existence.",
            "title_similarity": "0.6282562",
            "sentiment_compound": 0.9775
        },
        {
            "id": "hdy0dsj",
            "score": 9,
            "text": "A. First things first, the elephant in the room. The symptom-reduction shot would actually have to prevent infection. Like if the shot actually worked as advertised, then how would you get infected?\n\n> When revising its mask guidance this week to urge even vaccinated people to wear masks indoors in much of the country, the Centers for Disease Control and Prevention was criticized for not citing data in making that move. Now it has — and the data is sobering. The study details a COVID-19 outbreak that started July 3 in Provincetown, Mass., involving 469 cases. It found that three-quarters of cases occurred in fully vaccinated people. Massachusetts has a high rate of vaccination: about 69% among eligible adults in the state at the time of the study. It also found no significant difference in the viral load present in the breakthrough infections occurring in fully vaccinated people and the other cases, suggesting the viral load of vaccinated and unvaccinated persons infected with the coronavirus is similar. [Source](https://www.npr.org/sections/coronavirus-live-updates/2021/07/30/1022867219/cdc-study-provincetown-delta-vaccinated-breakthrough-mask-guidance)\n\nB. Since your own vaccination is useless against the Delta strain. Legally you cannot prove you caught it from a specific unvaccinated person without eliminating every possible suspect, including the non-human.\n\n> The virus can live on surfaces like plastic and stainless steel for 2 to 3 days. [Source](https://www.webmd.com/lung/coronavirus-transmission-overview#:~:text=Research%20shows%20that%20the%20virus,breathe%20that%20air%20in.)\n\nC. No comparison, pregnancy is an intentional transmission. Additionally, anal, masturbation, & oral sex is 100% effective against pregnancy. Same for any sexual act no matter how normal or perverse when performed outside of ovulation.\n\nMedical birth control also achieves [over a 99.0% rate of effectiveness](https://www.plannedparenthood.org/learn/birth-control/birth-control-implant-nexplanon/how-effective-is-the-birth-control-implant) while a simple condom [achives 98%](https://www.nhs.uk/conditions/contraception/male-condoms/). You can even take medication after exposure and [still have a 95% prevention rate](https://planb.ca/en/faq). And finally all of these prevention measures (including sex outside of possible fertilization) can be used at the same time to further reduce odds.\n\nD. And finally, for the blind authoritarians. Obvious Republican belief in natural immunity & and the freedom to measure risk vs benefit on a personal scale aside. Democrats don't believe in penalities for making people sick because it creates more people dependant on pharmaceutical intervention.\n\n> California lawmakers have passed legislation to reduce the penalty for those who knowingly or intentionally expose others to HIV without their knowledge [Source](https://www.washingtonpost.com/news/to-your-health/wp/2017/10/09/knowingly-infecting-others-with-hiv-is-no-longer-a-felony-in-california-advocates-say-it-targeted-sex-workers/)",
            "title_similarity": "0.7027372",
            "sentiment_compound": -0.8971
        },
        {
            "id": "hdwgwt1",
            "score": 13,
            "text": "So if you get it from a vaccinated person then it’s fine?",
            "title_similarity": "0.3212643",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hdwu4s6",
            "score": 48,
            "text": "I’m vaxxed and caught it, likely from another vaxxed person (either my wife or another individual at a concert that required mandatory vaxxed) - can I also sue that individual?",
            "title_similarity": "0.6129291",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hdweaas",
            "score": 20,
            "text": "This would be a waste of court resources. Largely because it would be nearly impossible to track who gave you the virus. The virus can take anywhere from 2-14 days to incubate in a person's body. \n\nEven if you kept an incredibly detailed log of everything you did and everyone you came in contact with, it would still be difficult to prove conclusively that this person gave you COVID. \n\nHaving such a law would open the door to a lot of lawsuits that would ultimately be dismissed or lost due to a lack of compelling evidence. This would tie up court resources on more important things that they could be doing instead.",
            "title_similarity": "0.66331136",
            "sentiment_compound": -0.7584
        },
        {
            "id": "hdwb5rj",
            "score": 37,
            "text": "proving it is difficult, since on an average day people meet hundreds of people, and those with a vaccine can still transmit covid, so it would basically need to prove\n\n1 that person was the cause\n\n2 that person was the original carrier  rather then gotten it from the \"victim\"\n\n3 no safety measures were in place ( mouth masks etc)\n\n when a law is unenforceable its a bad law, when it can be abused its even worse, when there is a part of the population unable to comply with the law (immunocompromised ) the law should be scrapped",
            "title_similarity": "0.7275036",
            "sentiment_compound": -0.9264
        },
        {
            "id": "hdwbyhv",
            "score": 144,
            "text": "Causation in this case would be almost impossible to prove. No one would win a lawsuit under this law.",
            "title_similarity": "0.3973215",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hdw9zrk",
            "score": 1509,
            "text": "Part of the reason I don't like that Texas law is that I think that doing law enforcement through private citizens suing each other is a *really* bad idea. I think it would contribute to an atmosphere of fear and distrust, especially if expanded.\n\nIn short, one of my principles is opposing that style of law, and I don't think it's a good idea to grab power by abandoning principles.",
            "title_similarity": "0.6592628",
            "sentiment_compound": -0.9136
        },
        {
            "id": "hdwaobq",
            "score": 14,
            "text": "How can you prove that you got COVID from that person? Even if it is Civil and doesn't need to be beyond a shadow of a doubt it is still extremely hard to prove.",
            "title_similarity": "0.3897115",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hdwb9ol",
            "score": 1,
            "text": "Both Texas' idea, and yours, are wrong. Legislation should never exist to pit people against one another, particularly for a reward.",
            "title_similarity": "0.5771514",
            "sentiment_compound": 0.2177
        },
        {
            "id": "hdwckzy",
            "score": 1,
            "text": "What if a vaccinated person gives it to someone? Would the same fine apply?",
            "title_similarity": "0.44502622",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hdwcqlo",
            "score": 1,
            "text": "If by contact tracing you mean using the person's phone wouldn't that be warrantless search and seizure since the lawsuit would be civil and they wouldn't have been suspected of a crime?",
            "title_similarity": "0.5889983",
            "sentiment_compound": -0.5767
        },
        {
            "id": "hdwe87i",
            "score": 1,
            "text": "There is no method available to science to track that sort of thing.",
            "title_similarity": "0.13175352",
            "sentiment_compound": -0.296
        },
        {
            "id": "hdwgbjv",
            "score": 1,
            "text": "How exactly would you prove that you caught COVID from a specific person?",
            "title_similarity": "0.36282426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwkobc",
            "score": 1,
            "text": "How exactly do you intend to be able to quantify and prove that of the hundreds of people they were potentially exposed to that one particular individual was guilty? Spoiler alert: it’s impossible",
            "title_similarity": "0.6082717",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hdwkqnt",
            "score": 1,
            "text": "I think being honest, you could make a legitimate case that someone spreading COVID could indeed be sued - if the infected person dies.",
            "title_similarity": "0.6835411",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hdwod4k",
            "score": 1,
            "text": "Well how would that work? I'm sure in some instances, people know who they caught it from, but a large amount of infections would be next to impossible to trace.\n\nAnd even if you find someone who likely gave it to you, there is no verifiable way to tell that they actually did. All their lawyer would have to say is \"How are you 100% certain, without any doubt, that my client gave it to you?\" All they would have to do is find anyone who you've been in contact with at around the same time that was sick, and boom, doubt, and you lose the case.\n\nThere is just no way to do it.",
            "title_similarity": "0.7009305",
            "sentiment_compound": -0.8932
        },
        {
            "id": "hdwokzz",
            "score": 1,
            "text": "It’s gonna be a long chain of people suing each other lol, everyone caught Covid from someone (except the scientist who caught it at the lab)",
            "title_similarity": "0.5979341",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hdwool9",
            "score": 1,
            "text": "In this scenario, vaccinated people are not able to sue?",
            "title_similarity": "0.3738219",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwpc3r",
            "score": 1,
            "text": "Vaccines don’t stop the spread. There’s no case.",
            "title_similarity": "0.27349386",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hdwrd8b",
            "score": 27,
            "text": "So, if I go to a restaurant, theatre, gym etc that requires proof of vaccination and I catch Covid, could I sue the establishment?",
            "title_similarity": "0.66904855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwrrim",
            "score": 1,
            "text": "This may be the dumbest thing I’ve read in a while. Please work on your critical thinking skills.",
            "title_similarity": "0.44625974",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hdws139",
            "score": 1,
            "text": "There isn't really any way of proving a person contracted the disease from a given person. \n\nThis would just overwhelm our courts and further politicize an issue that should have nothing to do with political loyalties.",
            "title_similarity": "0.5901702",
            "sentiment_compound": 0.296
        },
        {
            "id": "hdwt58j",
            "score": 1,
            "text": "“I learned long ago never to wrestle with a pig. You get dirty, and besides, the pig likes it.” - George Bernard Shaw\n\nThe Texas law is abhorrent and using private citizens to act as de facto bounty hunters to enforce the law is not a path we want to go down. We should focus our resources on making sure that law is changed and is never enacted anywhere, including in ways one might believe would benefit “our side”.",
            "title_similarity": "0.7250477",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hdwtcpp",
            "score": 5,
            "text": "Following this idea to it's extreme. CA currently bans new models of handguns because they are unsafe due to having a technology that does not currently exist (microprinting in 2 locations). This would mean that red states could pass laws that say you need abortions using a new method that does not yet exist.( Idk teleporting the fetus out with a wormhole.)",
            "title_similarity": "0.7447689",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hdwtd0p",
            "score": 1,
            "text": "Two wrongs don't make a right.",
            "title_similarity": "0.12579562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwtouq",
            "score": 1,
            "text": "Your post is ultimately stating things against unvaccinated individuals.  But two vaccinated people can have the virus and pass it on to the other and get them sick.  Will they still be under the penalty?",
            "title_similarity": "0.7232764",
            "sentiment_compound": -0.8573
        },
        {
            "id": "hdwtt2g",
            "score": 1,
            "text": "1) how would you know who you got covid from?\n2) if you're vaccinated, how would you get covid? I thought the vaccine was \"safe and effective\".\n3) if you're not vaccinated, why would you be entitled to sue?",
            "title_similarity": "0.63880485",
            "sentiment_compound": 0.8243
        },
        {
            "id": "hdwu50r",
            "score": 1,
            "text": "Good luck ever proving it.",
            "title_similarity": "0.023062898",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hdwu91n",
            "score": 1,
            "text": "How do you single out who gave it to you? Check the medical records of every single person you've come in contact with that week?",
            "title_similarity": "0.39402562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwupuu",
            "score": 1,
            "text": "How would that even work? Unless the people in question are trapped alone together in a bunker for an extended period of time, I don't see how someone could prove a certain person gave them COVID beyond a shadow of a doubt.",
            "title_similarity": "0.3877578",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hdwurjv",
            "score": 1,
            "text": "It's a lot more legitimate than the Texas law, but it would likely prove impossible to definitively prove you caught it from any one particular person, making the law pointless.  I do think that Covid related deaths of the willfully unvaccinated should be ruled as suicides to stop life insurance payouts, though.",
            "title_similarity": "0.7652266",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hdwv8gw",
            "score": 1,
            "text": "Two wrongs don't make a right. I know it's corny, but the spirit of the Texas law is wrong, why would you carry that spirit on?",
            "title_similarity": "0.57661605",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hdwvgeh",
            "score": 1,
            "text": "How the fuck would you know for sure who gave it to you?",
            "title_similarity": "0.19517602",
            "sentiment_compound": -0.296
        },
        {
            "id": "hdwwait",
            "score": 1,
            "text": "Settings aside morale reasons for not creating spite laws or further degrading the rule of law. The supreme court shadow docket did not grant and emergency injunction against this law for ad hoc reasons that seem to be entirely political and not based on good legal judgement and certainty not legal precedent. There is no reason to think that they would do the same thing for a similar law if they did not politically agree with it.",
            "title_similarity": "0.5380183",
            "sentiment_compound": -0.4261
        },
        {
            "id": "hdwy9k7",
            "score": 1,
            "text": "How could anyone prove in a court of law they got the virus from that specific person?",
            "title_similarity": "0.5978204",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwz4ze",
            "score": 1,
            "text": "You can already do this in any state. It's just a civil lawsuit. \n\nThe burden of proof is also lower in civil court (\"preponderance of the evidence\") than in criminal court (beyond a reasonable doubt\"). \n\nThen you have to quantify your damages.\n\nThen you have to collect on any winnings. \n\nIt's difficult, but not impossible, and nobody needs to pass a new law for you to do this.",
            "title_similarity": "0.6936107",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hdwz9na",
            "score": 1,
            "text": "Impossible to prove.  Also why should we take your vaccine if it’s not working for you???",
            "title_similarity": "0.533358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdwzdnc",
            "score": 1,
            "text": "Assuming this made sense, how could you prove  who precisely is exposed you?",
            "title_similarity": "0.25478226",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hdwzq3j",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.024148101"
        },
        {
            "id": "hdx09pj",
            "score": 1,
            "text": "If they other person is vaccinated they should be fine shouldn’t they?? 🤔",
            "title_similarity": "0.39856642",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hdx1ipd",
            "score": 1,
            "text": "I’m sure that would be entertaining on court  reality shows\n\nBut really how on earth would anyone successfully prove who made them sick? I live in a large city and probably am around hundreds of people a day\n\nPlus if you are vaccinated yourself, and still get sick that seems problematic in a whole different way",
            "title_similarity": "0.67504954",
            "sentiment_compound": -0.7814
        },
        {
            "id": "hdx1pj9",
            "score": 19,
            "text": "Literally no way of proving this unless you're only interacting with one person every day.",
            "title_similarity": "0.24514058",
            "sentiment_compound": -0.296
        },
        {
            "id": "hdx1t1a",
            "score": 1,
            "text": "This is dumb, you can catch the virus from vaccinated people as well as get it when vaccinated",
            "title_similarity": "0.6311289",
            "sentiment_compound": -0.296
        },
        {
            "id": "hdx2hmn",
            "score": 1,
            "text": "Can i due for 10k if i catch it from someone who is vaccinated?",
            "title_similarity": "0.60023046",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdx3384",
            "score": 1,
            "text": "Hold on but cant we still get covid from vaccinated people too?",
            "title_similarity": "0.5245278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdx3f8t",
            "score": 1,
            "text": "How do we actually verify it came from this person 100%? And why only unvaccinated? Someone who is vaccinated and passes on a illness to me is still imposing costs to me. Same thing when it comes to other diseases like the flu. Can I now sue someone for just getting me sick? It makes no logistical sense",
            "title_similarity": "0.7926054",
            "sentiment_compound": -0.8496
        },
        {
            "id": "hdx40g6",
            "score": 1,
            "text": "And vice versa?",
            "title_similarity": "-0.055847008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdx4zjb",
            "score": 1,
            "text": "You will not be able to prove it and you will still be on the hook for court costs and attorneys fees.",
            "title_similarity": "0.4956403",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdx5spp",
            "score": 1,
            "text": "How could you possibly nail down your infection to one person?\nVaccinated asymptomatic people can transmit the virus\n\nThis Post makes no sense.  I get it, you hate Texas.",
            "title_similarity": "0.7046814",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hdx5wva",
            "score": 1,
            "text": "What if they catch covid from a vaccinated person (yes, it happens)?",
            "title_similarity": "0.51562035",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hdx688y",
            "score": 1,
            "text": "CMV: people shouldn’t describe states based on a political parties colour.",
            "title_similarity": "0.42670718",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hdx6gn6",
            "score": 1,
            "text": "How could this be proven in a court of law? How could you prove that *this specific person* gave you covid?",
            "title_similarity": "0.43992454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdx6ipf",
            "score": 1,
            "text": "Good luck proving which person you got it from.",
            "title_similarity": "0.11767624",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hdx786r",
            "score": 1,
            "text": "What an ignorant view.",
            "title_similarity": "0.040724363",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hdx8eq7",
            "score": 1,
            "text": "It is nearly impossible to prove that you got sick from a specific person, even with highly detailed contact tracing. You would just bog down the courts with a bunch of unsuccessful claims",
            "title_similarity": "0.58006907",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hdx8np0",
            "score": 1,
            "text": "Ive made this point before and I find it hilarious that the consensus is that conservatives wouldn’t feel bad if they knew they infected someone or killed someone with covid before “it’s beyond their control” or some such nonsense",
            "title_similarity": "0.6869739",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hdx9u8f",
            "score": 13,
            "text": "What happens if somebody catches covid-19 from a vaccinated person?  Can you sue them as well? Because the vaccine dosent stop you from catching and spreading it. It just reduces the chances of having server symptoms and death.",
            "title_similarity": "0.74911606",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hdx9y65",
            "score": 1,
            "text": "That's cool but vaccines don't stop the spread of covid",
            "title_similarity": "0.38582134",
            "sentiment_compound": 0.4556
        },
        {
            "id": "hdxaqiy",
            "score": 1,
            "text": "If vaccinated people can spread covid, and vaccinated people can get covid, then how would you be able to prove who you got it from? Especially considering the incubation period.",
            "title_similarity": "0.5607923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdxbkik",
            "score": 1,
            "text": "Good luck proving it dummy.",
            "title_similarity": "0.17766392",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hdxd5ye",
            "score": 1,
            "text": "I see this law tearing families apart. Not saying I'm against it. I'm just pointing out the obvious results.",
            "title_similarity": "0.62426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdxdteh",
            "score": 1,
            "text": "Just FYI, legally this follows the exact same logic as the Texas abortion ban, but in practice this wouldn’t work because in practice the US supreme court would just not allow this legal trick.\n\nThey only allowed it because they are explicitly against abortion. They set some really bad precedent, allowing states to circumvent constitutional rights, but they will obviously ignore that precedent in other issues because allowing it would basically break the constitution.",
            "title_similarity": "0.70571494",
            "sentiment_compound": -0.641
        },
        {
            "id": "hdxe4v4",
            "score": 1,
            "text": "People won't cooperate with contact tracers, then, and the virus will be able to spread more.",
            "title_similarity": "0.5643665",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdxejfj",
            "score": 1,
            "text": "Except the vaccine doesn't stop anyone from spreading the virus, and is actually causing stronger versions of the virus to appear more quickly.",
            "title_similarity": "0.41287065",
            "sentiment_compound": 0.5405
        },
        {
            "id": "hdxetf4",
            "score": 1,
            "text": "Vaccinated people are just as likely to infect you as Unvaccinated people.\n\nAlso how do you prove where an infection comes from? Do you have a drone that follows you around?",
            "title_similarity": "0.6506301",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdxfxgw",
            "score": 1,
            "text": "Vaccinated can spread covid too! Most people have had it and have the antibodies naturally which is stronger than vaccine . Fact",
            "title_similarity": "0.47612596",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hdxgc7w",
            "score": 1,
            "text": "Yeah fight stupid and fucked up with stupid and fucked up, that should work.",
            "title_similarity": "0.4451841",
            "sentiment_compound": -0.9517
        },
        {
            "id": "hdxgi6l",
            "score": 1,
            "text": "Explain to me why a disgusting authoritarian  law like that should be copied? \n\n10 months ago you made a CMV about police. I assuming that was based on your support of BLM. Now 10 months later you want to MASSIVELY increase police actions in the united states.  I don't know about you but I don't know a lot of people who have 10k to fork over right now. You would be criminalizing a massive amount of people. You don't see this as being ripe with the potential for abuse?",
            "title_similarity": "0.78461754",
            "sentiment_compound": -0.6199
        },
        {
            "id": "hdxh050",
            "score": 1,
            "text": "From my understanding, the law would have to jump through the same hoops the Texas law did, which might not go the same way in the 5th circuit and the supreme court since it’s Democratic legislation.",
            "title_similarity": "0.6446011",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hdxhbkw",
            "score": 1,
            "text": "I agree with this proposal, but only to show Texas how stupid they are",
            "title_similarity": "0.55947816",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hdxhko7",
            "score": 1,
            "text": "You would have a really hard time proving who you caught it from (beyond a reasonable doubt) in many/most cases.",
            "title_similarity": "0.34522367",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hdxicpy",
            "score": 1,
            "text": "Clarifying question. Do you realize that the existence of other laws like this would actually further legitimize the Texas law? We have a precedent based judicial system...",
            "title_similarity": "0.60142016",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hdxj8e7",
            "score": 1,
            "text": "Beyond just being against the idea of private citizens enforcing law on each other, I personally just think there's way too many reasonable doubts that nearly any case of \"he gave me COVID\" would have, and it's really not something that you *could* prove beyond a shadow of a doubt.",
            "title_similarity": "0.55252516",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hdxjz7e",
            "score": 1,
            "text": "I don't know if my comment is allowed, but I believe this is actually already law, but for the reasons others have pointed out, practically impossible to prove. \n\nIt's definitely illegal to knowingly spread a disease (like AIDS) and you can go to jail for it. Typhoid Mary did get arrested and punished if you recall. The problem is that gross negligence or even worse, intentionality, is very difficult to prove in court. \n\nHowever, the version of this that is currently grounds for a lawsuit is IMO the only one that should be. Currently you have to show that you were harmed in order to bring a suit. If it were like the current abortion law in TX, you could sue your neighbor two doors down for giving Covid to your next door neighbor, without experiencing any affect whatsoever on your life. That is not a good way of allowing lawsuits into court for a lot of reasons. It opens people up to harassment by frivolous lawsuits, and bogs down the court system making our entire legal process inefficient and therefore ineffective.",
            "title_similarity": "0.742463",
            "sentiment_compound": -0.9878
        },
        {
            "id": "hdxk0jd",
            "score": 1,
            "text": "Super duper hard to prove beyond a reasonable doubt, and 10k means its small claims court, which means\n\n* No ability for plaintiff to garnish wages\n* Hahah I ignore judgement",
            "title_similarity": "0.64348185",
            "sentiment_compound": -0.3532
        },
        {
            "id": "hdxkhvv",
            "score": 1,
            "text": "Beyond dumb",
            "title_similarity": "0.029131994",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hdxkssh",
            "score": 1,
            "text": "I think that this is brilliant, overwhelming the courts and forcing action. The point being \"too much of a goo thing\" in Texas and teaching the supreme court to be careful what they wish for.",
            "title_similarity": "0.65674186",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hdxky6g",
            "score": 1,
            "text": "Really want to stick it to the right? Do it with guns.",
            "title_similarity": "0.3533288",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hdxmot9",
            "score": 1,
            "text": "This misses the point in my opinion. Getting Covid is about blame and suing for damages. The Texas abortion law is about suing for someone exercising their constitutional right to an abortion. I think the better analogy would be for blue states to pass a law allowing someone to sue someone else for not getting a vaccine. Sure, it’s your right to not be vaccinated, but we’re letting others sue you for it now.",
            "title_similarity": "0.87615085",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hdxncfe",
            "score": 1,
            "text": "The issue with contact tracing is it is a useful part of the arsenal in limiting spread, but it is nowhere near reliable enough to prove cases to a lawsuit standard.\n\nhttps://www.lawfareblog.com/technical-difficulties-contact-tracing\n\nIn short, it's useful to show who may have been exposed, and quickly allow possible infection risks to take faster precautions, but that doesn't show that someone got it from a specific source.\n\nI get where you're going, but something like this would be nearly impossible to prove reliably enough for a lawsuit, especially since vaccinated people can get infected and spread the disease. I get the parallel you're drawing, but this wouldn't get enough successful suits to accomplish what you're going for.",
            "title_similarity": "0.644207",
            "sentiment_compound": -0.2751
        },
        {
            "id": "hdxnxw1",
            "score": 1,
            "text": "If you are afraid of catching covid you have plenty of options like getting the vaccine, wearing a mask, or just staying home. If you get covid you only have yourself to blame and even if you do get it, it’s not threatening at all if you have the vaccine.",
            "title_similarity": "0.6506905",
            "sentiment_compound": 0.4359
        },
        {
            "id": "hdxo5h2",
            "score": 1,
            "text": "How would you know who you got covid from? Also, vaccinated people that contract covid can still spread it as well.",
            "title_similarity": "0.47253007",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hdxq691",
            "score": 1,
            "text": "You appear to have missed the detail about even vaxed people can spread the virus. This law just paints another legal bullseye on your back\n\nI say that by reason of the law making you responsible for anyone that gets infected from a virus that you have no control over, I believe that even if you act with the best intentions the only way you can ensure that there is no way you can infect someone is go live in a field whilst infectious which is in most cases impossible / impractical/ too late.",
            "title_similarity": "0.74034",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hdxr0rh",
            "score": 1,
            "text": "This is bullshit. You can transmit even if you are vaccinated. This would be punishing for the wrong reason, even if punishing the unvaccinated for the right reason might be unfeasible.",
            "title_similarity": "0.6571351",
            "sentiment_compound": -0.9337
        },
        {
            "id": "hdxt4jt",
            "score": 1,
            "text": "I think this will never ever be possible since it's not possible to without a shadow of a doubt prove that person A gave you COV-19.   \n\n\nUnless i'm missing something?",
            "title_similarity": "0.41133982",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hdxuiwg",
            "score": 1,
            "text": "As long as you’re wearing a mask it should be good no? \n\nI mean, of COURSE we’re all vaccinated in here mar ight? \n\nMask up save lives!",
            "title_similarity": "0.5603516",
            "sentiment_compound": 0.7752
        },
        {
            "id": "hdxuknf",
            "score": 1,
            "text": "are we even trying to contact trace anymore? I'd imagine you'd need definitive proof of contact at the very least.",
            "title_similarity": "0.34831306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdxvfrq",
            "score": 1,
            "text": "Weaponizing the local government against people you don’t agree with is not the way to go about this. That is what is at the root of this problem. \nAlso contact tracing to this degree would be pretty much impossible. Every single person you ever come in contact with throughout the day is crazy. If you take public transportation, all those people who have been on the bus or metro that day, when you’re at work in a public building all those people because masks aren’t 100% effective, restaurants. \nNot defending the Texas law at all because it highly violates bodily autonomy.",
            "title_similarity": "0.6268448",
            "sentiment_compound": -0.0818
        },
        {
            "id": "hdxvzjp",
            "score": 1,
            "text": "But … the vaccinated still spread and get sick. Why can’t you people understand this? Ya been duped.",
            "title_similarity": "0.5870273",
            "sentiment_compound": -0.8462
        },
        {
            "id": "hdxw5et",
            "score": 1,
            "text": "Yes as if American wasnt sue happy already, let's make it fucking worse bud. Genius.",
            "title_similarity": "0.57645726",
            "sentiment_compound": -0.5706
        },
        {
            "id": "hdxw7g8",
            "score": 1,
            "text": "Why not from vaccinated person?",
            "title_similarity": "0.27971742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdxwgka",
            "score": 1,
            "text": "What about when a vaccinated person spreads it?",
            "title_similarity": "0.3322028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdxwkrn",
            "score": 1,
            "text": "I wish I could do this where I live just got covid a second time and it's the worst thing ever at least I won't remember most of it",
            "title_similarity": "0.5213586",
            "sentiment_compound": -0.34
        },
        {
            "id": "hdxxhwg",
            "score": 1,
            "text": "Accelerationism does not work, has never worked, and is all around a terrible idea. It's based on the fallacy that you can race to the bottom and make it so blindingly obvious that nobody can deny things need to change. But there is no bottom, and there is no absurdity that won't be defended by someone.",
            "title_similarity": "0.4975689",
            "sentiment_compound": -0.81
        },
        {
            "id": "hdxxztz",
            "score": 1,
            "text": "Democrats have spent like the last 30 or so years refusing to stoop to Republicans' level. It's morally principled, and it has also cost them a lot of political leverage, supreme court seats etc. over the years. They've held the moral high ground for a long time, even though nobody in the American voter base seems to give a flying fuck about that.\n\nI like fighting dirty for the right cause, but this doesn't seem like the battle to sacrifice your dignity on. Not after playing clean for several decades straight.",
            "title_similarity": "0.63973606",
            "sentiment_compound": -0.7252
        },
        {
            "id": "hdxyrbg",
            "score": 1,
            "text": "How can you possibly prove who you caught Covid from?",
            "title_similarity": "0.35877746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdxzccz",
            "score": 1,
            "text": "If vaccinations drive escape variants, should the unvaccinated be able to sue the vaccinated for 10k?",
            "title_similarity": "0.76495755",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hdxzrr0",
            "score": 1,
            "text": "You can still spread covid even when you are vaxxed....",
            "title_similarity": "0.24725243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdy0x6h",
            "score": 1,
            "text": "Can I sue someone who is vaccinated for giving me COVID? There’s no reason they aren’t equally responsible for transmission",
            "title_similarity": "0.6841632",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hdy2o3d",
            "score": 1,
            "text": "So, do yourself justice pretty much ? How about reestablishing duels while we're at it ?\n\nBesides, for a beotian like me, it seems extremely complicated to prove beyond doubt that sick person infected you rather than an asymptomatic person during your last grocery trip. It's likely, but not beyond doubt, so I would be forced to acquit every time.",
            "title_similarity": "0.7820121",
            "sentiment_compound": -0.1141
        },
        {
            "id": "hdy2ppv",
            "score": 1,
            "text": "What about suing someone vaccinated who gave you the Kung flu?",
            "title_similarity": "0.61256117",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hdy2rpy",
            "score": 1,
            "text": "Why is Texas using leaves for pages instead of paper?",
            "title_similarity": "0.42508107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdy5ci8",
            "score": 1,
            "text": "Currently the feds are suing Texas to get rid of that unconstitutional craziness and forcing them to pay the feds for wasting their time. I don't think any other state wants in on that.",
            "title_similarity": "0.7940233",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hdy5ife",
            "score": 1,
            "text": "Unenforceable and impossible to prove",
            "title_similarity": "0.07413912",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdy5r3w",
            "score": 1,
            "text": "How would you confirm that you got it from that person",
            "title_similarity": "0.12281382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdy6pha",
            "score": 1,
            "text": "You are not entitled by the law to roam around this world without inhaling any of it’s other natural micro organisms. Please explain why covid should be the one exception.",
            "title_similarity": "0.586956",
            "sentiment_compound": 0.4563
        },
        {
            "id": "hdy7r2e",
            "score": 1,
            "text": "Where is the empirical evidence that a vaccine stops you from transmitting covid?",
            "title_similarity": "0.56936896",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hdy7s48",
            "score": 2,
            "text": "A lot of people are dismissing this but I have to ask, is this not what we do with other transmissible diseases?\n\nI do believe that the person transmitting the disease must be *aware* they have the disease, and be *intentionally* spreading it.\n\nI am nearly certain that in America that is a felony, RE: Aids.",
            "title_similarity": "0.70877725",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hdy7tds",
            "score": 1,
            "text": "You can catch covid from a vaccinated person. What kind of moronic logic are you using? If you got the vaccine what do.you have to worry about?",
            "title_similarity": "0.6321782",
            "sentiment_compound": -0.8049
        },
        {
            "id": "hdya6vu",
            "score": 1,
            "text": "You do under how difficult it is to say one person gave you Covid right? That’s kind of going to be a long term problem for suing anything regarding it and one of the things most governments and companies are banking in on when it comes to liability. It’s obvious that, at least in the US, our amazing dumbass former president caused a huge increase to our death total but he probably won’t see litigation for it because he can hide behind this fog of lies and what ifs.",
            "title_similarity": "0.7189041",
            "sentiment_compound": -0.8898
        },
        {
            "id": "hdyapsu",
            "score": 1,
            "text": "It’s absolutely impossible to prove where you got your Covid from and there has never been a time in human history where we had a right to sue people over transmissible viruses. Now that we know vaccinated people easily spread the disease as well (check out the mess in Israel) this is even dumber. The difference between punching someone and viral transmission is intent to harm and the ability with certainty to know where it came from.",
            "title_similarity": "0.6925417",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hdyauh6",
            "score": 1,
            "text": "Then they would be just like Texas.",
            "title_similarity": "0.27676558",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hdybi4b",
            "score": 1,
            "text": "Or simply charge them with attempted murder/murder/manslaughter or whatever your local law allows.  Charge whatever media personality that misinformed them with accessory, the same crime or whatever your local law allows",
            "title_similarity": "0.6687965",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hdybsrl",
            "score": 1,
            "text": "What if the offender was planning on getting vaccinated but was asymptomatic for covid?",
            "title_similarity": "0.56872743",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hdyc01u",
            "score": 1,
            "text": "I don’t think a law needs to be passed on this. You can sue anyone for most anything in civil court. You can just do it, find yourself a politically motivated judge, and bam you got yourself a win. \n\nShouldn’t you also be able to sue vaccinated people whom you got the virus from?",
            "title_similarity": "0.785799",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hdyc9eb",
            "score": 1,
            "text": "If you disagree with torture as a means to an end, you don't torture your enemies even when they have used torture against you in the past.",
            "title_similarity": "0.5439601",
            "sentiment_compound": -0.6834
        },
        {
            "id": "hdyclnc",
            "score": 1,
            "text": "For people that don’t get it: the TX abortion ban is unconstitutional, no one is arguing it’s not. In Roe v Wade, Wade was the DA, they lost the case which is what makes abortion protected by the constitution. \n\nHowever with the new TX abortion ban because they put citizens in charge of enforcing it (via the $10k bounty) instead of the District Attorney, the court can’t strike it down because there is no one to sue. It’s essentially a loophole. \n\nOP is right, democrats should pass unconstitutional laws using the same loophole to force through their agenda, putting pressure on the court system to close this loophole. It’s not 2016 anymore, democrats need to get down and dirty and fight fire with fire.\n\nThe newest episode of 99% Invisible podcast does a great job explaining this.",
            "title_similarity": "0.8549373",
            "sentiment_compound": -0.9251
        },
        {
            "id": "hdyd99y",
            "score": 1,
            "text": "What if they catch it from a vaxed person..... You do realize fully vaxed people still spread covid right?",
            "title_similarity": "0.510861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdydqz7",
            "score": 1,
            "text": "So the problem is that its clear they past the law because they wanted to not because its legal. I might have missed it but this is one of the first time we didn't get a trail or a opinion of why its legal they just said it is.  And with that in mind even if blue states do the same thing they find away to say how its different because again its not about law its about this one thing. So you risk weakening this branch even more long term because since it has no real power to enforce arguably if enough states just start ignoring it. \n\nSo, you potentially destroy a branch of goverment to fix an issue that can be fixed as soon as a judge dies",
            "title_similarity": "0.6480714",
            "sentiment_compound": -0.9649
        },
        {
            "id": "hdyg329",
            "score": 1,
            "text": "Yesss, let the hate flow through you, like Texas does. Brothers will sell each other over Covid and sisters will sell each other over failed pregnancies…",
            "title_similarity": "0.7127366",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hdyiemc",
            "score": 1,
            "text": "Yep, to beat the lunatics you sometimes need to ‘out-lunatic’ them. Pass this abortion style law for guns and watch the Supreme Court close this loophole faster than the NRA can credit their accounts.",
            "title_similarity": "0.7803667",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hdyk4nb",
            "score": 1,
            "text": "Fuck no. Don’t race to the bottom by stealing plays from the worst team.",
            "title_similarity": "0.51866907",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hdykide",
            "score": 1,
            "text": "I agree that any state—regardless of their political leaning—can set up a bounty system just like Texas. The problem with your hypothetical scenario is that it’s almost impossible to show definitively that you got Covid from one person. So you’ll most definitely lose in court.",
            "title_similarity": "0.7751829",
            "sentiment_compound": 0.3774
        },
        {
            "id": "hdyko1r",
            "score": 1,
            "text": "Maybe one day prosecutors won't be required to provide evidence for criminal complaints before the court.\n\nThen we can build camps and round up all these pesky unwanteds.\n\nThen we can force the anti-vaxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxers to be injected so that when we are infected with covid from them, it will be okay because they are vaccinated. We'll get sick and spread the virus as well, but it's okay because we are compliant. I have 5 vaccinations, so each time I've been hospitalized with covid this year, everyone is thanking me for being more vaccinated. It makes me a better person. \n\nMy aunt who died from covid only got 4 vaccinations, so we didn't even have a funeral for her. What a stupid idiot! Her husband refused the vaccine and almost died, but we had him put down anyways since he isn't vaccinated and has murdered hundreds of people already. \n\nRemember, it's only okay to get covid if the person who is sick and contagious was injected with the vaccine. Without the vaccine, those infected people who spread covid are murderers and should be removed from the gene pool.",
            "title_similarity": "0.7677479",
            "sentiment_compound": -0.9939
        },
        {
            "id": "hdykoqj",
            "score": 1,
            "text": "Ah, yes, the perfect comeback...a butt load of people trying to catch Covid.\n\nCheckmate, Texas!",
            "title_similarity": "0.48879492",
            "sentiment_compound": 0.7712
        },
        {
            "id": "hdykq5e",
            "score": 3,
            "text": "1. These \"sue people for 10K\" laws are terrible and encourage ripping society apart at the seams.\n2. You shouldn't legislate with revenge as a motive.",
            "title_similarity": "0.69156814",
            "sentiment_compound": 0.4545
        },
        {
            "id": "hdyl3vd",
            "score": 1,
            "text": "It would be a totally unenforceable law. You can’t prove beyond a reasonable doubt who you contracted it from.",
            "title_similarity": "0.41961664",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hdylpof",
            "score": 1,
            "text": "So did they make it retroactive and this is how they get repetitions for slave owners? That would be fucked.",
            "title_similarity": "0.5656927",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hdylqh0",
            "score": 1,
            "text": "I'd add that anyone who spreads HIV or Herpes or any std should be able to be sued in civil court and charged criminally. Same if someone rapes or \"creampies\" without consent.",
            "title_similarity": "0.73491436",
            "sentiment_compound": -0.7885
        },
        {
            "id": "hdyn1d7",
            "score": 1,
            "text": "Frankly, your proposed law isn't stupid enough to fully mock the Texas law.\n\nOne of the worst parts of the law is that anyone can sue; you don't have to show that you were harmed by the abortion at all. So, the better analogy would be, a law that allows anyone to sue anyone for 10k on the suspicion that they didn't get vaxed. No need to prove you were negatively affected in any way.",
            "title_similarity": "0.7901714",
            "sentiment_compound": -0.7863
        },
        {
            "id": "hdyncdu",
            "score": 1,
            "text": "Then i get to sue obese people who spread COVID at a much higher rate than those at a normal weight.",
            "title_similarity": "0.5482857",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdynznn",
            "score": 1,
            "text": "Well who says you CANT sue someone already for them giving you covid?  If you suffered financial damages from it, you absolutely can.  The problem is, will you win?\n\nFirst you'd have to prove that it was them specifically who gave it to you. The defense would ask for a log of places you've been and almost certainly (unless you're a shut in) convince the judge that your travel history is either misleading (because you wouldn't want to prove where you have been) or that you yourself have been out and about enough to assume the risk. (ex: your honor if the plaintiff can visit Starbucks daily and go to yoga class twice weekly, couldn't it be assumed that they could have gotten it there?)\n\nAlso would you have suffered any more or less damages had the defendant gotten the vaccine? You either suffered damages or you didn't.\n\nLastly sueing people for transmittable diseases is a nasty precedent. A society that sees one injustice and says, \"hey let's even it out by punishing the other side with this injustice\" is surely a nasty hateful society. We really are better than that.",
            "title_similarity": "0.76538515",
            "sentiment_compound": -0.9819
        },
        {
            "id": "hdyo5n5",
            "score": 1,
            "text": "Sure.\n\nBut there's no reason to not include the vaccinated who can still contract and spread.",
            "title_similarity": "0.39843547",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hdyorfs",
            "score": 1,
            "text": "It’s a legal impossibility. You have to prove proximate causation and actual causation to succeed in a tort claim. Covid is *the most* contagious pathogen known to man. If you’re exposed, you are extremely likely to catch covid. The vaccine prevents the immune response, and not the transmission itself. There would be plenty of cases where a person with a vaccine exemption for legitimate medical reasons is accused of infecting someone they did not infect, and there is no way to prove which person infected you definitively. If you so much as ordered groceries or allowed a person into your house when you weren’t there, you could have gotten it from them instead of the one unvaccinated person you came across that day. Because there is no way to prove definitively how you got covid, it’s very likely that people with the money to do so will just sue the people who don’t have money to defend themselves. People who have not spread covid will absolutely have judgments leveled against them under a law like this if we relax causation standards. I’m not defending the voluntarily unvaccinated. This law would in effect punish the indigent and the ill even if the text of the law doesn’t do it.",
            "title_similarity": "0.78462636",
            "sentiment_compound": -0.7501
        },
        {
            "id": "hdyoti6",
            "score": 1,
            "text": "Can I sue the vaccine makers if I get a breakthrough infection?\n\n/s \n\nI know they have immunity.",
            "title_similarity": "0.6764306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdyoyg4",
            "score": 1,
            "text": "No no no. That's ridiculous. You really need to change your outlook. \n\nI mean, what the redhatdiots are doing is criminal and mimicking their tactics makes the mimic criminal too. \n\nBesides - 10K is way too small. You can't get a hospital bed and an aspirin for a day for that kind of money.\n\n100K. Now we're in the park.\n\nSo, please reconsider your position and let's not repeat republican criminality. Besides - I'd hate for those redhat pimple squeezings to be able to say \"look! They say we're dumb, but we taught them libs how to do that!!\".\n\nLike insult to injury.",
            "title_similarity": "0.78965575",
            "sentiment_compound": -0.9236
        },
        {
            "id": "hdyq0rk",
            "score": 1,
            "text": "You shouldn't have to catch it. There should be a bounty just for knowing someone is unvaccinated and turning them in.",
            "title_similarity": "0.492123",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdyq29s",
            "score": 1,
            "text": "Blue, red, it doesn't matter, they're both paid (bribe money) by big pharma who has the most to gain, and has gained billions. If blue was like red, low life scum, then we'd have seen anything similar, but we haven't. It's as if blue let red get away with treason, and they have.   \nThey entire system needs reform that includes media.",
            "title_similarity": "0.7425716",
            "sentiment_compound": -0.2377
        },
        {
            "id": "hdyqlue",
            "score": 2,
            "text": "What you are saying sounds cool on the surface, but cannot practically be implemented or enforced.\n\nThe major flaw I see is people who are vaccinated can still contract and spread Covid. I'm not arguing unvaccinated people do not spread it easier or are more likely to spread it. Rather, this idea fails to acknowledge that a vaccinated person could get covid from another vaccinated person, but they would have no recourse under your proposed law.\n\nWhich begs the question: What's this laws purpose? Is it meant to punish unvaccinated people, or is it to provide recompense for the person who gets it? It seems like this law is really meant to punish people who are unvaccinated. Which if that's the case, many people will be unjustly punished.\n\nPeople who cannot get the vaccine for a legitimate medical reason would be punished under these laws. It would not be fair or just that a person who wants to get vaccinated -- but cannot due to a legitimate medical reason-- would be liable for giving someone covid. In this scenario you would be punishing someone for having a medical condition they can't control.\n\nAlso, what about kids? Currently children are not legally allowed to get the vaccine. If somebody gets covid from an unvaccinated child, who is liable? Their parents? Again it does not seem fair or just to be punishing a child / their parents for something they are legally not allowed to do.",
            "title_similarity": "0.68542105",
            "sentiment_compound": -0.9876
        },
        {
            "id": "hdyqppj",
            "score": 1,
            "text": "So your answer to authoritarianism is ... more authoritarianism? \n\nRepublicans absolutely do not give a shit about the life of unborn. They care about Texas and Florida turning blue, and are trying to get everyone who would vote Democrat to leave and go somewhere else so they can maintain power.",
            "title_similarity": "0.7301825",
            "sentiment_compound": 0.7117
        },
        {
            "id": "hdyqrba",
            "score": 1,
            "text": "I love this.",
            "title_similarity": "-0.11475655",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hdyr28e",
            "score": 1,
            "text": "While I agree with your sentiment, how would one prove that a specific person gave them Covid?",
            "title_similarity": "0.3194312",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hdyr7d8",
            "score": 3,
            "text": "Short of a covid positive unvaccinated person walking into your home, where you’ve been alone for 2 weeks with zero contact with the outside world, announcing they are covid positive and unvaccinated and coughing directly on your face, nobody would ever be able to win under your proposed law. If you’ve gone to the grocery store in the past week, you lose. If you’ve gone to any social event, you lose. If the covid positive person is asymptomatic and never got tested, you lose. If the person has a health reason where they can’t get the vaccine, you lose. Plus, the data shows if you’ve already had COVID, you have antibodies and enjoy a degree of natural immunity. If that’s true, then choosing to decline the vaccine because you’ve already recovered from covid and have antibodies is not “knowingly” endangering others. That is a very high intent level to prove. In the legal context, knowingly means that the person knew with substantial certainty that they would spread covid to the other person. \n\nIn addition, it’s generally futile to sue someone who doesn’t have deep pockets. In a car accident or slip and fall, you can sue the insurance company. But there’s no insurance policy that would cover a person spreading covid to someone else. That means even if you go through the insanely expensive process of proving causation, all you have is a judgement against a person with no assets. You may as well just have your health insurance pay the bills and walk away because it would cost far more to have your bills paid by the unvaccinated defendant under your proposed law.",
            "title_similarity": "0.5957101",
            "sentiment_compound": 0.1712
        },
        {
            "id": "hdyre7q",
            "score": 1,
            "text": "How do you prove who you got it from?\n\nIt’s Litterally impossible\n\nAlso how come only unvaccinated people if a vaccinated person gave you covid they shoulda stayed home",
            "title_similarity": "0.5870323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdyrjea",
            "score": 1,
            "text": "Legislation that reduces bodily autonomy has gone so well. \n\nHow would you respond if someone who is vaccinated gives you covid? Is the outrage not similar?",
            "title_similarity": "0.6293679",
            "sentiment_compound": -0.2308
        },
        {
            "id": "hdyrmfc",
            "score": 1,
            "text": "How do you prove someone passed the virus on to you?  Is this some kind of new technology?",
            "title_similarity": "0.5041084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdys3tn",
            "score": 1,
            "text": "Simple point here, most of the time you cannot pinpoint exactly who gave you covid. Like at a work place or a job or a campus, sure there may be regulations indoors but if it's not digitally attended, then you're passing by so many people moving from place to place.",
            "title_similarity": "0.3241369",
            "sentiment_compound": 0.34
        },
        {
            "id": "hdysc0b",
            "score": 1,
            "text": "that actually is different than the tx law cause you would have suffered a real harm and have standing in court, where in tx you can sue anyone for an abortion without even knowing them, regardless of the abortion angle, it really is a terrible law due to this concept",
            "title_similarity": "0.7187912",
            "sentiment_compound": -0.7239
        },
        {
            "id": "hdysk62",
            "score": 1,
            "text": "Ah yes. The old fighting fire with fire. The only problem is, when it's over all you're left with is *more fire*. itd be better just to end the law all together.",
            "title_similarity": "0.62278354",
            "sentiment_compound": -0.7264
        },
        {
            "id": "hdysp37",
            "score": 1,
            "text": "At the top, it says DELTA FROM OP \n\nOP is out here passing around the Dela variant like it's nothing",
            "title_similarity": "0.33549702",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hdystfd",
            "score": 1,
            "text": "If we play by their rules then how are we different?",
            "title_similarity": "0.2792651",
            "sentiment_compound": 0.34
        },
        {
            "id": "hdysthz",
            "score": 1,
            "text": "Like jeff from hr gave you covid? Or maybe lisa? Kyle possibly? Or maybe the vaccinated guy Mike? Maybe it was my neighbor or the mailman, my buddy terry?  How the fuck you gonna tell and what happens when someone gets it from a vaccinated person?",
            "title_similarity": "0.6033446",
            "sentiment_compound": -0.4515
        },
        {
            "id": "hdysyw1",
            "score": 1,
            "text": "It's not ok to degrade society everywhere because someone somewhere doesn't do something you like. An eye for an eye makes the world blind, and putting in laws for dumb lawsuits can only lead to bad precedence to follow. We shouldn't encourage more laws like the one in Texas that make individuals vindictive for things that displease them and attack others for such small burdens of proof as \"I caught covid from this guy specifically\" or \"they said they had an abortion\"",
            "title_similarity": "0.7703028",
            "sentiment_compound": -0.9119
        },
        {
            "id": "hdyt4iw",
            "score": 1,
            "text": "But the Texas law isn't set up that way.\n\nTry harder next time, and don't be such a moron.",
            "title_similarity": "0.52601993",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hdyvdvf",
            "score": 1,
            "text": "That’s a stupid law.\n1) how do you prove you got it from the person you’re suing\n\n2) if you’re vaccinated, it would seem stupid to blame an unvaccinated for you catching the virus again, shouldn’t you blame the vaccine?\n\n3) there’ll always be that one person purposefully trying to make a quick buck by getting infected and suing everyone",
            "title_similarity": "0.7745194",
            "sentiment_compound": -0.9517
        },
        {
            "id": "hdywe9q",
            "score": 1,
            "text": "That's gonna be pretty hard to do since you can't tell who you caught covid from.\n\nOn top of that, unless you wear a hazmat suit and stay at home, you can't say that you've taken every possible measure to not contract covid. So there's no argument for you to sue an unvaccinated person even if they pass covid to you unless they knowingly have covid and sneeze/cough on you.",
            "title_similarity": "0.63356113",
            "sentiment_compound": 0.7393
        },
        {
            "id": "hdywer6",
            "score": 1,
            "text": "I am conservative.  I support this idea , EXCEPT why limit it to $10k?",
            "title_similarity": "0.5595785",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hdywmc9",
            "score": 1,
            "text": "You can't prove who gave you the disease.\n\nIt's possible that you contacted an unvaccinated person who had it but you didn't get it.\n\nAlso, you can't be forced to take a vaccine.",
            "title_similarity": "0.50841165",
            "sentiment_compound": 0.4973
        },
        {
            "id": "hdyy0tk",
            "score": 1,
            "text": "This will only work on the basis of these criteria in the name of freedom and equality:  \n\n\nA vaccinated person contracts it from an un-vaccinated person\n\nAn un-vaccinated person contracts it from a vaccinated person\n\nA vaccinated person contracts it from someone who is vaccinated\n\nAn un-vaccinated person contracts it from someone who is un-vaccinated\n\nSince everyone can still become infected, and if it doesn't apply to everyone across the board, then there is heavy prejudice being practiced.\n\nI'm woke and won't stand for prejudice, racism, homophobia, trans phobia, vaxphobic, unvaxphobic in this country.",
            "title_similarity": "0.75924766",
            "sentiment_compound": -0.7429
        },
        {
            "id": "hdyyljp",
            "score": 1,
            "text": "It will be very hard to prove how you caught it. In the court of law you need to prove beyond any reasonable doubt that the allegation happened.\n\nAlso, it’s not a zero to one thing, you need to be exposed to a certain amount of the virus for you to be infected. What if you got exposed from multiple sources and the combined amount was what made you sick? How do we decide whose fault it is then?",
            "title_similarity": "0.72320426",
            "sentiment_compound": -0.9053
        },
        {
            "id": "hdyyrmm",
            "score": 1,
            "text": "Can I sue if a vaccinated person gives me Covid ? Because it can be spread by anyone.",
            "title_similarity": "0.62606037",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdyyybl",
            "score": 1,
            "text": "I'm assuming you are against the Texas Law?  Why would you advocate for something you are against?",
            "title_similarity": "0.58490616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdyzl06",
            "score": 1,
            "text": "The vaccines are effective. Unvaccinated are not putting the vaccinated at risk. Some of us have natural immunity. That neutral immunity may last forever but you aren't ready for that conversation",
            "title_similarity": "0.5519711",
            "sentiment_compound": -0.1065
        },
        {
            "id": "hdz0hd9",
            "score": 1,
            "text": "Haha i mean how tf do u think thatd work there champ? Not exactly a direct line to who u got it from if u got it, even the most direct line wouldnt be direct enough for a court",
            "title_similarity": "0.44889712",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hdz0o27",
            "score": 1,
            "text": "The system is already bogged down by frivolous lawsuits meant to discourage public participation. I don't believe giving people an excuse to use to law as a weapon is a wise idea. Especially considering even if the defendant is not found liable they face legal fees.",
            "title_similarity": "0.6077139",
            "sentiment_compound": -0.409
        },
        {
            "id": "hdz0vo6",
            "score": 1,
            "text": "\"You gave me covid!\"\n\n\n\"No I didn't.\"",
            "title_similarity": "0.2506681",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdz1myd",
            "score": 1,
            "text": "Next step suing someone for catching cold?",
            "title_similarity": "0.40886262",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hdz1o97",
            "score": 1,
            "text": "You can't sue for someone making you sick, as it's nearly impossible to prove who it came from. It could be some random person you walk by on the street, or it could be the person you suspect it came from, but as far as I know, the germ or virus, for lack of a better term, does not have markers to indicate who the disease came from. \n\nI think STDs are an exception as that is easier to trace.",
            "title_similarity": "0.61784077",
            "sentiment_compound": 0.431
        },
        {
            "id": "hdz21vx",
            "score": 1,
            "text": "So, instead of trying to stop states from becoming absolutely horrible, we should just create equal horrible states all over because then things will be even??? \nSeriously, wtf?",
            "title_similarity": "0.61410165",
            "sentiment_compound": -0.9307
        },
        {
            "id": "hdz2t1b",
            "score": 1,
            "text": "Your ability to actually prove you got Covid from someone outside of intimate contact will be slim to none. What would be the compensation should you contract Covid from someone who is vaccinated? Can I sue Pfizer, Moderna or J&J? I dig what the OP is proposing but think it's all too vague.",
            "title_similarity": "0.68324775",
            "sentiment_compound": 0.1053
        },
        {
            "id": "hdz37bl",
            "score": 1,
            "text": "This is a classic case of whataboutism.",
            "title_similarity": "0.15602511",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdz3qt5",
            "score": 1,
            "text": "Texan here. This is just political posturing from Abbott and his followers. Just give it a little bit and it’ll sort itself out.",
            "title_similarity": "0.6229278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdz47m6",
            "score": 1,
            "text": "Too hard to track/prove how someone caught COVID.",
            "title_similarity": "0.3482804",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hdz49n6",
            "score": 1,
            "text": "No, you can't stoop to their level. Stop encouraging partisan science. The left has to take the hard line that science is not political.",
            "title_similarity": "0.52412546",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hdz4bva",
            "score": 1,
            "text": "What would them stop someone for suing another for passing the common cold? That would be a very slippery slope.",
            "title_similarity": "0.5158248",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hdz51d5",
            "score": 1,
            "text": "Such an American solution 😂",
            "title_similarity": "0.20657113",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hdz5cnl",
            "score": 1,
            "text": "How are you going to prove who you got covid from?",
            "title_similarity": "0.25427598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdz5mc4",
            "score": 1,
            "text": "How do you plan on proving who specifically you caught it from?",
            "title_similarity": "0.2645684",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdz6vci",
            "score": 1,
            "text": "How effective has this been in combatting the pandemic? If Texas is still suffering it may not be worth the trouble.",
            "title_similarity": "0.6840576",
            "sentiment_compound": -0.5213
        },
        {
            "id": "hdz7w02",
            "score": 1,
            "text": "How on earth can you prove a specific person passed on covid to you?",
            "title_similarity": "0.36299127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdz8g38",
            "score": 1,
            "text": "Disagree because how to you prove beyond a doubt that a single person gave you covid? Its not like a an STD where you can typically pinpoint the spreader with a reasonable degree of confidence.",
            "title_similarity": "0.47643647",
            "sentiment_compound": -0.4423
        },
        {
            "id": "hdz8gwf",
            "score": 1,
            "text": "How do you prove that? You can't.",
            "title_similarity": "0.089521304",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdz8t07",
            "score": 1,
            "text": "But you can get it from vaccinated people too, what’s the difference lol",
            "title_similarity": "0.43829826",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hdz9dkp",
            "score": 1,
            "text": "Way too many issues with this but the big two are:\n\n1.There is absolutely no way to tell, even through contract tracing who got it from who and that just starts a chain of lawsuits tying up the judicial system and wastes an extreme amount of time and money.\n\n2. There are medical and religious reasons people cannot get vaxxed.  You cannot or at least should not be able to sue people who have a problem medically nor should you be able to sue someone based on religion.  \n\nAnother thing I don't understand is when people on reddit claim one political party \"plays by the rules\" and the other doesn't.  Really? I've yet to see a politician from any party be moral or ethically upstanding.  THIS SHOULDN'T BE A POLITICAL ISSUE.",
            "title_similarity": "0.7008198",
            "sentiment_compound": 0.2289
        },
        {
            "id": "hdz9fkx",
            "score": 1,
            "text": "So the argument goes:\n\nI took a vaccine to avoid getting a virus, but still got it, so I'm going to blame someone else for not taking the vaccine that didn't work for me. What if you spread it to someone else after getting the shot that didn't work? What if they too are vaccinated?\n\nPeople have really made a religion out of this vaccine thing.",
            "title_similarity": "0.67745566",
            "sentiment_compound": -0.714
        },
        {
            "id": "hdz9i9b",
            "score": 1,
            "text": "Point blank. Its not right to do it in Texas anymore than it is anywhere else in this country. Two wrongs don't make a right, just makes everyone seek vengeance",
            "title_similarity": "0.6253499",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdz9jn0",
            "score": 1,
            "text": "Well the thing about that is there is a large difference between choosing wether or not to get a vaccine and killing a baby. And there is no way to tell who you got COVID from.",
            "title_similarity": "0.6683527",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hdzaen9",
            "score": 1,
            "text": "Maybe Texas should take a leaf out of the Federal Government's playbook. \n\nYou can have an abortion, but if you can't or aren't willing to show evidence that you didn't have an abortion you lose your job.",
            "title_similarity": "0.79323584",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hdzbd37",
            "score": 1,
            "text": "I don't think it would be possible to prove who gave you Covid-19. That would be a huge roadblock to such a law. \n\nOther than that, great idea.",
            "title_similarity": "0.5282137",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hdzcorv",
            "score": 1,
            "text": "If the vaccinated person catches covid, then doesn't that mean the vaccine didn't work? Why sue those who want to wait for a proven vaccine? Sue the pharmaceutical companies for providing a flawed vaccine? Or dont sue anyone",
            "title_similarity": "0.7270789",
            "sentiment_compound": -0.5171
        },
        {
            "id": "hdzcq6m",
            "score": 1,
            "text": "How on earth would this be implemented in a reasonable and not-easy-to-abuse fashion?",
            "title_similarity": "0.29367387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdzdixr",
            "score": 1,
            "text": "This is just braindead, lmao",
            "title_similarity": "0.14469613",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hdze0ps",
            "score": 1,
            "text": "How would you prove where it came from, or that it was from a specific person?",
            "title_similarity": "0.12432313",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdzhxwa",
            "score": 1,
            "text": "You do know that vaccinated people can still pass the virus?\n\nAnd still how would you be able to prove where exactly you got the virus from?",
            "title_similarity": "0.5540204",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdziu59",
            "score": 1,
            "text": "It's too arguable and abusable. Are you sure that's where you caught it? Are you sure that person was negligent? How do you exactly define those terms? It's far too legally blurry.",
            "title_similarity": "0.54710793",
            "sentiment_compound": 0.4836
        },
        {
            "id": "hdzj8jo",
            "score": 1,
            "text": "Whoa. Calm down Satan. \n\nWhat about our allergic peeps and such",
            "title_similarity": "0.468644",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hdzjdsr",
            "score": 1,
            "text": "I'm honestly surprised we haven't seen more wrongful death suits or manslaughter charges filed, especially towards politicians and champions of the anti-mask/vax crowd. INAL though so I have zero idea how that would work.",
            "title_similarity": "0.63257843",
            "sentiment_compound": 0.2551
        },
        {
            "id": "hdzje96",
            "score": 1,
            "text": "Yes the answer to bad policy is more bad policy. Also, one of the benefits of a federalist system like the US is the ability for states to differentiate and adapt their laws to a smaller segment of the population than the federal government. While I this the TX abortion law is terrible, using a bad law in one state to justify a bad law in another is a terrible idea. States should just try to make good policy and lead by example not get into petty policy wars wherein the general population is always the loser.",
            "title_similarity": "0.7319573",
            "sentiment_compound": -0.913
        },
        {
            "id": "hdzkhdt",
            "score": 2,
            "text": "You’re missing the point of the Texas law. \n\nWhat you’re describing here is tort, which is simply your right to take someone to court who has harmed you (commonly known as a civil suit). This right already exists, the government doesn’t need to pass any laws to allow it. There doesn’t need to be a crime (I.e. a law broken), just harm done.\n\nThe Texas law isn’t tort because the person taking the woman or the doctor to court hasn’t been harmed in any way. It’s the state empowering private citizens to enforce a crime.\n\nA proper blue state counter law would have to be a law that is clearly unconstitutional as established by precedent, and which includes a penalty for the lawbreaker which is then given give to a private citizen as a bounty for informing the authorities. \n\nA better Covid related example would be something like a mask mandate that applies even in one’s own home, or an outright vaccine requirement (as opposed to a requirement for vaccination in order to be employed or to go certain places). I’m pretty sure those are both unconstitutional. And then of course with the bounty for snitching, just like with the Texas law.",
            "title_similarity": "0.697297",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hdzkokj",
            "score": 1,
            "text": "I’m guessing you’re also a fan of the $10k bounty on women who get abortions",
            "title_similarity": "0.6668308",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hdzkxt0",
            "score": 1,
            "text": "How on earth are you going to prove that person X gave you Covid?",
            "title_similarity": "0.3681268",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdzl2ec",
            "score": 1,
            "text": "You won’t be able to prove",
            "title_similarity": "0.08214605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdzlaao",
            "score": 1,
            "text": "Except that's literally impossible to prove",
            "title_similarity": "0.053596698",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdzm059",
            "score": 1,
            "text": "I hate these types of laws so wouldn't want another. But this wouldn't work anyway. No way to definitively tell who you caught covid from.",
            "title_similarity": "0.5145401",
            "sentiment_compound": -0.0691
        },
        {
            "id": "hdzmp8d",
            "score": 1,
            "text": "And for the ones that catch it from a vaccinated individual?",
            "title_similarity": "0.37104064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdzmrz0",
            "score": 1,
            "text": "Vaccinated people still spread the virus. Good luck proving who gave you the disease",
            "title_similarity": "0.52240765",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hdznxpk",
            "score": 1,
            "text": "What if they had a breakthrough case, and transmitted the virus while vaccinated? \n\nWhy the 10k price tag? \n\nWouldn't it make more sense for the infector to pay the infected's hospital bills?\n\nAssuming there are any hospital bills, since 25% of infections are asymptomatic and less than 5% of cases result in hospitalization.\n\nSeeking damages in a legal setting should be the result of exactly that \"damages\". So while I could see an argument for paying for hospital bills, a flat 10k payment for anyone that spreads covid (intent notwithstanding) seems unreasonable.\n\nI would like to see criminal penalties imposed on anyone purposefully infecting others, or even some type of system in which someone who infected another by negligence would be held responsible for the medical bills incurred. \n\nI feel like comparing the (frankly terrible) Texas legislation to this issue is like comparing apples to oranges, one policy is based on an ethical/moral issue, the other would theoretically be based on public health. \n\nThe only thing I think they have in common is that they're both terrible ideas.",
            "title_similarity": "0.80824983",
            "sentiment_compound": -0.9192
        },
        {
            "id": "hdzpeqs",
            "score": 1,
            "text": "\"As verified by contact tracing\"\n\nHow exactly can you prove that a specific person infected you beyond a reasonable doubt?  The vast majority of cases would result in the judge tossing the lawsuit.  Even if the person was found guilty, it wouldn't be a big deal (read below)\n\n  \nIf the only purpose of this law would be to make people's lives miserable by just randomly suing someone who is unvaxxed to cause them to have to waste time and money, you will find that many people, even the ones who are on your side would be disgusted by your very mean approach and you would turn off some of your own supporters.\n\nIn addition, in this day and age, I can see an easy way in which right leaning people would be galvanized to fight for what they believe through go fund me pages to help individuals sued by malicious actors pay for their court fee and if they lose, pay the fine.\n\nIt would only make people less likely to get vaccinated.\n\nAnd it would not change a thing in Texas.",
            "title_similarity": "0.77065915",
            "sentiment_compound": -0.9493
        },
        {
            "id": "hdzr8ql",
            "score": 1,
            "text": "Ok let's work out what this law would actually do.\n\nAs OP describes, if you catch COVID-19, you call your lawyer. She tells you the following:\n- You can sue anyone who is (a) unvaccinated, (b) also Covid-positive, and (c) linked to you via contract tracing.\n- If you prove those three facts, that person is legally responsible for \"all medical costs\" (unclear whether that includes costs not borne by you, e.g. costs paid by Medicaid).\n\nHowever, your lawyer is very skilled. So she makes a few more points:\n- By far the largest population of people who are unvaccinated are children under the age of 12, who are legally prohibited from getting vaxxed, most of your potential defendants likely do not have any appreciable assets. You are able to pursue the children's parents' assets, but expect a long and messy battle.\n- Because liability is predicated on the contact-tracing program, which is wholly voluntary, that program has collapsed. No one cooperates with contact tracers anymore, even the vaxxed, since almost everyone is closely related to an unvaxxed child who would be vulnerable to suit.\n- You also have a problem with making good-faith pleadings. Unless you happen to personally know an unvaxxed person who was symptomatic around the time you encountered him, you have no good way of identifying unvaxxed people to sue. Contact tracing typically does not identify *who* exposed you, for medical privacy reasons (some, but not all, of which are federal statutes). Even when they do, learning that person's vax status is another problem for you. It's legal to ask someone if they're vaxxed, but it's rare that you can compel them to answer. So your choices are either (a) subpoena their medical records, or (b) allege that you believe they are unvaxxed without proof. Either option involves a big possibility that you will go after an actually vaccinated person, who will likely be displeased at having to litigate this issue. Unlike the Texas statute, there's no prohibition on cost-shifting, so if we guess wrong expect the judge to slap us with sanctions (possibly including professional discipline for the lawyer) for vexatious litigation.\n\nNow, as the chief sponsor of this statute in the legislature, no doubt you've thought through these issues and judge them insignificant in light of the public policy benefits. But from the standpoint of a potential plaintiff, it's far from clear that your lawyer will advise you to file suit.",
            "title_similarity": "0.7440754",
            "sentiment_compound": -0.9804
        },
        {
            "id": "hdzt4yv",
            "score": 1,
            "text": "Agree",
            "title_similarity": "-0.17098083",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hdzt9ao",
            "score": 1,
            "text": "What you're proposing isn't actually that weird. It would be a standard case of \"this person caused me some damage, therefore I should be able to sue them to recover it.\" That's what the civil law is supposed to do.\n\nWhat makes the Texas abortion law particularly weird is that it lets people sue *despite having no loss*, and despite not being injured in any way by the person they are suing.\n\nSo a closer analogy would be a law allowing people to sue anyone not wearing a mask, or not getting vaccinated, for a minimum of $10k (plus costs), whether or not they have covid-19 and whether or not they pass it on to anyone.\n\nExcept it wouldn't work, as courts would have no problems striking it down as unconstitutional. The Texas abortion law isn't still in force because it found \"one weird trick to get around the US Constitution\" but because there are enough judges (both on the 5th Circuit Court of Appeals and the US Supreme Court) who don't care, and are willing to let an obviously unconstitutional law stand to advance their personal political views. That wouldn't apply to our proposed mask-mandate/vaccination law.",
            "title_similarity": "0.90425956",
            "sentiment_compound": -0.2667
        },
        {
            "id": "hdztt46",
            "score": 1,
            "text": "OK, this raises lots of questions and the comments hit on some of them. But why only blue states? Why not all states, or one in particular?",
            "title_similarity": "0.3357976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdzul2i",
            "score": 1,
            "text": "That seems petty. \n\nGoing for my first delta here 😆",
            "title_similarity": "0.22456476",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hdzv356",
            "score": 1,
            "text": "And that's the door they didn't realized they opened.",
            "title_similarity": "0.16644616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdzv8er",
            "score": 1,
            "text": "Um no. You cannot control who gets what from an airborne virus. But what you're saying is a vaccinated person should sue an unvaccinated person for not getting vaccinated, when the vaccination didn't stop the vaccinated from getting covid, but the vaccine would have stopped the unvaccinated person from giving or getting covid?  Also. Good luck proving where it came from.",
            "title_similarity": "0.78875047",
            "sentiment_compound": 0.8986
        },
        {
            "id": "hdzw9a5",
            "score": 1,
            "text": "It's a terrible law, what happened to seperation of church and state? I find it amazing that republicans that dont want Gov't involved in people's lives are okay when it comes to \"relgious\" stuff. They really should be ashamed of themselves, but we all know that's an emotion most of them haven't had in YEARS.\n\nYour point though is a tough one, getting an abortion early to midterm doesn't impact someone else's life (who's already a living person). Where as catching COVID leads to a decent chance of suffering serious illness and has ramifications on multiple people. Some woman gets an abortion, other women she passes aren't going to \"catch an abortion\"\n\nLetting people freely sue people for medical stuff is a slippery slope, but Texas started it so at this point it's free game. \n\nIf anything blue states should pass a law that unvaccinated people forfeit their rights to medical treatment for COVID",
            "title_similarity": "0.72742957",
            "sentiment_compound": 0.1045
        },
        {
            "id": "hdzxcx5",
            "score": 1,
            "text": "Doesn't make much sense given the vaccinations don't stop you catching or spreading covid.",
            "title_similarity": "0.4752363",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hdzxenl",
            "score": 2,
            "text": "If you're vaccinated how are you catching the virus? Surely this isn't even applicable because a vaccinated person can't catch the virus, regardless if an unvaccinated person with the virus comes near you. Surely it can't be because the vaccine doesn't do anything to prevent you getting the virus. What would be the point in getting the vaccine if you can still get the virus?",
            "title_similarity": "0.62060636",
            "sentiment_compound": 0.7399
        },
        {
            "id": "hdzxg9n",
            "score": 1,
            "text": "I think this is a funny line, and probably great on a bumper sticker or perhaps at a party. But how would you ever prove who caught what from whom?\n\nCalifornia makes it legal to give AIDS to others, how is this idea going to work?",
            "title_similarity": "0.61106014",
            "sentiment_compound": 0.755
        },
        {
            "id": "hdzxky6",
            "score": 1,
            "text": "So what you're saying is that people who have taken the vaccine have a less likelihood of spreading the virus? Because cause data doesn't prove that. You can be a carrier and spread it whether you're vaccinated or not. So why should someone who refused the vaccine be treated any differently?\n\nBTW, people don't trust the vaccine because of the media. When Trump was in office, you heard Pelosi and the democrats saying they won't take the virus because they don't trust Trump. Democrats get elected, now the tune changes and expect everyone to change with their flip flop.",
            "title_similarity": "0.7435205",
            "sentiment_compound": -0.8542
        },
        {
            "id": "he01n9s",
            "score": 1,
            "text": "How are you going to prove transition vector? Especially down to a single person that you can sue. Without a way to concretely prove it was a specific person, the lawsuit would likely be dismissed. Your point make no logical sense once that very basic question is asked.",
            "title_similarity": "0.6334167",
            "sentiment_compound": -0.4767
        },
        {
            "id": "he04cbe",
            "score": 1,
            "text": "Google isn't turning up this law. Do you have it available for context?",
            "title_similarity": "0.30664295",
            "sentiment_compound": 0.0
        },
        {
            "id": "he06hfk",
            "score": 1,
            "text": "It falls flat because it is almost impossible to prove in a court of law that a certain someone's cough got you infected. Dumb.",
            "title_similarity": "0.55985844",
            "sentiment_compound": -0.6597
        },
        {
            "id": "he0bk6q",
            "score": 1,
            "text": "Good luck \"proving\" someone contracted it from a specific person. With so much not being known about the virus still, people would have a hard time in court proving contraction from a specific perpetrator in most cases with obvious exceptions for the isolated elderly and people like that. These health decisions by individuals are markedly less of an externality than say, oil refineries, sea oil rigs, the average factories' carbon footprint. Why are you so concerned with what an individual does, when its corporations and politicians systematically causing way more harm than the sum of most individuals not getting vaccinated?",
            "title_similarity": "0.74311113",
            "sentiment_compound": -0.3167
        },
        {
            "id": "he0c5eg",
            "score": 2,
            "text": "Good luck proving that.",
            "title_similarity": "-0.011837287",
            "sentiment_compound": 0.7096
        },
        {
            "id": "he0chsl",
            "score": 1,
            "text": "No, for one simple reason:\n\nIt would create a perverse incentive for people to catch COVID-19 on purpose.",
            "title_similarity": "0.4916076",
            "sentiment_compound": 0.2023
        },
        {
            "id": "he420tj",
            "score": 1,
            "text": "I am a democrat and pro-vaccination. \n\nHowever, as others pointed out, enforcing law through citizens is a really bad idea. Take a look at Stalins USSR, where people could write “donosy” (were pretty much written disclosures of someone possibly disapproving of Stalin to the government) on their neighbors or whomever they didn’t like. This caused everyone to live in constant fear of being snitched at for something even possibly non-existent. So, I generally don’t think that either of those ideas are good. \n\nOn top of that, how do you even prove that someone gave you COVID?\n\nEDIT: I don’t think OP actually is up for passing this law, he just wants to ridicule Texan law and point out the absurdity of it",
            "title_similarity": "0.6640407",
            "sentiment_compound": -0.1513
        },
        {
            "id": "he8kgub",
            "score": 1,
            "text": "Theres no way to know without a shadow if a doubt who you caught covid from",
            "title_similarity": "0.39945298",
            "sentiment_compound": -0.5719
        },
        {
            "id": "he9ngfv",
            "score": 1,
            "text": "A.) It's basically impossible to prove where you caught it from, especially since it takes several days before you even know you have it.\n\nB.) Covid is technically a living thing, which acts according to it's own volition. Unless you intentionally infect someone, you have no tort against someone who got sick and you caught the virus from them.\n\nC.) If you don't extend this tort to vaccinated people as well, it will almost certainly run afoul of federal law and the constitution. Texas's law probably does as well, but fucktarded media commentators are acting like declaratory relief isn't a thing.",
            "title_similarity": "0.75397563",
            "sentiment_compound": 0.7932
        },
        {
            "id": "he9tdq9",
            "score": 1,
            "text": "Yeah, a bunch of mostly white people suing into bankruptcy a majority POC unvaccinated population.  See how that goes with the old \"everything is racism\" narrative.\n\nhttps://www.newsweek.com/vaccine-mandates-black-lives-matter-activists-collision-course-democrats-1631612",
            "title_similarity": "0.707209",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hecm7r4",
            "score": 1,
            "text": "Bruh",
            "title_similarity": "-0.089016736",
            "sentiment_compound": 0.0
        },
        {
            "id": "heh51o4",
            "score": 1,
            "text": "There’s a significant problem with that. First, it’s not even illegal to be vaccinated anywhere in the United States, and certainly not federally, so that law would have no basis in the Constitution. \n\nSecond, when in public, where people sometimes have to go regardless of personal lockdown or safety status, you have no idea if the person walking past you is vaccinated or not. Unfortunately the illness is so infectious that you usually can’t even pinpoint where you got it, unless you never leave your house and someone you know didn’t know they had it and came over or something. It’s such an imprecise situation that the person targeted with the lawsuit is not even that likely to have been the one to spread it. \n\nLastly, vaccinations aren’t intended to make you impervious to catching the illness. They never have been. That’s not a feasible or scientific way to look at them. They’re not a cure, just a safeguard to prevent you getting the illness so severely that you end up in the hospital or dead. Studies show that vaccinated people can spread it to other vaccinated people just as much as anyone else. So by that logic, another vaccinated person can spread it to you just as easily, and they should get sued as well. That’s like getting the flu during flu season and just…suing the person who gave it to you. Senseless. I get that the flu’s severity is much, much lower and I’m not trying to compare them in that capacity. But come on.",
            "title_similarity": "0.577811",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hem16wb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.024148101"
        },
        {
            "id": "henwa12",
            "score": 1,
            "text": "The same for vaccinated people who broke social distancing and masking? \n(Seriously wondering what your opinion is on this.)",
            "title_similarity": "0.60426843",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hg8fusl",
            "score": 1,
            "text": "So if I work at a hospital, treat your grandfather for covid 19, catch covid... I can sue him for 10k and if he dies, I can sue your family?\n\nSee that is the flaw of this logic. Covid isn't like HIV where you have a definitive route of transmission. Covid can't really be pinned on anyone so Im sure this law would be abused more than anything",
            "title_similarity": "0.8726205",
            "sentiment_compound": -0.034
        },
        {
            "id": "hh6f0by",
            "score": 1,
            "text": "What about catching it from vaccinated people, this seems very arbitrary as vaccination doesn’t actually lower transmission chance, just lower hospitalization risk",
            "title_similarity": "0.52912945",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hh8xkf7",
            "score": 1,
            "text": "Let’s not double down on the dumb-shittery",
            "title_similarity": "0.2703699",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhcjmo9",
            "score": 1,
            "text": "I thought the vaccine prevented you from getting Covid ???",
            "title_similarity": "0.57968664",
            "sentiment_compound": 0.163
        },
        {
            "id": "hhhh6qv",
            "score": 1,
            "text": "How will u prove ? Probably spend much more than 10k in sueing  and still get nothing. Typical leftist economist..",
            "title_similarity": "0.6426785",
            "sentiment_compound": 0.0
        }
    ]
}