{
    "CMV: if you are non-binary, it is ok and completely normal for strangers misgender you.\nUPDATE: my friend made an update. it is clear this original post and discussion from my friend was just venting. They had a polite conversation with the business and they were understanding will probably think about it more in the future. I still think venting on a public platform is not the best way about going about things…but I get it (their most recent update with less frustration was really a much better explanation of the story).\n\nAn AFAB non-binary friend just posted a tirade on Instagram about how a complete stranger misgendered them over the phone! Then someone else responded about how they should report the business and also shared stories about being misgendered by strangers and how horrible it is for people to assume gender (they also are AFAB and present quite feminine). \n\nI get that it can be triggering if you have gender dysphoria but you just can’t expect strangers to just guess or never speak in gendered terms when it is so ingrained in our experience. I understand generally questioning why our experience and culture is so gendered but you can’t expect individual strangers to never assume gender because a small percentage of the population is non-binary. Many other issues have triggers…and you learn you are responsible for managing your own triggers (unless someone does it deliberately).\n\nIt is a different story when it isn’t a stranger and they are aware of your gender identity.\n\nI’m cisgender and of course don’t really understand what it is like to be non-binary and what dysphoria is like for my friend. I respect their identity without truly understanding it. But I feel if you are going about the world with these kinds of expectations for complete strangers, you will just be angry all the time. \n\nI’m interested in hearing other perspectives on this to see if it changes my view.\n\nEdit: i have awarded some deltas! Two aspects of my view have changed: \n\n1) in a one on one customer service setting there are really not that many reasons to use gendered language. So it is understandable to be frustrated when people insist on using it. \n2) this was venting and their platform where they have enby friends who understand. I highly doubt they will storm into the business and complain about the individual. More likely they’ll politely mention the issue and help the business be more accommodating. \n\nI’m sure there are more people here who shared similar views and I didn’t give you a delta, but i did not expect so many responses. \n\nThanks all!": [
        {
            "id": "hek3ios",
            "score": 1,
            "text": "/u/lobelia28 (OP) has awarded 6 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/pwyhhs/deltas_awarded_in_cmv_if_you_are_nonbinary_it_is/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5493656",
            "sentiment_compound": 0.6124
        },
        {
            "id": "heivvbk",
            "score": -4,
            "text": "It can be completely normal for something to happen and still not be 'ok'.\n\nPlus, 'a complete stranger misgendered them over the phone' can mean a lot of things. If the only thing your friend was complaining about was someone misgendering them once before getting corrected, sure, that's a bit silly. But if the person on the phone misgendered them, your friend corrected them, and the person on the phone continued to misgender them, that is absolutely shitty and something worth complaining about.",
            "title_similarity": "0.762244",
            "sentiment_compound": 0.1307
        },
        {
            "id": "hejcft6",
            "score": 1,
            "text": "I think the whole conversation is dumb. Be a good person and repect people. If thats not enough for some people i dont think youre the issue. Life isnt hard, sometimes people are just difficult- and that spans beyond the people who were upset youve discussed in your point btw (yes i admit even i can be difficult at times over certain things!)",
            "title_similarity": "0.6507923",
            "sentiment_compound": -0.3391
        },
        {
            "id": "hek0gz9",
            "score": 0,
            "text": "I’m a pansexual, cis-dude that was super into feminist philosophy in high school and college and OPs post reminded me of something I find really frustrating with today’s discourse.\n\nWhen I was studying feminist philosophy it was easily one of the most complex topics I’ve ever studied as a grad student. Even now I’d say it’s basically a given that gender and sexuality is super complicated and forces us to wrestle with norms, language, binaries, human essentialism, etc.\n\nNow it seems like, and I think this is because both LGBT people are sick of being fucked with but also because of the nature of todays discourse, everyone snaps back at someone like they have all the answers. People act like non-binary is super easy to understand and absorb like it’s basic arithmetic. But it’s not, it’s such a rebellious concept, and all the feminist philosophers I read knew that these topics were opaque as hell.\n\nMost of the people that are being yelled at about this think non-binary is mind blowing, like quantum physics or something. I don’t see why the natural impulse is to act like this stuff is easy. Because even groundbreaking thinkers on this knew they were challenging ways of thinking that not only everyone believed, but often didn’t even know could be questioned at all. \n\nBut because any remote questioning is considered a bad faith attack, everyone wants to act like this is simple. And this can probably be applied to most topics now but especially this one. \n\nAnd I’m NOT saying people that are discriminated against should have to bend over backwards and deal with bullshit. But at the same time, I would think if I was non-binary I would know that even for people like me who are super into LGBTQ stuff, this shit is super hard to grasp.\n\nHalf these people acting like this is easy are the ones who complain that there’s too many passwords or complain when they have to wait an extra few minutes at a restaurant. It’s like, you barely act like an adult and Im supposed to trust you’re some gender studies PhD that just gets it all?",
            "title_similarity": "0.57782304",
            "sentiment_compound": 0.9871
        },
        {
            "id": "hej8mob",
            "score": -8,
            "text": "When is it required to use gendered pronouns? Almost never. Use they/them for anyone you don’t know the gender for, and people won’t notice. Simply don’t say “sir” or “ma’am”. If someone tells you their pronouns, use them correctly. \n\nWhile being casually misgendered is not a fun experience for many trans people, most will understand (though, again, misgendering is never necessary if you use gender neutral language) but what really gets annoying and potentially abusive is repeated misgendering when the other person knows your pronouns. \n\nWhether you decide to use gender neutral language (they/them/theirs instead of he/him/his and she/her/hers) or ask people’s pronouns at the start of a conversation, it’s a small, easy step to avoid hurting others. \n\nAdditionally, strangers misgendering others don’t only affect nonbinary trans people — binary trans people may not “pass” as cis, and with more than 3% of the population thought to be trans (and that percentage gets higher in younger people who hate been exposed to the idea of being queer), going about your day in a way as intentionally not hurt others is probably a good idea.",
            "title_similarity": "0.6664113",
            "sentiment_compound": -0.9145
        },
        {
            "id": "hejs5b0",
            "score": -11,
            "text": ">I’m cisgender and of course don’t really understand what it is like to be non-binary and what dysphoria is like for my friend. I respect their identity without truly understanding it. But I feel if you are going about the world with these kinds of expectations for complete strangers, you will just be angry all the time.\n\nWe are angry, a lot. It's frustrating to live in a world that wasn't designed for us and is often built to be actively hostile to us. Honestly, let me ask you this: would you tell a black person \"if you're going about the world expecting people to not call you the n word, you will just be angry all the time\"? I would hope the answer is no, because you understand the progress that needs to be made.\n\nEDIT: some people have pointed out that this is a bad analogy. I want to clarify, I am in no way equating the harm done by racial slurs and the harm done by accidental misgendering. All I am doing is pointing out that expecting non-binary people to just accept a world that's not accommodating to them is as counter to progress as if you were to say that to a black person. Again, I am in no way equating it, but the mindset similarly stands against progress.\n\nOur entire point is that the world needs to be accommodating, and telling us to lower our expectations just re-enforces the status quo. That won't matter to you because you're cisgender; the status quo was built for people like you. Coming from a person who thought they were cis for most of their life, that's likely why you're thinking we should just accept the status quo. It works for you, so you can't really understand why it doesn't work for us.\n\nSecondly, while I can't speak for your friend, calling them an AFAB non-binary person kind of misses the point of being non-binary. Plus, you basically just revealed their assigned sex, with is something many are uncomfortable with others knowing. Again, maybe your friend is ok with it, but I just wanted to let you know.\n\nI hope I haven't come off as too aggressive here. I just want to clearly state that this is a matter of us wanting a world that we can actually be ourselves in. Telling us to just accept the world as it is is counter to our goals. Sure, in the interim, we'll have to take what we can get, but that doesn't mean we're not allowed to be mad that it's not where we want to be.",
            "title_similarity": "0.576885",
            "sentiment_compound": 0.6771
        },
        {
            "id": "heje7zy",
            "score": 2,
            "text": "(Non-Binary person here) I agree with you that we live in a gendered society and I go into every interaction with a stranger expecting to be misgendered, I’m pleasantly surprised when I’m not. I also agree with acewayofwraith that being misgendered both ways can be affirming. It’s important to note that non binary doesn’t always mean androgynous look, they then pronouns. (Although I know your post was specifically talking about someone who did fit into that category. I’m not telling you you’re wrong about them by any means.) Non binary is a very wide sliding scale that’s more complex than a lot of people think. \nTwo more things:\nAlthough again, this isn’t an argument with you so much as it is an addition and nuance; I think we as individuals should aim to change our gendered language. it’s ingrained in us, but we can be part of a slow and gradual change. \nI’d also be careful stating your opinion on trans issues as a cis person in the future. The fact that you’re doing it on here and not just to state your opinion makes a big difference. Just think before you post anything else of this nature (not suggesting that you didn’t think before posting this) because when you don’t fully understand something it’s easy to become ignorant and offensive.",
            "title_similarity": "0.70019627",
            "sentiment_compound": 0.0374
        },
        {
            "id": "hejbzeg",
            "score": 338,
            "text": "I'm suspicious of that story and would ask for clarification. By your implication, the conversation went something like this:\n\n>Friend: \"Hi I'd like to buy X.\"\n\n>Stranger: \"Sure ma'am it'll be Y dollars.\"\n\n>Friend: \"OMG I'm not a woman I'm a man! I'm reporting you!\"\n\nIf that's approximately how it went, then I think most people will agree that's an overreaction at best. However, what if the conversation was actually this:\n\n\n> Friend: \"Hi I'd like to buy X.\"\n\n>Stranger: \"Sure ma'am it'll be Y dollars.\"\n\n>Friend: \"Actually I'm a man, I go by he/him.\"\n\n>Stranger: \"Whatever lady, do you want to buy it or not?\"\n\nNot a big change, and your description of \"mis-gendered over the phone\" could just as easily describe this conversation as well. If this is how the conversation went, then your friend would be fully justified to be angry and to report the business for being rude to them.",
            "title_similarity": "0.6933507",
            "sentiment_compound": 0.9855
        },
        {
            "id": "hej34js",
            "score": 23,
            "text": "I'm in a lot of lgbt subs (I'm cis myself though). I think you could get a better idea of if it's a big deal or not by asking on r/LGBT or whatever the enby sub is\n\nEdit: though if you're told repeatedly and still get it wrong they'd probably have the right to get upset then",
            "title_similarity": "0.59187293",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hej80gf",
            "score": 2,
            "text": "I'm mostly in agreement with you but I think the phrasing of its always okay isn't the right approach. Okay, think of it like this, there's a person named Brianna, you're entire life you've always heard it as BrE-Ahna but one day you meet someone who goes by BrE-ANna. Very likely you're going to mess up and slip to your default BrE-Ahna when addressing them initially.\n\nNow very likely they'll be cordial and understand that it was an innocent mistake and correct you and you all move on with you now being aware that some Brianna's aren't pronounced the same. That's the key part, you're aware, so now in the future you can do your diligence to perhaps ask before just blurting out your default association. \n\nIf you go on from that interaction (or even within that interaction) continue to to mess up it's pretty reasonable that people will get upset (i think we can agree that it's especially justifiable after someone has corrected you) and you can't really fault them that. It can get exhausting having to constantly correct because people aren't willing to put in the work to challenge their defaults.\n\nIn the case of non-binary folk, while I can't speak for them, I've no doubt many have made some peace(if you can call it that) with being misgendered upon initial interaction with new people. Simply because it's understandable doesn't mean we should just endorse the misgendering happening as a rule. \n\nI know for me i make an effort to use gender neutral 'they' pronouns on initial interactions with folks. Deliberately asking sadly is a point of mistaken anger for a lot of people so usually with most cishet or older folks it can be pretty safe to switch to he/she pronouns after getting a feel for them in conversation or with context clues from others.",
            "title_similarity": "0.71773756",
            "sentiment_compound": 0.835
        },
        {
            "id": "hejlpb1",
            "score": 1,
            "text": "There are a lot of trans people in the upcoming generations over 25% of youth today identify as trans and/or non-binary. It's not a small percentage of the population, nor does that make it ok to misgender someone. There are fewer Irish people than non-binary people, does that make it ok to treat them differently or never assume anyone is Irish and completely ignore their existence?\n\nIt may be new concept to some, but as many have pointed out, it's not. A what point do we recognize that most people \"should\" know that gender is not binary?\n\nFurthermore, what characteristics make it ok to assume someone uses he/him pronouns? Clothes? Clothes and their associated gender have changed so many times- heels started as men's shoes, boys wore pink, etc. Makeup? Does the rock wearing lipstick mean we should use she/her? OK what about facial hair? There are cis women with naturally occurring full beards. The same could be said for any other trait that we have historically associated with one gender or another. Cisgender XY males can grow breasts, have high voices, be shorter or skinnier in stature.\n\nThe reality is that humans have always been diverse and taking a second to use they/them or ask pronouns is really as courteous as asking someone's name. We can't look at someone and know their name by just their appearance. The same is true for gender. We also don't expect all people named Jamie to look or act the same, nor do we disparage any Jamie's who don't behave or look the way we personally think a Jamie should behave- that would be ridiculous. Gender is the same. Just because society sucked for a long time and tried to pretend otherwise doesn't make it ok.",
            "title_similarity": "0.5500879",
            "sentiment_compound": 0.9294
        },
        {
            "id": "hej015g",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejuuxp",
            "score": 0,
            "text": "the way it, if i cant make up in my head a safe assumption of their pronouns, i automatically stick with they/them",
            "title_similarity": "0.5157788",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hek4xql",
            "score": 0,
            "text": "If you are non-binary and you couldn't care less what your gender is, why is it important to that others should? Really though, who has time for this nonsense....",
            "title_similarity": "0.4339425",
            "sentiment_compound": -0.6063
        },
        {
            "id": "hek83bq",
            "score": 0,
            "text": "A wise co-worker once told me that being offended is a choice. I guess some people love the drama and choose to let things like that offend them. Gender seems to have changed from physiological to \"feel\"ilogical.. and how are you supposed to know what a stranger feels like as far as what they choose to identify themselves as? Ya I don't know.",
            "title_similarity": "0.7159692",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hel2b4z",
            "score": 0,
            "text": "I’ll probably be labeled a TERF for this, but whatever…\n\nI think that trans people and their super supporters have gone fucking rabid about this stuff. They’re super hostile, and really kind of need to just grow up. \n\nI get it that it would hurt if someone intentionally and/or maliciously misgenders you. Im not talking about that. But society is based around two pronouns and it’s a bit ridiculous to expect people to know that you prefer some oddball pronoun that you picked out of a lineup of dozens of made up options (ze/hir, etc.) People also are not accustomed to using they/them as a singular pronoun. Call yourself whatever you want, I don’t care, but you can’t get butt hurt when you pick some random ass pronouns and no one uses them in public. How are they supposed to know?! If you’re presenting as female I’m calling you ma’am, if you present as male I’m calling you sir, unless you direct me to do otherwise. It’s not malicious, it’s just words. No one is doing it just to hurt your sensitive feelers.\n\nIm sick to death of seeing people flip out about this stuff on social media. You got misgendered. No one punched you. Im a lesbian and dress like a dude, I get sir’d all the time and guess what…life goes on. I couldn’t care less what people call me, I don’t understand why they make such a big deal out of pronouns. It’s literally just words. \n\nBe pissed about trans people being ostracized and murdered or assaulted, that’s fucking upsetting and not okay. But Christ, pick your battles. It seems like just such a minor fucking thing to get your panties in a twist over. Life is too short to spend it fucking outraged about minor shit.",
            "title_similarity": "0.6122831",
            "sentiment_compound": -0.9949
        },
        {
            "id": "heiytsx",
            "score": 641,
            "text": "Yeah idk I’m “cisgender” myself but I still don’t like it when people “misgender” me. \n\n \nI think people came up with a new word (“misgender” and/or “cisgender”) and suddenly everyone thought it was describing a new phenomenon, but, fucking, *nobody* likes being misgendered. That’s always been true. \n\n\nAlso, slightly off topic, not every new word is Orwellian “newspeak” sometimes people gotta take a damn breath. \n\n\nAlthough, that being said, the idea that gender is not a simple binary, *is* new. It’s *very* new to *a lot* of people. \n\n\nAnd I’m of two minds when it comes to whether it’s better to get emotive to help people remember or be calm and patient because that’s the best way to teach. \n\nBut I’m not gonna go about telling someone their personal experience and reactions are invalid. I’m just interested in what way is theoretically the best way to help people who are encountering new ways of thinking and being. \n\nAnd I tend to lean toward “be calm and patient”, because I do think that’s the best way to teach people new things. But while that’s easy in theory, it is, I’m sure, much less so when someone has to keep explaining something about themselves to people.",
            "title_similarity": "0.6837504",
            "sentiment_compound": 0.9952
        },
        {
            "id": "hejck0r",
            "score": 6,
            "text": "I think it's fair for them to be upset, dysphoria makes people irrational. When I have been misgendered in public (trans guy) I'm never offended. It's not malicious. Also, I don't pass as male (yet) so it's understandable.",
            "title_similarity": "0.74562955",
            "sentiment_compound": -0.2406
        },
        {
            "id": "hejnrg2",
            "score": 3,
            "text": "Gender is defined by sex, which manifests itself in physical characteristics such as face shape, body type, etc. It's perfectly normal for someone to make assumptions about your sex based on your looks because that's a natural neurological response. \nIt really isn't necessary at all for a stranger to call you by your preferred pronouns. Friends and coworkers and other people you see on a regular basis, sure. But someone you're speaking to over the phone once doesn't need to know, nor do they care, especially if they're a customer service worker or something like thst.",
            "title_similarity": "0.6888303",
            "sentiment_compound": 0.7057
        },
        {
            "id": "hejmywy",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejng02",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hek1kzc",
            "score": 1,
            "text": "IS normal vs SHOULDNT be normal. Why cant you have a conversation with a person and learn them? Why does it hurt you to show a modicum of respect?",
            "title_similarity": "0.5645709",
            "sentiment_compound": -0.168
        },
        {
            "id": "hekbkan",
            "score": -1,
            "text": "im not homophobic but can someone explain to me how ANYONE can be non binary. how can you just look at a pair of tiddies and be like you dont like them",
            "title_similarity": "0.59413946",
            "sentiment_compound": 0.1494
        },
        {
            "id": "hejx5r3",
            "score": 22,
            "text": "I worked as a server for years, and in the more professional environments I was taught to *never* gender someone if at all possible. I was trained not to use any gendered pronouns and it only took a few weeks to not fall back on the “sir” or “ma’am” I was raised to use. Honestly, sometimes you don’t know what gender someone is and you need to be prepared! I have also dated a slender guy with long hair who regularly got called “ma’am” from behind and then apologized to when he turned around and they saw his beard. That could have easily been avoided.\n\nSo no, it is not ok for strangers to misgender you  in settings where they are providing customer service because they should be trained not to do that. In everyday life…eh. It’s hard to expect *everyone* to get on board, but people working with the public should absolutely be avoiding gendered language, especially now.",
            "title_similarity": "0.6962896",
            "sentiment_compound": -0.3299
        },
        {
            "id": "heiwjzy",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hej8yin",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejrott",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "heiw7c0",
            "score": 869,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "heiuu2u",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejgg2d",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hej74jf",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejjqt0",
            "score": 0,
            "text": "CMV: It is okay to be wrong\n\nAnyone that wants to change that view is pretty dumb.",
            "title_similarity": "0.5230714",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hejlauz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejsifk",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejt8iy",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejucvr",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejvj2m",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hekduwh",
            "score": 0,
            "text": "I think people who focus on their pronouns are attention seekers, I think they have attachment style issues or unresolved childhood conflicts, I'm not willing to indulge them if they haven't done the work to overcome it.",
            "title_similarity": "0.59309846",
            "sentiment_compound": -0.1027
        },
        {
            "id": "heklmvz",
            "score": 0,
            "text": "Yeah like sorry for not knowing you’re a transgender pansexual latinx ironing board",
            "title_similarity": "0.45136788",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hekt3k7",
            "score": 0,
            "text": "I just don't understand about this non-binary gender, if you feel like a girl, then just say you're a girl, if you feel like a boy, then say you're a boy.",
            "title_similarity": "0.45953935",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hel5aco",
            "score": 0,
            "text": "No one should assume gender. Call people by they/them unless they say otherwise. Its just simple respect as a human",
            "title_similarity": "0.5788698",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hellrb4",
            "score": 0,
            "text": "Holy shit I understand be frustrated with someone obviously purposefully misgendering you but a random person on the phone who cant even see you would be judging your gender off of your voice and normal people don’t start conversation on the phone asking what their pronouns are…",
            "title_similarity": "0.5937077",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hem37ib",
            "score": 0,
            "text": "Wtf is AFAB. I feel old now. “All fags are bastards”? That can’t be it.",
            "title_similarity": "0.42397898",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hej96ou",
            "score": 10,
            "text": "From my perspective, a concept of judgment against individuals is distorting your view some. I think it's more about personal safety and pushing to \\*change\\* the norm than it is about demonizing any individual for manifesting the current norm.  \n\n\nJumping into highly gendered thinking for a second:\n\nIt *used to be* really, really normal for men in workplaces to highly sexualize and grope women who worked there. No one man was \"a really bad man\" compared to other men for doing this, because it was so normal. Even so, it makes perfect sense that any particular woman might not be psychologically up for \"what is normal\" and seek employment that differed from the norm.   \nI know when I'm recently sexually assaulted, I definitely steer clear of places with really casual misogyny, not because I'm trying to demonize any person there who is obeying those social norms, but because my mental health can't take it. IF I make a judgmental statement it's less about the individuals in those places and more about the social norms.   \n\n\nFrom my perspective, people seeking to protect themselves makes perfect sense. And there are some environments where gendered language IS successfully being pushed back on. If I weren't cisgender, I can very easily see myself seeking those places to and avoided highly gendered language places. For the same reason I sometimes avoid causal, normally sexist places now.   \n\n\nI think it's possible they're doing exactly what you suggest with \"managing their triggers\" by seeking to avoid environments that are very gender binary.  I think it's possible you're interpreted judgement against individuals when really the judgements being made are actually against what is normal in society.   \n\n\nSome social groups are doing a new normal. In those settings, strangers are working to not assume anyone's gender, and instead, include gender when you introduce yourself. Kind of like people don't go around trying to guess other people's names, you wait for someone to tell you their name before trying to use it. In these settings, you introduce yourself by saying name and pronouns, and don't assume you can guess anyone's pronouns, (or name).",
            "title_similarity": "0.7579236",
            "sentiment_compound": 0.9375
        },
        {
            "id": "hejgn52",
            "score": -1,
            "text": "I don't think anyone (or at least most people) cares if a stranger makes an honest mistake with pronouns. It's when it's on purpose and/or repeatedly that it becomes hurtful.",
            "title_similarity": "0.57600784",
            "sentiment_compound": 0.197
        },
        {
            "id": "hejh1eo",
            "score": 1,
            "text": "I miss genders",
            "title_similarity": "0.26592702",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hejn35i",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejv18h",
            "score": 1,
            "text": "I personally expect it. Like don't get me wrong, it stings, it feels like shit, and is a blatant reminder that I look and sound feminine and it kills me. But how in the world would anyone who doesn't know me know that? Especially over the phone it's nearly impossible. Now if you go out of your way to not just correct them once in passing but bluntly tell them \"These are my pronouns please use them when speaking to me\" then that's a problem. \n\nBut if you correct someone like one does when someone misgendering a dog \"aww she's so cute\" \"yeah HE is\" then I don't feel bad for you. People don't always pick up the hint and even then they may not have heard you or understood. Being passive aggressive isn't helpful. \n\nWhat is besides introducing yourself with your pronouns is pins/badges. I've seen lots of those around lately saying to ask their pronouns or just presenting them. Not every enby looks androgynous and besides that there are plenty of people who look different from how they identify. \n\nI agree with you that it's quite a bit to expect someone to just get it, especially without any explanation.",
            "title_similarity": "0.59301794",
            "sentiment_compound": 0.9453
        },
        {
            "id": "hejw7rx",
            "score": -1,
            "text": "labels are for vegetables at the supermarket",
            "title_similarity": "0.17578603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hek3o73",
            "score": 1,
            "text": "I'll try to explain this with a personal experience which is an umbrella to *mis-gender phenomenon*, i.e., being \"mis-identified\" or \"mistaken\" for someone else.\n\nSo, yeah...\n\nFew years back I went for a trip with my younger brother (9 years younger), and father (32 years older).\n\n\nWe shared our train coach with a stranger, who got on friendly talks with us.\n\nAnd out of nowhere, when he heard me calling my father as 'dad', and he exclaimed shock and disbelief at the idea.\n\n(FYI: I have had grey and white hairs since I was 13 or 14 y/o, and then I was 20).\n\nAnd he blatantly adjudicated and told us, that my father looked more like my elder brother, and definitely not my dad, and how I might do well with considering some 'de-ageing therapies' (whatever that mean). And went on about how be passes for my brother's father but definitely NOT as mine! \n\nPersonally, it was humiliating and triggering, to be \"mis-aged\" (?). I felt frustrated and helpless.\n\nBut, should I go on crying about it, and fussing over how the person \"mis-judged\" my appearance?!\n\nFor me, personally, NO!\nIt's unfeasible, unethical and unreasonable for me to expect everyone to start conversations with me with asking my age.\n\nIf they mis-judge my age, sure it internally doesn't brews well, but having to fuss over it and make it all about me will be a bs tirade. All, I can do is to correct them, who \"mis-judged\" and move on. If they're in my regular social circles, and not Assholes, surely they will not make the same mistake again. And as for strangers, why should I worry of their opinions?\n\n\nBut, of course that's all my personal take on this mid-judgment umbrella.\n\nPeople can have varying triggers (even unreasonable ones)",
            "title_similarity": "0.6432929",
            "sentiment_compound": -0.9588
        },
        {
            "id": "hek4joo",
            "score": 1,
            "text": "> I’m cisgender and of course don’t really understand what it is like to be non-binary and what dysphoria is like for my friend. I respect their identity without truly understanding it. \n\nIf you yourself have a gender identity, why would it be difficult to understand that someone else has one or lacks one? I'm confused, how have you come to your own rationalization of your gender identity (something that exists to form a strong association to with a barrier against other labels) and why do you think that would be a different experience for someone else? If you are using sex as a basis for your identity, that's not a gender identity. It's only when your gender identity \"matches\" (I have no idea what this means) your sex assigned at birth are you cisgender.\n\n> because a small percentage of the population is non-binary.\n\nI'd argue the large majority of the population is non-binary, accepting that agender is classified as non-binary. Most people lack a gender identity. They prefer to use terminology based upon sex or perceived sex, not an element of self-claimed gender identity. The aspect of \"gender\" is too vaste and undefined to even form association too.\n\nI'll attempt to change your mind it this way. They aren't even being misgendered. Because people don't care to even recognize a gender identity, and are simply attempting to refer to someone's sex. They are rejecting a self-claim to a group label without any clear definition with a vaste area of coverage in favor of their own understanding of the term which is quite basic in application. That's not \"bigotry\", it's the common application of language.",
            "title_similarity": "0.5981424",
            "sentiment_compound": -0.2861
        },
        {
            "id": "hek5dy6",
            "score": -1,
            "text": "I'm just going to start calling everyone it, even if I'm sure, because there are too many gender identities to keep up with. I also don't appreciate it when I get attitude because I  misidentified you when I don't know you.",
            "title_similarity": "0.55161875",
            "sentiment_compound": 0.0108
        },
        {
            "id": "hek6j0i",
            "score": 1,
            "text": "That’s why I always say that it’s about your sex, not your gender. Sexes are two, genders are countless and hard to read minds.",
            "title_similarity": "0.45246476",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hekdcgd",
            "score": 1,
            "text": "Within the larger political context, \"misgendering is bigotry\" refers to deliberate misgendering on purpose, and not accidental misgendering. Accidental misgendering happens all the time. Even transgender and non-binary folks misgender each other by accident.\n\nIt is similar to getting someone's name wrong. If you call someone  by the wrong name or mispronounce it, they will correct you politely and you say, \"oh sorry\" and then use the right name. You can also make the mistake more than one time, and then apologize and correct yourself. This is fairly common.\n\nThe problem happens when someone corrects you, but you don't acknowledge it and continue using the wrong pronoun, ignoring them - or worse, intentionally do that to bully them, which is what \"misgendering is bigotry\" refers to.\n\nIf someone says, \"My name is Massimiliano\" and you reply, \"That's hard. I'm going to call you Tony.\" That is obviously bigotry.",
            "title_similarity": "0.6658211",
            "sentiment_compound": -0.9755
        },
        {
            "id": "hekedjw",
            "score": -1,
            "text": "I don't know much about that but can say the following.\n\nIf you claim to be non-binary you segregate the world into binary categories of being binary or non-binary thereby creating a binary system.\n\nUntil next time.",
            "title_similarity": "0.4805862",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hekhyl7",
            "score": -1,
            "text": "I have a news for you guys. You’ve got a dick you’re a boy, you’ve got a vagina then you’re a girl and that’s it.",
            "title_similarity": "0.460214",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hekoc2d",
            "score": 1,
            "text": "Well I personally don't believe in the idea of being non binary. Or any other of the pronouns apart from male and female. \n\nI think its pretty arrogant for someone to get annoyed at someone for \"missgendering\" them. You're not special",
            "title_similarity": "0.55060637",
            "sentiment_compound": -0.4133
        },
        {
            "id": "hekzolq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejccle",
            "score": 22,
            "text": "So here's the thing; I think your friend kinda overreacted because like, by definition, a nonbinary person doesn't have a set gender presentation (I'm AMAB and for all intents and purposes, look like a dude, for example).\n\nBut here's the caveat: if I'm at a shop and I buy something, pay for it, and then the cashier says \"have a nice day, sir,\" that sucks because it's not even like, necessary. If you're using third-person pronouns to describe one person to another, I totally and completely understand if someone guesses my gender incorrectly. I'd prefer that everyone just use they/them until they know someone's gender for sure, but I'm a pragmatist. I mean, fuck, I **am** nonbinary and I hadn't heard of the term until a decade ago. A lot of this stuff is new for people and honestly, whether it's right I wrong, I feel that, selfishly, it's best if I just like, be patient with people and assume good intentions.\n\nAnyway, my point is that, even if you take a practical perspective on this sorta thing (which I'd like to think I do), my beef comes from people who needlessly gender someone when they could've just as easily not messed with that. My sister is also enby but presents way more ambiguously, and when we go places, people are always like \"thank you.... sir? ma'am? uh..... uhm...... sir?\"\n\nSo anyway, don't guess. It may be \"normal\" for an enby person to be misgendered but it's not \"ok,\" no more than it would be misgendering any other trans person (or cis person for that matter).",
            "title_similarity": "0.7084842",
            "sentiment_compound": 0.9782
        },
        {
            "id": "hejk8dm",
            "score": 16,
            "text": "Your friend needs to remember that a core part of his/her identity is based on their gender, but for the average punter on the street they don't think twice about it. Imagine meeting someone who is Irish in an Australian bar in the 80's, and casually asking them if they're going to Mass on Sunday when actually they're protestant. Now, for the Irishman, this is sacriledge, being described as a filthy Catholic is fighting words, but for the Australian, who can't tell the difference between the two and doesn't give a shit anyway, it was just a vague comment. Same similarities can be made towards mistaking someone for a Liverpool fan who goes for Everton, or people who confuse Stanford graduates with being in the Ivy League (yes, people do get upset about this).  \n\n\nAs a cis person, I don't think about my gender at all unless I fill out a form (and I \"think\" about it in the same way I \"think\" about how to pick up a pen, i.e. automatically).",
            "title_similarity": "0.67477834",
            "sentiment_compound": 0.3151
        },
        {
            "id": "hejhl6h",
            "score": 2,
            "text": "To my non binary and trans friends their pronouns are very important! It's something they have agonised over and fought for. .... This sounds very harsh  bit to the CIS crowd they just aren't, we're largely indifferent to our own pronouns and genuinely don't appreciate the pain it causes whem we get it wrong. It's not that we don't care, it's just low on our personal list of important things. For Example I have a friend who is still learning english she uses female pronouns for everyone and everything including me I barely noticed until it was pointed out because i have never had to fight for mine..",
            "title_similarity": "0.710183",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hejjre0",
            "score": 2,
            "text": "They don't expect strangers to know it's just… Difficult.\n\nMy partner is AMAB, and we were walking together when someone asked if they were \"my man\" and when they confirmed, the person said \"you're a lucky guy your girlfriend is so pretty\" \n\nAnd I was smiling because I was happy to be called pretty, but it completely bummed my partner out because they were referred to as a man. And they look like a guy, and they know that people will make that mistake, but it's just a constant thing of getting misgendered and deadnamed. It's frustrating and exhausting for some enbys.",
            "title_similarity": "0.7608849",
            "sentiment_compound": 0.0537
        },
        {
            "id": "hejnb24",
            "score": 2,
            "text": "AFAB/cis\n\nI was very frequently misgendered as a kid because i had very androgynous interests, short hair, rail thin, lots of male friends. It’s very foreign to me to be bothered by it. \n\nHowever, i can imagine puberty amplifies it a lot.",
            "title_similarity": "0.62441516",
            "sentiment_compound": 0.4728
        },
        {
            "id": "hejos15",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hej9mbl",
            "score": 134,
            "text": "most trans people i know are all quite on the same page that while it hurts to be misgendered, people are human. the issue is when the person is corrected, and then keeps misgendering in bad faith. i know there's an inside joke about trans people dying inside when they accidentally misgender themselves haha. \n\nthere's not much really to change on your view, the only thing i can really add is that the reason people do get mad is because of exhaustion. being told over and over and over and over and over that they aren't who they are, even the kindest people can sometimes snap, and that's not even factoring the systemic oppression behind it. some people just take a hardline stance to be assertive about who they are and making sure people know what's what. but overall, most trans people are pretty much just \"it's fine, just remember next time\"",
            "title_similarity": "0.6868287",
            "sentiment_compound": 0.5859
        },
        {
            "id": "heitkq5",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejiygy",
            "score": 91,
            "text": "Having worked numerous call center type jobs, I can tell you that they ask you to avoid using gendered terms like ma'am and sir primarily because of the risk of misgendering people, and the examples these companies always cite are cis women with low voices or cis men with high voices. Like, you'd never get fired for it unless you were a total jerk about it, but if you mess up they'll definitely remind you. When employees did make that mistake and someone got upset, the employee would insist it was an innocent mistake but also wouldn't question why the person they misgendered got so upset. So I can say from experience that before nonbinary people even enter into the equation, this is already treading into unprofessional behavior territory.\n\nComing from this point of view, it feels to me like you're assuming that your friend is upset that a stranger did know their exact gender, but if I had to guess without any additional info I would suspect they are more upset about the general lack of professionalism displayed in using gendered terms at all. I'd further add that this person is venting to their friends on the internet, and I honestly doubt they find it as big a deal as their rhetoric makes it seem.\n\nSo basically they were subjected to a mild bit of unprofessional behavior that seemed to strike a nerve for them, just like it might strike a nerve for a guy who doesn't want to be seen as feminine or a woman who doesn't want to be seen as masculine. It might be more \\*understandable\\* that a stranger would misgender your friend, but your friend is right to ask why the stranger needs to be doing any gendering in the first place, especially if it's in a customer service context (if this is another context where a stranger is talking to them over the phone, that might be helpful to know as well).\n\nMy line for anyone pissed off at a service rep is that the last thing we ever want to do is make a customer upset, not because we are great people but because we want to move on with our day. So as a general rule, I do encourage people to cut their service reps some slack and assume mistakes to be honest, but I don't think your friend had unreasonable expectations.",
            "title_similarity": "0.7186146",
            "sentiment_compound": -0.7455
        },
        {
            "id": "hej3uz0",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejp0kd",
            "score": -3,
            "text": "How, exactly, did you know they didn’t give their pronouns? Cause to me, your just assuming she didn’t.",
            "title_similarity": "0.4447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej2emn",
            "score": 524,
            "text": "I don't think most people expect strangers to know. Where they get frustrated is when someone repeatedly misgender. \n\nI have a few friends that are non-binary and they are cool with introductions and a couple mistakes, but they tend to get frustrated when the mistake keeps happening. \n\nMy name irl is very similar to another common name, and people get them mixed up a lot and once or twice I am okay with, but beyond that I feel the person either doesn't care or is doing it on purpose. The same is true with NB people.",
            "title_similarity": "0.69314647",
            "sentiment_compound": -0.7463
        },
        {
            "id": "hejii5z",
            "score": 4,
            "text": ">posted a tirade on Instagram\n\nSounds like it had just happened?\n>if you are going about the world with these kinds of expectations for complete strangers, you will just be angry all the time.\n\nDo you think your friend is really going about the world with these kinds of expectations? Or could they have simply wanted to vent?",
            "title_similarity": "0.7010957",
            "sentiment_compound": 0.4479
        },
        {
            "id": "hej5eos",
            "score": 43,
            "text": ">you just can’t expect strangers to just guess\n\nAs a cis person who's constantly misgendered over the phone, I can assure you that that's exactly what I've come to expect.",
            "title_similarity": "0.59729856",
            "sentiment_compound": 0.34
        },
        {
            "id": "hejhwph",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejlx6n",
            "score": 7,
            "text": "I take issue with the word \"okay\" in your title. There's a difference between normal or typical or expected and acceptable. And there's also whole host of different contexts for conversations with strangers with different acceptable outcomes. Yes, it's going to be a common experience. Yes, there's going to be situations where you should expect it and it's probably more effort than it's worth to correct it. There's also situations where being misgendered is unacceptable and I'm going to take issue with it for my own comfort and safety as well as that of others. \n\nIf the cashier in a shop addresses me as sir or ma'am, that's not my favorite thing (although I kind of olay hearing ma'am, because it feels like it \"cancels out\" a sir, which I've heard way more times in my life), but it doesn't feel like a well spent use of my time or energy to correct them. On the other hand, if I'm speaking to a receptionist or a nurse at a medical facility where I'm seeking care specifically as a non-binary individual and my preferred name and pronouns are on my chart and it's hospital policy to use and respect them, I expect to hear them used regardless if I've seen the person before or I'm likely to ever see them again. I have been actively mocked by a hospital receptionist and usually have a nice session of mutual complaining about medical chart software and how it sucks that it will only print my dead name on sample vials no matter what anyone does with random phlebotomists.",
            "title_similarity": "0.6288202",
            "sentiment_compound": 0.9353
        },
        {
            "id": "hejcchj",
            "score": 26,
            "text": "There seems to be too much information missing here. While there are exceptions to the rule, often trans people have to put up with a lot of BS before calling out people for misgendering them. \n\nDid they tell the other person on the line that they were trans and did that person ignore that? Should the person on the phone have known via previous correspondance that your friend is nonbinary?\n\nFrankly given the nature of Reddit if it's not something like the examples given I'm more inclined to believe this is a rage bait post, but yeah for this to be believeable there needs to be more context.",
            "title_similarity": "0.6588158",
            "sentiment_compound": -0.1692
        },
        {
            "id": "hejya6d",
            "score": 10,
            "text": "Tbh this kind of comes off as a reinforce my view post. The vast majority of people wouldn’t report a business for accidentally misgendering them on the phone. And if someone did, the vast majority of the people wouldn’t see that as an appropriate response. \n\nVenting is okay though, which I suspect could be happening with both parties..",
            "title_similarity": "0.7633809",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejmbao",
            "score": 11,
            "text": "I'll challenge part of your view - It's OK to misgender someone accidentally. It's not OK to do it maliciously, with intent of causing anger/harm.  \n\n\nFirst time meeting someone and you accidentally get their gender wrong? Sure, no problem.  \nGo out of your way to insult someone to cause harm? not fine.  \nIn the middle of a heated gaming battle and you misgender teammate/friend who recently switched genders when calling \"I can cover him\" instead of \"I can cover her\"? sure, no problem.  \n\n\nGoing out of your way to do anything to cause harm to anyone is shitty.",
            "title_similarity": "0.7112782",
            "sentiment_compound": -0.9486
        },
        {
            "id": "hej5wty",
            "score": 269,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejoav8",
            "score": 281,
            "text": "Keep in mind, though, there is a difference between your NB. friend sharing a frustrating experience with someone who can relate and venting in similar stories and actually railing against the misgendering stranger. It sounds like they didn't call the company or snapped at the stranger but just shared a common frustration. \n\nI became a full time single dad when my son was very young. It was VERY common for people to see just the two of us on a weekend and draw the conclusion of \"must be your weekend\" or \"giving his mom a break, huh?\" After a while my brain would jump to \"what? a guy can't be a full time single dad?\" There were times where I wanted to snap at well-meaning cashiers or random old women at the mall. I never did. What good would that do? How could they know my story? But that didn't mean that later that night I'd talk to my folks or friends and vent how upset I was. \n\nSame thing. While I think it's unreasonable to expect strangers to get your pronouns right the first time with no cues, it's also unreasonable to expect NB friends to not be frustrated it about it behind closed doors.",
            "title_similarity": "0.71894896",
            "sentiment_compound": 0.8578
        },
        {
            "id": "hejd9rd",
            "score": 4,
            "text": "I know some of my NB friends enjoy it when people are confused about what gender they are.\n\nIf someone goes up to them and says “excuse me sir” and then they speak and the person goes “oh sorry, ma’am”, it makes them happy.\n\nIf they bring it up, you should respect it and it’s probably better to leave out gendering terms more generally and refer to people as “they”, but I don’t think NBs are expecting any special treatment.",
            "title_similarity": "0.76582104",
            "sentiment_compound": 0.8793
        },
        {
            "id": "hejgwto",
            "score": 1,
            "text": "as an enby person myself, i don't really care how people refer to me, and my mother language is literally all gendered (i mean, we had to \"create\" a word to mean they in singular) but i see how triggering it can be to be misgendered. \n\nmy presentation is only really \"feminine\" bc even though i do like it, i can't afford an androgynous look right now. or a \"masculine\" look. and i hate when people call me a \"woman\", a \"girl\", a \"lady\" bc as much as the word itself doesn't really matter, the way they mean it is to identify me as a cis girl, which i'm not. and i hate when i refer to myself in a masculine way (in some days when i feel dysphoric) and people correct me. for example: \"cansado\" means tired in portuguese. every time i say i am tired (cansado) someone corrects it to \"cansada\" (feminine form) and it pisses me off, but i don't say anything most of the times.\n\nmost people who complain about being misgendered don't mean it in a way like \"how wasn't this stranger completely gender-neutral with me from the start!!1\" but when they already told the people around them (be it a coworker or a customer) about their identity/pronouns/new name and they keep getting it wrong. especially when they do it on purpose.",
            "title_similarity": "0.625478",
            "sentiment_compound": -0.948
        },
        {
            "id": "hejm8k2",
            "score": 1,
            "text": "Adults chalk up misgenderings as a misunderstanding,  learn something new about a human being, or pass new information onto another human being, maybe have a laugh and then continue onto whatever reason they began talking in the first place. \n\nChildren decide that this is the time to take a stance on whatever their political beliefs are. \n\nPatience and understanding, anything else is a manifestation of some other problem/trauma rearing it's ugly head.",
            "title_similarity": "0.694807",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hejmcnv",
            "score": 5,
            "text": "As someone who is non-binary/trans femme, with many non-binary friends, you're absolutely correct. However, \n\n>\"I feel if you are going about the world with these kinds of expectations for complete strangers, you will just be angry all the time.\" \n\nTo me, this shows that while you have the right idea, you're lacking a bit of perspective. It's not as cut and dry as you're making it out to be.\n\nIt's generally accepted that a trans person's response to being misgendered *should* be to politely correct the other person. However, after repeated instances by the same people, it turns into frustration and can lead to some serious lashing out.\n\nThe sad reality is, there are many places where being trans/nb is *not* socially acceptable. For people living in these areas, the scenario I outlined above is something that could happen several times a day. After a while, your natural response to these things *becomes* frustration or anger, because 8 out of 10 times it's the same teacher/family member/friend simply refusing to properly acknowledge your identity.\n\nBut, sometimes it's not. Sometimes, it's just a mistake at the drive thru window, or with an operator on the phone. But you're so used to people being malicious, that your first reaction is to respond in kind. This is likely what happened with your friend. For the record: no, I don't think they should be reporting anyone. That's a bridge too far.\n\nSo, while trans people *should* be patient with others, especially people that don't know their identity, it can be hard to remember that in the moment. Especially when you're used to your anger being justified.",
            "title_similarity": "0.69036496",
            "sentiment_compound": -0.3968
        },
        {
            "id": "hejpeap",
            "score": 2,
            "text": "Misgendering should cut both ways. You could be a very masculine looking female and were born and identify as female. You could mistaken as a male all the time and this could still greatly distress you even if you don’t have gender dysphoria. The same could be said for effeminate looking men who were born and identify as male. It would be unfair to these people not to be granted the same expectations not to be misgendered.",
            "title_similarity": "0.5481456",
            "sentiment_compound": -0.9029
        },
        {
            "id": "hejph9e",
            "score": 7,
            "text": "I was once ushering at a community play and was just on autopilot saying something welcoming, then handing out tickets on a loop when a rather non binary looking person came in with a female presenting person. This was very early in my education on the matter and was not used to looking for this sort of thing.. anyway I said “Enjoy your night, ladies!” Then looked up to hand them their tickets and realized my error. I panicked and said “Oh sorry, not ladies, just people! Enjoy your night, people! Shouldn’t have said.. *moment of doubt* not that you’re not… I mean whatever you… whomever… uuugh” *trailed off and turning beet red then laughing awkwardly* they just stared at me bemused, then laughed to their friend and left. This memory sometimes returns to me as I try to sleep and keeps me up another 30 minutes. So if any non-binary person out there is reading this, however awkward you feel to be misgendered perhaps it may comfort you to think that the person who did so feels entirely idiotic for there error and as in my case intentionally took some time to better educate themselves and now tries to not use gendered language whenever possible with people they don’t know. Dear person who had to suffer my awkwardness in that moment - I’m sorry and thank you for not making a big deal of it.",
            "title_similarity": "0.69063824",
            "sentiment_compound": 0.8325
        },
        {
            "id": "hejq0iw",
            "score": 7,
            "text": "We should add a caveat:\n\n&#x200B;\n\nLet's say that it's obvious that a stranger is AMAB, but they're trying to present as female. And you know that, just from looking at them.\n\nThen, it's obvious that misgendering them is a dick move.",
            "title_similarity": "0.5595559",
            "sentiment_compound": -0.6652
        },
        {
            "id": "heju19h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejuxqe",
            "score": 1,
            "text": "I have a friend/coworker who is gender fluid, AFAB. They were speaking to a customer over the phone, and they have a very high pitched, effeminate voice. They present as very feminine, and you wouldnt be out of line to look at them and think “that’s a girl.” I 100% respect their gender identity, but often catch myself about to use feminine pronouns, simply because of the way they present themselves. \n\nNow, when my coworker got off the phone, they were upset because the customer used feminine pronouns to describe them, or simply said something to insinuate that they were a girl; and while I can understand it being frustrating to be misgendered, I can absolutely see where the customer was coming from. \n\nUntil asking someone’s pronouns becomes a normal greeting (if that ever happens, idk), people are going to make assumptions. \n\nThis might be a horrible example, but it’s almost like someone asking; “PC or Mac?” And the answer being “Linux.”",
            "title_similarity": "0.7343477",
            "sentiment_compound": -0.7461
        },
        {
            "id": "hejw3xi",
            "score": 7,
            "text": "I agree with the \"normal\" part, but not \"okay\". Something can be normal and bad. Corruption in government is normal, but that doesn't make it okay.",
            "title_similarity": "0.60547423",
            "sentiment_compound": -0.7905
        },
        {
            "id": "hejxma1",
            "score": 4,
            "text": "Really depends. If you tell someone \"I use they/them\" and they continue to call you something else, then that is wrong. But I don't expect someone to use they/them if they don't know over the phone. I am gender queer, not really non-binary... but close enough. ;)",
            "title_similarity": "0.57833976",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hejyr95",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hejysvi",
            "score": 3,
            "text": "As a gender non conforming person (AFAB, femme presenting at least some of the time) I never take a stranger misgendering me personally. I have a very feminine looking face, I’m short, and I don’t bind. If I were in the same situation I might misgender me. I only get mad if a person is doing it on purpose.\n\nHeck I don’t even care if my friends do it sometimes so long as I can see that they’re trying. Most of them knew me before coming out, it can be a hard adjustment. Sometimes it happens and the person usually realizes and apologizes. I’ve had a few people do it with malicious intent though and those people can go rot.\n\nI won’t even correct a person unless I think we’ll meet in social situations again (or professional ones).",
            "title_similarity": "0.73383343",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hejztl3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hek46in",
            "score": 1,
            "text": "I don’t think it’s ok, and I don’t think it’s ‘normal’ but it’s completely understandable and not something to be offended by. This person has looked at you and done their best to refer to you properly, but if they’re intentionally being a dick or being disrespectful then give them a face-full of fist and see how it goes the next time",
            "title_similarity": "0.6752112",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hek4qrr",
            "score": 6,
            "text": "The truth is that most NB and many transgender people don't mind being misgendered by strangers accidentally.\n\nIt's very rare for someone to get upset at \"assuming gender.\" Instead, it's far more likely that they were upset about a stranger assuming they were right even after being corrected. There are many people out there who will hear a feminine sounding voice or see a feminine looking person and decide that their own judgement of this person's gender is more important than the person's own opinion of their own gender. \n\nSo, I wasn't there on the phone call, and I don't know for sure if your friend had someone be rude to them or not about their gender identity. But I find it very unlikely that they got upset about a simple mistake. The story just makes a lot more sense if the stranger on the phone refused to change after being corrected.",
            "title_similarity": "0.68792486",
            "sentiment_compound": -0.8953
        },
        {
            "id": "hek4usj",
            "score": 2,
            "text": "I'm male and don't have a particularly deep voice. I used to work doing telephone surveys and would get called \"miss\" or \"ma'am\" all the time - on the phone my voice just sounds even higher pitched I guess. \n\nI wasn't really worried about it, people can only go on what they know and understand, and five minutes into a call you forgot my name or misheard it ? Guess I can be a gal for a bit. Whatever.",
            "title_similarity": "0.63204265",
            "sentiment_compound": 0.1293
        },
        {
            "id": "hek5l65",
            "score": 3,
            "text": "I've identified as nonbinary and used neutral pronouns for a few years now. Honestly, yeah, I don't expect strangers to know just by looking at me. I agree that reporting the business is an overreaction and that, considering most people don't think about their gender on a daily basis, they aren't going to consider how using gendered language could affect others.\n\nBut, it does still hurt to be misgendered, and to know there'll never be a point where I \"pass\" as my gender. It's entirely possible the rant about being misgendered was something that they've been feeling frustrated about for a while and the phone call tipped them over. Having to correct people every time they use the wrong words isn't fun, and a world where people ask and don't assume gender is a fun idea to entertain, even if its unattainable.\n\n&#x200B;\n\nI'd also like to add, for future reference, whether these people were AFAB or AMAB doesn't actually add any context to this story. It can sound like you still view and consider this friend as a woman, even though that wasn't the intention. Maybe your friend is ok with it, I don't know them, but me and multiple people I know are uncomfortable with people bringing up our birth gender constantly.",
            "title_similarity": "0.7924464",
            "sentiment_compound": 0.725
        },
        {
            "id": "hek6sc2",
            "score": 3,
            "text": "I’m a guy through and through. But my white/customer service voice comes from my mother, so I sound like a 30 year old white woman on the phone, and since I’m a tenor it lies high sometimes off the phone. \n\nDuring Covid I got a job at a restaurant and got new red masks cus I love the color and needed more. \n\nEveryday people would call me ma’am, thank the nice young lady for helping, tip the girl for her nice service, etc etc. Shit made me laugh at first but it became really annoying cus I didn’t see it and I didn’t like being called a girl, because I’m not one. Now add in some gender dysphoria and the constant worry that I don’t know who I am and it always being reminded to you. That shit hurts\n\nNow many say that people shouldn’t just assume genders or use Gender neutral terms because it hurt no one and gives some a whole lot of relief and support. Sure most people don’t do things out of spite or hate, and maybe your friend was just angry in the moment or tired of the whole problem, but it gets exhausting and maybe changing a little bit out language and Custom is worth it",
            "title_similarity": "0.701336",
            "sentiment_compound": -0.9061
        },
        {
            "id": "hek7285",
            "score": 2,
            "text": "I'm having trouble understanding all of this. There misgendered, cisgenered, non-binary and people getting upset about being labeled wrong. It feels overly complicated beyond just male and female. \n\nMakes me not want to talk to any one in hear of being offensive unintentionally.",
            "title_similarity": "0.425775",
            "sentiment_compound": -0.8915
        },
        {
            "id": "hek8e8a",
            "score": 1,
            "text": "Why only then?\n\nIndividuals misgender each other every day, just a they misrace each other or start to debate that of each other.\n\nI knew lots of teenage males with long hair that were mistaken for female every day and I seem to be mistaken for male quite often myself.\n\nIt's really not that easy to tell gender many times.\n\n> I’m cisgender and of course don’t really understand what it is like to be non-binary and what dysphoria is like for my friend. I\n\nAh, the usual \"80% of inividuals that are called \"cisgender\" are actually \"agender\", which is probably true—most individuals don't treat their sex like an \"identity\" and those that don't are then told that that means their birth sex is their identity out of some attempt t create symmetry I uess.",
            "title_similarity": "0.5291755",
            "sentiment_compound": 0.4352
        },
        {
            "id": "hek8nvb",
            "score": 1,
            "text": "people don’t really expect you to know though. like yea we grew up in a society where we associate looks and pronouns.",
            "title_similarity": "0.4669265",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hek9eir",
            "score": 3,
            "text": "Fundamentally I think these things are really just a power struggle between \"your feelings\" and \"my feelings\". The person being gendered has expectations around how they wish to be treated; the person doing the gendering has expectations around how they should have to treat others.\n\nThe crux of the debate then is:\n\n* Exactly how responsible are we for meeting the expectations of others?\n* Exactly how much should we expect others to meet our own expectations?\n* And what are the rules and values which govern this balance?\n\nAnd the challenge thing there is that the answers to these questions are... matters of opinion, without clear right or wrong answers. There are no hard and fast rules around how we \"should\" interact with others - only broad contextual principles.\n\nMy personal take? It's wise to be flexible in how we treat others AND how we expect others to treat us, and there are more important hills to die on than the words people use to describe our gender.\n\nAll in all - those who bemoan being misgendered are often behaving in a way I consider entitled - those who dig in their heels and refuse to compromise at all in using diverse gender titles I consider inconsiderate.\n\nA balanced middle ground is probably the fair take on the whole issue.",
            "title_similarity": "0.43737555",
            "sentiment_compound": 0.8851
        },
        {
            "id": "hekaoyi",
            "score": 2,
            "text": "A nonbinary person certainly should *expect* strangers to misgender them, and I don't think it's reasonable to confront everyone who does, but that obviously doesn't make it \"ok\".",
            "title_similarity": "0.565269",
            "sentiment_compound": 0.09
        },
        {
            "id": "hekarq4",
            "score": 2,
            "text": "What is the non-binary version of Sir/Ma’am?",
            "title_similarity": "0.22197631",
            "sentiment_compound": 0.0
        },
        {
            "id": "hekee5p",
            "score": 1,
            "text": "I actually agree with you on this and I am pro-trans myself (I'm cis). There's a clear difference between a stranger doing it by accident and someone being a dickhead doing it intentionally. If someone gets it wrong the first time, just correct them about it. You can't expect a complete stranger to have any knowledge about your gender identity.\n\nIt may be triggering if a trans person hasn't had good support in their personal life, but going on a hissy-fit for something like that does nothing but give trans people a bad image. However, it would be a different story if the business was intentionally misgendering + discriminating against them.",
            "title_similarity": "0.70055664",
            "sentiment_compound": -0.7865
        },
        {
            "id": "hekf9nu",
            "score": 1,
            "text": "I'm trans: people who get mad about someone assuming their pronouns seriously need to chill. The world isn't out to get you, people aren't intentionally being mean to you. If you really care, gently correct them, without being a dick. I work in food service and regularly get misgendered by customers and colleagues, even though I have a \"she/her\" pin for my apron. Sometimes I find it annoying, but it's important to remember that people aren't being malicious, they simply don't know better. The best way to change the way people see you is by being easygoing and forgiving, breaking down the stereotypes people feel towards LGBTQ+ people by subverting them and actually acting like normal, understanding people.",
            "title_similarity": "0.7169257",
            "sentiment_compound": 0.9507
        },
        {
            "id": "hekfdj5",
            "score": 3,
            "text": "So, my name in real life is Kelsi (I’ve never shared that on Reddit, before). I cannot tell you the number of time I’ve initially been called *Chelsea,* instead. Once or twice is totally understandable, but people who continue to call me by a name that isn’t my own after being corrected more than once *really* start to annoy me. I compare that feeling to the feeling of being misgendered, myself. I’ve experienced the Chelsea Dilemma since childhood. \n\nI am also NB, but I’m not publicly out. My close friends and family know. I don’t mind being called she/her but prefer they/them. It absolutely does not bother me when a stranger uses she/her, but if I get the courage to “correct” them and they continue misgendering me, it really does hurt. \n\nAll that said, I absolutely do not expect people to look at me, a seemingly totally feminine person that often wears pink, skirts, crop tops, floral patterns etc. and assume I go by anything other than she/her. I also just don’t understand why so many things *must* be gendered in conversations or at all, and wish more people would work on remedying that.",
            "title_similarity": "0.6639421",
            "sentiment_compound": 0.8812
        },
        {
            "id": "hekgfw7",
            "score": 1,
            "text": "Non binary doesnt change physical appearance and biology.\n\nI will now watch my downvotes increase",
            "title_similarity": "0.48108566",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hekgy7o",
            "score": 1,
            "text": "It seems to be a 'movement' that today people are ready to wave their 'cancel sword' at anything that offends. Imagine facing extreme genocide and watching entire races and cultures nearly destroyed -but stop the bus- someone is upset over a misgender over the phone. Ok, that was mean, where was that backspace key?? Different people handle things differently, maybe this is that final straw for your friend, their road may be very bumpy. Therapy may help your friend with coping skills while the world learns 'boy and girl' is waaaay more complicated. I'm also good with people not liking this comment - go figure. 😉",
            "title_similarity": "0.67925",
            "sentiment_compound": 0.7523
        },
        {
            "id": "hekk1ny",
            "score": 1,
            "text": "I honestly believe people who complain about being misgendered are actually just using it as an excuse to cause trouble for others and attract attention.",
            "title_similarity": "0.5777122",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hekli8t",
            "score": 1,
            "text": "Seems that people are just waiting to be triggered. How is the person on the phone really supposed to know if someone is non-binary or not. If you are making an outgoing phone call to someone named John Smith you are going to assume they are Male. Now if the person on the phone had been made aware & ignored then that is a valid reason to be annoyed un;ess it was a genuine slip.",
            "title_similarity": "0.6329046",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hekmoke",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "heko2vl",
            "score": 6,
            "text": "Well, first of all I think you are right they were venting and not literally angry at that one person.\n\nWe have a lot of gendered languages in the world, and it doesn't really have a good reason. Instead of assuming people's gender, we can ask about pronouns or not use gendered language. I don't think it's that much to ask, it's just not ingrained in our society. However, just because it's a certain practice is ingrained doesn't mean it's a good practice. So assuming everyone is cisgender and is a gender because they look a certain way might be the ingrained practice, but it's it correct? Not really. Asking pronouns doesn't really hurt someone and helps non-binary people, so why not make that the standard practice? So it makes sense to find that society and people in it do fucked up things, even if they are the standard. Everyone should try to change fucked up things that are the standard. Your friend is trying to tell people why this is fucked up, so that more and more people stop misgendering and using gendered language for no reason.\n\nAnother example. Women didn't have a lot of rights. A lot of people back them would've told you that's just how society is and they would tell you that feminist activists that try to change that are too aggressive and are angry and bitter women. They weren't bitter, they just wanted society to do what is right. So maybe ask yourself: if your friend really angry and bitter all the time? Or is he just being an lgbtqia+ activist that is trying to move society forward? Does complaining about misgendering in society really mean he must be angry all the rime or is that just your perception? You can find a common practice offending without being angry literally all the time.\n\nFeminist were seen as aggressive, angry and bitter because they were saying: your believe that women shouldn't have weak rights is wrong. What you do and think is wrong. People felt attacked and took that personally. So ask yourself: are you maybe doing the same in this context because you probably would misgender non-binary people as well and they are attacking your own behaviour? And also ask yourself: instead of defending society, could you personally do something to accommodate non-binary people? Can you change and make society a little better for your friend and their other friends that are non-binary?",
            "title_similarity": "0.6901548",
            "sentiment_compound": -0.9906
        },
        {
            "id": "heko7g6",
            "score": 2,
            "text": "I mean I'm so used to it that I have a preferred direction to be misgendered in. To put it simply I'd rather someone look at me and assume I'm a man and use he him than she her. Both suck but he him sucks a little less",
            "title_similarity": "0.5938554",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hekokg0",
            "score": 1,
            "text": "Look. y'all can pretend to be whatever gender you want. If it makes you happy to identify as non-binary, I'm all for it. And if you ask nicely, I will gladly refer to you by your preferred pronouns out of respect and courtesy.\n\nBut strangers can't read your mind. So if you get pissed at someone for \"assuming your gender\" you're the asshole.",
            "title_similarity": "0.7325921",
            "sentiment_compound": -0.0129
        },
        {
            "id": "hekrdog",
            "score": 3,
            "text": "So I've been working in customer service over the phone for a year now and it's become second nature to use gender neutral language. Sometimes it's a matter of convenience, like saying 'children' rather than 'sons and daughters', other times it's the easiest way to prevent offence! On one particularly memorable occasion I was speaking to a gentleman who I (a bisexual man!) thought was gay, and after mentioning his partner I proceeded to use the word 'husband' a few moments later... turns out he was straight 🤦‍♂️\n\nWhile they/them pronouns don't come up as often as the two examples above, my thought process is the same - they/them until the customer tells you otherwise minimises the risk of an embarrassing blunder - which makes I the professional thing to do regardless of your position on trans issues.",
            "title_similarity": "0.75648314",
            "sentiment_compound": 0.2695
        },
        {
            "id": "heksh9q",
            "score": 1,
            "text": "One of the nice things about the German language is that they rarely use Sir or Ma'am. Gender is only referred to in the third person, and so in a one to one conversation it doesn't really come up, they just call you 'you'. \n\nWould be a good thing if English could switch to this, imo. I know I'm just expanding on the point you already made in your edit, just wanted to add my 2 cents and say that sir and Ma'am are anachronistic and can be ditched.  It's just calling someone a name without asking them their name.",
            "title_similarity": "0.7029581",
            "sentiment_compound": 0.6908
        },
        {
            "id": "heksi8v",
            "score": 1,
            "text": "If you truly believe you’re a certain gender why should it matter what everyone else thinks or says? \n\nWhy should the entire world have to conform to your individual self identity beliefs? \n\nThe world is a tough place and being misgendered should be the least of your worries and level 1 of how tough the world is. Sounds like a privilege to have being misgendered as your top problems.\n\nPS. I’ll refer to you by whatever gender you want, no problem. I’ll respect it, but I won’t truly believe that your gender = sex. Is that a problem?",
            "title_similarity": "0.6013221",
            "sentiment_compound": 0.7067
        },
        {
            "id": "hekt3xi",
            "score": 1,
            "text": "I am nonbinary.\n\nI am very short and have a big chest so I have never been called 'he' before, and it wouldn't bother me if a stranger did or called me 'she'. The whole point is that we don't have a binary gender so I wouldn't expect someone to know I would rather use 'they' if they don't know me. I think it's better not to assume anyone's pronouns but it's going to take a heck of a long time to get to that point. I use 'that person' quite a lot now if I refer to someone I do not know, or use their name.\n\nThe queer community needs to be supportive of peoples growth and learning about identity s long as the person who is misgendering you or is ignorant isn't being abusive/rude/violent, IMO/",
            "title_similarity": "0.6607121",
            "sentiment_compound": 0.72
        },
        {
            "id": "hekuefz",
            "score": 1,
            "text": "People who get upset by being misgendered need to grow up. I don't give a shit how offended you are. Laws shouldn't be changed to lock people up who refuse to call you what you want to be called.\n\n\"if I went around calling myself an emperor, they'd put me away\"\n\n- Monty Python",
            "title_similarity": "0.626704",
            "sentiment_compound": -0.3769
        },
        {
            "id": "hekyyrv",
            "score": 1,
            "text": "Yeah I mean, if they actually do that it would be unreasonable. I think your friend has every right to feel upset about it though, I don't think they should blame individuals for doing it as much as just understanding that society as a whole needs to change their assumptions with gender and that it takes time. I mean, I'm trans myself and I absolutely gender people based on appearance in my brain all the time because it's just been so baked in by the world around me. When I'm misgendered I can't help being upset, but I don't get angry at individuals unless it becomes clear that they're doing it on purpose because they don't respect who I am. Instead, I just remind people to work on their own assumptions and most importantly I work on mine as well. \n\nYes this is how things are right now, but we can make the world better.",
            "title_similarity": "0.70673275",
            "sentiment_compound": 0.9444
        },
        {
            "id": "hel387y",
            "score": 2,
            "text": "I get confused, especially this one time... There was a person (trans) that would get triggered in the workplace for being misgendered/called the wrong name. They transitioned a few months after joining the office. They would get upset for weeks until I noticed them scoff at being called the pronoun/name. I asked about it, and they said \"I'm trans and I changed my name a few weeks ago, and ppl haven't addressed me properly.\" I suggested them to either introduce themselves or correct ppl, but they said it was \"too personal to talk about with clients/coworkers\" (they would tell their friends at work, but no one else). So for the next few days, I watched their supervisor call them the wrong name/gender, and watched them get triggered each time without addressing anything. Kinda just let it happen for a few days, contemplating what the resolve would be.\n\nI felt bad for doing this, but I told the ppl who worked close to them that \"she was a he\" and his new name. Seem like it resolved, b/c he was like \"finally, people noticed I'm trans and that I sign my name differently.\"  \n\nTo this day, I try to understand the new sexualities and genders.",
            "title_similarity": "0.5869497",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hel8iur",
            "score": 1,
            "text": "If minstrel shows never happened and it were acceptable for white males to wear brown paint to look either black, black-passing, or mixed, would it be acceptable for white people to become racially ambiguous as their identity? Again, assuming no history of minstrel shows or blackface or any of that. I mention it, because I see this as the same issue.  \n\nIf you're not making something clear, most people will just assume whatever makes the most sense to them - so if you don't want people doing that, the onus is on you to be clear, not on them to just ignore you or play guessing games. \n\nKeep being you, but don't get mad when people engage in normal behavior.",
            "title_similarity": "0.56528556",
            "sentiment_compound": 0.8068
        },
        {
            "id": "hel8v6x",
            "score": 1,
            "text": "In your case of misgendering over the phone, I once accidentally misgendered my nephew when his pubescent high pitch voice matched the phone voice of his older sister, so I called him by her name and he was so mad. So it's not just transgender people who occasionally have a bout of being misidentified. One of my aunts did it to me when I was 13.",
            "title_similarity": "0.6222437",
            "sentiment_compound": -0.7591
        },
        {
            "id": "hel9bys",
            "score": 1,
            "text": "Just because you’re not intentionally trying to hurt peoples feelings, doesn’t mean that they can’t be upset when you misgender them. I (cis woman) get around misgendering people by using gender neutral terms at every opportunity. In the service setting, ‘how can I help you?’ Will work just fine to get peoples attention, especially when paired with eye contact or even just ‘excuse me’ works too. You might not mean to hurt people but that doesn’t mean they won’t be hurt.",
            "title_similarity": "0.6998969",
            "sentiment_compound": -0.5517
        },
        {
            "id": "helc8sj",
            "score": 1,
            "text": "I think we should go to Star Trek protocol and disgender the word Sir, and abandon Miss, Mrs and Ma’am. You shouldn’t have to figure out someone’s gender to refer to them. I’m not just talking about Trans, there are males who sound like females, and vice versa. Sometimes you really can’t even tell someone’s gender if they’re standing right in front of you. You rarely need to know someone’s gender, other than addressing them, so if you remove that from the interaction you don’t need to know it at all.",
            "title_similarity": "0.60882986",
            "sentiment_compound": -0.25
        },
        {
            "id": "heldg71",
            "score": 1,
            "text": "I am a hetero male (I don't know what the label is), and have a default way of speaking, especially in customer /cashier settings. I do kick myself when I use the term \"man\" or \"guys\" as neutral language...especially when I'm not sure if the other party is non-binary, just slips out sometimes...However, and I hope this isn't an ignorant hetero male statement....but I really don't like all the labels...not because I don't care or don't understand people's battles. But if there was never a specific box for you to fit in, these labels made sure it exists. I have been confused for all kinds of reasons; woman when hair was long, gay because of my attitude and friends, people guessing my race because I am interracial... and ultimately I would never want a compartment to fit in. \n\nI think going off because of a strangers misgendering is a little immature, correct them and move on.",
            "title_similarity": "0.6071167",
            "sentiment_compound": 0.9027
        },
        {
            "id": "helfgvg",
            "score": 1,
            "text": "It is perfectly fine to misgender anyone. If you call a man with long hair mam before they turn around are you a bad person? No. What makes a person a bad person is calling him mam and then when he turns around insisting that he is a woman because he has long hair. The point is that none of us are very good at this. When you are corrected, it is wrong to intentionally continue to misgender them. Slip ups are also fine because again, this is difficult. Just try to address people the way they want to be addressed, that sort of thing shouldn't affect you personally at all, it's just a matter of respect.",
            "title_similarity": "0.69080126",
            "sentiment_compound": 0.2247
        },
        {
            "id": "helfjt0",
            "score": 2,
            "text": "Who cares anyway 🙂",
            "title_similarity": "0.134564",
            "sentiment_compound": 0.6915
        },
        {
            "id": "helh9h3",
            "score": 1,
            "text": "I need more context on how they were misgendered, when i hear misgender i think of a convo like this \nA:hello sir\nB:actually im nonbinary, and it makes me really uncomfortable when referred to with gendered language\nA:proceeds to call them by masculine pronouns for the rest of the conversation.\nDo you know how the conversation went other than them being misgendered at least once!",
            "title_similarity": "0.5920676",
            "sentiment_compound": -0.1742
        },
        {
            "id": "helhfni",
            "score": 1,
            "text": "I think it’s just not being an asshole, and respecting people’s choices. Expecting more than that is unreasonable",
            "title_similarity": "0.580407",
            "sentiment_compound": 0.4939
        },
        {
            "id": "heljygu",
            "score": 1,
            "text": "Wrong! If youre not 100% certain of someone's gender, ask them. Or refer to them as them they. Do not assume.",
            "title_similarity": "0.41170213",
            "sentiment_compound": -0.6377
        },
        {
            "id": "helkopo",
            "score": 2,
            "text": "non binary people doesnt exist is just a made up term that doesnt hold up",
            "title_similarity": "0.19870013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hellsea",
            "score": 1,
            "text": "I’ve misgendered people all the time unintentionally. Usually most nonbinary people are cool about it and will correct you. I think people probably shouldn’t make a huge fuss about it, but I also totally think it makes sense to be personally frustrated over it.",
            "title_similarity": "0.71099854",
            "sentiment_compound": -0.5106
        },
        {
            "id": "helm7yz",
            "score": 1,
            "text": "Or you know, just stopped gendering people and say “they/them” not that hard. No real reason for us to assume what someone’s genitals are when we talk about them in the first place.",
            "title_similarity": "0.6434162",
            "sentiment_compound": 0.0731
        },
        {
            "id": "heln5dk",
            "score": 1,
            "text": "What is AFAB?",
            "title_similarity": "-0.03185961",
            "sentiment_compound": 0.0
        },
        {
            "id": "heloqjd",
            "score": 1,
            "text": "Here to say, you're right.",
            "title_similarity": "0.20050444",
            "sentiment_compound": 0.0
        },
        {
            "id": "helwk5n",
            "score": 1,
            "text": "It's not about getting it right or wrong. It's okay to make a mistake about somebody. But when it's corrected, the least one can do is try to take a concerted effort to try and prevent another. It's not unlike when a teacher mispronounces someone's name.",
            "title_similarity": "0.630495",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hem084q",
            "score": 1,
            "text": "I feel like people who care about me will use it of course I’m not going to go batshit crazy on people who don’t know me or people I know are ignorant to anything LGBTQ+ and in that case I don’t usually associate with them.",
            "title_similarity": "0.6437621",
            "sentiment_compound": 0.296
        },
        {
            "id": "hem3wod",
            "score": 2,
            "text": "I’m a straight white man and I have been called ma’am over the phone more times than I can count. It’s just one of those things that’s annoying, but most likely not malicious.",
            "title_similarity": "0.635095",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hem7hkv",
            "score": 1,
            "text": "I think in 20 years, everyone will look at all this gender/non-binary stuff as a whole lot of bunk. It's more about social pathologies than actual gender identity.",
            "title_similarity": "0.4111807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hembs4p",
            "score": 2,
            "text": "Allow me to chime in on this and solve it once and for all as it's really simple.\n\nMost people will refer to you however you want to be referred to. Some people will genuinely not know how you would like to be referred to and may accidentally refer to you in a way that you don't like, and once politely corrected would be glad to refer to you how you please. These people should not be made out to be bad people for a genuine mistake.\n\nOther people will call you something by mistake or on purpose and couldn't give a shit how you feel. Those people are universally called dickheads or in Australia, Cunts.\n\nYou want stop people from being cunts. And if you care about what a cunt thinks or try to forceably change them ,which will never work, rather than just moving on with your life and not wasting time well perhaps you are not so different than them yourself.\n\nOk let's move on from this already now please. The who can use who's bathrooms is much more tricky to solve.",
            "title_similarity": "0.76357365",
            "sentiment_compound": -0.5678
        },
        {
            "id": "hemdbts",
            "score": 2,
            "text": "2021 problems - we must be doing something right",
            "title_similarity": "0.26812816",
            "sentiment_compound": -0.4019
        },
        {
            "id": "heme9jt",
            "score": 1,
            "text": "\"Normal\" and \"ok\" are two different things.\n\nMost non-binary people who use they/them pronouns are pretty damn aware it's \"normal\" to be misgendered. We're not stupid, we know a lot of people don't default to they/them, don't realize we're trans, or may be genuinely transphobic.\n\nThat doesn't mean misgendering is \"ok\". Misgendering triggers dysphoria, which results in self-esteem issues, extreme body discomfort, anxiety, and can trigger self-harm or self-loathing.\n\n>But I feel if you are going about the world with these kinds of expectations for complete strangers, you will just be angry all the time.\n\nDo you hold everyone else who is exposed to microaggressions to this standard? Do you think women should brush off casual misogyny, catcalling, insults, etc? Do you think disabled people should shrug off not being able to access some buildings? Being misgendered isn't simply a trigger in the way trauma-related triggers are. While it is tied to mental health, there are other pressures that complicate it in the same way that other socially/politically-coded issues can be a 'trigger' for other groups. Someone with a fear of dogs needs to manage their anxiety in public spaces when they aren't at risk. Someone worried that a guy harassing them on the street is going to assault them has a legitimate fear based on potential incoming harm. Most microaggression-type things are somewhere in the middle, and the reactions are not clean-cut \"valid fears\" or \"irrational fears\".\n\nThe reality is that many of us *don't* go around being angry all the time. We *do* have to shrug this stuff off (like many other marginalized people do), because it's a matter of personal safety and just making it through a day sane. It 100% does trigger dysphoria to walk around being misgendered all day long, but I, personally, do not correct most strangers because I'll never see them again, have no clue what their political views are, and at best risk an uncomfortable conversation or worst case physical threats and harm.\n\nHowever, just like anyone else, we have bad days. We have days where we feel like crap already for xyz reasons, are tired, or have less patience, and something like this grates more than usual. Your friend probably already had a shitty day or had been dealing with this issue in more personal ways and the stranger on the phone was the last straw.\n\nSide note: as a non-binary person, you shouldn't be sharing the AGAB of your trans friends. It's completely irrelevant to this conversation and is just a woke way of saying \"my biologically female trans friend\". Unless it is actually relevant to a conversation, it's weird and unnecessary to mention.",
            "title_similarity": "0.6464572",
            "sentiment_compound": -0.9956
        },
        {
            "id": "hemgdog",
            "score": 2,
            "text": "If you look like a dude people will think you are a dude and vice versa. Not anyones fault",
            "title_similarity": "0.5965311",
            "sentiment_compound": 0.5801
        },
        {
            "id": "hemgzci",
            "score": 1,
            "text": "My favorite is people who are clearly women posting she/her in their profiles. Like who is that for? I get putting pronounce if you’re trans, but why make everyone else do it?",
            "title_similarity": "0.6230278",
            "sentiment_compound": 0.6072
        },
        {
            "id": "hemh7w6",
            "score": 1,
            "text": "Empathy is a one way street with most fucking people",
            "title_similarity": "0.4606711",
            "sentiment_compound": 0.0
        },
        {
            "id": "hempq1j",
            "score": 2,
            "text": "If you're nonbinary, how do you expect someone to get that over the phone?",
            "title_similarity": "0.3704185",
            "sentiment_compound": 0.0
        },
        {
            "id": "hemsrfl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.022941187"
        },
        {
            "id": "hemtrji",
            "score": 1,
            "text": "In my opinion there is no such thing as 'male' or 'female' outside of biology. The rest of it is almost all a social construct. Meaning that to a large degree, individuals are expected to conform to society's expectations for them based solely on their biology, more specifically -- their genitals. I don't think this is how things should be, if we mean for individuals to live and express themselves however they see fit. \r  \n\r  \nThat said? I'm not cisgender. Not to me anyway. I'm just me. To say I'm cisgender would be to use a new word I have never needed or wanted and never heard of until a year or so ago. If that makes me a bad person, well then that's the way it is. I have no problem with people making new words for new kinds of people -- or old kinds of people that never had a word for themselves before. But to expect me to call myself 'cisgender' presents the 'new' people or the 'old people who never had a name before' as the ones who decide what the 'old people who always had a name' call themselves. I don't decide what you call yourself. Don't expect me to call myself what you decide to call me.",
            "title_similarity": "0.48219037",
            "sentiment_compound": 0.0204
        },
        {
            "id": "hen0o0q",
            "score": 1,
            "text": "This is a wild oversimplification and comparison but if my favorite color is pink and a total stranger assumes that my favorite color is blue, I can’t get mad at that person for not knowing subjective and personal information about me. That would be insane.\n\nI get that being misgendered can be very distressing and I wouldn’t dare assume to know what that is like, but making the assumption that everyone on the world should automatically know how to address you if you are self identified as something that is, unfortunately for the moment, outside of general societal norms. So people will make mistakes. As long as there is no serious animosity or hatred behind it why should it be pitchfork season when any innocent mistake is made?",
            "title_similarity": "0.64431936",
            "sentiment_compound": -0.8806
        },
        {
            "id": "hen3i8g",
            "score": 1,
            "text": "> you can’t expect individual strangers to never assume gender because a small percentage of the population is non-binary. \n\nI agree with you 100%. A stranger shouldn't assume your gender, sexual orientation, politics, social status, criminal history, or anything else about you.\n\nYou shouldn't expect a stranger to guess your gender, and they shouldn't try to guess either. Instead, they should use gender neutral language until they know your gender. At that point, it's reasonable to expect them to use your preferred pronouns.\n\nAs far as it goes, I think it's reasonable to be upset when someone misgenders you. A CIS person certainly would be.",
            "title_similarity": "0.71363616",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hen3n64",
            "score": 1,
            "text": "I disagree in certain circumstances. Over the phone, maybe, although since long before my egg was cracked I have used gender neutral language in customer service because trans people, NB people, intersex people, cis GNC people and also cis people with literally any variation in their secondary or primary sex characteristics both exist and are not uncommon, so there just isn't much reason in not being neutral in the first place.\n\nSecondly, I wear pretty large pronoun pins a lot of the time. I know that most people notice them because I can see them looking at them. People go on to misgender me anyway. \n\nPersonally I would not report a business for misgendering me unless they made me feel unsafe, purposely disrespected or degraded, but I understand that other people may have dealt with a lot more than me or different circumstances and have a lower tolerance for being misgendered. It really is so, *so* tiring to constantly correct people.",
            "title_similarity": "0.7186991",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hen4eau",
            "score": 1,
            "text": "But what are the scientific evidence of the existence of non-binary people?",
            "title_similarity": "0.27893186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hen71em",
            "score": 1,
            "text": "What if they’re not “misgendering” someone but instead correctly identifying their sex? I feel like we time is referring to sex as gender now. Since the meaning of gender is now considered separate from sex, it should be understood that people are referring to sex when they use make or female right?",
            "title_similarity": "0.4927069",
            "sentiment_compound": 0.5588
        },
        {
            "id": "hen7aln",
            "score": 1,
            "text": "It's so funny seeing people post these common sense things in this sub, like anybody with common sense on this sub knows you're speaking basic truth, these posts are just to challenge all the psycho SJW's to come out of the wood-works, and not a single one of them have ever made a convincing or rational argument. It is absolutely hilarious.",
            "title_similarity": "0.70376855",
            "sentiment_compound": 0.8882
        },
        {
            "id": "hfaadt9",
            "score": 1,
            "text": "All of this pronoun sh*t is for attention.",
            "title_similarity": "0.32864672",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjsqfn5",
            "score": 1,
            "text": "Can you please clarify if this is done intentionally or unintentionally?  I personally believe it should be forgiveable to make a one time mistake, but if you're doing it intentionally to belittle or insult them that shouldn't be acceptable.",
            "title_similarity": "0.5434002",
            "sentiment_compound": -0.8955
        },
        {
            "id": "hq0kn9y",
            "score": 1,
            "text": "If you're cis, you can't say it's okay for people to misgender you since you don't know what it's like to be misgendered.\n\nI understand it being \"normal\" as there's not really anyway to pass as non binary (besides looking 100% androgynous but some NB people don't even want to be andro), but normalcy does not mean \"okay.\"",
            "title_similarity": "0.5822121",
            "sentiment_compound": -0.2299
        }
    ]
}