{
    "CMV: Gangbangs are gay\nWhy do rappers sing about being a gang banger in their song when in reality gang bangs are actually super gay, think about it, its 1 girl with like 13 naked men all jacking off around her waiting their turn. Most the time spent by the guys is gonna be Jacking off next to another naked man and unless your actually fucking the girl chances are you arnt gonna be enjoying yourself.\n\nAlso what happens when another dude nuts on the chick and then your dick  accidentally touches the nut. Are you really gonna tell yourself that gang banging is straight after getting another dudes nut on your dick? I think not.": [
        {
            "id": "hezs991",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not broken any of our posting rules**. \r\n\r\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\r\n\r\nWe are actively cleaning up the thread now, and will unlock it shortly.  We will try and do this quickly so discussion can continue though the amount of time will vary based on moderator availability.\r\n\r\nThank you for understanding.",
            "title_similarity": "0.5451155",
            "sentiment_compound": 0.2066
        },
        {
            "id": "hezdjr7",
            "score": 5,
            "text": "Assuming you are talking about the sex act and not being in a gang, so what if it is gay? Rappers can't be gay? Do you think there is anything wrong with being gay? Someone can't be proud to take part in a gay sex act?",
            "title_similarity": "0.7176795",
            "sentiment_compound": -0.7659
        },
        {
            "id": "hezlgu6",
            "score": 0,
            "text": "Gang banging began as a hazing ritual where the gang would find a woman, beat her up, and violently rape her. \n\nIt was a crime to create trauma bonds, screen for pacifists and police officers, and create blackmail material. \n\nThey’re not bragging about sexual prowess but their criminal and gang bonifides.",
            "title_similarity": "0.6819488",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hezf2ds",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hez7rfs",
            "score": 461,
            "text": "> Gangbangs are gay\n\nSomething can only be gay if there is an actual attraction to persons of the same sex.",
            "title_similarity": "0.663906",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hezer7a",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezikgj",
            "score": 0,
            "text": "If you fuck your girl right after she gets home from getting creamed by the guy she's cheating on you with, then your dick will touch his cum. By your logic, that makes it gay.",
            "title_similarity": "0.78651035",
            "sentiment_compound": -0.886
        },
        {
            "id": "hf0r3uy",
            "score": 0,
            "text": "Don’t make fun of something you don’t understand.  Gangbangs are domination and putting the girl through things she hasn’t done before.  Making her take all that dick, not about the guys looking at each other",
            "title_similarity": "0.66928416",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hezf6nm",
            "score": 5,
            "text": "First off, while the OP didn't realize that most gangbanging was about gangsters... there is def raunchy rappers out there talking about orgies, double teaming women and so forth. I don't think that's \"gay\" and I don't think \"gay\" has to be this term where you're just into dudes. What are some amazing songs that you guys know and aware of? I heard some ruthless one's about dominating women but don't know any names.",
            "title_similarity": "0.8381553",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hezl31z",
            "score": 1,
            "text": "The gangbangs rappers talk about is crime and stuff but i agree NSFW gangbang is gay af",
            "title_similarity": "0.7440952",
            "sentiment_compound": 0.25
        },
        {
            "id": "hezo95b",
            "score": 1,
            "text": "Gangbangs are friendship. There is no greater sign of friendship and trust than when you and your buddy are DP'ing a woman and your balls slightly touch each other in a no homo way.",
            "title_similarity": "0.65121365",
            "sentiment_compound": 0.6994
        },
        {
            "id": "hezdb9z",
            "score": 6,
            "text": "The focus of the attraction is what matters, not who else is doing it next to you. And presumably the focus is on the woman. \n\nTbh it kind of sounds like you think it’s “gay” just because you can’t imagine not focusing on the men in that scenario.",
            "title_similarity": "0.6009562",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hezp1pf",
            "score": 14,
            "text": "Man, no offense, but you gotta get your head out if the porn world.\n\nA gangbang is a battle in a gang war. Combatants are called gang bangers.",
            "title_similarity": "0.60881734",
            "sentiment_compound": -0.8548
        },
        {
            "id": "hezhkf7",
            "score": 70,
            "text": ">Why do rappers sing about being a gang banger in their song \n\nAs others have mentioned, they mean shooting people, not shooting cum into people.\n\n>Most the time spent by the guys is gonna be Jacking off next to another naked man and unless your actually fucking the girl chances are you arnt gonna be enjoying yourself.\n\nBy the same logic, getting a triple blowjob is *also* super gay ... more often than not, the gangbang is a *female* fantasy, not a male fantasy. It's about degradation, sensory overload, constantly being the center of the sexual attention, etc... for that reason, the search term 'gangbang' is 80% more popular among female porn viewers than male porn viewers, and is among the top 10 most popular searches for female viewers on pornhub.\n\nThe male fantasy associated with gangbangs is generally about fulfilling the *female* fantasy, or otherwise about the same thing (objectification, degradation, sensory overload, and so on). Assuming that a man standing around jerking off isn't enjoying himself is pretty ridiculous, given how many men are sitting alone at their computers watching another man fuck a woman and jerking off at this exact second.\n\n>Also what happens when another dude nuts on the chick and then your dick accidentally touches the nut. Are you really gonna tell yourself that gang banging is straight after getting another dudes nut on your dick? I think not.\n\nDo you think being gay is contagious or something? If you get another dude's cum on your dick and you really enjoy it based on the fact that it's another dude's cum and you find dudes to be sexually attractive, that makes you gay.\n\nIf you get another dude's cum on your dick and you don't puke, lose your boner and run out of the room, but it doesn't sexually arouse you ... that's what *not* being gay is.\n\nSeriously, there is zero risk of you becoming gay by accident -- being scared of suddenly becoming gay is not required in order to be straight.",
            "title_similarity": "0.9344337",
            "sentiment_compound": -0.9326
        },
        {
            "id": "hf0rx5p",
            "score": 3,
            "text": "Who gives a fuck about all that? A nut is a nut. Tell me, if you used a glory hole and got the best head of your life, unknowingly, from a dude on the other side, would you care? \n\nSeriously though, you're only gay of you exclusively find people of the same sex as you attractive. That's it. So, no, it is not homosexual for your dick to touch another man's nut, or for you to jack off in the vicinity of another man, unless you also exclusively find those other dicks and/or nut sexuality charging. \n\n IMHO, i believe sexuality is more like a spectrum with the largest majority of the population in the middle (wether or not they want to admit it), rather than completely straight OR completely gay.",
            "title_similarity": "0.78159225",
            "sentiment_compound": 0.9047
        },
        {
            "id": "hezhpsj",
            "score": 4,
            "text": "Stopped by here juat to let op know hes not alone. \n\nI never put on rap music to listen to, not my thing but i have heard it here and there and i thought the same as op. \n\nOne of the sterotypes ive always had in my head is that rappers and gang members share chicks. I always thought this was disgusting but normalized in that lane of life.",
            "title_similarity": "0.7355728",
            "sentiment_compound": -0.4367
        },
        {
            "id": "hezn7gt",
            "score": 5,
            "text": "Do you think watching straight porn is gay too? You're not physically there but you're still seeing the dude's penis. You two even might be jacking off simultaneously.\n\n&#x200B;\n\n>unless your actually fucking the girl chances are you arnt gonna be enjoying yourself.\n\nThat depends on the guy's preference. Some like to watch the girl instead of fucking her.",
            "title_similarity": "0.77296877",
            "sentiment_compound": 0.8978
        },
        {
            "id": "hezayeq",
            "score": 198,
            "text": "This topic was touched on lightly by none other than Kanye West in \"Hell of a Life\"  \n\n\n\"Said her price go down, she ever fuck a black guy\r  \nOr do anal, or do a gang bang\r  \nIt's kinda crazy, that's all considered the same thing\r  \nWell I guess a lot of \\*\\*\\*\\*\\*\\* do gang bang\r  \nAnd if we run trains, we all in the same gang\r  \nRunaway slaves all on a chain gang\r  \nBang, bang, bang, bang, bang\"  \n\n\nReally makes you wonder *which* \"bangs\" he meant at the end",
            "title_similarity": "0.77620625",
            "sentiment_compound": -0.8445
        },
        {
            "id": "hez7kuv",
            "score": 7,
            "text": "/u/zeek1999 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/pz8za3/deltas_awarded_in_cmv_gangbangs_are_gay/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.59807086",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hezmok0",
            "score": 29,
            "text": "You need to lay off the porn bud.",
            "title_similarity": "0.36310038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hez8wd6",
            "score": 101,
            "text": "Gang-bang as fighting was a much-more common usage in the 90's when gang violence was more of a boogeyman in the news. I definitely get your confusion!\n\nTo touch on sex-gang-bangs, I think people are into gang-bangs for a lot of reasons, but one is degradation - both men and women like the idea of the woman being used/objectified. So that kind of supersedes any accidental nut-touching that might happen.  I think there's also a lizard-brain thing about seeing other sexual competitors that makes some men try harder. Not my kink personally but I get it!",
            "title_similarity": "0.7570234",
            "sentiment_compound": -0.7531
        },
        {
            "id": "hezcl8h",
            "score": 30,
            "text": ">Why do rappers sing about being a gang banger in their song when in reality gang bangs are actually super gay,\n\nMaybe that's exactly the reason why they are singing about it. Maybe it's a celebration of gayness",
            "title_similarity": "0.8219969",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hezdhhq",
            "score": 15,
            "text": "There's no homosexuality even if they cross swords or touch eachothers' semen. Is homosexuality defined by whose fluid touches who and where? As someone else mentioned, the focal point is the woman.",
            "title_similarity": "0.53773177",
            "sentiment_compound": -0.296
        },
        {
            "id": "heza8uz",
            "score": 603,
            "text": "[deleted]",
            "title_similarity": "-0.050475694"
        },
        {
            "id": "hezc7si",
            "score": 443,
            "text": "Setting aside the absolute hilarity of your misunderstanding, the focal point of a gangbang is the woman. You may be around other men, but each of you is ostensibly there for the woman, and (much like pornography) seeing her handled by other men keeps up the excitement.",
            "title_similarity": "0.7187389",
            "sentiment_compound": 0.7684
        },
        {
            "id": "hez7h09",
            "score": 73,
            "text": "... A gang bang(er) is a gang member. Gang bang(ing) is the activities gang members take part in. Ie drive bys, selling drugs, running guns, etc. A gang bang is what you're referring to.",
            "title_similarity": "0.46796727",
            "sentiment_compound": 0.0
        },
        {
            "id": "hezdqq8",
            "score": 40,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezjbhe",
            "score": 53,
            "text": "The meaning of the word has pretty much all been cleared up for you.\n\nAs to the gay part- In real life, dudes don't stand around naked circle jerking and waiting their turn. Usually it's just them standing or sitting around chatting and getting high/drunk and giving commentary until it's your turn to drop your pants and get to business. Nobody touches anyone but the woman, and everybody is wearing condoms, so there's usually not random semen just hanging out to touch.\n\nEven if there were, touching it doesn't make a man gay.\n\nYou're talking about porn gangbangs, and in case nobody ever told you, *porn is not real*.",
            "title_similarity": "0.8112436",
            "sentiment_compound": 0.3506
        },
        {
            "id": "hez6qjh",
            "score": 6852,
            "text": "The gang banging they are talking about in rap songs is usually about actual gangs fighting each other not the gang bangs you are watching on porn hub.",
            "title_similarity": "0.7301289",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hezcyle",
            "score": 1535,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezh9oz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezioht",
            "score": 5,
            "text": "If you fuck your girl right after she gets home from getting creamed by the guy she's cheating on you with, then your dick will touch his cum. By your logic, that makes it gay.",
            "title_similarity": "0.78651035",
            "sentiment_compound": -0.886
        },
        {
            "id": "heziwb5",
            "score": 3,
            "text": "They aren't talking about that kind of gang banging\n\nEven if they were, if the objective is for all these dudes to fuck one chick, there isn't anything gay about that. Just because there are a bunch of naked dudes around together, if the reason they are there is to fuck the girl, it's straight as hell.\n\nEVEN IF it was gay, who actually gives a single fuck anyway?",
            "title_similarity": "0.7940843",
            "sentiment_compound": -0.9349
        },
        {
            "id": "hezizx0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671654"
        },
        {
            "id": "hezjve5",
            "score": 1,
            "text": "It's not gay because there's a honey in the middle for some leeway",
            "title_similarity": "0.4503868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hezk1r0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671654"
        },
        {
            "id": "hezk8ax",
            "score": 3,
            "text": "Maybe you're listening to special rap music, but I cant think of rap songs that talk about that stuff. \n\nTo be gay or homesexuality is a sexual orientation. If a person is participating in sort of group sex thing and they are able to enjoy themselves, that doesnt make them gay. So participating in a \"gang bang\" doesnt mean its gay. Some people are able to focus, not on the random people around them but on the person they're having sex with and energy of the room. Even if a person was interacting with a person of the same sex in this situation, if they arent sexually attracted to men then it's not gay.  If semen got on another man while they were participating in group sex with a woman, nothing happens. It doesn't turn you gay.\n\nIts not something I'd want to do. It's probably weird and uncomfortable and demeaning but I can recognize that it doesn't change a person's sexual orientation. If it did, that person was gay before they joined there party.\n\nBtw, gang bangers are gang members and gang banging is the violent activity of gang members like beating a person up.",
            "title_similarity": "0.7546469",
            "sentiment_compound": -0.547
        },
        {
            "id": "hezkli9",
            "score": 5,
            "text": "Gang banging ≠ gang banging. As has been clarified elsewhere that’s not what they’re talking about in music. But I heartily thank you for making me laugh this fine morning.",
            "title_similarity": "0.6424048",
            "sentiment_compound": 0.8922
        },
        {
            "id": "hezkmer",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezl0mf",
            "score": 1,
            "text": "sure they can be seen that way. but the point of a gangbang is so far beyond that sort of thinking. it's like saying the holocaust was lame because there wasn't much fun.",
            "title_similarity": "0.5859764",
            "sentiment_compound": -0.5192
        },
        {
            "id": "hezlh14",
            "score": 1,
            "text": "Lmfao",
            "title_similarity": "-0.17554972",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hezm2io",
            "score": 9,
            "text": "It's only gay if stare into each others eyes bros! \n\nBut seriously this is a top tier shit post thanks for the laughs!",
            "title_similarity": "0.7461499",
            "sentiment_compound": 0.6103
        },
        {
            "id": "hezmvx5",
            "score": 2,
            "text": "It's not gay it's bisexual. Yes, you're mistreating while surrounded by other men who are also masturbating which is pretty gay, but you're also having sex with a woman which is straight. So it's not gay but it's also not straight, so it's Bi.",
            "title_similarity": "0.78784",
            "sentiment_compound": 0.5108
        },
        {
            "id": "hezn6sa",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671654"
        },
        {
            "id": "heznu38",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671654"
        },
        {
            "id": "heznvc4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezo29m",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezp3nq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezr1hd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezrbdg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezrjmw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hezrjwj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.09671656"
        },
        {
            "id": "hf0jbpw",
            "score": 1,
            "text": "Lol gang banging in rap does not mean sex",
            "title_similarity": "0.49014556",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hf0jd5h",
            "score": 1,
            "text": "This has to be a troll...",
            "title_similarity": "0.15099043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hf0k9gq",
            "score": 1,
            "text": "Gangbangs are gay unless.........you say no homo at the end.",
            "title_similarity": "0.6405755",
            "sentiment_compound": -0.296
        },
        {
            "id": "hf0l1qh",
            "score": 1,
            "text": "I think you got the wrong terminology for gang affiliated gang banging",
            "title_similarity": "0.4797142",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hf0ld06",
            "score": 2,
            "text": "It’s only gay if you don’t say “no homo”",
            "title_similarity": "0.5084582",
            "sentiment_compound": 0.0
        },
        {
            "id": "hf0lzxa",
            "score": 1,
            "text": "Lmaooo. This is great!",
            "title_similarity": "-0.008899434",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hf0m329",
            "score": 1,
            "text": "Lol you’re about to learn something new",
            "title_similarity": "-0.00029576942",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hf0nqgl",
            "score": 2,
            "text": "In the UK, a Gangbang is an orgy. When we hear Americans talk about gangbangers, we think of swingers. We call, them gangstas here.",
            "title_similarity": "0.5794526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hf0p6dz",
            "score": 2,
            "text": "I can see that someone has already addressed the term gangbang and it's connotations to you. But I would propose that when group sex happens in street gangs, like when they sexed female members in, it was through running a train. Not a gangbang. When you run a train, only one guy goes at a time. So the guys aren't ever really standing around looking at each other's junk. No swords clashing and no checking the oil going on.",
            "title_similarity": "0.7176945",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hf0p9gn",
            "score": 1,
            "text": "In ancient Rome it was only gay if you were penetrated.",
            "title_similarity": "0.5217222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hf0q2i0",
            "score": 1,
            "text": "This needs to be pinned, mods",
            "title_similarity": "-0.036155075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hf0qg68",
            "score": 3,
            "text": "A gang banger is a person in a criminal gang, not a person who engages in group sex.",
            "title_similarity": "0.43636787",
            "sentiment_compound": -0.34
        },
        {
            "id": "hf0spnh",
            "score": 1,
            "text": "I love this",
            "title_similarity": "-0.061855085",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hf0swid",
            "score": 2,
            "text": "Gang-banging is not the same thing as a gang-bang.",
            "title_similarity": "0.31760493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hf0tsiu",
            "score": 2,
            "text": "Im fuckin cryin!! Lmao this is def top \"cultural\" ignorance post this week...holy shit lol",
            "title_similarity": "0.44072247",
            "sentiment_compound": 0.5044
        },
        {
            "id": "hf0u4s5",
            "score": 2,
            "text": "Complete missunderstanding but good post OP",
            "title_similarity": "0.25206643",
            "sentiment_compound": 0.5927
        }
    ]
}