{
    "CMV: It’s not just that the minimum wage is too low, it’s that employers try to make every job minimum wage\nDon’t get me wrong: Everybody should be able to live off of what they can earn from a week’s work. If a company can’t survive by paying people properly for their time, it shouldn’t survive at all.  HOWEVER… Just focusing on the dollar-amount of the minimum wage draws attention away from the fact that employers are abusing the hell out of it. Every time I see a discussion of minimum wage someone gives an example of a job that is horribly underpaid at (say…) $12 an hour. I can’t help but agree - but my first reaction isn’t “we need to raise the minimum wage”, it’s “why the hell is that considered a minimum wage job?”": [
        {
            "id": "hfhr8wr",
            "score": 1,
            "text": "/u/Opr9r (OP) has awarded 4 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/q1ziu1/deltas_awarded_in_cmv_its_not_just_that_the/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.40900367",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hfhaywu",
            "score": 131,
            "text": "Every job minimum wage?  Only 3% of Americans make minimum wage.  \n\nThe problem is most of these jobs aren’t underpaid at all.  They are paid exactly what the market demands.  If I can offer $8/hr for a job with little skill required and get plenty of applicants, then what’s the issue?",
            "title_similarity": "0.7099726",
            "sentiment_compound": -0.4696
        },
        {
            "id": "hfherk5",
            "score": -1,
            "text": "This is actually a sign that the minimum wage is too high and there is an unnatural floor on wages that would otherwise be lower if the market could work freely",
            "title_similarity": "0.76902485",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hfhjqzp",
            "score": 2,
            "text": "I am gonna double disagree with you, it's not the employers job to take care of their entry level employees, unskilled laborers tend to unionize and then the unions proceed to rob them. A good example is grocery workers they unionized to help their wages, and they strike...what happens the company just hires more workers because they have nothing to offer. That's the threshold for skill, if I can hire someone and have them up to speed at your job in 2-3 days you're not skilled labor.\n\nNow most the jobs that are minimum wage are designed to give young adults experience they're not meant to be held long term, they're a revolving 2-3 year door where people get some experience and move on. What's happening is people lack motivation to leave because the government steps in to take care of them. So now the opportunity to move up and challenge themselves is not appealing because they can make minimal effort and still thrive.\n\nNow let's look at the employer side. They're offering people a chance at what? Experience, they're offering people a chance to build themselves up and move in 2-3 years to a better position. A professor once told me what you make of the opportunities presented to you, is your responsibility, so if you choose to treat the opportunity like it's just a minimum wage job and you shouldn't care, you will always work minimum wage, however if you learn and grow and take it as experience you will find success.\n\nThis is just thoughts from a guy who went from living in a car for a few months to graduating college working a minimum wage job the whole time. Now I make great money and am among the top of my field. Opportunities are what you make of them, squander them and no amount of money is gonna help you.",
            "title_similarity": "0.85392535",
            "sentiment_compound": 0.9868
        },
        {
            "id": "hfhx7v8",
            "score": 4,
            "text": "There is a middle-ground to this argument. Milton Friedman argued it and several countries implemented it.  \n   \nWe should have an age-staggered minimum wage.  \nPeople under 21 should be paid >$7/hr.   \nPeople over 21 should be paid >$15/hr\n   \nWhy? Well, if you deployed this model, some jobs would constantly fire people when they hit 21 and only employ people under 21. Which sounds great, but that kind of turnover is going to be a disaster for a lot of jobs. So while a restaurant might stop hiring hostesses under the age of 21, they aren't going to do the same with the cooks. They will gladly raise their pay to $15/hr.  \n  \nThis protects employees from abuse but also carves out jobs for young people.",
            "title_similarity": "0.8168318",
            "sentiment_compound": -0.891
        },
        {
            "id": "hfhrm64",
            "score": 1,
            "text": "Quote: Don’t get me wrong: Everybody should be able to live off of what they can earn from a week’s work.\n\nThen the minimum wage is too low. I agree, a the worst job should make enough to feed oneself, cloth oneself, and similar necessities on minimum wage.\n\nThat is not the case.\n\nJust look up median prices for rent, electric, water, and internet (a necessity in these times)\n\nNow add how much it would cost to eat, you can look up the low end on that too.\n\nNow add your toothpaste, gas for your clunker to get to work, and a random bill lets say trash disposal. In life, that random bill is different every month, like maybe next month its a 300 ambulance fee. Maybe the month after that its buying new work boots... steel toes don't come cheap...\n\nMinimum wage didn't cover it, not even close.\n\nSo, if there \"is\" a job that would be considered \"ok\" to pay the \"minimum\", it just doesn't pay the bills even if it fits your description, so the minimum wage should be much higher, period.\n\nJanitor and Traffic flag waver, along with the person cooking your hamburger at lunch, any crap job you can think of really, should all be able to pay for basic needs. Minimum wage must go up to accomplish that.\n\nHave a great day!",
            "title_similarity": "0.8298501",
            "sentiment_compound": -0.4397
        },
        {
            "id": "hfhbz9o",
            "score": 1,
            "text": "Please identify which jobs exist, and must exist, that a person would do fulltime (i.e. 35-40 hours depending on if lunch is paid), not deserve to make a living wage doing it, and why.",
            "title_similarity": "0.7467955",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfhl02p",
            "score": 1,
            "text": "The minimum wage exists to patch a fundamentally broken aspect of capitalism, which is that the labor market, the market that most directly affects everybody's lives, has a near constant supply at any price and so is not really subject to normal market forces. During the gilded age and a couple of other points throughout history we found out that this allows employers to depress wages to almost nothing and demand almost everything of their employees. This made being an American worker generally not a good time and pushed a lot of the middle class into poverty. In 1938 a solution was proposed: the minimum wage. It was envisioned as a living wage mandated as a baseline for any employer. The idea was that if your business could not provide enough value to give all of the people working for a reasonable quality of life it shouldn't exist, and if it is making large profits off of its workers they should see at least enough of that profit to keep food on their table and roofs over their heads. It is not ideal, but for now it is the best system we have at our disposal to counteract the pitfalls of the labor market and ensure decent wages. As such a dollar amount is important. Ideally we would move away from having a minimum that wages get magnetized to, but as long as that minimum provides an okay standard of living it's a lot better than not having it until another system gets put into place which would take time and a ton of political will to do. People would only be pushed further into poverty if we got rid of it. It is significantly faster and requires significantly less willpower to increase the minimum wage and has the benefit of keeping everyone's head above water.",
            "title_similarity": "0.8752161",
            "sentiment_compound": 0.9618
        },
        {
            "id": "hfhmp2t",
            "score": -1,
            "text": "It's not Employers that are making every job \"minimum wage\".\n\nIt's the Federal Reserve, Treasury and Government. It's the IMF and WEF and the UN.\n\nAll the Governments/Central Banks of the world are \"printing money\" (essentially) with reckless abandon. This causes price inflation, especially asset price inflation. Wages might be fixed for a year, while asset prices increase daily. The stock market and property climb while leaving wages in the dust.\n\nEmployers try and keep up with higher wages out of necessity, but they are competing with the government's destruction of the dollar's purchasing power, the government's destruction of jobs and supply chains in the private sector, especially  these last two years with lockdowns and money to stay at home.\n\nSo don't blame Employers.",
            "title_similarity": "0.80829847",
            "sentiment_compound": -0.8037
        },
        {
            "id": "hfh9k78",
            "score": -6,
            "text": "Think of it this way....if someone works a minimum wage job, that means that company offered that person the best option they had. 7 billion people on this earth and no one offered them a better alternative.\n\nIt is weird to blame the most generous offer in a person's life.",
            "title_similarity": "0.7843176",
            "sentiment_compound": 0.7501
        },
        {
            "id": "hfhala5",
            "score": 39,
            "text": ">If a company can’t survive by paying people properly for their time, it shouldn’t survive at all\n\nIf the labor cost more than what the labor is providing, that company is going to go out of business real quick.  \n\n>Every time I see a discussion of minimum wage someone gives an example of a job that is horribly underpaid at (say…) $12 an hour.\n\nWhat job? Does the job require any skill? How easily could that job be automated? Are they getting benefits?",
            "title_similarity": "0.87719434",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hfhbg2o",
            "score": 1,
            "text": "Minnimum wage most times is directly correlated to Minnimum skill like I for example am an iron worker its dangerous dirty I have to carry very heavy materials in extreme heat and cold at sometimes extreme heights and know rigging welding trigonometry as well as how to read blueprints and make an erection schedule from said blueprints so naturally I'm paid very well now look at someone who works at McDonald's they have to have a loose grasp of the most commonly spoken language of the area the store is located in  be able to read and know how to not burn food all of which are very basic skills 95 percent of the population has so you wouldn't pay them nearly as well as someone with more skill and experience",
            "title_similarity": "0.6719117",
            "sentiment_compound": 0.0907
        },
        {
            "id": "hfhoep5",
            "score": 0,
            "text": "minimum wage means normal ppl will be able to afford it if a certain amount of manpower is need to make a product affordable. If I make a cake for 30 dollars 10 dollars is my wage 20 dollars gets the employer (he has to buy the ingredients and oven and marketing, tax., building if needed..) . you have to sell a lot of cakes to uphold this business. if i would make 20 dollars the cake would cost 40 dollars and less ppl would buy it.",
            "title_similarity": "0.7078515",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfjqq63",
            "score": 0,
            "text": "When a person is willing to work for your business for 8 hrs a day you should provide a basic living that's the least you can do",
            "title_similarity": "0.6305864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfk2cvg",
            "score": 3,
            "text": "Raising the minimum wage will just cause employers to lay off workers, and/or raise product prices, and/or automate their workforce… it’s just economics… that’s just how this works… in the end just less people will have jobs",
            "title_similarity": "0.8385254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhk5ca",
            "score": -1,
            "text": "Nowhere in the United states can you afford a one bedroom apartment on minimum wage. If that doesn't change your view nothing will.",
            "title_similarity": "0.64508677",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hfhumf8",
            "score": 1,
            "text": "Minimum exists because slavery is illegal, however you could consider main wage, slave wage, you'll never be able to leave it.\nCorporate greed and greed in general is the culprit. Why does the CEO need to make 100x more is it not enough to make 20x as much?\n\nThe only positive in this is that this kind of mentality will drive us all equally to disaster.\nWe all live on the same planet and no fancy house or stocks will save you. Sure you'll live a little longer than the rest of the poor souls living on rock soup...but trust me the day will come when we all all go back to live in caves.",
            "title_similarity": "0.8174071",
            "sentiment_compound": -0.9001
        },
        {
            "id": "hfi83dt",
            "score": 1,
            "text": "Yep you seem to get it.  Capitalism sucks.   Money > Human life.",
            "title_similarity": "0.62876034",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hfjq9ku",
            "score": 1,
            "text": "\"If a company can't pay people for their time, the company doesn't deserve to survive\".... (Paraphrase)\n\nYou just put about 20% of the workforce on welfare.  You stopped about a third of all entrepreneurs from risking starting a business.  You know absolutely nothing about running a business.\n\nThe market is taking care of itself as it always does without government control.  It's an employees market right now so wages will increase.  When the full inflationary effect kicks in, job growth won't exist.\n\nThanks Dems!!",
            "title_similarity": "0.82287073",
            "sentiment_compound": 0.5629
        },
        {
            "id": "hfhgag1",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.04456494"
        },
        {
            "id": "hfhve5n",
            "score": 2,
            "text": "I think we should give more attention to the value the employees provide rather than the lowest possible amount they can be paid. If an employee can generate hundreds of dollars per hour for the business they should be compensated according that regardless of the difficulty of the work. When 6 employees at Starbucks move hundreds of customers paying between 10$-30$ for 8 straight hours it's insulting for them to get 10/hr (my exact experience) regardless of how hard you think they have to work. \n\nPeople saying that they accepted the job so why do we care how much it pays are a bit sociopathic. You don't know their situation, in many cases that's the only job they can get. You don't know why, all that you know is they are severely underpaid for how much value they produce. \n\nIf you say it's about how easily they can be replaced, I don't really care. If the employee that replaces them has the same value they should be paid accordingly. \n\nMany fast food corporations could easily double their employees wages. Why are we so complacent when they don't even keep wages consistent with inflation?",
            "title_similarity": "0.8727572",
            "sentiment_compound": 0.2533
        },
        {
            "id": "hfiyx03",
            "score": 2,
            "text": "You say that everyone should be able to live off what they earn from a week's full-time work.\n\nThat's at odds with you saying that minimum wage doesn't need to go up. \n\nMin wage is ~15k BEFORE taxes at 40 hours a week. \n\nNowhere in the US can you add the basics for that, meaning a clean/dry roof, utilities, internet, transport, simple healthcare, and groceries. \n\nTherefore it needs to go up. \n\nBeyond that yeah - lots of jobs that should pay more than they do. I agree there. But employers going to pay as little as they can, which makes sense from some perspectives.",
            "title_similarity": "0.81915855",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hfhvx7h",
            "score": 8,
            "text": "A more consequential effect than minimum wage levels is the McJob phenomena where employers want to hire folks for 25 hrs/wk and use scheduling practices like calling at 11 AM to say \"can you come in for a 1-4 PM shift today ? \"\n\nI cringe every time I hear \"200k jobs created this month\" because for the past 40 years 80 % ? of those \"jobs\" are less than 40 hours/no benefits",
            "title_similarity": "0.7335414",
            "sentiment_compound": 0.7757
        },
        {
            "id": "hfhkjtq",
            "score": 0,
            "text": "The biggest cost is inventory. But price and size if inventory are difficult to negotiate and maintain, and also serve as a buffer against problems.\n\nThe second biggest cost is labor, and its easiest to negotiate and reduce/increase size more flexibly. At least historically.\n\nBoth have been impacted by Covid and other supply chain issues, but those two facts still remain.\n\nSo the answer to your question, in my professional opinion (my job is literally reducing cost, specifically in manufacturing), is that it's both. Businesses want to pay the least for the least skilled work.\n\nI dont believe that's the best way, or the right way, but it is easiest and quickest to see results.",
            "title_similarity": "0.8096873",
            "sentiment_compound": 0.8919
        },
        {
            "id": "hfhn51o",
            "score": 5,
            "text": ">Just focusing on the dollar-amount of the minimum wage draws attention away from the fact that employers are abusing the hell out of it\n\nNope. No one is abusing it, they are just paying enough for them to find workers.   \n\n\n>I can’t help but agree - but my first reaction isn’t “we need to raise the minimum wage”, it’s “why the hell is that considered a minimum wage job?”\n\nThere is nothing that would signify what should be considered a minimum-wage job and what isn't. Only thing that decides it is the fact if there are people who can work this job for that wage.  \n\n\nThere are people who are in desperate enough situation that they can accept being paid less than costs of living and they will supply the missing money by a second job, part time flicks or other means - which is not a situation that is good from societal point of view. That is why minimum wage exists - to decide what should a person earn to reasonably be able to pay for living necessities.  \n\n\nIt's not an employer's job to track what are \"reasonable\" wages from societal standpoint. Their job is to provide products/services and they do that by employing people for lowest wage possible (thanks to this products/services have lowest possible price).",
            "title_similarity": "0.84676343",
            "sentiment_compound": -0.866
        },
        {
            "id": "hfhqsgx",
            "score": 0,
            "text": "Yes 14 year old kids don't need to be payed above minimum age.but absolutely no adult should be paid minimum wage.",
            "title_similarity": "0.578513",
            "sentiment_compound": 0.0534
        },
        {
            "id": "hfhuowc",
            "score": 0,
            "text": "But isn't it the direct consequence of raising minimal wage? The higher minimum wage, the more jobs will be paid at minimum wage, since all the jobs that would be paid less will either disappear or will be paid at minimum wage.\n\nI also don't understand your position about employers \"abusing\" minimum wage. Since evidently there is enough labor supply at minimum wage, why should they pay more?",
            "title_similarity": "0.84238946",
            "sentiment_compound": -0.7854
        },
        {
            "id": "hfhzoto",
            "score": 0,
            "text": "The only reason companies can get away with paying minimum wage is because of social welfare programs that offset the costs. Companies like Walmart have a stated policy of encouraging their workers to get their healthcare from the government, enroll in food stamps/wic, apply for section 8/public housing. They could not get away with paying so little without those programs. Raising minimum wage while keeping the standards for public assistance the same would force companies to provide more for their workers.",
            "title_similarity": "0.76882756",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hfi427m",
            "score": 0,
            "text": "Every wage should be livable. Its then a choice if you want to better yourself for a more luxurious quality of life and try to get a better paid job. Minimum wage is an unliable wage because then you can have a high turnover of staff and treat them like shite because they have no workers rights.",
            "title_similarity": "0.89245665",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hfifx10",
            "score": 0,
            "text": "Im trying to make sense of this for states who still have the minimum wage of 7.25. Even if you get a promotion from that, it is wayyyyy too low, especially looking at other states with a minimum wage thats double that of 7.25 or close to it. There is no reason 7.25 should still be in effect, it's just straight slave labor. You work full-time at minimum and that is only 290 a week without taxes. You can't expect me to sit here and think, yea that price is fine. That's too low.",
            "title_similarity": "0.8466451",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfiivkr",
            "score": 0,
            "text": "Hi I'm Mark. \n\nI want to open up a local gym so I can make a modest living being around my passion in sports and fitness. \n\nI would love 10,000 square feet, but it's way over my price range. \n\nI'll stick with 3,000. I found a place in NY that would be be $5,000 per month. \n\nDoesn't include utilities or my salary yet. \n\nI make nearly $100,000 doing my current job as an engineer. So I would like to make that in my new venture or what is the point? \n\nSo that's about $8,000 per month. \n\nNot including utilities this venture now costs me $13,000 a month to operate. \n\nHow many people do I need to sign up a month? \n\nMost people here might think $100 is too much for a gym. Some people here might pay $200. \n\nLet's say it's $100... I will then need 130 people to sign up to my gym. \n\nWoah. Not an easy task for someone starting off to just have 100 people wanting to sign up and pay $100. Better be a nice gym. Better have nice equipment. **Note, I have not discussed the costs of utilities or equipment yet or fixing up my place so it is attractive.** \n\nSo I mean, my 130 estimate is probably closer to a need of 200 people. \n\nWoah, just became harder. \n\nThat's about 100 people every other day coming in doing 3x per week. \n\nI'd have to work Saturdays now to do the 2 groups of 3x per week each (Monday, Wednesday, Friday and Tue, Thur and Sat). Sundays I am off... sucks for the people who spend $100 for the gym. \n\nOkay 100 people per day is what? 5 groups of 20? EEE who can do groups of 20? \n\n10 groups of 10? Now I am working 10 hours at various times a day. \n\nSo I went from working 40 hours a week making $100,000. \n\nTo 60 hours a week making less. \n\nLooks like I will hire someone. \n\nWell how much am I paying him for an hour of his time? \n\nIs he good? She good? \n\nThey good? \n\nBasically in my calcs, 3x per week for 4 weeks is 12 sessions for $100. That's $8 per class basically. If I split the pay with my trainer for their time, that's $40 an hour for X hours. \n\nGood pay, but now I get the 50% remaining. So it's basically like me getting half my revenue which we knew can't be done yet with out more people and more classes and more help needed. \n\nSo what if I give 25%? They make $24. And I lose 3/4 of my revenue. We already decided that we can't do that. I need that exact amount or more people or more classes. \n\n**So I am in a bind.** \n\nThere are a few things I can do. Charge a bit more but then it's harder to find customers, and then my trainers will beg for more money. \n\nI can allow more per class, but how is the quality of my product now? Is it worth $8 per class? \n\nI can charge less and get more people... but then I am competing with huge globo gym prices and I would have to get a bigger place.\n\nOr maybe I just stay at my job and just keep doing this where I get raises every year, have time off, have benefits and so forth.... tempting. Low risk. And then I employ no one. \n\nSeems like owning a business is hard. \n\nIdk why most do it. \n\nAnd this is a gym. \n\nHow about places that sell VHS tapes lol. Or DVDs. \n\nA place that sells ice cream? How does it work?",
            "title_similarity": "0.63975024",
            "sentiment_compound": 0.9947
        },
        {
            "id": "hfik0po",
            "score": 0,
            "text": "Lets through some facts in here rather than broad assertions. Very few people actually earn minimum wage, according to the BLS 1.5M people earn min or below min wage (I'm guessing this is people in the tipped industries). Of those, 50% are under the age of 25. 1.5m is a large number, but it means that only 2% of women and 1% of men are on minimum wage. So minimum wage work is actually quite rare.\n\nSecondly, despite what you hear, life is actually getting cheaper and cheaper. Things such as energy, food, and entertainment have all plummeted in price. Expectations haven't. The fact that you have 1000x the Library of Alexandria in your pocket doesn't amaze anyone, but it should. Even housing and education, which people say has spiralled out of control, has got cheaper. Housing in America has got cheaper per spft, as houses are bigger, except in a few hyper desirable locations, such as NYC, SF, LA etc. This trend can be seen around the world in London, Sydney, Hong Kong, Paris etc. Lots of people want to live in places where there are the best jobs, food, entertainment, transport etc, and are willing to pay for it. Education is cheaper, although credentialism is not. If you wanted to know why light refracts through a prism 300 years ago, you would have had to get on your horse and ride to Cambridge and ask someone. Now you can find out in 2 seconds on your phone. What people are thinking about is not learning about refraction from Cambridge, it is a certificate that said you learned it from Cambridge which is so desirable.  \n\n\nThis is getting too long. Tl;Dr most people aren't on minimum wage, and minimum wage gets you a hell of a lot more than it did in any time in human history. The issue is widening inequality, which affects people's sense of status within a community. If everyone is poor, then its manageable. Once things become stratified, people get upset. Watch out.",
            "title_similarity": "0.6527394",
            "sentiment_compound": 0.6202
        },
        {
            "id": "hfj6tc2",
            "score": 0,
            "text": "You are definitely wrong. Minimum Wage's original purpose was supposed to be at the time what people considered for one person (a man) to be able to sustain a family of 4 working normal hours. That was in 1938, 83 years ago. It was also supposed to increase with inflation and with states having their own Minimum Wage, it is supposed supposed be matched to their cost of living of their area.\n\nhttps://www.law.cornell.edu/wex/minimum_wage\n\nThen you ask the question \"Why the hell that a considered minimum wage job?\" Well there's several parts to that. First and foremost, what do you consider to not be an appropriate wage for a job? Next, how would someone else who works that same job feel they should be paid? Then, how would a person who's considered either a master or a more graduated position feel about how they are being paid? That's just thought driven alone.\n\nMoving on to the next piece, how could the market sustain that job being paid how it is? Does it make good business sense to pay that job more than the minimum?  As opposed to the above, the question goes from a personal question to a practicality question. I also agree with a thread I saw that you answered your question.\n\nPersonally, I agree that some jobs should be paid more than the minimum. I feel like Minimum Wage for that job is more of an insult than a good thing. I also feel that Minimum Wage should have been kept on to ensure it adjusted to inflation and not just left to political decision. I don't quite think that it should be $15/hour like some states suggest, but it should be adjusted for, as I mentioned before, a modern family of 4, living within their means where one person works, working normal hours, in housing they should be able to afford and that after all the other necessary bills are paid should at least have a percentage left for saving or spending as they so desire. Such a vague answer is broken down by the cost of rent and utilities, the cost of a grocery bill not to be depleted before next payday, enough to pay a car note once the month is over, enough to provide gas for that car to get the employee to and from work with some gas to take them to the store, enough for a cellphone and plan that is reasonable for one person (maybe two people) and still have money in the event of an emergency. As you can see, it definitely should be adjusted based off of where one lives and adjusted for their local inflation, as well as whatever else inflation effects.",
            "title_similarity": "0.73442",
            "sentiment_compound": 0.8278
        },
        {
            "id": "hfjaegp",
            "score": 0,
            "text": "The problem is not the amount paid per hour, it is the amount of hours the job schedules. \n\nIn my area our minimum wage of $12.15 an hour is a living wage by FDRs definition if you work 40 hours a week and are a single person. You monthly take home income would be about $1,560. You could get an unfurnished one bedroom apartment for $500 or an unfurnished studio apartment for about $400. You could pick up enough furniture to start for about $100 hitting thrift stores and yard sales. You can afford to meet your basic necessities and have enough for savings or the odd luxury. This includes a basic health care package and decent public transportation. \n\nThe problem is the majority of minimum wage jobs here are part time and around 20 hours a week. That cuts your take home pay to about $780 a month. They also do not come with even basic medical benefits. Not only do you have less money to spend but you have to spend more money to meet your basic necessities.",
            "title_similarity": "0.7103492",
            "sentiment_compound": -0.3071
        },
        {
            "id": "hfjaexr",
            "score": 0,
            "text": "Well let's start with the easy rebuke. The US federal minimum wage is objectively too low. In cities of appreciable size nobody is making anywhere near federal minimum wage. Not the janitor, not the walmart cashier, not the ditch digger, etc. Nobody. In the rural areas where this isn't true you have a monopsony that would benefit everybody but the select few giant corporations that do appreciable business in these areas ala walmart. I can't remember the exact detail of what the generally agreed upon wage that would start causing problems is, but it's around the generally requested $15 an hour which makes it a good candidate for the new minimum. By the time there's actually political will to do it, it will be at or below the right number. A lot of causes championed by this general group tend to be poorly researched (eg just switch to solar), but minimum wage isn't one of them. When first enacted it was too high (hence why you'll see people say it used to be equivalent to ~$22 an hour today), but it hasn't done anything near keeping up with inflation in recent years. When you dig into the minimum wage economic research you're going to find that while every county and city has a different optimal number, $15 is about right.\n\nAs for your other claims, what jobs do you have in mind? Because EMTs are the only profession that immediately come to mind as being underpaid, and it's not as bad as you're even probably thinking because they mostly just drive ambulances.",
            "title_similarity": "0.7082522",
            "sentiment_compound": 0.9429
        },
        {
            "id": "hfjhu6c",
            "score": 0,
            "text": "A job is worth what someone is willing to pay and what someone is willing to take for it.\n\nWhy do you need a law that says that individual can't have that job they want to do?",
            "title_similarity": "0.7864397",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfkkgzt",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.04456494"
        },
        {
            "id": "hflm5it",
            "score": 0,
            "text": "Look at every market that's raised minimum wage over the last 10 years. None of them feel like they're making more money than they were before. Inflation outpacing wages is the big problem. Continuously raising min wage would put a massive amount of small businesses under very quickly.",
            "title_similarity": "0.74808204",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hflocq8",
            "score": 0,
            "text": "> it’s “why the hell is that considered a minimum wage job?” \n\nSupply and demand are basic principles of economics that impacts pricing of goods and services. When supply is high, and demand is low, relative to one another, prices drop, until the demand at the price equals the supply at that price. Applying this to low wages jobs, we see that the supply of people capable of performing these jobs at said price is equal to the demand by the economy for people to perform said jobs at these prices. \n\nsource: https://www.britannica.com/topic/supply-and-demand",
            "title_similarity": "0.8079355",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hfmfbe0",
            "score": 0,
            "text": "What a lot of progressives who call for raising the minimum wage because people aren't earning enough, don't realize, is that it's other progressive policies that caused the problem.\n\n* Women should be allowed to work -> women in the workforce, now there's much more supply of labor than before WWII -> \n* Immigrants should be allowed to enter the country -> more people in the workforce, larger supply of labor\n* Rent regulation -> less incentive for new housing construction -> fewer houses available -> rent goes up (where it's not regulated / when tenants turn over)\n* More regulations on the workplace -> increased barriers to entry -> less competition between employers -> wages go down\n* Everyone should get to go to university -> more people graduate university -> university degrees become less valuable, people with them can't get well-paying jobs\n* Everyone should be able to get student loans -> would-be students have more money -> university charges more money for tuition\n* Everyone should have access to healthcare -> government pays for healthcare -> healthcare providers charge more\n* Everyone should be able to make ends meet -> government provided welfare for low income earners -> employers are able to pay lower wages because government is subsidizing the workers\n* We need more money for welfare than the government gets from taxes -> print more money -> inflation -> minimum wage now means less\n\nNot saying that these were bad policies, just recognizing that even good policies necessarily have downsides, and the progressives are all too often oblivious to that fact.",
            "title_similarity": "0.8123404",
            "sentiment_compound": -0.4563
        },
        {
            "id": "hfh94mt",
            "score": 1375,
            "text": "Employers want to pay the least amount that they possibly can for labor.  This is Economics 101.",
            "title_similarity": "0.75676394",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hfhk1n4",
            "score": -1,
            "text": "No. It's that min wage is too low",
            "title_similarity": "0.46108633",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hfhnmqc",
            "score": 1,
            "text": "The argument that if you can’t pay minimum wage you should go out of business is a dangerous fallacy.  If we got rid of all these businesses, it would have a massive ripple through the economy. They wouldn’t be buying from suppliers and people needing to get that first job experience would have a much harder time. I agree, we want people to have a living wage. What we don’t want is a situation where the choice is a living wage or no job at all. We should proceed carefully on this so that we don’t suddenly have a whole lot of unintended consequences.",
            "title_similarity": "0.86139095",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hfhrnrm",
            "score": 1,
            "text": "It is disgusting and business will always be this way it will never change. Employers are entitled and want everything they can get they’ll never care for the welfare of their staff because they can be replaced with a click of a finger. Or not at all if they want even more cash.",
            "title_similarity": "0.79212844",
            "sentiment_compound": -0.5152
        },
        {
            "id": "hfi4zw1",
            "score": 1,
            "text": "Your comment hits the nail on the head. The minimum wage should be a LIVING wage. But the idea is so divorced from that today.\n\nThe idea of a minimum wage as 'the bare minimum, a level below which it would be criminal to pay someone, something which companies should be embarrassed to offer and people should be ashamed to receive' is what we need to get rid of - that the minimum wage is and should be something undesirable instead of a reasonable amount to live on. \n\nThe minimum wage, for people of adult age, should be a living wage. We've been taught to see it as something gross, something associated with pathetic people who aren't working hard enough, something to look down on so that they can get away with paying people peanuts. \n\nCompanies have no incentive to pay people more as long as there are desperate workers. Companies don't have morals, they just have bottom lines and investors to attract with great returns. They prefer to spends millions affecting public opinion and keeping their political allies in power than pay people fairly for their work.",
            "title_similarity": "0.83732176",
            "sentiment_compound": -0.9754
        },
        {
            "id": "hfibvpr",
            "score": 1,
            "text": "It sounds like your basic argument is that some minimum wage employees should be paid more for their work than they are. In rebuttal, I would ask how we regulate how much a job is 'worth'.\n\nThe more training you need for the job, the fewer people will be able to do it, therefore the salary will rise. But on the flip-side, some jobs are low-skill yet *required* in order for society to function.\n\nUltimately, it is the market forces that decide on the worth. If employers pay too much, they won't have enough money left over to become big players, and if they pay too little, the employees will look for jobs elsewhere.\n\nThe problem comes in when the government mandates a minimum wage. For simple math, say you have a business that can afford $30 in wages, and pays employees $10 per hour. They can afford three employees. But then say a minimum wage is enforced at $15 per hour. The business doesn't suddenly have more money to allocate to wages, so they now have to pay two employees $15 per hour and let one of them go.\n\nInflation is directly tied to the minimum wage, and the more the average person gets paid, the more the cost of living goes up. Ergo, your money becomes worth less. So you're now in a situation where the two remaining employees are essentially in the same boat, yet one still has to find another job. And fewer companies will be able to afford to hire someone at the new minimum wage...\n\nSure, it would be nice if everyone was paid a lot for their work, but 'a lot' is comparative, and so it is an impossible ask. Instead, they should get raises based on company performance and individual performance -- which they already do (or at least should).",
            "title_similarity": "0.88581467",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hficjqn",
            "score": 1,
            "text": "It's like Chris Rock said -- \"I would pay you less but it's AGAINST THE LAW!\" What kind of message does that send your workforce?",
            "title_similarity": "0.71997225",
            "sentiment_compound": 0.2124
        },
        {
            "id": "hfik4uo",
            "score": 1,
            "text": "Governments and corporations found a way to weaponize poverty.",
            "title_similarity": "0.5198164",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hfinqym",
            "score": 1,
            "text": "Or contract workers or make them part time so no benifits",
            "title_similarity": "0.5758432",
            "sentiment_compound": -0.4341
        },
        {
            "id": "hfiqdli",
            "score": 1,
            "text": "Minimum wage is an arbitrary number. Can be £1 or £1 million. If you raise the salary of a store worker the company will raise product prices to pay for it, then you will need a bigger salary for cost of living. Landlords will raise their rent to pay for the extra cost of their living. The price of everything rises causing inflation and everything will reset to how it was, but the numbers will be higher. A certain amount of people need to be below the living wage, that’s economics and it will never change.",
            "title_similarity": "0.84626424",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfiqul6",
            "score": 1,
            "text": "Only around 2% of jobs in America are at the minimum wage.\n\n[source](https://www.bls.gov/opub/reports/minimum-wage/2020/home.htm)",
            "title_similarity": "0.53868085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfisz8u",
            "score": 1,
            "text": "Your argument is that everyone should be able to live off minimum wage, but that cannot be the case. The higher the minimum wage, the more unemployed there will be. It just doesn’t fix the problem. Something that will would be going to school and increasing your value as a worker.",
            "title_similarity": "0.8610457",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfit1jp",
            "score": 1,
            "text": "We need to think of minimum wage as the base amount for a human's time. It's the one thing that everyone has and it is what everyone is selling to their employer. After that, you are paying for their knowledge and experience. Maybe then we can finally get rid of these people that scoff at a burger flippers making a living wage. They are selling their life away just like everyone else. They should be able to live with some dignity and security too.",
            "title_similarity": "0.84926605",
            "sentiment_compound": 0.765
        },
        {
            "id": "hfj3lvh",
            "score": 1,
            "text": "You mean, jobs that require “5 years experience with x” and “3 years experience with y”?  \n\nBecause those are definitely NOT “minimum wage jobs.”  \n\nThen there’s the lack of training on jobs.  “You need a college degree.”  Why?  Most jobs require just common sense as a background (colleges don’t teach that) and everything else is proprietary processes/procedures.  If not actually “secret,” then “our way of doing it.”  You can only learn “their way” if you work there.  \n\nSo stupid.",
            "title_similarity": "0.63387716",
            "sentiment_compound": -0.6515
        },
        {
            "id": "hfjab9g",
            "score": 1,
            "text": "Not really actually trying to counter OP's or anyones argument here, but I've had multiple minimum or just above minimum wage jobs in the last few years (they were all $7.25 to $8.75). I will tell you I've always at least once asked for a raise, and the managers (of franchises, I'll point out) would respond like it's not even something they'd be able to do, like it's not even possible, while also acting like there isn't someone else to ask. (To be fair, one of those places would give you a gradual raise annually based on your performance and hours put in, but it would only increase less than a dollar a year, and would cap at $11.00 an hour in that system, I found out by asking other longtime employee's).",
            "title_similarity": "0.77379286",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hfjd9y7",
            "score": 1,
            "text": "This is where I think the term \"socialism\" can be more fairly thrown around. \n\nThe fact is, to have any reasonable amount of control over job pricing requires significant amounts of \"public\" intervention. It takes many pricing points away from the market.\n\nSure, the companies will still be \"owned\" by private individuals - but a huge amount of control will be out into governmental decision making.",
            "title_similarity": "0.75554144",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hfjiqbu",
            "score": 1,
            "text": "You're also forgetting tax burden.\n\nThe poor spend nearly every dollar they make, they deserve to keep their hard earned money.\n\nThere should essentially be a standard deduction of $30k. Nobody should pay tax till they get a \"real\" income.",
            "title_similarity": "0.82951504",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hfjr99u",
            "score": 1,
            "text": "How can people except retailers to continue to raise wages?\n\nLet’s use the poster child, Walmart.\n\nIn 2020 they had revenue of 523 billion and 2.2 million employees. This comes to $237,000 sales per employee. Of course to sell the goods, Walmart must buy the products. They have a gross margin (revenue - cost of goods sold) of 24%.\n\nThis means after paying for the products but literally nothing else they have $57k per employee. In 2020 they had profits of $15 billion or $6,800 per employee.\n\nWhile low income workers are clearly facing hardships, does anyone have any ideas that don’t result in massive price increases for the rest of society?\n\nSide note: before people cry out “but Costco” Costco has a gross profit per employee of ~$75k giving them a much better capacity to pay higher wages (which they obviously do)\n\nWalmart and others are simply bound by economic realities",
            "title_similarity": "0.7303117",
            "sentiment_compound": 0.7149
        },
        {
            "id": "hflh1f2",
            "score": 1,
            "text": "If gas prices go up just like how they are now then minimum wage should go up. If they want to raise it some more then we go up even further",
            "title_similarity": "0.52162826",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hfhn5qd",
            "score": 2,
            "text": "I've never seen an airline trying to hire pilots or hospital trying to hire doctors at minimum wage.",
            "title_similarity": "0.46587858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhnsw5",
            "score": 2,
            "text": "My first reaction is actually “why raise minimum wage if everything else is just going to go up in cost at a higher percentage than minimum wage is raised?” Oats have gone up from $1.99/kg to $3.99/kg at the grocery store I frequent in the last 6 months. And thats just one example. And if minimum goes up, what about the people that already make above? Most of then will not get a raise, yet prices of food and other resources continue to skyrocket. I’d rather see prices of goods go down, even if that means wages have to come down.",
            "title_similarity": "0.73962045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhrl6p",
            "score": 2,
            "text": "Most businesses run under really tight profit margins. It is logical and fair for them to keep costs as low as possible",
            "title_similarity": "0.65534544",
            "sentiment_compound": 0.5233
        },
        {
            "id": "hfhxx6e",
            "score": 2,
            "text": "if there was actual competition in the market for you as a worker/product/means of productivity for making money, there would be no need for a minimum wage. but when corporations lobby and are able to destroy any competition and work together in their industries to limit your wages and crush unionizing, the minimum wage acts as an absolutely pathetic safety net and an excuse for not looking at the bigger problem, not to mention the government has to subsidize worker income so they can just barely scrape by. now, with rent too high and inflation everywhere, the conditions of these jobs getting worse... it's best not to give in. don't play their game; and that's what you see now in the united states.",
            "title_similarity": "0.87160057",
            "sentiment_compound": -0.8007
        },
        {
            "id": "hfi4lw7",
            "score": 2,
            "text": "The fact that you believe employers should pay a minimum wage that is enough to be able to live of is completely asinine.\n\nIf employers aren’t able to provide that level of pay then they will just either die or up their wages. We don’t need laws or welfare to fix these issues. Just pure supply and demand",
            "title_similarity": "0.8893075",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hfipghu",
            "score": 2,
            "text": "I actually agree with you, but I see it from a different angle. I think minimum wage workers deserve to be paid more, and if they *had the option to refuse to work* then employers would have no choice but to raise wages in order to attract workers.\n\nWe saw this during the pandemic when people could get by on the stimulus checks and weren't forced to work for dehumanizing wages. Employers had a hard time finding workers, and the natural result there over time would be that they have to keep offering higher and higher wages until they are able to rent the labor they need.\n\nThe real problem is we don't have a UBI, free housing, or other such social safety nets. If we, as a society, provided a basic level of care to everyone, then labor becomes optional. Once labor is optional, the supply of labor drops dramatically. By the law of supply and demand, the price of labor would then increase all on its own.\n\nIf we had a UBI, we wouldn't need a minimum wage. Market forces would create a natural and fair minimum wage automatically.",
            "title_similarity": "0.8918356",
            "sentiment_compound": 0.9619
        },
        {
            "id": "hfiptkt",
            "score": 2,
            "text": ">Everybody should be able to live off of what they can earn from a week’s work.\n\nNo, some people's work isn't worth that much. We shouldn't punish employers because of that fact. Provide for those people through social safety programs instead. \n\n>If a company can’t survive by paying people properly for their time, it shouldn’t survive at all.\n\nAre the employment agreements voluntary? Or are they coerced? If they are not coerced, what the fuck do you care?",
            "title_similarity": "0.9183851",
            "sentiment_compound": 0.7059
        },
        {
            "id": "hfhj4zm",
            "score": 2,
            "text": "I feel like the flaw in your argument is that “the system isn’t wrong it’s just being abused” is evidence that the system is flawed. Being able to abuse the system and work around the rules is to blame. \nIt would be great if employers saw minimum wage as just that, a minimum. But they aren’t and thus the wage must rise.",
            "title_similarity": "0.8234683",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hfhj4zk",
            "score": 49,
            "text": "It's unclear what view you want changed.\n\nClearly, \"employers try to make every job minimum wage\" is false, so that's not likely your view.\n\nFrom what I piece together, maybe the view you want changed is \"Many jobs that hire at minimum wage should actually pay more.\"\n\nIf that is the view, I would agree, and I think that everyone who is in favour of a higher minimum wage would agree. Raising the minimum wage would solve that issue, though.\n\nWhat would you think of this view: \"If a company requires any level of experience in a job ad, it should not be allowed to pay minimum wage.\"\n\nWould that be close to the fundamental idea you want challenged?",
            "title_similarity": "0.8737639",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hfhkezo",
            "score": 26,
            "text": "Jobs are not \"minimum wage jobs\" based on anything other than availability of people to do the work willing to undercut other people who can do the work.  An employer will always pay the minimum wage they can for any type of work.  Employers don't sit around and say \"i'd like to pay those software developers more\" because they value software development they do it because they value software development AND they don't want to lose people with the skill.  \n\nThere are jobs where that line is below the minimum wage.  If the choice is between working and not working people will work for less than the minimum wage.  That's it. \n\nThe path to achieve what you want is untenable - it requires a lot of people to remove themselves from the labor pool and not from the consumer pool.",
            "title_similarity": "0.8120729",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hfhct9s",
            "score": 110,
            "text": "> HOWEVER… Just focusing on the dollar-amount of the minimum wage draws   \nattention away from the fact that employers are abusing the hell out of   \nit.\n\nAnd that is why people talk about the dollar amount. We literally can not force a company to hire people for specific roles. But we can create legislation that requires the company pay a certain amount minimum to address their hiring practice.",
            "title_similarity": "0.88605726",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hfh93jv",
            "score": 191,
            "text": "What sort of jobs are minimum wage jobs that you consider shouldn't be?",
            "title_similarity": "0.6168147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhk11t",
            "score": 1,
            "text": "I think you’re seeing the problem without realizing it. \n\nThe relative negotiating power has shifted dramatically over the years as businesses have grown in size. When you used to be able negotiate between multiple employers and get a fair pay rate for yourself, you now only have 1 or 2 options. This gives the companies more power to pay lower wages. Why would the company pay more than minimum wage if the workers have no other option? \n\nIn a situation where the workers don’t have the means to negotiate fair pay, the government helps by setting a minimum wage.",
            "title_similarity": "0.85489076",
            "sentiment_compound": -0.4144
        },
        {
            "id": "hfhlajo",
            "score": 5,
            "text": "Employers always try to offer what the market will bear. That's why it's a market. If that price is the minimum wage \"too often\" (whatever society deems that to mean), then the only way to make that happen \"less often\" would actually be to *lower* the minimum wage, so a lower fraction of people have a market price below it.\n\nThat's probably not the unintended consequence you're looking for. \n\nThat's because an excess of minimum wage jobs (which there isn't really... it's a very small fraction of the market) would indicate that supply and demand says a lot of workers are actually being paid *more* than their \"fair market price\". \n\nThat's why we *have* a minimum wage: to set a minimum market price so that supply and demand doesn't result in a race to the (even lower) bottom where people are toiling for so little it isn't even worth the experience they are gaining by working, much less living on.",
            "title_similarity": "0.86254406",
            "sentiment_compound": -0.4906
        },
        {
            "id": "hfhm1mi",
            "score": 5,
            "text": "Being in the alternative living community, I know that the term “living wage” is close to meaningless. What wage it will take for you to live will drastically vary depending on how you live. There are a lot more options than most realize is possible.",
            "title_similarity": "0.64420855",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfhpndm",
            "score": 2,
            "text": "Those are two sides of the same problem.\n\nWages are determined by demand for skills. If an employee is deemed sufficiently replaceable, wages remain low and employers have maximum leverage over employees. If they are not and there is competition between employers for employees, wages rise and employees have more leverage over employers.\n\nThe purpose of minimum wage is to arrest downward pressure on wages for \"unskilled\" workers, i.e. those who can be arbitrarily replaced with someone else off the street. \n\nThere is no way to decide what should and should not be a minimum wage job because it ultimately comes down to the availability of workers willing to work for an employer for a given wage.",
            "title_similarity": "0.9017942",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hfhrowj",
            "score": 2,
            "text": "Most reasons for situations and problems in capitalism are greed related.  \nWhy do you think people and corporations dodge taxes or commit fraud?",
            "title_similarity": "0.63392806",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hfhssuf",
            "score": 4,
            "text": "The employer is not setting the wage unless they are willing to do it for the whole area.  The employer is paying a market wage based on the job and the location.  If you own a fast food restaurant and you are paying $8/hr when everyone else is paying $12/hr, you will find yourself without quality employees, or any employees at all.  If the factory down the street starts paying $16/hr for low level jobs, everyone will jump ship from the fast food places, to go work at the factory.  If the fast food restaurants want to stay in business, they will have to raise their salaries to be competitive in the market.\n\nNow, an employer can set a higher wage than necessary to fill positions with quality people, take employees from competitors, etc., but it is a lot more difficult for them to lower the wage of an area, if they need to fill positions or if they need any sort of skill, unless unemployment is really high and people will take anything they can get.",
            "title_similarity": "0.8210021",
            "sentiment_compound": -0.8857
        },
        {
            "id": "hfhtbr4",
            "score": 2,
            "text": "Does any place even hire for minimum wage anymore?  Just the other day, I saw that McDonalds is hiring with a starting wage of $14 an hour, and I don't live in a very high cost of living area.",
            "title_similarity": "0.62535983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhuywg",
            "score": 2,
            "text": "What distinguishes jobs that could/should be minimum wage from those that shouldn't, in your eyes?",
            "title_similarity": "0.64628506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhvzj4",
            "score": 14,
            "text": "Here in France, the minimum wage is called the [SMIC](https://www.service-public.fr/particuliers/vosdroits/F2300). We index it to purchasing power every year, so naturally it increases every year.\n\nBecause of this (and low interest rates), in most of France (not huge cities like Paris or Bordeaux), [you can afford to buy a house on minimum wage](https://www.connexionfrance.com/Practical/Property/What-you-can-buy-on-the-Smic). It's not a great house, but it's a house.\n\nMany people assume that this means that businesses will be uncompetitive, but for minimum wage jobs, these are local jobs and the businesses can't exactly source cheaper candidates from far away. Given that these are often jobs such as janitorial, food worker, or similar positions, not only are these local workers, but people *want* local businesses like this because consumers also often can't leave for \"cheaper\" businesses just because they want to eat at a restaurant.\n\nAs a result, [France still maintains the world's seventh largest economy](https://en.wikipedia.org/wiki/Economy_of_France) because you can't outsource all work to remote positions.\n\nSince we know businesses will underpay when they can get away with it, having a livable minimum wage not only protects workers, but businesses can survive with it. Here in France, we've been doing this for decades and it works nicely.\n\nBonus: full-time in France is 35 hours a week. Since the SMIC is indexed to poverty, working full-time in France automatically puts you just over the poverty line and into a livable wage. You can buy a house, enjoy life, and not scrape by, desperate to survive.",
            "title_similarity": "0.640566",
            "sentiment_compound": 0.7676
        },
        {
            "id": "hfhw8lo",
            "score": 2,
            "text": "Where I think where your argument has merit is in the example of EMS workers whom are pretty commonly paid minimum or close to minimum wage. However, I think more reasonable people would agree that, without claiming what the minimum wage should be, there are jobs that do deserve to be minimum wage. Some quick examples where I would expect minimum wage to be the entry point would be the fast food restaurant or convenience store clerks. Both of these jobs should be privy to increases in pay so as not to stay at minimum wage, but for the amount of work done and skill required, I would expect them to be on the starting level of pay. \n\nI'm not sure if your argument entails that minimum should be raised or that it should be uniform across the country, but there quite clearly needs to be an entry point for wages and it makes sense for the entry point to be the minimum. You wouldn't want employers to be able to give out reverse-raises and lower your pay, so why have a minimum wage if there aren't some jobs that start there. Perhaps you meant more that there are specific jobs that are currently receiving minimum while being worth more than minimum wage provides.",
            "title_similarity": "0.79981065",
            "sentiment_compound": -0.4189
        },
        {
            "id": "hfhx8yo",
            "score": 3,
            "text": "I'd argue that economically, the majority of minimum wage workers are actually overpaid.  In a true free market, a lot of positions that you feel may deserve more than minimum wage would likely be paying less than the current minimum wage.  Because minimum wage just puts a floor on the regular supply and demand of the labor market.\n\nNow don't get me wrong, I think this is a good thing.  And I have a feeling this isn't really the argument you're going for.  But irregardless of what you individually may feel a job is worth, the minimum wage is actively preventing many jobs from paying even less.",
            "title_similarity": "0.8534025",
            "sentiment_compound": 0.8395
        },
        {
            "id": "hfhyyys",
            "score": 2,
            "text": "Okay raise wages.    Then watch all the prices magically increase -  and small businesses magically disappear",
            "title_similarity": "0.61871517",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfhz61z",
            "score": 1,
            "text": "While this doesn’t get *exactly* at your premise that employers try to make every job minimum wage, [in 2020 only 1.5% of workers earned at or below the minimum wage](https://www.bls.gov/opub/reports/minimum-wage/2020/home.htm). \n\nSeems to suggest most jobs are *not* paying minimum wage.",
            "title_similarity": "0.7491863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhzfvk",
            "score": 2,
            "text": "My states min wage is $7.25. The lowest earners make $14. Choose a company that takes care of it's people",
            "title_similarity": "0.6587768",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hfi09au",
            "score": 2,
            "text": "> If a company can’t survive by paying people properly for their time, it shouldn’t survive at all. \n\nI don't agree.  I think you're focused on big businesses with lots of employees and lots of money flowing around with \"big bosses\" and the like.  Instead, let's try to understand the situation of someone running a sole proprietorship, but who's too busy to do everything, like bookkeeping, sales, service, \"manufacture\", etc., like in a cookie making business.  You might say that she should use some of the revenue to farm out some of the work that's not the sole focus of the business, like the bookkeeping, to some outside accounting firm.  Does it sound reasonable that the government should mandate that the accounting firm be required to charge more than a minimal rate for bookkeeping work?  What if you think, with your awesome numerical skills and lack of expensive education, that you can do it more cheaply, say by better using technology and youthful energy?  Sanely, there is no price control for bookkeeping work, and you might well get that gig.\n\nBut maybe contracting another company to do that bookkeeping has its disadvantages (like availability, expense, non-flexibility, privacy, whatever).  What the cookie-business owner would prefer is some kind of assistant who could do that work.  Life is hard and uncertain for these small (micro) businesses.  Why should the government be allowed to mandate a certain price control for labor, but not for contracted-out services?  Or should all prices be government controlled?  In which case, we have the famous \"economic calculation\" problem (which governments spectacularly fail at).  \n\nI think it's immoral that the cookie business can't hire someone at a mutually agreed upon rate.  I think it's immoral to demand that someone who's too unskilled or inexperienced or has criminal record can't attempt to better themselves by working for whatever wage they can find.  I think the minimum wage is a convenient way for the already safely employed to reduce competition.  If, after we consider the amounts people earn, they're still too poor, it's an entirely separate question about how to help them.  The cookie-business owner shouldn't have to bear that burden all by herself.  The people who want that policy should, and they can if they want.",
            "title_similarity": "0.82246804",
            "sentiment_compound": -0.3867
        },
        {
            "id": "hfi09uz",
            "score": 2,
            "text": "I think that you are spot on... but that doesn't really help anything, unfortunately. We have these laws, and others like them, for exactly that reason. An employer is of course going to try and do whatever it takes to make a profit. Pay less for supplies, carry less overhead, find insurance discounts, look for green incentives, seek out tax loopholes. This is not evil, this is business and competition.\n\nThe laws are there to bound these boxes. Ensure that there are universal maximums and minimums to allowances or loopholes or options. Make sure that a low end to wages comes up appropriately with costs of living over time that employers are not paying attention to as closely.  Continuously reform and add/subtract to tax or insurance laws, incentives, etc.\n\nPerhaps you are suggesting that there just shouldn't be universal regulation on wages at all and it should be some ideal wage based on time and work quality alone. But if you look at places where that is closer to the case, the opposite happens, The wages fall and the economy dips and it's not good. In fact, many US companies will use these jurisdictions for workers so they can milk exactly that.\n\nIt is too complex and employers are too used to the rules for that to just work. It makes sense to rely on local governments, who are already in tune with their people financially, the local costs of living, etc, to guide the low end to ensure it all stays fair enough to keep their local economy moving.\n\nOr perhaps min wage should be MORE complicated, in that it takes into account age or experience somehow. I have thought about this a bit before, but it seems messy. And then I fear you are giving TOO much government overreach into how a company is run.\n\nAs things stand though, I think you are under crediting the fact that employers also need to pay for the quality of workers they want. Or, this is not a universal issue, and it only really shows its ugly face with workplaces where, to be frank, experience and age really don't matter that much. Fast food, cashiers, line workers... They just want to minimize turnover to minimize paperwork and training regimens so they need to find the minimum raise policy that keeps people on board for an ideal amount of time. The people, from a work output view, are pretty replaceable.\n\nMaybe when all those jobs get taken over by robots, the issue get less? haha",
            "title_similarity": "0.81311834",
            "sentiment_compound": 0.9709
        },
        {
            "id": "hfi0fc0",
            "score": 2,
            "text": "Why do people just assume that it's only the employer who is setting the wage? The government sets a wage, the employer wants a wage, the employee wants a wage. All negotiated. Just like I did at my current job. People need to read some econ books.",
            "title_similarity": "0.7539222",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfi1cjc",
            "score": 2,
            "text": "One of the things about minimum wage isn't necessarily that employers try to make every job \"minimum wage\". Others ITT have provided statistics regarding the percentage of jobs in the US that actually pay the federal minimum wage, and it is very low. The thing about minimum wage is that it sets the market for many other non-minimum wage jobs.  \n\nLet's consider the current push for a $15/hr minimum wage. The current federal minimum wage is $7.25/hr. So, a $15/hr wage is more than double the minimum wage! That's great, right? Well, no, not really. $15/hr equates to only a shade over $31k/yr, which is still not nearly enough to live on when the average rent for a 2br apartment is $1500/mo. However, $15/hr is attractive to workers ONLY because of the fact that it's \"more than double the minimum wage.\" If the federal minimum wage was $15/hr, then a current $15/hr job would need to pay $31/hr to remain proportional. Obviously that won't happen, but it would likely increase to around $21/$22/hr, which is significant. The phrase \"A rising tide lifts all boats\" applies here.",
            "title_similarity": "0.77695113",
            "sentiment_compound": 0.8124
        },
        {
            "id": "hfi38zw",
            "score": 2,
            "text": "No the problem is employees have been stripped of all leverage via immigration, offshoring, technology, women being encouraged/forced into the job market on mass and union busting.\n\nIt's literally the role of the employer to try to pay as little as possible and the role of the employee to try to get paid as much as possible. The problem is the government has been putting it's finger on the scale for decades in favor of corporations with it's various policies, allowing one way free trade with china and other 3rd world countries, mass immigration, messaging in school telling women not to start a family and instead enter the workforce and various programs to encourage that ect. \n\nThe whole minimum wage/living wage thing is a red herring to distract us for the real solutions.",
            "title_similarity": "0.7908165",
            "sentiment_compound": 0.6964
        },
        {
            "id": "hfi64sv",
            "score": 3,
            "text": "I'm an owner in the construction industry.  Minimum wage is not a concern because I don't set labor prices.  \n\nTHE MARKET SETS LABOR PRICES\n\nThat's what most laymen misunderstand about owning a business.  They think we are just rolling in dough and could pay our people $100/hr IF WE WANTED TO, but don't because we are evil.\n\n If I don't pay enough, the employee walks and works for a competitor.  This is true in any industry from burgers to bridges.\n\nWhat keeps wages relatively low in my industry is the endless supply of labor coming through our porous southern border and desperate/hungry laborers willing to work for cash.",
            "title_similarity": "0.83629453",
            "sentiment_compound": -0.7714
        },
        {
            "id": "hfi68sb",
            "score": 1,
            "text": "Is minimum wage $12 for you?",
            "title_similarity": "0.41956347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi7s23",
            "score": 3,
            "text": ">it’s “why the hell is that considered a minimum wage job?”\n\nBecause those in power have always been strongly anti-union.\n\n[Violence was the go-to approach for unionized workers](https://en.wikipedia.org/wiki/History_of_union_busting_in_the_United_States) but in more recent decades the focus shifted to bombarding everyone with anti-union propaganda.  Workers need the collective bargaining power unions provide in order to negotiate for fair wages, and for the most part we don't have that these days.",
            "title_similarity": "0.81947005",
            "sentiment_compound": -0.5187
        },
        {
            "id": "hfi8th1",
            "score": 2,
            "text": "Employers do this because they can. \n\nThe point of the minimum wage is to make sure they can't.\n\nDo you have a public policy proposal? A vague sense of \"this shouldn't be entry level\" is unenforceable, except through people refusing the job. In slack labor markets people can't afford to refuse the job.\n\nThe point of a minimum wage, or guaranteed minimum income, or similar proposals, is to bend the supply curve on labor, so employees have more power to say no to exploitative situations.\n\nI suppose one could mandate a part scale distribution within an organization, but that would ignore that the experience and labor makeup of a fast food joint is very different from that in an engineering firm.\n\nI do like the idea of controlling the ratio between the top and bottom earners in any particular organization.\n\nAlso while people do \"non-minimal\" work for minimum wage, of we agree everyone should get a living wage that's sort of irrelevant.",
            "title_similarity": "0.8621927",
            "sentiment_compound": 0.5986
        },
        {
            "id": "hfibyw2",
            "score": 2,
            "text": "I wont help: we are advocating for 15$ an hour minimum wage in my country. I have seen translator job at 15$/hour when they ask for the bachelor or the professional master and mark as a plus the membership to the professional organization (which is over 721 dollars annually plus a once in a lifetime mentoring fee of 800 dollars). So yes, people are trying to pay the minimum for any job.",
            "title_similarity": "0.7161257",
            "sentiment_compound": 0.2103
        },
        {
            "id": "hfidamj",
            "score": 1,
            "text": "How high should it be?",
            "title_similarity": "0.08097295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfikf1g",
            "score": 2,
            "text": "Simply don't take a minimum wage job *facepalm* I know this isn't the answer you're looking for but there are plenty of jobs $15 and up with no experience needed.",
            "title_similarity": "0.7164269",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hfikk2g",
            "score": 2,
            "text": "*a feature, not a bug*",
            "title_similarity": "0.02091018",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfil3su",
            "score": 1,
            "text": "There is actually a pretty good reason why a lot of jobs are minimum wage when they shouldn't be.\n\nSay, you are working at a fast food joint for a nice salary, something like $20/hr and I desperately need a job with many other people who need it too. We go to the fast food joint to say that we can work for a lower wage like around $15/hr just so we can get work, even if it is at a lower wage. Now the company will of course hire me and the others cause we're accepting less money as long as we get the job.\n\nThis is a major reason why a lot of jobs become minimum wage jobs cause there aren't many jobs and too many people. Simple a case of supply and demand, if you think about it.",
            "title_similarity": "0.787884",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hfim4jl",
            "score": 2,
            "text": ">Everybody should be able to live off of what they can earn from a week’s work.\n\nThe problem is, minimum wage in the US isn't enough to support a reasonable standard of living while working a reasonable number of hours.\n\nThe entire idea of minimum wage is that it should allow someone and their family at a minimum standard of living. The problem is that Cost of Living has massively outpaced minimum wage.\n\n>“why the hell is that considered a minimum wage job?”\n\nThis is a true enough point in many cases, but if we accept the premise that everyone deserves to be paid fairly for their work, there should be no exceptions to that. It doesn't matter what the job is. \n\n\nYou might be interested in Universal Basic Income (UBI). It's a system in which everyone receives payments to support themselves regardless of any other circumstances. Essentially, universal welfare. \n\nPersonally, I'd be fine with no minimum wage at all if there were a robust UBI infrastructure to ensure a reasonable standard of living without it. Workers could negotiate for themselves if they can't be coerced through the threat of extreme poverty. \n\nIn our system, minimum wage is there to put a limit on how severely workers can be exploited. We have a responsibility to our society to make sure that the protections we have are substantial enough. In our current system, that means making sure that minimum wage keeps up with the cost of living.",
            "title_similarity": "0.94797677",
            "sentiment_compound": 0.035
        },
        {
            "id": "hfioidu",
            "score": 2,
            "text": "If an employer sets the wage at the legal min they have a right to do so it’s not abuse if people don’t want to do the work for them wages then the company would go out of business you don’t like it don’t work for them try get a higher paying job but don’t just expect because you may have a uni degree that you deserve more pay.",
            "title_similarity": "0.85685533",
            "sentiment_compound": 0.3456
        },
        {
            "id": "hfiq87d",
            "score": 1,
            "text": "\"It's not just that the minimum wage is too low...\"  And \"...everybody should be able to live off what they can earn...\" \n\nCan you see that that makes no sense?  If a person is earning the federal minimum wage, they are not making enough money to live off.",
            "title_similarity": "0.8385609",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hfiuk9e",
            "score": 2,
            "text": "It's both.",
            "title_similarity": "-0.08078848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfiw0dv",
            "score": 3,
            "text": "I am just saying, every trade I know is desperate for people right now. Minimum you are getting paid is 25 plus an hour after your apprenticeship.  Or start as an underground miner and skip the apprenticeship altogether.\n\nThere is money out there but you need to be willing to live in a very small town or do camp jobs.",
            "title_similarity": "0.8051983",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hfixpyn",
            "score": 1,
            "text": "It's not that employers try to make every job minimum wage. It's that they are now able to do so, and there are still enough people in the job market to take their low paying jobs.\n\nThe blunt truth nobody wants to listen to is that society and human civilization has changed quite drastically in the last several decades. Everyone tries to find the easy scapegoats - some blame the boomers, some blame the evil capitalist overlords. But the truth is, the evil capitalist overlords were only more evil a few decades ago, not less evil. They would exploit you, leave you in the street if you body broke down, would exploit your children as slave labor, would brutally suppress any employee rights movements or attempts at labor strike etc.\n\nThe truth is that the world shifted dramatically from a manufacturing economy to a service economy and then to a knowledge economy. Those who had the knowledge based skills or had the ability to adapt/retrain to this seismic shift survived and thrived. Those who didn't adapt got relegated to the bottom rung jobs. Thing is, the jobs that were considered safe and secure and decent earners now became bottom rung jobs.\n\n> “why the hell is that considered a minimum wage job?”\n\nBecause it IS a minimum wage job. Now. It may not have been earlier but it is now. That's what society and the market values it to be. That's what the supply/demand dynamic tells us to be so. It is not a sinister conspiracy, it is not the evil conniving machinations of a few people, it is just plain and simple change.\n\nAnd evolutionary ability is not so much determined by who is the strongest or fittest, but instead by who is the most adaptable.",
            "title_similarity": "0.869233",
            "sentiment_compound": 0.8751
        },
        {
            "id": "hfiy9kv",
            "score": 2,
            "text": "(Caveat: this is written for an American audience)\n\n> \"Everybody should be able to live off of what they can earn from a week's work\"\n\nI strongly agree with you.\n\n> It's that employers try to make every job minimum wage.\n\nI'd argue that this _should_ be a good thing, and only isn't because the labor market doesn't fit normal healthy capitalism rules.\n\nThe labor market is just like any other market, and contains a supply and demand curve. The labor demand curve comes from employers - each job has some amount of value that it generates, and this is the maximum an employer will pay. If they pay you more, they would lose money on employing you, and not want to hire you in the first place. The labor supply curve comes from workers - each person has some minimum for which they are willing to work, and will refuse to work for less. The equilibrium price is where wages are set - the \"halfway\" point between what an employer is willing to offer and what an employee is willing to take (it's not actually halfway, something something slopes of curves).\n\nAt first glance, that looks great! Competitive markets work great under that model. The problem is that the labor market _isn't_ competitive - the employer can freely walk away from a deal if the employee demands too much, but the employee must work or starve. _EDIT: Also, work depends on location - a worker in Omaha can't benefit from a good job market in Minneapolis._ With automation and capitalism generating unearned wealth for the already wealthy, this imbalance gets even further pronounced. It seems pretty clear to me that laborers need work more than work needs laborers.\n\nThere's a few fixes that I've heard suggested to fix this problem:\n\n(1) Compensate for the broken labor supply curve by mandating a minimum wage that's above the market point, but below the maximum feasible wage at which businesses can operate.\n\nThe burden is placed on business owners, which is great for megacorporations like McDonalds but less great for your neighbor's small business who can't afford the new minimum. _EDIT: It's also impossible to pick a number that applies both to a teenager in Wichita and a single parent in San Francisco, so at some level you need to either rely on local rates or make a lot of people very unhappy._\n\n(2) Remove unhealthy \"work or die\" pressure on laborers.\n\nUBI, food stamps, lowering rent/medical/food costs, increasing worker mobility, etc. We saw this work in 2021, the whole \"great labor shortage\" thing. The burden is placed instead on taxpayers, which is great assuming an equitable tax burden but less great if the mega-wealthy can disproportionately dodge the taxes. _EDIT: Picking an appropriate UBI number here is also difficult._ _EDIT 2: Lowering rent/medical costs screws over investors/landlords/medical bloat, but... fuck them, I'm okay with that_.\n\n(3) Artificially add demand to the labor market to raise the equilibrium price.\n\nInstead of just cutting people checks, the government (or whichever entity) creates jobs just to create jobs. This has worked in the past, but IMO brings the worst parts of (1) and (2) together.",
            "title_similarity": "0.9008254",
            "sentiment_compound": -0.7582
        },
        {
            "id": "hfj4ls8",
            "score": 2,
            "text": "Employers definitely don’t try to make every job minimum wage. This doesn’t even make sense. I’m America, nearly every single industry(that a normal working class American can participate in) is highly competitive. If employers could simply keep more profit at the cost of reducing or keeping wages low, another employer would take their profits and have a larger work force.\n\nThe only way what you’re claiming could even be remotely true is if every industry had a complete monopoly on wage rates, which we all know they don’t. Unskilled people are being paid what a company can pay them based on the revenue they produce. No artificial wage inflation will change this basic economic principle.",
            "title_similarity": "0.8401671",
            "sentiment_compound": 0.8354
        },
        {
            "id": "hfj77gl",
            "score": 1,
            "text": "Inflation is the issue. The dollars value just keeps going down, but employers don't pay more to make up for it",
            "title_similarity": "0.8110019",
            "sentiment_compound": 0.2833
        },
        {
            "id": "hfjauou",
            "score": 1,
            "text": "Most companies that are big enough to make an impact, have hundreds to thousands of stores. McDonalds, Taco Bell, Albertsons, etc.\n\nIf one of them raises their local starting wage, it impacts the market and spreads the problem to their other locations. That means they are incentivized to keep the starting wage as low as possible even if it means running a failing location. Most people are brand blind anyways, and will go to certain stores because that's what they always go to.",
            "title_similarity": "0.7300407",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hfjgnmg",
            "score": 2,
            "text": "Not everybody needs to live off what they earn. For some the experience, training and ability to demonstrate that they can be a reliable employee to future employers is far more beneficial.\nIf you have never had a job, you have no experience, no skills and no ability to 'stand out'. The minimum wage effectively prices them out the market and they find it very difficult to get a job. \n\nThe people that fall into this category are typically teenagers and students, trying to earn a little extra spending money as well learn valuable life skills that will benefit them in future careers, or someone coming off a long stint in prison or job seekers allowance.\n\n\nThe only thing they can do to 'stand out' to potential employers is be wiling to work for less. A higher minimum wage prevents this. Thus, as no employer would take a zero skilled, zero experience, zero ability to even show they are able to turn up on time person over someone who has had previous jobs, these individuals struggle to get work. And thus, as they need a job to demonstrate these basic skills, get stuck in unemployment. \n\nA lower minimum wage allows flexibility here, these people will then gain skills, training etc and can move up so that when they need to support themselves and a family they can. Otherwise, with high minimum wage they stay in unemployment.",
            "title_similarity": "0.8038748",
            "sentiment_compound": 0.7028
        },
        {
            "id": "hfjiu3f",
            "score": 1,
            "text": "Here’s the thing. The amount of workers who actually work at or below minimum wage was 1.9% in 2019. \n\n>\tAccording to the Bureau of Labor Statistics (BLS) 1.6 million workers, or 1.9% of all hourly paid, non-self-employed workers, earned wages at or below the federal minimum wage in 2019.\n\nThat includes people like restaurant staff who work off tips so it’s really less than 1.9%. \n\nhttps://usafacts.org/articles/minimum-wage-america-how-many-people-are-earning-725-hour/\n\nSo it really isn’t the gigantic issue people are saying it is. Even McDonald’s (the usual example of poor pay) pays an average of $11. Which is $3 more than minimum. \n\nhttps://www.glassdoor.com/Hourly-Pay/McDonald-s-Crew-Member-Hourly-Pay-E432_D_KO11,22.htm",
            "title_similarity": "0.6879691",
            "sentiment_compound": -0.25
        },
        {
            "id": "hfjk0hq",
            "score": 2,
            "text": "Maybe it's because a lot of jobs do worth less than the minimum wage?",
            "title_similarity": "0.678722",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hfjs1dk",
            "score": 1,
            "text": "Why would employers try make their own job minimum wage?",
            "title_similarity": "0.73847854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjunvs",
            "score": 2,
            "text": "I agree. I'm an ocean rescue lifeguard and my job requires me to have an EMT to keep my employment and yet the starting salary is only $4 more than minimum wage in my state (FL). They wonder why we have a problem hiring people and yet they don't realize that not only do we have to be in really good physical shape, we also have to be able to provide medical interventions that are above basic care. We compete with minimum wage jobs and yet the job requires a highly specific skill set. I'd love to see any employee in my city attempt a rescue from a rip current that doesn't work ocean rescue. I'd bet my left nut that they would also have to be rescued.",
            "title_similarity": "0.7095673",
            "sentiment_compound": 0.9523
        },
        {
            "id": "hfjxqdp",
            "score": 2,
            "text": "It follows a simple economic rule, supply and demand. There is an overload of low skilled employees wanting to work this jobs, yet there is no where close to enough demand of these jobs. This creates a supply and demand graph what has quite a low equilibrium point, but is kept artificially high with a binding price floor (aka minimum wage) \n\nIf you want to increase wage without increasing minimum wage you need to increase the amount of jobs. Theres no other logical way",
            "title_similarity": "0.8855869",
            "sentiment_compound": -0.0262
        },
        {
            "id": "hfk26sl",
            "score": 1,
            "text": "You have to look at it from the employers perspective and how expensive it is just to open the doors and operate everyday… if you want to make it easier for them to raise their employee wages then get the government off their backs… it’s not that they’re trying to screw their employees… they’re getting screwed too… this is especially true in the small business world.",
            "title_similarity": "0.8922443",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hfk5p2z",
            "score": 1,
            "text": "what country are you referring to?",
            "title_similarity": "0.027240977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfka0pi",
            "score": 1,
            "text": "What world do you live in? Starting wages around here are nowhere near minimum wages. No experience off the street you can make $12. Just have to show up and get the job done. Bagging groceries is $11.50! Confused what experience you’ve got that makes you think that.",
            "title_similarity": "0.71629053",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hfkcfqy",
            "score": 2,
            "text": "> Everybody should be able to live off of what they can earn from a week’s work.\n\nThis is the view I want to try and change as the labor market and relative value are far more complex, making this:\n\n> Every time I see a discussion of minimum wage someone gives an example of a job that is horribly underpaid at (say…) $12 an hour. \n\n... a far more complicated question.\n\nLet's say that you have a nail salon which employs people to do nails. My girlfriend might visit that salon once a month to get her nails done and be willing to pay upwards of $75-100 each time. For her, this is the relative value she assigns to that service. For me, who has never had my nails done, the value I assign to that service is far lower.\n\nLabor is just the aggregation of that concept across the population. A certain percentage of people are willing to pay money for a given service, and that number of people and amount fluctuates given demand, supply, opportunity cost and other econ 101 keywords.\n\nMost activities that we think of as jobs are completely arbitrary. Imagine a completely useless activity like picking dandelions or harvesting guppies. There may be a few people who value that service, but in general, not many do. Should a person who spends 40 hours a week harvesting guppies be able to live comfortably? It's a concept that feels nice, but ultimately, without someone willing to pay for that service, the service has no value and therefore the person performing it doesn't earn anything for their time.\n\nNow obviously, most of the jobs that you would be thinking of DO provide a valuable service. However, the issue here is one of supply. With a few hours of training, most people can work a cash register, stock a warehouse, or answer the phone. The value of that labor is diminished simply because there is so many people available to supply it that the employer, acting in their own interest, would be more likely to hire the people willing to work for the least amount (much the same way that the employee with multiple offers would likely take the higher paying offer).",
            "title_similarity": "0.8142697",
            "sentiment_compound": 0.9609
        },
        {
            "id": "hfkcwpi",
            "score": 1,
            "text": "It's the employees job to make their employers pay them as much as the employee wants. \n\nHaven't heard about salary negotiations?\n\nThe trick is that salary negotiations can only happen if the job demands a valuable, marketable skill and the employee has that skill.\n\nMinimum wage jobs doesn't demand any particular skill. These are jobs that any normal person can do.\n\nAnyone can't program a software, that's why software programmers can negotiate their salary.\n\nA cashier's job can be done by anybody, that's why he can't negotiate his salary. He does not have any say in his salary.\n\nMinimum wage jobs will be minimum wage jobs because supply of minimum wage workers is extremely large while demand is limited.",
            "title_similarity": "0.83653104",
            "sentiment_compound": 0.0532
        },
        {
            "id": "hfkg1nj",
            "score": 2,
            "text": "Even if the number of minimum wage jobs decreases, that still doesn't change the fact that there will still be *some* jobs which grossly underpay their employees.",
            "title_similarity": "0.7503598",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hfklc6f",
            "score": 2,
            "text": "This is so accurate. I was a firefighter/medic/ocean lifeguard for most of my twenties and never made above $12-15/hour, depending on the role. There are *so* many other examples, but that’s always the first that comes to mind, and some people don’t even believe me when I tell them. I also worked in emergency departments, psych units, rehab centers etc. and never made more than $15/hr to include in a federal and then a state position. I count the fact that my body isn’t any longer physically capable of that work as a blessing. New field, livable wage in an entry level role.",
            "title_similarity": "0.6091665",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hfkq2f6",
            "score": 1,
            "text": "If a job requires a skillset that requires minimal training- there's no way that job will be above minimum wage since literally any random person can do it.\n\nI'm not in the US but from the UK and I work as a junior doctor. When I was younger I worked in a nursing home. I can tell you that generally, my shifts working in the nursing home on average were more busy that my average day of work as a junior doctor. (Out of hours/on-call work being the exception)\n\nI also think care assistants/carers in nursing home are a vital job for the economy and requires a motivated and empathetic group of employees since the job is demanding.\n\nThe catch? It required 2 days of training to be able to be a fully functional worker.\n\nIf the job is low skill and you can train to do it with minimal amount of time and with no prior understanding or knowledge of the sector, there's no justification for having the wage be higher.",
            "title_similarity": "0.7435473",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hfktxh0",
            "score": 2,
            "text": "The Federal minimum wage is so low it’s insulting. But the problem is that it’s so low that companies will start people at, say, $10-$12 an hour (which is still too low to survive at 40 hours a week) and then they act like they’re doing you an incredible favor by paying more than the minimum. Like they’re bending over backwards and paying you a fortune, with the implication being that you owe them an incredible debt because of what they’re doing for *you*. \n\nAnother big part of the scheme is that they work everyone 35-39.5 hours a week, because at that level you’re still technically working part-time. At 40 hrs/week you’re entitled to benefits under the Affordable Care Act. At my last job working for a corporation, they were so serious about hours that employees and managers could be written up, suspended, and even fired if part timers worked 40 a week regularly. And if we worked overtime? That could get you into some real shit. I saw managers fired because they were “giving their people too many hours”. Now, these people’s departments worked better than any other— but that’s not the goal. The goal is to squeeze out as much profit at as little cost as possible.",
            "title_similarity": "0.8038775",
            "sentiment_compound": -0.8758
        },
        {
            "id": "hfkwt7w",
            "score": 1,
            "text": "Business owners want to get the most bang for their buck. Especially as increasing the wage of 10 employees by $1000, means $10,000 out of their own pocket in profits. Because the value of staff quality and retention is harder to measure, the majority of people in power will pay the minimum. \n\nThe supply demand of capitalism favors those with power, not what's fair. Minimum wage is an artificial force to shift things from reality to ideal.",
            "title_similarity": "0.8037688",
            "sentiment_compound": 0.7985
        },
        {
            "id": "hfl6da9",
            "score": 2,
            "text": "It sounds like you're unaware what minimum wage is. Federal minimum wage is $7.25 so you're example of \"$12\" is almost double that. That's right, minimum wage is so low that even an embarrassingly low amount is almost double.\n\nAlso it's been over a decade since it was last raised, which historically is unheard of, and it's been one of the toughest decades, financially speaking, to date.",
            "title_similarity": "0.65121055",
            "sentiment_compound": -0.7304
        },
        {
            "id": "hfla0cg",
            "score": 2,
            "text": "This is so true! Just recently I applyed to a job that required a degree in social sciences or else. Personally, I have studied Sociology and Political science and gotten a Bachelors degree, so that was a good fit. Turns out they didn't wanted to pay a penny above minimum wage. I was supposed to help them with research and putting up power point presentations et cetera and not walk their dogs or something. What the fuck?",
            "title_similarity": "0.6995498",
            "sentiment_compound": 0.8318
        },
        {
            "id": "hflhv9h",
            "score": 1,
            "text": "If a wage can’t support basic needs because cost of living has increased so much while the minimum wage hasn’t then it’s too low",
            "title_similarity": "0.7449789",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hflsvlf",
            "score": 1,
            "text": "So wage pricing is based on supply and demand, but only to an extent. There is also the issue of marginal revenue compared to marginal cost. Forcing a higher minimum wage takes wages from higher marginal revenue jobs (like what you wouldn’t consider minimum wage, or more skilled labor) due to a higher wage required for those who don’t make as high marginal revenue. So by raising the minimum wage, you’re decreasing income of the next rung up. To give an example, let’s say you’re a manager of a McDonald’s. Each cashier has a marginal revenue of $10 an hour, cooks have a marginal revenue of $15 an hour, and janitors have a marginal revenue of $3 an hour. In this scenario, we can say that the marginal revenues align pretty closely with skill required and that wages should be distributed appropriately. Now we raise a minimum wage of 7$. 3 things could happen. We could raise janitors wages and operate at a marginal loss, we could fire janitors and distribute the tasks to remaining employees, or we could raise the wages of janitors at the expense of other employees. In my experience they are in that order of frequency \n\nObviously a simplistic example, bc in reality marginal revenue is created from the product and not service staff, but I think it illustrates why some higher skill people are being dragged down. I hope the example was helpful, but you can also notice this through statistics. For example [this study](https://www.google.com/amp/s/hbr.org/amp/2021/06/research-when-a-higher-minimum-wage-leads-to-lower-compensation) showing a minimum wage increase of 7.25-9 results in a decrease in total compensation of 23%. \n\nSo I don’t disagree that many people deserve higher wages, but the connection to the minimum wage is a little different than is advertised. Regulation in economic systems have complex and far reaching effects, that cannot be simply legislated away. The minimum wage has a negative effect on workers and the economy at large.",
            "title_similarity": "0.7747973",
            "sentiment_compound": 0.6765
        },
        {
            "id": "hflyj7c",
            "score": 1,
            "text": ">If a company can’t survive by paying people properly for their time, it shouldn’t survive at all.\n\nI totally disagree with this. But first, a definition - properly: by properly I would think that you mean a liveable wage.\n\nMy view is that people can choose to work at that specific company, or they can choose to work somewhere else. If they have no choice but to work at the place that doesn't pay them \"properly\" then clearly, their skills are not appreciated as much and are therefore worth less to companies.\n\nOn top of that, some businesses may struggle at the start or during a hard time, like during covid. If they have to close, then any future jobs at the businesses are gone. People won't work, but they also won't get paid a single cent. What's worse? Working for a job that doesn't pay good or not working and not earning anything?  \n\nLet's say you have bills to pay. With the first option, you can at least mitigate the damage even if your work is \"unfairly\" compensated. With the second option, you have no way to stop or reduce the damage because you're not earning anything.",
            "title_similarity": "0.8783226",
            "sentiment_compound": -0.972
        },
        {
            "id": "hfn58pm",
            "score": 1,
            "text": "Two facts:\n\n1 - The minimum wage was designed to provide a living wage, according to FDR and the FLSA of 1938. This is a matter of historical fact, not an opinion. It was expressly designed for this specific purpose.\n\n2 - The minimum wage cannot cover living expenses anywhere in the country, let alone other basic human needs.\n\nThe minimum wage IS too low, because people making minimum wage still deserve to have enough money to live.",
            "title_similarity": "0.8093868",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hikfy2y",
            "score": 2,
            "text": "The good thing is alot of employees have decided to not take min wage jobs basically forcing the companies to pay more or go out of business.",
            "title_similarity": "0.76547843",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzvodiu",
            "score": 2,
            "text": "I know I am no longer pro making minimum wage a living wage. What I am pro is setting up a \"minimum wage for skilled workers\". If an employer wants to hire a post-secondary graduate then he should pay at least 22$/h. The whole thing  is what our government allowed to create is a situation where job requirements are higher than what it was before. 30 years ago the same jobs that required only!! a high school education now are required to have Uni/college diploma. Hence, the low pay. If we force employeers to go back and hire high school grades then we will avoid the whole shenanigans of Student Debt and employeers will be free to pay minimum wage for their positions.",
            "title_similarity": "0.82724595",
            "sentiment_compound": -0.658
        }
    ]
}